{"teams":[{"id":6,"slug":"ahq-e-sports-club","name":"ahq e-Sports Club","guid":"be6c7c1d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ahq-e-sports-club-iozw902p.png","acronym":"AHQ","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-05-30T21:10:24.000Z","bios":{"en_US":"<p>ahq e-Sports Club is one of the top League of Legends teams in Taiwan, and they have consistently battled for the regional title. However, with multiple GPL Championship victories, ahq is now dead set on being the best in the world. Can they rise to new heights in 2017 and earn another spot at the World Championship?</p>\n<p>Coach: Shang-Ching \"Greentea\" Tsai</p>","fr_FR":"Ahq e-Sports Club est l'une des meilleures équipes de League of Legends à Taiwan. Elle a constamment été en lutte avec les champions du monde de la Saison 2, Taipei Assassins, pour le titre régional à Taiwan. Cependant, avec de nombreuses victoires en GPL, AHQ est sur les rails pour devenir la meilleure équipe du monde. Pourront-ils atteindre les sommets de leurs compatriotes de TPA et remporter le championnat du monde ?","pl_PL":"Ahq e-Sports Club jest jedną z najlepszych tajwańskich drużyn League of Legends. Regularnie mierzyli się w walce z mistrzami świata Sezonu Drugiego, Taipei Assassins, o tytuł mistrza regionalnego Tajwanu. Jednakże po kilku zwycięstwach w mistrzostwach GPL, AHQ pragnie zostać najlepszą drużyną na świecie. Czy uda im się osiągnąć taki sam sukces, jaki osiągnęli ich tajwańscy rywale TPA, i wygrać mistrzostwa świata?","de_DE":"<p>ahq e-Sports Club ist eine der besten „League of Legends“-Mannschaften in Taiwan. Sie haben immer wieder mit den Weltmeistern von Saison 2, den Taipei Assassins, um die Titel in Taiwan gekämpft. Mit mehreren Siegen bei der GPL Championship hat ahq jetzt jedoch nur noch ein Ziel: Sie wollen die besten der Welt werden. Können sie in die Fußstapfen ihrer taiwanesischen Landsleute treten und die Weltmeisterschaft gewinnen?</p>","es_ES":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends de Taiwán. No han dejado de luchar por el título regional de Taiwán contra los campeones mundiales de la segunda temporada, los Taipei Assassins. Sin embargo, con múltiples victorias en el campeonato GPL, ahq va camino de convertirse en el mejor equipo del mundo. ¿Podrán elevarse a las alturas de sus compañeros taiwaneses TPA y ganar el Campeonato Mundial?</p>","pt_BR":"A ahq e-Sports Club é uma das melhores equipes de League of Legends de Taiwan. Eles têm competido consistentemente com a Taipei Assassins, os Campeões Mundiais da 2º Temporada, pelo título regional taiwanês. Mas agora com diversas vitórias na GPL, a ahq está determinada a ser a melhor do mundo. Será que eles conseguirão alcançar as mesmas alturas que seus companheiros taiwaneses da TPA e vencer o Campeonato Mundial?","es_AR":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends en Taiwán. Ha luchado constantemente con los Campeones Mundiales de la 2da Temporada, los Taipei Assasins, por el título Regional de Taiwán. Sin embargo, con varias victorias de Campeonato GPL, ahq ahora está concentrado completamente en ser el mejor equipo del mundo. ¿Podrán escalar hasta la cima conseguida por su compatriota equipo taiwanés TPA y ganar el Campeonato Mundial?</p>\n\n<p><strong>Entrenador: Chen \"Backstairs\" Yan-Fu</strong></p>"},"foreignIds":{"drupalId":"949"},"players":[20,34,35,302,407,408,1019],"starters":[20,35,302,407,408],"subs":[34,1019]},{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]}],"players":[{"id":20,"slug":"an","name":"AN","firstName":"Chun-An","lastName":"Chou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/an-1zhs9hs7.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:17.000Z","updatedAt":"2017-07-06T14:32:41.000Z","bios":{"en_US":"<p>Chun-An \"AN\" Chou is a fan favorite in the LMS. His quirky personality and aggressive AD carry play style come together in an endearing package. But those same traits sometimes surprise his own teammates. Much like his teammate Mountain, AN maintains a stoic disregard for win/loss records in scrims, and will play at his own pace -- and in his own way.\n</p>\n<p>\nBut when AN finds he isn't playing well, he does what every pro player would do to get out of a slump -- blame it on a lack of exercise. The solution? Easy! Go for a run in the middle of the night. And then wake up at 9 AM and go swimming, just to be safe. Of course, all that exercise takes a toll, so he will likely end up faltering in the next day’s practice...because of too much exercise. It’s a vicious cycle.\n</p>","fr_FR":"<p>Chun-An « AN » Chou est l'un des joueurs préférés des fans des LMS. Sa personnalité excentrique et son style de jeu agressif de carry AD constituent une association attachante. Mais ces mêmes caractéristiques peuvent parfois surprendre ses propres coéquipiers. À l'instar de Mountain, AN semble ne pas du tout s'intéresser au ratio victoires/défaites lors des matchs d'entraînement et joue à son rythme... et à sa façon.\n</p>\n<p>\nMais quand AN trouve qu'il ne joue pas bien, il fait ce que tout joueur pro fait pour sortir de l'ornière : il dit qu'il manque d'exercice. La solution ? Facile ! Partir courir au milieu de la nuit. Et au réveil, à 9 heures du matin, aller nager, juste au cas où. Bien sûr, faire autant de sport, ça peut fatiguer, et il risque de ne pas briller lors des entraînements du lendemain... à cause de trop d'exercice. Un véritable cercle vicieux.\n</p>","pl_PL":"<p>Chun-An „AN” Chou to ulubieniec fanów w LMS. Jego ciekawa osobowość i agresywna gra tworzą razem wyjątkowy pakiet. Jednak potrafi on też zaskoczyć swoich towarzyszy. Tak jak Mountain, AN nie przejmuje się zwycięstwami i porażkami w meczach treningowych i gra na swój własny sposób.\n</p>\n<p>\nKiedy jednak przestaje mu iść, robi to, co każdy zawodowiec – zwala winę na brak ćwiczeń. Rozwiązanie? To proste! Wystarczy trochę się przebiec w środku nocy. A potem pobudka o 9 rano i jeszcze trochę pływania dla pewności. Oczywiście ćwiczenia fizyczne są męczące, przez co zdarza mu się słabsza dyspozycja następnego dnia... z powodu przećwiczenia. Zaklęty krąg.\n</p>","de_DE":"<p>Chun-An „AN“ Chou ist der Fan-Liebling der LMS. Seine schrullige Persönlichkeit und sein aggressiver Spielstil mit AD-Carrys ergeben ein liebenswertes Gesamtpaket. Aber mit genau diesen Eigenschaften überrascht er manchmal seine Teamkameraden. Ähnlich wie seinem Teamkameraden Mountain sind AN die Siege und Niederlagen in Übungsspielen egal, und er spielt immer in seinem eigenen Tempo – und auf seine eigene Art.</p>\n\n<p>Aber wenn AN das Gefühlt hat, nicht gut zu spielen, tut er, was jeder Profi-Spieler tun würde – er schiebt es auf mangelnde Bewegung. Und was tut er dann? Ganz einfach! Er geht mitten in der Nacht joggen. Und dann steht er um 09:00 Uhr morgens auf und geht schwimmen, nur zur Sicherheit. Natürlich muss er dann der ganzen Bewegung Tribut zollen und kommt in den Übungsspielen nicht richtig in die Gänge … weil er zu viel Bewegung gemacht hat. Ein wahrer Teufelskreis.</p>","es_ES":"<p>Chun-An ''AN'' Chou es el favorito de los fans en la LMS. Su extravagante personalidad y su estilo de juego agresivo como AD carry conforman un preciado pack, pero esas mismas virtudes sorprenden a su equipo en más de una ocasión. Como su compañero Mountain, AN no tiene en cuenta las victorias y derrotas de las partidas de práctica, así que juega a su ritmo y por su cuenta,</p>\n\n<p>pero cuando AN considera que no está jugando bien, hace lo que haría cualquier profesional para superar un bache: achacarlo a la falta de ejercicio. ¿La solución? ¡Muy fácil! Salir a correr a medianoche. Luego se despierta a las nueve de la mañana para ir a nadar y sentirse bien. Por supuesto, todo ejercicio tiene su precio, así que puede que acabe flaqueando en el entrenamiento del día siguiente por haber hecho demasiado ejercicio. Es un círculo vicioso.</p>","pt_BR":"<p>Chun-An \"AN\" Chou é o favorito dos fãs na LMS. Sua personalidade peculiar e estilo de jogo agressivo com atiradores formam um pacote perigoso. Mas essas mesmas qualidades às vezes surpreendem até mesmo seus próprios aliados. Assim como seu companheiro Mountain, AN também mostra uma negligência estoica de vitórias e derrotas durante os treinamentos e gosta de jogar a seu próprio passo e de seu próprio jeito.</p>\n\n<p>No entanto, quando AN vê que não está jogando bem, ele faz o que todo jogador profissional faria para sair de uma crise: ele reclama que não tem se exercitado. A solução? Fácil! Ir para uma caminhada no meio da noite. E quem sabe acordar às 9 da manhã para uma nataçãozinha, só para ter certeza. É claro que todo esse exercício tem um preço, então ele provavelmente vai acabar super cansado na prática do dia seguinte... por ter se exercitado demais. É um ciclo vicioso.</p>","es_AR":"<p>Chun-An \"AN\" Chou es uno de los favoritos de los simpatizantes en LMS. Su extravagante personalidad y estilo de juego de acarreo con daño de ataque agresivo se reúnen en un paquete adorable. Pero esas mismas características a veces sorprenden a sus propios compañeros de equipo. De manera muy similar a su compañero Mountain, AN mantiene una estoica despreocupación por los registros de victorias y derrotas en las actuaciones, por lo que juega a su propio ritmo y a su propia manera.</p>\n\n<p>Pero cuando AN encuentra que no está jugando bien, hace lo que cualquier jugador profesional haría: culpa a una falta de ejercicio. ¿La solución? ¡Sencillo! Salir a correr en la mitad de la noche! Y luego levantarse a las 9 AM para ir a nada, solo para estar seguro. Desde luego que todo el ejercicio se pasa de la cuenta, por lo que probablemente falte al siguiente día de práctica... por culpa de mucho ejercicio. Es un círculo vicioso.</p>"},"foreignIds":{"drupalId":"1002","TRLH1":"1001380125","TRLH2":"1001280095","TRLH3":"1001160046","TRLH4":"1001160046","TRTW":"200000149","TRLT3":"200000260"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":34,"slug":"westdoor","name":"Westdoor","firstName":"Shu-Wei","lastName":"Liu","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/westdoor-e3yh8alc.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:30:57.000Z","bios":{"en_US":"<p>Shu-Wei \"Westdoor\" Liu is one of the most storied players in Taiwan, reaching Challenger on the Taiwan, North American, and Korean servers. Seeing Westdoor lock in Twisted Fate was considered guaranteed victory back in 2012. Even now it strikes fear into his opponents, though he has become better known for his godlike Fizz mechanics.\n</p>\n<p>\nIn contrast to his dynamic playstyle in-game, Westdoor is one of the quietest players on ahq e-Sports club in real life, often eating alone. But he is also the undisputed team captain. When his teammates are unsure of what to do, they look to him for guidance -- and he is always there to help push them further. As he explains, “If you have a dream, go chase it. Don’t give up until you grab it.” Westdoor is also the least likely to complain about practice -- in part because he lives and breathes Solo Queue. To top off the man and the legend, Westdoor spends his downtime between queues reading historical and science fiction novels, sharing favorites with his teammate Mountain. A gentleman, a scholar, a captain, and a friend. Is there anything Westdoor can’t do better than us?\n</p>","pl_PL":"<p>Shu-Wei „Westdoor” Liu to jeden z najlepszych graczy w Tajwanie – udało mu się trafić do kręgu Pretendenta w Tajwanie, Ameryce Północnej i Korei. Wybranie przez Westdoora Twisted Fate'a było gwarancją zwycięstwa w 2012 roku. Nawet dziś przeraża to przeciwników, chociaż gracz stał się znany z niesamowitej gry Fizzem.\n</p>\n<p>\nDla kontrastu z jego popisową grą Westdoor jest jednym z najcichszych graczy w klubie ahq i często jada sam. Jest jednak niezaprzeczalnie kapitanem drużyny. Kiedy towarzysze z drużyny nie wiedzą, co robić, traktują go jak przewodnika, a on zawsze staje na wysokości zadania. Sam wyjaśnia to tak: „Jeśli masz marzenie, musisz za nim gonić. Nie poddawaj się, póki się nie spełni”. Westdoor najrzadziej też narzeka na treningi, głównie dlatego, że niemal żyje w kolejce solo. Obrazu tej legendarnej postaci dopełnia fakt, że wolne chwile spędza na czytaniu książek historycznych i science fiction wraz ze swoim towarzyszem, Mountainem. Gentleman, uczony, kapitan i przyjaciel. Czy jest coś, czego Westdoor nie robi lepiej niż my?\n</p>","fr_FR":"<p>Shu-Wei « Westdoor » Liu est l'un des joueurs qui a le plus fait parler de lui à Taïwan, ayant atteint le palier Challenger sur les serveurs taïwanais, nord-américains et coréens. Quand Westdoor parvenait à jouer Twisted Fate en 2012, on pouvait considérer que la partie était jouée d'avance. Et encore aujourd'hui, cette combinaison peut effrayer ses adversaires à juste titre, bien qu'il soit depuis devenu particulièrement réputé pour sa maîtrise impressionnante de Fizz.\n</p>\n<p>\nAlors qu'il se montre incroyablement dynamique lors d'une partie, Westdoor est l'un des joueurs les plus discrets d'ahq e-Sports club dans la vie réelle, mangeant souvent seul. Ce qui ne l'empêche pas d'être le capitaine indiscuté de l'équipe. Quand ses coéquipiers ne savent trop quoi faire, ils se tournent vers lui... et il est toujours prêt à les aider à aller plus loin. Comme il le dit : « Si vous avez un rêve, pourchassez-le. N'abandonnez pas avant de l'avoir atteint. » Westdoor est également le moins enclin à se plaindre de l'entraînement, certainement parce qu'il adore jouer en file solo. Pour terminer de définir l'homme et la légende, il faut savoir que Westdoor passe tout son temps libre à lire des romans historiques ou de science-fiction, partageant ses livres préférés avec son coéquipier Mountain. Gentleman, érudit, capitaine et ami. Existe-t-il une chose que Westdoor ne sait pas faire mieux que nous ?\n</p>","de_DE":"<p>Shu-Wei „Westdoor“ Liu hat die Challenger Series in Taiwan, Nordamerika und Korea erreicht und gilt somit als einer der vielseitigsten Spieler in Taiwan. 2012 sprach man von einem sicheren Sieg, wenn Westdoor Twisted Fate auswählte. Und auch heute fürchten sich seine Gegner noch davor, auch wenn er jetzt eher für seine unglaublichen Spielzüge mit Fizz bekannt ist.</p>\n\n<p>Im Gegensatz zu seinem dynamischen Spielstil ist Westdoor im wahren Leben der ruhigste Spieler bei ahq e-Sports Club, der meistens sogar alleine isst. Aber gleichzeitig ist er der unangefochtene Teamleiter. Wenn seine Teamkameraden nicht genau wissen, was sie tun sollen, warten sie auf seine Führung – und er ist immer zur Stelle, um sie weiter voranzutreiben. Er erklärt das so: „Wenn du einen Traum hast, musst du ihn verfolgen. Und du darfst nicht aufhören, bevor er wahr geworden ist.“ Westdoor würde sich auch niemals über Training beschweren – was zum Teil auch daran liegt, dass die Solo-Warteschlange sein Zuhause ist. Und um der Legende noch einen draufzusetzen, liest Westdoor in seiner Freizeit Geschichts- und Science-Fiction-Romane, die er auch gerne mit seinem Teamkameraden Mountain teilt. Ein Gentleman, ein Gelehrter, ein Leiter und ein Freund. Gibt es eigentlich nichts, was Westdoor nicht besser kann als wir?</p>","es_ES":"<p>Shu-Wei ''Westdoor'' Liu es uno de los jugadores más históricos de Taiwán, y ha conseguido llegar al nivel Aspirante en los servidores de Taiwán, Norteamérica y Corea. En 2012, si Westdoor elegía a Twisted Fate, la victoria estaba garantizada. Incluso hoy en día levanta el pánico entre los rivales, aunque ahora es más famoso por su increíble manejo de Fizz.</p>\n\n<p>En contraste con su estilo de juego dinámico en partida, Westdoor es uno de los jugadores más callados de ahq e-Sports Club en la vida real, y suele comer solo, pero no cabe duda de que es el capitán del equipo. Cuando sus compañeros no tienen claro qué hacer, lo miran para que les guíe, y siempre les ayuda a llegar más lejos. Como él mismo afirma: ''Si tienes un sueño, ve a por él. No te rindas hasta que lo consigas''. Westdoor es también el que menos se queja a la hora de practicar, en parte porque le encanta la cola en solitario. Para rematar al hombre y la leyenda, Westdoor pasa su tiempo libre entre colas leyendo novelas históricas y de ciencia ficción, y comparte sus favoritas con su compañero de equipo Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Habrá algo en lo que Westdoor no logre ser mejor que nosotros?</p>","pt_BR":"<p>Shu-Wei \"Westdoor\" Liu é um dos jogadores mais lendários em Taiwan, conseguindo alcançar o nível Desafiante em Taiwan, América do Norte e Coreia ao mesmo tempo. Ver Westdoor escolher Twisted Fate era considerado uma vitória garantida em 2012. Até mesmo hoje ele ainda põe medo em seus oponentes, apesar de ter ficado mais conhecido por suas façanhas surreais com Fizz.</p>\n\n<p>Em contraste de seu estilo de jogo completamente dinâmico dentro do jogo, Westdoor é um dos jogadores mais quietos da ahq e-Sports Club na vida real, sempre almoçando sozinho em seu canto. Mas ele também é um capitão de equipe indiscutível. Quando seus companheiros não se sentem confiantes sobre o que fazer, eles o procuram para guiá-los e ele sempre está do lado deles para ajudar a melhorá-los. E é como ele diz, “Se você tem um sonho, vá atrás dele. Não desista até alcançá-lo”. Westdoor também é o menos provável de reclamar dos treinos, em parte porque a vida dele é a Fila Solo, mas além disso, a lenda também usa seu tempo livre entre as filas para ler livros de contos históricos e Sci-Fi, sempre compartilhando seus favoritos com seu companheiro Mountain. Um cavalheiro, estudioso, capitão e amigo. Existe alguma coisa em que o Westdoor não é bom?</p>","es_AR":"<p>Shu-Wei \"Westdoor\" Liu es uno de los jugadores más conocidos de Taiwán, y llegó a Aspirante en los servidores de Taiwán, Norteamérica y Corea. Ver a Westdoor en Twisted Fate se consideraba una victoria segura en el 2012. Aún ahora inspira temor en sus oponentes, aunque se ha vuelto más famoso por su mecánica divina con Fizz.</p>\n\n<p>En contraste con su dinámico estilo de juego, Westdoor es uno de los jugadores más tranquilos en ahq e-Sports club en la vida real, llegando incluso a comer varias veces en solitario. Sin embargo, es también el capitán indiscutido del equipo. Cuando sus compañeros no están seguros sobre qué hacer, acuden a su guía. Él siempre está disponible para ayudar a hacer que las cosas avancen más. Como bien dice, \"Si tienes un sueño, ve por él. No te rindas hasta que lo hayas cumplido\". Westdoor es también quien posee la menor posibilidad de quejarse sobre las prácticas, en parte porque vive y respira en cola individual. Por sobre el hombre y la leyenda, Westdoor pasa su tiempo inactivo entre colas leyendo material histórico y novelas de ciencia ficción, compartiendo sus favoritos con su compañero Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Hay algo que Westdoor no haga mejor que nosotros?</p>"},"foreignIds":{"drupalId":"948","TRLH1":"1001380124","TRLH2":"1001280094","TRLH3":"1001160045","TRLH4":"1001160045","TRTW":"200000008","TRLT3":"200000262"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":35,"slug":"albis","name":"Albis","firstName":"Jia-Wei","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/albis-7h5uw9xi.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:23:18.000Z","bios":{"en_US":"<p>Jia-Wei “Albis” Kang is the silent protector of ahq e-Sports Club. While he’s normally modest and reserved, he’s not afraid to spring into action to help his teammates both in and out of game. The LMS veteran has built a large fanbase over the years, earning him 43.4 percent of the support vote.</p>\n\n<p>Albis’s playmaking skills on the Rift were on full display at Worlds, when he played Bard to great effect in the Group Stage. However, he struggled on other champions, and AHQ failed to make it out of their group.</p>","fr_FR":"<p>Chia Wei \"Albis\" Kang est le protecteur silencieux d'ahq e-Sports Club. Même s'il est d'ordinaire modeste et réservé, il n'a pas peur de passer à l'action quand il s'agit d'aider ses coéquipiers, dans et hors jeu. Le vétéran LMS s'est créé une large base de fans au fil des ans, lui permettant d'obtenir 43,4 pour cent des votes support.</p>\n\n<p>Albis a montré tout ce dont il était capable sur la Faille lors du Mondial en jouant Bard de manière impressionnante dans la phase de groupe. Toutefois, il a du mal avec d'autres champions et AHQ n'a pas réussi à sortir gagnant de son groupe. Alors que l'événement All-Stars 2016 ne sera que pur chaos, l'équipe d'Albis peut compter sur lui pour les mener à la victoire.</p>","pl_PL":"Chia Wei „Albis” Kang to milczący obrońca ahq e-Sports Club. Chociaż zazwyczaj jest skromny i zamknięty w sobie, nie boi się rzucić do akcji, gdy trzeba pomóc kolegom, zarówno w grze, jak i poza nią. Ten weteran LMS zebrał w ciągu lat wielką bazę fanów, którzy zapewnili mu 43,4 procenta głosów dla zawodnika wsparcia.</p>\n\nAlbis w pełni zaprezentował swoje umiejętności kreowania rozgrywki na Summoner’s Rift podczas Mistrzostw, gdy niezwykle skutecznie grał Bardem w fazie grupowej. Jednak kiepsko sobie radził z innymi bohaterami i AHQ nie zdołali wydostać się z grupy. Chociaż wydarzenie All-Star 2016 będzie pełne zamieszania, drużyna Albisa może mieć nadzieję, że on zdoła poprowadzić ją do zwycięstwa.\n","de_DE":"<p>Chia Wei „Albis“ Kang ist der stille Beschützer des ahq e-Sports Club. Obwohl er normalerweise eher bescheiden und reserviert ist, hat er weder im Spiel noch im echten Leben Angst, seinen Teamkameraden zur Hilfe zu kommen. Der Veteran der LMS hat sich über die Jahre eine große Fangemeinde aufgebaut und wurde mit 43,4 % der Stimmen zum Supporter gewählt.</p>\n\n<p>Albis Fähigkeiten als Spielmacher in der Kluft waren bei der Weltmeisterschaft gut zu erkennen, als er in der Gruppenphase mit Bard das Kommando übernahm. Dafür hatte er jedoch mit anderen Champions Probleme und AHQ konnte sich nicht für die K.-o.-Phase qualifizieren. Doch Albis Team kann sich darauf verlassen, dass er sie beim All-Stars-Event 2016 durch das Chaos zum Sieg führen wird.</p>","es_ES":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de apoyo.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó a Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","pt_BR":"<p>Chia Wei “Albis” Kang é o protetor silencioso da ahq e-Sports Club. Apesar de normalmente ser modesto e reservado, ele não tem medo de entrar em ação para ajudar seus companheiros de equipe, tanto dentro como fora do jogo. O veterano da LMS construiu uma grande base de fãs ao longo dos anos, rendendo-lhe 43,4% dos votos de suporte.</p>\n\n<p>A habilidade em fazer jogadas em Summoner’s Rift de Albis foi exibida no Mundial, onde ele brilhou de Bardo na Fase de Grupos. Contudo, ele teve dificuldades em outros Campeões e a AHQ não conseguiu sair de seu grupo. Quando o bicho estiver pegando no Evento All-Star 2016, a equipe de Albis pode ter a certeza de que ele os ajudará a procurar a vitória.</p>","es_AR":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","cs_CZ":"<p>Chia Wei „Albis“ Kang je tichý ochránce týmu ahq e-Sports Club. Ačkoliv bývá tichý a nenápadný, nebojí se vrhnout po hlavě do akce, aby pomohl svým kolegům – a to jak ve hře, tak i mimo ni. Tento veterán LMS si za svou dlouholetou kariéru vybudoval bohatou fanouškovskou základnu, která mu při hlasování vynesla podporu ve výši 43,4 %.</p>\n\n<p>Albisovy kreativní herní dovednosti jasně zazářily na MS, kde ve skupině nesmírně efektivně řádil s Bardem. S ostatními šampiony se mu však až tak nedařilo a AHQ ze své skupiny nakonec nepostoupili. Turnaj All-Star 2016 sice bude hrozný masakr, v Albisovi však jeho tým najde pevnou oporu, jež jej může dovést za vítězstvím.</p>","el_GR":"<p>Ο Chia Wei “Albis” Kang είναι ο σιωπηλός προστάτης των ahq e-Sports Club. Συνήθως είναι συγκρατημένος και ντροπαλός, αλλά δεν φοβάται να δράσει αποφασιστικά για να βοηθήσει τους συμπαίκτες του εντός και εκτός παιχνιδιού. Είναι ένας βετεράνος του LMS που έχει αποκτήσει ένα πολύ μεγάλο κοινό όλα αυτά τα χρόνια. Δεν είναι παράξενο, λοιπόν, που πήρε το 43,4% των ψήφων για τη θέση του υποστηρικτή.</p>\n\n<p>Ο Albis έδειξε σε όλους πόσο καλός οργανωτής είναι στο Παγκόσμιο Πρωτάθλημα, όπου έπαιξε φοβερά με τον Βάρδο στη Φάση Ομίλων. Ωστόσο, δεν τα πήγε εξίσου καλά με άλλους ήρωες και οι AHQ δεν κατάφεραν να προκριθούν. Παρόλο που το Τουρνουά All-Star 2016 προβλέπεται αρκετά χαοτικό, οι συμπαίκτες του Albis μπορούν να τον εμπιστευτούν για να τους οδηγήσει στη νίκη.</p>","hu_HU":"Chia Wei „Albis” Kang az ahq e-Sports Club csendes védelmezője. Általában szerény és visszafogott, de a játékban (és azon kívül is) a csapattársai segítségére siet, ha szükség van rá. Az LMS-veteránnak továbbra is jelentős rajongótábora van, akik a támogatói szavazatok 43,4%-át adták le rá.</p>\n\nAlbis a vébén megmutatta, hogy milyen jó irányító, amikor Barddal játszott remekül a csoportkörben. Más hősökkel viszont nem volt sok szerencsére, így az AHQ nem jutott tovább a csoportjából. Bár a 2016-os All-Star gálán őrült meccsekre lehet számítani, Albisra bizalommal hagyatkozhat a csapata.\n","it_IT":"Chia Wei \"Albis\" Kang è il silenzioso protettore degli ahq e-Sports Club. È modesto e riservato, ma anche sempre pronto a scattare in aiuto dei suoi compagni, sia in partita che fuori. Questo veterano della LMS ha attirato a sé nel corso degli anni intere legioni di fan, che l'hanno premiato con il 43,4% dei voti nella categoria Supporto.\n</p>\nLe capacità di regista di Albis nella Landa sono state sotto gli occhi di tutti ai Mondiali, quando si è esibito con il suo Bard nella fase a gironi. Non è riuscito, tuttavia, a replicare il successo con gli altri campioni, e gli ahq non sono riusciti a proseguire la loro avventura nel torneo. Anche se l'All-Star 2016 sarà caratterizzato da un immenso caos, la squadra di Albis potrà contare sulle sue abilità di organizzatore per puntare alla vittoria.\n","ro_RO":"Chia Wei ''Albis'' Kang este protectorul tăcut al celor din ahq e-Sports Club. Cu toate că în mod normal e modest și tăcut, nu-i e teamă să intre în acțiune pentru a-și ajuta coechipierii atât în joc, cât și în afara lui. Veteranul din LMS a strâns un număr mare de fani de-a lungul anilor, obținând 43,4 la sută din voturile pentru suport.</p>\n\nPuterea lui Albis de a întoarce sorții în Rift a uimit spectatorii la Mondiale, când a jucat cu Bard cu mult succes în faza grupelor. Totuși, a avut probleme cu alți campioni, iar AHQ nu a reușit să treacă de grupe. Cu toate că All-Star Event va fi un turneu nebun și haotic, echipa lui Albis se poate baza pe un lucru: că-i poate conduce către victorie.\n","es_MX":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<P>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>"},"foreignIds":{"drupalId":"945","TRLH1":"1001380126","TRLH2":"1001280096","TRLH3":"1001360065","TRLH4":"1001310065","TRTW":"200000104","TRLT3":"200000261"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":302,"slug":"chawy","name":"Chawy","firstName":"Xing-Lei","lastName":"Wong","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chawy-13of7sx8.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2014-09-16T21:52:24.000Z","updatedAt":"2017-07-06T14:32:25.000Z","bios":{"en_US":"","es_AR":"<p>Xing-lei \"Chawy\" Wong es el carrilero central suplente de ahq e-Sports Club.</p>"},"foreignIds":{"drupalId":"377","TRTW":"200000007","TRLH2":"1001280097","TRLH1":"1001380127","TRLT3":"200000259"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":407,"slug":"mountain","name":"Mountain","firstName":"Zhao-Hong","lastName":"Xue","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mountain-a7eo73t.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:32:08.000Z","bios":{"en_US":"<p>Zhao-Hong \"Mountain\" Xue is the meaty, front-line-patrolling, carry-peeling jungler that every squishy champion dreams of having around in a team fight. Mountain integrated with ahq almost instantly after joining in 2014, despite initial worries about synergy with his teammates. His one potential flaw? He likes to experiment with in-game strategy -- sometimes without telling his team first, leading to questionable scrim results. But when ahq needs him to deliver his finest, he is always ready to step up to the plate.\n</p>\n<p>\nWhile Mountain enjoys experimenting with new strategies on the Rift, when he leaves the game behind he becomes more consistent. Whenever ahq goes abroad, the first thing he does is buy a doll from the airport or a local toy store for his girlfriend. And if he has time to kill between queues, he enjoys reading a good historical or science fiction novel with his teammate Westdoor.\n</p>","fr_FR":"<p>Zhao-Hong « Mountain » Xue est un jungler puissant et dominant que tout champion un peu fragile rêve d'avoir à ses côtés pendant un combat d'équipe. Mountain a rejoint ahq presque immédiatement après son arrivée en 2014, malgré des craintes initiales sur la synergie avec ses coéquipiers. Son potentiel point faible ? Il aime tenter de nouvelles stratégies en cours de partie, parfois sans même prévenir son équipe, ce qui peut mener à des résultats ambivalents lors des matchs d'entraînement. Mais quand ahq a besoin qu'il donne le meilleur de lui-même, il répond toujours présent.\n</p>\n<p>\nSi Mountain aime tester de nouvelles stratégies dans la Faille, quand il ne joue pas, il est beaucoup moins créatif. Dès qu'ahq part à l'étranger, il achète toujours une poupée pour sa petite amie à l'aéroport ou dans un magasin de jouets. Et s'il a du temps à perdre entre deux parties, il va lire un roman historique ou de science-fiction avec son coéquipier Westdoor.\n</p>","pl_PL":"<p>Zhao-Hong „Mountain” Xue to walczący na froncie i usuwający prowadzących dżungler, którego każdy wrażliwy bohater lubi mieć przy sobie. Mountain zintegrował się z ahq tuż po przyłączeniu się w 2014 roku mimo tego, że obawiano się o to, jak ułoży mu się współpraca z towarzyszami. Jego potencjalną wadą jest fakt, że lubi eksperymentować ze strategią, czasem nie mówiąc nawet towarzyszom, co daje bardzo różne wyniki. Jednak kiedy ahq naprawdę go potrzebuje, zawsze spełnia oczekiwania drużyny.\n</p>\n<p>\nChociaż Mountain lubi eksperymentować w grze, poza nią jest zrównoważony. Kiedy ahq wybiera się w podróż, zawsze kupuje swojej dziewczynie lalkę na lotnisku lub w sklepie z zabawkami. A jeśli ma czas między meczami, lubi czytać powieści historyczne i science fiction, tak jak jego kolega, Westdoor.\n</p>","de_DE":"<p>Zhao-Hong „Mountain“ Xue ist der robuste, Carry fressende Jungler an der Front, den jeder Champion, der nicht besonders viel aushält, in einem Teamkampf gerne an seiner Seite hätte. Mountain konnte sich trotz anfänglicher Sorgen über die Harmonie mit seinen Teamkameraden gleich nach seinem Beitritt im Jahr 2014 bei ahq integrieren. Seine einzige potenzielle Schwachstelle? Er experimentiert gerne mit der Strategie im Spiel – und manchmal vergisst er, seine Mannschaft darüber in Kenntnis zu setzen, was immer wieder zu fragwürdigen Ergebnissen in Übungsspielen führt. Aber wenn es ernst wird und ahq ihn braucht, stellt er sich der Herausforderung.</p>\n\n<p>Obwohl Mountain in der Kluft gerne mit neuen Strategien experimentiert, ist er abseits des Spiels lange nicht so experimentierfreudig. Immer wenn ahq das Land verlässt, kauft er am Flughafen oder in einem Spielzeugladen eine Puppe für seine Freundin. Und wenn er zwischen den Spielen einmal Zeit totschlagen muss, liest er mit seinem Teamkameraden Westdoor Geschichts- oder Science-Fiction-Romane.</p>","es_ES":"<p>Zhao-Hong ''Mountain'' Xue es ese valioso jungla que todo campeón fácil de asesinar desea tener cerca durante los combates de equipo porque protege en primera línea y defiende al carry. Mountain se integró en ahq al instante cuando se unió a ellos en 2014, a pesar de las preocupaciones iniciales sobre su sinergia con los compañeros de equipo. ¿Su posible punto débil? Le gusta experimentar con la estrategia en partida, a veces sin decírselo primero a sus compañeros, lo que provoca resultados cuestionables durante las prácticas. Pero cuando ahq necesita que lo dé todo, siempre está preparado para saltar a la palestra.</p>\n\n<p>Aunque le gusta probar nuevas estrategias en la Grieta, cuando deja el juego a un lado, se vuelve más coherente. Cuando ahq viaja al extranjero, lo primero que hace es comprarle una muñeca en el aeropuerto o en una tienda de la zona a su novia. Para matar el tiempo durante las colas, le gusta leer novelas históricas o de ciencia ficción con su compañero Westdoor.</p>","pt_BR":"<p>Zhao-Hong \"Mountain\" Xue é o caçador-tanque carregador e protetor que todo campeão frágil sonha em ter por perto em um confronto de equipe. Mountain se integrou quase que instantaneamente com a ahq logo em sua entrada em 2014, apesar de preocupações iniciais sobre a sinergia com seus compaheiros. Seu possível maior defeito? Ele gosta de experimentar com estratégias dentro do jogo, muitas vezes sem dizer aos seus companheiros primeiro, levando a resultados questionáveis durante o treinamento. Mas quando a ahq precisa que ele dê o seu melhor, ele sempre está pronto para atender às expectativas.</p>\n\n<p>Apesar de Mountain gostar de experimentar com novas estratégias no Rift, quando ele deixa essa parte de lado, ele se torna mais consistente. Sempre que a ahq viaja pelo mundo, a primeira coisa que ele faz é comprar uma boneca no aeroporto ou em uma loja de brinquedos local para sua namorada. E durante seu tempo livre da filas do League of Legends, ele gosta de ler uma boa novela histórica ou Sci-Fi com seu companheiro de equipe, Westdoor.</p>","es_AR":"<p>Zhao-Hong \"Mountain\" Xue es el sustancioso junglero que patrulla la primera línea y evita los movimientos del contrario, alguien a quien cada campeón frágil desearía tener cerca en un combate en equipo. Mountain se unió a ahq en el 2014 y se integró sólidamente casi al instante, a pesar de las preocupaciones iniciales sobre la forma de trabajar con sus compañeros. ¿Su posible falla? Le gusta experimentar con la estrategia dentro del juego, a veces sin avisar primero a sus compañeros, lo cual se traduce en cuestionables resultados. Sin embargo, cuando ahq necesita que se desempeñe impecablemente, está siempre listo para cumplir con lo suyo.</p>\n\n<p>Si bien a Mountain le gusta crear nuevas estrategias en la Grieta, cuando deja al juego atrás, se vuelve mucho más consistente. Cada vez que ahq sale del país, lo primero que hace es comprar una muñeca para su novia en el aeropuerto o en una juguetería local. Y, si tiene que matar el tiempo mientras hace fila, disfruta leyendo literatura histórica o novelas de ciencia ficción con su compañero Westdoor.</p>"},"foreignIds":{"drupalId":"1698","TRLH1":"1001380123","TRLH2":"1001280093","TRLH3":"1001160093","TRLH4":"1001160093","TRTW":"200000006","TRLT3":"200000258"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":408,"slug":"ziv","name":"Ziv","firstName":"Yi","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ziv-r8szyen.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:22:21.000Z","bios":{"en_US":"<p>There’s a reason Yi “Ziv” Chen earned a staggering 66.1 percent of the top lane vote for the LMS region. He’s the cream of the crop of LMS top laners, and he’s proven he can compete with the best in the world. He turned heads with his debut at the 2015 Mid-Season Invitational, and he led AHQ to two of their victories with stellar Jayce play at the 2016 World Championship. Unfortunately, AHQ fell just short of making it out of the group stage.</p>\n\n<p>Ziv made a name for himself in the LMS with his unrelenting approach in the top lane. He isn’t afraid to chase his opponents all the way to their fountain if necessary. He’s shown his dedication to improving his craft, and he’s always looking to improve his mechanics in scrims and solo queue.</p>","fr_FR":"<p>Ce n'est pas sans raison que Yi \"Ziv\" Chen a remporté un pourcentage écrasant de 66,1 dans le vote top laner de la région LMS. Il est la crème de la crème des top laners LMS et il a démontré qu'il pouvait affronter les meilleurs du monde. Il a fait tourner les têtes lors de ses débuts dans le Mid-Season Invitational 2015, et AHQ lui doit deux de ses victoires grâce à son jeu exceptionnel de Jayce lors du Championnat du monde 2016. Malheureusement, AHQ n'a pas réussi à sortir gagnant de la phase de groupe.</p>\n\n<p>Ziv s'est fait un nom dans les LMS avec son style implacable dans la voie du haut. Il n'a pas peur de poursuivre ses adversaires jusqu'à leur fontaine, s'il le faut. Il s'est montré déterminé dans l'apprentissage de son art et il cherche toujours à améliorer ses mécaniques dans les matchs amicaux et la file solo. L'événement All-Stars 2016 lui donnera une chance de se libérer et de plonger dans le chaos de l'intersaison.</p>","pl_PL":"Yi „Ziv” Chen nie bez powodu zdobył oszałamiające 66,1 procenta głosów na górnego regionu LMS. Należy do śmietanki górnych LMS i pokazał, że potrafi rywalizować z najlepszymi na świecie. Zwrócił na siebie uwagę podczas debiutu na Mid-Season Invitational 2015, a swoją genialną grą Jaycem doprowadził AHQ do dwóch zwycięstw na Mistrzostwach Świata 2016. Niestety AHQ nie zdołali wyjść z fazy grupowej, choć tak niewiele im do tego brakowało.\n</p>\nZiv zdobył sobie uznanie w LMS swoją nieustępliwością na górnej alei. Gdy trzeba, nie boi się ścigać przeciwników aż do ich fontanny. Wykazał się skrupulatnością w doskonaleniu swojego warsztatu i zawsze jest gotowy poprawiać mechanikę gry podczas sesji treningowych i w kolejce solo. Wydarzenie All-Star 2016 będzie dla niego okazją, by pójść na całość i poszaleć trochę poza sezonem.\n","de_DE":"<p>Es gibt einen Grund, aus dem Yi „Ziv“ Chen von unglaublichen 66,1 % aller Wähler zum Top-Laner für die LMS-Region gewählt wurde. Er ist der beste Top-Laner der LMS und er hat bewiesen, dass er mit den besten Spielern der Welt mithalten kann. Er erregte bereits bei seinem Debüt im Mid-Season Invitational 2015 Aufsehen und führte AHQ mit seinem überragenden Jayce zu zwei Siegen bei der Weltmeisterschaft 2016. Leider schaffte es AHQ knapp nicht, in die K.-o.-Runde der WM einzuziehen.</p>\n\n<p>Ziv machte sich mit seinen erbarmungslosen Spielzügen auf der oberen Lane einen Namen in der LMS. Er schreckt auch nicht davor zurück, seine Gegner bis in die Basis zu verfolgen, wenn es die Situation erfordert. Er hat gezeigt, dass er sich stets steigern will, und versucht, seine Mechaniken in Übungsspielen und der Solo-Warteschlange zu verbessern. Beim All-Stars-Event 2016 bekommt er die Möglichkeit, richtig aufzudrehen und in der Nebensaison ordentlich Chaos zu stiften.</p>","es_ES":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para la calle superior de la región de LMS. Es de lo mejorcito de los top de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograse dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en la calle superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola en solitario. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","pt_BR":"<p>Existe um motivo para Yi “Ziv” Chen ter conseguido 66,1% dos votos da rota do topo da região LMS. Ele faz parte da nata dos jogadores de posição na LMS e provou que pode competir com os melhores do mundo. Ele atraiu olhares com sua estreia no Mid-Season Invitational 2015 e levou a AHQ a duas de suas vitórias, com desempenhos espetaculares de Jayce no Campeonato Mundial 2016. Infelizmente, a AHQ não conseguiu sair da Fase de Grupos.</p>\n\n<p>Ziv fez seu nome na LMS com sua abordagem implacável da rota do topo. Ele não tem medo de perseguir seus oponentes até a fonte, se necessário. Mostrou sua dedicação em melhorar seu ofício e sempre está buscando aprimorar suas mecânicas em duelos na fila solo. O Evento All-Star 2016 lhe dará uma chance de relaxar e mergulhar no caos do pós-temporada.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yi \"Ziv\" Chen은 ahq E-sports Club에 가장 최근 합류한 선수 두 명 중 하나로 2014 월드 챔피언십 이후 팀에 들어갔습니다. 그는 데뷔 무대였던 2015 미드 시즌 인비테이셔널에서 마오카이와 나르를 이용한 압도적 경기력으로 세계를 뒤흔들었습니다. 특히 서구의 탑 라이너들 몇몇이 여기에 희생됐죠. Ziv는 2015 월드 챔피언십에서 ahq가 8강까지 올라가는 데 중요한 역할을 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">전장에서 그가 킬을 올리기 위해 적팀 탑 라이너를 쫓고 있지 않을 때에는 LMS에서 가장 진지한 선수들 중 하나가 됩니다. ahq의 스크림 경기에서 Ziv는 피지컬을 향상시키기 위해 최선을 다하죠. 하지만 연습이 끝나면 긴장을 푼 Ziv로 돌아옵니다. 평소에는 숙소에서 잠을 자거나 친구들과 애니메이션을 보며 하루를 보낼 때가 많습니다. </p>\n","es_AR":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","cs_CZ":"<p>Není žádná náhoda, že Yi „Ziv“ Chen získal za LMS ohromujících 66,1 % hlasů pro horní lajnu. Je absolutní špičkou mezi horními lajnaři z LMS a dokázal, že obstojí i v boji s těmi nejlepšími z celého světa. Vzbudil zaslouženou pozornost již při svém debutu na turnaji Mid-Season Invitational 2015 a svou hvězdnou hrou za Jayce dovedl AHQ ke dvěma z jejich vítězství na mistrovství světa 2016. Přesto AHQ bohužel nepostoupili ze skupiny.</p>\n\n<p>Ziv se v LMS proslavil tím, že v horní lajně nenechá svého soupeře ani na okamžik vydechnout. Je-li to zapotřebí, neváhá jej pronásledovat až na fontánu. Neusíná na vavřínech a neustále se snaží své herní dovednosti zlepšovat v cvičných utkáních a sólové frontě. Na turnaji All-Star 2016 bude mít příležitost utrhnout se ze řetězu a trochu si vychutnat všeobecný masakr v odpočinkové době mezi sezónami.</p>","el_GR":"<p>Δεν είναι τυχαίο που ο Yi “Ziv” Chen πήρε το απίστευτο ποσοστό 66,1% των ψήφων του LMS για τη θέση επάνω λωρίδας. Είναι ό,τι καλύτερο έχει να επιδείξει το LMS στην επάνω λωρίδα και μπορεί να ανταγωνιστεί τους καλύτερους παίκτες του κόσμου σε αυτήν τη θέση. Το ντεμπούτο του στο Mid-Season Invitational 2015 προκάλεσε τεράστια αίσθηση, ενώ αργότερα οδήγησε τους AHQ σε δύο πολύ σημαντικές νίκες στο Παγκόσμιο Πρωτάθλημα 2016 με εκπληκτικό χειρισμό του Τζέις. Δυστυχώς, οι AHQ δεν κατάφεραν να περάσουν από τη φάση ομίλων.</p>\n\n<p>Ο Ziv έγινε διάσημος στο LMS για τον αδυσώπητο τρόπο που έπαιζε στην επάνω λωρίδα. Δεν φοβάται να κυνηγήσει τους αντιπάλους του ακόμη και μέχρι το σιντριβάνι τους, αν χρειαστεί. Έχει αποδείξει την αφοσίωσή του στη βελτίωση του παιχνιδιού του και προσπαθεί πάντα να βελτιώσει τη γνώση των μηχανισμών σε φιλικούς αγώνες και παιχνίδια στην ουρά αναμονής για έναν παίκτη. Στο Τουρνουά All-Star 2016 θα έχει την ευκαιρία να τα δώσει όλα και να σπείρει λίγο χάος προτού ξεκινήσει η σεζόν.</p>","hu_HU":"Nem véletlen, hogy Yi „Ziv” Chen elsöprő, 66,1%-os szavazati aránnyal lehet az LMS régiót képviselő felső ösvényes. Az LMS felső ösvényesei közül is kiemelkedik, és bizonyította, hogy a világ legjobbjaival is elbánik. Először a 2015-ös szezonközi meghívásos versenyen hívta fel magára a figyelmet, és két győzelemre vezette az AHQ-t Jayce-t irányítva a 2016-os világbajnokságon. Balszerencséjükre ez nem volt elég ahhoz, hogy az AHQ továbbjusson a csoportkörből.</p>\n\nZiv azzal szerzett hírnevet magának az LMS-ben, hogy kíméletlenül játszik a felső ösvényen. Akár a forrásig is üldözi az ellenfeleit. Elkötelezetten fejleszti a játéktudását: gyakorlómeccseken és az egyéni várólistán csiszolja a képességeit. A 2016-os All-Star gálán végre ellazulhat, és örömét lelheti a játékban.\n","it_IT":"C'è un motivo alla base dell'incredibile 66,1% di voti guadagnato da Yi \"Ziv\" Chen nella categoria Superiore per la regione LMS. Non solo rappresenta l'élite dei superiori della LMS, ma ha anche dimostrato di saper tenere testa ai migliori giocatori del mondo. Ha attirato l'attenzione sin dal suo debutto al Mid-Season Invitational 2015 e ha condotto gli AHQ a due importanti vittorie ai Mondiali 2016 grazie alle sue giocate stellari con Jayce. Tuttavia, la sua squadra non è riuscita a qualificarsi nella fase a gironi.</p>\n\nZiv si è fatto conoscere nella LMS per il suo approccio aggressivo in corsia superiore. Non ha paura di dare la caccia ai suoi avversari e neppure di seguirli fino alla loro base, se necessario. Ha dimostrato molto impegno nel migliorare il suo gioco ed è sempre intento a studiare nuove meccaniche in allenamento e nelle code in singolo. L'All-Star 2016 gli darà la possibilità di scatenarsi e portare un po' di caos fuori dalla stagione regolare.\n","ro_RO":"Există un motiv pentru care Yi ''Ziv'' Chen a obținut un procent uimitor de 66,1 la sută din voturile pentru culoarul de sus din LMS. Este cel mai bun jucător de pe această poziție din regiune și a dovedit că poate concura liniștit la nivel mondial. A atras privirile spectatorilor prin debutul său la Mid-Season Invitational 2015 și a condus AHQ către două dintre victoriile echipei, jucând surprinzător cu Jayce la Campionatul Mondial 2016. Din păcate, AHQ nu a reușit să treacă de faza grupelor.</p>\n\nZiv și-a creat o reputație în LMS cu strategia sa nemiloasă de pe culoarul de sus. Nu-i e teamă să-și urmărească adversarii până la fântână dacă e cazul. E gata să muncească enorm ca să devină mai bun și încearcă mereu să-și îmbunătățească mecanicile în antrenamente și pe lista de așteptare solo. All-Star Event 2016 este o nouă șansă să se dezlănțuie și să provoace puțin haos în perioada dintre sezoane.\n","es_MX":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>"},"foreignIds":{"drupalId":"4288","TRLH1":"1001380122","TRLH2":"1001280092","TRLH3":"1001360061","TRLH4":"1001310061","TRTW":"200000148","TRLT3":"200000257"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1019,"slug":"lbb","name":"LBB","firstName":"Bing-Xin","lastName":"Liu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lbb-brctu3lx.png","hometown":"","region":"LMS Taiwan","birthdate":null,"createdAt":"2016-01-06T21:51:14.000Z","updatedAt":"2017-03-24T20:16:37.000Z","bios":{},"foreignIds":{"TRTW":"200000058"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41}],"scheduleItems":[{"id":"AVcfjjtzoUG4HPFjOKC_","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:00fd6df4-a971-48a8-92f8-133a8646db45","scheduledTime":"2016-10-08T04:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"6","subBlockLabel":"Sub Block 1","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:0fa0a851-3a91-44d4-9add-95780b0c10f7"},"match":"00fd6df4-a971-48a8-92f8-133a8646db45","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"0fa0a851-3a91-44d4-9add-95780b0c10f7","league":"9"}],"gameIdMappings":[{"id":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d","gameHash":"e38992c2ca4d9a8a"}],"videos":[{"id":4609,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:dc3a0212-ce53-4bda-a6ed-f1a7df46373d","source":"https://www.youtube.com/embed/hpB8OIgEMzU","createdAt":"2016-10-08T05:17:58.000Z","updatedAt":"2016-10-08T05:17:58.000Z","game":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d"},{"id":4611,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:dc3a0212-ce53-4bda-a6ed-f1a7df46373d","source":"https://www.youtube.com/embed/7giCwkUbmEo?wmode=transparent","createdAt":"2016-10-08T06:41:37.000Z","updatedAt":"2016-10-08T06:41:37.000Z","game":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d"},{"id":4619,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:dc3a0212-ce53-4bda-a6ed-f1a7df46373d","source":"https://www.youtube.com/embed/buI5TNstlYw","createdAt":"2016-10-08T11:02:29.000Z","updatedAt":"2016-10-08T11:02:29.000Z","game":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d"},{"id":4663,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:dc3a0212-ce53-4bda-a6ed-f1a7df46373d","source":"https://www.youtube.com/watch?v=Q767S3S0xwY?wmode=transparent","createdAt":"2016-10-11T15:40:44.000Z","updatedAt":"2016-10-11T15:40:44.000Z","game":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d"}],"htmlBlocks":[],"match":{"id":"00fd6df4-a971-48a8-92f8-133a8646db45","name":"AHQ-vs-EDG","position":4,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"},{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],"games":{"dc3a0212-ce53-4bda-a6ed-f1a7df46373d":{"id":"dc3a0212-ce53-4bda-a6ed-f1a7df46373d","name":"G1","generatedName":"AHQ|EDG|G1|00fd6df4a97148a892f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"},{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],"standings":{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1476200428721,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475924537397,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475908901406,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475903863631,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001900677","gameRealm":"TRLH1","platformId":"TRLH1:1001900677","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1476200428721,"source":"bestOf","history":[{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475924537402,"source":"bestOf","closed":true},{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475908901406,"source":"bestOf","closed":true},{"result":[[{"roster":"7e7b979d-f329-4140-929c-50392a414d9d"}],[{"roster":"6b5e4003-9448-419a-8ecd-bd3d8732b590"}]],"timestamp":1475903863632,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7e7b979d-f329-4140-929c-50392a414d9d":1,"6b5e4003-9448-419a-8ecd-bd3d8732b590":0}}}