{"teams":[{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]},{"id":218,"slug":"i-may","name":"I May","guid":"be7140e4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/i-may-g9vriddl.png","acronym":"IM","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-05-18T20:51:23.000Z","updatedAt":"2017-06-06T23:41:14.000Z","bios":{"en_US":"","de_DE":"<p>I MAY ist ein Name, der Hoffnung ausstrahlt. Und das passt zum Ursprung dieser Mannschaft. IM war ursprünglich die zweite Mannschaft von Edward Gaming in der LSPL – ein bescheidener Anfang für eine Mannschaft, die jetzt zur WM fährt. Die Mannschaft, die damals noch als EDE bekannt war, gewann die LSPL und trat als I MAY beim Sommer-Split der LPL an. Ihr Erfolgslauf setzte sich im Sommer-Split fort und gipfelte in einem 3–2 Sieg über Team WE, mit dem sie sich für die Weltmeisterschaft qualifizierten. IM hat es allen Zweiflern und Kritikern gezeigt, die sich sichern waren, dass sie wegen ihres knappen Aufstiegs in die LPL niemals das höchste spielerische Niveau erreichen würden. Doch IM ließ sich von dieser Einschätzung nicht abschrecken und konnte in den Schlüsselmomenten Siege einfahren. Jetzt fährt die Mannschaft zur größten Bühne von League, um herauszufinden, ob sie mit ihrer verwegenen Art weitere überraschende Siege einfahren können.</p>","es_AR":"<p>I MAY es un nombre que denota esperanza, más que nada si se tiene en cuenta el origen de este equipo. IM comenzó en la LSPL como el segundo equipo de Edward Gaming, y sus comienzos fueron bastante humildes para ser un equipo que esté camino al Mundial. El equipo, conocido como EDE, logró salir del LSPL con un boleto al torneo de clausura de la LPL y bajo el nombre de I MAY. Su maravillosa actuación continuó a lo largo del torneo de clausura y terminó con una victoria por 3-2 contra Team WE y un pase al Campeonato Mundial. IM despejó las dudas de los escépticos y los críticos que sugerían que su casual ascenso a la LPL demostraba que nunca lograrían llegar a los más altos niveles de competición. Sin dejarse llevar por estos comentarios, IM continuó con su perfil bajo y obteniendo victorias en momentos clave. Ahora deberán saborear el escenario más grande de League of Legends y ver si pueden continuar con su audaz empresa de obtener más victorias de estas inesperadas.</p>\n\n<p><strong>Entrenador: Son \"Kezman\" Dae-young</strong></p>","pt_BR":"I MAY, \"eu posso\" em inglês, é um nome que irradia esperança e reflete as origens do time. A IM começou na LSPL com o segundo time da Edward Gaming -- começo humilde para uma equipe que agora vai para o Mundial. A equipe, antes conhecida como EDE, conseguiu sair da LSPL e chegou à Etapa de Verão da LPL como I MAY. Sua jornada de sucesso continuou até a Etapa de Verão, culminando com a classificação para o Mundial com uma vitória por 3 a 2 contra a WE. A IM calou a boca dos críticos e céticos que sugeriam que sua disputada ascensão à LPL era a prova de que eles não conseguiriam chegar aos níveis mais altos da competição. Sem temer essa percepção, a IM manteve a cabeça erguida e continuou vencendo em momentos cruciais. Agora chegou a hora da equipe vivenciar o nível máximo de League e ver se consegue dar continuidade a ousada tendência de abocanhar vitórias surpreendentes."},"foreignIds":{},"players":[293,505,507,974,1051,1278,1643,1983],"starters":[505,507,974,1051,1278],"subs":[293,1643,1983]}],"players":[{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":293,"slug":"ff","name":"FF","firstName":"Kui","lastName":"Xie","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ff-db69okzf.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-02-23T00:50:59.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3173"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":505,"slug":"amazingj","name":"AmazingJ","firstName":"Waiho","lastName":"Shek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazingj-9y5n6mpk.png","hometown":"Hong Kong","region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:16.000Z","updatedAt":"2017-06-06T23:41:30.000Z","bios":{"en_US":"","fr_FR":"<p>\nWaiho « AmazingJ » Shek est un féroce invocateur de requins (ou de lamantins). AmazingJ a obtenu un record de 11/1/2 (et de multiples doublés) en jouant Fizz dans son tout premier match, contre Edward Gaming. D'abord engagé comme top laner remplaçant, AmazingJ a réussi une telle performance qu'il a gagné le droit de démontrer son talent dans d'autres parties tout au long de la saison de la LPL 2015. Il est arrivé au bout du segment d'été avec un score de 8 victoires contre 4 défaites. \n</p>","es_ES":"<p>\nWaiho ''AmazingJ'' Shek es un feroz invocador de tiburones (o manatíes). En su debut con Edward Gaming se marcó un 11/1/2 (con varios asesinatos dobles) con Fizz, el Gamberro de las Mareas. Aunque llegó al equipo como suplente, su magnífico rendimiento en las procelosas aguas de la LPL le ha llevado a ser titular varias veces durante la temporada 2015. Terminó el Split de verano con un registro de 8V-4D.\n</p>","pl_PL":"<p>\nWaiho „AmazingJ” Shek jest zaciekłym przywoływaczem rekinów (oraz manatów). AmazingJ osiągnął zachwycający wynik 11/1/2 (a także wiele podwójnych zabójstw), grając Fizzem, Szachrajem Sztormów, podczas swojego debiutanckiego meczu z Edward Gaming. AmazingJ pierwotnie odgrywał rolę zawodnika z górnej alei. Jego pierwszy występ sprawił, że wystąpił jeszcze wielokrotnie podczas LPL 2015. Zakończył letni split z wynikiem ośmiu zwycięstw do czterech porażek. \n</p>","de_DE":"<p>Shek „AmazingJ“ Wai Ho marschiert in seinem eigenen Takt. AmazingJ, der wegen seiner Liebe für einen gewissen patriotischen Demacianer auch „Garen-Bro“ genannt wird, schwor zu Beginn seiner Karriere in der LPL, dass er seine Mannschaft zur Weltmeisterschaft führen würde. Nach dem knappen Einzug in die LPL war das eine ziemlich gewagte Aussage, aber AmazingJ hielt sein Versprechen. Er lieferte bei der regionalen Qualifikationsrunde eine gigantische Leistung gegen World Elite ab, beendete das Spiel mit einer unglaublichen Teleportation und sicherte seiner Mannschaft so einen Platz bei der Weltmeisterschaft. AmazingJ hat allen gezeigt, wie gerne er mit dem Zeitbrecher spielt, und Ekko im Verlauf des Sommer-Splits 10-mal ausgewählt. Aber er kann seine Mannschaft auch mit Irelia tragen oder mit Shen die Karte kontrollieren. Jetzt, wo AmazingJ seine Mannschaft zur Weltmeisterschaft geführt hat, muss er noch besser spielen, um allen zu beweisen, dass I MAY auch gegen die Besten bestehen kann.</p>","pt_BR":"<p>Shek \"AmazingJ\" Wai Ho tem o seu próprio ritmo e tende a se manter nele. Além de ser chamado de \"Mano Garen\" por amar um certo patriota demaciano, AmazingJ iniciou sua carreira na LPL jurando que levaria sua equipe ao Mundial. Foi uma declaração bem ousada para alguém que teve dificuldades em chegar à LPL, mas ele cumpriu sua promessa. Ele jogou as Classificatórias Regionais na raça contra a World Elite, e conseguiu executar um teleporte incrível para encerrar o jogo e se classificar para o Mundial. AmazingJ se mostrou muito confiante com o Rapaz que Estilhaçou o Tempo, usando e abusando de Ekko em dez jogos da Etapa de Verão. Mas ele também consegue jogar com Irelia ou exercer pressão no mapa com Shen. Agora que AmazingJ levou seu time ao Mundial, ele precisa jogar mais do que nunca para provar que a I MAY pode brilhar no ambiente mais competitivo que pode existir.</p>","es_AR":"<p>Shek \"AmazingJ\" Wai Ho marcha al ritmo de su propio tambor. No solo es conocido como el \"hermano de Garen\" por su amor típico de buen patriota demaciano, sino por haber comenzado su carrera en la LPL jurando que llevaría al equipo al Campeonato Mundial. Fue una declaración jugada luego de haber llegado con lo justo a la LPL, pero AmazingJ cumplió con su promesa. Transpiró mucho la camiseta en las clasificatorias regionales contra World Elite, y logró una asombrosa jugada de teleportación para acabar la partida y calificar para el Campeonato Mundial. AmazingJ se ha sentido muy cómodo con el Joven que Fragmentó el Tiempo, y arrasó con Ekko en diez partidas durante el torneo de clausura. De todas formas, también acarrea muy bien con Irelia y aplica presión en el mapa con Shen. Ahora que AmazingJ ha llevado a su equipo al Campeonato Mundial, deberá jugar más duro que nunca para probar que I MAY puede prosperar en el evento más competitivo de todos.</p>"},"foreignIds":{"drupalId":"2083","TRLH3":"1001160042","TRLH4":"1001160042","TRLH1":"1001380045","TRLH2":"1001280015"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":507,"slug":"jinjiao","name":"Jinjiao","firstName":"Jinshan","lastName":"Xie","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jinjiao-djee7q8y.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-06-06T23:40:37.000Z","bios":{"en_US":"","de_DE":"<p>Xie „Jinjiao“ Jin-Shan spielte sowohl in der LSPL als auch in der LPL, bevor er bei I MAY ein neues Zuhause fand. Dieser AD-Carry spielt bevorzugt Jhin und Sivir, die er im Verlauf des Sommer-Splits der LPL 2016 jeweils 12- und 11-mal auswählte. Aber falls der Virtuose und die Kampfmeisterin einmal gebannt werden, kann sich Jinjiao wie jeder andere professionelle AD-Carry anpassen. Er hat in seiner Karriere auch schon mit Ashe, Lucian und einmal sogar mit Kog’Maw gespielt.\nJinjiao ist ein ADC, der von seinem Supporter abhängig ist – er ist dafür bekannt, unglaubliche Schadensmengen auszuteilen, wenn er mit einem defensiven Supporter auf der Lane ist, der ihn unterstützt und ihm riskante Spielzüge ermöglicht. Jetzt, wo Jinjiao in I MAY ein neues Zuhause gefunden hat und mit Road an seiner Seite zur Weltmeisterschaft fährt, sind alle Siegesbedingungen erfüllt.</p>","es_AR":"<p>Xie \"Jinjiao\" Jin-Shan jugó tanto en la LSPL como en la LPL antes de encontrar su hogar en el plantel de I MAY. Este ADC se inclina por Jhin y Sivir, con los que jugó en 12 y 11 partidas respectivamente durante el torneo de clausura de la LPL 2016. Pero al igual que otros ADC profesionales, si le sacas a el Virtuoso y la Señora de la Batalla, Jinjiao se adapta igual. Ha jugado con Ashe y Lucian, y hasta usó a Kog’Maw en algunas partidas durante su carrera.</p>\n\n<p>Jinjiao es un ADC que vive exclusivamente de su soporte. Es conocido por infligir una enorme cantidad de daño cuando se lo pone a la par de un soporte defensivo que pueda cubrirlo y permitirle hacer sus jugadas riesgosas. Ahora que Jinjiao ha encontrado su hogar en I MAY y se dirige al Campeonato Mundial con su soporte Road, puede decirse que ha logrado la condición de ganador.</p>","pt_BR":"<p>Xie \"Jinjiao\" Jin-Shan já jogou na LSPL e na LPL, e encontrou um lar no elenco da I MAY. Esse Atirador prefere Jhin e Sivir e jogou com eles em 12 e 11 jogos respectivamente na Etapa de Verão de 2016 da LPL. Mas como vários outros Atiradores profissionais, se o Virtuoso e a Mestra da Batalha não estiverem disponíveis, Jinjiao se adapta. Ele já jogou com Ashe e Lucian, e até já se aventurou com Kog’Maw em alguns jogos da sua carreira.</p>\n\n<p>Jinjiao é um Atirador que vive e morre ao lado do seu suporte - ele é conhecido por causar uma quantidade de dano impressionante quando joga em parceria com um suporte defensivo que o proteja e possibilite suas jogadas arriscadas. Agora que Jinjiao encontrou seu lar na I MAY e está a caminho do Mundial com Road como suporte, ele finalmente está em condições de vencer.</p>"},"foreignIds":{"drupalId":"4215","TRLH1":"1001380048","TRLH2":"1001280018"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":974,"slug":"athena","name":"Athena","firstName":"Ha-woon","lastName":"Kang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/athena-2yuxd9y6.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T20:39:28.000Z","updatedAt":"2017-06-06T23:34:39.000Z","bios":{"en_US":"","de_DE":"<p>Athena ist dank seiner Zeit bei der koreanischen Mannschaft Ever einer der bekanntesten Spieler bei I MAY. Nach der Weltmeisterschaft in Saison 5 setzte Ever mit einem 2–0 Sieg beim LoL KeSPA Cup 2015 über SKTelecom T1 ein Ausrufezeichen und konnte am Ende mit einem 3–0 Sieg über CJ Entus sogar den Titel gewinnen. Doch nach diesem Erfolg verschwand Athena aus dem Rampenlicht. Für manche Fans war er eher Pawns Ersatz als ein eigenständiger Spieler. Aber dann heuerte er bei I MAY an.</p>\n\n<p>Athena war eine Schlüsselfigur beim kometenhaften Aufstieg der Mannschaft, die es in einem Split von der LSPL zur Weltmeisterschaft geschafft hatte. Er agiert lieber aus den hinteren Reihen, anstatt mit Assassinen oder robusten Champions in die Schlacht zu ziehen. Athena wird versuchen, allen zu beweisen, dass er ein eigenständiger Mid-Laner ist, der sich nicht in Pawns Schatten verstecken muss. Er ist einer der Veteranen in der Mannschaft und er weiß genau, wie hart es wird – aber er ist gerüstet und bereit, seinen Wert auf der größten Bühne der Welt unter Beweis zu stellen.</p>","es_AR":"<p>Athena es uno de los jugadores más conocidos del equipo de novatos de I MAY, gracias a su paso por el equipo coreano Ever. Después del Campeonato Mundial de la temporada 5, Ever pasó a la historia al derrotar a SKTelecom T1 por 2-0 en la Copa KeSPA de LoL en el 2015, para luego llevarse el campeonato entero con una victoria por 3-0 ante CJ Entus. Desde ese éxito inicial, Athena pasó a tener una presencia débil. Algunos simpatizantes lo veían más como un sustituto de Pawn que como un jugador hecho y derecho. Hasta que se unió a I MAY.</p>\n\n<p>Athena fue fundamental en el ascenso astronómico del equipo de la LSPL al Campeonato Mundial en un solo torneo. Se lo conoce mucho por su contribución desde la retaguardia, lanzando hechizos con campeones de golpes en lugar de dirigirse a la escaramuza con personajes asesinos o tanques. Athena intentará probar que es un carrilero central digno de ver, y no solo un rostro opacado por la figura de Pawn. Como uno de los veteranos del equipo, sabe lo dura que será lucha, pero, aún así, está preparado y listo para probar su valía en el escenario mundial.</p>","pt_BR":"<p>Athena é um dos jogadores mais conhecidos do elenco de calouros da I May, graças à sua equipe coreana, Ever. Depois do Campeonato Mundial de 2015, a Ever deixou sua marca ao derrotar a SKTelecom T1 por 2 a 0 na KeSPA Cup 2015, para no final levar o campeonato com uma vitória de 3 a 0 sobre a CJ Entus. Depois daquele sucesso inicial, Athena caiu no esquecimento. Alguns torcedores o viam mais como o substituto de Pawn do que como um jogador com méritos próprios. Foi aí que ele entrou na I MAY.</p>\n\n<p>Athena foi essencial para a ascensão meteórica da equipe, que saiu da LSPL para o Mundial em apenas uma Etapa. Ele é conhecido por suas contribuições na retaguarda, lançando feitiços em campeões de assalto em vez de entrar na briga com assassinos ou tanques. Athena tentará provar que ele é um jogador de meio que vale a pena ser observado, e não só um rostinho colado à sombra de Pawn. Como um dos veteranos da equipe, ele sabe que vai ser muito difícil - mas ele também está preparado e ponto para provar seu valor no palco mundial.</p>"},"foreignIds":{"TRLH1":"1001380047","TRLH2":"1001280017"},"socialNetworks":{},"champions":[{"id":213,"playerId":974,"championId":268,"championKey":"Azir","championName":"Azir","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":214,"playerId":974,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":215,"playerId":974,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"}],"liveGameTeam":218},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1051,"slug":"flawless","name":"Flawless","firstName":"Yeon-joon","lastName":"Seong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flawless-5i9ua7sb.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:20:35.000Z","updatedAt":"2017-02-23T00:52:00.000Z","bios":{},"foreignIds":{"TRKR1":"225085"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1278,"slug":"road","name":"Road","firstName":"Hankil","lastName":"Yoon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/road-hcih3cbd.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:27:35.000Z","updatedAt":"2017-06-06T23:42:38.000Z","bios":{"en_US":"","de_DE":"<p>Ein paar der legendärsten Supporter in League fahren zur Weltmeisterschaft 2016 und Yun „Road“ Han-gi ist gleich in seinem ersten Jahr mit dabei. Und er hofft immer noch, dass er sich einen Namen machen kann. Road hat sich an Jinjiao, den erfahreneren Spieler auf seiner Lane, angepasst und sich zu einem defensiven Supporter entwickelt, der seinem ADC immer den Rücken freihält. Road, der bei den Fans nach der überraschenden Auswahl von Leona während des Mid-Season Invitational noch beliebter geworden sein dürfte, spielt am liebsten den strahlenden Sonnenaufgang sowie Thresh und Braum. \nAber egal, welchen Champion Road auswählt, er hat eine schwierige Aufgabe vor sich. Er ist immer noch ein Anfänger und fährt mit einer Mannschaft, die sich gerade erst für die LPL qualifizieren konnte, zur Weltmeisterschaft. Sein Name war niemals passender, dann er ist kurz davor, den wichtigsten Weg seines Lebens anzutreten.</p>","es_AR":"<p>Algunos de los soportes más legendarios de League of Legends se dirigen al Campeonato Mundial 2016, y Yun \"Road\" Han-gi se les unirá en su torneo de novatos. En esta ocasión, espera hacer historia. Road ha sabido complementarse con el jugador más experimentado del carril, Jinjiao, y se ha convertido en un soporte defensivo que siempre cuenta con un ADC que lo cubre. Los simpatizantes que lo vitorearon ante su sorpresiva elección de Leona en el Torneo por Invitación de Mitad de Temporada comienzan a identificarse con él. Se lo conoce más por inclinarse por el Radiante Amanecer, como también Thresh y Braum.</p>\n\n<p>Sin importar el campeón que elija, Road tiene un duro camino por delante. Sigue siendo un novato que va al Campeonato Mundial con un equipo que simplemente clasificó para la LPL. Su nombre no podría ser más adecuado, ya que este será el recorrido más importante en toda su carrera.</p>","pt_BR":"<p>Alguns dos suportes mais lendários de League estarão no Mundial 2016 e Yun \"Road\" Han-gi estará junto a eles em sua Etapa de estreia. E ele espera conseguir deixar sua marca. Road aprendeu a se entrosar com o jogador mais experiente da sua rota, Jinjiao, e se tornou um suporte defensivo que está sempre preparado para proteger seu Atirador. Os torcedores que gostaram a escolha surpresa de Leona no MSI vão gostar de Road; ele é conhecido por preferir a Alvorada Radiante, bem como Thresh e Braum.</p>\n \n<p>Não importa que campeão ele escolha, Road tem um caminho difícil pela frente. Ele ainda é um calouro indo para o Mundial com uma equipe que acabou de se classificar para a LPL. Seu nome nunca foi tão oportuno, pois esse é o caminho mais importante que ele já trilhou.</p>"},"foreignIds":{"TRLH1":"1001380049","TRLH2":"1001280019"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1643,"slug":"ben4","name":"Ben4","firstName":"Xincheng","lastName":"Tu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben4-6j90qcxn.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:24:59.000Z","updatedAt":"2017-06-06T23:34:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1983,"slug":"starlight","name":"Starlight","firstName":"Shun-Jie","lastName":"Li","roleSlug":"support","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:39:34.000Z","updatedAt":"2017-06-06T23:39:34.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218}],"scheduleItems":[{"id":"AVmFhj_0QMQFcjhwbQsB","content":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:match:07d16cb1-ffe1-491d-8735-217e8d9ea95d","scheduledTime":"2017-03-24T12:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696","blockLabel":"7","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:bracket:8aad9de4-4ef3-43e3-8562-55d87ce468e8"},"match":"07d16cb1-ffe1-491d-8735-217e8d9ea95d","tournament":"5ca2f3d5-3682-4635-bac2-87f5a7f41696","bracket":"8aad9de4-4ef3-43e3-8562-55d87ce468e8","league":"7"}],"gameIdMappings":[],"videos":[{"id":6279,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:3fddb929-6600-4d02-a4a5-9efc6f2b6c47","source":"https://www.youtube.com/embed/Etw1ps4cXKg?wmode=transparent&start=7967","createdAt":"2017-03-24T20:26:01.000Z","updatedAt":"2017-03-24T20:26:01.000Z","game":"3fddb929-6600-4d02-a4a5-9efc6f2b6c47"},{"id":6280,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:8e2c6f02-ad09-41b1-bdf4-cb3d2d1979f1","source":"https://www.youtube.com/embed/Etw1ps4cXKg?wmode=transparent&start=11751","createdAt":"2017-03-24T20:33:10.000Z","updatedAt":"2017-03-24T20:33:10.000Z","game":"8e2c6f02-ad09-41b1-bdf4-cb3d2d1979f1"},{"id":6281,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:4e4cf329-0298-47de-8661-b2d2ba16b974","source":"https://www.youtube.com/embed/Etw1ps4cXKg?wmode=transparent&start=15133","createdAt":"2017-03-24T20:27:06.000Z","updatedAt":"2017-03-24T20:27:06.000Z","game":"4e4cf329-0298-47de-8661-b2d2ba16b974"}],"htmlBlocks":[],"match":{"id":"07d16cb1-ffe1-491d-8735-217e8d9ea95d","name":"IM-vs-EDG","position":19,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"games":{"3fddb929-6600-4d02-a4a5-9efc6f2b6c47":{"id":"3fddb929-6600-4d02-a4a5-9efc6f2b6c47","name":"G1","generatedName":"EDG|IM|G1|07d16cb1ffe1491d8735","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"},{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],"standings":{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}]],"timestamp":1490387313896,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}]],"timestamp":1490381612948,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8e2c6f02-ad09-41b1-bdf4-cb3d2d1979f1":{"id":"8e2c6f02-ad09-41b1-bdf4-cb3d2d1979f1","name":"G2","generatedName":"EDG|IM|G2|07d16cb1ffe1491d8735","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490387363377,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490381625938,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4e4cf329-0298-47de-8661-b2d2ba16b974":{"id":"4e4cf329-0298-47de-8661-b2d2ba16b974","name":"G3","generatedName":"EDG|IM|G3|07d16cb1ffe1491d8735","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490387379213,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490381613487,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490387379214,"source":"bestOf","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490387363377,"source":"bestOf","closed":true},{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490387313897,"source":"bestOf","closed":true},{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1490381613487,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7701ae49-64b4-4856-8bdb-3beed85331c2":0,"79de9e54-4454-430b-8578-1dfd6c055343":1}}}