{"teams":[{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]},{"id":108,"slug":"koo-tigers","name":"ROX Tigers","guid":"be6e3e07-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/koo-tigers-5xgsd4td.png","acronym":"ROX","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:04.000Z","bios":{"en_US":"<p>The ROX Tigers are ferocious in their pursuit of victory. The team formerly known as the KOO Tigers formed in 2014 and quickly evolved into one of the LCK’s elite predators. While they maintained a spot among the best, SK Telecom T1 seemed to have their number. Their fortunes turned in Champions Summer 2016, when they finally claimed their first title and stepped out of the shadow of Faker and company.</p>\n\n<p>Their triumph was short lived. When ROX met SKT again in the semifinals at the 2016 World Championship, ROX lost a close series to their rivals. After a huge roster shakeup that saw many fan favorites depart, ROX heads into 2017 looking to forge a new path to the top of the food chain.</p>","fr_FR":"KOO Tigers (précédemment GE Tigers) s'est formée en 2014, récupérant des joueurs chez NaJin Sword, NaJin Shield et Incredible Miracle. KOO, malgré cette composition éclectique, a vite su trouver l'unité requise pour combattre. Koo a obtenu la 2e place lors du Segment de printemps des LCK 2015 et a grimpé jusqu'aux demi-finales du Championnat du monde IEM Saison IX dans l'année qui a suivi sa formation.","pl_PL":"KOO Tigers (wcześniej znane jako GE Tigers) zostało utworzone w 2014 roku, zbierając graczy z NaJin Sword, NaJin Shield i Incredible Miracle. KOO szybko stało się zgraną drużyną, mimo że dla obserwatorów z zewnątrz mogło wyglądać nieco jak stwór Frankensteina. KOO zajęło 2. miejsce podczas wiosennego split LCK 2015 i dotarło do półfinałów mistrzostw świata sezonu dziewiątego IEM w ciągu roku od utworzenia.","de_DE":"<p>Dir ROX Tigers (ehemals KOO Tigers) wurden 2014 mit Spielern von NaJin Sword, NaJin Shield und Incredible Miracle gegründet. ROX verschmolz schnell zu einer eingeschworenen Einheit, obwohl die Mannschaft für Außenstehende wie eine von Frankensteins Kreationen aussah. Obwohl ROX eine der stärksten Mannschaften in der LCK war, schnappte SK Telecom T1 ihnen jeden Erfolg vor der Nase weg. Doch 2016 wendete sich das Blatt zugunsten der Tigers, als sie ihren ersten Split in der LCK gewannen und endlich aus dem Schatten von Faker und dessen Kameraden treten konnten. ROX hat zwar gerade erst den ersten Titel in der LCK gewonnen, aber jetzt richten sie ihre Augen auf das ultimative Ziel: Die Trophäe der Weltmeisterschaft 2016.</p>","es_ES":"<p>ROX Tigers (anteriormente llamado KOO Tigers) es un equipo formado en 2014 a partir de los jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se convirtió enseguida en una unidad de batalla, aunque pareciese un equipo Frankenstein para quien lo viese desde fuera. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapársele de las manos, pues SK Telecom T1 se la arrebataba una y otra vez. La suerte de los Tigers cambió en 2016 cuando finalmente consiguieron ganar su primer split de la LCK, lo que les hizo salir de la sombra de Faker y compañía. Puede que ROX haya conseguido su primer título de la LCK, pero ahora tiene la mirada puesta en su objetivo definitivo: el trofeo del Campeonato Mundial 2016.</p>","pt_BR":"A ROX Tigers (antiga KOO Tigers) foi formada em 2014, trazendo jogadores da NaJin Sword, NaJin Shield e Incredible Miracle. Mas a ROX rapidamente se integrou formando uma única unidade de combate, mesmo com muitos dizendo que essa equipe seria um frankenstein.  Apesar de ser uma das equipes mais fortes da LCK, a vitória parecia evitá-los constantemente toda vez que se encontravam com a SK Telecom T1. Mas a sorte da Tiger mudou em 2016 quando finalmente conseguiram ganhar sua primeira Etapa da LCK, saindo assim das sombras de Faker e companhia. A ROX pode ter conseguido levar para a casa seu primeiro título da LCK, mas agora eles estão de olho em um prêmio muito maior: o troféu do Campeonato Mundial 2016.","ko_KR":"<p>ROX Tigers(전 KOO/GE Tigers)는 2014년에 NaJin Sword, NaJin Shield, Incredible Miracle 출신 선수들을 모아 창단한 팀입니다. 언뜻 보기에는 마구잡이로 선수들을 한 팀에 모아놓은 듯했지만 창단 후 얼마 되지 않아 가공할 만한 모습을 보이기 시작했죠. </p>\n<p>창단 후 채 1년도 지나지 않은 시점에서 2015 LCK 스프링에서 2위에 올랐고 IEM 시즌 IX 월드 챔피언십에서는 준결승까지 진출했을 정도니까요. 뒤이어 2015 월드 챔피언십에서는 당당히 2위에 오르며 세계 최강팀 중 하나로 자리매김했습니다. 2016 스프링 정규 시즌에서는 16승 2패로 1위를 했지만, 플레이오프 결승에서 SKT T1에 3대1로 패하면서 아쉽게 2016 스프링 시즌에 우승하지는 못하였습니다.</p>\n","es_AR":"<p>ROX Tigers (anteriormente conocidos como KOO Tigers) se formó en el 2014 con jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se armó como una unidad de lucha, aún cuando los ojos ajenos miraban al equipo como apenas un rejunte de miembros. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapárseles siempre, ya que SK Telecom T1 les bloqueaba el paso en todas las oportunidades. La suerte de los Tigers cambió en el 2016, cuando finalmente ganaron su primer torneo de la LCK, lo que les permitió salir de la sombra de Faker y compañía. ROX se adjudicó su primer título de LCK, pero ahora su foco está en el objetivo principal: el trofeo del Campeonato Mundial 2016.</p>\n\n<p><strong>Entrenador: Kim \"Ssong\" Sang-su</strong></p>"},"foreignIds":{"drupalId":"3641"},"players":[572,742,1044,1045,1231,1270,2049],"starters":[572,1044,1045,1231,2049],"subs":[742,1270]}],"players":[{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":572,"slug":"sangyoon","name":"Sangyoon","firstName":"Sangyun","lastName":"Kwon","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sangyoon-7zedseul.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:53:57.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4334","ESPORTSTMNT06":"200000376"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":742,"slug":"shy","name":"Shy","firstName":"Sangmyeon","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shy-flf80pma.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-31T00:47:21.000Z","bios":{"en_US":"<p>CJ Entus top lane player Sang-myeon \"Shy\" Park is one of the longest tenured professional League of Legends players in Korea. The 24 year old has been competing at the highest level since 2012 when he joined MiG Frost. Shy was at the forefront of CJ Entus’ golden age as an organization, when both CJ Entus Frost and sister team CJ Entus Blaze made the OGN Champions Finals with regularity. \n</p>\n<p>\nWhile sometimes timid off the Rift, Shy is quick with a smile, and quicker with a carry. Shy will need to lend all of his veteran experience to his teammates if they are going to succeed on the new ROX Tigers roster. But don’t count him out yet. Sometimes it’s the old dogs that have the biggest bite.\n</p>","fr_FR":"<p>Sur la voie du haut, CJ Entus dispose de Sang-myeon « Shy », l'un des vétérans les plus aguerris de la scène professionnelle coréenne. À 24 ans, il joue au plus haut niveau depuis 2012, époque à laquelle il a rejoint MiG Frost. Shy était aux avant-postes pendant l'âge d'or de CJ Entus en tant qu'organisation, c'est-à-dire lorsque les équipes sœurs CJ Entus Frost et CJ Entus Blaze terminaient régulièrement en finale d'OGN Champions. \n</p>\n<p>\nQuoiqu'il soit parfois timide en dehors de la Faille, Shy se rattrape avec un carry. Shy devra apporter toute son expérience de vétéran à ses coéquipiers s'ils entendent reprendre le flambeau de CJ lorsque le groupe était à son sommet. Ne l'oubliez pas trop vite. Le vieux lion a toujours un mot à dire face aux jeunes loups.\n</p>","pl_PL":"<p>Górny gracz CJ Entus, Sang-myeon „Shy” Park jest jednym z najbardziej doświadczonych profesjonalnych graczy w LoLa w Korei. Ten 24-latek grał na najwyższym poziomie od 2012 roku, kiedy dołączył do MiG Frost. Shy był kluczowym elementem złotej ery CJ Entus, kiedy zarówno CJ Entus Frost i siostrzana drużyna, CJ Entus Blaze regularnie docierały do finałów OGN Champions. \n</p>\n<p>\nChociaż niektórzy są nieśmiali poza Rift, Shy jest zawsze skory do uśmiechu i grania prowadzącym. Jeśli jego drużyna chce doprowadzić do kolejnej złotej ery CJ, musi podzielić się z nią całym swoim doświadczeniem. Nie należy go jednak ignorować. Czasem nawet skamieliny potrafią być groźne.\n</p>"},"foreignIds":{"drupalId":"371","ESPORTSTMNT06":"200000373"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1044,"slug":"lindarang","name":"Lindarang","firstName":"Manheung","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lindarang-8tddakt4.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:16:03.000Z","updatedAt":"2017-05-31T00:51:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000374"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1045,"slug":"seonghwan","name":"SeongHwan","firstName":"Seonghwan","lastName":"Yun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seonghwan-g8jv42cj.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:14:35.000Z","updatedAt":"2017-05-31T00:52:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000440"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1231,"slug":"key","name":"Key","firstName":"Hangi","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/key-9cxe5iyu.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-04-28T19:01:05.000Z","updatedAt":"2017-05-31T00:53:08.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000959"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1270,"slug":"mightybear","name":"Mightybear","firstName":"Min-soo","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mightybear-dx94b7va.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:33:03.000Z","updatedAt":"2017-05-31T00:46:49.000Z","bios":{"en_US":"<p>\nMin-soo “Mightybear” Kim launched his professional career in late 2014 while playing for team Positive Energy in China. He then moved on to powerhouse Chinese esports organization Newbee (best known for their Dota 2 teams), where he stayed until early 2016. \n</p>\n<p>\nIn mid-2016 Mightybear decided to make the move to Europe in order to play with Team Vitality. After a brief stay, he made his way to Korea for 2017.\n</p>","de_DE":"<p>Min-Soo „Mightybear“ Kim ist praktisch der Neue in der Klasse. Er fing mit der Schule direkt im Ausland an, wo er sich allerdings nicht wohl fühlte, weil er nie zu Wort kam. Der Suchdrang nach einem neuen Zuhause wuchs schnell und Worten folgten die Taten. </p>\n\n<p>Im Klartext heißt dies, dass der koreanische Amateur, der vorher unter „Moon“ und „PandaBears“ bekannt war, sein professionelles Debüt in der Zweitliga Chinas, der LSPL, feierte. Bei Positive Energy konnte er kein Spiel für seine erste Mannschaft absolvieren, doch gab es für ihn einen Hauch an Hoffnung, als Newbee (heute in der LPL) den Club aufkaufte. Tatsächlich kam er im Demacia Cup 2015 Summer gegen Team WE Future und während der LPL 2016 Spring Promotion zum Einsatz. Allerdings konnte er mit den einhergehenden sechs Niederlagen (beide 0:3-Spielstände) bisher noch nichts unter Beweis stellen und hofft wieder einmal von seinen Fans und Kollegen respektiert geachtet zu werden. </p>\n\n<p>Mit Vitality könnte dies sein Durchbruch sein, eine Mannschaft aus alten Veteranen und hungrigen Amateuren. Die Mischung hat sich in League of Legends stets als Formel für Erfolg bestätigt und mit dem frisch entzündetem Feuer in Mightybear, könnte er vielleicht der neue Kang-Yun „Trick“ Kim der EU LCS sein.\n</p>","fr_FR":"<p>La vague de jeunes junglers talentueux venus de Corée du Sud ne s’arrête pas ! Après Cho « H0R0 » Jae-hwan chez Millenium, Kim « Reignover » Yeu-jin puis Lee « Spirit » Da-yoon chez Fnatic et Kim « Trick » Gang-yun chez G2 Esports, voici que Kim « Mightybear » Min-su débarque à son tour sur le Vieux Continent. Sa destination n’est autre que la structure française Team Vitality. </p>\n\n<p>Mightybear a fait ses premiers pas en Chine, notamment dans l’équipe Newbee, qui évoluait en LSPL, la deuxième division chinoise. En 2016, il n’a disputé aucun match compétitif car il était le remplaçant de Baek « Swift » Da-hoon. </p>\n\n<p>Son intégration au sein de sa nouvelle équipe a été facilitée par sa maîtrise déjà très bonne de l’anglais, ce qui a facilité le choix de Vitality. Sa vision de jeu et son agressivité devraient permettre à Vitality de trouver un second souffle. Sa mission reste périlleuse car il doit faire oublier Ilyas « Shook » Hartsema en se montrant plus régulier et en montrant plus d’initiative. </p>","pl_PL":"<p>Min-su „Mightybear” Kim, pomimo koreańskiego pochodzenia, karierę profesjonalnego gracza rozpoczął w Chinach. W grudniu 2014 roku dołączył do pierwszej esportowej organizacji w Krainie Smoków – do Positive Energy. W szeregach chińskiego zespołu udało mu się wziąć udział w wielu pomniejszych turniejach, a nawet zagrać przeciwko krajowym potęgom, takim jak LGD Gaming czy Team WE. Do swoich sukcesów z tego okresu może zaliczyć utrzymanie się w drugorzędnej lidze w Chinach. Jednak już w maju 2015 roku grał pod nową banderą, gdyż został wykupiony z całym zespołem przez inną organizację. Dołączył do drużyny Newbee, gdzie miał największe osiągnięcia podczas pobytu w Chinach. Wraz z zespołem miał okazję zawalczyć w kwalifikacjach do najbardziej prestiżowej ligi w Państwie Środka, czyli LPL. Jednak na jego drodze kolejny raz stanął zespół WE, przeciwko któremu nie pomogły nadzwyczajne umiejętności Min-su w grze Gragasem. </p>\n<p>W maju 2016 roku został zapytany przez swojego agenta czy chciałby profesjonalnie grać w Europie. Odpowiedź Min-su była zdecydowanie pozytywna. Już wtedy potrafił mówić po angielsku, więc nie widział żadnych przeszkód w dołączeniu do Team Vitality. „Mightybear” od początku zaskakiwał swoim pogodnym usposobieniem. W wywiadzie przed letnim splitem EU LCS 2016 stwierdził, że nie odczuwa presji i jest bardzo optymistycznie nastawiony do gry w Europie. Po przyjeździe na nowy kontynent był zachwycony wyglądem miast i stylem życia Europejczyków. Jak tylko stał się członkiem Team Vitality, to założył konta na portalach społecznościowych. Od razu rozpoczął bardzo aktywne życie na tych stronach, przepełnione elementami humorystycznymi związanymi z jego pseudonimem „Mightybear”.</p>\n<p>W piątym sezonie zauważalnie gustował w niezwykle twardych dżunglerach, chociaż za swoich ulubionych bohaterów uważa Nidalee i Gravesa. Najlepiej sobie radził Gragasem i Rek’sai, lecz zdarzało się również, że wybierał bohaterów innego typu, jak na przykład ukochaną Nidalee. Od maja 2016 roku, czyli przeprowadzki do Europy, coraz częściej można było zobaczyć go w akcji Gravesem i Kindred. Jego największym osobistym osiągnięciem było wejście do Kręgu Pretendenta w Korei, który to wyczyn udało mu się powtórzyć na serwerze EU West w czasie krótszym niż miesiąc. Imponującym osiągnięciem oczywiście pochwalił się na portalach społecznościowych.</p>\n\n"},"foreignIds":{"TRLH3":"1001310014","TRLH4":"1001270014","TRLH2":"1001250062","FRA1TMNT2":"45034","ESPORTSTMNT06":"200001028"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":2049,"slug":"lava","name":"Lava","firstName":"Taehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:26:19.000Z","updatedAt":"2017-07-01T23:40:36.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001525"},"socialNetworks":{},"champions":[],"liveGameTeam":108}],"scheduleItems":[{"id":"AVTGAP-hoUG4HPFjOJ9J","content":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:match:07dd03a6-735c-482b-ba54-12541d9573a8","scheduledTime":"2016-05-26T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db","blockLabel":"1","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:bracket:2819fc4e-457f-4242-96ad-0d9137aa9222"},"match":"07dd03a6-735c-482b-ba54-12541d9573a8","tournament":"a9a19798-6c5b-4383-ab27-e2bd08e224db","bracket":"2819fc4e-457f-4242-96ad-0d9137aa9222","league":"6"}],"gameIdMappings":[{"id":"7b159825-e621-4ff6-828b-84abff389e28","gameHash":"6c6e02cbaa52d729"},{"id":"16207543-dd0c-4858-895f-b6b49120deab","gameHash":"f01dc586326b789c"}],"videos":[{"id":2817,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:7b159825-e621-4ff6-828b-84abff389e28","source":"https://www.youtube.com/embed/lg2sJTNZ5QM?wmode=transparent&start=1450","createdAt":"2016-05-26T21:03:21.000Z","updatedAt":"2016-05-26T21:03:21.000Z","game":"7b159825-e621-4ff6-828b-84abff389e28"},{"id":2818,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:16207543-dd0c-4858-895f-b6b49120deab","source":"https://www.youtube.com/embed/lg2sJTNZ5QM?wmode=transparent&start=5604","createdAt":"2016-05-26T21:03:27.000Z","updatedAt":"2016-05-26T21:03:27.000Z","game":"16207543-dd0c-4858-895f-b6b49120deab"}],"htmlBlocks":[],"match":{"id":"07dd03a6-735c-482b-ba54-12541d9573a8","name":"ROX-vs-SSG","position":2,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"},{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],"games":{"4724b4d2-18e8-4853-8c2a-3d35a726336e":{"id":"4724b4d2-18e8-4853-8c2a-3d35a726336e","name":"G3","generatedName":"ROX|SSG|G3|07dd03a6735c482bba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"},{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"7b159825-e621-4ff6-828b-84abff389e28":{"id":"7b159825-e621-4ff6-828b-84abff389e28","name":"G1","generatedName":"ROX|SSG|G1|07dd03a6735c482bba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"},{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],"standings":{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464296415526,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464289961639,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}],[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}]],"timestamp":1464289460198,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1070225","gameRealm":"TRKR1","platformId":"TRKR1:1070225","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"16207543-dd0c-4858-895f-b6b49120deab":{"id":"16207543-dd0c-4858-895f-b6b49120deab","name":"G2","generatedName":"ROX|SSG|G2|07dd03a6735c482bba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"},{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],"standings":{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464296214146,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464289959264,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}],[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}]],"timestamp":1464289259266,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1070230","gameRealm":"TRKR1","platformId":"TRKR1:1070230","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464296214146,"source":"bestOf","history":[{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464296415527,"source":"bestOf","closed":true},{"result":[[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}],[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}]],"timestamp":1464289961639,"source":"bestOf","closed":true},{"result":[[{"roster":"bb8ec868-115c-47fc-86a9-77ef4f111941"}],[{"roster":"e4d20e06-d2d6-4018-b210-70e75f9d968f"}]],"timestamp":1464289259266,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"e4d20e06-d2d6-4018-b210-70e75f9d968f":1,"bb8ec868-115c-47fc-86a9-77ef4f111941":0}}}