{"teams":[{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84}],"scheduleItems":[{"id":"AVQMP_RgQMQFcjhwbQd6","content":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:match:0904dce8-2458-45b6-b8a9-f63f7177a920","scheduledTime":"2016-04-23T07:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","blockLabel":"Finals","subBlockLabel":"2","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:bracket:6a022e1e-4329-492b-87f3-62ee3ae39808"},"match":"0904dce8-2458-45b6-b8a9-f63f7177a920","tournament":"0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","bracket":"6a022e1e-4329-492b-87f3-62ee3ae39808","league":"7"}],"gameIdMappings":[],"videos":[{"id":2634,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:7379ad19-5c7f-49eb-b8a6-328bd86a570d","source":"https://www.youtube.com/embed/rx4jV2OERck?wmode=transparent&start=11329","createdAt":"2016-04-24T06:05:58.000Z","updatedAt":"2016-04-24T06:05:58.000Z","game":"7379ad19-5c7f-49eb-b8a6-328bd86a570d"},{"id":2635,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:857a677a-8b91-44ec-9f48-21d18af87f1c","source":"https://www.youtube.com/embed/rx4jV2OERck?wmode=transparent&start=3189","createdAt":"2016-04-24T06:08:14.000Z","updatedAt":"2016-04-24T06:08:14.000Z","game":"857a677a-8b91-44ec-9f48-21d18af87f1c"},{"id":2636,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:fa0e56c2-e295-4bf2-ab69-03b961d3d751","source":"https://www.youtube.com/embed/rx4jV2OERck?wmode=transparent&start=14746","createdAt":"2016-04-24T06:08:14.000Z","updatedAt":"2016-04-24T06:08:14.000Z","game":"fa0e56c2-e295-4bf2-ab69-03b961d3d751"},{"id":2637,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:91903639-0604-4709-95f9-3caf3f78ddf6","source":"https://www.youtube.com/embed/rx4jV2OERck?wmode=transparent&start=7148","createdAt":"2016-04-24T06:05:58.000Z","updatedAt":"2016-04-24T06:05:58.000Z","game":"91903639-0604-4709-95f9-3caf3f78ddf6"}],"htmlBlocks":[],"match":{"id":"0904dce8-2458-45b6-b8a9-f63f7177a920","name":"grand-final","position":0,"state":"resolved","groupPosition":3,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"games":{"7379ad19-5c7f-49eb-b8a6-328bd86a570d":{"id":"7379ad19-5c7f-49eb-b8a6-328bd86a570d","name":"G3","generatedName":"EDG|RNG|G3|0904dce8245845b6b8a","input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"standings":{"result":[[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a"}],[{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61"}]],"timestamp":1461439061721,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"91903639-0604-4709-95f9-3caf3f78ddf6":{"id":"91903639-0604-4709-95f9-3caf3f78ddf6","name":"G2","generatedName":"EDG|RNG|G2|0904dce8245845b6b8a","input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"standings":{"result":[[{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61"}],[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a"}]],"timestamp":1461439027803,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"fa0e56c2-e295-4bf2-ab69-03b961d3d751":{"id":"fa0e56c2-e295-4bf2-ab69-03b961d3d751","name":"G4","generatedName":"EDG|RNG|G4|0904dce8245845b6b8a","input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"standings":{"result":[[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a"}],[{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61"}]],"timestamp":1461439135298,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"857a677a-8b91-44ec-9f48-21d18af87f1c":{"id":"857a677a-8b91-44ec-9f48-21d18af87f1c","name":"G1","generatedName":"EDG|RNG|G1|0904dce8245845b6b8a","input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"standings":{"result":[[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a"}],[{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61"}]],"timestamp":1461438983383,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"bffc7bce-5f1e-4eee-8bbc-2d36865563f3":{"id":"bffc7bce-5f1e-4eee-8bbc-2d36865563f3","name":"G5","generatedName":"EDG|RNG|G5|0904dce8245845b6b8a","input":[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a","match":"caf768a1-2922-44dc-b2b3-f3b6005babc2","standing":0},{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61","match":"e0607574-cb7c-4642-b0c8-0eeb5ab3614e","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"5580ef87-0235-4c5f-a648-64daa185a35a"}],[{"roster":"5bad5086-1271-45bd-8a79-1c8e955efe61"}]],"timestamp":1461439135300,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}