{"teams":[{"id":21,"slug":"team-dignitas","name":"Team Dignitas","guid":"be6c8d0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-dignitas-c5j84saq.png","acronym":"DIG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-21T21:17:20.000Z","bios":{"en_US":"<p>From the ashes they rise (Phoenix1, is that you?). Dignitas looked all but lost to the NA LCS after they failed to re-qualify for the LCS, and consequently sold their Challenger spot to Apex Pride. But the League gods had other plans for the organization. In September of 2016 it was announced that both Dignitas and Apex had been bought by the Philadelphia 76ers. .</p>\n\n<p>The two entities were merged in order to play under a unified Dignitas banner, and thus a legendary League of Legends team was reborn. Sporting a roster mixed with domestic and international stars, Dignitas got off to a slow start but picked up steam near the end of the 2017 NA LCS Spring Split. Heading into summmer, Dignitas will look to build on their late-season success from spring -- let’s just hope they fare better than their basketball counterparts.</p>\n\n<p>Coach: David \"Cop\" Roberson</p>","fr_FR":"<p>Dignitas est un nom que tous les fans de League of Legends et d'e-sport en général connaissent au moins de réputation. Il faut dire qu'il s'agit d'une des plus vieilles organisations présentes sur le jeu, depuis l'acquisition en septembre 2011 de Rock Solid, l'équipe de Joedat « Voyboy » Esfahani, William « scarra » Li et Joshua « Jatt » Leesman (oui, le même Jatt qui est aujourd'hui l'un des commentateurs des LCS). Une entrée remarquée sur une scène qui n'était alors que bourgeonnante et surtout le début d'une belle aventure avec des joueurs qui, comme Michael « Imaqtpie » Santana sont aujourd'hui considérés comme des figures historiques de l'e-sport nord-américain.</p>\n\n<p>Malheureusement pour Dignitas, cette popularité a depuis longtemps du mal à être suivie de titres. L'organisation a tenté divers changements au fil des saisons, que ce soit au niveau de l'encadrement ou des joueurs, mais en vain. Si l'équipe américaine peut se targuer d'avoir toujours su maintenir sa place dans les LCS depuis la création de cette ligue, ils n'y ont jamais vu ne serait-ce qu'une finale des play-offs, sans même parler d'une qualification au Championnat du monde. Pire, lors du segment de printemps de la saison 5 l'équipe a terminé à la 9e place et a donc dû participer aux relégations. Certes, ils l'ont emporté avec 3 victoires pour 2 défaites contre Team Fusion, l'équipe de Choi « Huhi » Jae-hyun, à présent mid laner de Counter Logic Gaming, et ont conservé leur place dans les LCS. Mais ce n'est pas avec des performances pareilles que Dignitas allait satisfaire ses fans. Le segment d'été a bien mieux débuté pour l'équipe qui a culminé à 6 victoires pour seulement 2 défaites à l'issue de la 4e semaine de compétition.</p>\n\n<p>Mais, comme souvent avec ceux que leurs fans surnomment affectueusement « Dignitoss » pour leur capacité à jeter leur avance aux orties, le retour à la réalité fut rude. Après une deuxième partie de segment médiocre, l’équipe de Danny « Shiphtur » Le a terminé la saison régulière à la 4e place seulement avant d'être envoyée prématurément en vacances par Team Impulse dès le 4e tour des play-offs.</p>\n\n<p>Aujourd'hui, avec une équipe remaniée à coup de sang neuf européen, Dignitas entend bien faire taire, enfin, toutes les critiques.</p>","pl_PL":"<p>Team Dignitas stanowi jedną z najstarszych organizacji na światowej scenie esportowej. Jej powstanie miało miejsce 9 września 2003 roku w efekcie fuzji dwóch innych stowarzyszeń z gier FPS. Świetnie się rozwijała, więc po zainteresowaniu się i dodaniu kolejnych gier, w czerwcu 2004 roku została zarejestrowana jako spółka z o.o. Od tego czasu Team Dignitas ciągle się rozrasta, nabywając oddziały w kolejnych grach o bogatej scenie esportowej. Dywizja League of Legends powstała 22 września 2011 roku, poprzez nabycie graczy z zespołu Rock Solid. Pierwszym wpisem w długiej historii organizacji było pierwsze miejsce na IGN ProLeague, gdzie pokonali dobrze znane drużyny: Counter Logic Gaming i Curse Gaming. Od tego czasu często plasowali się w okolicy trzeciego miejsca w różnych turniejach. Ich największym osiągnięciem z pierwszych sezonów jest zostanie najlepszym zespołem po Moscow Five na 6 Mistrzostwach Świata IEM. Drużyna Team Dignitas miała również okazję zaprezentować się na Mistrzostwach Świata drugiego sezonu, lecz niestety nie udało się jej się wyjść z fazy grupowej.</p>\n<p>\nZe względu na stale rosnącą konkurencję po trzecim sezonie Team Dignitas dużo częściej znajdował się w okolicach 5 miejsca w różnej rangi rozgrywkach. Jednak ich były AD Carry „CoreJJ” podsumował ideologię Team Dignitas w krótkim zdaniu: „Naszym celem zawsze będzie znalezienie się na podium i kwalifikacja do Mistrzostw Świata, nie uważamy tego za zamiar nie do osiągnięcia.” Te słowa podkreślają świadomość organizacji w kwestii ostatnich niepowodzeń. Raz nawet zmierzyła się z groźbą relegacji, lecz wyszła z tej próby zwycięsko. Jednak cel Team Dignitas pozostaje jeden – szczyt NA LCS. </p>\n<p>\nSama organizacja jest znana z poświęcania uwagi portalom społecznościowym. Często wydaje różnego rodzaju poradniki, które mają być pomocą we wszystkich grach, które wspiera. Dba też o kadrę dla swoich drużyn. Do ich oddziału League of Legends 30 października 2015 roku jako menadżer dołączył Joe \"InnerFlame\" Elouassi, znanym z prowadzenia spraw SK Gaming, a potem Gamers2. Wraz z nim Team Dignitas podpisało kontrakt z Ramem \"Brokenshard\" Djemalem, powszechnie popularnym i bardzo doświadczonym zawodnikiem. Sama organizacja stara się też zakontraktować możliwie najlepszych graczy. Wielu światowej sławy zawodników i nie tylko wyszło właśnie spod skrzydeł Team Dignitas. Joshua \"Jatt\" Leesman, Joedat \"Voyboy\" Esfahani, William \"scarra\" Li i Alberto \"Crumbz\" Rengifo to tylko niektórzy z tłumu, który wyszedł z tej kuźni talentów.</p>\n","de_DE":"Sie erheben sich aus der Asche. Team Dignitas schien für immer aus der NA LCS auszuscheiden, nachdem sie sich zum ersten Mal nicht für die LCS qualifizieren konnten und ihren Platz in der Challenger Series an Apex Pride verkauft hatten. Aber die Götter von League hatten andere Pläne für die Organisation und im September 2016 verkündeten die Philadelphia 76ers, dass sie sowohl Dignitas als auch Apex gekauft hatten. \n</p>\nDie beiden Mannschaften wurden zusammengelegt, um unter dem Namen Dignitas zu spielen. Und so wurde die legendäre „League of Legends“-Mannschaft wiedergeboren. Mit einer Aufstellung aus heimischen und internationalen Stars will Dignitas versuchen, den Frühjahrs-Split der NA LCS 2017 zu gewinnen. Dank der neuen Führung und Aufstellung hat Dignitas eine Chance, die Liga im Sturm zu erobern – bleibt nur zu hoffen, dass sie sich besser schlagen als ihr Gegenstück im Basketball.\n</p>\nCoach: Jung Su Kim\n"},"foreignIds":{"drupalId":"3"},"players":[168,266,325,333,399,751,967],"starters":[168,266,325,399,751],"subs":[333,967]},{"id":167,"slug":"nrg-esports","name":"NRG Esports","guid":"be704c38-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/nrg-esports-2hxi3sw4.png","acronym":"NRG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:14:08.000Z","updatedAt":"2016-09-17T19:38:10.000Z","bios":{"de_DE":"<p>„NRG“ ist ein sogenanntes Gramogramm, eine Verkettung aus Buchstaben, die einzeln ausgesprochen zusammen wie ein Wort klingen – In diesem Fall ist dies das englische Wort Energy. Energiegeladen ist das Team allemal, wenn man sich dessen fünf Spieler anschaut. Ende 2015 wurde das Team unter der Führung von Gerard Kelly, Mark Mastrov, und Andy Miller gegründet, mit dem Ziel die Spitze der NA LCS zu erreichen und schließlich zur Weltmeisterschaft 2016 zu fahren. NRG ist keine Organisation, welche sich mithilfe von jungen Einzelranglistentalenten durch die NA Challenger Series gekämpft hat. Vielmehr besteht das Team aus altbackenen Veteranen, wilden Grünschnabel und etwas mittendrin. </p>\t\n\n<p>Eon-Young “Impact” Jeong und Changseok „GBM“ Lee sind zum einen die gebürtigen Koreaner und zum anderen die alten Herren unter den fünf Freunden. Sie haben viele Jahre Erfahrung auf dem Buckel und weisen den Schülern ihren Weg durch ihre eSports-Karriere. Johnny „Altec“ Ru spielte seit 2012 bereits unter vielen Bannern, doch einen internationalen Namen konnte er sich bisher noch nicht machen. An der Seite der zweieinhalb Veteranen stehen Galen „Moon“ Holgate und Kevin „KonKwon“ Kwon, welche noch im LCS-Rampenlicht zu stehen haben, zumindest mehr als vier Spiele. </p>\n\n<p>Auch das Team ist der Community nicht unbekannt. Tadayoshi \"Hermit\" Littleton war im Sommer 2015 noch der Analyst und Trainer Origens und ist nun der Strategiechef bei seinem neuen Zuhause. Charlie „Charlie“ Lipsie, ehemaliger Cloud9-Analyst besetzt die Cheftrainerstelle und Chad \"HISTORY TEACHER\" Smeltz hat seine Streaming-Persönlichkeit aufgegeben, um nun als NRGs Geschäftsführer zu fungieren. </p>\n\n<p>Die Frage ist wie bei vielen Mannschaften verschiedener Sprachen: Wie kommunizieren die Spieler eigentlich untereinander? Impact besitzt nach seinem einjährigen Aufenthalt in Nordamerika bereits über angemessene Englischkenntnisse, welche wiederum nur die nötigsten Wörter und Begriffe abdecken. GBMs Englisch lässt (noch) zu wünschen übrig und weder Altec noch Moon können koreanisch. Doch KonKwon macht das Team möglich. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat. Entweder sprachen alle Spieler eine gemeinsame oder die Kommunikation vereinfachte sich auf simple Ping-Signale. Da KonKwon als Kind in Seoul, Korea, aufgewachsen ist und mit acht Jahren in die USA zog, ist er bilingual und bildet so eine Brücke zwischen den zwei Sprachgruppen im Team. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat.  Wie der Knoten in der Mitte einer Fliege. </p>\n\n<p>Ganz im Ernst: Schaut doch mal auf die Uniformen NRGs. Die sind doch verdammt niedlich, oder? Wie kann man dieses Team und ihre bunten Fliegen nicht mögen? </p>\n","fr_FR":"<p>NRG fait son entrée dans les LCS avec une composition qui a de quoi faire peur. L'équipe a rassemblé certains des meilleurs vétérans et plusieurs des étoiles montantes les plus prometteuses de Corée et d'Amérique du Nord. D'anciens joueurs des LCK comme Chang-suk « GankedByMom » Lee et Eon-young « Impact » Jeong se retrouvent ainsi aux côtés de talents locaux comme Jonny « Altec » Ru. En fin de compte, leurs plus terribles adversaires pourraient bien être... eux-mêmes ! Composer une équipe qui mélange plusieurs cultures et langues différentes n'est pas un mince exploit. Toutefois, avec un tel niveau de maîtrise des mécaniques de jeu dans une seule équipe, on peut s'attendre à ce que RNG fasse sensation.</p>","pl_PL":"<p>Udział w wiosennym sezonie 2016 to debiut organizacji NRG Esports. Została założona, przez Andy’iego Millera i Marka Mastrova, dwóch współwłaścicieli Sacramento King’s – drużyny NBA. Ogłoszenie o powstaniu tej drużyny miało miejsce wkrótce po zakończeniu Mistrzostw Świata - 16 listopada 2015. Założyciele zdecydowali się przenieść swoje doświadczenie ze świata sportów klasycznych do profesjonalnych rozgrywek w League of Legends. Na swojej stronie NRG Esports zapowiedziało, że po debiucie będą dążyć do zdobycia podium NA LCS. Potem ich cel jest tylko jeden – Mistrzostwa Świata 2016.</p>\n<p>\nJak do tego doszło? W wywiadzie Andy Miller udzielił odpowiedzi na wiele nurtujących pytań dotyczących powstania NRG Esports. Opowiadał o tym jak dowiedział się o League of Legends: dwójka jego synów zainteresowała się League of Legends, a on, przysłuchując się im, stwierdził „Wow, to naprawdę interesujące i mainstreamowe!” Akurat wtedy skończył budowę nowego obiektu dla swojej drużyny NBA i zaczął się zastanawiać, dlaczego miałby się ograniczać tylko do klasycznych sportów. Od myśli do czynów, po 6 miesiącach poszukiwań Andy Miller zakupił drużynę Team Coast \ni założył organizację, która zajęła jej miejsce. Całość odbyła się dzięki pomocy Gerarda Kelliego, właściciela Team Imagine, który podzielił się z nim swoją wiedzą na temat gry, zespołów i organizacji. Współwłaściciel NRG Esports wyraził chęć zaangażowania się w marketing związany z League of Legends i zawodnikami, jako przykład podając swoje dotychczasowe sukcesy w świecie sportu. Zapowiedział również, że zamierza użyć doświadczenia zdobytego podczas zarządzania drużyną NBA, do promowania zawodników. Marzy o tym żeby zobaczyć tłumy fanów w koszulkach NRG Esports. Andy Miller już pokochał swoją drużynę. </p>\n<p>\nKolejna cecha charakterystyczna NRG Esports to jej załoga. Członkowie organizacji mają niesamowite zaplecze i wprawę w prowadzeniu profesjonalnej drużyny. Andy Miller i Mark Mastrov nie oszczędzali - wybrali najlepszych dostępnych specjalistów we wszystkich dziedzinach związanych z League of Legends. Dyrektorem generalnym jest Gerard Kelly, założyciel Team Imagine, który prawie dostał się do NA LCS. Jego doświadczenie będzie podstawą dla działań całej organizacji. Menadżerem został Chad “HISTORY TEACHER” Smeltz, dobrze wszystkim znany z opieki nad Team8. Dołączą do niego sławy takie jak: Tadayoshi “Hermit” Littleton, były instruktor Origen i Charlie “Charlie” Lipsie, były trener Cloud9. Wpływ wyżej wymienionych panów widać na występie ich byłych zespołów na Mistrzostwach Świata 2015. Drużyna Origen dostała się aż do półfinału, a Cloud9 pokazało klasę w pierwszym tygodniu meczy grupowych. Taka obsada personelu ma zapewnić graczom możliwie najlepszą kuratelę, żeby mieli pierwszorzędne warunki do rozwoju. Nic tylko pozazdrościć takiej kadry.</p>\n<p>\nNajważniejszym elementem nowej drużyny, z którym fani będą mieli najwięcej do czynienia, są oczywiście zawodnicy. Współzałożyciele NRG Esports wyszli z założenia, że ich perfekcjonizm musi również mieć odniesienie do graczy. Gerard Kelly odpowiada za wybór i zajmuje się rekrutacją najlepszych ze e-sportowców. Wraz z Andym Millerem rozważają nawet rozszerzenie organizacji o oddziały zajmujące się innymi grami. NRG Esports jako organizacja ma wszystko czego potrzeba do stania się potęgą w NA LCS – kochających właścicieli i troskliwą załogę. \n</p>","en_US":"<p>\nNRG entered the NA LCS 2016 Spring Split with a bang, going 3-0 in their first games. Unfortunately, while the roster they put together was jam packed with mechanical talent, they weren’t able to keep their success going. They’re taking a new approach for Summer: only Chang-suk “GankedByMom” Lee remains (along with his bowtie and shade wearing aesthetic), while the rest of the team has been replaced with some of the most dynamic personalities and fan favourites in North America. Quas? Check. Kiwikid? Check. Santorin? Check. Will they be able to translate the likability factor into results? Only time will tell. But at the very least they’ll be a blast to cheer for.\n</p>\n<p>\nCoach: Tadayoshi \"Hermit\" Littleton\n</p>"},"foreignIds":{},"players":[117,121,150,159,169,185,759],"starters":[121,150,159,185,759],"subs":[117,169]}],"players":[{"id":117,"slug":"otter","name":"Otter","firstName":"Brian","lastName":"Thomas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/otter-diqco9ek.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2016-05-23T19:16:51.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"341","TRLH2":"1001090004","TRLH1":"1001090008","FRA1TMNT1":"375280"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":150,"slug":"kiwikid","name":"Kiwikid","firstName":"Alan","lastName":"Nguyen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kiwikid-hrcovlc7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2016-06-09T21:08:33.000Z","bios":{"en_US":"<p>\nSome legends are remembered for their epic plays, some legends are remembered for their trophies, and others are remembered because well... they’re just so likable! Say hello to Alan “KiWiKiD’ Nguyen, but if you’ve watched nearly any NA LCS broadcast, you’ve already met him. He’s the support for Team Dignitas, or he was until they were knocked out of the NA LCS during the 2016 NA LCS Summer Promotion Tournament. For a sad while, it looked like we might be without our beloved KiWiKiD, but NRG brought him aboard. It wasn’t just because he’s a great chum, he’s also capable of great plays. He’s well known for locking down enemy teams with champions like Annie and Alistar. Sometimes he goes too aggressive or makes a misplay, but he’s always a delight to watch.\n</p>","fr_FR":"<p>Alan « KiWiKiD » Nguyen sera le support de Dignitas pour la saison 6 des LCS. Tout sauf une surprise tant le joueur est un pilier de l'équipe. Il y est en effet depuis 2012, d'abord comme top laner tout au long de la saison 3 puis au poste de support depuis.</p>\n\n<p>Très controversé comme top laner (il détient l'honneur douteux d'être le joueur le plus souvent mort en saison 3, tous postes confondus) le joueur américain a continué d'être sous le feu des critiques lors de sa transition vers son nouveau poste au début de la saison 4. Malgré tout, il a su faire le dos rond et continuer de se concentrer sur son jeu. Alors que d'autres joueurs ont été poussés à la retraite anticipée, incapables de gérer la pression du public, KiWiKiD a toujours semblé imperméable aux remarques et a continué de s'améliorer à son rythme. Bien lui en a pris puisque s'il n'est toujours pas considéré comme un joueur de classe mondiale, loin s'en faut, l'opinion générale s'accorde aujourd'hui sur le fait qu'il a largement le niveau pour jouer dans les LCS NA.</p>\n\n<p>Véritable roc de Dignitas du haut de ses 22 ans, il parvient bien souvent à imposer sa pression sur toute la carte depuis la voie du bas, notamment lorsqu’il peut incarner des supports ayant une forte capacité à engager le combat. Il aime particulièrement prendre l'initiative avec des personnages comme Nautilus ou Tresh qui peuvent se jeter au cœur de la bataille et résister aux assauts de la ligne de front adverse. Cette année encore et cette fois au côté de Apollo « Apollo » Price en voie du bas, ce sera à lui de porter son équipe par son expérience. Dans l'espoir de peut-être enfin côtoyer les sommets et donner à nouveau tort à toutes les critiques.</p>\n","pl_PL":"<p>Zawodnik powszechnie utożsamiany z Team Dignitas, dzięki jego długiemu stażowi w tej organizacji. Przed uzupełnieniem szeregów tej drużyny grał tylko przez ponad rok w UT Austin, uczelnianej drużynie z Texasu. Pochodzi z Austin, w Texasie, więc po prostu brał udział w lokalnych rozgrywkach. W tamtych czasach \"KiWiKiD\" był znany z agresywnego stylu gry. Został zwerbowany do Team Dignitas w grudniu 2012 roku, ze względu na ban ówczesnego junglera. „Crumbzz” przeniósł się do jungli, a Alan Nguyen zastąpił go na top-lanie. </p>\n<p>\nPo wejściu Alana w jego skład, Team Dignitas automatycznie zakwalifikował się do wiosennego sezonu NA LCS 2013. \"KiWiKiD\" brał udział w 3,4 i 5 sezonie NA LCS, co jest niezwykłym osiągnięciem. Na dodatek cały ten czas był w jednej drużynie, co świadczy o niezmienności i stabilności tego zawodnika. Jedyną poważną zmianą było przeniesienie się z pozycji na top-lanie na rolę supporta pod koniec sezonu trzeciego. Dobrze czuje się jako wspierający, aczkolwiek jego ulubionymi postaciami pozostał Renekton i Rumble, co przypomina o jego starej miłości do górnej linii. Na bot-lanie najchętniej gra bohaterami, którzy mają znaczne możliwości kontrolowania przeciwników, jak Thresh, Alistar i Annie. Zyskał znaczącą sławę, dokonując pięcioosobowego podbicia Minotaurem w grze przeciwko Team Fusion. Ponadto jego rozpoznawalność wzrosła kiedy był gościem wśród analityków.</p>\n<p>\nAlan pytany przez rodziców kim zostanie jak dorośnie odpowiadał: profesjonalnym graczem. Gdy wtedy żartował w ten sposób, nie wiedział jak dobrze trafił. Cały czas uważa to za zabawne, jak się potoczył jego los. Kiedy dostał smsa od Williama \"scarra\" Li’a ucieszył się, ale też bał się, że zostanie oszukany. Tym bardziej, że miał się przeprowadzić do Kaliforni. Od razu pochwalił się wszystkim swoim bliskim i okazało się, że rodzice Alana są bardzo zawiedzeni tą wiadomością. Na początku byli bardzo przeciwni, ale to się na szczęście zmieniło z czasem. Pomimo ich opinii na ten temat, \"KiWiKiD\" spakował się w ciągu 30 minut, wsiadł w auto i pojechał na spotkanie przygody z esportową sceną. Teraz uważa, że to co zrobił było trochę szalone, ale bez tego nie osiągnąłby sukcesu.</p>\n"},"foreignIds":{"drupalId":"21","TRLH1":"1001220077","TRLH2":"1001160127"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":169,"slug":"mancloud","name":"mancloud","firstName":"Zachary","lastName":"Hoschar","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/mancloud-6o5eeywa.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2016-08-04T18:26:08.000Z","bios":{"en_US":"Zachary \"mancloud\" Hoschar has showcased his skills as XDG's Mid Lane since the foundation of mTw.NA. Maintaining a varied champion pool, mancloud frequently breaks from convention. His style is a versatile one, playing aggressively, passively, pushing and roaming, all with the intent to counter his opponents’ tactics. When left to his own devices, he often defaults to his excellent Karthus play to carry his team to victory."},"foreignIds":{"drupalId":"36","TRLH1":"1001060001","TRLH2":"1001050002"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":167},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":325,"slug":"adrian","name":"Adrian","firstName":"Adrian","lastName":"Ma","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/adrian-d97sgu2b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-08-04T00:05:38.000Z","bios":{"en_US":"<p>Adrian \"Adrian\" Ma might not be known for his playmaking. But that doesn't mean he isn't a vital part to his team's successes. As a member of Immortals, he was the yin to Huni's yang, balancing his top laner's aggression with his own methodical, thoughtful playstyle. He's always ready to save his teammates and focuses heavily on warding, map movements and strategizing. He pioneered a trend in the 2016 NA LCS Summer Split of playing ranged supports like Karma and Soraka over the favoured melee champions.</p>","fr_FR":"<p>À 18 ans, Adrian « Adrian » Ma s'apprête à entamer sa deuxième année en tant que joueur professionnel de League of Legends, au poste de support pour l'équipe Immortals.</p>\n\n<p>Auparavant, il a passé un peu plus d'un an comme support de LMQ en remplacement de Zhang « Mor » Hong-Wei, retourné jouer en Chine. Recruté par une équipe alors en pleine restructuration et qui a d'ailleurs changé de nom pour l'actuel, Team Impulse, quelques semaines seulement après l'arrivée d'Adrian, le jeune joueur américain a pris un risque en signant son contrat. Un pari qui s'est vite révélé gagnant puisque Team Impulse a su, après quelques semaines d'adaptation, trouver les clés pour s'imposer comme l'une des principales menaces des LCS NA. Ils n'ont en revanche pas su concrétiser leur domination lors des play-offs, terminant à la quatrième place lors du segment de printemps puis d'été. Pire, ils n'ont pas réussi à se qualifier pour les championnats du monde, malgré un rang de tête de série numéro 2, lors du tournoi de qualification régional pour la troisième place nord-américaine de la compétition la plus importante de l'année.</p>\n\n<p>Au niveau individuel, Adrian a malgré tout prouvé lors de sa première année au plus haut niveau qu'il est un joueur versatile, capable d’incarner des champions différents en fonction des besoins de l'équipe. Il a aussi montré qu'il savait réagir rapidement et protéger ses coéquipiers même dans des situations inattendues. Une qualité forcément utile pour soutenir un carry AD tel que Jason « WildTurtle » Tran, son nouveau comparse chez Immortals, connu pour être parfois trop agressif lors des combats d’équipes.</p>\n\n<p>Au sein d'une équipe ayant l'expérience de la scène compétitive, le support américain bénéficie en tout cas d’une occasion en or pour passer du statut de jeune joueur prometteur à celui de star titrée au plus haut niveau.</p>\n","pl_PL":"<p>Adrian poznał dzieło Riot Games grając z przyjaciółmi, wkrótce prześcignął ich i znalazł się w akademickim zespole. Jako członek amatorskiej drużyny, brał udział w Challenger League, skąd było bardzo blisko do Challenger Series. Jednak jego zainteresowanie League of Legends zbiegło się w czasie z pójściem na studia. Miał świadomość, że profesjonalna gra pochłania naprawdę dużo codziennego czasu na ćwiczenia, podobnie jak nauka na poziomie uniwersyteckim. Przez to miał wiele wątpliwości, m.in. czy warto porzucić naukę na rzecz esportowej kariery i czy w ogóle ma szanse się wybić. W podjęciu decyzji pomógł mu trener drużyny esportowej, który dał ogłoszenie w sieci o college’u przyjaznym zawodowym graczom. Adrian na początku nie chciał w to uwierzyć. Kiedy się przekonał, że to prawda, podjął decyzję o zaangażowaniu się w scenę League of Legends. Został jednym z pierwszych graczy wspieranych przez uczelnię - Robert Morris University w Illinois.</p>\n<p>\nChociaż \"Adrian\" grał w profesjonalnych drużynach od marca 2014 roku, pokazał się dopiero w Team Impulse w grudniu tego roku. Wraz z tą organizacją zaistniał jako solidny zawodnik, jeden z najlepszych. Niestety zarówno w wiosennym sezonie NA LCS 2015, jak i w letnim skończył na czwartej pozycji, tuż przed podium. Wiązało się to z licznymi problemami, które na swojej drodze po zwycięstwo napotkała jego drużyna. Był blisko dostania się do Mistrzostw Świata, lecz ostatecznie nie udało mu się do nich zakwalifikować. Jednak występy Adriana zrobiły wrażenie na właścicielach organizacji Immortals, której szeregi zasilił w grudniu 2015 roku, a następnie, wraz z nimi zawalczył o więcej w wiosennym sezonie NA LCS 2016.</p>\n<p>\nAdrian to osoba lubiana w środowisku League of Legends, pierwotnie znany jako „10q”, ponieważ fonetycznie brzmiało jak „thank you”. Pochodzący z Texasu support jest znany z doskonałej kontroli wizji na mapie. Przepada za graniem bohaterami, którzy potrafią przyciągnąć nie tylko uwagę przeciwnika, ale także jego postać. Ulubionymi wyborami Adriana są Thresh i Blitzcrank. Dzięki występom w NA LCS i wysokiej pozycji w Kręgu Pretendenta zdobył skromne grono wielbicieli. Na pytania fanów „jak sobie radzi” odpowiada: „Nie pozwalam żeby cokolwiek poza grą mnie rozpraszało, skupiam się na meczu. Po prostu daję z siebie wszystko i nie martwię się co sądzą inni. \nW ogóle w takich sytuacjach się nie denerwuję.” Z takim nastawieniem ma zamiar spełnić swoje marzenie – znaleźć się w drużynie, która zajmuje czołowe miejsce w NA LCS.\n</p>","de_DE":"Adrian „Adrian“ Ma wäre der Erste, der dir sagen würde, dass er kein Spielmacher ist. Aber das bedeutet nicht, dass er keine tragende Rolle für den Erfolg seines Teams spielt. Als Mitglied der Immortals war er das Yin zu Hunis Yang. Die Aggressivität seines Top-Laners konnte er mit seinem methodischen, durchdachten Spielstil ausgleichen. Er ist stets bereit, seinen Teamkollegen zu helfen, und legt großen Wert auf die Platzierung von Augen, Bewegungen auf der Karte und das Entwickeln von Strategien. Er war es, der im Sommer-Split der NA LCS 2016 den Trend zu Fernkampf-Supportern wie Karma und Soraka gesetzt und die zu diesem Zeitpunkt beliebteren Nahkampf-Champions abgelöst hat.</p>\n\nObwohl er sich mit Phoenix1 einem neuen Team anschließt, sollte sich Adrians Spielstil 2017 kaum verändern. Dieses Mal muss er der Gegenpol seines aggressiven Junglers Inori sein. Adrian sorgt vielleicht nicht für Spiele-Highlights, aber er wird auf jeden Fall eine Schlüsselrolle in Phoenix1s neuer Mannschaft spielen.\n"},"foreignIds":{"drupalId":"3041","TRLH1":"200000236","TRLH2":"200000140"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":751,"slug":"ssumday","name":"Ssumday","firstName":"Chan-ho","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssumday-h9yau0jj.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-27T01:00:31.000Z","bios":{"en_US":"<p>Chan-ho \"Ssumday\" Kim is a feared top laner -- and justifiably so. Widely regarded as one of the world’s premier top laners, Ssumday spent a majority of his career with KT Rolster before becoming one of the most sought after free agents of 2016 and moving to North America to join up in the rebirth of Team Dignitas.</p>\n\n<p>Ssumday’s insanely deep champion pool gives the opposition no chance to shut him down in picks and bans. He poses a serious threat no matter the champion. Need him to tear apart the enemy with magic? Give him Ryze. Oh, you needed a tank to help lock down those pesky damage dealers? Gift him Maokai. Need to cut tanks down to size? Let him slice and dice with Fiora. Sometimes, it feels like Ssumday leaves you with just one option: lose.</p>","fr_FR":"<p>Sur la voie du haut, KT Rolster dispose de Chan-ho « ssumday » Kim, l'un des jeunes loups coréens, tout juste âgé de 19 ans. En dépit de sa jeunesse, ssumday est redouté, et à juste titre. Ssumday a été élu meilleur joueur du Segment d'été des LCK 2015 avec un ratio KDA de 5,22 qui le place en tête du Segment. Concédez-lui un mètre, il vous prend un kilomètre. Essayez, si vous ne me croyez pas.\n</p>\n<p>\nSsumday est efficace avec les mages et les combattants, mais au cours du Segment d'été des LCK c2015, il a surtout dominé avec des tanks. À plusieurs reprises, il a pris KT Rolster sur ses épaules et l'a portée jusqu'à la ligne d'arrivée. S'il met les mains sur Maokai ou Shen, vous devez préparer de quoi vous désengager, parce que ssumday vous poursuivra jusqu'aux extrémités de la carte pour réussir une élimination.\n</p>","pl_PL":"<p>Górny KT Rolster, Chan-ho „ssumday” jest jednym z najmłodszych Koreańczyków – ma Tylko 19 lat. Pomimo młodego wieku ssumday jest niezwykle przerażającym górnym – i całkiem słusznie. Został on wybrany najlepszym graczem letniego splitu LCK 2015, zajmując 1. miejsce ze stosunkiem zabić do zgonów wynoszącym 5,22. Jeżeli dacie mu dłoń, weźmie całą rękę. I to nie jest przesada.\n</p>\n<p>\nSsumday gra niezwykle skutecznie magami i wojownikami, ale większość meczów podczas letniego splitu LCK 2015 rozegrał obrońcami. Wiele razy ciągnął ze sobą całe KT Rolster i doprowadzał ich do linii mety. Jeżeli uda mu się dorwać Maokaia lub Shena, lepiej, żeby wasza drużyna miała jakiś sposób na przerwanie walki, ponieważ ssumday będzie was ścigał na kraniec świata, aby zagwarantować zabójstwo.\n</p>","de_DE":"Chan-ho „Ssumday“ Kim ist ein gefürchteter Top-Laner – und das zu Recht. Ssumday gilt als einer der besten Top-Laner der Welt und hat den Großteil seiner Karriere bei KT Rolster verbracht, bevor er 2016 zu einem der begehrtesten mannschaftslosen Spieler wurde und nach Nordamerika zog, um Teil der Wiedergeburt von Team Dignitas zu werden.\n</p>\nSsumdays unglaublich umfangreicher Championpool macht es seinen Gegnern nahezu unmöglich, ihn aufzuhalten. Er ist immer eine Gefahr, egal, mit welchem Champion er spielt. Soll er die gegnerische Mannschaft mit Magie vernichten? Gib ihm einfach Ryze. Oh, du brauchst einen Tank, der die lästigen Schadensverursacher ausschaltet? Gib ihm Maokai. Brauchst du jemanden, der die Tanks unschädlich macht? Gib ihm Fiora und sieh dabei zu, wie er sie in Stücke schneidet. Wenn du ihn nicht mit Bannen unschädlich machst, bleibt dir meistens nur noch eine Option: verlieren.\n","es_ES":"<p>Chanho \"ssumday\" Kim es uno de los jugadores más jóvenes del panorama competitivo de Corea del Sur, con sólo 19 años. A pesar de su juventud, es un top temido por sus enemigos -- y con razón. Ssumday fue elegido mejor jugador del Split de verano de 2015 con un KDA de 5.22 a lo largo de la temporada. </p>\n\n<p>Ssumday rinde tanto con magos como luchadores, pero en el Split de verano de la LCK 2015 donde mejor ha rendido ha sido con tanques. No han sido pocas las veces en las que se ha echado el equipo a la espalda y lo ha llevado a la victoria. Si consigue jugar con Maokai o Shen, más vale que escojas campeones que puedan quitártelo de encima, porque ssumday te perseguirá hasta el fin del mundo si hace falta para acabar contigo. </p>\n","pt_BR":"<p>O topo da KT Rolster, Chan-ho \"ssumday\" Kim, é uma das jovens armas da Coreia, com apenas 19 anos de idade. Apesar de novo, ssumday é um topo muito temido - e isso é justificável. Ele foi votado como o Melhor Jogador da LCK de Verão 2015, sendo campeão de A/M/A com 5.22 durante a etapa. Dê um centímetro de espaço, e ele pegará um quilômetro. E não, não foi uma piada.\n</p>\n<p>\nSsumday é competente com magos e lutadores, mas a maioria de suas atuações dominantes na LCK de Verão em 2015 foi com tanques. Em múltiplas ocasiões ele colocou a KT Rolster nas costas e carregou até a linha final. Se ele colocar as mãos no Maokai ou no Shen, tenha a certeza de que você vai trazer um pouco de contra-iniciação, porque Ssumday vai te caçar até o fim do mundo.\n</p>"},"foreignIds":{"drupalId":"2147","TRLH1":"200000192","TRLH2":"200000096"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":759,"slug":"gbm","name":"GBM","firstName":"Chang-suk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gbm-o8g887p.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-28T01:24:16.000Z","bios":{"en_US":"","fr_FR":"<p>Ne lui donnez surtout pas Orianna. S'il y a une leçon que tous ceux qui affrontent GBM finissent par \n\nretenir, c'est qu'il ne faut jamais, <em>au grand jamais</em> donner à Chang-seok « GBM » Lee son \n\nchampion préféré, la Demoiselle mécanique. Certaines équipes ont commis cette erreur lors du segment \n\nd'été des LCK 2015, et elles se sont retrouvées face à un monstre avec un KDA de 22. Si GBM parvient à \n\nmaîtriser quelques autres champions aussi bien qu'Orianna, il sera à n'en pas douter un joueur des plus \n\nredoutables sur la voie du milieu.</p>\n\n<p>GBM aura peut-être une nouvelle chance d'exceller avec son champion de prédilection maintenant qu'il \n\nest passé aux LCS NA pendant l'intersaison 2015. C'est un tout autre monde, rempli de mid laners qui ne \n\nsavent pas encore ce dont GBM est capable.</p>","pl_PL":"<p>Mid-laner NRG Esports nie był bardzo popularny poza Koreą – swoją legendę w Ameryce zaczął pisać 16.11.2015, w momencie dołączenia do drużyny Gerarda Kelliego. Jego debiut w NA LCS to wiosenny sezon 2016. W swojej ojczyźnie był uważany za jednego z najlepszych graczy na środkowej alei. Lee \"GBM\" Chang-seok był członkiem dobrze znanych zespołów: CJ Entus Frost i Jin Air Green Wings, więc nie można odmówić mu doświadczenia w grze na najwyższym poziomie. Olbrzymi wpływ na jego rozwój mieli Kang \"Ambition\" Chan-yong i Jung \"RapidStar\" Min-sung. Jungler CJ Entus zainspirował „GBM” do nauki gry Orianną, do wejścia na sam szczyt w pierwszym sezonie. Motywacja była tak silna, że do dzisiaj jest powszechnie uważany za jedną z najlepszych Mechanicznych Baletnic na świecie. Z tego też powodu często jest nazywany „mistrzem Orianny”. Z kolei, emerytowany już, legendarny \"RapidStar\" był jednym z bliższych przyjaciół Lee’a Chang-seoka. Wzajemnie się uczyli, razem ćwiczyli nowe zagrania i dzielili rolę mid-lanera w CJ Entus. Takiego kolegi pozazdrościłby każdy gracz.</p>\n<p>\nWiele osób może się zastanawiać co oznacza przydomek mid-lanera NRG Esports, który na pierwszy rzut oka przypomina przypadkowy zlepek liter. Tymczasem on ma długą i zabawną historię. „GBM” to pierwsze litery oryginalnego nicka Lee’a Chang-seoka – „Ganked By Mom”. Młody Koreańczyk zdecydował się na taki pseudonim, ze względu na to, że został wielokrotnie przyłapany w środku nocy przez swoją matkę na grze w League of Legends. Pierwotnie brzmiał on „mom critical”, ale ze względu liczną publikę z zachodu został zmieniony na „zgankowany przez matkę”. Jak widać troska kochających matek koliduje z planami również wielkich graczy.</p>\n<p>\nJego zasób bohaterów poraża swoim rozmiarem. W piątym sezonie grał ponad 10 różnymi postaciami, a tylko tyloma prawdopodobnie ze względu na ich siłę w obecnej mecie. Oprócz zjawiskowej gry Orianną, wyróżnił się niezwykle skuteczną grą Viktorem i Lulu. Można śmiało powiedzieć, że „GBM” był w lidze koreańskiej jednym z poważanych i uniwersalnych mid-lanerów. Wykształcił swój talent wśród najlepszych i z takim nastawieniem przyjechał do Ameryki. Organizacja NRG, zaraz po ogłoszeniu swojego istnienia, umieściła na stronie jego słowa: „Moim celem jest zawsze być numerem jeden”. W nastawieniu Lee’a \"GBM\" Chang-seoka nie ma niedopowiedzeń.\n</p>","de_DE":"<p>Chang-suk „GBM“ Lee geht 2017 neue Wege. Er hat eine neue Mannschaft, nennt eine neue Region sein Zuhause und spielt auf einer neuen Position. Als seine ehemalige Mannschaft, NRG Esports, aus der NA LCS abstieg, begab sich der langjährige Mid-Laner auf die Reise über den großen Teich, um sich Team Vitality anzuschließen und dort um die Junglerposition zu kämpfen.\n\nEr mutet sich viel zu, denn er will in kürzester Zeit eine neue Rolle lernen und sich auf die LCS vorbereiten, aber GBM sucht im neuen Jahr die Herausforderung. Aber egal, ob er oder Djoko schlussendlich als Jungler eingesetzt wird, der Gewinner ist in jedem Fall Team Vitality.</p>"},"foreignIds":{"drupalId":"2160","TRLH3":"200000129","TRLH4":"200000227","ESPORTSTMNT02":"200002218","TRLH1":"200000714"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":967,"slug":"big","name":"Big","firstName":"Terry","lastName":"Chuong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/big-9eh6ixp9.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:09:32.000Z","updatedAt":"2017-06-14T20:10:51.000Z","bios":{"fr_FR":"<p>Terry « BIG » Chuong, connaît déjà les LCS NA, mais seulement en tant que remplaçant.</p> \n\n<p>Celui qui se faisait auparavant appeler « Baby » a découvert les studios des LCS lors de la 11e semaine du segment d'été de la saison 2014 au sein de CLG, en remplacement des joueurs de l'équipe première partis s’entraîner en Corée du Sud. Il est ensuite retourné acquérir de l'expérience au sein de la scène challenger nord-américaine chez Storm, au côté de Samson « Lourlo » Jackson, à présent top laner de Team Liquid, et Zachary « Mandatorycloud » Allan, ancien mid laner de XDG. Puis retour en LCS en 2015 lors des trois premiers matchs du segment d'été en tant que support de Team Dragon Knight. Une expérience difficile pour le joueur dans une équipe réunie à la va-vite en raison de l'impossibilité pour l'organisation de faire venir ses titulaires en NA à temps pour le début de la saison.</p>\n\n<p>Pas dégoûté du monde professionnel pour autant, Big est derechef retourné sur la scène challenger, cette fois au sein d'Imagine. Equipe dans laquelle le joueur s'est retrouvé support d'un carry AD français, Pierre « Steeelback » Medjald, fraîchement débarqué en NA après la fin de son contrat chez Fnatic. Une opportunité sans nulle doute formatrice pour le joueur, même s'il n'a pas réussi à se qualifier en LCS avec cette équipe, défaite 3 victoires à 1 par Team 8 lors du tournoi de promotion. </p>\n\n<p>Qu'à cela ne tienne, Baby est aujourd'hui de retour en LCS NA, enfin en tant que titulaire. Il est certes une fois de plus dans un effectif qui pose plus de questions qu'il n'apporte de certitudes, mais ça n'en reste pas moins une occasion en or pour lui de montrer quel est véritablement son niveau. </p>\n","en_US":"<p>\nYou may know Terry “Big” Chuong from his time spent on Team Dragon Knights. While the organized LCS competition tore TDK apart, Big’s presence in the bot lane did not go unnoticed. He caught the eye of Echo Fox, and was brought on board for the 2016 NA LCS Spring Split.\n</p>\n<p>\nBig has proven to be a protector down to his very bones -- Alistar, Janna, and Braum were his supports of choice. But FOX had their fair share of struggles in spring. Now with a new shot in Dignitas's bot lane, he'll have to prove he's up to the challenge.\n</p>","pl_PL":"<p>Terry bardzo wcześnie zaczął swoją przygodę w wirtualnym świecie, ponieważ w wieku 8 lat już czuł się tam jak ryba w wodzie. Był zafascynowany League of Legends od wydania wczesnej bety, w szczególności uwielbiał grać Heimerdingerem. Sceną esportową zainteresował się dopiero za sprawą prośby przyjaciela żeby zajął pozycję junglera w jego drużynie. „BIG” doskonale się wtedy sprawdził w profesjonalnych meczach, w związku z czym podjął wyzwanie osiągnięcia czegoś w tej dziedzinie. Od października 2013 roku do stycznia 2016 roku starał się znaleźć drużynę, wraz z którą dostanie się do NA LCS. Nie powiodło mu się, ale wielokrotnie był o włos od tego wyczynu. Jednak szczęście mu dopisało i został zauważony przez swoich przeszłych przeciwników – Team Dragon Knights. Dzięki temu miał okazję zostać substytutem dla ich supporta w pierwszych tygodniach letniego sezonu NA LCS 2015. Zyskał bezcenne doświadczenie w profesjonalnej lidze, lecz nie udało mu się spełnić marzeń. Kolejny raz los uśmiechnął się do niego w styczniu 2016 roku kiedy został zaproszony do głównego składu nowo utworzonej drużyny Echo Fox. Pod lisim sztandarem zadebiutował w rozgrywkach NA LCS 2016 w okresie wiosennym.</p>\n<p>Urodzony w Los Angeles, w Kaliforni, wcześniej w karierze znany jako „Baby”, Terry nie jest dedykowanym supportem. Lubi zajmować rolę wspierającego w drużynie, lecz na początku swojej kariery doskonale odnalazł się w jungli. Ponadto oświadczył, że aktualnie, jeśli by nie grał na bot-lanie to zdecydowałby się na objęcie pozycji mid-lanera. Póki co „BIG” dobrze się czuje w roli wspierającego, w szczególności jeżeli kompozycja drużyny pozwala mu na wybór bohatera o olbrzymiej ilości punktów zdrowia. Gustuje w postaciach takich jak Thresh, Braum i Nautilus. Styl gry Terry’ego najlepiej charakteryzuje zawrotna ilość asyst podczas rankingowych meczów – jak na prawdziwego supporta przystało.</p>\n"},"foreignIds":{"ESPORTSTMNT02":"200000673","TRLH1":"200000614"},"socialNetworks":{},"champions":[],"liveGameTeam":21}],"scheduleItems":[{"id":"AVIUtHJhOPWArxM1l4ZU","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:113795d3-6119-4330-a645-b5bdb44ae6a6","scheduledTime":"2016-02-20T20:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"6","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"113795d3-6119-4330-a645-b5bdb44ae6a6","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"56635435-70ef-413e-a348-0160f10d363a","gameHash":"15a0d2482f0fdb1b"}],"videos":[{"id":1000,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:56635435-70ef-413e-a348-0160f10d363a","source":"https://www.youtube.com/embed/wyzlVMkUOv0?wmode=transparent","createdAt":"2016-02-20T21:54:31.000Z","updatedAt":"2016-02-20T21:54:31.000Z","game":"56635435-70ef-413e-a348-0160f10d363a"}],"htmlBlocks":[],"match":{"id":"113795d3-6119-4330-a645-b5bdb44ae6a6","name":"NRG-vs-DIG","position":18,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"},{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}],"games":{"56635435-70ef-413e-a348-0160f10d363a":{"id":"56635435-70ef-413e-a348-0160f10d363a","name":"G1","generatedName":"DIG|NRG|G1|113795d361194330a64","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"},{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}],"standings":{"result":[[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],[{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}]],"timestamp":1456001599862,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001570004","gameRealm":"TRLH1","platformId":"TRLH1:1001570004","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],[{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}]],"timestamp":1456001599862,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}