{"teams":[{"id":6,"slug":"ahq-e-sports-club","name":"ahq e-Sports Club","guid":"be6c7c1d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ahq-e-sports-club-iozw902p.png","acronym":"AHQ","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-05-30T21:10:24.000Z","bios":{"en_US":"<p>ahq e-Sports Club is one of the top League of Legends teams in Taiwan, and they have consistently battled for the regional title. However, with multiple GPL Championship victories, ahq is now dead set on being the best in the world. Can they rise to new heights in 2017 and earn another spot at the World Championship?</p>\n<p>Coach: Shang-Ching \"Greentea\" Tsai</p>","fr_FR":"Ahq e-Sports Club est l'une des meilleures équipes de League of Legends à Taiwan. Elle a constamment été en lutte avec les champions du monde de la Saison 2, Taipei Assassins, pour le titre régional à Taiwan. Cependant, avec de nombreuses victoires en GPL, AHQ est sur les rails pour devenir la meilleure équipe du monde. Pourront-ils atteindre les sommets de leurs compatriotes de TPA et remporter le championnat du monde ?","pl_PL":"Ahq e-Sports Club jest jedną z najlepszych tajwańskich drużyn League of Legends. Regularnie mierzyli się w walce z mistrzami świata Sezonu Drugiego, Taipei Assassins, o tytuł mistrza regionalnego Tajwanu. Jednakże po kilku zwycięstwach w mistrzostwach GPL, AHQ pragnie zostać najlepszą drużyną na świecie. Czy uda im się osiągnąć taki sam sukces, jaki osiągnęli ich tajwańscy rywale TPA, i wygrać mistrzostwa świata?","de_DE":"<p>ahq e-Sports Club ist eine der besten „League of Legends“-Mannschaften in Taiwan. Sie haben immer wieder mit den Weltmeistern von Saison 2, den Taipei Assassins, um die Titel in Taiwan gekämpft. Mit mehreren Siegen bei der GPL Championship hat ahq jetzt jedoch nur noch ein Ziel: Sie wollen die besten der Welt werden. Können sie in die Fußstapfen ihrer taiwanesischen Landsleute treten und die Weltmeisterschaft gewinnen?</p>","es_ES":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends de Taiwán. No han dejado de luchar por el título regional de Taiwán contra los campeones mundiales de la segunda temporada, los Taipei Assassins. Sin embargo, con múltiples victorias en el campeonato GPL, ahq va camino de convertirse en el mejor equipo del mundo. ¿Podrán elevarse a las alturas de sus compañeros taiwaneses TPA y ganar el Campeonato Mundial?</p>","pt_BR":"A ahq e-Sports Club é uma das melhores equipes de League of Legends de Taiwan. Eles têm competido consistentemente com a Taipei Assassins, os Campeões Mundiais da 2º Temporada, pelo título regional taiwanês. Mas agora com diversas vitórias na GPL, a ahq está determinada a ser a melhor do mundo. Será que eles conseguirão alcançar as mesmas alturas que seus companheiros taiwaneses da TPA e vencer o Campeonato Mundial?","es_AR":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends en Taiwán. Ha luchado constantemente con los Campeones Mundiales de la 2da Temporada, los Taipei Assasins, por el título Regional de Taiwán. Sin embargo, con varias victorias de Campeonato GPL, ahq ahora está concentrado completamente en ser el mejor equipo del mundo. ¿Podrán escalar hasta la cima conseguida por su compatriota equipo taiwanés TPA y ganar el Campeonato Mundial?</p>\n\n<p><strong>Entrenador: Chen \"Backstairs\" Yan-Fu</strong></p>"},"foreignIds":{"drupalId":"949"},"players":[20,34,35,302,407,408,1019],"starters":[20,35,302,407,408],"subs":[34,1019]},{"id":91,"slug":"flash-wolves","name":"Flash Wolves","guid":"be6e12bc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-hksj5z2h.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-72ikguj5.png","acronym":"FW","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T17:45:02.000Z","bios":{"en_US":"<p>\nThe Flash Wolves are one of the most successful and storied teams in the LMS, and are hungry for another shot at the world stage. They’re no strangers to playing against global teams with the world watching; they've built a reputation as one of the only teams to consistently take games off world champions SK telecom T1. The players have spoken often and publicly about their drive to keep pushing LMS as a strong region that can compete with the best.\n</p>\n<p>\nOriginally founded in 2013, the Flash Wolves have consistently maintained their strength in the LMS. They've captured three straight LMS titles going back to last year. The team isn’t happy with running roughshod over the competition in their native region, though -- they’re gearing up to take the fight to the champions of each region.\n</p>\n\n<p>Coach: Chou “Steak” Frank</p>","fr_FR":"Les Flash Wolves sont l'une des équipes des LMS qui ont obtenu les plus grands succès et dont on a le plus parlé, et ils ont hâte de bénéficier d'une nouvelle chance sur la scène mondiale. Ils sont habitués à affronter des équipes internationales sous le regard du monde entier ; ils comptent même parmi les rares organisations à battre systématiquement les champions du monde de SK Telecom T1. Les joueurs ont souvent et publiquement parlé de leur désir de faire des LMS une puissante région capable d'affronter les meilleurs.\n\nFondée en 2013, l'équipe Flash Wolves a constamment maintenu son niveau aux LMS. Ils détiennent d'ailleurs le titre de champions LMS depuis trois années consécutives. Mais l'équipe ne veut pas se contenter de ces succès locaux : elle a bien l'intention d'affronter les champions de toutes les régions et de prouver qu'elle est de taille à attaquer n'importe quelle horde au Mid-Season Invitational 2017.\n\nEntraîneur : Chou « Steak » Frank\n","pl_PL":"Flash Wolves są jedną z najlepszych drużyn w LMS, a jej członkowie po raz kolejny spróbują sięgnąć po chwałę na światowej arenie. Gra przeciwko najwyższej klasy drużynom na oczach całego świata nie jest im obca; zdobyli sobie reputację jednej z niewielu drużyn, które konsekwentnie wygrywają mecze z mistrzami świata, SK Telecom T1. Zawodnicy drużyny często publicznie wspominają, że chcą zaprezentować LMS jako silny region, który może rywalizować z najlepszymi.\n\nZałożona w 2013 roku drużyna Flash Wolves stale osiąga dobre wyniki w LMS. Do zeszłego roku zdobyła trzy tytuły LMS z rzędu. Drużyna nie jest jednak usatysfakcjonowana poniewieraniem lokalnymi rywalami — przygotowuje się do walki z mistrzami  regionów, aby dowieść, że jest watahą, która potrafi pokonać najlepszych na Mid-Season Invitational 2017.\n\nTrener: Chou „Steak” Frank\n","de_DE":"Die Flash Wolves sind eine der erfolgreichsten und bekanntesten Mannschaften der LMS und wollen sich endlich einen internationalen Titel sichern. Sie sind es gewohnt, gegen Mannschaften aus anderen Regionen zu spielen, während die Welt zusieht, und gehören zu den wenigen Mannschaften, die gegen die Weltmeister von SK Telecom T1 gewinnen können. Die Spieler haben auch in der Öffentlichkeit immer wieder betont, dass sie die LMS zu einer Region machen wollen, die sich mit den besten der Welt messen kann.\n\nSeit ihrer Gründung 2013 haben die Flash Wolves stets ihre Stärke in der LMS unter Beweis gestellt. Seit dem letzten Jahr konnten sie sich in der LMS drei Titel sichern. Aber die Mannschaft will sich nicht damit begnügen, ihre Heimregion zu dominieren – sie bereiten sich darauf vor, den Kampf zu den Champions der anderen Region zu tragen und zu beweisen, dass es dieses Wolfsrudel beim Mid-Season Invitational 2017 mit den Größten aufnehmen kann.\n\nTrainer: Chou „Steak“ Frank\n","es_ES":"Flash Wolves es uno de los equipos más laureados y veteranos de la LMS, y está deseando tener una nueva oportunidad en el escenario mundial. No es la primera vez que compite contra equipos de todo el mundo con los espectadores internacionales como público; de hecho, se han forjado una reputación como uno de los pocos equipos capaces de ganar partidas contra los campeones mundiales SK telecom T1. Sus jugadores han hablado en más de una ocasión de forma pública sobre lo decididos que están a conseguir que la LMS se convierta en una región fuerte capaz de competir contra las mejores.\n\nFundado en 2013, Flash Wolves ha mostrado en todo momento su superioridad en la LMS: ha conseguido hacerse con tres títulos de la LMS seguidos. Pero el equipo no se conforma con triunfar en las competiciones de su región, sino que quiere enfrentarse a los campeones de todas las regiones y demostrar que su manada de lobos puede aplastar a los mejores en el Mid-Season Invitational 2017.\n\nEntrenador: Chou ''Steak'' Frank\n","pt_BR":"<p>A Flash Wolves é uma das equipes mais bem-sucedidas e celebradas na LMS e está ávida para outra chance no cenário mundial. Eles sabem bem como é jogar contra equipes globais com o mundo inteiro assistindo; construíram sua reputação como uma das únicas equipes a ganhar consistentemente dos campeões mundiais SK Telecom T1. Os jogadores têm falado frequente e publicamente sobre sua vontade de continuar tornando a LMS uma região forte e capaz de competir com os melhores.</p>\n\n<p>Fundada originalmente em 2013, a Flash Wolves tem mantido sua força na LMS. Eles capturaram três títulos seguidos na LMS desde o ano passado. Mas a equipe não está feliz com seu tratamento da oposição na sua região nativa. E eles estão se preparando para lutar contra os campeões de cada região e provar que esta matilha é capaz de derrotar os melhores no Mid-Season Invitational 2017.</p>\n\nTécnico: Chou \"Steak\" Frank</p>","es_AR":"<p>The Flash Wolves son uno de los equipos con más historia y éxito de la LMS, y se encuentran ansiosos de extender sus galardones al ámbito internacional. No son extraños a estos eventos globales; tienen una rivalidad con el equipo de Norteamérica Counter Logic Gaming, y han ganado partidas contra Cloud9 y Team SoloMid en la IEM Katowice 2015. Sus jugadores intentan llevar a la LMS al punto en que puedan competir con las mejores regiones mundiales, y trabajan para eso diariamente.</p>\n\n<p>Fundado en el 2013, los Flash Wolves se han mantenido a tope de la LMS consistentemente. Su trofeos incluyen el 1º lugar del Spring Split de la LMS en el 2015 y 2016. Pero el equipo no se conforma con liderar su región, se están preparando para pelear contra los campeones de cada rincón del mundo, y probar que esta jauría de lobos puede bajar a los más grandes.</p>\n\n<p><strong>Entrenador: Chen \"WarHorse\" Ju-Chih</strong></p>"},"foreignIds":{"drupalId":"1694"},"players":[110,617,631,633,1646,1849],"starters":[110,617,631,633,1646],"subs":[1849]}],"players":[{"id":20,"slug":"an","name":"AN","firstName":"Chun-An","lastName":"Chou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/an-1zhs9hs7.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:17.000Z","updatedAt":"2017-07-06T14:32:41.000Z","bios":{"en_US":"<p>Chun-An \"AN\" Chou is a fan favorite in the LMS. His quirky personality and aggressive AD carry play style come together in an endearing package. But those same traits sometimes surprise his own teammates. Much like his teammate Mountain, AN maintains a stoic disregard for win/loss records in scrims, and will play at his own pace -- and in his own way.\n</p>\n<p>\nBut when AN finds he isn't playing well, he does what every pro player would do to get out of a slump -- blame it on a lack of exercise. The solution? Easy! Go for a run in the middle of the night. And then wake up at 9 AM and go swimming, just to be safe. Of course, all that exercise takes a toll, so he will likely end up faltering in the next day’s practice...because of too much exercise. It’s a vicious cycle.\n</p>","fr_FR":"<p>Chun-An « AN » Chou est l'un des joueurs préférés des fans des LMS. Sa personnalité excentrique et son style de jeu agressif de carry AD constituent une association attachante. Mais ces mêmes caractéristiques peuvent parfois surprendre ses propres coéquipiers. À l'instar de Mountain, AN semble ne pas du tout s'intéresser au ratio victoires/défaites lors des matchs d'entraînement et joue à son rythme... et à sa façon.\n</p>\n<p>\nMais quand AN trouve qu'il ne joue pas bien, il fait ce que tout joueur pro fait pour sortir de l'ornière : il dit qu'il manque d'exercice. La solution ? Facile ! Partir courir au milieu de la nuit. Et au réveil, à 9 heures du matin, aller nager, juste au cas où. Bien sûr, faire autant de sport, ça peut fatiguer, et il risque de ne pas briller lors des entraînements du lendemain... à cause de trop d'exercice. Un véritable cercle vicieux.\n</p>","pl_PL":"<p>Chun-An „AN” Chou to ulubieniec fanów w LMS. Jego ciekawa osobowość i agresywna gra tworzą razem wyjątkowy pakiet. Jednak potrafi on też zaskoczyć swoich towarzyszy. Tak jak Mountain, AN nie przejmuje się zwycięstwami i porażkami w meczach treningowych i gra na swój własny sposób.\n</p>\n<p>\nKiedy jednak przestaje mu iść, robi to, co każdy zawodowiec – zwala winę na brak ćwiczeń. Rozwiązanie? To proste! Wystarczy trochę się przebiec w środku nocy. A potem pobudka o 9 rano i jeszcze trochę pływania dla pewności. Oczywiście ćwiczenia fizyczne są męczące, przez co zdarza mu się słabsza dyspozycja następnego dnia... z powodu przećwiczenia. Zaklęty krąg.\n</p>","de_DE":"<p>Chun-An „AN“ Chou ist der Fan-Liebling der LMS. Seine schrullige Persönlichkeit und sein aggressiver Spielstil mit AD-Carrys ergeben ein liebenswertes Gesamtpaket. Aber mit genau diesen Eigenschaften überrascht er manchmal seine Teamkameraden. Ähnlich wie seinem Teamkameraden Mountain sind AN die Siege und Niederlagen in Übungsspielen egal, und er spielt immer in seinem eigenen Tempo – und auf seine eigene Art.</p>\n\n<p>Aber wenn AN das Gefühlt hat, nicht gut zu spielen, tut er, was jeder Profi-Spieler tun würde – er schiebt es auf mangelnde Bewegung. Und was tut er dann? Ganz einfach! Er geht mitten in der Nacht joggen. Und dann steht er um 09:00 Uhr morgens auf und geht schwimmen, nur zur Sicherheit. Natürlich muss er dann der ganzen Bewegung Tribut zollen und kommt in den Übungsspielen nicht richtig in die Gänge … weil er zu viel Bewegung gemacht hat. Ein wahrer Teufelskreis.</p>","es_ES":"<p>Chun-An ''AN'' Chou es el favorito de los fans en la LMS. Su extravagante personalidad y su estilo de juego agresivo como AD carry conforman un preciado pack, pero esas mismas virtudes sorprenden a su equipo en más de una ocasión. Como su compañero Mountain, AN no tiene en cuenta las victorias y derrotas de las partidas de práctica, así que juega a su ritmo y por su cuenta,</p>\n\n<p>pero cuando AN considera que no está jugando bien, hace lo que haría cualquier profesional para superar un bache: achacarlo a la falta de ejercicio. ¿La solución? ¡Muy fácil! Salir a correr a medianoche. Luego se despierta a las nueve de la mañana para ir a nadar y sentirse bien. Por supuesto, todo ejercicio tiene su precio, así que puede que acabe flaqueando en el entrenamiento del día siguiente por haber hecho demasiado ejercicio. Es un círculo vicioso.</p>","pt_BR":"<p>Chun-An \"AN\" Chou é o favorito dos fãs na LMS. Sua personalidade peculiar e estilo de jogo agressivo com atiradores formam um pacote perigoso. Mas essas mesmas qualidades às vezes surpreendem até mesmo seus próprios aliados. Assim como seu companheiro Mountain, AN também mostra uma negligência estoica de vitórias e derrotas durante os treinamentos e gosta de jogar a seu próprio passo e de seu próprio jeito.</p>\n\n<p>No entanto, quando AN vê que não está jogando bem, ele faz o que todo jogador profissional faria para sair de uma crise: ele reclama que não tem se exercitado. A solução? Fácil! Ir para uma caminhada no meio da noite. E quem sabe acordar às 9 da manhã para uma nataçãozinha, só para ter certeza. É claro que todo esse exercício tem um preço, então ele provavelmente vai acabar super cansado na prática do dia seguinte... por ter se exercitado demais. É um ciclo vicioso.</p>","es_AR":"<p>Chun-An \"AN\" Chou es uno de los favoritos de los simpatizantes en LMS. Su extravagante personalidad y estilo de juego de acarreo con daño de ataque agresivo se reúnen en un paquete adorable. Pero esas mismas características a veces sorprenden a sus propios compañeros de equipo. De manera muy similar a su compañero Mountain, AN mantiene una estoica despreocupación por los registros de victorias y derrotas en las actuaciones, por lo que juega a su propio ritmo y a su propia manera.</p>\n\n<p>Pero cuando AN encuentra que no está jugando bien, hace lo que cualquier jugador profesional haría: culpa a una falta de ejercicio. ¿La solución? ¡Sencillo! Salir a correr en la mitad de la noche! Y luego levantarse a las 9 AM para ir a nada, solo para estar seguro. Desde luego que todo el ejercicio se pasa de la cuenta, por lo que probablemente falte al siguiente día de práctica... por culpa de mucho ejercicio. Es un círculo vicioso.</p>"},"foreignIds":{"drupalId":"1002","TRLH1":"1001380125","TRLH2":"1001280095","TRLH3":"1001160046","TRLH4":"1001160046","TRTW":"200000149","TRLT3":"200000260"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":34,"slug":"westdoor","name":"Westdoor","firstName":"Shu-Wei","lastName":"Liu","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/westdoor-e3yh8alc.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:30:57.000Z","bios":{"en_US":"<p>Shu-Wei \"Westdoor\" Liu is one of the most storied players in Taiwan, reaching Challenger on the Taiwan, North American, and Korean servers. Seeing Westdoor lock in Twisted Fate was considered guaranteed victory back in 2012. Even now it strikes fear into his opponents, though he has become better known for his godlike Fizz mechanics.\n</p>\n<p>\nIn contrast to his dynamic playstyle in-game, Westdoor is one of the quietest players on ahq e-Sports club in real life, often eating alone. But he is also the undisputed team captain. When his teammates are unsure of what to do, they look to him for guidance -- and he is always there to help push them further. As he explains, “If you have a dream, go chase it. Don’t give up until you grab it.” Westdoor is also the least likely to complain about practice -- in part because he lives and breathes Solo Queue. To top off the man and the legend, Westdoor spends his downtime between queues reading historical and science fiction novels, sharing favorites with his teammate Mountain. A gentleman, a scholar, a captain, and a friend. Is there anything Westdoor can’t do better than us?\n</p>","pl_PL":"<p>Shu-Wei „Westdoor” Liu to jeden z najlepszych graczy w Tajwanie – udało mu się trafić do kręgu Pretendenta w Tajwanie, Ameryce Północnej i Korei. Wybranie przez Westdoora Twisted Fate'a było gwarancją zwycięstwa w 2012 roku. Nawet dziś przeraża to przeciwników, chociaż gracz stał się znany z niesamowitej gry Fizzem.\n</p>\n<p>\nDla kontrastu z jego popisową grą Westdoor jest jednym z najcichszych graczy w klubie ahq i często jada sam. Jest jednak niezaprzeczalnie kapitanem drużyny. Kiedy towarzysze z drużyny nie wiedzą, co robić, traktują go jak przewodnika, a on zawsze staje na wysokości zadania. Sam wyjaśnia to tak: „Jeśli masz marzenie, musisz za nim gonić. Nie poddawaj się, póki się nie spełni”. Westdoor najrzadziej też narzeka na treningi, głównie dlatego, że niemal żyje w kolejce solo. Obrazu tej legendarnej postaci dopełnia fakt, że wolne chwile spędza na czytaniu książek historycznych i science fiction wraz ze swoim towarzyszem, Mountainem. Gentleman, uczony, kapitan i przyjaciel. Czy jest coś, czego Westdoor nie robi lepiej niż my?\n</p>","fr_FR":"<p>Shu-Wei « Westdoor » Liu est l'un des joueurs qui a le plus fait parler de lui à Taïwan, ayant atteint le palier Challenger sur les serveurs taïwanais, nord-américains et coréens. Quand Westdoor parvenait à jouer Twisted Fate en 2012, on pouvait considérer que la partie était jouée d'avance. Et encore aujourd'hui, cette combinaison peut effrayer ses adversaires à juste titre, bien qu'il soit depuis devenu particulièrement réputé pour sa maîtrise impressionnante de Fizz.\n</p>\n<p>\nAlors qu'il se montre incroyablement dynamique lors d'une partie, Westdoor est l'un des joueurs les plus discrets d'ahq e-Sports club dans la vie réelle, mangeant souvent seul. Ce qui ne l'empêche pas d'être le capitaine indiscuté de l'équipe. Quand ses coéquipiers ne savent trop quoi faire, ils se tournent vers lui... et il est toujours prêt à les aider à aller plus loin. Comme il le dit : « Si vous avez un rêve, pourchassez-le. N'abandonnez pas avant de l'avoir atteint. » Westdoor est également le moins enclin à se plaindre de l'entraînement, certainement parce qu'il adore jouer en file solo. Pour terminer de définir l'homme et la légende, il faut savoir que Westdoor passe tout son temps libre à lire des romans historiques ou de science-fiction, partageant ses livres préférés avec son coéquipier Mountain. Gentleman, érudit, capitaine et ami. Existe-t-il une chose que Westdoor ne sait pas faire mieux que nous ?\n</p>","de_DE":"<p>Shu-Wei „Westdoor“ Liu hat die Challenger Series in Taiwan, Nordamerika und Korea erreicht und gilt somit als einer der vielseitigsten Spieler in Taiwan. 2012 sprach man von einem sicheren Sieg, wenn Westdoor Twisted Fate auswählte. Und auch heute fürchten sich seine Gegner noch davor, auch wenn er jetzt eher für seine unglaublichen Spielzüge mit Fizz bekannt ist.</p>\n\n<p>Im Gegensatz zu seinem dynamischen Spielstil ist Westdoor im wahren Leben der ruhigste Spieler bei ahq e-Sports Club, der meistens sogar alleine isst. Aber gleichzeitig ist er der unangefochtene Teamleiter. Wenn seine Teamkameraden nicht genau wissen, was sie tun sollen, warten sie auf seine Führung – und er ist immer zur Stelle, um sie weiter voranzutreiben. Er erklärt das so: „Wenn du einen Traum hast, musst du ihn verfolgen. Und du darfst nicht aufhören, bevor er wahr geworden ist.“ Westdoor würde sich auch niemals über Training beschweren – was zum Teil auch daran liegt, dass die Solo-Warteschlange sein Zuhause ist. Und um der Legende noch einen draufzusetzen, liest Westdoor in seiner Freizeit Geschichts- und Science-Fiction-Romane, die er auch gerne mit seinem Teamkameraden Mountain teilt. Ein Gentleman, ein Gelehrter, ein Leiter und ein Freund. Gibt es eigentlich nichts, was Westdoor nicht besser kann als wir?</p>","es_ES":"<p>Shu-Wei ''Westdoor'' Liu es uno de los jugadores más históricos de Taiwán, y ha conseguido llegar al nivel Aspirante en los servidores de Taiwán, Norteamérica y Corea. En 2012, si Westdoor elegía a Twisted Fate, la victoria estaba garantizada. Incluso hoy en día levanta el pánico entre los rivales, aunque ahora es más famoso por su increíble manejo de Fizz.</p>\n\n<p>En contraste con su estilo de juego dinámico en partida, Westdoor es uno de los jugadores más callados de ahq e-Sports Club en la vida real, y suele comer solo, pero no cabe duda de que es el capitán del equipo. Cuando sus compañeros no tienen claro qué hacer, lo miran para que les guíe, y siempre les ayuda a llegar más lejos. Como él mismo afirma: ''Si tienes un sueño, ve a por él. No te rindas hasta que lo consigas''. Westdoor es también el que menos se queja a la hora de practicar, en parte porque le encanta la cola en solitario. Para rematar al hombre y la leyenda, Westdoor pasa su tiempo libre entre colas leyendo novelas históricas y de ciencia ficción, y comparte sus favoritas con su compañero de equipo Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Habrá algo en lo que Westdoor no logre ser mejor que nosotros?</p>","pt_BR":"<p>Shu-Wei \"Westdoor\" Liu é um dos jogadores mais lendários em Taiwan, conseguindo alcançar o nível Desafiante em Taiwan, América do Norte e Coreia ao mesmo tempo. Ver Westdoor escolher Twisted Fate era considerado uma vitória garantida em 2012. Até mesmo hoje ele ainda põe medo em seus oponentes, apesar de ter ficado mais conhecido por suas façanhas surreais com Fizz.</p>\n\n<p>Em contraste de seu estilo de jogo completamente dinâmico dentro do jogo, Westdoor é um dos jogadores mais quietos da ahq e-Sports Club na vida real, sempre almoçando sozinho em seu canto. Mas ele também é um capitão de equipe indiscutível. Quando seus companheiros não se sentem confiantes sobre o que fazer, eles o procuram para guiá-los e ele sempre está do lado deles para ajudar a melhorá-los. E é como ele diz, “Se você tem um sonho, vá atrás dele. Não desista até alcançá-lo”. Westdoor também é o menos provável de reclamar dos treinos, em parte porque a vida dele é a Fila Solo, mas além disso, a lenda também usa seu tempo livre entre as filas para ler livros de contos históricos e Sci-Fi, sempre compartilhando seus favoritos com seu companheiro Mountain. Um cavalheiro, estudioso, capitão e amigo. Existe alguma coisa em que o Westdoor não é bom?</p>","es_AR":"<p>Shu-Wei \"Westdoor\" Liu es uno de los jugadores más conocidos de Taiwán, y llegó a Aspirante en los servidores de Taiwán, Norteamérica y Corea. Ver a Westdoor en Twisted Fate se consideraba una victoria segura en el 2012. Aún ahora inspira temor en sus oponentes, aunque se ha vuelto más famoso por su mecánica divina con Fizz.</p>\n\n<p>En contraste con su dinámico estilo de juego, Westdoor es uno de los jugadores más tranquilos en ahq e-Sports club en la vida real, llegando incluso a comer varias veces en solitario. Sin embargo, es también el capitán indiscutido del equipo. Cuando sus compañeros no están seguros sobre qué hacer, acuden a su guía. Él siempre está disponible para ayudar a hacer que las cosas avancen más. Como bien dice, \"Si tienes un sueño, ve por él. No te rindas hasta que lo hayas cumplido\". Westdoor es también quien posee la menor posibilidad de quejarse sobre las prácticas, en parte porque vive y respira en cola individual. Por sobre el hombre y la leyenda, Westdoor pasa su tiempo inactivo entre colas leyendo material histórico y novelas de ciencia ficción, compartiendo sus favoritos con su compañero Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Hay algo que Westdoor no haga mejor que nosotros?</p>"},"foreignIds":{"drupalId":"948","TRLH1":"1001380124","TRLH2":"1001280094","TRLH3":"1001160045","TRLH4":"1001160045","TRTW":"200000008","TRLT3":"200000262"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":35,"slug":"albis","name":"Albis","firstName":"Jia-Wei","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/albis-7h5uw9xi.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:23:18.000Z","bios":{"en_US":"<p>Jia-Wei “Albis” Kang is the silent protector of ahq e-Sports Club. While he’s normally modest and reserved, he’s not afraid to spring into action to help his teammates both in and out of game. The LMS veteran has built a large fanbase over the years, earning him 43.4 percent of the support vote.</p>\n\n<p>Albis’s playmaking skills on the Rift were on full display at Worlds, when he played Bard to great effect in the Group Stage. However, he struggled on other champions, and AHQ failed to make it out of their group.</p>","fr_FR":"<p>Chia Wei \"Albis\" Kang est le protecteur silencieux d'ahq e-Sports Club. Même s'il est d'ordinaire modeste et réservé, il n'a pas peur de passer à l'action quand il s'agit d'aider ses coéquipiers, dans et hors jeu. Le vétéran LMS s'est créé une large base de fans au fil des ans, lui permettant d'obtenir 43,4 pour cent des votes support.</p>\n\n<p>Albis a montré tout ce dont il était capable sur la Faille lors du Mondial en jouant Bard de manière impressionnante dans la phase de groupe. Toutefois, il a du mal avec d'autres champions et AHQ n'a pas réussi à sortir gagnant de son groupe. Alors que l'événement All-Stars 2016 ne sera que pur chaos, l'équipe d'Albis peut compter sur lui pour les mener à la victoire.</p>","pl_PL":"Chia Wei „Albis” Kang to milczący obrońca ahq e-Sports Club. Chociaż zazwyczaj jest skromny i zamknięty w sobie, nie boi się rzucić do akcji, gdy trzeba pomóc kolegom, zarówno w grze, jak i poza nią. Ten weteran LMS zebrał w ciągu lat wielką bazę fanów, którzy zapewnili mu 43,4 procenta głosów dla zawodnika wsparcia.</p>\n\nAlbis w pełni zaprezentował swoje umiejętności kreowania rozgrywki na Summoner’s Rift podczas Mistrzostw, gdy niezwykle skutecznie grał Bardem w fazie grupowej. Jednak kiepsko sobie radził z innymi bohaterami i AHQ nie zdołali wydostać się z grupy. Chociaż wydarzenie All-Star 2016 będzie pełne zamieszania, drużyna Albisa może mieć nadzieję, że on zdoła poprowadzić ją do zwycięstwa.\n","de_DE":"<p>Chia Wei „Albis“ Kang ist der stille Beschützer des ahq e-Sports Club. Obwohl er normalerweise eher bescheiden und reserviert ist, hat er weder im Spiel noch im echten Leben Angst, seinen Teamkameraden zur Hilfe zu kommen. Der Veteran der LMS hat sich über die Jahre eine große Fangemeinde aufgebaut und wurde mit 43,4 % der Stimmen zum Supporter gewählt.</p>\n\n<p>Albis Fähigkeiten als Spielmacher in der Kluft waren bei der Weltmeisterschaft gut zu erkennen, als er in der Gruppenphase mit Bard das Kommando übernahm. Dafür hatte er jedoch mit anderen Champions Probleme und AHQ konnte sich nicht für die K.-o.-Phase qualifizieren. Doch Albis Team kann sich darauf verlassen, dass er sie beim All-Stars-Event 2016 durch das Chaos zum Sieg führen wird.</p>","es_ES":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de apoyo.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó a Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","pt_BR":"<p>Chia Wei “Albis” Kang é o protetor silencioso da ahq e-Sports Club. Apesar de normalmente ser modesto e reservado, ele não tem medo de entrar em ação para ajudar seus companheiros de equipe, tanto dentro como fora do jogo. O veterano da LMS construiu uma grande base de fãs ao longo dos anos, rendendo-lhe 43,4% dos votos de suporte.</p>\n\n<p>A habilidade em fazer jogadas em Summoner’s Rift de Albis foi exibida no Mundial, onde ele brilhou de Bardo na Fase de Grupos. Contudo, ele teve dificuldades em outros Campeões e a AHQ não conseguiu sair de seu grupo. Quando o bicho estiver pegando no Evento All-Star 2016, a equipe de Albis pode ter a certeza de que ele os ajudará a procurar a vitória.</p>","es_AR":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","cs_CZ":"<p>Chia Wei „Albis“ Kang je tichý ochránce týmu ahq e-Sports Club. Ačkoliv bývá tichý a nenápadný, nebojí se vrhnout po hlavě do akce, aby pomohl svým kolegům – a to jak ve hře, tak i mimo ni. Tento veterán LMS si za svou dlouholetou kariéru vybudoval bohatou fanouškovskou základnu, která mu při hlasování vynesla podporu ve výši 43,4 %.</p>\n\n<p>Albisovy kreativní herní dovednosti jasně zazářily na MS, kde ve skupině nesmírně efektivně řádil s Bardem. S ostatními šampiony se mu však až tak nedařilo a AHQ ze své skupiny nakonec nepostoupili. Turnaj All-Star 2016 sice bude hrozný masakr, v Albisovi však jeho tým najde pevnou oporu, jež jej může dovést za vítězstvím.</p>","el_GR":"<p>Ο Chia Wei “Albis” Kang είναι ο σιωπηλός προστάτης των ahq e-Sports Club. Συνήθως είναι συγκρατημένος και ντροπαλός, αλλά δεν φοβάται να δράσει αποφασιστικά για να βοηθήσει τους συμπαίκτες του εντός και εκτός παιχνιδιού. Είναι ένας βετεράνος του LMS που έχει αποκτήσει ένα πολύ μεγάλο κοινό όλα αυτά τα χρόνια. Δεν είναι παράξενο, λοιπόν, που πήρε το 43,4% των ψήφων για τη θέση του υποστηρικτή.</p>\n\n<p>Ο Albis έδειξε σε όλους πόσο καλός οργανωτής είναι στο Παγκόσμιο Πρωτάθλημα, όπου έπαιξε φοβερά με τον Βάρδο στη Φάση Ομίλων. Ωστόσο, δεν τα πήγε εξίσου καλά με άλλους ήρωες και οι AHQ δεν κατάφεραν να προκριθούν. Παρόλο που το Τουρνουά All-Star 2016 προβλέπεται αρκετά χαοτικό, οι συμπαίκτες του Albis μπορούν να τον εμπιστευτούν για να τους οδηγήσει στη νίκη.</p>","hu_HU":"Chia Wei „Albis” Kang az ahq e-Sports Club csendes védelmezője. Általában szerény és visszafogott, de a játékban (és azon kívül is) a csapattársai segítségére siet, ha szükség van rá. Az LMS-veteránnak továbbra is jelentős rajongótábora van, akik a támogatói szavazatok 43,4%-át adták le rá.</p>\n\nAlbis a vébén megmutatta, hogy milyen jó irányító, amikor Barddal játszott remekül a csoportkörben. Más hősökkel viszont nem volt sok szerencsére, így az AHQ nem jutott tovább a csoportjából. Bár a 2016-os All-Star gálán őrült meccsekre lehet számítani, Albisra bizalommal hagyatkozhat a csapata.\n","it_IT":"Chia Wei \"Albis\" Kang è il silenzioso protettore degli ahq e-Sports Club. È modesto e riservato, ma anche sempre pronto a scattare in aiuto dei suoi compagni, sia in partita che fuori. Questo veterano della LMS ha attirato a sé nel corso degli anni intere legioni di fan, che l'hanno premiato con il 43,4% dei voti nella categoria Supporto.\n</p>\nLe capacità di regista di Albis nella Landa sono state sotto gli occhi di tutti ai Mondiali, quando si è esibito con il suo Bard nella fase a gironi. Non è riuscito, tuttavia, a replicare il successo con gli altri campioni, e gli ahq non sono riusciti a proseguire la loro avventura nel torneo. Anche se l'All-Star 2016 sarà caratterizzato da un immenso caos, la squadra di Albis potrà contare sulle sue abilità di organizzatore per puntare alla vittoria.\n","ro_RO":"Chia Wei ''Albis'' Kang este protectorul tăcut al celor din ahq e-Sports Club. Cu toate că în mod normal e modest și tăcut, nu-i e teamă să intre în acțiune pentru a-și ajuta coechipierii atât în joc, cât și în afara lui. Veteranul din LMS a strâns un număr mare de fani de-a lungul anilor, obținând 43,4 la sută din voturile pentru suport.</p>\n\nPuterea lui Albis de a întoarce sorții în Rift a uimit spectatorii la Mondiale, când a jucat cu Bard cu mult succes în faza grupelor. Totuși, a avut probleme cu alți campioni, iar AHQ nu a reușit să treacă de grupe. Cu toate că All-Star Event va fi un turneu nebun și haotic, echipa lui Albis se poate baza pe un lucru: că-i poate conduce către victorie.\n","es_MX":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<P>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>"},"foreignIds":{"drupalId":"945","TRLH1":"1001380126","TRLH2":"1001280096","TRLH3":"1001360065","TRLH4":"1001310065","TRTW":"200000104","TRLT3":"200000261"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":110,"slug":"maple","name":"Maple","firstName":"Yi-Tang","lastName":"Huang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maple-g0kqxct3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":"","createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-07-06T14:27:55.000Z","bios":{"en_US":"<p>Yi-Tang “Maple” Huang is one of the most versatile mid laners around. He’s already proven to be practically unopposed in the LMS region, where he led all mid laners with a 6.9 KDA during the regular season. What’s even more impressive is that he’s still a teenager, with what looks to be a promising future ahead of him on the Flash Wolves.</p>\n\n<p>Maple demonstrated his wide champion pool when he played six different champions in six games at the 2016 World Championship. Unfortunately, he failed to find consistent success, and Flash Wolves failed to make it out of the Group Stage. Maple will no doubt jump at another chance to prove himself on the international stage.</p>","fr_FR":"Yi-Tang « Maple » Huang est l'un des midlaners les plus polyvalents. Il a déjà prouvé qu'il n'avait quasiment aucun adversaire dans la région LMS, où il a devancé tous les autres midlaners avec un KDA de 6,9 pendant la saison régulière. C'est d'autant plus impressionnant quand on sait qu'il est encore adolescent et qu'il a donc un avenir prometteur chez les Flash Wolves.\n\nMaple a montré son vaste pool de champions en jouant six champions différents dans six matchs lors du Championnat du monde 2016. Malheureusement, il a manqué de constance et les Flash Wolves n'ont pas réussi à sortir gagnants de la phase de groupe. Maple ne manquera pas de saisir cette nouvelle chance de montrer toute l'ampleur de son talent sur la scène internationale lors du Mid-Season Invitational 2017\n","pl_PL":"Yi-Tang „Maple” Huang jest aktualnie jednym z najwszechstronniejszych środkowych. Pokazał już, że jest praktycznie niepokonany w regionie LMS, w którym prowadził wśród środkowych z wynikiem 6,9 Z/Z/A w sezonie zasadniczym. Jeszcze większe wrażenie robi fakt, że wciąż jest nastolatkiem, którego czeka obiecująca przyszłość we Flash Wolves.\n\nMaple zademonstrował swoją szeroką pulę bohaterów, gdy zagrał sześcioma różnymi bohaterami w sześciu grach Mistrzostw Świata 2016. Niestety nie udało mu się powtórzyć wcześniejszych sukcesów i Flash Wolves nie zdołali wyjść z fazy grupowej. Maple bez wątpienia z radością skorzysta z kolejnej okazji, by dowieść swojej wartości na międzynarodowej arenie Mid-Season Invitational 2017.\n","de_DE":"Yi-Tang „Maple“ Huang ist einer der vielseitigsten Mid-Laner überhaupt. Mit einer TTU von 6,9 (der höchste Wert aller Mid-Laner) während der regulären Saison hat er bewiesen, dass es in der LMS-Region niemanden gibt, der es mit ihm aufnehmen kann. Noch beeindruckender ist, dass er noch ein Teenager ist, der zusammen mit den Flash Wolves eine große Zukunft vor sich hat.\n\nMaple hat mit sechs unterschiedlichen Champions in sechs Spielen der Weltmeisterschaft 2016 bewiesen, wie vielseitig er ist. Leider war er zu unbeständig und die Flash Wolves schieden in der Gruppenphase aus. Maple wird beim Mid-Season Invitational 2017 ohne Zweifel versuchen, sein Können unter Beweis zu stellen.\n","es_ES":"Yi-Tang ''Maple'' Huang es uno de los mid más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la región LMS, donde ha destacado entre los mid con un A/M/A de 6,9 puntos durante la temporada regular. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.\n\nMaple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió mantener la regularidad y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para ponerse a prueba en el escenario internacional del Mid-Season Invitational 2017.\n","pt_BR":"<p>Yi Tang “Maple” Huang é um dos jogadores de meio mais versáteis que existe. Ele já provou ser praticamente imbatível na região LMS, onde conseguiu 48,6% dos votos da rota. O que é ainda mais impressionante é que ainda é um adolescente, ostentando o que parece ser um futuro promissor na Flash Wolves.</p>\n\n<p>Maple demonstrou seu grande rol de Campeões quando jogou com seis personagens diferentes em seis partidas do Campeonato Mundial 2016. Infelizmente, ele não conseguiu manter o sucesso e a Flash Wolves falhou em sair da Fase de Grupos. Dada outra chance, Maple certamente vai agarrar a oportunidade de batalhar contra outros dos melhores jogadores de meio do mundo.</p>","es_AR":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>","cs_CZ":"<p>Yi Tang „Maple“ Huang je jedním z nejvšestrannějších středových lajnařů, na které jen můžete narazit. Jasně prokázal, že v celém LMS by jen těžko hledal nějakou konkurenci, o čemž svědčí i 48,6 % hlasů, které ve středové lajně získal. Tento fakt je o to působivější, že je dosud teenager. Vše nasvědčuje tomu, že jej v řadách Flash Wolves čeká slibná budoucnost.</p>\n\n<p>Maple na mistrovství světa 2016 demonstroval šíři své množiny šampionů, v šesti utkáních totiž hrál za šest různých postav. Bohužel se mu ne vždy dařilo a Flash Wolves nepostoupili ze skupiny. Maple tedy určitě využije druhou šanci rozpoutat masakr mezi těmi nejlepšími středovými lajnaři světa.</p>","el_GR":"<p>Ο Yi Tang “Maple” Huang είναι ένας από τους πιο ευέλικτους παίκτες μεσαίας λωρίδας. Έχει αποδείξει ήδη ότι δεν έχει αντίπαλο στο LMS, άρα δεν ήταν καθόλου περίεργο που συγκέντρωσε το 48,6% των ψήφων της περιοχής. Αυτό που είναι ακόμα πιο εντυπωσιακό είναι ότι ακόμα δεν έχει κλείσει καν τα είκοσι και, όπως όλα δείχνουν, έχει μπροστά του ένα λαμπρό μέλλον με τους Flash Wolves.</p>\n\n<p>Ο Maple έδειξε σε όλους πόσο καλά χειρίζεται μια τεράστια γκάμα ηρώων, όταν έπαιξε με έξι διαφορετικούς ήρωες σε έξι παιχνίδια του Παγκοσμίου Πρωταθλήματος 2016. Δυστυχώς, δεν κατάφερε να πιάσει σταθερή απόδοση, με αποτέλεσμα να μην καταφέρουν οι Flash Wolves να περάσουν τη Φάση Ομίλων. Είναι βέβαιο ότι ο Maple θα αδράξει τη δεύτερη ευκαιρία που του δίνεται για να αποδείξει ότι αξίζει μια θέση στους καλύτερους παίκτες μεσαίας λωρίδας στον κόσμο.</p>\n","hu_HU":"Yi Tang „Maple” Huang az egyik legsokoldalúbb középső ösvényes játékos. Az LMS régióban gyakorlatilag nincs kihívója, és a középső ösvényesekre leadott szavazatok 48,6%-át gyűjtötte be. Ez úgy érte el, hogy még tizenéves, és ígéretes karrier áll előtte a Flash Wolves tagjaként.</p>\n\nMaple a 2016-os világbajnokságon is megcsillogtatta nagy hősrepertoárját, és hat játékban hat különböző hőssel játszott. Sajnos nem sikerült következetesen nyerniük, és a Flash Wolves nem jutott tovább a csoportkörből. Ha esélyt kap rá, Maple örömmel veti bele magát a harcba a világ legjobb középső ösvényesei ellen.\n","it_IT":"Yi Tang \"Maple\" Huang è uno dei centrali più versatili attualmente in circolazione. Ha già dimostrato più volte di non avere rivali nella LMS, dove ha conquistato il 48,6% dei voti per la sua categoria. La cosa che più colpisce di lui è però la sua giovane età e il brillante futuro che lo attende assieme ai Flash Wolves.</p>\n\nMaple ha dato prova della sua grande abilità con numerosi campioni durante i Mondiali 2016 giocando 6 incontri con 6 personaggi diversi. Purtroppo non è riuscito a ottenere un successo costante, e i Flash Wolves hanno dovuto abbandonare il torneo durante la fase a gironi. Maple sfrutterà sicuramente questa seconda opportunità per portare scompiglio tra i migliori centrali del mondo.\n","ro_RO":"Yi Tang ''Maple'' Huang este unul dintre cei mai adaptabili jucători de pe culoarul din mijloc. A dovedit deja că practic nimeni nu se poate pune cu el în regiunea LMS, unde a obținut 48,6 la sută din voturile pentru culoarul din mijloc. Și mai impresionat, Maple e încă adolescent, așa că probabil că are un viitor promițător alături de Flash Wolves.\n</p>\nA demonstrat la Campionatul Mondial 2016 că poate juca cu un număr mare de campioni, făcând șase alegeri diferite în șase meciuri. Din păcate, nu a avut mereu succes, iar Flash Wolves nu a reușit să treacă de faza grupelor. Acum că a primit o nouă șansă, cu siguranță că va profita de ea și va dezlănțui haosul împotriva celor mai buni jucători din lume de pe culoarul din mijloc.\n","es_MX":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>"},"foreignIds":{"drupalId":"674","TRLH3":"1001360063","TRLH4":"1001310063","TRTW":"200000014","TRLT3":"200000254","TRLH1":"200000436","TRLH2":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":302,"slug":"chawy","name":"Chawy","firstName":"Xing-Lei","lastName":"Wong","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chawy-13of7sx8.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2014-09-16T21:52:24.000Z","updatedAt":"2017-07-06T14:32:25.000Z","bios":{"en_US":"","es_AR":"<p>Xing-lei \"Chawy\" Wong es el carrilero central suplente de ahq e-Sports Club.</p>"},"foreignIds":{"drupalId":"377","TRTW":"200000007","TRLH2":"1001280097","TRLH1":"1001380127","TRLT3":"200000259"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":407,"slug":"mountain","name":"Mountain","firstName":"Zhao-Hong","lastName":"Xue","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mountain-a7eo73t.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:32:08.000Z","bios":{"en_US":"<p>Zhao-Hong \"Mountain\" Xue is the meaty, front-line-patrolling, carry-peeling jungler that every squishy champion dreams of having around in a team fight. Mountain integrated with ahq almost instantly after joining in 2014, despite initial worries about synergy with his teammates. His one potential flaw? He likes to experiment with in-game strategy -- sometimes without telling his team first, leading to questionable scrim results. But when ahq needs him to deliver his finest, he is always ready to step up to the plate.\n</p>\n<p>\nWhile Mountain enjoys experimenting with new strategies on the Rift, when he leaves the game behind he becomes more consistent. Whenever ahq goes abroad, the first thing he does is buy a doll from the airport or a local toy store for his girlfriend. And if he has time to kill between queues, he enjoys reading a good historical or science fiction novel with his teammate Westdoor.\n</p>","fr_FR":"<p>Zhao-Hong « Mountain » Xue est un jungler puissant et dominant que tout champion un peu fragile rêve d'avoir à ses côtés pendant un combat d'équipe. Mountain a rejoint ahq presque immédiatement après son arrivée en 2014, malgré des craintes initiales sur la synergie avec ses coéquipiers. Son potentiel point faible ? Il aime tenter de nouvelles stratégies en cours de partie, parfois sans même prévenir son équipe, ce qui peut mener à des résultats ambivalents lors des matchs d'entraînement. Mais quand ahq a besoin qu'il donne le meilleur de lui-même, il répond toujours présent.\n</p>\n<p>\nSi Mountain aime tester de nouvelles stratégies dans la Faille, quand il ne joue pas, il est beaucoup moins créatif. Dès qu'ahq part à l'étranger, il achète toujours une poupée pour sa petite amie à l'aéroport ou dans un magasin de jouets. Et s'il a du temps à perdre entre deux parties, il va lire un roman historique ou de science-fiction avec son coéquipier Westdoor.\n</p>","pl_PL":"<p>Zhao-Hong „Mountain” Xue to walczący na froncie i usuwający prowadzących dżungler, którego każdy wrażliwy bohater lubi mieć przy sobie. Mountain zintegrował się z ahq tuż po przyłączeniu się w 2014 roku mimo tego, że obawiano się o to, jak ułoży mu się współpraca z towarzyszami. Jego potencjalną wadą jest fakt, że lubi eksperymentować ze strategią, czasem nie mówiąc nawet towarzyszom, co daje bardzo różne wyniki. Jednak kiedy ahq naprawdę go potrzebuje, zawsze spełnia oczekiwania drużyny.\n</p>\n<p>\nChociaż Mountain lubi eksperymentować w grze, poza nią jest zrównoważony. Kiedy ahq wybiera się w podróż, zawsze kupuje swojej dziewczynie lalkę na lotnisku lub w sklepie z zabawkami. A jeśli ma czas między meczami, lubi czytać powieści historyczne i science fiction, tak jak jego kolega, Westdoor.\n</p>","de_DE":"<p>Zhao-Hong „Mountain“ Xue ist der robuste, Carry fressende Jungler an der Front, den jeder Champion, der nicht besonders viel aushält, in einem Teamkampf gerne an seiner Seite hätte. Mountain konnte sich trotz anfänglicher Sorgen über die Harmonie mit seinen Teamkameraden gleich nach seinem Beitritt im Jahr 2014 bei ahq integrieren. Seine einzige potenzielle Schwachstelle? Er experimentiert gerne mit der Strategie im Spiel – und manchmal vergisst er, seine Mannschaft darüber in Kenntnis zu setzen, was immer wieder zu fragwürdigen Ergebnissen in Übungsspielen führt. Aber wenn es ernst wird und ahq ihn braucht, stellt er sich der Herausforderung.</p>\n\n<p>Obwohl Mountain in der Kluft gerne mit neuen Strategien experimentiert, ist er abseits des Spiels lange nicht so experimentierfreudig. Immer wenn ahq das Land verlässt, kauft er am Flughafen oder in einem Spielzeugladen eine Puppe für seine Freundin. Und wenn er zwischen den Spielen einmal Zeit totschlagen muss, liest er mit seinem Teamkameraden Westdoor Geschichts- oder Science-Fiction-Romane.</p>","es_ES":"<p>Zhao-Hong ''Mountain'' Xue es ese valioso jungla que todo campeón fácil de asesinar desea tener cerca durante los combates de equipo porque protege en primera línea y defiende al carry. Mountain se integró en ahq al instante cuando se unió a ellos en 2014, a pesar de las preocupaciones iniciales sobre su sinergia con los compañeros de equipo. ¿Su posible punto débil? Le gusta experimentar con la estrategia en partida, a veces sin decírselo primero a sus compañeros, lo que provoca resultados cuestionables durante las prácticas. Pero cuando ahq necesita que lo dé todo, siempre está preparado para saltar a la palestra.</p>\n\n<p>Aunque le gusta probar nuevas estrategias en la Grieta, cuando deja el juego a un lado, se vuelve más coherente. Cuando ahq viaja al extranjero, lo primero que hace es comprarle una muñeca en el aeropuerto o en una tienda de la zona a su novia. Para matar el tiempo durante las colas, le gusta leer novelas históricas o de ciencia ficción con su compañero Westdoor.</p>","pt_BR":"<p>Zhao-Hong \"Mountain\" Xue é o caçador-tanque carregador e protetor que todo campeão frágil sonha em ter por perto em um confronto de equipe. Mountain se integrou quase que instantaneamente com a ahq logo em sua entrada em 2014, apesar de preocupações iniciais sobre a sinergia com seus compaheiros. Seu possível maior defeito? Ele gosta de experimentar com estratégias dentro do jogo, muitas vezes sem dizer aos seus companheiros primeiro, levando a resultados questionáveis durante o treinamento. Mas quando a ahq precisa que ele dê o seu melhor, ele sempre está pronto para atender às expectativas.</p>\n\n<p>Apesar de Mountain gostar de experimentar com novas estratégias no Rift, quando ele deixa essa parte de lado, ele se torna mais consistente. Sempre que a ahq viaja pelo mundo, a primeira coisa que ele faz é comprar uma boneca no aeroporto ou em uma loja de brinquedos local para sua namorada. E durante seu tempo livre da filas do League of Legends, ele gosta de ler uma boa novela histórica ou Sci-Fi com seu companheiro de equipe, Westdoor.</p>","es_AR":"<p>Zhao-Hong \"Mountain\" Xue es el sustancioso junglero que patrulla la primera línea y evita los movimientos del contrario, alguien a quien cada campeón frágil desearía tener cerca en un combate en equipo. Mountain se unió a ahq en el 2014 y se integró sólidamente casi al instante, a pesar de las preocupaciones iniciales sobre la forma de trabajar con sus compañeros. ¿Su posible falla? Le gusta experimentar con la estrategia dentro del juego, a veces sin avisar primero a sus compañeros, lo cual se traduce en cuestionables resultados. Sin embargo, cuando ahq necesita que se desempeñe impecablemente, está siempre listo para cumplir con lo suyo.</p>\n\n<p>Si bien a Mountain le gusta crear nuevas estrategias en la Grieta, cuando deja al juego atrás, se vuelve mucho más consistente. Cada vez que ahq sale del país, lo primero que hace es comprar una muñeca para su novia en el aeropuerto o en una juguetería local. Y, si tiene que matar el tiempo mientras hace fila, disfruta leyendo literatura histórica o novelas de ciencia ficción con su compañero Westdoor.</p>"},"foreignIds":{"drupalId":"1698","TRLH1":"1001380123","TRLH2":"1001280093","TRLH3":"1001160093","TRLH4":"1001160093","TRTW":"200000006","TRLT3":"200000258"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":408,"slug":"ziv","name":"Ziv","firstName":"Yi","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ziv-r8szyen.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:22:21.000Z","bios":{"en_US":"<p>There’s a reason Yi “Ziv” Chen earned a staggering 66.1 percent of the top lane vote for the LMS region. He’s the cream of the crop of LMS top laners, and he’s proven he can compete with the best in the world. He turned heads with his debut at the 2015 Mid-Season Invitational, and he led AHQ to two of their victories with stellar Jayce play at the 2016 World Championship. Unfortunately, AHQ fell just short of making it out of the group stage.</p>\n\n<p>Ziv made a name for himself in the LMS with his unrelenting approach in the top lane. He isn’t afraid to chase his opponents all the way to their fountain if necessary. He’s shown his dedication to improving his craft, and he’s always looking to improve his mechanics in scrims and solo queue.</p>","fr_FR":"<p>Ce n'est pas sans raison que Yi \"Ziv\" Chen a remporté un pourcentage écrasant de 66,1 dans le vote top laner de la région LMS. Il est la crème de la crème des top laners LMS et il a démontré qu'il pouvait affronter les meilleurs du monde. Il a fait tourner les têtes lors de ses débuts dans le Mid-Season Invitational 2015, et AHQ lui doit deux de ses victoires grâce à son jeu exceptionnel de Jayce lors du Championnat du monde 2016. Malheureusement, AHQ n'a pas réussi à sortir gagnant de la phase de groupe.</p>\n\n<p>Ziv s'est fait un nom dans les LMS avec son style implacable dans la voie du haut. Il n'a pas peur de poursuivre ses adversaires jusqu'à leur fontaine, s'il le faut. Il s'est montré déterminé dans l'apprentissage de son art et il cherche toujours à améliorer ses mécaniques dans les matchs amicaux et la file solo. L'événement All-Stars 2016 lui donnera une chance de se libérer et de plonger dans le chaos de l'intersaison.</p>","pl_PL":"Yi „Ziv” Chen nie bez powodu zdobył oszałamiające 66,1 procenta głosów na górnego regionu LMS. Należy do śmietanki górnych LMS i pokazał, że potrafi rywalizować z najlepszymi na świecie. Zwrócił na siebie uwagę podczas debiutu na Mid-Season Invitational 2015, a swoją genialną grą Jaycem doprowadził AHQ do dwóch zwycięstw na Mistrzostwach Świata 2016. Niestety AHQ nie zdołali wyjść z fazy grupowej, choć tak niewiele im do tego brakowało.\n</p>\nZiv zdobył sobie uznanie w LMS swoją nieustępliwością na górnej alei. Gdy trzeba, nie boi się ścigać przeciwników aż do ich fontanny. Wykazał się skrupulatnością w doskonaleniu swojego warsztatu i zawsze jest gotowy poprawiać mechanikę gry podczas sesji treningowych i w kolejce solo. Wydarzenie All-Star 2016 będzie dla niego okazją, by pójść na całość i poszaleć trochę poza sezonem.\n","de_DE":"<p>Es gibt einen Grund, aus dem Yi „Ziv“ Chen von unglaublichen 66,1 % aller Wähler zum Top-Laner für die LMS-Region gewählt wurde. Er ist der beste Top-Laner der LMS und er hat bewiesen, dass er mit den besten Spielern der Welt mithalten kann. Er erregte bereits bei seinem Debüt im Mid-Season Invitational 2015 Aufsehen und führte AHQ mit seinem überragenden Jayce zu zwei Siegen bei der Weltmeisterschaft 2016. Leider schaffte es AHQ knapp nicht, in die K.-o.-Runde der WM einzuziehen.</p>\n\n<p>Ziv machte sich mit seinen erbarmungslosen Spielzügen auf der oberen Lane einen Namen in der LMS. Er schreckt auch nicht davor zurück, seine Gegner bis in die Basis zu verfolgen, wenn es die Situation erfordert. Er hat gezeigt, dass er sich stets steigern will, und versucht, seine Mechaniken in Übungsspielen und der Solo-Warteschlange zu verbessern. Beim All-Stars-Event 2016 bekommt er die Möglichkeit, richtig aufzudrehen und in der Nebensaison ordentlich Chaos zu stiften.</p>","es_ES":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para la calle superior de la región de LMS. Es de lo mejorcito de los top de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograse dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en la calle superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola en solitario. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","pt_BR":"<p>Existe um motivo para Yi “Ziv” Chen ter conseguido 66,1% dos votos da rota do topo da região LMS. Ele faz parte da nata dos jogadores de posição na LMS e provou que pode competir com os melhores do mundo. Ele atraiu olhares com sua estreia no Mid-Season Invitational 2015 e levou a AHQ a duas de suas vitórias, com desempenhos espetaculares de Jayce no Campeonato Mundial 2016. Infelizmente, a AHQ não conseguiu sair da Fase de Grupos.</p>\n\n<p>Ziv fez seu nome na LMS com sua abordagem implacável da rota do topo. Ele não tem medo de perseguir seus oponentes até a fonte, se necessário. Mostrou sua dedicação em melhorar seu ofício e sempre está buscando aprimorar suas mecânicas em duelos na fila solo. O Evento All-Star 2016 lhe dará uma chance de relaxar e mergulhar no caos do pós-temporada.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yi \"Ziv\" Chen은 ahq E-sports Club에 가장 최근 합류한 선수 두 명 중 하나로 2014 월드 챔피언십 이후 팀에 들어갔습니다. 그는 데뷔 무대였던 2015 미드 시즌 인비테이셔널에서 마오카이와 나르를 이용한 압도적 경기력으로 세계를 뒤흔들었습니다. 특히 서구의 탑 라이너들 몇몇이 여기에 희생됐죠. Ziv는 2015 월드 챔피언십에서 ahq가 8강까지 올라가는 데 중요한 역할을 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">전장에서 그가 킬을 올리기 위해 적팀 탑 라이너를 쫓고 있지 않을 때에는 LMS에서 가장 진지한 선수들 중 하나가 됩니다. ahq의 스크림 경기에서 Ziv는 피지컬을 향상시키기 위해 최선을 다하죠. 하지만 연습이 끝나면 긴장을 푼 Ziv로 돌아옵니다. 평소에는 숙소에서 잠을 자거나 친구들과 애니메이션을 보며 하루를 보낼 때가 많습니다. </p>\n","es_AR":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","cs_CZ":"<p>Není žádná náhoda, že Yi „Ziv“ Chen získal za LMS ohromujících 66,1 % hlasů pro horní lajnu. Je absolutní špičkou mezi horními lajnaři z LMS a dokázal, že obstojí i v boji s těmi nejlepšími z celého světa. Vzbudil zaslouženou pozornost již při svém debutu na turnaji Mid-Season Invitational 2015 a svou hvězdnou hrou za Jayce dovedl AHQ ke dvěma z jejich vítězství na mistrovství světa 2016. Přesto AHQ bohužel nepostoupili ze skupiny.</p>\n\n<p>Ziv se v LMS proslavil tím, že v horní lajně nenechá svého soupeře ani na okamžik vydechnout. Je-li to zapotřebí, neváhá jej pronásledovat až na fontánu. Neusíná na vavřínech a neustále se snaží své herní dovednosti zlepšovat v cvičných utkáních a sólové frontě. Na turnaji All-Star 2016 bude mít příležitost utrhnout se ze řetězu a trochu si vychutnat všeobecný masakr v odpočinkové době mezi sezónami.</p>","el_GR":"<p>Δεν είναι τυχαίο που ο Yi “Ziv” Chen πήρε το απίστευτο ποσοστό 66,1% των ψήφων του LMS για τη θέση επάνω λωρίδας. Είναι ό,τι καλύτερο έχει να επιδείξει το LMS στην επάνω λωρίδα και μπορεί να ανταγωνιστεί τους καλύτερους παίκτες του κόσμου σε αυτήν τη θέση. Το ντεμπούτο του στο Mid-Season Invitational 2015 προκάλεσε τεράστια αίσθηση, ενώ αργότερα οδήγησε τους AHQ σε δύο πολύ σημαντικές νίκες στο Παγκόσμιο Πρωτάθλημα 2016 με εκπληκτικό χειρισμό του Τζέις. Δυστυχώς, οι AHQ δεν κατάφεραν να περάσουν από τη φάση ομίλων.</p>\n\n<p>Ο Ziv έγινε διάσημος στο LMS για τον αδυσώπητο τρόπο που έπαιζε στην επάνω λωρίδα. Δεν φοβάται να κυνηγήσει τους αντιπάλους του ακόμη και μέχρι το σιντριβάνι τους, αν χρειαστεί. Έχει αποδείξει την αφοσίωσή του στη βελτίωση του παιχνιδιού του και προσπαθεί πάντα να βελτιώσει τη γνώση των μηχανισμών σε φιλικούς αγώνες και παιχνίδια στην ουρά αναμονής για έναν παίκτη. Στο Τουρνουά All-Star 2016 θα έχει την ευκαιρία να τα δώσει όλα και να σπείρει λίγο χάος προτού ξεκινήσει η σεζόν.</p>","hu_HU":"Nem véletlen, hogy Yi „Ziv” Chen elsöprő, 66,1%-os szavazati aránnyal lehet az LMS régiót képviselő felső ösvényes. Az LMS felső ösvényesei közül is kiemelkedik, és bizonyította, hogy a világ legjobbjaival is elbánik. Először a 2015-ös szezonközi meghívásos versenyen hívta fel magára a figyelmet, és két győzelemre vezette az AHQ-t Jayce-t irányítva a 2016-os világbajnokságon. Balszerencséjükre ez nem volt elég ahhoz, hogy az AHQ továbbjusson a csoportkörből.</p>\n\nZiv azzal szerzett hírnevet magának az LMS-ben, hogy kíméletlenül játszik a felső ösvényen. Akár a forrásig is üldözi az ellenfeleit. Elkötelezetten fejleszti a játéktudását: gyakorlómeccseken és az egyéni várólistán csiszolja a képességeit. A 2016-os All-Star gálán végre ellazulhat, és örömét lelheti a játékban.\n","it_IT":"C'è un motivo alla base dell'incredibile 66,1% di voti guadagnato da Yi \"Ziv\" Chen nella categoria Superiore per la regione LMS. Non solo rappresenta l'élite dei superiori della LMS, ma ha anche dimostrato di saper tenere testa ai migliori giocatori del mondo. Ha attirato l'attenzione sin dal suo debutto al Mid-Season Invitational 2015 e ha condotto gli AHQ a due importanti vittorie ai Mondiali 2016 grazie alle sue giocate stellari con Jayce. Tuttavia, la sua squadra non è riuscita a qualificarsi nella fase a gironi.</p>\n\nZiv si è fatto conoscere nella LMS per il suo approccio aggressivo in corsia superiore. Non ha paura di dare la caccia ai suoi avversari e neppure di seguirli fino alla loro base, se necessario. Ha dimostrato molto impegno nel migliorare il suo gioco ed è sempre intento a studiare nuove meccaniche in allenamento e nelle code in singolo. L'All-Star 2016 gli darà la possibilità di scatenarsi e portare un po' di caos fuori dalla stagione regolare.\n","ro_RO":"Există un motiv pentru care Yi ''Ziv'' Chen a obținut un procent uimitor de 66,1 la sută din voturile pentru culoarul de sus din LMS. Este cel mai bun jucător de pe această poziție din regiune și a dovedit că poate concura liniștit la nivel mondial. A atras privirile spectatorilor prin debutul său la Mid-Season Invitational 2015 și a condus AHQ către două dintre victoriile echipei, jucând surprinzător cu Jayce la Campionatul Mondial 2016. Din păcate, AHQ nu a reușit să treacă de faza grupelor.</p>\n\nZiv și-a creat o reputație în LMS cu strategia sa nemiloasă de pe culoarul de sus. Nu-i e teamă să-și urmărească adversarii până la fântână dacă e cazul. E gata să muncească enorm ca să devină mai bun și încearcă mereu să-și îmbunătățească mecanicile în antrenamente și pe lista de așteptare solo. All-Star Event 2016 este o nouă șansă să se dezlănțuie și să provoace puțin haos în perioada dintre sezoane.\n","es_MX":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>"},"foreignIds":{"drupalId":"4288","TRLH1":"1001380122","TRLH2":"1001280092","TRLH3":"1001360061","TRLH4":"1001310061","TRTW":"200000148","TRLT3":"200000257"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":617,"slug":"swordart","name":"SwordArT","firstName":"Shou-Chieh","lastName":"Hu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swordart-23wa49d3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:28:19.000Z","bios":{"en_US":"<p>Behind every great marksman is a great support. Chieh “SwordArT” Hu a perfect example of that. The LMS veteran excels on champions that can peel, zone and protect for his rookie ADC in the bot lane. He’s played a key role in all of the Flash Wolves’ upset victories over SK telecom T1, providing the vision and crowd control his team needs to win.</p> <p>He’s already established himself as the best support in the LMS, leading his role during the regular season with a ridiculous 12.0 KDA. While Maple and Karsa get the acclaim for their big plays, SwordArT is the guy behind the scenes making it all happen. The calm, cool, and collected shotcaller of the team, SwordArT can be found where the action is hottest, directing his teammates and keeping them alive.</p>","fr_FR":"Derrière chaque grand tireur se cache un grand support. Chieh « SwordArT » Hu illustre parfaitement cette maxime. Ce vétéran des LMS excelle avec les champions qui lui permettent de contrôler l'espace et de protéger son jeune ADC sur la voie du bas. Il a joué un rôle clé dans les victoires surprises des Flash Wolves face à SK Telecom T1, apportant la vision du jeu et les capacités de contrôle de foule dont son équipe avait besoin pour gagner.\n\nIl s'est illustré en devenant le meilleur support des LMS lors de la saison régulière, grâce à un KDA effarant de 12,0. Maple et Karsa sont acclamés pour leurs actions spectaculaires, mais SwordArT est bel et bien l'homme de l'ombre qui rend tout ceci possible. Décideur calme et posé au sein de l'équipe, SwordArT se trouve là où l'action est la plus débridée, dirigeant ses équipiers et les gardant en vie.\n","pl_PL":"Za każdym świetnym strzelcem stoi świetny wspierający. Chieh „SwordArt” Hu jest tego idealnym przykładem. Ten weteran LMS najlepiej gra bohaterami, którzy potrafią eskortować, utrudniać dostęp wrogom i chronić jego debiutującego prowadzącego na dolnej alei. Odegrał kluczową rolę we wszystkich niesamowitych zwycięstwach Flash Wolves z SK Telecom T1, zapewniając wizję i kontrolę tłumu, których drużyna potrzebuje, by wygrywać.\n\nJuż pokazał, że jest najlepszym wsparciem w LMS, osiągając szczyt w swojej roli podczas sezonu zasadniczego z nieprawdopodobnym wynikiem 12,0 Z/Z/A. Podczas gdy Maple i Karsa zachwycają swoimi wspaniałymi zagrywkami, SwordArT to gość, który stoi za kulisami i sprawia, że kolegom udaje się osiągnąć wszystko, co zamierzyli. Spokojnego i opanowanego lidera drużyny, jakim jest SwordArT, można znaleźć wszędzie tam, gdzie toczy się najgorętsza akcja. Stamtąd kieruje kolegami i utrzymuje ich przy życiu.\n","de_DE":"Hinter jedem großen Schützen steht ein großer Supporter. Und Chieh „SwordArT“ Hu ist ein perfektes Beispiel dafür. Der Veteran der LMS zeichnet sich vor allem mit Champions aus, mit denen er die Gegner abdrängen und seinen AD-Carry beschützen kann. Er spielte bei den Siegen der Flash Wolves gegen SK Telecom T1 eine entscheidende Rolle, weil er für die notwendige Sicht sorgte und seine Gegner mit Effekten zur Massenkontrolle unschädlich machte.\n\nMit einer unglaublichen TTU von 12,0 in der regulären Saison hat er bereits bewiesen, dass er der beste Supporter der LMS ist. Während Maple und Karsa für ihre „Big Plays“ bejubelt werden, ist SwordArT der Mann im Hintergrund, der all das überhaupt erst möglich macht. SwordArT ist der ruhige, gelassene und gefasste Spielführer der Mannschaft, der immer dort ist, wo es am heißesten wird, um seinen Teamkameraden die Richtung vorzugeben und sie am Leben zu halten.\n","es_ES":"Detrás de todo buen tirador, hay un buen apoyo. Chieh ''SwordArt'' Hu es un perfecto ejemplo de eso. El veterano de la LMS destaca con campeones que pueden defender, aislar y proteger a su ADC novato en la calle inferior. Ha jugado un papel clave en todas las victorias inesperadas de Flash Wolves contra SK telecom T1, pues ha facilitado la visión y el control de adversario que su equipo necesitaba para ganar.\n\nSe ha consolidado como el mejor apoyo de la LMS, destacando durante la temporada regular con un apabullante A/M/A de 12 puntos. Maple y Karsa serán los que se lleven los vítores por las grandes jugadas, pero SwordArT será quien las haga posibles entre bambalinas. El calmado líder del equipo, SwordArT, siempre se encontrará donde esté la acción, dirigiendo a sus compañeros y manteniéndolos con vida.\n","pt_BR":"<p>Atrás de todo ótimo carregador há um ótimo suporte. Chieh \"SwordArT\" Hu é um exemplo perfeito disso. O veterano da LMS manda bem com Campeões que podem iniciar, zonear e proteger o seu carregador novato na rota inferior. Ele teve um papel essencial em todas as vitórias da Flash Wolves sobre a SK Telecom T1, dando a visão e o Controle de Grupo que sua equipe precisou para vencer.</p> <p>Ele já se estabeleceu como o melhor suporte da LMS, liderando sua função durante a temporada regular com uma AMA absurdo de 12,0. Apesar de Maple e Karsa levarem todo o crédito pelas grandes jogadas, SwordArT é o cara que torna tudo isso possível. O calmo e tranquilo tomador de decisões da equipe pode ser encontrado sempre onde a ação estiver bombando, guiando seus companheiros e mantendo-os vivos. </p>","es_AR":"<p>Tras cada tirador agresivo hay un hábil soporte, un dicho que se ha confirmado en la carrera de Hu \"SwordArT\" Shou-Chieh. A SwordArT se lo considera un soporte mecánico increíblemente fuerte que lucha usando un campeón que pueda impedir acciones del enemigo, cubrir zonas y proteger (habilidades útiles cuando se está en un carril con NL). Si bien sus compañeros de equipo le recriminan algún combo ocasional fallido o Pulverizar de Alistar que solo golpea el aire, siempre busca proteger y defender a su equipo, símbolo de una verdadera leyenda de soporte.</p>\n\n<p>Buscará ser considerado como uno de los mejores soportes del mundo en Shanghai. Mientras Maple y Karsa reciben la atención por sus grandes actuaciones, SwordArT es quien se queda en segundo plano y hace que todo funcione. SwordArT, el tranquilo, relajado y sereno tirador del equipo, puede encontrarse donde la acción es más intensa, dirigiendo a sus compañeros y manteniéndolos con vida.</p>"},"foreignIds":{"drupalId":"676","TRLH3":"1001160054","TRLH4":"1001160054","TWTW":"135240","TRTW":"200000109","TRLT3":"200000256","TRLH1":"200000438","TRLH2":"200000338"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":631,"slug":"karsa","name":"Karsa","firstName":"Hao-Xuan","lastName":"Hong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/karsa-4n8bncs5.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:35:08.000Z","bios":{"en_US":"<p>Hao-Xuan “Karsa” Hong is the epitome of a “carry” jungler. Nothing strikes fear in Flash Wolves’ opponents as much as when Karsa locks in a Lee Sin or Graves pick for an important match. His legion of fans wouldn’t have it any other way.</p>\n\n<p>Karsa and the Flash Wolves impressed at Worlds last year by taking a game off soon-to-be champs SK telecom T1 in the group stage. The victory continued a trend for the Flash Wolves, who have built a name for themselves by upsetting SKT at international events.</p>","fr_FR":"Hao-Xuan « Karsa » Hong est la quintessence même d'un jungler « carry ». Rien ne fait plus peur aux adversaires des Flash Wolves que de voir Karsa choisir Lee Sin ou Graves pour un match important. Et ce n'est pas sa légion de fans qui nous contredira.\n\nKarsa et les Flash Wolves ont fait grande impression au Mondial l'an dernier en infligeant une défaite aux futurs champions de SK Telecom T1 lors de la phase de groupe. La chance a continué de sourire aux Flash Wolves qui se sont faits un nom en triomphant de SKT lors d'événements internationaux. Karsa va maintenant apporter son style de jeu spectaculaire et riche en ganks au Brésil, où il tentera de répéter son exploit contre les champions du monde.\n","pl_PL":"Hao-Xuan „Karsa” Hong to uosobienie „prowadzącego” dżunglera. Nikt nie budzi takiego lęku u przeciwników Flash Wolves, jak Karsa wybierający Lee Sina lub Gravesa w ważnym meczu. Legiony jego fanów uważają, że dzieje się tak nie bez powodu.\n\nKarsa i Flash Wolves zaimponowali na zeszłorocznych Mistrzostwach, wygrywając grę z SK Telecom T1 (przyszłymi mistrzami) w fazie grupowej. Zwycięstwo stanowiło kontynuację tradycji Flash Wolves, którzy zasłynęli drażnieniem SKT na imprezach międzynarodowych. Teraz Karsa pokaże swój oparty na gankowaniu, błyskotliwy styl gry w Brazylii, gdzie zamierza kolejny raz dogryźć mistrzom świata.\n","de_DE":"Hao-Xuan „Karsa“ Hong ist der Inbegriff eines „Carry“-Junglers. Nichts jagt den Gegnern der Flash Wolves mehr Angst ein als Karsa, wenn er in einem wichtigen Spiel Lee Sin oder Graves auswählt. Und genau das wollen seine zahlreichen Fans sehen.\n\nKarsa und die Flash Wolves haben bei der WM im letzten Jahr beeindruckt, indem sie in der Gruppenphase ein Spiel gegen die zukünftigen Weltmeister SK Telecom T1 gewinnen konnten. Mit diesem Sieg konnten die Flash Wolves den Trend fortsetzen und SKT wieder bei einem internationalen Turnier überraschen. Jetzt reist Karsa mit seinem auf Ganks basierenden Spielstil nach Brasilien, wo er den Weltmeister erneut in die Knie zwingen will.\n","es_ES":"Hao-Xuan ''Karsa'' Hung es la personificación del jungla carry. Nada despierta más terror entre los oponentes de Flash Wolves que ver a Karsa seleccionar a Lee Sin o a Graves en una partida importante. Su legión de fans lo tiene claro.\n\nKarsa y Flash Wolves dejaron a la audiencia boquiabierta el año pasado tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK telecom T1. La victoria continuó la tradición de Flash Wolves, que se ha ganado la fama vencer inesperadamente a SKT en los eventos internacionales. Karsa ahora trasladará su llamativo estilo de juego basado en las emboscadas a Brasil, donde intentará vencer una vez más a los campeones del mundo.\n","pt_BR":"<p>Hao-Xuan \"Karsa\" Hong é um verdadeiro caçador \"carregador\". Nada causa tanto medo nos adversários da Flash Wolves como o Karsa de Lee Sin ou Graves em uma partida importante. Sua legião de fãs não aceitaria nada diferente.</p>\n\n<p>Karsa e a Flash Wolves impressionaram no Mundial do ano passado, conseguindo uma vitória contra a campeã SK Telecom T1 na Fase de Grupos. A vitória continuou um tema recorrente para a Flash Wolves, que fez seu nome vencendo a SKT em eventos internacionais. Karsa agora trará seu estilo de jogo exuberante e de fortes emboscadas para o Brasil, onde ele vai tentar dar outra mordida nos campeões mundiais.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hau-Hsuan \"Karsa\" Hung은 Flash Wolves 선수들 중에서 2013 월드 챔피언십에 Gamania Bears로 출전하지 않은 유일한 선수입니다. 하지만 팀에서 소외감을 느끼진 않죠. Karsa는 전 Gama Bears 정글러 Winds를 보며 정글 운영의 요령을 배웠습니다. 덕분에 정신적으로 그의 후임자가 된 동시에 팀에 자연스럽게 어울리게 됐죠. </p>\n<p style=”font-family:”나눔고딕”;\">Karsa는 현재 대만에서 가장 강력한 정글러 중 하나로 꼽힙니다. 2015 월드 챔피언십에서 킬 관여율 75%라는 엄청난 기록을 낸 걸 보면 알 수 있죠. Flash Wolves는 8강에서 멈춰야 했지만 여전히 LMS 지역의 자부심입니다. 믿겨지지 않는다면 그의 팬이 얼마나 많은지 확인해 보세요. Karsa는 Flash Wolves 선수들 중에서 팬클럽 규모가 가장 큽니다. Karsa에게 가면 다신 돌아올 수 없죠. 늑대 무리에 들어온 걸 환영합니다. </p>\n","es_AR":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>","cs_CZ":"<p>Hao Hsuan „Karsa“ Hung je učebnicovým příkladem „tahounského“ džunglera. Nic nenažene soupeřům Flash Wolves takový strach, jako když si Karsa při důležitém utkání vybere Lee Sina nebo Gravese. Zástupy jeho fanoušků jsou ovšem spokojeny – důkazem je, že obdržel 49 % hlasů pro džunglera z LMS.</p>\n\n<p>Karsa a Flash Wolves podali na MS velice slušný výkon, za zmínku stojí především fakt, že ve skupině porazili budoucí šampiony z SK Telecom T1. Tato výhra byla pokračováním zavedeného trendu, Flash Wolves se totiž proslavili tím, jak na mezinárodních turnajích s oblibou šlapou SKT na kuří oko. Karsův efektní herní styl plný přepadů bude na All-Star 2016 jistě vzbuzovat pozornost, tento turnaj je totiž jako stvořený pro mladé kreativní hráče typu tohoto hvězdného džunglera z Flash Wolves.</p>","el_GR":"<p>Ο Hao Hsuan “Karsa” Hung είναι η επιτομή του παίκτη ζούγκλας τύπου carry. Όταν ο Karsa καταφέρνει να πάρει τον Λι Σιν ή τον Γκρέιβς σε έναν σημαντικό αγώνα, προκαλεί τον τρόμο σε όλους τους αντιπάλους των Flash Wolves. Οι στρατιές των οπαδών του θέλουν να τον δουν να κάνει αυτό που ξέρει καλύτερα, για αυτό του έδωσαν το 49% των ψήφων του LMS για τη θέση της ζούγκλας.</p>\n\n<p>Ο Karsa και οι Flash Wolves έκαναν αίσθηση φέτος στο Παγκόσμιο Πρωτάθλημα όταν κατάφεραν να πάρουν ένα παιχνίδι από τους αδιαμφισβήτητους πρωταθλητές SK Telecom T1 στη φάση ομίλων. Η νίκη αυτή συνέχισε την παράδοση των Flash Wolves, οι οποίοι καταφέρνουν να νικούν τους SKT σχεδόν σε κάθε διεθνές τουρνουά. Ο Karsa έχει ένα θεαματικό στυλ παιχνιδιού με έμφαση στον αιφνιδιασμό, το οποίο σίγουρα θα προκαλέσει αίσθηση στο Τουρνουά All-Star 2016, μια διοργάνωση που συνήθως αναδεικνύει νεαρούς οργανωτές, όπως ο διάσημος παίκτης ζούγκλας των Flash Wolves.</p>\n","hu_HU":"Hao Hsuan „Karsa” Hung egy igazi „lövész” dzsungelharcos. A Flash Wolves ellenfelei joggal félhetnek, ha Karsa megszerzi Lee Sint vagy Gravest egy fontos meccsen. A rajongói is szeretnék újra látni őt, mivel az LMS dzsungelharcos-szavazásában 49%-nyi szavazatot söpört be.</p>\n\nKarsa és a Flash Wolves a vb-n játékot tudott nyerni a későbbi bajnok SK Telecom T1 ellen a csoportkörben. A győzelemmel a Flash Wolves tovább építette a hírnevét, és rendszeresen odaszúrnak az SKT-nek a nemzetközi versenyeken. Karsa szereti a rajtaütéseket és a látványos akciókat, amit a 2016-os All-Star gála közönsége is imádni fog, hiszen a versenyt gyakorlatilag a Flash Wolves dzsungelharcos sztárjához hasonló fiatal tehetségeknek találták ki.\n","it_IT":"Hao Hsuan \"Karsa\" Hung è l'incarnazione del perfetto \"carry\" da giungla. Nulla instilla più paura negli avversari dei Flash Wolves di quando Karsa sceglie Lee Sin o Graves durante un incontro importante. Le sue legioni di fan non hanno dubbi su di lui, come testimoniato dal 49% di voti ottenuti nella categoria Giungla della LMS.</p>\n\nKarsa e i Flash Wolves hanno mostrato grandi numeri ai Mondiali di quest'anno, vincendo una partita nei gironi contro coloro che poi si sarebbero confermati campioni del mondo, gli SK Telecom T1. Questa vittoria rappresenta quasi una consuetudine per i Flash Wolves, che sono ormai noti per essere una spina nel fianco degli SKT negli eventi internazionali. Lo stile vistoso e fortemente basato su assalti di Karsa terrà di sicuro molti occhi incollati agli schermi durante l'All-Star 2016, un evento che molti considerano fatto su misura per giovani registi come la star della giungla dei Flash Wolves.\n","ro_RO":"Hao Hsuan ''Karsa'' Hung este întruchiparea unui jungler ''carry''. Adversarii celor de la Flash Wolves au de ce să se teamă când Karsa îl alege pe Lee Sin sau pe Graves într-un meci important. Numeroșii săi fani n-au vrut nici ei să-l lase la greu și l-au onorat cu 49 la sută din voturile pentru junglerul LMS.\n</p>\nKarsa și Flash Wolves au impresionat la Mondialele din acest an, câștigând un meci în faza grupelor împotriva viitorilor campioni, SK Telecom T1. Victoria a continuat tendința deja renumită a echipei de a-i surprinde în mod neplăcut pe cei din SKT la evenimente internaționale. Stilul de joc bazat pe gank-uri al lui Karsa va atrage cu siguranță multe priviri la All-Star 2016, un eveniment care pare parcă făcut special pentru playmakeri tineri precum junglerul extraordinar din Flash Wolves.\n","es_MX":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>"},"foreignIds":{"drupalId":"3721","TRLH3":"1001360062","TRLH4":"1001310062","TRLH1":"200000435","TRLH2":"200000335","TRTW":"200000013","TRLT3":"200000253"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":633,"slug":"mmd","name":"MMD","firstName":"Li-Hong","lastName":"Yu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mmd-hhy6fhit.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:37:03.000Z","bios":{"en_US":"<p>\nA one-time sub who stood behind Steak, Li-Hong “MMD” Yu has now built a name for himself as the Flash Wolves' top laner. MMD is known for his aggression and carry style, and his mechanics are top tier. However, he’s perfectly happy to switch to supportive tank picks and funnel resources towards the rest of his team. His Equalizers were on point as Rumble in the LMS Finals, which helped his team pick up the 3-1 victory over ahq e-Sports Club.\n</p>","es_AR":"<p>Yu \"MMD\" Li-Hung, que alguna vez fue espectador de la escena competitiva, es ahora el carrilero superior inicial de FW, su miembro más reciente y una pieza esencial de su éxito. MMD fue famoso anteriormente por sus juegos como acarreador y por su agresividad, siendo aún una clara mejora mecánica sobre su predecesor. En el meta actual, está feliz de cambiar al enfoque de tanque de soporte que actualmente lucha como Ekko y canaliza recursos para los acarreadores de su equipo. A pesar de que desempeña un papel de soporte, tiene lo suyo: su Poppy 6/1/11 contra AHQ en la Final del LMS de primavera es prueba de que es capaz de ir al frente y hacer el trabajo en la primera línea. Con Steak aún en la mayoría de los simpatizantes, MMD buscará su lugar frente al mundo en el Campeonato Mundial 2016.</p>","fr_FR":"Suite à son expérience de remplaçant pour Steak, Li-Hong « MMD » Yu s'est fait un nom en tant que toplaner des Flash Wolves. MMD est connu pour son agressivité et son style de carry, ainsi que pour ses mécaniques de premier ordre. Cependant, il est heureux d'incarner des supports tankys et de canaliser les ressources vers le reste de son équipe. Les Éradications de son Rumble ont fait des miracles lors de la finale des LMS et ont permis à son équipe de remporter une victoire à 3-1 contre ahq e-Sports Club. Il s'apprête maintenant à participer au Mid-Season Invitational 2017 pour avoir une nouvelle chance de vaincre SK Telecom T1.","es_ES":"El que fuera suplente de Steak, Li-Hong ''MMD'' Yu, ahora se ha forjado una reputación como top de Flash Wolves. MMD es famoso por su agresividad y liderazgo, y sus mecánicas son del más alto nivel. No obstante, está encantado de pasar a usar tanques de apoyo y concentrar todos sus recursos en ayudar a su equipo. En la final de la LMS consiguió usar justo a tiempo los Equilibradores de Rumble, lo que ayudó a que su equipo consiguiese una victoria 3-1 contra ahq e-Sports Club. Ahora se dirige al Mid-Season Invitational 2017 para enfrentarse una vez más a SK telecom T1","de_DE":"Der ehemalige Ersatzspieler für Steak, Li-Hong “MMD” Yu, konnte sich im Laufe der Zeit als Top-Laner der Flash Wolves einen Namen machen. MMD ist für seinen aggressiven Carry-Stil und seine überragenden Spielmechaniken bekannt. Er hat jedoch auch kein Problem damit, unterstützende Tanks zu spielen und dem Rest seiner Mannschaft Ressourcen zukommen zu lassen. Beim 3–1 Sieg über ahq e-Sports Club im Finale der LMS brachte er seine Gegner mit Rumbles Einebner zur Verzweiflung. Jetzt ist er zum Mid-Season Invitational 2017 unterwegs, wo er wieder versuchen wird, SK Telecom T1 zu Fall zu bringen.","pl_PL":"Jednorazowy zastępca Steaka, Li-Hong „MMD” Yu zdobył sobie rozgłos jako górny Flash Wolves. MMD jest znany ze swojej agresji i stylu prowadzenia, a jego umiejętności mechaniczne są najwyższej klasy. Potrafi też bez żadnych problemów zmienić rolę na wspierającego obrońcę, aby uzupełniać zasoby pozostałych członków drużyny. Doskonale wykorzystał Wyrównywacze Rumble’a w finale LMS, co pomogło drużynie osiągnąć zwycięstwo 3−1 z ahq e-Sports Club. Teraz zmierza na Mid-Season Invitational 2017, by jeszcze raz spróbować pobić SK Telecom T1.","pt_BR":"<p>O antes reserva de Steak, Li-Hong \"MMD\" Yu, agora deixou seu nome famoso como jogador da rota superior da Flash Wolves. MMD é conhecido pelo seu estilo agressivo e carregador, e por suas mecânicas de primeira. No entanto, ele ficou feliz de trocar para escolhas de tanques suportes e canalizar recursos para o resto de sua equipe. Seus Equalizadores estavam perfeitos como Rumble na final da LMS, quando ele ajudou a equipe a conquistar uma vitória de 3-1 sobre a ahq e-Sports Club. Agora ele vai para o Mid-Season Invitational 2017 para conseguir revanche contra a SK Telecom T1.</p>"},"foreignIds":{"drupalId":"3720","TRTW":"200000150","TRLT3":"200000252","TRLH1":"200000434","TRLH2":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1019,"slug":"lbb","name":"LBB","firstName":"Bing-Xin","lastName":"Liu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lbb-brctu3lx.png","hometown":"","region":"LMS Taiwan","birthdate":null,"createdAt":"2016-01-06T21:51:14.000Z","updatedAt":"2017-03-24T20:16:37.000Z","bios":{},"foreignIds":{"TRTW":"200000058"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":1646,"slug":"betty","name":"Betty","firstName":"Yu-Hung","lastName":"Lu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betty-i225lkpn.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-01-09T22:47:23.000Z","updatedAt":"2017-07-06T14:28:07.000Z","bios":{"en_US":"<p>Yu-Hung \"Betty\" Lu is the standout rookie AD carry for the Flash Wolves. He joined the squad late last year, replacing former starter NL. Formerly known as \"DoubleRed,\" he made his debut at IEM Oakland and later picked up his first trophy at the IEM World Championship in Katowice. He continued to impress in the 2017 LMS Spring Split, leading all AD carries with an 8.8 KDA. He excelled on Ashe and Varus, going 16-0 combined on those two champions.</p>","pl_PL":"Yu-Hung „Betty” Lu jest wyróżniającym się debiutantem w roli prowadzącego Flash Wolves. Dołączył do drużyny pod koniec zeszłego roku, zastępując wcześniejszego zawodnika pierwszego składu, NL-a. Znany dawniej jako „DoubleRed” debiutował na IEM Oakland, a później zdobył swoje pierwsze trofeum na Mistrzostwach Świata IEM w Katowicach. \n\nNie przestawał imponować podczas splitu wiosennegoLMS 2017, stając się liderem wszystkich prowadzących z 8,8 Z/Z/A. Błyszczał, grając Ashe i Varusem, i w efekcie zdobył z tą dwójką bohaterów łączny wynik 16−0. Teraz jego determinacja zostanie przetestowana podczas Mid-Season Invitational 2017, na którym zmierzy się z kilkoma najlepszymi dolnymi, jakich zna świat.\n","fr_FR":"Yu-Hung « Betty » Lu est le jeune carry AD prodige des Flash Wolves. Il a rejoint la formation l'année dernière, remplaçant NL. Anciennement connu sous le pseudo « DoubleRed » Betty a fait ses débuts aux IEM d'Oakland et a, par la suite, remporté son premier trophée lors des IEM World Championship de Katowice. \n\nIl a fait forte impression lors du segment de printemps 2017 de la région LMS, dominant tous les carrys AD avec un KDA de 8,8. Lors du championnat, il a fait des merveilles avec Ashe et Varus en réalisant une série de victoires combinées de 16-0 avec ces deux personnages. Sa résolution sera mise à l'épreuve lors du Mid-Season Invitational 2017, où il affrontera certains des meilleurs spécialistes au monde de la voie du bas.\n","es_ES":"Yu-Hung ''Betty'' Lu es el prodigioso novato ADC de Flash Wolves. Se unió al grupo al final del año pasado, para reemplazar al titular NL. Conocido anteriormente como ''DoubleRed'', hizo su debut en el IEM Oakland y no tardaría en conseguir su primer trofeo en el IEM World Championship de Katowice. \n\nSiguió sorprendiendo al público en el split de primavera de la LMS 2017, donde superó a todos los carries con un A/M/A de 8,8 puntos. Destacó con campeones como Ashe y Varus, con los que consiguió quedar 16-0. Ahora tendrá que demostrar su determinación en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores dúos de bot del mundo.\n","de_DE":"Yu-Hung „Betty“ Lu ist der AD-Carry der Flash Wolves und ein herausragender Nachwuchsspieler. Er stieß Ende des letzten Jahres als Ersatz für NL zur Mannschaft. Betty, früher bekannt als „DoubleRed“, gab sein Debüt beim IEM Oakland und gewann seinen ersten Titel bei der IEM-Weltmeisterschaft in Katowice. \n\nEr konnte auch im Frühjahrs-Split der LMS 2017 beeindrucken, wo er mit einer TTU von 8,8 der beste AD-Carry war. Dabei lieferte er vor allem mit Ashe und Varus überragende Leistungen ab, mit denen er zusammen 16 Spiele gewinnen konnte. Beim Mid-Season Invitational 2017 wird er seine Entschlossenheit unter Beweis stellen müssen, wenn er es auf der unteren Lane mit einigen der besten Duos der Welt zu tun bekommt.\n","pt_BR":"<p>Yu-Hung \"Betty\" Lu é o carregador novato de destaque da Flash Wolves. Ele entrou na equipe no final do ano passado, substituindo o antigo titular NL. Anteriormente era conhecido como \"DoubleRed\" e seu debut foi na IEM Oakland. Mais tarde, ele pegou seu primeiro troféu no Campeonato Mundial IEM, em Katowice. </p>\n\n<p>Ele continuou a impressionar na Etapa de Primavera LMS 2017, liderando todos os carregadores com uma AMA de 8,8. Ele foi excelente com a Ashe e o Varus, com 16-0 combinado na soma dos dois Campeões. Sua determinação será testada no Mid-Season Invitational 2017, onde ele enfrentará alguns dos melhores jogadores de rota inferior que o mundo tem a oferecer.</p>"},"foreignIds":{"TRTW":"200000015","TRLT3":"200000255","TRLH1":"200000437","TRLH2":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1849,"slug":"cyo","name":"Cyo","firstName":"Shi-Yo","lastName":"Lin","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-03-17T19:03:22.000Z","updatedAt":"2017-07-06T14:38:40.000Z","bios":{},"foreignIds":{"TRTW":"200000452","TRLT3":"200000204"},"socialNetworks":{},"champions":[],"liveGameTeam":91}],"scheduleItems":[{"id":"AV04UQ7bQMQFcjhwbQ9r","content":"urn:rg:lolesports:global:highlander:tournament:cb4835d1-3511-4f52-a047-dce6e0cc2b83:match:11e061ec-51bc-4d54-afcb-29c554d09b26","scheduledTime":"2017-08-25T07:00:00.347+0000","tags":{"blockLabel":"Finals","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:cb4835d1-3511-4f52-a047-dce6e0cc2b83:bracket:05acdfab-afd6-4320-82a5-fd78e610dec4","leagueLabel":"urn:rg:lolesports:global:league:league:8","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:cb4835d1-3511-4f52-a047-dce6e0cc2b83"},"match":"11e061ec-51bc-4d54-afcb-29c554d09b26","tournament":"cb4835d1-3511-4f52-a047-dce6e0cc2b83","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","league":"8"}],"gameIdMappings":[],"videos":[],"htmlBlocks":[],"match":{"id":"11e061ec-51bc-4d54-afcb-29c554d09b26","name":"grand-final","position":0,"state":"unresolved","groupPosition":2,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"games":{"203b7b1c-06a7-4d5e-a697-0253aa6d0d6c":{"id":"203b7b1c-06a7-4d5e-a697-0253aa6d0d6c","name":"G1","generatedName":"AHQ|FW|G1|11e061ec51bc4d54afcb","input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"80a03d83-f627-4a14-a080-c1da70bf4f79":{"id":"80a03d83-f627-4a14-a080-c1da70bf4f79","name":"G2","generatedName":"AHQ|FW|G2|11e061ec51bc4d54afcb","input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"64cc75f1-2690-4b03-bb0f-7e0b8272955f":{"id":"64cc75f1-2690-4b03-bb0f-7e0b8272955f","name":"G5","generatedName":"AHQ|FW|G5|11e061ec51bc4d54afcb","input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"094026d4-d4bb-4577-8c46-06adfbf26e6f":{"id":"094026d4-d4bb-4577-8c46-06adfbf26e6f","name":"G3","generatedName":"AHQ|FW|G3|11e061ec51bc4d54afcb","input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4b6a4557-70f5-4fef-bebd-a050b67291a5":{"id":"4b6a4557-70f5-4fef-bebd-a050b67291a5","name":"G4","generatedName":"AHQ|FW|G4|11e061ec51bc4d54afcb","input":[{"roster":"a40a7244-ff6c-4896-9643-ef1c5b0687f6","breakpoint":"7fcf9d62-5ee1-4e84-a428-e1c9997010f3","standing":0},{"roster":"82c9a5c8-d4ab-4a15-8456-dda20cb2a1e1","bracket":"05acdfab-afd6-4320-82a5-fd78e610dec4","match":"1d0f3c09-268b-4cf4-877b-bf7380d7a152","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{}}}