{"teams":[{"id":81,"slug":"snake","name":"Snake Esports","guid":"be6e080d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/snake-iqttt327.png","acronym":"SS","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:18:15.000Z","bios":{"en_US":"","fr_FR":"Snake a obtenu la 2e place lors de ses débuts dans la LPL lors de la compétition de printemps 2015. Ces débuts foudroyants se sont axés sur l'aptitude à miser toutes les ressources sur le carry AD et le top laner et à attendre les combats d'équipe de fin de partie pour faire basculer la partie en leur faveur. Ce n'est peut-être pas révolutionnaire, mais cela suffit pour permettre à Snake d'affronter les meilleures équipes de la LPL.","pl_PL":"Snake wyłoniło się z LSPL i zajęło 2. miejsce podczas swojego debiutu w LPL w wiosennym sezonie LPL 2015. Drużyna zademonstrowała chęć skupienia całej uwagi na swoim prowadzącym i górnym, a następnie wyczekania walk w późnej fazie gry, aby przechylić szalę zwycięstwa na swoją korzyść. Może nie jest to nic nowego, ale wystarczyło, aby utrzymać Snake w walce z najlepszymi drużynami w LPL."},"foreignIds":{"drupalId":"3748"},"players":[121,520,526,533,841,914,994,1661],"starters":[520,526,914,994,1661],"subs":[121,533,841]},{"id":171,"slug":"hyper-youth-gaming","name":"Saint Gaming","guid":"be70e5d3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/hyper-youth-gaming-8pd7ebwk.png","acronym":"SAT","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-01-05T00:24:51.000Z","updatedAt":"2016-10-25T19:10:23.000Z","bios":{},"foreignIds":{},"players":[307,513,985,987,988,1287,1288,1289,1290,1474],"starters":[307,985,987,988,1289],"subs":[513,1287,1288,1290,1474]}],"players":[{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":307,"slug":"acorn","name":"Acorn","firstName":"Cheon-ju","lastName":"Choi","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/acorn-1pkbyfan.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2016-02-01T22:56:57.000Z","bios":{"en_US":"<p>\nCheon-ju “Acorn” Choi is no stranger to the international stage. He started out his career on GSG, but he’s probably better known for his time on Samsung Blue, where he cemented himself as a solid all-around top laner. Although Acorn was originally primarily known for his Rumble, these days he is more flexible, often resorting to champions that provide more utility for his team like Hecarim or Maokai. Regardless of what champion he is playing, his <a href=\"https://www.youtube.com/watch?v=wJHZSgNt3hs&feature=youtu.be&t=5h26m50s\">Teleport timing</a> and uncanny flanks are widely regarded as some of the best in the world.\n</p>\n\n<p>\nAcorn changed more than just his champion picks when he moved to LGD. He intentionally made himself an integral part of team. Wearing a cheeky smile on his face, he can frequently be seen carrying around a handful of chocolate snacks on stage, gearing up for the next match. While Samsung Blue’s disappointing loss at the 2014 World Championships might have left a bad taste in the mouth of some, Acorn saw it as an opportunity to move on to brighter pastures -- and tastier treats.\n</p>","fr_FR":"<p>Cheon-ju « Acorn » Choi n'est pas un inconnu sur la scène internationale. Il a commencé sa carrière chez GSG, mais c'est sans doute pour son passage chez Samsung Blue qu'on le connaît, car il s'y est bâti une solide réputation de top laner polyvalent. Et si Acorn s'est surtout fait connaître en jouant Rumble, de nos jours, il se montre beaucoup plus souple et fait souvent appel à des champions qui offrent plus d'avantages au reste de son équipe, comme Hecarim ou Maokai. Peu importe le champion qu'il joue, son <a href=\"https://www.youtube.com/watch?v=wJHZSgNt3hs&feature=youtu.be&t=5h26m50s\">timing des téléportations</a> et ses attaques sur le flanc sont de véritables références, partout dans le monde.</p>\n\n<p>Acorn n'a pas seulement changé de champions quand il est arrivé des LGD. Il a volontairement donné de sa personne pour faire partie intégrale de l'équipe. On le voit souvent arriver, sourire au visage, avec une poignée de bonbons au chocolat sur scène, avant de se préparer pour le match suivant. Et si la défaite décevante de Samsung Blue lors des Championnats du monde a laissé un goût amer à certains joueurs, Acorn y a vu une occasion de découvrir des pâturages plus verts... et des bonbons plus attirants.</p>","pl_PL":"<p>W rozgrywkach międzynarodowych Cheon-ju „Acorn” Choi uczestniczy nie po raz pierwszy. Karierę zaczynał w GSG, najbardziej znany jest chyba z występów w Samsung Blue, gdzie zyskał reputację niezawodnego i wszechstronnego zawodnika z górnej alei. Choć Acorn słynął początkowo z gry Rumblem, obecnie jest o wiele bardziej wszechstronny. Nierzadko korzysta z bohaterów wspierających drużynę umiejętnościami użytkowymi, jak np. Hecarim czy Maokai. Niezależnie od tego, jakim bohaterem gra, powszechnie uważa się, że z <a href=\"https://www.youtube.com/watch?v=wJHZSgNt3hs&feature=youtu.be&t=5h26m50s\">Teleportu</a> umie korzystać jak nikt inny na świecie.</p>\n\n<p>Po dołączeniu do LGD Acorn zmienił się jednak nie tylko pod względem wybieranych przez siebie bohaterów. Jego wysiłki sprawiły, że stał się integralną częścią zespołu. Podczas przygotowań do następnego meczu często towarzyszy mu zawadiacki uśmiech i garść chrupek czekoladowych. Choć rozczarowująca klęska Samsung Blue w trakcie mistrzostw świata 2014 pozostawiła pewien niesmak, Acorn uznał, że to świetna okazja, by się wybić i załatwić sobie lepsze przekąski.</p>","de_DE":"<p>Cheon-ju „Acorn“ Choi ist kein Unbekannter in der internationalen Szene. Zuerst bei GSG wurde er vor allem durch seine Zeit bei Samsung Blue bekannt, wo er sich selber als solider Allrounder auf der Top-Lane sah. Obwohl er anfangs vor allem für seinen Rumble bekannt war, ist er heute mehr flexibel, was darin resultiert, dass er mehr teamfähige Champions wie Maokai oder Hecarim wählt. Aber egal welchen Champion er letztendlich spielt, seine Teleports und ungewöhnliche Flankierungen werden weltweit zu den Besten gezählt. </p>\n\n<p>Acorn hat mehr als nur seine Champion-Auswahl verändert, als er zu LGD wechselte. Mittlerweile gehört er zu den festen Stützen seines Teams. Immer ein Lächeln auf den Lippen, kann man ihn vor allem zwischen den Matches beobachten, wie er Schokolade verteilt, um alle für das nächste Match auszurüsten. Während bei vielen die Niederlage von Samsung Blue bei den Worlds 2014 einen bitteren Nachgeschmack hinterlassen hat, sah Acorn dies als eine Chance an, um nach neuen Leckerbissen zu streben. </p>\n","es_ES":"Cheon-ju ''Acorn'' Choi no es un recién llegado al escenario internacional. Aunque comenzó su carrera en GSG, seguramente sea más conocido por su etapa en Samsung Blue, donde consolidó su fama como un jugador completo y fiable en la calle superior. En sus primeros tiempos su campeón estrella era Rumble, pero últimamente ha ganado en flexibilidad y suele decantarse por otros que ofrecen más utilidad a su equipo, como Hecarim o Maokai. Al margen del campeón que lleve, todo el mundo reconoce que su <a href=\"https://www.youtube.com/watch?v=wJHZSgNt3hs&feature=youtu.be&t=5h26m50s\">sentido de la oportunidad con Teleportar</a> y sus extraordinarios ataques por el flanco se encuentran entre los mejores del mundo.\n\nAcorn no cambió solo de campeón al fichar por LGD. Tomó la decisión premeditada de convertirse en parte integral de su equipo. Es muy habitual verlo en el escenario, con una sonrisa pícara y un puñado de chocolatinas, preparándose para la próxima partida. Puede que la decepcionante derrota de Samsung Blue en el Campeonato Mundial 2014 dejase mal sabor de boca a algunos, pero para Acorn fue una oportunidad para mudarse a pastos más verdes... y chocolates más apetitosos.\n","pt_BR":"<p>Cheon-ju “Acorn” Choi não é novato em torneios internacionais. ele começou sua carreira na GSG, mas você provavelmente o conhece da Samsung Blue, time no qual ele foi eleito um dos melhores topos do mundo. Acorn era muito lembrado por seu Rumble no começo da carreira, mas está mais flexível hoje em dia, escolhendo campeões com mais utilidade para a equipe, como Hecarim e Maokai. Não importa com qual campeão ele está jogando, seu <a href=\"https://www.youtube.com/watch?v=wJHZSgNt3hs&feature=youtu.be&t=5h26m50s\">timing com Teleporte</a> faz com que sua jogada de flanquear os adversários seja uma das melhores do mundo.</p>\n\n<p>Acorn mudou mais do que somente suas escolhas de campeões quando foi para a LGD. Ele, intencionalmente, tornou-se parte integral da equipe. Com um sorriso de orelha a orelha, ele pode ser visto carregando chocolates pelo palco da LPL, esperando a próxima partida começar. Enquanto a derrota da Samsung Blue nas semifinais do Mundial 2014 deixou muitos com um gosto amargo na boca, Acorn viu uma oportunidade de um futuro melhor - e com um gosto mais doce.</p>"},"foreignIds":{"drupalId":"980","TRLH1":"1000185066","TRLH3":"1001160023","TRLH4":"1001160023"},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":513,"slug":"styz","name":"Styz","firstName":"Qu","lastName":"Ziliang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/styz-fsn45574.png","hometown":"Changsha, China","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2016-10-28T17:53:53.000Z","bios":{"en_US":"The AD carry for LGD, Styz has high hopes for his team and his personal career this season. His ultimate goal is to beat every other AD carry on a global stage, but in order to do that, he’ll have to rise to the occasion and conquer the 2014 LPL. "},"foreignIds":{"drupalId":"2067"},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":520,"slug":"zz1tai","name":"Zz1tai","firstName":"Zhihao","lastName":"Liu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/zz1tai-hadyl6ic.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:13:45.000Z","bios":{"en_US":"","fr_FR":"<p>Liu « Zz1tai » Zhihao est partout dans la Faille de l'invocateur. Littéralement. Officiellement, il est top laner, mais avant, il était mid laner, et il a déjà officié en tant que carry AD. Quel que soit son rôle, on peut compter sur Zz1tai pour jouer agressivement.</p>\n\n<p>L'agressivité dont Zz1tai fait preuve en cours de partie disparaît dès qu'il n'est plus dans le jeu. Il ne fait alors preuve que d'une assurance discrète. Parce que pour lui, maintenir un bon équilibre entre séances d'entraînement intense et hobbies/intérêts personnels est indispensable.</p>","pl_PL":"<p>Liu „Zz1tai” Zhihao pojawia się na całym Summoner's Rift. Dosłownie. Oficjalnie gra na górnej alei, ale był kiedyś środkowym i czasem grywa prowadzącymi. Niezależnie od tego, na jakiej pozycji gra, można liczyć na to, że będzie agresywny.</p>\n\n<p>Jego agresja kończy się jednak z momentem zakończenia gry. Zamiast niej pojawia się spokojna pewność siebie. Zz1tai przykłada wiele uwagi do zachowania równowagi między intensywnymi treningami a prywatnymi hobby i zainteresowaniami.</p>","de_DE":"<p>Liu “Zz1tai” Zhihao kann alles in der Kluft. Wortwörtlich. Er spielt offiziell Top-Lane, war früher jedoch auf der Mid-Lane und versuchte sich auch schon als ADC. Egal auf welcher Position Zz1tai spielt, du kannst darauf vertrauen, dass er aggressiv spielt. </p>\n\n<p>Zz1tai´s aggressiver Spielstil fällt nach dem Spiel jedoch ab. An seine Stelle tritt stilles Selbstvertrauen. Er ist mit Leib und Seele dabei, wenn es um einen Ausgleich zwischen hartem Training und seinen Hobbies und Interessen geht. </p>\n","es_ES":"<p>Liu “Zz1tai” Zhihao está por todas las partes de la Grieta. Literalmente. Su puesto oficial se encuentra en la calle superior, anteriormente era mid, y también es ha coqueteado con el puesto de tirador. Da igual la posición en la que esté, porque sabes que Zz1tai va a ser agresivo. </p>\n\n<p>Aunque el juego agresivo de Zz1tai se desvanece cuando abandona la Grieta, fuera de ella es un chico tranquilo. Está decidido a mantener un balance entre su vida profesional, con las largas sesiones de juego y entrenamiento, y su vida personal, con sus aficiones e intereses. </p>\n","pt_BR":"<p>Aí está um cara que roda o mapa todo. Zz1tai é, oficialmente, jogador da rota superior, mas já chegou a jogar na rota do meio e é capaz de fazer o papel de atirador se você precisar. Não importa qual seja a posição, você pode apostar que ele vai jogar agressivamente.</p>\n<p>Fora do jogo, porém, essa agressividade dá lugar à tranquilidade. Zz1tai se dedica a manter um bom equilíbrio entre a rotina intensa de treinos profissionais e seus hobbies pessoais.</p>\n"},"foreignIds":{"drupalId":"2065","TRLH3":"1001160030","TRLH4":"1001160030"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":526,"slug":"flandre","name":"Flandre","firstName":"Xuan-jun","lastName":"Ji","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/flandre-5toeniwo.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:12:36.000Z","bios":{"en_US":"","fr_FR":"<p>\nLi « Flandre » Xuanjan est célèbre pour sa capacité à jouer un très large échantillon de champions sur la voie du haut. Avec pas moins de 11 champions différents utilisés lors du Segment d'été des LPL 2015, il a assurément plus d'un tour dans son sac (même s'il joue beaucoup Hecarim). Les chenapans de la voie du haut de Flandre et ses ordres opportuns ont permis à Snake de participer aux play-offs du printemps des LPL 2015.\n</p>\n<p>\nMalheureusement (pour lui), les performances de Flandre sur la voie du haut ont attiré l'attention de ses adversaires. Il est donc maintenant souvent la cible des bannissements et des ganks. Mais même quand il a pris du retard, il reste une menace à ne pas oublier : Flandre adore se jeter au coeur des combats d'équipe en se téléportant au bon moment.\n</p>","pl_PL":"<p>\nLi „Flandre” Xuanjan znany jest z używania szerokiego wachlarza bohaterów na górnej alei. Wybierał 11 różnych postaci w letnim sezonie LPL 2015, więc jest prawdziwym człowiekiem renesansu. Wyczyny Flandre na górnej alei oraz podejmowanie dobrych decyzji sprawiły, że Snake trafili do playoffów LPL w wiosennym splicie LPL 2015.\n</p>\n<p>\nNiestety (dla niego) dobra gra Flandre została zauważona przez przeciwników. Teraz często staje się obiektem ganków i banów. Ale nawet kiedy ma problemy, wciąż stanowi zagrożenie – uwielbia wpadać w środek walk drużynowych teleportacją.\n</p>"},"foreignIds":{"drupalId":"3782"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":533,"slug":"kryst4l","name":"Kryst4l","firstName":"Pan","lastName":"Yang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kryst4l-fxs01yrw.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:15:40.000Z","bios":{"en_US":"","fr_FR":"<p>\nYang « kRYST4L » Fan est l'un des rares carrys AD de la scène pro qui a appris à être moins agressif que par le passé pour obtenir des résultats. kRYST4L a toujours été une menace majeure avec des champions hypercarry comme Vayne et Kog'maw, mais il se faisait souvent éliminer dès le début des combats d'équipe en raison de son positionnement trop agressif. Dès qu'il a commencé à prendre moins de risques, les résultats de kRYST4L se sont nettement améliorés. Si vous y ajoutez la menace plus importante que fait porter U sur la voie du milieu et la protection apportée par Ella, kRYST4L parvient à survivre suffisamment longtemps lors des combats pour infliger de lourds dégâts. L'éradiqué est devenu l'éradiqueur.\n</p>","pl_PL":"<p>\nYang „kRYST4L” Fan to jeden z niewielu prowadzących wśród zawodowców, który zaczął wykazywać się mniejszą agresywnością. kRYST4L zawsze stanowił zagrożenie dla superprowadzących, jak Vayne czy Kog'Maw, ale często ginął niemal natychmiast w walkach drużynowych z powodu swojej agresji. Jednak odkąd zaczął grać ostrożniej, sytuacja się poprawiła. W połączeniu z niebezpiecznym U na środkowej alei i osłonie zapewnianej przez Ellę, kRYST4L zaczął przeżywać na tyle długo, by zadać spore obrażenia. Niszczony sam zaczął niszczyć innych.\n</p>"},"foreignIds":{"drupalId":"3784"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":841,"slug":"zzr","name":"Zzr","firstName":"Zhanran","lastName":"Zeng","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/zzr-3ve8jqlw.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-08-27T23:45:40.000Z","updatedAt":"2017-06-07T00:15:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4915"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":914,"slug":"sofm","name":"SofM","firstName":"Quang-Duy","lastName":"Le","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/sofm-bdrqlm6x.png","hometown":null,"region":"SEA","birthdate":"1998-02-05","createdAt":"2015-11-26T18:19:22.000Z","updatedAt":"2017-06-07T00:14:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{"twitch":"http://www.twitch.tv/pro7lov3"},"champions":[{"id":207,"playerId":914,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-11-26T18:21:21.000Z","updatedAt":"2017-06-07T00:14:38.000Z"},{"id":208,"playerId":914,"championId":157,"championKey":"Yasuo","championName":"Yasuo","createdAt":"2015-11-26T18:21:21.000Z","updatedAt":"2017-06-07T00:14:38.000Z"}],"liveGameTeam":81},{"id":985,"slug":"march","name":"March","firstName":"Ye","lastName":"Jiabin","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/march-atlwh205.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:22:02.000Z","updatedAt":"2016-02-01T20:09:10.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":987,"slug":"xq","name":"xQ","firstName":"Li","lastName":"Yingjie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/xq-htv67cea.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:21:10.000Z","updatedAt":"2016-02-01T20:09:55.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":988,"slug":"x1u","name":"x1u","firstName":"Yu","lastName":"Jie","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/x1u-bcmrkxsg.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:23:44.000Z","updatedAt":"2016-02-01T20:09:33.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":994,"slug":"mo","name":"Mo","firstName":"Bo","lastName":"Cai","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/mo-fprommgm.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:30:40.000Z","updatedAt":"2017-06-07T00:16:01.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":1287,"slug":"chimin","name":"Chimin","firstName":"Gyeong-min","lastName":"Kim","roleSlug":"jungle","photoUrl":null,"hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-05-18T23:49:39.000Z","updatedAt":"2016-05-18T23:50:04.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":1288,"slug":"cpt","name":"Cpt","firstName":"Sun","lastName":"Yuze","roleSlug":"jungle","photoUrl":null,"hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-05-18T23:50:11.000Z","updatedAt":"2016-05-18T23:50:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":1289,"slug":"snoopy","name":"Snoopy","firstName":"Yang","lastName":"Yo Myong","roleSlug":"midlane","photoUrl":null,"hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-05-18T23:51:16.000Z","updatedAt":"2016-05-18T23:50:55.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":1290,"slug":"otto","name":"Otto","firstName":"Hou","lastName":"Guoyu","roleSlug":"midlane","photoUrl":null,"hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-05-18T23:51:33.000Z","updatedAt":"2016-05-18T23:51:49.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":1474,"slug":"maidong","name":"Maidong","firstName":"Huang-Chao","lastName":"Tang","roleSlug":"support","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-10-25T19:09:44.000Z","updatedAt":"2016-10-25T19:09:44.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":171},{"id":1661,"slug":"mint","name":"Mint","firstName":"Kun","lastName":"Wan","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:27:05.000Z","updatedAt":"2017-01-09T23:27:05.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":81}],"scheduleItems":[{"id":"AVIaBImKOPWArxM1l4aa","content":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:match:13c1b84e-759f-4751-880f-8c4f5eda815d","scheduledTime":"2016-02-25T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","blockLabel":"5","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:bracket:77bd0264-3856-4643-a3f6-ecd2fe66de30"},"match":"13c1b84e-759f-4751-880f-8c4f5eda815d","tournament":"0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","bracket":"77bd0264-3856-4643-a3f6-ecd2fe66de30","league":"7"}],"gameIdMappings":[],"videos":[{"id":1060,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:f1d6c2cb-1e89-4c38-b782-4ce6007fcf3b","source":"https://www.youtube.com/embed/99_ny6rYffY?wmode=transparent&start=17171","createdAt":"2016-02-25T21:22:42.000Z","updatedAt":"2016-02-25T21:22:42.000Z","game":"f1d6c2cb-1e89-4c38-b782-4ce6007fcf3b"},{"id":1061,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:game:bf87bc6c-c6f3-472d-8390-882552481cec","source":"https://www.youtube.com/embed/99_ny6rYffY?wmode=transparent&start=13569","createdAt":"2016-02-25T21:21:02.000Z","updatedAt":"2016-02-25T21:21:02.000Z","game":"bf87bc6c-c6f3-472d-8390-882552481cec"}],"htmlBlocks":[],"match":{"id":"13c1b84e-759f-4751-880f-8c4f5eda815d","name":"HYG-vs-SS","position":49,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"},{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],"games":{"f1d6c2cb-1e89-4c38-b782-4ce6007fcf3b":{"id":"f1d6c2cb-1e89-4c38-b782-4ce6007fcf3b","name":"G2","generatedName":"HYG|SS|G2|13c1b84e759f4751880f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"},{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"}],"standings":{"result":[[{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"}]],"timestamp":1456409875258,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"bf87bc6c-c6f3-472d-8390-882552481cec":{"id":"bf87bc6c-c6f3-472d-8390-882552481cec","name":"G1","generatedName":"HYG|SS|G1|13c1b84e759f4751880f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"},{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],"standings":{"result":[[{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"}]],"timestamp":1456406496380,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6e998f4f-72e7-42ce-8e71-16407eafc171":{"id":"6e998f4f-72e7-42ce-8e71-16407eafc171","name":"G3","generatedName":"HYG|SS|G3|13c1b84e759f4751880f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"},{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"f15158a7-8c68-433a-be6a-a383c684c235"}],[{"roster":"b2c89e0f-031b-42f1-983e-9e7c12a84821"}]],"timestamp":1456409875258,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}