{"teams":[{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]},{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]}],"players":[{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AVz22jDzoUG4HPFjOKXB","content":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:match:1780b2c4-ca37-4b9f-b880-93a0e1ad1655","scheduledTime":"2017-07-05T18:00:00.249+0000","tags":{"blockLabel":"1","blockPrefix":"day","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:bracket:e363f3d1-4d30-4197-9214-3f097c3f0ddc","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96"},"match":"1780b2c4-ca37-4b9f-b880-93a0e1ad1655","tournament":"71014a98-2551-42ae-b958-e8caafa63f96","bracket":"e363f3d1-4d30-4197-9214-3f097c3f0ddc","league":"43"}],"gameIdMappings":[{"id":"9c6ac295-853c-49e7-b9f5-84d7cb9d949b","gameHash":"72a0ea59adffa77e"}],"videos":[{"id":7729,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:game:9c6ac295-853c-49e7-b9f5-84d7cb9d949b","source":"https://www.youtube.com/embed/Wx1dCwihEZQ?wmode=transparent&rel=0","createdAt":"2017-07-06T00:28:06.000Z","updatedAt":"2017-07-06T00:28:06.000Z","game":"9c6ac295-853c-49e7-b9f5-84d7cb9d949b"}],"htmlBlocks":[],"match":{"id":"1780b2c4-ca37-4b9f-b880-93a0e1ad1655","name":"UOL-vs-P1","position":15,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"},{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"}],"games":{"9c6ac295-853c-49e7-b9f5-84d7cb9d949b":{"id":"9c6ac295-853c-49e7-b9f5-84d7cb9d949b","name":"G1","generatedName":"P1|UOL|G1|1780b2c4ca374b9fb880","input":[{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"},{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}],"standings":{"result":[[{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499300746791,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499282607941,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002150077","gameRealm":"TRLH3","platformId":"TRLH3:1002150077","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499300746791,"source":"bestOf","history":[{"result":[[{"roster":"e25c9c1e-072b-47d4-922e-8d7e7ee72122"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499282607941,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}