{"teams":[{"id":73,"slug":"team-dragon-knights","name":"Team Dragon Knights","guid":"be6ded88-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/team-dragon-knights-chrt2mqx.png","acronym":"TDK","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":"http://assets.lolesports.com/team/team-dragon-knights-hh39eds4.png","createdAt":"2015-05-26T21:11:28.000Z","updatedAt":"2016-04-08T20:07:05.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3856"},"players":[121,258,347,364,396,503,664,666,736,1106],"starters":[121,258,347,364,664],"subs":[396,503,666,736,1106]},{"id":185,"slug":"ember","name":"Ember","guid":"be71038e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/ember-4uu51lk6.png","acronym":"MBR","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-01-20T21:19:05.000Z","updatedAt":"2016-03-09T02:08:25.000Z","bios":{},"foreignIds":{},"players":[63,185,250,255,333,529,1105,1120],"starters":[185,250,333,529,1105],"subs":[63,255,1120]}],"players":[{"id":63,"slug":"gleeb","name":"Gleeb","firstName":"Nicolas","lastName":"Haddad","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/gleeb-aa87xfc9.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2016-03-08T00:26:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1577","TRLH1":"1001270010","TRLH2":"1001200010","FRA1TMNT1":"375195"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":185},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":258,"slug":"kez","name":"kez","firstName":"Kevin","lastName":"Jeon","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/kez-5t7efxvg.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-09-09T16:42:15.000Z","updatedAt":"2016-08-04T18:01:20.000Z","bios":{"en_US":"Kevin “Kez” Jeon has been involved in the NA Challenger Series since 2013 when he joined The Walking Zed. After playing for both Cloud9 Tempest and compLexity, Kez made his way to Team Dragon Knights in 2015."},"foreignIds":{"drupalId":"1150","TRLH1":"1001270011","TRLH2":"1001200011","FRA1TMNT1":"375197"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":364,"slug":"flaresz","name":"Flaresz","firstName":"Cuong","lastName":"Ta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flaresz-bvsf1d92.png","hometown":"USA","region":"OPL","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-03-10T04:55:27.000Z","bios":{"en_US":"Flaresz has had a strange trajectory to the OPL, having substantial experience in North America's Challenger scene as well as the LCS. He was a successful solo queue player and a shining spot on Enemy Esports. His strong laning will undoubtedly draw a lot of attention this year."},"foreignIds":{"drupalId":"2544","TRLH1":"1001260001","FRA1TMNT1":"395028","TRLH2":"1001210001","ESPORTSTMNT03":"200000509"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":396,"slug":"thy","name":"Thy","firstName":"Son","lastName":"Seung Yong","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/thy-bflochot.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-03-27T20:34:57.000Z","updatedAt":"2016-02-20T00:07:27.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2798","TRLH1":"1001080004","TRLH2":"1001070004","FRA1TMNT1":"395032"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":503,"slug":"bischu","name":"Bischu","firstName":"Aaron","lastName":"Kim","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bischu-h3nie8n3.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2015-05-26T21:14:12.000Z","updatedAt":"2016-04-07T20:14:19.000Z","bios":{"en_US":"Hyung Seok “Bischu” Kim is currently playing support for Team Dragon Knights."},"foreignIds":{"drupalId":"1151","TRLH1":"1001270015","TRLH2":"1001200015","FRA1TMNT1":"375201"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":664,"slug":"trance","name":"Trance","firstName":"Lawrence","lastName":"Amador","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/trance-64pcofeg.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2016-06-09T22:55:46.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2520","FRA1TMNT1":"375421","TRLH2":"1001200033","TRLH1":"1001270033"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":666,"slug":"rf","name":"RF Legendary","firstName":"Oleksii","lastName":"Kuziuta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rf-6o25dshw.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-03-08T20:07:05.000Z","bios":{"en_US":"","fr_FR":"<p>Oleksii « RF » Kuziuta (précédemment connu sous le nom de RF Legendary) a voleté sur la scène\n\nChallenger nord-américaine pendant plusieurs années avant d'entrer aux LCS NA en 2016 avec \n\nRenegades. La quantité de dégâts qu'il est capable d'infliger, notamment avec Rumble, fait de RF une \n\ncible prioritaire. Mais il refuse de tomber sans avoir combattu jusqu'au bout.</p>","pl_PL":"<p>Ten młody Ukrainiec, przed dołączeniem do LA Renegades w marcu 2015, był członkiem tylko w drugorzędnych zespołach.  Wiosenny sezon NA LCS 2016 będzie jego debiutem, aczkolwiek jest bardzo doświadczonym graczem, ponieważ oddaje się League of Legends od czasu wydania bety. W swoich pierwszych latach lubił grać Kog’mawem, lecz nie przyniosło mu to sławy. Zyskał uznanie w Kręgu Pretendenta za doskonałe opanowanie Nidalee. Sam wielokrotnie wyznawał swoją miłość do tej postaci, podkreślając, że kocha po równo wszystkie jej skiny. Spytany o powód wyboru właśnie Zwierzęcej Łowczyni odpowiada prosto: „Fajna do gry, fajna do oglądania, trudna do opanowania, ma wysoką szansę na ciekawe zagrania, a poza tym kto by nie chciał grać piękną dziewczyną z takim tańcem, która potrafi zamienić się w kota?” Aczkolwiek na top-lanie, w oczach przeciętnego gracza, nieziemsko radzi sobie każdym bohaterem. Do grona jego ulubionych postaci należy jeszcze Irelia i Renekton.</p>\n<p>\n\"RF Legendary\" jest znany z doskonałego kontaktu ze swoimi fanami. Nigdy ich nie zawodzi i zawsze odpowiada na ich pytania na portalach społecznościowych. Olbrzymie powodzenie wśród całego społeczeństwa League of Legends przyniósł mu film wrzucony do sieci, na którego stworzenie namówili go właśnie wielbiciele. W nim zaleca się do napotkanych w szkole dziewcząt i zachęca do wspólnego powrotu do domu. Przy tym, wymieniając swoje liczne zalety, wspomina, że osiągnął diament / krąg pretendenta w solo que. Śmiałość tego występu absolutnie pobiła rekordy oglądalności, ponieważ jego nagranie obejrzała zawrotna ilość widzów - ponad 500 tysięcy.</p>\n<p>\nW rozmowach z fanami wyjawił jak się czuje w związku z dostaniem się do NA LCS. \"RF Legendary\" grając w Challenger Series czuł się spełniony i szczęśliwy. Po kwalifikacji na szczebel wyżej jest zadowolony, że będzie miał okazję się wykazać na top-lanie i że inni gracze przestali uważać, że jest one-trick pony. Sam o sobie mówi, że jest marzycielem i miłośnikiem kawy. Dzięki temu, że Oleksii urodził się w Mariupolu, na Ukrainie, a dopiero potem przeniósł się do Stanów Zjednoczonych, potrafi mówić płynnie w trzech językach – ukraińskim, rosyjskim i angielskim. </p>\n"},"foreignIds":{"drupalId":"2567","ESPORTSTMNT02":"200000740","TRLH1":"200000286"},"socialNetworks":{"twitch":"http://www.twitch.tv/RfLegendary","youtube":"https://www.youtube.com/user/RFLegendary","facebook":"https://www.facebook.com/RFLegendarylol","twitter":"https://twitter.com/RF_Legendary"},"champions":[],"liveGameTeam":73},{"id":736,"slug":"do-it","name":"do it","firstName":"Chan-ho","lastName":"Lee","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/do-it-b5reu0m.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-01-28T19:17:55.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4343","FRA1TMNT1":"375199"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":1106,"slug":"moolchael","name":"moolchael","firstName":"Young","lastName":"Kim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/moolchael-4sbbf94a.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2016-01-22T03:08:08.000Z","updatedAt":"2016-03-08T00:21:39.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375423","TRLH1":"1001270024","TRLH2":"1001200024"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":185}],"scheduleItems":[{"id":"AVMaAGTbOPWArxM1l4c4","content":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:match:1a648f8b-e2da-4e87-9b0d-57ee03464e70","scheduledTime":"2016-03-09T02:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3","blockLabel":"Semifinals","subBlockLabel":"1","blockPrefix":"round","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:bracket:ca28f727-9af9-4e93-9fcf-76f8f6856f83"},"match":"1a648f8b-e2da-4e87-9b0d-57ee03464e70","tournament":"d35712b5-b3b9-4579-b88f-2b3999d9dda3","bracket":"ca28f727-9af9-4e93-9fcf-76f8f6856f83","league":"4"}],"gameIdMappings":[{"id":"f94ff649-2608-483c-891d-61c0a2aa59fa","gameHash":"3ec0213f37b03fdb"},{"id":"aa65864e-a2fe-4ce6-a574-02bb5397843e","gameHash":"eaceb4d9d8a51b70"},{"id":"6a22c80f-8c62-465b-833b-730d8bdccb22","gameHash":"dff813f1df85c532"},{"id":"3603092e-adf7-4955-b94a-d8da7bb0db85","gameHash":"1c961d04e28af722"}],"videos":[{"id":2058,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:6a22c80f-8c62-465b-833b-730d8bdccb22","source":"https://www.youtube.com/embed/gqIxGQZJZEY?wmode=transparent","createdAt":"2016-03-09T04:17:01.000Z","updatedAt":"2016-03-09T04:17:01.000Z","game":"6a22c80f-8c62-465b-833b-730d8bdccb22"},{"id":2059,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:f94ff649-2608-483c-891d-61c0a2aa59fa","source":"https://www.youtube.com/embed/pcYNTUqYjn4?wmode=transparent","createdAt":"2016-03-09T05:18:35.000Z","updatedAt":"2016-03-09T05:18:35.000Z","game":"f94ff649-2608-483c-891d-61c0a2aa59fa"},{"id":2060,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:3603092e-adf7-4955-b94a-d8da7bb0db85","source":"https://www.youtube.com/embed/WXEQiJsJr2M?wmode=transparent","createdAt":"2016-03-09T06:00:17.000Z","updatedAt":"2016-03-09T06:00:17.000Z","game":"3603092e-adf7-4955-b94a-d8da7bb0db85"},{"id":2061,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:aa65864e-a2fe-4ce6-a574-02bb5397843e","source":"https://www.youtube.com/embed/6HBUB5VNFA0?wmode=transparent","createdAt":"2016-03-09T09:15:25.000Z","updatedAt":"2016-03-09T09:15:25.000Z","game":"aa65864e-a2fe-4ce6-a574-02bb5397843e"}],"htmlBlocks":[],"match":{"id":"1a648f8b-e2da-4e87-9b0d-57ee03464e70","name":"R1M2","position":1,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1},{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2}],"games":{"f94ff649-2608-483c-891d-61c0a2aa59fa":{"id":"f94ff649-2608-483c-891d-61c0a2aa59fa","name":"G2","generatedName":"MBR|TDK|G2|1a648f8be2da4e879b0","input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1}],"standings":{"result":[[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}]],"timestamp":1457496435437,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001600013","gameRealm":"TRLH1","platformId":"TRLH1:1001600013","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f7125ffd-530b-4632-a34b-3541f5833b0d":{"id":"f7125ffd-530b-4632-a34b-3541f5833b0d","name":"G5","generatedName":"MBR|TDK|G5|1a648f8be2da4e879b0","input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"aa65864e-a2fe-4ce6-a574-02bb5397843e":{"id":"aa65864e-a2fe-4ce6-a574-02bb5397843e","name":"G4","generatedName":"MBR|TDK|G4|1a648f8be2da4e879b0","input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1}],"standings":{"result":[[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}]],"timestamp":1457502919177,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001600016","gameRealm":"TRLH1","platformId":"TRLH1:1001600016","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6a22c80f-8c62-465b-833b-730d8bdccb22":{"id":"6a22c80f-8c62-465b-833b-730d8bdccb22","name":"G1","generatedName":"MBR|TDK|G1|1a648f8be2da4e879b0","input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1}],"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}]],"timestamp":1457492500890,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001600011","gameRealm":"TRLH1","platformId":"TRLH1:1001600011","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"3603092e-adf7-4955-b94a-d8da7bb0db85":{"id":"3603092e-adf7-4955-b94a-d8da7bb0db85","name":"G3","generatedName":"MBR|TDK|G3|1a648f8be2da4e879b0","input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":2},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99","breakpoint":"2db26c01-bd4f-4d1f-abc0-f92aa7727fde","standing":1}],"standings":{"result":[[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}]],"timestamp":1457499571994,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001600015","gameRealm":"TRLH1","platformId":"TRLH1:1001600015","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}]],"timestamp":1457502919177,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}