{"teams":[{"id":77,"slug":"qiao-gu","name":"NewBee","guid":"be6df6f7-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/qiao-gu-4kmc55n8.png","acronym":"NB","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:03:29.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4380"},"players":[131,139,573,577,582,707,1283,1648,1651,1986],"starters":[131,573,577,582,1283],"subs":[139,707,1648,1651,1986]},{"id":81,"slug":"snake","name":"Snake Esports","guid":"be6e080d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/snake-iqttt327.png","acronym":"SS","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:18:15.000Z","bios":{"en_US":"","fr_FR":"Snake a obtenu la 2e place lors de ses débuts dans la LPL lors de la compétition de printemps 2015. Ces débuts foudroyants se sont axés sur l'aptitude à miser toutes les ressources sur le carry AD et le top laner et à attendre les combats d'équipe de fin de partie pour faire basculer la partie en leur faveur. Ce n'est peut-être pas révolutionnaire, mais cela suffit pour permettre à Snake d'affronter les meilleures équipes de la LPL.","pl_PL":"Snake wyłoniło się z LSPL i zajęło 2. miejsce podczas swojego debiutu w LPL w wiosennym sezonie LPL 2015. Drużyna zademonstrowała chęć skupienia całej uwagi na swoim prowadzącym i górnym, a następnie wyczekania walk w późnej fazie gry, aby przechylić szalę zwycięstwa na swoją korzyść. Może nie jest to nic nowego, ale wystarczyło, aby utrzymać Snake w walce z najlepszymi drużynami w LPL."},"foreignIds":{"drupalId":"3748"},"players":[121,520,526,533,841,914,994,1661],"starters":[520,526,914,994,1661],"subs":[121,533,841]}],"players":[{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":131,"slug":"corn","name":"Corn","firstName":"Wen","lastName":"Lei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/corn-a770ewam.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:58.000Z","updatedAt":"2017-06-06T23:59:26.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"3171","TRLH1":"1000185034","TRLH3":"1000205037"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":139,"slug":"vasilii","name":"Vasilii","firstName":"Wei-jun","lastName":"Li","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/vasilii-33axmst.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-07T00:04:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1304","TRLH1":"1000045032","TRLH2":"2000045027"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":520,"slug":"zz1tai","name":"Zz1tai","firstName":"Zhihao","lastName":"Liu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/zz1tai-hadyl6ic.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:13:45.000Z","bios":{"en_US":"","fr_FR":"<p>Liu « Zz1tai » Zhihao est partout dans la Faille de l'invocateur. Littéralement. Officiellement, il est top laner, mais avant, il était mid laner, et il a déjà officié en tant que carry AD. Quel que soit son rôle, on peut compter sur Zz1tai pour jouer agressivement.</p>\n\n<p>L'agressivité dont Zz1tai fait preuve en cours de partie disparaît dès qu'il n'est plus dans le jeu. Il ne fait alors preuve que d'une assurance discrète. Parce que pour lui, maintenir un bon équilibre entre séances d'entraînement intense et hobbies/intérêts personnels est indispensable.</p>","pl_PL":"<p>Liu „Zz1tai” Zhihao pojawia się na całym Summoner's Rift. Dosłownie. Oficjalnie gra na górnej alei, ale był kiedyś środkowym i czasem grywa prowadzącymi. Niezależnie od tego, na jakiej pozycji gra, można liczyć na to, że będzie agresywny.</p>\n\n<p>Jego agresja kończy się jednak z momentem zakończenia gry. Zamiast niej pojawia się spokojna pewność siebie. Zz1tai przykłada wiele uwagi do zachowania równowagi między intensywnymi treningami a prywatnymi hobby i zainteresowaniami.</p>","de_DE":"<p>Liu “Zz1tai” Zhihao kann alles in der Kluft. Wortwörtlich. Er spielt offiziell Top-Lane, war früher jedoch auf der Mid-Lane und versuchte sich auch schon als ADC. Egal auf welcher Position Zz1tai spielt, du kannst darauf vertrauen, dass er aggressiv spielt. </p>\n\n<p>Zz1tai´s aggressiver Spielstil fällt nach dem Spiel jedoch ab. An seine Stelle tritt stilles Selbstvertrauen. Er ist mit Leib und Seele dabei, wenn es um einen Ausgleich zwischen hartem Training und seinen Hobbies und Interessen geht. </p>\n","es_ES":"<p>Liu “Zz1tai” Zhihao está por todas las partes de la Grieta. Literalmente. Su puesto oficial se encuentra en la calle superior, anteriormente era mid, y también es ha coqueteado con el puesto de tirador. Da igual la posición en la que esté, porque sabes que Zz1tai va a ser agresivo. </p>\n\n<p>Aunque el juego agresivo de Zz1tai se desvanece cuando abandona la Grieta, fuera de ella es un chico tranquilo. Está decidido a mantener un balance entre su vida profesional, con las largas sesiones de juego y entrenamiento, y su vida personal, con sus aficiones e intereses. </p>\n","pt_BR":"<p>Aí está um cara que roda o mapa todo. Zz1tai é, oficialmente, jogador da rota superior, mas já chegou a jogar na rota do meio e é capaz de fazer o papel de atirador se você precisar. Não importa qual seja a posição, você pode apostar que ele vai jogar agressivamente.</p>\n<p>Fora do jogo, porém, essa agressividade dá lugar à tranquilidade. Zz1tai se dedica a manter um bom equilíbrio entre a rotina intensa de treinos profissionais e seus hobbies pessoais.</p>\n"},"foreignIds":{"drupalId":"2065","TRLH3":"1001160030","TRLH4":"1001160030"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":526,"slug":"flandre","name":"Flandre","firstName":"Xuan-jun","lastName":"Ji","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/flandre-5toeniwo.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:12:36.000Z","bios":{"en_US":"","fr_FR":"<p>\nLi « Flandre » Xuanjan est célèbre pour sa capacité à jouer un très large échantillon de champions sur la voie du haut. Avec pas moins de 11 champions différents utilisés lors du Segment d'été des LPL 2015, il a assurément plus d'un tour dans son sac (même s'il joue beaucoup Hecarim). Les chenapans de la voie du haut de Flandre et ses ordres opportuns ont permis à Snake de participer aux play-offs du printemps des LPL 2015.\n</p>\n<p>\nMalheureusement (pour lui), les performances de Flandre sur la voie du haut ont attiré l'attention de ses adversaires. Il est donc maintenant souvent la cible des bannissements et des ganks. Mais même quand il a pris du retard, il reste une menace à ne pas oublier : Flandre adore se jeter au coeur des combats d'équipe en se téléportant au bon moment.\n</p>","pl_PL":"<p>\nLi „Flandre” Xuanjan znany jest z używania szerokiego wachlarza bohaterów na górnej alei. Wybierał 11 różnych postaci w letnim sezonie LPL 2015, więc jest prawdziwym człowiekiem renesansu. Wyczyny Flandre na górnej alei oraz podejmowanie dobrych decyzji sprawiły, że Snake trafili do playoffów LPL w wiosennym splicie LPL 2015.\n</p>\n<p>\nNiestety (dla niego) dobra gra Flandre została zauważona przez przeciwników. Teraz często staje się obiektem ganków i banów. Ale nawet kiedy ma problemy, wciąż stanowi zagrożenie – uwielbia wpadać w środek walk drużynowych teleportacją.\n</p>"},"foreignIds":{"drupalId":"3782"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":533,"slug":"kryst4l","name":"Kryst4l","firstName":"Pan","lastName":"Yang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kryst4l-fxs01yrw.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-07T00:15:40.000Z","bios":{"en_US":"","fr_FR":"<p>\nYang « kRYST4L » Fan est l'un des rares carrys AD de la scène pro qui a appris à être moins agressif que par le passé pour obtenir des résultats. kRYST4L a toujours été une menace majeure avec des champions hypercarry comme Vayne et Kog'maw, mais il se faisait souvent éliminer dès le début des combats d'équipe en raison de son positionnement trop agressif. Dès qu'il a commencé à prendre moins de risques, les résultats de kRYST4L se sont nettement améliorés. Si vous y ajoutez la menace plus importante que fait porter U sur la voie du milieu et la protection apportée par Ella, kRYST4L parvient à survivre suffisamment longtemps lors des combats pour infliger de lourds dégâts. L'éradiqué est devenu l'éradiqueur.\n</p>","pl_PL":"<p>\nYang „kRYST4L” Fan to jeden z niewielu prowadzących wśród zawodowców, który zaczął wykazywać się mniejszą agresywnością. kRYST4L zawsze stanowił zagrożenie dla superprowadzących, jak Vayne czy Kog'Maw, ale często ginął niemal natychmiast w walkach drużynowych z powodu swojej agresji. Jednak odkąd zaczął grać ostrożniej, sytuacja się poprawiła. W połączeniu z niebezpiecznym U na środkowej alei i osłonie zapewnianej przez Ellę, kRYST4L zaczął przeżywać na tyle długo, by zadać spore obrażenia. Niszczony sam zaczął niszczyć innych.\n</p>"},"foreignIds":{"drupalId":"3784"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":573,"slug":"swift","name":"Swift","firstName":"Da-hun","lastName":"Baek","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/swift-8ph5i88w.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:02:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nDa-hoon « Swift » Baek est l'un des jeunes talents les plus dynamiques de la LPL. Depuis qu'il a rejoint QiaoGu, Swift a démontré qu'il était effectivement plus vif que ses adversaires. Swift est un véritable maître quand il s'agit de deviner les coups de l'adversaire, et parfois on a même l'impression qu'il a deux coups d'avance sur eux.\n</p>\n<p>\nPour ses débuts lors du Segment d'été des LPL 2015, Swift a démontré qu'il pouvait non seulement profiter pleinement d'un avantage pour ses coéquipiers, mais aussi qu'il pouvait farmer et déjouer la plupart des autres junglers. Son parcours dans la jungle est toujours un peu plus efficace et il arrive toujours le premier sur les ganks. Son farming est également toujours quelques PO en avance, ce qui lui permet d'acheter les gros objets en premier. Son armure est aussi un peu plus brillante et lui permet d'absorber un peu plus des rayons gamma du soleil, et donc de balancer son super uppercut de l'aigle majestueux qui projette ses ennemis dans la stratosphère. \n</p>","pl_PL":"<p>\nDa-hoon „Swift” Baek jest jednym z najprężniej rozwijających się młodych talentów w LPL. Dołączywszy do Qiao Gu, Swift udowodnił, że – jak wskazuje jego ksywka – jest zdecydowanie szybszy od konkurentów (niezbyt wysoko ustawiona poprzeczka). Swift jest absolutnym mistrzem, jeśli chodzi o przewidywanie posunięć swoich przeciwników. Chwilami można by odnieść wrażenie, że wyprzedza ich o dwa kroki.\n</p>\n<p>\nDebiutując w letnim splicie 2015 LPL, Swift udowodnił, że nie tylko potrafi wykorzystać przewagę swojej drużyny, ale też zdobyć więcej złota i pokonać większość dżunglerów. W dżungli radzi sobie lepiej niż pozostali, w związku z tym zazwyczaj jako pierwszy zastawia zasadzki. Zawsze ma na koncie o kilka zabitych stworów więcej, dzięki czemu ma okazję kupować potężne przedmioty jako pierwszy. Jego pancerz jest nieco jaśniejszy od innych, dzięki czemu pochłania więcej promieniowania gamma, co sprawia, iż staje się supersilny i jest w stanie wybijać przeciwników na orbitę za pomocą potężnego ciosu wzlatującego orła. \n</p>"},"foreignIds":{"drupalId":"1014"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":577,"slug":"tct","name":"Mor","firstName":"Hong-Wei","lastName":"Zhang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/tct-9wpmbdee.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:51:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nLes fans des LCS NA reconnaîtront peut-être en Zhang « TcT » Hong Wei l'ancien support des LMQ, dont le pseudo était Mor. Lors de sa première année en ligue nord-américaine, il est passé avec le reste des LMQ des séries Challenger NA aux LCS NA, pour aller jusqu'au Championnat du monde de la Saison 4. À l'époque, on avait remarqué TcT pour son style de jeu désintéressé, toujours prêt à se sacrifier pour permettre à un de ses coéquipiers de survivre.\n</p>\n<p>\nMais quand LMQ a échoué à franchir les phases de groupe pour le Championnat du monde, TcT a décidé de retourner en Chine et de recommencer à jouer avec son ancien partenaire de duo, TcT, chez QiaoGu. Leur combo sur la voie du bas s'est épanouie, notamment grâce à leurs intenses sessions d'entraînement. Il n'est pas rare qu'ils se lèvent à 5 heures du matin pour jouer ensemble en file duo. Avec l'aide de TnT, TcT a perdu cette mentalité de chair à canon qu'il avait développée dans les ligues NA. Il choisit maintenant des champions qui offrent de vraies options de désengagement, comme Janna, qui lui permettent de protéger ses coéquipiers sans devoir mourir en boucle. Oh, et de parvenir au passage à un joli KDA.\n</p>","pl_PL":"<p>\nFani PA LCS znają zapewne Zhanga „TcT” Hong Weia, byłego zawodnika wsparcia LMQ, wówczas posługującego się ksywką Mor. W trakcie pierwszego roku rozgrywek północnoamerykańskich razem z resztą LMQ zdołał awansować z serii pretendentów do PA LCS, a potem do Mistrzostw Świata Sezonu Czwartego. TcT znany był wówczas z ofiarnego stylu gry – zawsze gotów był poświęcić swoje życie, by ratować kolegów z drużyny.\n</p>\n<p>\nGdy LMQ nie zdołało przejść przez grupowy etap mistrzostw świata, TcT postanowił wrócić do Chin i ponownie dołączyć do swojego dawnego partnera z drużyny Qiao Gu. Wspólnymi siłami zaczęli dominować w dolnej alei, co było zasługą przede wszystkim regularnych treningów. Zdarzało im się wstawać o piątej rano, by rozegrać mecz w duecie. Z pomocą TnT, TcT oduczył się odgrywania roli kozła ofiarnego, której nauczył się Ameryce Północnej. Obecnie wybiera bohaterów skutecznie wycofujących się z walki, takich jak Janna, co pozwala mu chronić kolegów z drużyny, unikając jednocześnie śmierci. Aha, jego stosunek zabić do zgonów znacznie na tym zyskał.\n</p>"},"foreignIds":{"drupalId":"4524"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":582,"slug":"v","name":"V","firstName":"Bo","lastName":"Bao","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/v-d6ylt7bf.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:01:54.000Z","bios":{"en_US":"","fr_FR":"<p>\nBao « V » Bo est un top discret mais particulièrement doué. Le top de QiaoGu a commencé le Segment d'été des LPL 2015 avec des champions de type carry, comme Irelia, mais il a depuis fait machine arrière. Il joue maintenant ce dont son équipe a besoin. Si les tanks sont dans la meta, il va jouer tank. Si les mages sont dans la meta, il va jouer mage. Ses choix ont fini par se rapprocher de sa tendance discrète à rentrer dans le rang.\n</p>\n<p>\nPour ce qui est de la cohésion de son équipe, QiaoGu a fait le choix, heu... classieux de leur faire tous se teindre les cheveux en même temps. V a suivi sa nature profonde et a choisi de se teindre les cheveux dans une teinte châtain, alors que ses coéquipiers ont choisi des violets vifs et des verts flashy. Il est sans doute le moins bruyant de son équipe, mais ça ne l'empêche pas de dominer sur sa voie. Même si lui, il n'a pas l'élément « GOD » dans son pseudo.\n</p>","pl_PL":"<p>\nBao „V” Bo jest cichym, ale utalentowanym zawodnikiem górnej alei. Zaczynał podczas letniego splitu 2015 LPL, korzystając z bohaterów prowadzących, takich jak Irelia, od tamtej pory zarzucił jednak podejście, jakiego nabrał w czasach kolejki solowej. Teraz gra tak, jak chce jego drużyna. Jeśli potrzebni są obrońcy, będzie grać obrońcami, jeśli magowie – wybierze magów. Swoje wybory zaczął dostosowywać do oczekiwań drużyny, co z uwagi na jego charakter nie było dla niego problemem.\n</p>\n<p>\nW kwestii budowania poczucia więzi w drużynie Qiao Gu zdecydowali się postawić na, ekhm, styl i solidarnie ufarbować włosy. V postąpił zgodnie ze swoją naturą, wybierając zachowawczy odcień brązu, gdy koledzy z zespołu zdecydowali się na krzykliwą purpurę i neonową zieleń. Choć w drużynie nieczęsto zabiera głos, nie przeszkadza mu to być jednym z najbardziej dominujących zawodników w alejach. Kto by pomyślał?\n</p>"},"foreignIds":{"drupalId":"4526"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":707,"slug":"skye","name":"Skye","firstName":"Qi-Fang","lastName":"Fan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/skye-8gfzbr83.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-06T23:57:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3771"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":841,"slug":"zzr","name":"Zzr","firstName":"Zhanran","lastName":"Zeng","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/zzr-3ve8jqlw.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-08-27T23:45:40.000Z","updatedAt":"2017-06-07T00:15:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4915"},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":914,"slug":"sofm","name":"SofM","firstName":"Quang-Duy","lastName":"Le","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/sofm-bdrqlm6x.png","hometown":null,"region":"SEA","birthdate":"1998-02-05","createdAt":"2015-11-26T18:19:22.000Z","updatedAt":"2017-06-07T00:14:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{"twitch":"http://www.twitch.tv/pro7lov3"},"champions":[{"id":207,"playerId":914,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-11-26T18:21:21.000Z","updatedAt":"2017-06-07T00:14:38.000Z"},{"id":208,"playerId":914,"championId":157,"championKey":"Yasuo","championName":"Yasuo","createdAt":"2015-11-26T18:21:21.000Z","updatedAt":"2017-06-07T00:14:38.000Z"}],"liveGameTeam":81},{"id":994,"slug":"mo","name":"Mo","firstName":"Bo","lastName":"Cai","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/mo-fprommgm.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:30:40.000Z","updatedAt":"2017-06-07T00:16:01.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":1283,"slug":"happyy","name":"Happy","firstName":"Rui","lastName":"Yu","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:34:16.000Z","updatedAt":"2017-01-09T23:01:46.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1648,"slug":"lwx","name":"Lwx","firstName":"Weixiang","lastName":"Lin","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:53:31.000Z","updatedAt":"2017-01-09T22:53:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1651,"slug":"pinus","name":"Pinus","firstName":"Qingsong","lastName":"Liu","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:02:32.000Z","updatedAt":"2017-01-09T23:02:32.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1661,"slug":"mint","name":"Mint","firstName":"Kun","lastName":"Wan","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:27:05.000Z","updatedAt":"2017-01-09T23:27:05.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":81},{"id":1986,"slug":"hanxuan","name":"HanXuan","firstName":"Hao","lastName":"Hong","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:53:06.000Z","updatedAt":"2017-06-06T23:53:06.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77}],"scheduleItems":[{"id":"AVx_jihtQMQFcjhwbQ7X","content":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:match:1b910fc8-5de7-4a38-8551-44e9102ca2a7","scheduledTime":"2017-07-16T08:00:00.932+0000","tags":{"blockLabel":"5","blockPrefix":"week","subBlockLabel":"4","stageLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:bracket:fc6c3d1a-8bb5-46e8-b633-3adcfe627827","leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06"},"match":"1b910fc8-5de7-4a38-8551-44e9102ca2a7","tournament":"465a2d10-2a73-43cb-a627-f0c87b564f06","bracket":"fc6c3d1a-8bb5-46e8-b633-3adcfe627827","league":"7"}],"gameIdMappings":[],"videos":[{"id":7926,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:694b4efd-c6a7-4080-b7d0-eb9226997c89","source":"https://www.youtube.com/embed/oVhejOuJXnA?wmode=transparent&start=4047&rel=0","createdAt":"2017-07-16T18:30:37.000Z","updatedAt":"2017-07-16T18:30:37.000Z","game":"694b4efd-c6a7-4080-b7d0-eb9226997c89"},{"id":7928,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:195f74af-53ff-4483-9e0c-9a6176de5b32","source":"https://www.youtube.com/embed/oVhejOuJXnA?wmode=transparent&start=7975&rel=0","createdAt":"2017-07-16T18:22:26.000Z","updatedAt":"2017-07-16T18:22:26.000Z","game":"195f74af-53ff-4483-9e0c-9a6176de5b32"},{"id":7929,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:36c56f01-c673-4082-87c0-15a7aa301ca7","source":"https://www.youtube.com/embed/oVhejOuJXnA?wmode=transparent&start=11470&rel=0","createdAt":"2017-07-16T18:31:52.000Z","updatedAt":"2017-07-16T18:31:52.000Z","game":"36c56f01-c673-4082-87c0-15a7aa301ca7"}],"htmlBlocks":[],"match":{"id":"1b910fc8-5de7-4a38-8551-44e9102ca2a7","name":"SS-vs-NB","position":65,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"games":{"694b4efd-c6a7-4080-b7d0-eb9226997c89":{"id":"694b4efd-c6a7-4080-b7d0-eb9226997c89","name":"G1","generatedName":"NB|SS|G1|1b910fc85de74a3885514","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"}]],"timestamp":1500229643660,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"195f74af-53ff-4483-9e0c-9a6176de5b32":{"id":"195f74af-53ff-4483-9e0c-9a6176de5b32","name":"G2","generatedName":"NB|SS|G2|1b910fc85de74a3885514","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1500229712873,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"36c56f01-c673-4082-87c0-15a7aa301ca7":{"id":"36c56f01-c673-4082-87c0-15a7aa301ca7","name":"G3","generatedName":"NB|SS|G3|1b910fc85de74a3885514","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"}]],"timestamp":1500229718723,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],[{"roster":"4b13acf9-9b09-4980-91e2-c992262eeace"}]],"timestamp":1500229718723,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"813380bd-73f8-430d-87ec-3df4ea74cef8":1,"4b13acf9-9b09-4980-91e2-c992262eeace":0}}}