{"teams":[{"id":6,"slug":"ahq-e-sports-club","name":"ahq e-Sports Club","guid":"be6c7c1d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ahq-e-sports-club-iozw902p.png","acronym":"AHQ","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-05-30T21:10:24.000Z","bios":{"en_US":"<p>ahq e-Sports Club is one of the top League of Legends teams in Taiwan, and they have consistently battled for the regional title. However, with multiple GPL Championship victories, ahq is now dead set on being the best in the world. Can they rise to new heights in 2017 and earn another spot at the World Championship?</p>\n<p>Coach: Shang-Ching \"Greentea\" Tsai</p>","fr_FR":"Ahq e-Sports Club est l'une des meilleures équipes de League of Legends à Taiwan. Elle a constamment été en lutte avec les champions du monde de la Saison 2, Taipei Assassins, pour le titre régional à Taiwan. Cependant, avec de nombreuses victoires en GPL, AHQ est sur les rails pour devenir la meilleure équipe du monde. Pourront-ils atteindre les sommets de leurs compatriotes de TPA et remporter le championnat du monde ?","pl_PL":"Ahq e-Sports Club jest jedną z najlepszych tajwańskich drużyn League of Legends. Regularnie mierzyli się w walce z mistrzami świata Sezonu Drugiego, Taipei Assassins, o tytuł mistrza regionalnego Tajwanu. Jednakże po kilku zwycięstwach w mistrzostwach GPL, AHQ pragnie zostać najlepszą drużyną na świecie. Czy uda im się osiągnąć taki sam sukces, jaki osiągnęli ich tajwańscy rywale TPA, i wygrać mistrzostwa świata?","de_DE":"<p>ahq e-Sports Club ist eine der besten „League of Legends“-Mannschaften in Taiwan. Sie haben immer wieder mit den Weltmeistern von Saison 2, den Taipei Assassins, um die Titel in Taiwan gekämpft. Mit mehreren Siegen bei der GPL Championship hat ahq jetzt jedoch nur noch ein Ziel: Sie wollen die besten der Welt werden. Können sie in die Fußstapfen ihrer taiwanesischen Landsleute treten und die Weltmeisterschaft gewinnen?</p>","es_ES":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends de Taiwán. No han dejado de luchar por el título regional de Taiwán contra los campeones mundiales de la segunda temporada, los Taipei Assassins. Sin embargo, con múltiples victorias en el campeonato GPL, ahq va camino de convertirse en el mejor equipo del mundo. ¿Podrán elevarse a las alturas de sus compañeros taiwaneses TPA y ganar el Campeonato Mundial?</p>","pt_BR":"A ahq e-Sports Club é uma das melhores equipes de League of Legends de Taiwan. Eles têm competido consistentemente com a Taipei Assassins, os Campeões Mundiais da 2º Temporada, pelo título regional taiwanês. Mas agora com diversas vitórias na GPL, a ahq está determinada a ser a melhor do mundo. Será que eles conseguirão alcançar as mesmas alturas que seus companheiros taiwaneses da TPA e vencer o Campeonato Mundial?","es_AR":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends en Taiwán. Ha luchado constantemente con los Campeones Mundiales de la 2da Temporada, los Taipei Assasins, por el título Regional de Taiwán. Sin embargo, con varias victorias de Campeonato GPL, ahq ahora está concentrado completamente en ser el mejor equipo del mundo. ¿Podrán escalar hasta la cima conseguida por su compatriota equipo taiwanés TPA y ganar el Campeonato Mundial?</p>\n\n<p><strong>Entrenador: Chen \"Backstairs\" Yan-Fu</strong></p>"},"foreignIds":{"drupalId":"949"},"players":[20,34,35,302,407,408,1019],"starters":[20,35,302,407,408],"subs":[34,1019]},{"id":79,"slug":"invictus-gaming","name":"Invictus Gaming","guid":"be6dfd0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/invictus-gaming-cnnnfwdo.png","acronym":"IG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:30:22.000Z","bios":{"en_US":"","fr_FR":"Invictus Gaming piaffe devant la porte de la gloire depuis si longtemps que l'équipe paraît presque frappée d'une malédiction. Au cours des deux dernières années, ils sont arrivés quatre fois 3e aux finales régionales ou aux play-offs de printemps de la LPL. Cependant, avec l'aide de joueurs dynamiques comme KaKAO et RooKie, Invictus va peut-être enfin briser la malédiction et parvenir au sommet.","pl_PL":"Invictus Gaming przez tak długo znajdowało się na krawędzi osiągnięcia sukcesu, że można pomyśleć, że drużyna jest przeklęta. Zajęli 3. miejsce podczas wiosennych playoffów LPL / finałów regionalnych 4 razy w ciągu ostatnich dwóch lat. Jednakże dzięki dołączeniu tak utalentowanych graczy, jak KaKAO i Rookie być może Invictus wreszcie przełamie klątwę i wywalczy sobie drogę na szczyt tabeli.","de_DE":"Invictus Gaming schwebte lange Zeit an der Grenze zum Erfolg, sodass es schien, sie seien verflucht. In zwei Jahren brachten sie viermal den dritten Platz in den LPL Spring Playoffs/Regional Finals nach Hause. Aber vielleicht schafft es diesmal Invictus, mit den dynamischen Talenten wie KaKAO und RooKie, den Fluch zu durchbrechen und sich den ganz Großen anzuschließen.","es_ES":"Invictus Gaming se ha quedado tantas veces a la puertas de la gloria que casi parece que están gafados. Han quedado en tercera posición en los Playoffs de primavera de la LPL y en las finales regionales de China cuatro veces en los dos últimos años. Aunque con los fichajes de los coreanos KaKAO y RooKie, quizás Invictus va a romper la maldición definitivamente y a hacerse un hueco entre los mejores equipos del mundo.","pt_BR":"A Invictus Gaming se aproximou da consagração tantas vezes, que até parece um time amaldiçoado. Eles ficaram em terceiro lugar nas Regionais e Eliminatórias da LPL quatro vezes nos últimos dois anos. Talvez agora, com a chegada de pequenos monstros como KaKAO e RooKie, eles consigam quebrar a maldição e chegar entre os grandes do Mundial. \n"},"foreignIds":{"drupalId":"632"},"players":[122,519,522,1664,1871,1980,1981,1982],"starters":[122,519,522,1664,1871],"subs":[1980,1981,1982]}],"players":[{"id":20,"slug":"an","name":"AN","firstName":"Chun-An","lastName":"Chou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/an-1zhs9hs7.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:17.000Z","updatedAt":"2017-07-06T14:32:41.000Z","bios":{"en_US":"<p>Chun-An \"AN\" Chou is a fan favorite in the LMS. His quirky personality and aggressive AD carry play style come together in an endearing package. But those same traits sometimes surprise his own teammates. Much like his teammate Mountain, AN maintains a stoic disregard for win/loss records in scrims, and will play at his own pace -- and in his own way.\n</p>\n<p>\nBut when AN finds he isn't playing well, he does what every pro player would do to get out of a slump -- blame it on a lack of exercise. The solution? Easy! Go for a run in the middle of the night. And then wake up at 9 AM and go swimming, just to be safe. Of course, all that exercise takes a toll, so he will likely end up faltering in the next day’s practice...because of too much exercise. It’s a vicious cycle.\n</p>","fr_FR":"<p>Chun-An « AN » Chou est l'un des joueurs préférés des fans des LMS. Sa personnalité excentrique et son style de jeu agressif de carry AD constituent une association attachante. Mais ces mêmes caractéristiques peuvent parfois surprendre ses propres coéquipiers. À l'instar de Mountain, AN semble ne pas du tout s'intéresser au ratio victoires/défaites lors des matchs d'entraînement et joue à son rythme... et à sa façon.\n</p>\n<p>\nMais quand AN trouve qu'il ne joue pas bien, il fait ce que tout joueur pro fait pour sortir de l'ornière : il dit qu'il manque d'exercice. La solution ? Facile ! Partir courir au milieu de la nuit. Et au réveil, à 9 heures du matin, aller nager, juste au cas où. Bien sûr, faire autant de sport, ça peut fatiguer, et il risque de ne pas briller lors des entraînements du lendemain... à cause de trop d'exercice. Un véritable cercle vicieux.\n</p>","pl_PL":"<p>Chun-An „AN” Chou to ulubieniec fanów w LMS. Jego ciekawa osobowość i agresywna gra tworzą razem wyjątkowy pakiet. Jednak potrafi on też zaskoczyć swoich towarzyszy. Tak jak Mountain, AN nie przejmuje się zwycięstwami i porażkami w meczach treningowych i gra na swój własny sposób.\n</p>\n<p>\nKiedy jednak przestaje mu iść, robi to, co każdy zawodowiec – zwala winę na brak ćwiczeń. Rozwiązanie? To proste! Wystarczy trochę się przebiec w środku nocy. A potem pobudka o 9 rano i jeszcze trochę pływania dla pewności. Oczywiście ćwiczenia fizyczne są męczące, przez co zdarza mu się słabsza dyspozycja następnego dnia... z powodu przećwiczenia. Zaklęty krąg.\n</p>","de_DE":"<p>Chun-An „AN“ Chou ist der Fan-Liebling der LMS. Seine schrullige Persönlichkeit und sein aggressiver Spielstil mit AD-Carrys ergeben ein liebenswertes Gesamtpaket. Aber mit genau diesen Eigenschaften überrascht er manchmal seine Teamkameraden. Ähnlich wie seinem Teamkameraden Mountain sind AN die Siege und Niederlagen in Übungsspielen egal, und er spielt immer in seinem eigenen Tempo – und auf seine eigene Art.</p>\n\n<p>Aber wenn AN das Gefühlt hat, nicht gut zu spielen, tut er, was jeder Profi-Spieler tun würde – er schiebt es auf mangelnde Bewegung. Und was tut er dann? Ganz einfach! Er geht mitten in der Nacht joggen. Und dann steht er um 09:00 Uhr morgens auf und geht schwimmen, nur zur Sicherheit. Natürlich muss er dann der ganzen Bewegung Tribut zollen und kommt in den Übungsspielen nicht richtig in die Gänge … weil er zu viel Bewegung gemacht hat. Ein wahrer Teufelskreis.</p>","es_ES":"<p>Chun-An ''AN'' Chou es el favorito de los fans en la LMS. Su extravagante personalidad y su estilo de juego agresivo como AD carry conforman un preciado pack, pero esas mismas virtudes sorprenden a su equipo en más de una ocasión. Como su compañero Mountain, AN no tiene en cuenta las victorias y derrotas de las partidas de práctica, así que juega a su ritmo y por su cuenta,</p>\n\n<p>pero cuando AN considera que no está jugando bien, hace lo que haría cualquier profesional para superar un bache: achacarlo a la falta de ejercicio. ¿La solución? ¡Muy fácil! Salir a correr a medianoche. Luego se despierta a las nueve de la mañana para ir a nadar y sentirse bien. Por supuesto, todo ejercicio tiene su precio, así que puede que acabe flaqueando en el entrenamiento del día siguiente por haber hecho demasiado ejercicio. Es un círculo vicioso.</p>","pt_BR":"<p>Chun-An \"AN\" Chou é o favorito dos fãs na LMS. Sua personalidade peculiar e estilo de jogo agressivo com atiradores formam um pacote perigoso. Mas essas mesmas qualidades às vezes surpreendem até mesmo seus próprios aliados. Assim como seu companheiro Mountain, AN também mostra uma negligência estoica de vitórias e derrotas durante os treinamentos e gosta de jogar a seu próprio passo e de seu próprio jeito.</p>\n\n<p>No entanto, quando AN vê que não está jogando bem, ele faz o que todo jogador profissional faria para sair de uma crise: ele reclama que não tem se exercitado. A solução? Fácil! Ir para uma caminhada no meio da noite. E quem sabe acordar às 9 da manhã para uma nataçãozinha, só para ter certeza. É claro que todo esse exercício tem um preço, então ele provavelmente vai acabar super cansado na prática do dia seguinte... por ter se exercitado demais. É um ciclo vicioso.</p>","es_AR":"<p>Chun-An \"AN\" Chou es uno de los favoritos de los simpatizantes en LMS. Su extravagante personalidad y estilo de juego de acarreo con daño de ataque agresivo se reúnen en un paquete adorable. Pero esas mismas características a veces sorprenden a sus propios compañeros de equipo. De manera muy similar a su compañero Mountain, AN mantiene una estoica despreocupación por los registros de victorias y derrotas en las actuaciones, por lo que juega a su propio ritmo y a su propia manera.</p>\n\n<p>Pero cuando AN encuentra que no está jugando bien, hace lo que cualquier jugador profesional haría: culpa a una falta de ejercicio. ¿La solución? ¡Sencillo! Salir a correr en la mitad de la noche! Y luego levantarse a las 9 AM para ir a nada, solo para estar seguro. Desde luego que todo el ejercicio se pasa de la cuenta, por lo que probablemente falte al siguiente día de práctica... por culpa de mucho ejercicio. Es un círculo vicioso.</p>"},"foreignIds":{"drupalId":"1002","TRLH1":"1001380125","TRLH2":"1001280095","TRLH3":"1001160046","TRLH4":"1001160046","TRTW":"200000149","TRLT3":"200000260"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":34,"slug":"westdoor","name":"Westdoor","firstName":"Shu-Wei","lastName":"Liu","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/westdoor-e3yh8alc.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:30:57.000Z","bios":{"en_US":"<p>Shu-Wei \"Westdoor\" Liu is one of the most storied players in Taiwan, reaching Challenger on the Taiwan, North American, and Korean servers. Seeing Westdoor lock in Twisted Fate was considered guaranteed victory back in 2012. Even now it strikes fear into his opponents, though he has become better known for his godlike Fizz mechanics.\n</p>\n<p>\nIn contrast to his dynamic playstyle in-game, Westdoor is one of the quietest players on ahq e-Sports club in real life, often eating alone. But he is also the undisputed team captain. When his teammates are unsure of what to do, they look to him for guidance -- and he is always there to help push them further. As he explains, “If you have a dream, go chase it. Don’t give up until you grab it.” Westdoor is also the least likely to complain about practice -- in part because he lives and breathes Solo Queue. To top off the man and the legend, Westdoor spends his downtime between queues reading historical and science fiction novels, sharing favorites with his teammate Mountain. A gentleman, a scholar, a captain, and a friend. Is there anything Westdoor can’t do better than us?\n</p>","pl_PL":"<p>Shu-Wei „Westdoor” Liu to jeden z najlepszych graczy w Tajwanie – udało mu się trafić do kręgu Pretendenta w Tajwanie, Ameryce Północnej i Korei. Wybranie przez Westdoora Twisted Fate'a było gwarancją zwycięstwa w 2012 roku. Nawet dziś przeraża to przeciwników, chociaż gracz stał się znany z niesamowitej gry Fizzem.\n</p>\n<p>\nDla kontrastu z jego popisową grą Westdoor jest jednym z najcichszych graczy w klubie ahq i często jada sam. Jest jednak niezaprzeczalnie kapitanem drużyny. Kiedy towarzysze z drużyny nie wiedzą, co robić, traktują go jak przewodnika, a on zawsze staje na wysokości zadania. Sam wyjaśnia to tak: „Jeśli masz marzenie, musisz za nim gonić. Nie poddawaj się, póki się nie spełni”. Westdoor najrzadziej też narzeka na treningi, głównie dlatego, że niemal żyje w kolejce solo. Obrazu tej legendarnej postaci dopełnia fakt, że wolne chwile spędza na czytaniu książek historycznych i science fiction wraz ze swoim towarzyszem, Mountainem. Gentleman, uczony, kapitan i przyjaciel. Czy jest coś, czego Westdoor nie robi lepiej niż my?\n</p>","fr_FR":"<p>Shu-Wei « Westdoor » Liu est l'un des joueurs qui a le plus fait parler de lui à Taïwan, ayant atteint le palier Challenger sur les serveurs taïwanais, nord-américains et coréens. Quand Westdoor parvenait à jouer Twisted Fate en 2012, on pouvait considérer que la partie était jouée d'avance. Et encore aujourd'hui, cette combinaison peut effrayer ses adversaires à juste titre, bien qu'il soit depuis devenu particulièrement réputé pour sa maîtrise impressionnante de Fizz.\n</p>\n<p>\nAlors qu'il se montre incroyablement dynamique lors d'une partie, Westdoor est l'un des joueurs les plus discrets d'ahq e-Sports club dans la vie réelle, mangeant souvent seul. Ce qui ne l'empêche pas d'être le capitaine indiscuté de l'équipe. Quand ses coéquipiers ne savent trop quoi faire, ils se tournent vers lui... et il est toujours prêt à les aider à aller plus loin. Comme il le dit : « Si vous avez un rêve, pourchassez-le. N'abandonnez pas avant de l'avoir atteint. » Westdoor est également le moins enclin à se plaindre de l'entraînement, certainement parce qu'il adore jouer en file solo. Pour terminer de définir l'homme et la légende, il faut savoir que Westdoor passe tout son temps libre à lire des romans historiques ou de science-fiction, partageant ses livres préférés avec son coéquipier Mountain. Gentleman, érudit, capitaine et ami. Existe-t-il une chose que Westdoor ne sait pas faire mieux que nous ?\n</p>","de_DE":"<p>Shu-Wei „Westdoor“ Liu hat die Challenger Series in Taiwan, Nordamerika und Korea erreicht und gilt somit als einer der vielseitigsten Spieler in Taiwan. 2012 sprach man von einem sicheren Sieg, wenn Westdoor Twisted Fate auswählte. Und auch heute fürchten sich seine Gegner noch davor, auch wenn er jetzt eher für seine unglaublichen Spielzüge mit Fizz bekannt ist.</p>\n\n<p>Im Gegensatz zu seinem dynamischen Spielstil ist Westdoor im wahren Leben der ruhigste Spieler bei ahq e-Sports Club, der meistens sogar alleine isst. Aber gleichzeitig ist er der unangefochtene Teamleiter. Wenn seine Teamkameraden nicht genau wissen, was sie tun sollen, warten sie auf seine Führung – und er ist immer zur Stelle, um sie weiter voranzutreiben. Er erklärt das so: „Wenn du einen Traum hast, musst du ihn verfolgen. Und du darfst nicht aufhören, bevor er wahr geworden ist.“ Westdoor würde sich auch niemals über Training beschweren – was zum Teil auch daran liegt, dass die Solo-Warteschlange sein Zuhause ist. Und um der Legende noch einen draufzusetzen, liest Westdoor in seiner Freizeit Geschichts- und Science-Fiction-Romane, die er auch gerne mit seinem Teamkameraden Mountain teilt. Ein Gentleman, ein Gelehrter, ein Leiter und ein Freund. Gibt es eigentlich nichts, was Westdoor nicht besser kann als wir?</p>","es_ES":"<p>Shu-Wei ''Westdoor'' Liu es uno de los jugadores más históricos de Taiwán, y ha conseguido llegar al nivel Aspirante en los servidores de Taiwán, Norteamérica y Corea. En 2012, si Westdoor elegía a Twisted Fate, la victoria estaba garantizada. Incluso hoy en día levanta el pánico entre los rivales, aunque ahora es más famoso por su increíble manejo de Fizz.</p>\n\n<p>En contraste con su estilo de juego dinámico en partida, Westdoor es uno de los jugadores más callados de ahq e-Sports Club en la vida real, y suele comer solo, pero no cabe duda de que es el capitán del equipo. Cuando sus compañeros no tienen claro qué hacer, lo miran para que les guíe, y siempre les ayuda a llegar más lejos. Como él mismo afirma: ''Si tienes un sueño, ve a por él. No te rindas hasta que lo consigas''. Westdoor es también el que menos se queja a la hora de practicar, en parte porque le encanta la cola en solitario. Para rematar al hombre y la leyenda, Westdoor pasa su tiempo libre entre colas leyendo novelas históricas y de ciencia ficción, y comparte sus favoritas con su compañero de equipo Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Habrá algo en lo que Westdoor no logre ser mejor que nosotros?</p>","pt_BR":"<p>Shu-Wei \"Westdoor\" Liu é um dos jogadores mais lendários em Taiwan, conseguindo alcançar o nível Desafiante em Taiwan, América do Norte e Coreia ao mesmo tempo. Ver Westdoor escolher Twisted Fate era considerado uma vitória garantida em 2012. Até mesmo hoje ele ainda põe medo em seus oponentes, apesar de ter ficado mais conhecido por suas façanhas surreais com Fizz.</p>\n\n<p>Em contraste de seu estilo de jogo completamente dinâmico dentro do jogo, Westdoor é um dos jogadores mais quietos da ahq e-Sports Club na vida real, sempre almoçando sozinho em seu canto. Mas ele também é um capitão de equipe indiscutível. Quando seus companheiros não se sentem confiantes sobre o que fazer, eles o procuram para guiá-los e ele sempre está do lado deles para ajudar a melhorá-los. E é como ele diz, “Se você tem um sonho, vá atrás dele. Não desista até alcançá-lo”. Westdoor também é o menos provável de reclamar dos treinos, em parte porque a vida dele é a Fila Solo, mas além disso, a lenda também usa seu tempo livre entre as filas para ler livros de contos históricos e Sci-Fi, sempre compartilhando seus favoritos com seu companheiro Mountain. Um cavalheiro, estudioso, capitão e amigo. Existe alguma coisa em que o Westdoor não é bom?</p>","es_AR":"<p>Shu-Wei \"Westdoor\" Liu es uno de los jugadores más conocidos de Taiwán, y llegó a Aspirante en los servidores de Taiwán, Norteamérica y Corea. Ver a Westdoor en Twisted Fate se consideraba una victoria segura en el 2012. Aún ahora inspira temor en sus oponentes, aunque se ha vuelto más famoso por su mecánica divina con Fizz.</p>\n\n<p>En contraste con su dinámico estilo de juego, Westdoor es uno de los jugadores más tranquilos en ahq e-Sports club en la vida real, llegando incluso a comer varias veces en solitario. Sin embargo, es también el capitán indiscutido del equipo. Cuando sus compañeros no están seguros sobre qué hacer, acuden a su guía. Él siempre está disponible para ayudar a hacer que las cosas avancen más. Como bien dice, \"Si tienes un sueño, ve por él. No te rindas hasta que lo hayas cumplido\". Westdoor es también quien posee la menor posibilidad de quejarse sobre las prácticas, en parte porque vive y respira en cola individual. Por sobre el hombre y la leyenda, Westdoor pasa su tiempo inactivo entre colas leyendo material histórico y novelas de ciencia ficción, compartiendo sus favoritos con su compañero Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Hay algo que Westdoor no haga mejor que nosotros?</p>"},"foreignIds":{"drupalId":"948","TRLH1":"1001380124","TRLH2":"1001280094","TRLH3":"1001160045","TRLH4":"1001160045","TRTW":"200000008","TRLT3":"200000262"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":35,"slug":"albis","name":"Albis","firstName":"Jia-Wei","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/albis-7h5uw9xi.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:23:18.000Z","bios":{"en_US":"<p>Jia-Wei “Albis” Kang is the silent protector of ahq e-Sports Club. While he’s normally modest and reserved, he’s not afraid to spring into action to help his teammates both in and out of game. The LMS veteran has built a large fanbase over the years, earning him 43.4 percent of the support vote.</p>\n\n<p>Albis’s playmaking skills on the Rift were on full display at Worlds, when he played Bard to great effect in the Group Stage. However, he struggled on other champions, and AHQ failed to make it out of their group.</p>","fr_FR":"<p>Chia Wei \"Albis\" Kang est le protecteur silencieux d'ahq e-Sports Club. Même s'il est d'ordinaire modeste et réservé, il n'a pas peur de passer à l'action quand il s'agit d'aider ses coéquipiers, dans et hors jeu. Le vétéran LMS s'est créé une large base de fans au fil des ans, lui permettant d'obtenir 43,4 pour cent des votes support.</p>\n\n<p>Albis a montré tout ce dont il était capable sur la Faille lors du Mondial en jouant Bard de manière impressionnante dans la phase de groupe. Toutefois, il a du mal avec d'autres champions et AHQ n'a pas réussi à sortir gagnant de son groupe. Alors que l'événement All-Stars 2016 ne sera que pur chaos, l'équipe d'Albis peut compter sur lui pour les mener à la victoire.</p>","pl_PL":"Chia Wei „Albis” Kang to milczący obrońca ahq e-Sports Club. Chociaż zazwyczaj jest skromny i zamknięty w sobie, nie boi się rzucić do akcji, gdy trzeba pomóc kolegom, zarówno w grze, jak i poza nią. Ten weteran LMS zebrał w ciągu lat wielką bazę fanów, którzy zapewnili mu 43,4 procenta głosów dla zawodnika wsparcia.</p>\n\nAlbis w pełni zaprezentował swoje umiejętności kreowania rozgrywki na Summoner’s Rift podczas Mistrzostw, gdy niezwykle skutecznie grał Bardem w fazie grupowej. Jednak kiepsko sobie radził z innymi bohaterami i AHQ nie zdołali wydostać się z grupy. Chociaż wydarzenie All-Star 2016 będzie pełne zamieszania, drużyna Albisa może mieć nadzieję, że on zdoła poprowadzić ją do zwycięstwa.\n","de_DE":"<p>Chia Wei „Albis“ Kang ist der stille Beschützer des ahq e-Sports Club. Obwohl er normalerweise eher bescheiden und reserviert ist, hat er weder im Spiel noch im echten Leben Angst, seinen Teamkameraden zur Hilfe zu kommen. Der Veteran der LMS hat sich über die Jahre eine große Fangemeinde aufgebaut und wurde mit 43,4 % der Stimmen zum Supporter gewählt.</p>\n\n<p>Albis Fähigkeiten als Spielmacher in der Kluft waren bei der Weltmeisterschaft gut zu erkennen, als er in der Gruppenphase mit Bard das Kommando übernahm. Dafür hatte er jedoch mit anderen Champions Probleme und AHQ konnte sich nicht für die K.-o.-Phase qualifizieren. Doch Albis Team kann sich darauf verlassen, dass er sie beim All-Stars-Event 2016 durch das Chaos zum Sieg führen wird.</p>","es_ES":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de apoyo.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó a Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","pt_BR":"<p>Chia Wei “Albis” Kang é o protetor silencioso da ahq e-Sports Club. Apesar de normalmente ser modesto e reservado, ele não tem medo de entrar em ação para ajudar seus companheiros de equipe, tanto dentro como fora do jogo. O veterano da LMS construiu uma grande base de fãs ao longo dos anos, rendendo-lhe 43,4% dos votos de suporte.</p>\n\n<p>A habilidade em fazer jogadas em Summoner’s Rift de Albis foi exibida no Mundial, onde ele brilhou de Bardo na Fase de Grupos. Contudo, ele teve dificuldades em outros Campeões e a AHQ não conseguiu sair de seu grupo. Quando o bicho estiver pegando no Evento All-Star 2016, a equipe de Albis pode ter a certeza de que ele os ajudará a procurar a vitória.</p>","es_AR":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","cs_CZ":"<p>Chia Wei „Albis“ Kang je tichý ochránce týmu ahq e-Sports Club. Ačkoliv bývá tichý a nenápadný, nebojí se vrhnout po hlavě do akce, aby pomohl svým kolegům – a to jak ve hře, tak i mimo ni. Tento veterán LMS si za svou dlouholetou kariéru vybudoval bohatou fanouškovskou základnu, která mu při hlasování vynesla podporu ve výši 43,4 %.</p>\n\n<p>Albisovy kreativní herní dovednosti jasně zazářily na MS, kde ve skupině nesmírně efektivně řádil s Bardem. S ostatními šampiony se mu však až tak nedařilo a AHQ ze své skupiny nakonec nepostoupili. Turnaj All-Star 2016 sice bude hrozný masakr, v Albisovi však jeho tým najde pevnou oporu, jež jej může dovést za vítězstvím.</p>","el_GR":"<p>Ο Chia Wei “Albis” Kang είναι ο σιωπηλός προστάτης των ahq e-Sports Club. Συνήθως είναι συγκρατημένος και ντροπαλός, αλλά δεν φοβάται να δράσει αποφασιστικά για να βοηθήσει τους συμπαίκτες του εντός και εκτός παιχνιδιού. Είναι ένας βετεράνος του LMS που έχει αποκτήσει ένα πολύ μεγάλο κοινό όλα αυτά τα χρόνια. Δεν είναι παράξενο, λοιπόν, που πήρε το 43,4% των ψήφων για τη θέση του υποστηρικτή.</p>\n\n<p>Ο Albis έδειξε σε όλους πόσο καλός οργανωτής είναι στο Παγκόσμιο Πρωτάθλημα, όπου έπαιξε φοβερά με τον Βάρδο στη Φάση Ομίλων. Ωστόσο, δεν τα πήγε εξίσου καλά με άλλους ήρωες και οι AHQ δεν κατάφεραν να προκριθούν. Παρόλο που το Τουρνουά All-Star 2016 προβλέπεται αρκετά χαοτικό, οι συμπαίκτες του Albis μπορούν να τον εμπιστευτούν για να τους οδηγήσει στη νίκη.</p>","hu_HU":"Chia Wei „Albis” Kang az ahq e-Sports Club csendes védelmezője. Általában szerény és visszafogott, de a játékban (és azon kívül is) a csapattársai segítségére siet, ha szükség van rá. Az LMS-veteránnak továbbra is jelentős rajongótábora van, akik a támogatói szavazatok 43,4%-át adták le rá.</p>\n\nAlbis a vébén megmutatta, hogy milyen jó irányító, amikor Barddal játszott remekül a csoportkörben. Más hősökkel viszont nem volt sok szerencsére, így az AHQ nem jutott tovább a csoportjából. Bár a 2016-os All-Star gálán őrült meccsekre lehet számítani, Albisra bizalommal hagyatkozhat a csapata.\n","it_IT":"Chia Wei \"Albis\" Kang è il silenzioso protettore degli ahq e-Sports Club. È modesto e riservato, ma anche sempre pronto a scattare in aiuto dei suoi compagni, sia in partita che fuori. Questo veterano della LMS ha attirato a sé nel corso degli anni intere legioni di fan, che l'hanno premiato con il 43,4% dei voti nella categoria Supporto.\n</p>\nLe capacità di regista di Albis nella Landa sono state sotto gli occhi di tutti ai Mondiali, quando si è esibito con il suo Bard nella fase a gironi. Non è riuscito, tuttavia, a replicare il successo con gli altri campioni, e gli ahq non sono riusciti a proseguire la loro avventura nel torneo. Anche se l'All-Star 2016 sarà caratterizzato da un immenso caos, la squadra di Albis potrà contare sulle sue abilità di organizzatore per puntare alla vittoria.\n","ro_RO":"Chia Wei ''Albis'' Kang este protectorul tăcut al celor din ahq e-Sports Club. Cu toate că în mod normal e modest și tăcut, nu-i e teamă să intre în acțiune pentru a-și ajuta coechipierii atât în joc, cât și în afara lui. Veteranul din LMS a strâns un număr mare de fani de-a lungul anilor, obținând 43,4 la sută din voturile pentru suport.</p>\n\nPuterea lui Albis de a întoarce sorții în Rift a uimit spectatorii la Mondiale, când a jucat cu Bard cu mult succes în faza grupelor. Totuși, a avut probleme cu alți campioni, iar AHQ nu a reușit să treacă de grupe. Cu toate că All-Star Event va fi un turneu nebun și haotic, echipa lui Albis se poate baza pe un lucru: că-i poate conduce către victorie.\n","es_MX":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<P>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>"},"foreignIds":{"drupalId":"945","TRLH1":"1001380126","TRLH2":"1001280096","TRLH3":"1001360065","TRLH4":"1001310065","TRTW":"200000104","TRLT3":"200000261"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":122,"slug":"duke","name":"Duke","firstName":"Hoseong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/duke-e8izehd9.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-06T23:30:15.000Z","bios":{"en_US":"","es_AR":"<p>Ho-seong \"Duke\" Lee ha sido parte de la escena coreana desde el 2013. Al comienzo, jugaba bajo el nombre de \"Leopard\", pero lo cambió a Duke luego de unirse a NaJin Black Sword. Después de la fusión con NaJin, Duke se convirtió en el carrilero superior inicial de NaJin e-mFire, grupo formado poco tiempo antes. Aunque los resultados del equipo fueron muy variados, Duke fue considerado uno de los mejores carrileros superiores de Corea. Luego de más resultados regulares, Duke dejó la organización NaJin a finales del 2015.</p>\n\n<p>Poco después de su partida de NaJin, SKTelecom sumó a Duke para que ocupe el lugar de uno de los mejores carrileros superiores en el 2015, MaRin, luego de que este se fuera a jugar a China. A pesar de que Duke y compañía tuvieron un mal arranque del 2016, encontraron el equilibrio y terminaron adjudicándose el trofeo del torneo de apertura de la LCK 2016. Incluso con la descalificación temprana de SKTelecom en las eliminatorias del torneo de clausura de la LCK 2016, sus esperanzas están puestas en lo más alto de todo: el Mundial. Con su reservada forma de ser, Duke jamás lo aceptaría, pero es uno de los carrileros superiores más emocionantes de Corea, ¡y no se llama Smeb! Valdrá mucho la pena seguirlo en el Mundial.</p>","fr_FR":"<p>Ho-seong « Duke » Lee est présent sur la scène coréenne depuis 2013. Il jouait alors sous le nom de « Leopard », mais il a changé son surnom pour devenir « Duke » après avoir rejoint NaJin Black Sword. Après la fusion de NaJin, Duke a pris la position de toplaner titulaire au sein de l'équipe nouvellement créée des NaJin e-mFire. Même si les résultats de cette nouvelle escouade ont été mitigés, Duke a été perçu comme l'un des meilleurs toplaners de Corée. Voyant que les résultats restaient peu convaincants, Duke a décidé de quitter l'organisation NaJin fin 2015.</p>\n\n<p>Peu après son départ de NaJin, SKTelecom s'est tournée vers Duke pour qu'il reprenne le flambeau de l'un des plus grands toplaners de 2015, MaRin, après son départ vers la Chine. Bien que Duke et ses nouveaux coéquipiers aient quelque peu lutté au début de l'année 2016, ils ont trouvé leurs marques au fil des semaines. C'est à l'approche de la fin du segment de printemps que Duke a finalement développé tout son talent : le timing parfait pour révéler tout son potentiel. Après avoir éliminé les ROX Tigers pour décrocher la couronne du tournoi Champions Spring 2016, Duke va enfin avoir la chance de remporter un deuxième trophée international depuis qu'il a rejoint SKTelecom. Avec sa nature réservée, Duke ne vous le dirait probablement jamais lui-même, mais il est l'un des toplaners les plus en vue de Corée. À votre place, on garderait un œil sur lui.</p>\n","de_DE":"<p>Ho-seong „Duke“ Lee ist bereits seit 2013 Teil der koreanischen Szene. Ursprünglich unter dem Namen „Leopard“ bekannt, wechselte er seinen Namen zu „Duke“, als er den NaJin Black Swords beitrat. Nachdem sich NaJin zusammenschloß, wurde Duke zu einem festen Mitglied als Top-Laner in der Startformation des neu geformten NaJin e-mFire-Teams. Obowohl die Ergebnisse des Teams eher gemischter Natur waren, wurde Duke stets als einer der besten Top-Laner Koreas bezeichnet und als sich die bescheidenden Resultate von NaJin fortsetzten, verließ er NaJin Ende 2015.</p>\n\n<p>Kurz nach seinem Abgang von NaJin wendete sich SKTelecom an Duke und bat ihn, in die Fußstapfen von MaRin, dem besten Top-Laner 2015, zu treten, der nach China gewechselt war. Obwohl Duke und seine Kameraden zu Beginn des Jahres Probleme hatten, fanden sie wieder in die Spur und gewannen den Frühjahrs-Split der LCK 2016. Trotz des frühen Ausscheidens von SKTelecom beim Sommer-Split der LCK 2016 sind die Erwartungen für die Weltmeisterschaft hoch. Duke ist zurückhaltend und würde so etwas nie selbst sagen, aber er ist neben Smeb einer der interessantesten Top-Laner in Korea. An deiner Stelle würde ich ihn bei der WM im Auge behalten.</p>","pl_PL":"<p>Ho-seong „Duke” Lee występuje na koreańskiej scenie od 2013 roku. Zaczynał grać pod ksywką „Leopard”, ale zmienił ją na „Duke” po dołączeniu do NaJin Black Sword. Po połączeniu NaJin, Duke został początkowym górnym w nowoutworzonym NaJin e-mFire. Mimo że wyniki drużyny były przeciętne, Duke był uznawany za jednego z najlepszych górnych w Korei, a po kolejnych podobnych rezultatach Duke opuścił organizację NaJin pod koniec 2015 roku.</p>\n\n<p>Wkrótce po tym SKTelecom odezwało się do Duke'a, aby zastąpił jednego z najlepszych górnych 2015 roku, MaRina, gdy ten odszedł, aby grać w Chinach. Mimo że Duke i reszta mieli problemy na początku 2016 roku, wraz z upływem czasu zaczęli radzić sobie coraz lepiej. Pod koniec wiosennego splitu Duke wreszcie się rozkręcił i to akurat w idealnym czasie. Po pokonaniu ROX Tigers podczas Champions Spring 2016, Duke ma teraz szansę na zdobycie drugiego międzynarodowego trofeum od kiedy dołączył do SKTelecom. Ze względu na swoją skromność, Duke nigdy by tego nie powiedział, ale jest jednym z najbardziej ekscytujących graczy z Korei. Na waszym miejscu obserwowalibyśmy go uważnie.</p>\n","es_ES":"<p>Ho-seong ''Duke'' Lee lleva siendo parte del panorama coreano desde 2013. Antes jugaba bajo el nombre de \"Leopard\", pero cuando llegó a NaJin Black Sword decidió cambiarse el nombre a Duke. Tras la fusión de equipos, Duke se convirtió en el top inicial de NaJin e-mFire. A pesar de que los resultados del equipo eran bastante mixtos, Duke fue considerado uno de los mejores top de Corea, y terminó dejando NaJin a finales de 2015.</p>\n\n<p>Tras dejar NaJin, SKTelecom le pidió a Duke que llenara el vacío que había dejado MaRin, uno de los mejores jugadores de la calle superior de 2015, que había abandonado el equipo para jugar en China. Aunque Duke y compañía lo pasaron mal a principios de 2016, recuperaron fuerzas y se llevaron el trofeo del split de primavera de la LCK 2016 a casa. Puede que SKTelecom tuviese que abandonar antes de lo previsto tras perder en los playoffs del split de verano de la LCK 2016, pero las esperanzas de ganar el Mundial siguen siendo altas. Al ser tan reservado, él nunca os lo diría, pero Duke es uno de los top más prometedores de Corea, aparte de Smeb. Os aconsejamos que sigáis su progreso en el Campeonato Mundial de cerca.</p>","pt_BR":"<p>Ho-seong “Duke” Lee tem participado do cenário coreano desde 2013. Jogando a princípio sob o nome de “Leopard”, ele mudou seu nome para “Duke” quando entrou para a NaJin Black Sword. Depois da união da NaJin, Duke se tornou o topo titular da recém-formada NaJin e-mFire. Apesar dos resultados da equipe terem sido inconsistentes, Duke era visto como um dos melhores topos da Coreia, mas depois de constantes resultados medianos, Duke decidiu sair da formação da NaJin no final de 2015.</p>\n\n<p>Logo depois de sua saída da NaJin, Duke foi chamado pela SK Telecom para substituir um dos melhores topos de 2015, MaRin, após sua saída para jogar na China. Apesar de Duke e seus companheiros terem sofrido um pouco no início de 2016, eles conseguiram encontrar sua sintonia e terminaram levando para casa o troféu da Etapa de Primavera da LCK 2016. Mesmo com a saída precoce da SKT nas eliminatórias da Etapa de Verão da LCK 2016, as esperanças ainda são altas para o Mundial. Tendo uma natureza reservada, Duke provavelmente nunca falaria isso, mas ele é um dos topos mais promissores da Coreia que não tem o nome de Smeb. Eu ficaria de olho nele no Mundial se fosse você.</p>"},"foreignIds":{"drupalId":"2811","TRKR1":"225039","TRLT3":"35084","TRLH1":"1001380052","TRLH2":"1001280022"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":302,"slug":"chawy","name":"Chawy","firstName":"Xing-Lei","lastName":"Wong","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chawy-13of7sx8.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2014-09-16T21:52:24.000Z","updatedAt":"2017-07-06T14:32:25.000Z","bios":{"en_US":"","es_AR":"<p>Xing-lei \"Chawy\" Wong es el carrilero central suplente de ahq e-Sports Club.</p>"},"foreignIds":{"drupalId":"377","TRTW":"200000007","TRLH2":"1001280097","TRLH1":"1001380127","TRLT3":"200000259"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":407,"slug":"mountain","name":"Mountain","firstName":"Zhao-Hong","lastName":"Xue","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mountain-a7eo73t.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:32:08.000Z","bios":{"en_US":"<p>Zhao-Hong \"Mountain\" Xue is the meaty, front-line-patrolling, carry-peeling jungler that every squishy champion dreams of having around in a team fight. Mountain integrated with ahq almost instantly after joining in 2014, despite initial worries about synergy with his teammates. His one potential flaw? He likes to experiment with in-game strategy -- sometimes without telling his team first, leading to questionable scrim results. But when ahq needs him to deliver his finest, he is always ready to step up to the plate.\n</p>\n<p>\nWhile Mountain enjoys experimenting with new strategies on the Rift, when he leaves the game behind he becomes more consistent. Whenever ahq goes abroad, the first thing he does is buy a doll from the airport or a local toy store for his girlfriend. And if he has time to kill between queues, he enjoys reading a good historical or science fiction novel with his teammate Westdoor.\n</p>","fr_FR":"<p>Zhao-Hong « Mountain » Xue est un jungler puissant et dominant que tout champion un peu fragile rêve d'avoir à ses côtés pendant un combat d'équipe. Mountain a rejoint ahq presque immédiatement après son arrivée en 2014, malgré des craintes initiales sur la synergie avec ses coéquipiers. Son potentiel point faible ? Il aime tenter de nouvelles stratégies en cours de partie, parfois sans même prévenir son équipe, ce qui peut mener à des résultats ambivalents lors des matchs d'entraînement. Mais quand ahq a besoin qu'il donne le meilleur de lui-même, il répond toujours présent.\n</p>\n<p>\nSi Mountain aime tester de nouvelles stratégies dans la Faille, quand il ne joue pas, il est beaucoup moins créatif. Dès qu'ahq part à l'étranger, il achète toujours une poupée pour sa petite amie à l'aéroport ou dans un magasin de jouets. Et s'il a du temps à perdre entre deux parties, il va lire un roman historique ou de science-fiction avec son coéquipier Westdoor.\n</p>","pl_PL":"<p>Zhao-Hong „Mountain” Xue to walczący na froncie i usuwający prowadzących dżungler, którego każdy wrażliwy bohater lubi mieć przy sobie. Mountain zintegrował się z ahq tuż po przyłączeniu się w 2014 roku mimo tego, że obawiano się o to, jak ułoży mu się współpraca z towarzyszami. Jego potencjalną wadą jest fakt, że lubi eksperymentować ze strategią, czasem nie mówiąc nawet towarzyszom, co daje bardzo różne wyniki. Jednak kiedy ahq naprawdę go potrzebuje, zawsze spełnia oczekiwania drużyny.\n</p>\n<p>\nChociaż Mountain lubi eksperymentować w grze, poza nią jest zrównoważony. Kiedy ahq wybiera się w podróż, zawsze kupuje swojej dziewczynie lalkę na lotnisku lub w sklepie z zabawkami. A jeśli ma czas między meczami, lubi czytać powieści historyczne i science fiction, tak jak jego kolega, Westdoor.\n</p>","de_DE":"<p>Zhao-Hong „Mountain“ Xue ist der robuste, Carry fressende Jungler an der Front, den jeder Champion, der nicht besonders viel aushält, in einem Teamkampf gerne an seiner Seite hätte. Mountain konnte sich trotz anfänglicher Sorgen über die Harmonie mit seinen Teamkameraden gleich nach seinem Beitritt im Jahr 2014 bei ahq integrieren. Seine einzige potenzielle Schwachstelle? Er experimentiert gerne mit der Strategie im Spiel – und manchmal vergisst er, seine Mannschaft darüber in Kenntnis zu setzen, was immer wieder zu fragwürdigen Ergebnissen in Übungsspielen führt. Aber wenn es ernst wird und ahq ihn braucht, stellt er sich der Herausforderung.</p>\n\n<p>Obwohl Mountain in der Kluft gerne mit neuen Strategien experimentiert, ist er abseits des Spiels lange nicht so experimentierfreudig. Immer wenn ahq das Land verlässt, kauft er am Flughafen oder in einem Spielzeugladen eine Puppe für seine Freundin. Und wenn er zwischen den Spielen einmal Zeit totschlagen muss, liest er mit seinem Teamkameraden Westdoor Geschichts- oder Science-Fiction-Romane.</p>","es_ES":"<p>Zhao-Hong ''Mountain'' Xue es ese valioso jungla que todo campeón fácil de asesinar desea tener cerca durante los combates de equipo porque protege en primera línea y defiende al carry. Mountain se integró en ahq al instante cuando se unió a ellos en 2014, a pesar de las preocupaciones iniciales sobre su sinergia con los compañeros de equipo. ¿Su posible punto débil? Le gusta experimentar con la estrategia en partida, a veces sin decírselo primero a sus compañeros, lo que provoca resultados cuestionables durante las prácticas. Pero cuando ahq necesita que lo dé todo, siempre está preparado para saltar a la palestra.</p>\n\n<p>Aunque le gusta probar nuevas estrategias en la Grieta, cuando deja el juego a un lado, se vuelve más coherente. Cuando ahq viaja al extranjero, lo primero que hace es comprarle una muñeca en el aeropuerto o en una tienda de la zona a su novia. Para matar el tiempo durante las colas, le gusta leer novelas históricas o de ciencia ficción con su compañero Westdoor.</p>","pt_BR":"<p>Zhao-Hong \"Mountain\" Xue é o caçador-tanque carregador e protetor que todo campeão frágil sonha em ter por perto em um confronto de equipe. Mountain se integrou quase que instantaneamente com a ahq logo em sua entrada em 2014, apesar de preocupações iniciais sobre a sinergia com seus compaheiros. Seu possível maior defeito? Ele gosta de experimentar com estratégias dentro do jogo, muitas vezes sem dizer aos seus companheiros primeiro, levando a resultados questionáveis durante o treinamento. Mas quando a ahq precisa que ele dê o seu melhor, ele sempre está pronto para atender às expectativas.</p>\n\n<p>Apesar de Mountain gostar de experimentar com novas estratégias no Rift, quando ele deixa essa parte de lado, ele se torna mais consistente. Sempre que a ahq viaja pelo mundo, a primeira coisa que ele faz é comprar uma boneca no aeroporto ou em uma loja de brinquedos local para sua namorada. E durante seu tempo livre da filas do League of Legends, ele gosta de ler uma boa novela histórica ou Sci-Fi com seu companheiro de equipe, Westdoor.</p>","es_AR":"<p>Zhao-Hong \"Mountain\" Xue es el sustancioso junglero que patrulla la primera línea y evita los movimientos del contrario, alguien a quien cada campeón frágil desearía tener cerca en un combate en equipo. Mountain se unió a ahq en el 2014 y se integró sólidamente casi al instante, a pesar de las preocupaciones iniciales sobre la forma de trabajar con sus compañeros. ¿Su posible falla? Le gusta experimentar con la estrategia dentro del juego, a veces sin avisar primero a sus compañeros, lo cual se traduce en cuestionables resultados. Sin embargo, cuando ahq necesita que se desempeñe impecablemente, está siempre listo para cumplir con lo suyo.</p>\n\n<p>Si bien a Mountain le gusta crear nuevas estrategias en la Grieta, cuando deja al juego atrás, se vuelve mucho más consistente. Cada vez que ahq sale del país, lo primero que hace es comprar una muñeca para su novia en el aeropuerto o en una juguetería local. Y, si tiene que matar el tiempo mientras hace fila, disfruta leyendo literatura histórica o novelas de ciencia ficción con su compañero Westdoor.</p>"},"foreignIds":{"drupalId":"1698","TRLH1":"1001380123","TRLH2":"1001280093","TRLH3":"1001160093","TRLH4":"1001160093","TRTW":"200000006","TRLT3":"200000258"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":408,"slug":"ziv","name":"Ziv","firstName":"Yi","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ziv-r8szyen.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:22:21.000Z","bios":{"en_US":"<p>There’s a reason Yi “Ziv” Chen earned a staggering 66.1 percent of the top lane vote for the LMS region. He’s the cream of the crop of LMS top laners, and he’s proven he can compete with the best in the world. He turned heads with his debut at the 2015 Mid-Season Invitational, and he led AHQ to two of their victories with stellar Jayce play at the 2016 World Championship. Unfortunately, AHQ fell just short of making it out of the group stage.</p>\n\n<p>Ziv made a name for himself in the LMS with his unrelenting approach in the top lane. He isn’t afraid to chase his opponents all the way to their fountain if necessary. He’s shown his dedication to improving his craft, and he’s always looking to improve his mechanics in scrims and solo queue.</p>","fr_FR":"<p>Ce n'est pas sans raison que Yi \"Ziv\" Chen a remporté un pourcentage écrasant de 66,1 dans le vote top laner de la région LMS. Il est la crème de la crème des top laners LMS et il a démontré qu'il pouvait affronter les meilleurs du monde. Il a fait tourner les têtes lors de ses débuts dans le Mid-Season Invitational 2015, et AHQ lui doit deux de ses victoires grâce à son jeu exceptionnel de Jayce lors du Championnat du monde 2016. Malheureusement, AHQ n'a pas réussi à sortir gagnant de la phase de groupe.</p>\n\n<p>Ziv s'est fait un nom dans les LMS avec son style implacable dans la voie du haut. Il n'a pas peur de poursuivre ses adversaires jusqu'à leur fontaine, s'il le faut. Il s'est montré déterminé dans l'apprentissage de son art et il cherche toujours à améliorer ses mécaniques dans les matchs amicaux et la file solo. L'événement All-Stars 2016 lui donnera une chance de se libérer et de plonger dans le chaos de l'intersaison.</p>","pl_PL":"Yi „Ziv” Chen nie bez powodu zdobył oszałamiające 66,1 procenta głosów na górnego regionu LMS. Należy do śmietanki górnych LMS i pokazał, że potrafi rywalizować z najlepszymi na świecie. Zwrócił na siebie uwagę podczas debiutu na Mid-Season Invitational 2015, a swoją genialną grą Jaycem doprowadził AHQ do dwóch zwycięstw na Mistrzostwach Świata 2016. Niestety AHQ nie zdołali wyjść z fazy grupowej, choć tak niewiele im do tego brakowało.\n</p>\nZiv zdobył sobie uznanie w LMS swoją nieustępliwością na górnej alei. Gdy trzeba, nie boi się ścigać przeciwników aż do ich fontanny. Wykazał się skrupulatnością w doskonaleniu swojego warsztatu i zawsze jest gotowy poprawiać mechanikę gry podczas sesji treningowych i w kolejce solo. Wydarzenie All-Star 2016 będzie dla niego okazją, by pójść na całość i poszaleć trochę poza sezonem.\n","de_DE":"<p>Es gibt einen Grund, aus dem Yi „Ziv“ Chen von unglaublichen 66,1 % aller Wähler zum Top-Laner für die LMS-Region gewählt wurde. Er ist der beste Top-Laner der LMS und er hat bewiesen, dass er mit den besten Spielern der Welt mithalten kann. Er erregte bereits bei seinem Debüt im Mid-Season Invitational 2015 Aufsehen und führte AHQ mit seinem überragenden Jayce zu zwei Siegen bei der Weltmeisterschaft 2016. Leider schaffte es AHQ knapp nicht, in die K.-o.-Runde der WM einzuziehen.</p>\n\n<p>Ziv machte sich mit seinen erbarmungslosen Spielzügen auf der oberen Lane einen Namen in der LMS. Er schreckt auch nicht davor zurück, seine Gegner bis in die Basis zu verfolgen, wenn es die Situation erfordert. Er hat gezeigt, dass er sich stets steigern will, und versucht, seine Mechaniken in Übungsspielen und der Solo-Warteschlange zu verbessern. Beim All-Stars-Event 2016 bekommt er die Möglichkeit, richtig aufzudrehen und in der Nebensaison ordentlich Chaos zu stiften.</p>","es_ES":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para la calle superior de la región de LMS. Es de lo mejorcito de los top de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograse dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en la calle superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola en solitario. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","pt_BR":"<p>Existe um motivo para Yi “Ziv” Chen ter conseguido 66,1% dos votos da rota do topo da região LMS. Ele faz parte da nata dos jogadores de posição na LMS e provou que pode competir com os melhores do mundo. Ele atraiu olhares com sua estreia no Mid-Season Invitational 2015 e levou a AHQ a duas de suas vitórias, com desempenhos espetaculares de Jayce no Campeonato Mundial 2016. Infelizmente, a AHQ não conseguiu sair da Fase de Grupos.</p>\n\n<p>Ziv fez seu nome na LMS com sua abordagem implacável da rota do topo. Ele não tem medo de perseguir seus oponentes até a fonte, se necessário. Mostrou sua dedicação em melhorar seu ofício e sempre está buscando aprimorar suas mecânicas em duelos na fila solo. O Evento All-Star 2016 lhe dará uma chance de relaxar e mergulhar no caos do pós-temporada.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yi \"Ziv\" Chen은 ahq E-sports Club에 가장 최근 합류한 선수 두 명 중 하나로 2014 월드 챔피언십 이후 팀에 들어갔습니다. 그는 데뷔 무대였던 2015 미드 시즌 인비테이셔널에서 마오카이와 나르를 이용한 압도적 경기력으로 세계를 뒤흔들었습니다. 특히 서구의 탑 라이너들 몇몇이 여기에 희생됐죠. Ziv는 2015 월드 챔피언십에서 ahq가 8강까지 올라가는 데 중요한 역할을 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">전장에서 그가 킬을 올리기 위해 적팀 탑 라이너를 쫓고 있지 않을 때에는 LMS에서 가장 진지한 선수들 중 하나가 됩니다. ahq의 스크림 경기에서 Ziv는 피지컬을 향상시키기 위해 최선을 다하죠. 하지만 연습이 끝나면 긴장을 푼 Ziv로 돌아옵니다. 평소에는 숙소에서 잠을 자거나 친구들과 애니메이션을 보며 하루를 보낼 때가 많습니다. </p>\n","es_AR":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","cs_CZ":"<p>Není žádná náhoda, že Yi „Ziv“ Chen získal za LMS ohromujících 66,1 % hlasů pro horní lajnu. Je absolutní špičkou mezi horními lajnaři z LMS a dokázal, že obstojí i v boji s těmi nejlepšími z celého světa. Vzbudil zaslouženou pozornost již při svém debutu na turnaji Mid-Season Invitational 2015 a svou hvězdnou hrou za Jayce dovedl AHQ ke dvěma z jejich vítězství na mistrovství světa 2016. Přesto AHQ bohužel nepostoupili ze skupiny.</p>\n\n<p>Ziv se v LMS proslavil tím, že v horní lajně nenechá svého soupeře ani na okamžik vydechnout. Je-li to zapotřebí, neváhá jej pronásledovat až na fontánu. Neusíná na vavřínech a neustále se snaží své herní dovednosti zlepšovat v cvičných utkáních a sólové frontě. Na turnaji All-Star 2016 bude mít příležitost utrhnout se ze řetězu a trochu si vychutnat všeobecný masakr v odpočinkové době mezi sezónami.</p>","el_GR":"<p>Δεν είναι τυχαίο που ο Yi “Ziv” Chen πήρε το απίστευτο ποσοστό 66,1% των ψήφων του LMS για τη θέση επάνω λωρίδας. Είναι ό,τι καλύτερο έχει να επιδείξει το LMS στην επάνω λωρίδα και μπορεί να ανταγωνιστεί τους καλύτερους παίκτες του κόσμου σε αυτήν τη θέση. Το ντεμπούτο του στο Mid-Season Invitational 2015 προκάλεσε τεράστια αίσθηση, ενώ αργότερα οδήγησε τους AHQ σε δύο πολύ σημαντικές νίκες στο Παγκόσμιο Πρωτάθλημα 2016 με εκπληκτικό χειρισμό του Τζέις. Δυστυχώς, οι AHQ δεν κατάφεραν να περάσουν από τη φάση ομίλων.</p>\n\n<p>Ο Ziv έγινε διάσημος στο LMS για τον αδυσώπητο τρόπο που έπαιζε στην επάνω λωρίδα. Δεν φοβάται να κυνηγήσει τους αντιπάλους του ακόμη και μέχρι το σιντριβάνι τους, αν χρειαστεί. Έχει αποδείξει την αφοσίωσή του στη βελτίωση του παιχνιδιού του και προσπαθεί πάντα να βελτιώσει τη γνώση των μηχανισμών σε φιλικούς αγώνες και παιχνίδια στην ουρά αναμονής για έναν παίκτη. Στο Τουρνουά All-Star 2016 θα έχει την ευκαιρία να τα δώσει όλα και να σπείρει λίγο χάος προτού ξεκινήσει η σεζόν.</p>","hu_HU":"Nem véletlen, hogy Yi „Ziv” Chen elsöprő, 66,1%-os szavazati aránnyal lehet az LMS régiót képviselő felső ösvényes. Az LMS felső ösvényesei közül is kiemelkedik, és bizonyította, hogy a világ legjobbjaival is elbánik. Először a 2015-ös szezonközi meghívásos versenyen hívta fel magára a figyelmet, és két győzelemre vezette az AHQ-t Jayce-t irányítva a 2016-os világbajnokságon. Balszerencséjükre ez nem volt elég ahhoz, hogy az AHQ továbbjusson a csoportkörből.</p>\n\nZiv azzal szerzett hírnevet magának az LMS-ben, hogy kíméletlenül játszik a felső ösvényen. Akár a forrásig is üldözi az ellenfeleit. Elkötelezetten fejleszti a játéktudását: gyakorlómeccseken és az egyéni várólistán csiszolja a képességeit. A 2016-os All-Star gálán végre ellazulhat, és örömét lelheti a játékban.\n","it_IT":"C'è un motivo alla base dell'incredibile 66,1% di voti guadagnato da Yi \"Ziv\" Chen nella categoria Superiore per la regione LMS. Non solo rappresenta l'élite dei superiori della LMS, ma ha anche dimostrato di saper tenere testa ai migliori giocatori del mondo. Ha attirato l'attenzione sin dal suo debutto al Mid-Season Invitational 2015 e ha condotto gli AHQ a due importanti vittorie ai Mondiali 2016 grazie alle sue giocate stellari con Jayce. Tuttavia, la sua squadra non è riuscita a qualificarsi nella fase a gironi.</p>\n\nZiv si è fatto conoscere nella LMS per il suo approccio aggressivo in corsia superiore. Non ha paura di dare la caccia ai suoi avversari e neppure di seguirli fino alla loro base, se necessario. Ha dimostrato molto impegno nel migliorare il suo gioco ed è sempre intento a studiare nuove meccaniche in allenamento e nelle code in singolo. L'All-Star 2016 gli darà la possibilità di scatenarsi e portare un po' di caos fuori dalla stagione regolare.\n","ro_RO":"Există un motiv pentru care Yi ''Ziv'' Chen a obținut un procent uimitor de 66,1 la sută din voturile pentru culoarul de sus din LMS. Este cel mai bun jucător de pe această poziție din regiune și a dovedit că poate concura liniștit la nivel mondial. A atras privirile spectatorilor prin debutul său la Mid-Season Invitational 2015 și a condus AHQ către două dintre victoriile echipei, jucând surprinzător cu Jayce la Campionatul Mondial 2016. Din păcate, AHQ nu a reușit să treacă de faza grupelor.</p>\n\nZiv și-a creat o reputație în LMS cu strategia sa nemiloasă de pe culoarul de sus. Nu-i e teamă să-și urmărească adversarii până la fântână dacă e cazul. E gata să muncească enorm ca să devină mai bun și încearcă mereu să-și îmbunătățească mecanicile în antrenamente și pe lista de așteptare solo. All-Star Event 2016 este o nouă șansă să se dezlănțuie și să provoace puțin haos în perioada dintre sezoane.\n","es_MX":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>"},"foreignIds":{"drupalId":"4288","TRLH1":"1001380122","TRLH2":"1001280092","TRLH3":"1001360061","TRLH4":"1001310061","TRTW":"200000148","TRLT3":"200000257"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":519,"slug":"kid","name":"Kidkid","firstName":"Yan","lastName":"Ge","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kid-d4hufczg.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:24:40.000Z","bios":{"en_US":"","fr_FR":"<p>Ge « Kid » Yan est un incroyable carry AD. Il s'entraîne constamment pour s'améliorer et développer de meilleures synergies avec son partenaire de la voie du bas, Kitties. Et tout cet entraînement a fini par payer : ses performances régulières aux LPL lui a valu le surnom « d'ancre de stabilité ».</p>\n\n<p>À la différence de bon nombre de joueurs pro, Kid n'a pas perdu sa nonchalance en devenant une star, du moins pas en dehors de son rigoureux programme d'entraînement ! Mais quand l'entraînement prend fin, c'est un Kid très relax qu'on retrouve. Quand il est l'heure de s'amuser, il est prêt à se donner à fond.</p>","pl_PL":"<p>Ge „Kid” Yan to rzetelny prowadzący. Ciągle trenuje, starając się poprawić swoją formę i współpracę z partnerem z dołu, Kitties. Ćwiczenia opłaciły się – jego stabilna gra w LPL sprawiła, że zaczęto go nazywać „Ostoją stabilności”.</p>\n\n<p>W przeciwieństwie do innych zawodowców Kid nie przestał być wyluzowany, gdy stal się gwiazdą. Oczywiście nie dotyczy to jego rygorystycznych treningów. Jednak po treningu pojawia się na powrót zrelaksowany Kid. Kiedy przychodzi pora na zabawę, oddaje jej się bez reszty.</p>","de_DE":"<p>Ge “Kid” Yan ist ein Arbeitstier als AD Carry. Er trainiert konstant, um besser zu werden und arbeitet an seiner Synergie mit seinem Supporter, Kitties. Und die ganze Arbeit hat sich ausgezahlt, seine konstanten Leistungen in der LPL brachten ihm den Namen “The Anchor of Stability”.</p>\n\n<p>Im Gegensatz zu anderen Profis opferte er nicht sein entspanntes Wesen, um ein Star zu werden – zumindest nicht abseits seines harten Trainingsplanes! Aber wenn das Training vorbei ist, kommt das entspannte Kind zu Tage. Wenn die Zeit zum Spaß haben gekommen ist, ist er mittendrin dabei. </p>\n","es_ES":"<p>Ge “Kid” Yan es un trabajador por naturaleza. Este tirador se somete a duras sesiones de entrenamiento para que mejoren tanto él como jugador como la sinergia de la calle inferior con su compañero y support, Kitties. Y tanto entrenamiento ha dado sus frutos -- gracias a sus actuaciones consistentes en la LPL se ha ganado el apodo de “El Ancla de la Estabilidad”. </p>\n\n<p>A diferencia de muchos jugadores profesionales, Kid no ha sacrificado su actitud relajada y alegre para convertirse en una estrella -- ¡Al menos fuera de las sesiones de entrenamiento con su equipo! Cuando la práctica termina, descubrimos Kid relajado y bromista. Porque si es la hora de divertirse, ahí está él. </p>\n","pt_BR":"<p>Kid é um atirador incansável. Ele está sempre treinando para evoluir e ter uma sinergia melhor com seu parceiro de rota, Kitties. E tanta dedicação deu resultado -- com atuações consistentes na LPL, ele ganhou o apelido de \"Âncora da Estabilidade\".</p>\n<p>Ao contrário de vários jogadores, ele não sacrificou seu temperamento tranquilo para virar uma estrela -- pelo menos não fora do horário de treino. Quando o jogo acaba, surge o Kid tranquilão, pronto para se divertir.</p>"},"foreignIds":{"drupalId":"2064","TRLH4":"1001160033","TRLH3":"1001160033"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":522,"slug":"rookie","name":"Rookie","firstName":"Ui-jin","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rookie-3ohvy99s.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:27:32.000Z","bios":{"en_US":"","fr_FR":"<p>Eui-jin « RooKie » Song n'est qu'un nouveau venu aux LPL, mais ne vous laissez pas tromper par son pseudo (« le bleu » en anglais) : il a affronté bon nombre des meilleurs joueurs du monde. RooKie a été en première ligne du nouveau départ de KT Rolster en 2014, et le lien qu'il a développé avec son coéquipier jungler de KT, KaKAO, les a aidés à remporter plusieurs matchs des LCK.</p>\n\n<p>Lorsque KaKAO a décidé de participer aux LPL, RooKie a suivi le mouvement. Il a emporté avec lui son affinité pour les mages de contrôle, comme Azir et Orianna, ainsi qu'une tendance à utiliser des coups flamboyants pour remporter les parties. Si cette tendance a quelque peu reflué lors de sa première année aux LPL, RooKie a encore bon nombre de tours dans sa manche, notamment une excellente Cassiopeia.</p>","pl_PL":"<p>Eui-jin „RooKie” Song może i od niedawna gra w LPL, ale walczył już z najtrudniejszymi przeciwnikami na świecie. RooKie był główną siłą napędową KT Rolster w 2014 roku, a przyjaźń nawiązana z dżunglerem KaKAO pozwoliła wygrać wiele meczów w LCK.</p>\n\n<p>Kiedy KaKAO przeniósł się do LPL, RooKie zabrał się z nim. Zawsze lubił kontrolujących magów takich jak Azir czy Orianna i dalej ma tendencje do wygrywania popisowymi akcjami. Chociaż jego popisy nieco osłabły podczas pierwszego roku w LPL, RooKie wciąż ma kilka asów w rękawie, np. grę Cassiopeią.</p>","de_DE":"<p>Eui-jin “RooKie” Song mag zwar neu in der LPL sein, aber lass dich nicht von seinem Namen täuschen – er spielte schon gegen einige der besten Teams auf der Welt. RooKie war bei der Verjüngung von KT Rolster 2014 vorne mit dabei, und die Verbindung mit seinem Teamkameraden und Jungler von KT KaKAO trug dazu bei, viele Spiele in der LCK zu gewinnen. </p>\n\n<p>Als KaKAO in die LPL wechselte, zog RooKie nach. Er brachte eine Vorliebe für Kontrollmagier wie Azir und Orianna zu seinem neuen Arbeitsplatz mit und eine Tendenz zu riskanten Zügen, um Spiele zu gewinnen. Während sein Vertrauen auf riskante Spielzüge während seinem ersten Jahr in der LPL verblasste, packt er immer wieder ein Ass aus dem Ärmel – inklusive einer tödlichen Cassiopeia. </p>\n","es_ES":"<p>Puede que Eui-jin “RooKie” Song sea relativamente nuevo en la LPL, pero no dejes que su nombre te engañe -- ha jugado contra algunos de los rivales más fuertes del mundo. RooKie estuvo al frente en el proceso de renovación que sufrió KT Rolster durante 2014, y el lazo que desarrolló con su compañero en la jungla KaKAO ayudó a su equipo a ganar bastantes partidos en la LCK. </p>\n\n<p>Cuando KaKAO se fue a la LPL, RooKie hizo las maletas y se fue con él. En China, ha desarrollado una afinidad por magos que controlan a sus enemigos como Azir y Orianna, y una tendencia a depender de jugadas brillantes para ganar las partidas. Aunque durante su primer año en la LPL se ha vuelto más sobrio, RooKie sigue teniendo algún as en la manga -- incluída una Cassiopeia demoledora. </p>\n","pt_BR":"<p>RooKie pode ser novo na LPL, mas não se engane. Ele já jogou contra alguns dos melhores jogadores do mundo. Ele foi parte fundamental do rejuvenescimento da KT Rolster em 2014, e sua sinergia com o caçador KAKAO ajudou o time a vencer muitas particas na LCK.</p>\n<p>Quando KAKAO mudou-se da Coreia para a China, RooKie foi junto. Levou consigo o controle de magos como Azir e Orianna, criando uma tendência de jogadas exuberantes para vencer partidas. Apesar de essa exuberância ter perdido o encanto com o passar do tempo, ele ainda tem vários truques na manga -- incluindo uma Cassiopeia venenosa.</p>\n","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “RooKie” 송의진 선수가 LPL에 진출한 진 그리 오래되지 않았지만 아이디대로 신인인 건 아닙니다. 세계에서 가장 치열한 리그에서 뛴 적 있는 선수죠. RooKie 선수는 kt 롤스터가 2014년 팀을 재정비할 때 최전선에 섰고 같은 팀의 정글러 KaKAO 선수와 멋진 호흡으로 LCK에서 팀의 선전을 이끌었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">KaKAO 선수가 LPL로 이적할 때, RooKie 선수도 따라가면서 아지르나 오리아나 같은 장악형 마법사 플레이와 현란한 플레이로 승리하는 전략을 새 팀에 선사했죠. 비록 현란한 플레이에 의존하는 플레이는 LPL 진출 첫해를 보내며 사라졌지만 그 외에도 적을 떨게 하는 카시오페아 플레이처럼 여러 전술을 갖춘 선수입니다. </p>\n"},"foreignIds":{"drupalId":"2149","TRLH3":"1001160032","TRLH4":"1001160032","TRLH1":"1001180003","TRLH2":"1001140003"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1019,"slug":"lbb","name":"LBB","firstName":"Bing-Xin","lastName":"Liu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lbb-brctu3lx.png","hometown":"","region":"LMS Taiwan","birthdate":null,"createdAt":"2016-01-06T21:51:14.000Z","updatedAt":"2017-03-24T20:16:37.000Z","bios":{},"foreignIds":{"TRTW":"200000058"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":1664,"slug":"megan","name":"Megan","firstName":"Liu-Yi","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/megan-900drhog.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:38:18.000Z","updatedAt":"2017-06-06T23:28:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1871,"slug":"ning","name":"Ning","firstName":"Zhen-Ning","lastName":"Gao","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T18:39:15.000Z","updatedAt":"2017-04-16T18:39:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1980,"slug":"west","name":"West","firstName":"Long","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:18:02.000Z","updatedAt":"2017-06-06T23:18:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1981,"slug":"theshy","name":"TheShy","firstName":"Seung-Lok","lastName":"Kang","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:24:15.000Z","updatedAt":"2017-06-06T23:24:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1982,"slug":"rio","name":"Rio","firstName":"Fu-Hua","lastName":"Wen","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:28:00.000Z","updatedAt":"2017-06-06T23:28:00.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79}],"scheduleItems":[{"id":"AU_di2hEJTrHluSI14F7","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:1bb10628-ea70-4370-844e-d45f708328b1","scheduledTime":"2015-10-04T14:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"4","subBlockLabel":"paris - W1D4","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:6ccafe25-5e3c-4d9a-a67e-b4c3358df4de"},"match":"1bb10628-ea70-4370-844e-d45f708328b1","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"6ccafe25-5e3c-4d9a-a67e-b4c3358df4de","league":"9"}],"gameIdMappings":[{"id":"d476a725-1644-4110-8b27-773580d5141b","gameHash":"7b6a594109f00d49"}],"videos":[{"id":83,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:d476a725-1644-4110-8b27-773580d5141b","source":"https://www.youtube.com/embed/9kDQ8aUXtDs?wmode=transparent","createdAt":"2015-10-04T16:42:07.000Z","updatedAt":"2015-10-04T16:42:07.000Z","game":"d476a725-1644-4110-8b27-773580d5141b"},{"id":87,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:d476a725-1644-4110-8b27-773580d5141b","source":"https://www.youtube.com/embed/ZjOkm5O8amY?wmode=transparent","createdAt":"2015-10-04T19:01:18.000Z","updatedAt":"2015-10-04T19:01:18.000Z","game":"d476a725-1644-4110-8b27-773580d5141b"},{"id":95,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:d476a725-1644-4110-8b27-773580d5141b","source":"https://www.youtube.com/embed/UvjCE5rNxKA?wmode=transparent","createdAt":"2015-10-07T12:09:30.000Z","updatedAt":"2015-10-07T12:09:30.000Z","game":"d476a725-1644-4110-8b27-773580d5141b"},{"id":96,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:d476a725-1644-4110-8b27-773580d5141b","source":"https://www.youtube.com/embed/hy9yazCbDZQ?wmode=transparent","createdAt":"2015-10-07T12:09:20.000Z","updatedAt":"2015-10-07T12:09:20.000Z","game":"d476a725-1644-4110-8b27-773580d5141b"}],"htmlBlocks":[],"match":{"id":"1bb10628-ea70-4370-844e-d45f708328b1","name":"IG-vs-AHQ","position":3,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1eff94a0-2ebd-43c8-b227-77d9e59d2383"},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}],"games":{"d476a725-1644-4110-8b27-773580d5141b":{"id":"d476a725-1644-4110-8b27-773580d5141b","name":"G1","generatedName":"AHQ|IG|G1|1bb10628ea704370844e","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1eff94a0-2ebd-43c8-b227-77d9e59d2383"},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}],"standings":{"result":[[{"roster":"1eff94a0-2ebd-43c8-b227-77d9e59d2383"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1443972537427,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380458","gameRealm":"TRLH3","platformId":"TRLH3:1001380458","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"1eff94a0-2ebd-43c8-b227-77d9e59d2383"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1443972537427,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"930dbeee-1412-4198-a6ac-dcdb1170617b":0,"1eff94a0-2ebd-43c8-b227-77d9e59d2383":1}}}