{"teams":[{"id":15,"slug":"fnatic","name":"Fnatic","guid":"be6c86ea-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bjbf9nf7.jpg","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-i09wrkpf.png","acronym":"FNC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bkk3xam5.png","createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-07-27T00:51:46.000Z","bios":{"en_US":"<p>As the original League of Legends World Champion, Fnatic was the team to beat in LoL’s infancy. These days, the squad is completely unrecognizable from its original form. With a new roster mixing veteran playmakers like sOAZ and Rekkles plus Caps, their lone rookie, Fnatic is remaking itself. Putting their underwhelming 2016 behind them, Fnatic believe they are building a roster that could make a serious run at the EU LCS trophy.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>\n","fr_FR":"<p>Première détentrice du titre mondial de League of Legends, Fnatic était l'équipe à battre dans la prime enfance de LoL. Mais l'équipe d'aujourd'hui n'a plus rien à voir avec sa forme d'origine. Sa nouvelle formation accueillant à présent des talents coréens, des joueurs européens prometteurs et Rekkles, la star carry AD, Fnatic est en pleine reconstruction. Avec une série de 18 victoires sans défaite durant le segment d'été des LCS EU 2015 et une qualification pour les demi-finales du mondial 2015, l'équipe a prouvé qu'elle pouvait encore obtenir des résultats.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>","pl_PL":"<p>Legendarni obrońcy honoru Europy. Fnatic to jedna z najstarszych drużyn konkurujących w League of Legends. 14 marca 2011 roku ta organizacja, dobrze znana z udziału w innych grach, zaistniała w świecie Runeterry. Świeżo po założeniu, od razu zabrała się za największy kaliber osiągnięć. Żółto-czarni byli jedną z 8 ekip, które zakwalifikowały się do Mistrzostw Riot Games pierwszego sezonu. Dokonali tego zaledwie trzy miesiące po założeniu drużyny, co jak na początkujących, stanowiło imponujący wyczyn. Przez cały turniej przegrali tylko dwa mecze na swojej drodze do zwycięstwa. Dzięki temu osiągnięciu Europa zawdzięcza im swój jedyny dotąd mistrzowski tytuł, a codzienni gracze mogą cieszyć się skinami europejskiego zespołu. Ten historyczny triumf to był dopiero początek wielkich sukcesów tej drużyny.</p>\n\n<p>Doskonałą kondycją Fnatic mógł się pochwalić również w trzecim, czwartym i piątym sezonie, podczas których reprezentował Europę na Mistrzostwach Świata. W 2014 roku nie udało im się wejść do fazy eliminacji, lecz w pozostałych latach pokazali prawdziwą klasę. Podczas MŚ w Stanach Zjednoczonych, w 2013 roku, wyszli ze swojej grupy na pierwszym miejscu, z zawrotnym wynikiem 7:1. W ćwierćfinałach podołali ówcześnie najmocniejszej drużynie Ameryki, Cloud9, na ich własnym terenie. Ulegli dopiero w półfinale z Royal Club, lecz nawet wtedy czarno-żółtym udało się zatriumfować w jednej grze przed ostateczną porażką. Podobnym powodzeniem Fnatic mógł się pochwalić podczas MŚ 2015. Kolejny raz zdominowali fazę grupową, jeszcze raz znajdując się na pierwszym miejscu, tym razem z wynikiem 4:2. W ćwierćfinale stoczyli walkę z pierwszorzędnym chińskim zespołem – Edward Gaming. Warto zauważyć, że był to jeden ze zdecydowanych faworytów tego wydarzenia. Zdominowali ich 3 do 0, nie pozostawiając cienia złudzeń co do tego, kto zasłużył na laur. Odpadli dopiero w półfinale w starciu z koreańską potęga. Patrząc na dorobek Fnatic z Mistrzostw Świata, śmiało można stwierdzić, że mało która organizacja na świecie może pochwalić się tak niezmiennie dobrymi wynikami.\n</p>\n<p>\nO osiągnięciach tej drużyny na pomniejszych turniejach można by napisać książkę. Jednak trzeba zwrócić uwagę na bezsprzecznie niepowtarzalne triumfy zespołu Fnatic. To przede wszystkim stała i niezachwiana dominacja w lidze EU LCS. Ekipa czarno-żółtych zawsze była na pierwszym lub drugim miejscu w rozgrywkach League Championship Series. Niezłomność i permanentna obecność Fnatic na szczycie zasługuje na najwyższe uznanie. Oprócz członkostwa graczy najwyższych lotów, ten sukces wynika także z zapewnionego im troskliwego patronatu przez samą organizację. Na początku piątego sezonu do kadry dołączył Luis „Deilor” Sevilla, który wcześniej był profesjonalnym trenerem pokera. Wiele osób uważa, że w dużej mierze to właśnie on stoi za sukcesem czarno-żółtych na MŚ 2015. Pod jego opiekuńczymi skrzydłami Fnatic rozkwitło. W wiosennym sezonie EU LCS 2015 skończyli z wynikiem 13:5, a w letnim pobili światowy rekord i pozostali niepokonani aż do końca.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Responsable d’équipe: Finlay \"Quaye\" Stewart</p>","de_DE":"<p>Als LoL noch in den Kinderschuhen steckte, war Fnatic, der erste Weltmeister in der Geschichte von League of Legends, die Mannschaft, die es zu schlagen galt. Die heutige Mannschaft hat mit der damaligen nichts mehr gemein. Mit einer Mischung aus erfahrenen Spielern wie sOAZ und Rekkles sowie dem Nachwuchsspieler Caps versucht Fnatic, sich neu zu erfinden. Fnatic hat die Rückschläge des vergangenen Jahrs hinter sich gelassen und glaubt, mit der neuen Aufstellung Chancen auf den Titel in der EU LCS zu haben. Die Spieler sind entschlossen und haben das Zeug dazu, als beste Mannschaft in die langjährige Geschichte Fnatics einzugehen.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Mannschaftsleiter: Finlay \"Quaye\" Stewart</p>\n","es_ES":"<p>Hablar sobre Fnatic es hacerlo sobre éxito, dedicación y superación. El conjunto europeo más laureado de la escena tendrá otro año más que empezar de cero y saber renovarse para intentar emular los resultados del año pasado. Algo que se plantea casi imposible por su inmaculada temporada se tendrá que realizar con nuevos jugadores que a pesar de no ser tan desconocidos como los que comenzaron el año pasado presentan mayores dudas.</p>\n\n<p>El palmarés de Fnatic es impresionante. Desde ganar el primer Campeonato Mundial de League of Legends hasta sólo perder una vez los playoffs de la LCS europea en verano de 2014 contra Alliance. La única mancha de la organización es la no presencia en el Campeonato Mundial 2012, así cómo podría considerarse un pequeño bache no pasar de la fase de grupos en el Campeonato Mundial de 2014. Pero, en el resto de ocasiones, la actuación ha sido espectacular.</p>\n\n<p>Hasta el año pasado, Fnatic mantuvo un núcleo que siempre otorgaba las mismas impresiones. Durante la fase regular, probaban cambios y los resultados les dejaron un poquito al margen, pero lo suficiente como para clasificarse y luego arrasar en los playoffs. Un equipo calculador que en todo momento ha sabido aprovechar sus recursos para poder superar las expectativas de los aficionados.</p>\n\n<p>El año pasado la renovación no sólo fue fructífera, sino inesperada. Los chicos de Luis ‘Deilor’ Sevilla fueron capaces de ganar en primavera después de una fase regular con sensaciones encontradas. La actuación en el Mid Season Invitational motivó a pensar que Fnatic podía plantar cara a los mejores equipos del mundo. Verano no dio lugar a dudas, puesto que ganaron todos los partidos disputados en la fase regular y estuvieron a punto de hacerlo también en los playoffs si no fuera porque Origen les plantó cara en la final y les pudo sacar dos partidos. Pero no fue suficiente, y Fnatic de nuevo se llevó el preciado trofeo.</p>\n\n<p>Muchos críticos tenían curiosidad por ver si este, probablemente el mejor equipo europeo desde Moscow 5, conseguiría plantar cara a equipos internacionales. Y a pesar de un mal inicio en la fase de grupos, remontaron con un gran nivel y se clasificaron a cuartos de final. Allí derrotaron a la potencia china con una facilidad pasmosa, pero los coreanos juegan en otra división y KOO Tigers acabó con sus esperanzas en las semifinales.</p>\n\n<p>Después de los mundiales tanto su top, Heo ‘Huni’ Seung-hoon, como su mid, Kim ‘Reignover’ Yeu-jin, anunciaron su intención de marcharse a américa en busca de un reto nuevo. Pero la esencia real se perdía con la marcha de Bora ‘YellOwStaR’ Kim, líder del grupo que también decidió irse con el mismo objetivo. El equipo quedó huérfano después de casi tres años enteros del francés con la organización.</p>\n\n<p>Hay que mirar hacia adelante. Al igual que el año pasado las exigencias sólo eran de clasificarse al mundial y al final el buen trabajo recompensó, esta temporada hay que ser lo suficientemente humildes para poder aspirar a gestas heroicas. El equipo ha demostrado que es capaz de sacar provecho de plantillas como la actual, pero todavía es muy pronto para saber cómo funcionarán internamente y sólo queda disfrutar del progreso del conjunto.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Jefe de equipo: Finlay \"Quaye\" Stewart</p>","pt_BR":"O primeiro campeão mundial da história de League era o time a ser batido nos primeiros anos do cenário competitivo. Hoje, porém, a escalação é totalmente diferente daquela formação original. A nova Fnatic combina talentos coreanos com promessas do cenário europeu e uma base sólida com o suporte YellOwStaR. Eles podem estar se reconstruindo ainda, mas os resultados já são inquestionáveis: recorde de 18V-0D na etapa de verão da LCS EU, e primeiro lugar nas eliminatórias.  ","en_GB":""},"foreignIds":{"drupalId":"68"},"players":[94,98,172,344,1107,1111,1264],"starters":[94,98,172,1107,1111],"subs":[344,1264]},{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]}],"players":[{"id":94,"slug":"soaz","name":"sOAZ","firstName":"Paul","lastName":"Boyer","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/soaz-a3dmvmfk.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:38.000Z","updatedAt":"2017-06-09T10:03:16.000Z","bios":{"en_US":"<p>Paul \"sOAZ\" Boyer is a true esports veteran, with a career going back to 2010. Before signing with Origen he had been a rock in the top lane for Fnatic for over two years, joining the squad in two World Championship runs. After the 2014 Season concluded, Fnatic entered a rebuilding process which saw nearly the entire roster head their separate ways. Following his departure from Fnatic, Origen founder and mid laner Enrique \"xPeke\" Cedeño Martínez courted sOAZ to be the final addition to his new Challenger Series venture. sOAZ jumped at the chance, where he was instrumental in Origen's runs through the Challenger circuit, multiple EU LCS Splits, and even a World Championship appearance.</p>\n\n<p>sOAZ decided to return to Fnatic in 2017 as their starting top laner, after another frustrating split for Origen led to many players searching for greener pastures. He brings tons of experience (and his trusty baguette) back to Fnatic where he’s aiming to add to his long list of professional accolades. sOAZ would tell you that he’s got plenty left in the tank for another shot at Worlds, but he’ll have to fight his way through the regular season first. You shouldn’t worry though, it seems like this is something he’s done before.</p>","fr_FR":"<p>Paul « SoaZ » Boyer est un véritable vétéran de l'e-sport, avec une carrière remontant à 2010. Avant de rejoindre Origen, il s'est démarqué comme top laner chez Fnatic pendant plus de deux ans, participant ainsi à deux Championnats du monde. Après la fin de la saison 2014, Fnatic est entrée dans un processus de reconstruction et presque toute la formation a été démantelée. Après son départ de chez Fnatic, le fondateur d'Origen et mid laner Enrique « xPeke » Cedeño Martínez a courtisé Soaz pour qu'il rejoigne sa nouvelle équipe dans les Challenger Series. Soaz a sauté sur l'occasion et a ainsi joué un rôle important dans le succès d'Origen sur le circuit Challenger, dans plusieurs segments des LCS EU et même lors d'une apparition dans le Championnat du monde.</p>\n\n<p>Soaz a été le seul point positif d'un segment d'été catastrophique pour Origen en 2016. Il a décroché des victoires pour Origen à lui seul et a maintenu la compétitivité de l'équipe quand tout espoir semblait perdu. Ses excellentes performances (et ses fans dévoués) lui ont valu un ticket pour Barcelone pour participer à l'événement All-Stars 2016. Ses années d'expérience compensent ses compétences mécaniques limitées. Si l'Europe espère éviter une élimination anticipée, elle devra compter sur le vétéran robuste (et sur sa baguette) pour la guider à travers l'une des compétitions les plus difficiles de la Faille.</p>","pl_PL":"<p>Paul „SoaZ” Boyer to prawdziwy weteran e-sportu, którego kariera sięga 2010 roku. Przed przejściem do Origen był nie do ruszenia na górnej alei Fnatic przez ponad dwa lata, dołączając do składu w dwóch podejściach do Mistrzostw Świata. Po zakończeniu sezonu 2014 Fnatic rozpoczęli proces przebudowy, w wyniku którego rozeszli się niemal wszyscy gracze z początkowego składu. Po odejściu z Fnatic założyciel i środkowy Origen, Enrique „xPeke” Cedeño Martínez, zabiegał o to, by Soaz stał się ostatnim uzupełnieniem jego nowej drużyny w Challenger Series. Soaz chętnie skorzystał z tej okazji i odegrał kluczową rolę w drodze po zwyciestwo Origen podczas Challenger Circuit, kilku splitach EU LCS, a nawet występie na Mistrzostwach Świata.</p>\n\nSoaz był zapewne jedynym jasnym punktem letniego splitu 2016, o którym Origen woleliby zapomnieć. Samodzielnie prowadził Origen do zwycięstw i utrzymywał ich w konkurencyjnej formie, nawet gdy wydawało się, że wszystko już stracone. Jego świetne występy (oraz oddani fani) zapewniły mu bilet do Barcelony i udział w wydarzeniu All-Star 2016. Niedoskonałości umiejętności mechanicznych nadrabia latami doświadczeń. Jeśli Europa chce uniknąć kolejnej pożałowania godnej porażki, będzie musiała polegać na tym niezłomnym weteranie (i jego bagietce), który poprowadzi drużynę do boju przeciwko kilku z najtwardszych rywali na Summoner’s Rift.\n","de_DE":"<p>Paul „sOAZ“ Boyer ist ein wahrer E-Sport-Veteran, dessen Karriere 2010 begann. Vor seinem Wechsel zu Origen war er über zwei Jahre Fnatics Fels auf der oberen Lane, mit denen er auch an zwei Weltmeisterschaften teilgenommen hat. Nach dem Ende der Saison 2014 wurde Fnatic umstrukturiert und die ehemaligen Mitglieder gingen getrennte Wege. sOAZ wurde von Mid-Laner Enrique „xPeke“ Cedeño Martínez, der nach seinem Abgang von Fnatic Origen gegründet hatte, als letztes Mitglied für sein Abenteuer in der Challenger Series angeworben. Er ergriff die Gelegenheit und wurde zu einem wichtigen Bestandteil von Origens Durchmarsch in der Challenger Series, mehreren Splits in der EU LCS und sogar einer Teilnahme an der Weltmeisterschaft.</p>\n\n<p>Nachdem ein weiterer frustrierender Split dazu geführt hatte, dass viele Spieler Origen verließen, kehrte sOAZ zu Fnatic zurück, um für sie auf der oberen Lane zu spielen. Er kommt mit einer Menge Erfahrung (und seinem treuen Baguette) zu Fnatic zurück und wird versuchen, seine Liste mit Auszeichnungen zu erweitern. sOAZ würde sicher sagen, er habe noch genug Reserven, um bei einer weiteren Weltmeisterschaft mitzuspielen, aber dazu muss er sich erst einmal durch den Frühjahrs-Split kämpfen. Aber keine Angst, das ist nichts, was er nicht schon einmal getan hätte.</p>","es_ES":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella de la calle superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomase caminos separados. Tras abandonar Fnatic, el fundador y mid de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito aspirante, en numerosos split de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un split de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","pt_BR":"<p>Paul \"sOAZ\" Boyer é um verdadeiro veterano dos eSports, com uma carreira que começou em 2010. Antes de entrar para a Origen, ele foi o jogador de topo da Fnatic por mais de dois anos, entrando no esquadrão com duas participações do Mundial nas costas. Após o fim da Temporada 2014, a Fnatic entrou em um processo de reconstrução onde viu quase todos os membros da equipe seguirem caminhos distintos. Após a saída da Fnatic, o fundador da Origen, o jogador Enrique “xPeke” Cedeño Martínez considerou sOAZ para ser a peça final em sua aventura pela Challenger Series. Ele entrou e foi essencial na campanha da Origen pelo torneio, nas várias Etapas da LCS EU e até mesmo em uma aparição no Mundial.</p>\n\n<p>sOAZ foi a única salvação de do que foi uma Etapa de Verão triste para a Origen em 2016. Ele conseguiu praticamente sozinho algumas vitórias para a Origen e os manteve no competitivo, mesmo quando tudo parecia estar perdido. Seu desempenho incrível (e seus fãs) lhe conquistou uma vaga no Evento All-Star 2016 em Barcelona. Quando ele não tem domínio mecânico, sua experiência ajuda. Se a Europa quiser evitar perder rapidamente como no Mundial, eles precisam confiar no veterano para guiá-los na competição implacável de Summoner’s Rift.</p>","cs_CZ":"<p>Paul „SoaZ“ Boyer je skutečným veteránem esportů, jeho kariéra se totiž datuje od roku 2010. Ještě než nastoupil do Origenu, byl přes dva roky v horní lajně oporou Fnaticu, se kterým se zúčastnil dvou mistrovství světa. Po skončení sezóny 2014 však Fnatic prošel restrukturalizací, při které se cesty téměř všech jeho bývalých hráčů rozdělily. Po odchodu z Fnaticu oslovil SoaZe zakladatel a středový lajnař Origenu Enrique „xPeke“ Cedeño Martínez, který jej chtěl jako svůj poslední trumf do týmu, který měl vzít šturmem Challenger Series. SoaZ po této šanci s chutí sáhl a velkou měrou přispěl k úspěchům Origenu v seriálu Challenger, několika splitech evropského LCS a dokonce i na mistrovství světa.</p>\n\n<p>SoaZ byl nejspíš tím jediným, co drželo Origen nad vodou během jinak úděsného letního splitu 2016. Sám se snažil dotáhnout tým k výhrám a udržoval jej při životě, i když už vše vypadalo naprosto beznadějně. Jeho špičkové výkony (a zástupy milujících fanoušků) mu zajistily lístek do Barcelony, kde se zúčastní turnaje All-Star 2016. To, co mu schází v čisté herní mechanice, dohání roky zkušeností. Pokud chce Evropa tentokrát držet krok s ostatními týmy, bude se muset při bojích s těmi nejdrsnějšími soupeři opřít o tohoto veterána (a jeho bagetu).</p>","el_GR":"<p>Ο Paul \"SoaZ\" Boyer είναι ένας πραγματικός βετεράνος των esports που ξεκίνησε την καριέρα του ήδη από το 2010. Πριν υπογράψει στους Origen ήταν η άγκυρα των Fnatic στην επάνω λωρίδα για πάνω από δύο χρόνια και μάλιστα είχε λάβει μέλος με την ομάδα σε δύο Παγκόσμια Πρωταθλήματα. Μετά τη λήξη της Σεζόν 2014, έγιναν μεγάλες ανακατατάξεις στους Fnatic, καθώς όλοι σχεδόν οι παλιοί παίκτες της ομάδας τράβηξαν το δικό τους δρόμο. Όταν αποχώρησε από τους Fnatic, ο ιδρυτής και παίκτης μεσαίας λωρίδας των Origen Enrique \"xPeke\" Cedeño Martínez προσέγγισε τον Soaz για να συμπληρώσει το ρόστερ της νέας του προσπάθειας στο Challenger Series. Ο Soaz δέχτηκε με μεγάλη προθυμία και η παρουσία του ήταν καταλυτική στην πορεία των Origen στο Challenger Circuit, αλλά και σε πολλά Split του LCS Ευρώπης, ακόμα και σε μια μοναδική εμφάνιση στο Παγκόσμιο Πρωτάθλημα.</p>\n\n<p>Ο Soaz ήταν ίσως η μοναδική θετική νότα στην καταστροφική πορεία των Origen στο Summer Split 2016. Οδήγησε μόνος του στην ομάδα σε μια σειρά από νίκες και τους κράτησε σε υψηλό επίπεδο, όταν όλα έδειχναν ότι είχαν χαθεί. Αυτές οι εμφανίσεις του κόντρα στο ρεύμα (αλλά και οι θαυμαστές του που τον λατρεύουν) σφράγισαν το εισιτήριό του για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Μπορεί να μην είναι ο κορυφαίος παίκτης του κόσμου στον χειρισμό, αλλά αναπληρώνει αυτό το κενό με την πολυετή του πείρα. Αν η Ευρώπη θέλει να αποφύγει άλλη μια αποκαρδιωτική εμφάνιση, θα πρέπει να βασιστεί στην αυτοπεποίθηση (αλλά και στις οργανωτικές ικανότητες) αυτού του αξιόπιστου βετεράνου για να βρει τον τρόπο να επιβληθεί στους ισχυρότερους παίκτες του κόσμου.</p>","hu_HU":"Paul „SoaZ” Boyer valódi esport-veterán, akinek karrierje 2010-ben kezdődött. Mielőtt az Origenhez szerződött, a Fnatic megbízható felső ösvényese volt két évig, és kétszer is velük tartott a világbajnokságra. A 2014-es szezon után a Fnatic elkezdte újjáépíteni magát, és szinte az összes játékos szétszéledt. A Fnatic elhagyása után az Origen alapítója és középső ösvényese, Enrique „xPeke” Cedeño Martínez próbálta meggyőzni Soazt, hogy csatlakozzon ötödikként a Kihívók Sorozatát megcélzó csapatával. Soaz azonnal ugrott a lehetőségre, és fontos szerepe volt abban, hogy az Origen jól teljesített a Kihívók Sorozatában, az EU LCS szakaszaiban, valamint hogy kijussanak a világbajnokságra.</p>\n\nSoaz volt az egyetlen, aki víz fölött tartotta az Origent a nagyon rosszul alakuló 2016-os nyári szakasz alatt. A legreménytelenebb helyzetekben szinte egymaga harcolt ki győzelmeket az Origennek. Ezek a teljesítmények és a rajongók odaadó szeretete váltotta meg neki a jegyet Barcelonába, a 2016-os All-Star gálára. A nyers képességek helyett a hosszú évek tapasztalata teszi igazán erőssé. Ha Európa nem szeretne ismét halványan szerepelni, akkor a megbízható veteránra (és az elmaradhatatlan bagettjére) fog támaszkodni, amikor a Szurdok legkeményebb arcaival kell szembenézni.\n","it_IT":"Paul \"Soaz\" Boyer è un vero veterano degli eSport la cui carriera è iniziata nel lontano 2010. Prima di unirsi agli Origen è stato una presenza fissa in corsia superiore con i Fnatic per oltre due anni, durante i quali ha partecipato anche a due Mondiali. Al termine della stagione 2014, i Fnatic hanno subito un processo di ristrutturazione che ha separato quasi tutti i loro membri. Dopo la sua partenza dai Fnatic, il fondatore e centrale degli Origen, Enrique \"xPeke\" Cedeño Martínez, lo ha invitato nella sua squadra come ultimo elemento per prendere d'assalto le Challenger Series. Soaz colse l'occasione al volo e divenne un elemento insostituibile degli Origen nel circuito Challenger, in vari split e persino in un Mondiale.</p>\n\nNel 2016, Soaz è stato probabilmente l'unica nota positiva degli Origen in un Summer Split da dimenticare. Ha guidato da solo gli Origen in ogni vittoria e li ha tenuti a galla anche quando tutto sembrava perduto. Le sue giocate eccellenti (e i suoi devoti fan) gli hanno fatto guadagnare il biglietto per Barcellona e la partecipazione all'All-Star. Le sue lacune nella meccanica sono più che compensate dalla sua grande esperienza. Se l'Europa vuole evitare un'altra brutta sconfitta, farà meglio ad affidarsi a questo robusto veterano (e alla sua baguette) per uscire vincitrice contro gli avversari più temibili della Landa.\n","ro_RO":"Paul ''SoaZ'' Boyer este un adevărat veteran eSports, a cărui carieră începe în 2010. Înainte să semneze cu Origen, a fost un jucător de neclintit pe culoarul de sus al celor de la Fnatic mai bine de doi ani, susținându-i în două parcursuri la Campionatul Mondial. După încheierea sezonului 2014, Fnatic a intrat într-un proces de reconstrucție, în urma căruia aproape întreaga echipă a luat-o pe drumuri separate. După plecarea sa de la Fnatic, fondatorul și jucătorul de pe culoarul din mijloc al Origen, Enrique ''xPeke'' Cedeño Martínez, l-a invitat pe Soaz să se alăture echipei sale în noua ei aventură din Seria Challenger. Soaz a profitat de ocazie și a fost un jucător-cheie în parcursul celor de la Origen în competiția Challenger, în multiplele etape din LCS și chiar într-o apariție la Campionatul Mondial.</p>\n\nSoaz a fost, probabil, sigura parte bună a etapei de vară din 2016, pe care Origen își dorește s-o uite. Prin forțele proprii, i-a condus pe cei din Origen către victorii și i-a menținut în competiție chiar și atunci când toate speranțele lor păreau să se fi năruit. Reușitele sale (și fanii loiali) i-au adus un bilet către Barcelona pentru a participa la evenimentul All-Star 2016. Lipsurile mecanice îi sunt compensate de ani și ani de experiență. Dacă Europa își dorește să evite o altă eliminare dezamăgitoare, va avea nevoie de îndrumarea acestui veteran puternic (și a baghetei sale) împotriva celei mai dificile concurențe din Rift.\n","es_AR":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","es_MX":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>"},"foreignIds":{"drupalId":"76","TRLH3":"200000055","TRLH4":"200000158"},"socialNetworks":{"azubu":"azubu.tv/soaz","facebook":"https://www.facebook.com/fnaticSOAZ?fref=ts","twitter":"https://twitter.com/sOAZIZGOOD"},"champions":[],"liveGameTeam":15},{"id":98,"slug":"rekkles","name":"Rekkles","firstName":"Martin","lastName":"Larsson","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rekkles-gflgilh4.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:40.000Z","updatedAt":"2017-06-09T10:10:40.000Z","bios":{"en_US":"<p>Martin “Rekkles” Larsson is one of the most feared AD carries in the world. Rekkles debuted for Fnatic in late 2012 and immediately garnered attention with his performances at several major tournaments. He also played a key role in unlocking the door to the halls of the immortals for Fnatic, ushering in an unprecedented 18W-0L record in the 2015 EU LCS Summer Split. But after key departures following the 2015 World Championship, Rekkles and Fnatic failed to defend their EU LCS crown in the 2016 Spring Split, falling to the eventual champions G2 Esports en route to a 3rd place finish.Even though the reunion of Rekkles and Yellowstar didn’t produce the results that Fnatic hoped for, Rekkles still performed admirably throughout the 2016 EU LCS Summer Split, accounting for more than a third of his team’s overall damage.</p>\n\n<p>After an exodus of players near the end of 2016, Rekkles stayed on board with Fnatic and helped assemble a new roster filled with crafty veterans and an eager rookie. Rekkles admitted to not performing up to his own standards last year, and the 2017 season is the perfect place to reassert himself as a dominant AD Carry. He’s truly at the helm of the new-look Fnatic and will look to not only guide them, but carry them as well.</p>","fr_FR":"<p>Martin « Rekkles » Larsson compte parmi les carrys AD les plus redoutés du monde. Rekkles a commencé sa carrière chez Fnatic fin 2012 et s'est immédiatement fait remarquer avec d'excellentes performances dans plusieurs tournois majeurs. Il a également aidé Fnatic à entrer dans la légende avec un record inédit de 18 victoires contre 0 défaite lors du segment d'été des LCS EU 2015. Mais après des départs de joueurs déterminants suite au Championnat du monde 2015, Rekkles et Fnatic n'ont pas su défendre leur titre des LCS EU lors du segment de printemps 2016, s'inclinant contre les futurs champions de G2 Esports et finissant ainsi en 3e place.</p>\n\n<p>Même si la réunion entre Rekkles et Yellowstar n'a pas eu l'effet escompté par Fnatic, Rekkles a tout de même joué de façon admirable pendant tout le segment d'été des LCS EU 2016, enregistrant plus d'un tiers des dégâts totaux de l'équipe. Ces chiffres impressionnants ont suffi à lui offrir une place à l'événement All-Stars 2016 de Barcelone, où il affrontera d'autres carrys AD légendaires pour tenter d'arracher l'Europe des ténèbres et de la ramener dans la lumière de l'opinion internationale.</p>","pl_PL":"<p>Jeden z najmłodszych i z tego powodu najbardziej oczekiwanych graczy na scenie esportowej League of Legends. Martin Larsson zaczął grać profesjonalnie w maju 2012 roku, lecz już parę miesięcy później dołączył do jednej z najsławniejszych organizacji – Fnatic. Niestety, ze względu na swój wiek, nie mógł wziąć udziału w EU LCS 2013. Do czasu możliwości pełnoprawnego uczestnictwa w tych rozgrywkach \"Rekkles\" realizował się w innych zespołach. 22 listopada 2013 roku oficjalnie powrócił do szeregów Fnatic i przejął swoje stanowisko AD Carry. Już od swoich wczesnych początków był uważany za jednego z najzdolniejszych mechanicznie graczy.</p>\n<p>Wraz z drużyną Fnatic udało mu się zabłysnąć. Pomijając efektowne występy na pomniejszych turniejach jak IEM, All-Stars czy Dreamhack, to jego największym sukcesem był sezon piąty. Bezpośrednio po jego kolejnym powrocie do czarno-żółtych, razem z nimi pobił światowy rekord – nie przegrał ani jednej gry w letnim sezonie EU LCS 2015. Następnie, podczas kwalifikacji do Mistrzostw Świata 2015 \"Rekkles\" zachwycił widzów swoim pentakillem Tristaną. Po części dzięki jego solidnej grze przeciwko Origenowi, Martin wygrał te rozgrywki. Na MŚ 2015 najbardziej rzucało się w oczy to, że był w stanie konkurować z chińskimi i amerykańskimi oponentami. </p>\n<p>Do osobistych osiągnięć Martina przede wszystkim trzeba zaliczyć wejście do Kręgu Pretendenta w trzech różnych regionach: Europie, Ameryce Północnej i Korei. Udało mu się dotrzeć tak wysoko na pozycji AD Carry, dzięki swoim ulubionym postaciom: Lucianowi, Ezrealowi i Vayne. Wiele osób zastanawiało się, jak uzdolniony sportowiec trafił do świata Runeterry. \"Rekkles\" był utalentowanym piłkarzem, lecz doznał kontuzji nogi. Wtedy po raz pierwszy spróbował gry w League of Legends, w której bardzo szybko świetnie się odnalazł. Podczas zmagań na turniejach inspiracją dla niego był jego ulubiony cytat – „Pudłujesz 100% swoich strzałów, których nigdy nie dokonałeś”. W 2015 roku, w społeczeństwie było bardzo głośno o jego przywiązaniu do innego sławnego AD Carry - Hyuk-kyu’a \"Deft\" Kima. Ich unikatowa znajomość to przykład, że rywalizacja nie zawsze przekreśla przyjaźń.</p>\n","de_DE":"<p>Martin „Rekkles“ Larsson ist einer der gefürchtetsten AD-Carrys der Welt. Rekkles gab sein Debüt für Fnatic Ende 2012 und sorgte mit seinen Leistungen bei mehreren großen Turnieren sofort für Aufsehen. Außerdem spielte er bei Fnatics Einzug in die Halle der Unsterblichen eine entscheidende Rolle, als die Mannschaft den Sommer-Split der EU LCS 2015 mit 18 Siegen ungeschlagen beendete. Als jedoch einige Schlüsselspieler nach der Weltmeisterschaft 2015 die Mannschaft verließen, scheiterten Rekkles und Fnatic im Frühjahrs-Split 2016 am zukünftigen Champion G2 Esports und schafften es nicht, ihre Krone zu verteidigen. Obwohl die Wiedervereinigung von Rekkles und Yellowstar nicht so verlief, wie Fnatic gehofft hatte, lieferte Rekkles im Sommer-Split der EU LCS 2016 eine ansprechende Leistung ab und war für mehr als ein Drittel des gesamten Schadens seiner Mannschaft verantwortlich.</p>\n\n<p>Trotz der Abgänge einiger Spieler Ende 2016 blieb Rekkles Fnatic treu und half mit, aus gewitzten Veteranen und einem eifrigen Nachwuchsspieler eine neue Mannschaft zu formen. Rekkles hat zugegeben, letztes Jahr nicht zu seiner Form gefunden zu haben. Der Frühjahrs-Split der EU LCS 2017 ist für ihn die perfekte Gelegenheit, sich wieder als dominanter AD-Carry zu etablieren. Er ist die Speerspitze des neuen Fnatics und wird nicht nur versuchen, seine Mannschaft zu leiten, sondern auch, sie von einem Sieg zum nächsten zu führen.</p>","es_ES":"<p>Martin \"Rekkles\" Larsson es uno de los AD carry más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el split de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el split de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del split de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros AD carry legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","pt_BR":"<p>Martin “Rekkles” Larsson é um dos atiradores mais temidos do mundo. Rekkles estreou na Fnatic no fim de 2012 e logo ganhou atenção com seu desempenho em vários grandes torneios. Ele também teve um papel fundamental para imortalizar a Fnatic, ajudando no recorde de 18 vitórias e nenhuma derrota na Etapa de Verão 2015 da LCS EU. Porém, após alguns desfalques depois do Campeonato Mundial 2015, Rekkles e a Fnatic falharam em defender a coroa da LCS EU na Etapa de Primavera 2016, perdendo para a campeã G2 Esports e terminando em terceiro lugar.</p>\n\n<p>Apesar da reunião de Rekkles e YellOwStaR não produzir os resultados que a Fnatic esperava, Rekkles ainda teve um desempenho admirável durante toda a Etapa de Verão 2016 da LCS EU, sendo o responsável por mais de um terço do dano de sua equipe. Os números impressionantes foram suficientes para levá-lo a ser o Atirador mais votado da Europa no Evento All-Star 2016, onde ele batalhará contra outros atiradores lendários e vai tentar tirar a Europa do escuro para colocá-la de volta no cenário internacional.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Martin “Rekkles” Larsson는 세계에서 가장 두려운 원거리 딜러 중 하나입니다. Fnatic 소속으로 2012년 후반에 데뷔하자마자 IPL5에서 준우승하는 등 여러 주요 대회에서 엄청난 활약을 하며 주목을 받았습니다. 하지만 e스포츠에서 성공하려면 단순한 개인 기량뿐 아니라 인간 관계가 중요하다는 것 또한 잘 알고 있는 것이 Rekkles 선수입니다. 모델처럼 매력적인 외모와 무서운 파밍 능력을 함께 갖춘 Rekkles는 그런 면에서 완벽한 선수라고 할 수 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Fnatic이 유례없는 18승 무패로 2015 유럽 LCS 서머 스플릿을 마치는 대기록을 세우는 데에도 Rekkles의 역할이 핵심적이었습니다. 어떻게 그게 가능했을까요? 항상 노력하는 Rekkles 선수와, YellOwStaR 선수의 적절한 서포팅, 어느 한쪽으로 치우치지 않는 킬과 어시스트, 그리고 나서 엄청난 CS 수급력이 합쳐졌기 때문이죠. 실제로 2015 유럽 LCS 서머 스플릿에서 KDA 순위 1, 2위를 Fnatic의 봇 라인 선수 두 명이 합계 27을 기록하며 독점해 버렸습니다. </p>\n<p style=”font-family:”나눔고딕”;\">물론 그렇게 킬을 올렸어도 Isaac \"PePiiNeRo\" Flores 선수의 분노를 피해갈 순 없었죠. 유감입니다. </p>\n","cs_CZ":"<p>Martin „Rekkles“ Larsson je jedním z nejobávanějších ADC na světě. Debutoval koncem roku 2012 v řadách Fnaticu a okamžitě vzbudil pozornost svými výkony na několika významných turnajích. Sehrál také klíčovou roli při uvedení Fnaticu do historie, když jeho tým během letního splitu evropského LCS 2015 dosáhl do té doby nevídané bilance výher 18:0. Ovšem poté, co po mistrovství světa 2015 z celku odešlo několik důležitých členů, Rekkles a Fnatic v jarním splitu EU LCS 2016 už titul neobhájili, podlehli budoucím šampionům z G2 Esports a skončili na 3. místě.</p>\n\n<p>Ačkoliv opětovné shledání Rekklese a Yellowstara nemělo takové výsledky, v jaké Fnatic doufali, podával Rekkles po celou dobu letního splitu EU LCS 2016 působivé výkony a připsal si na konto více než třetinu celkového poškození, jež jeho tým uštědřil. Tato ohromující čísla stačila, aby vyhrál hlasování k turnaji All-Star 2016 v Barceloně, kde se střetne s ostatními legendárními ADC a pokusí se vyvést Evropu z temnoty zpět na světlo mezinárodní slávy.</p>","el_GR":"<p>Ο Martin “Rekkles” Larsson είναι ένας από τους πιο επικίνδυνους AD Carry στον κόσμο. Ο Rekkles έκανε την πρώτη του εμφάνιση με τους Fnatic στα τέλη του 2012 και έστρεψε αμέσως επάνω του τα φώτα της δημοσιότητας με τις εκπληκτικές του εμφανίσεις σε πολλά σημαντικά τουρνουά. Επίσης, έπαιξε σημαντικό ρόλο σε ορισμένα από τα μεγαλύτερα ρεκόρ που έχουν πετύχει οι Fnatic, όπως το ανεπανάληπτο σερί 18 νικών και 0 ηττών Summer Split 2015 του LCS Ευρώπης. Όμως, μετά το Παγκόσμιο Πρωτάθλημα 2015 υπήρξαν ορισμένες πολύ σημαντικές αποχωρήσεις από την ομάδα, με αποτέλεσμα ο Rekkles και οι Fnatic να μην μπορέσουν να υπερασπιστούν τον τίτλο τους στο Spring Split 2016 του LCS Ευρώπης. Γνώρισαν την ήττα από τους G2 Esports, οι οποίοι θα έπαιρναν στη συνέχεια τον τίτλο, και περιορίστηκαν στην 3η θέση.</p>\n\n<p>Παρόλο που η επανένωση του Rekkles και του Yellowstar δεν είχε τα αποτελέσματα που έλπιζαν οι Fnatic, ο Rekkles είχε μια πολύ καλή παρουσία στο Summer Split 2016 του LCS Ευρώπης, καθώς έκανε μόνος του τουλάχιστον το ένα τρίτο της συνολικής ζημιάς της ομάδας. Χάρη στα εντυπωσιακά του στατιστικά, συγκέντρωσε αρκετές ψήφους για να βρεθεί κι αυτός στο Τουρνουά All-Star 2016 στη Βαρκελώνη, όπου θα αναμετρηθεί με άλλους θρυλικούς AD Carry στην προσπάθειά του να φέρει και πάλι την Ευρώπη στο διεθνές προσκήνιο.</p>","hu_HU":"<p>Martin „Rekkles” Larsson a világ egyik legrettegettebb lövésze. Rekkles a Fnaticben kezdte a karrierjét 2012 végén, és hamar felhívta magára a figyelmet a nagy versenyeken nyújtott teljesítményével. Fontos szerepe volt abban is, hogy a Fnatic bekerüljön a halhatatlanok csarnokába, akikkel addig példátlan 18 meccses, veretlen győzelmi sorozatot értek el az EU LCS 2015-ös nyári szakaszában. A csapat fontos embereket veszített el a 2015-ös világbajnokság után, ezért Rekkles és a Fnatic nem tudta megvédeni címét az EU LCS 2016-os tavaszi szakaszában, és végül 3. helyen végzett, valamint kikapott a szakaszt megnyerő G2 Esportstól.</p>\n\nRekkles és Yellowstar jelenléte nem hozta az eredményeket, amelyeket a Fnatic várt, de Rekkles remekül játszott az EU LCS 2016-os nyári szakasza során, a csapat összesített sebzésének több mint harmadát ő okozta. Már csak emiatt is ott a helye a 2016-os All-Star gálán Barcelonában, ahol legendás lövészekkel kell megküzdenie, hogy kiássa Európát a gödörből.\n","it_IT":"<p>Martin \"Rekkles\" Larsson è uno degli ADC più temuti al mondo. Ha debuttato nel tardo 2012 con i Fnatic e ha subito attirato l'attenzione con le sue eccellenti giocate in molti tornei internazionali. È stato anche fondamentale per far entrare i Fnatic nell'olimpo degli immortali con un record mai visto di 18 vittorie e nessuna sconfitta nel Summer Split 2015 della LCS EU. Tuttavia, dopo i grandi abbandoni a seguito dei Mondiali 2015, Rekkles e i Fnatic non sono riusciti a difendere la corona nello Spring Split 2016, inchinandosi davanti ai nuovi campioni, i G2 Esports, e concludendo la stagione al terzo posto.</p>\n\nNonostante la reunion di Rekkles e Yellowstar non abbia prodotto i risultati che i Fnatic speravano, Rekkles si è comunque comportato egregiamente durante il Summer Split 2016 della LCS EU, infliggendo più di un terzo dei danni totali della sua squadra. Queste cifre impressionanti sono state sufficienti a fargli guadagnare i voti necessari a partecipare all'All-Star 2016 di Barcellona, dove si scontrerà con altri ADC leggendari cercando di traghettare l'Europa fuori dalla sua striscia negativa e donarle un nuovo successo internazionale.\n","ro_RO":"<p>Martin ''Rekkles'' Larsson este unul dintre cei mai de temut AD carry din lume. Rekkles a debutat alături de Fnatic la finalul anului 2012 și a atras imediat atenția publicului cu reușitele sale în cadrul câtorva turnee importante. În plus, a jucat un rol important în echipă, ajutându-i pe cei de la Fnatic să intre în istoria LoL și obținând un record fără precedent de 18 victorii și 0 înfrângeri în etapa de vară a LCS EU 2015. Dar în urma plecării unor jucători cheie imediat după Campionatul Mondial 2015, Rekkles și Fnatic nu au reușit să-și apere titlul din LCS EU în etapa de primăvară din 2016, terminând pe locul al treilea ca urmare a unei înfrângeri în fața viitorilor campioni, G2 Esports.</p>\n\nChiar dacă reuniunea lui Rekkles cu Yellowstar nu a adus rezultatele pe care și le-au dorit cei de la Fnatic, Rekkles s-a descurcat admirabil pe parcursul etapei de vară a LCS EU 2016, însumând mai bine de o treime din daunele totale ale echipei sale. Statisticile impresionante i-au adus voturile fanilor și calificarea la evenimentul All-Star 2016 din Barcelona, unde se va înfrunta cu alți AD Carry legendari. Acolo va lupta pentru a pune capăt seriei de nereușite ale Europei la turneele internaționale.\n","en_PL":"<p>Martin „Rekkles” Larsson jest jednym z budzących największy lęk prowadzących na świecie. Rekkles zadebiutował we Fnatic pod koniec 2012 roku i natychmiast zwrócił na siebie uwagę występami na kilku większych turniejach. Odegrał także kluczową rolę w zdobyciu miejsca pośród nieśmiertelnych sław dla Fnatic, osiągając bezprecedensowy wynik 18 zwycięstw przy 0 przegranych podczas letniego splitu EU LCS 2015. Ale gdy po Mistrzostwach Świata 2015 odeszło kilku ważnych zawodników, Rekkles i Fnatic nie zdołali obronić tytułu EU LCS podczas wiosennego splitu 2016, ulegając późniejszym mistrzom, G2 Esports i kończąc na trzecim miejscu.</p>\n\nChociaż ponowne zejście się Rekklesa i Yellowstara nie zapewniło rezultatów, których oczekiwali Fnatic, Rekkles wciąż znakomicie prezentował się w toku letniego splitu EU LCS 2016, zaliczając na swoje konto ponad jedną trzecią ogółu obrażeń zadanych przez drużynę. Te imponujące statystyki wystarczyły, by został wybrany w głosowaniu do uczestnictwa w wydarzeniu All-Star 2016 w Barcelonie, dokąd pojedzie zmierzyć się z innymi legendarnymi prowadzącymi i będzie toczył pojedynki, których stawką jest wyciągnięcie Europy z mroku zapomnienia w światło międzynarodowego uznania.\n","es_AR":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","es_MX":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>"},"foreignIds":{"drupalId":"1140","TRLH3":"200000058","TRLH4":"200000161"},"socialNetworks":{"twitch":"www.twitch.tv/Rekkles","facebook":"www.facebook.com/Rekkles1?fref=ts","twitter":"https://twitter.com/RekklesLoL"},"champions":[],"liveGameTeam":15},{"id":172,"slug":"jesiz","name":"Jesiz","firstName":"Jesse","lastName":"Le","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jesiz-dsbaxff3.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-06-09T10:12:41.000Z","bios":{"en_US":"<p>Jessie “Jesiz” Le has been on the professional scene since 2013, playing for teams like Coast, Gamers2, and Dignitas. He took a break from professional play in order to become the assistant coach for Immortals in 2016. He ended up trying out for Fnatic at the end of the year and they invited him to become their starting support.</p>\n\n<p>Jesiz is a flexible player that is now playing the third different role of his professional career. After playing as both a mid laner and AD Carry, he made yet another role swap in order to fill Fnatic’s support vacancy. More than anything Fnatic is searching for some continuity at the support position after recent times have been filled with ups and downs. Jesiz certainly brings a wealth of experience with him, but will it turn into wins? Only time will tell.</p>","de_DE":"<p>Jessie „Jesiz“ Le ist bereits seit 2013 fixer Bestandteil der professionellen E-Sport-Szene und hat schon für Mannschaften wie Coast, Gamers2 oder Dignitas gespielt. 2016 nahm er sich jedoch eine Auszeit, um der Co-Trainer der Immortals zu werden. Am Ende des Jahres bewarb er sich dann bei Fnatic und wurde zum Supporter der Mannschaft.\n\nJesiz ist ein flexibler Spieler, der im Verlauf seiner Karriere bereits auf zwei anderen Positionen gespielt hat. Nachdem er bereits als Mid-Laner und AD-Carry gespielt hatte, wechselte er erneut die Rolle, um Fnatics Suche nach einem Supporter zu beenden. Nach den Höhen und Tiefen der letzten beiden Splits braucht Fnatic nichts dringender, als eine gewisse Kontinuität auf der Supporter-Position. Jesiz kann auf einiges an Erfahrung zurückgreifen, aber wird sich das auch in Siegen widerspiegeln? Wir werden es sehen …</p>"},"foreignIds":{"drupalId":"1126","TRLH3":"200000059","TRLH4":"200000162"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":344,"slug":"xyraz","name":"Xyraz","firstName":"Gustav","lastName":"Blomkvist","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xyraz-24ixeasw.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-05-31T21:08:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3684","TRLH3":"200000300","TRLH4":"200000400"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1264,"slug":"special","name":"Special","firstName":"Joran","lastName":"Scheffer","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/special-69mtzco4.png","hometown":"EU","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:15:34.000Z","updatedAt":"2016-07-30T04:57:42.000Z","bios":{},"foreignIds":{"TRLH3":"1001310008","TRLH4":"1001270008","TRLH2":"1001250047","FRA1TMNT2":"25217"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AVIUlUQbJTrHluSI14Jw","content":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:match:1c0b8175-974e-4f08-bccb-d03fd43c2d9d","scheduledTime":"2016-03-18T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:bracket:47deb68d-7d32-49b5-9f6a-490ccf9dfee6"},"match":"1c0b8175-974e-4f08-bccb-d03fd43c2d9d","tournament":"33651c33-83f7-48f1-8e2f-9f5a5f641989","bracket":"47deb68d-7d32-49b5-9f6a-490ccf9dfee6","league":"3"}],"gameIdMappings":[{"id":"86e8960d-3b6c-4036-ac38-3c5e3a06e42d","gameHash":"6d3a8913578c2544"}],"videos":[],"htmlBlocks":[],"match":{"id":"1c0b8175-974e-4f08-bccb-d03fd43c2d9d","name":"OG-vs-FNC","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02bcb0f4-478c-4682-91b2-1bde2c3d26da"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"games":{"86e8960d-3b6c-4036-ac38-3c5e3a06e42d":{"id":"86e8960d-3b6c-4036-ac38-3c5e3a06e42d","name":"G1","generatedName":"FNC|OG|G1|1c0b8175974e4f08bccb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02bcb0f4-478c-4682-91b2-1bde2c3d26da"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"standings":{"result":[[{"roster":"02bcb0f4-478c-4682-91b2-1bde2c3d26da"}],[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}]],"timestamp":1458330511876,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001580106","gameRealm":"TRLH3","platformId":"TRLH3:1001580106","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"02bcb0f4-478c-4682-91b2-1bde2c3d26da"}],[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}]],"timestamp":1458330511876,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}