{"teams":[{"id":94,"slug":"longzhu-incredible-miracle","name":"Longzhu Gaming","guid":"be6e1699-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/longzhu-incredible-miracle-2xpijv2d.png","acronym":"LZ","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-26T23:53:11.000Z","bios":{"en_US":"<p>Longzhu Gaming is looking to take the next step in 2017. Formerly Incredible Miracle, Longzhu Gaming failed to mesh in 2016 despite signing many high-profile free agents. While the team avoided relegations, Longzhu missed out on the playoffs in both the spring and summer. With a strong new bot lane duo, Longzhu hopes to earn a spot in the playoffs and more in 2017.</p>"},"foreignIds":{"drupalId":"889"},"players":[313,770,1027,1041,1905,1906,1907,1908,1909],"starters":[313,770,1027,1906,1907],"subs":[1041,1905,1908,1909]},{"id":108,"slug":"koo-tigers","name":"ROX Tigers","guid":"be6e3e07-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/koo-tigers-5xgsd4td.png","acronym":"ROX","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:04.000Z","bios":{"en_US":"<p>The ROX Tigers are ferocious in their pursuit of victory. The team formerly known as the KOO Tigers formed in 2014 and quickly evolved into one of the LCK’s elite predators. While they maintained a spot among the best, SK Telecom T1 seemed to have their number. Their fortunes turned in Champions Summer 2016, when they finally claimed their first title and stepped out of the shadow of Faker and company.</p>\n\n<p>Their triumph was short lived. When ROX met SKT again in the semifinals at the 2016 World Championship, ROX lost a close series to their rivals. After a huge roster shakeup that saw many fan favorites depart, ROX heads into 2017 looking to forge a new path to the top of the food chain.</p>","fr_FR":"KOO Tigers (précédemment GE Tigers) s'est formée en 2014, récupérant des joueurs chez NaJin Sword, NaJin Shield et Incredible Miracle. KOO, malgré cette composition éclectique, a vite su trouver l'unité requise pour combattre. Koo a obtenu la 2e place lors du Segment de printemps des LCK 2015 et a grimpé jusqu'aux demi-finales du Championnat du monde IEM Saison IX dans l'année qui a suivi sa formation.","pl_PL":"KOO Tigers (wcześniej znane jako GE Tigers) zostało utworzone w 2014 roku, zbierając graczy z NaJin Sword, NaJin Shield i Incredible Miracle. KOO szybko stało się zgraną drużyną, mimo że dla obserwatorów z zewnątrz mogło wyglądać nieco jak stwór Frankensteina. KOO zajęło 2. miejsce podczas wiosennego split LCK 2015 i dotarło do półfinałów mistrzostw świata sezonu dziewiątego IEM w ciągu roku od utworzenia.","de_DE":"<p>Dir ROX Tigers (ehemals KOO Tigers) wurden 2014 mit Spielern von NaJin Sword, NaJin Shield und Incredible Miracle gegründet. ROX verschmolz schnell zu einer eingeschworenen Einheit, obwohl die Mannschaft für Außenstehende wie eine von Frankensteins Kreationen aussah. Obwohl ROX eine der stärksten Mannschaften in der LCK war, schnappte SK Telecom T1 ihnen jeden Erfolg vor der Nase weg. Doch 2016 wendete sich das Blatt zugunsten der Tigers, als sie ihren ersten Split in der LCK gewannen und endlich aus dem Schatten von Faker und dessen Kameraden treten konnten. ROX hat zwar gerade erst den ersten Titel in der LCK gewonnen, aber jetzt richten sie ihre Augen auf das ultimative Ziel: Die Trophäe der Weltmeisterschaft 2016.</p>","es_ES":"<p>ROX Tigers (anteriormente llamado KOO Tigers) es un equipo formado en 2014 a partir de los jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se convirtió enseguida en una unidad de batalla, aunque pareciese un equipo Frankenstein para quien lo viese desde fuera. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapársele de las manos, pues SK Telecom T1 se la arrebataba una y otra vez. La suerte de los Tigers cambió en 2016 cuando finalmente consiguieron ganar su primer split de la LCK, lo que les hizo salir de la sombra de Faker y compañía. Puede que ROX haya conseguido su primer título de la LCK, pero ahora tiene la mirada puesta en su objetivo definitivo: el trofeo del Campeonato Mundial 2016.</p>","pt_BR":"A ROX Tigers (antiga KOO Tigers) foi formada em 2014, trazendo jogadores da NaJin Sword, NaJin Shield e Incredible Miracle. Mas a ROX rapidamente se integrou formando uma única unidade de combate, mesmo com muitos dizendo que essa equipe seria um frankenstein.  Apesar de ser uma das equipes mais fortes da LCK, a vitória parecia evitá-los constantemente toda vez que se encontravam com a SK Telecom T1. Mas a sorte da Tiger mudou em 2016 quando finalmente conseguiram ganhar sua primeira Etapa da LCK, saindo assim das sombras de Faker e companhia. A ROX pode ter conseguido levar para a casa seu primeiro título da LCK, mas agora eles estão de olho em um prêmio muito maior: o troféu do Campeonato Mundial 2016.","ko_KR":"<p>ROX Tigers(전 KOO/GE Tigers)는 2014년에 NaJin Sword, NaJin Shield, Incredible Miracle 출신 선수들을 모아 창단한 팀입니다. 언뜻 보기에는 마구잡이로 선수들을 한 팀에 모아놓은 듯했지만 창단 후 얼마 되지 않아 가공할 만한 모습을 보이기 시작했죠. </p>\n<p>창단 후 채 1년도 지나지 않은 시점에서 2015 LCK 스프링에서 2위에 올랐고 IEM 시즌 IX 월드 챔피언십에서는 준결승까지 진출했을 정도니까요. 뒤이어 2015 월드 챔피언십에서는 당당히 2위에 오르며 세계 최강팀 중 하나로 자리매김했습니다. 2016 스프링 정규 시즌에서는 16승 2패로 1위를 했지만, 플레이오프 결승에서 SKT T1에 3대1로 패하면서 아쉽게 2016 스프링 시즌에 우승하지는 못하였습니다.</p>\n","es_AR":"<p>ROX Tigers (anteriormente conocidos como KOO Tigers) se formó en el 2014 con jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se armó como una unidad de lucha, aún cuando los ojos ajenos miraban al equipo como apenas un rejunte de miembros. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapárseles siempre, ya que SK Telecom T1 les bloqueaba el paso en todas las oportunidades. La suerte de los Tigers cambió en el 2016, cuando finalmente ganaron su primer torneo de la LCK, lo que les permitió salir de la sombra de Faker y compañía. ROX se adjudicó su primer título de LCK, pero ahora su foco está en el objetivo principal: el trofeo del Campeonato Mundial 2016.</p>\n\n<p><strong>Entrenador: Kim \"Ssong\" Sang-su</strong></p>"},"foreignIds":{"drupalId":"3641"},"players":[572,742,1044,1045,1231,1270,2049],"starters":[572,1044,1045,1231,2049],"subs":[742,1270]}],"players":[{"id":313,"slug":"gorilla","name":"Gorilla","firstName":"Beomhyun","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gorilla-44p51bn8.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-09-16T21:53:45.000Z","updatedAt":"2017-05-31T00:39:21.000Z","bios":{"en_US":"<p>\nBeomhyun \"Gorilla\" Kang rose over the years to become one of the best supports in Korea. Known for his Thresh and Janna plays, Gorilla is a master of manipulating the battlefield through vision and careful engagement. From saving Pray when he plays too aggressively to picking off opponents with hooks and stuns, Gorilla has played a key role in ROX's rise in the LCK standings.\n</p>\n<p>\nEven though Gorilla secured his first LCK trophy in the 2016 LCK Summer Split, he often found himself in the wrong places at the wrong times. For a player as storied as Gorilla, these types of mistakes were something nobody expected to see. After heartbreak at the 2016 World Championship, Gorilla will take his talents to Longzhu Gaming in 2017 and try another shot at a Worlds title.\n</p>","fr_FR":"<p>Beom-Hyeon « Gorilla » Kang est devenu au fil des ans un des meilleurs supports de Corée. Connu pour sa virtuosité avec Thresh et Janna, Gorilla sait comme personne manipuler le champ de bataille grâce a sa maîtrise de la vision et des engagements raisonnés. Sauvant PraY quand il joue trop agressivement ou s'abattant sur l'ennemi avec des grappins ou des étourdissements, Gorilla a joué un rôle clé dans l'ascension de KOO au sein des LCK.\n</p>\n<p>\nEn gros, si vous vous considérez comme le digne héritier des carrys AD enflammés façon WildTurtle, n'oubliez pas de recruter Gorilla pour vous sortir du pétrin. Aidez-nous, Beom-Hyeon Gorilla. Vous êtes notre seul espoir.\n</p>","pl_PL":"<p>Przez lata Beom-Hyeon „Gorilla” Kang zdobył pozycję jednego z najlepszych graczy w Korei. Znany z doskonałej gry Threshem i Janną, jest prawdziwym mistrzem manipulacji na polu walki za sprawą skutecznego wykorzystania wizji i niezwykłej ostrożności. Gorilla pomógł KOO zdobyć sukces w ramach LCK – a to ratował PraYa, gdy ten grał zbyt agresywnie, a to załatwiał przeciwników, posługując się hakami i ogłuszeniem.\n</p>\n<p>\nJeśli uznajesz się za duchowego spadkobiercę żywiołowego stylu gry WildTurtle'a, postaraj się mieć gdzieś pod ręką Gorillę, żeby w razie czego ocalił ci skórę. Pomóż nam, Beom-Hyeon Gorilla. Jesteś naszą jedyną nadzieją.\n</p>","de_DE":"<p>Beom-hyeon „GorillA“ Kang entwickelte sich über die Jahre zu einem der besten Supporter Koreas. GorillA, der vor allem für seine Spielzüge mit Thresh und Janna bekannt ist, ist ein Meister in Sachen Übersicht auf dem Schlachtfeld und wenn es um vorsichtiges Initiieren geht. GorillA rettete PraY, wenn dieser zu aggressiv spielte, oder schnappte sich Gegner mit gezielten Einsätzen seines Hakens oder Betäubungen und spielte somit eine Schlüsselrolle bei ROX’ Aufstieg in der LCK.</p>\n\n<p>Obwohl sich GorillA beim Sommer-Split der LCK 2016 seinen ersten Titel sichern konnte, war er oft zur falschen Zeit am falschen Ort. Niemand hatte erwartet, dass ein so guter Spieler wie GorillA solche Fehler machen würde. Während die Weltmeisterschaft 2016 näher rückt, muss GorillA wieder zu seiner alten Hochform zurückfinden, wenn er dieses Jahr mit einer letzten – und wichtigsten – Trophäe krönen will.</p>","es_ES":"<p>Beom-Hyeon ''GorillA'' Kang se ha convertido en uno de los mejores apoyos en Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro de la manipulación del campo de batalla gracias a la visión y a su cautela al iniciar combates. El papel de GorillA ha sido clave en el ascenso de ROX en la LCK, desde salvar a PraY cuando es demasiado agresivo hasta aislar oponentes con ganchos y aturdimientos.</p>\n\n<p>Aunque GorillA se aseguró su primer trofeo de la LCK en el split de verano de 2016, con demasiada frecuencia estaba en el lugar equivocado en el momento equivocado. Ese tipo de errores son algo que no se espera de jugadores con tanta experiencia como GorillA. Conforme se acerca el Campeonato Mundial 2016, GorillA tendrá que mejorar sus jugadas y volver a adaptarlas a sus habituales estándares astronómicamente altos si quiere llegar este año a la final y, lo que es más importante, llevarse el trofeo.</p>","pt_BR":"<p>Beom-hyeon \"Gorilla\" Kang cresceu bastante nesses últimos anos até se tornar um dos melhores suportes da Coreia. Conhecido por suas jogadas com Thresh e Janna, Gorilla é um mestre em manipular o campo de batalha através de visão e confrontos bem pensados. Desde salvar a PraY quando ele joga agressivo demais a apanhar seus adversários com correntes e atordoamentos, Gorilla teve um papel essencial na ascensão da ROX no cenário da LCK.</p>\n\n<p>Apesar de Gorilla ter conseguido garantir seu primeiro troféu da LCK na Etapa de Verão da LCK 2016, ele frequentemente se encontra nos lugares errados e nas horas erradas. Para um jogador tão experiente como Gorilla, esses tipos de erros são coisas que ninguém espera ver. Conforme o Campeonato Mundial 2016 se aproxima, Gorilla terá que calibrar suas jogadas de volta a seus padrões astronomicamente altos se quiser fechar este ano com o mais importante troféu de todos.</p>","es_AR":"<p>Beom-hyeon «GorillA\" Kang fue creciendo con los años hasta llegar a convertirse en uno de los mejores soportes de Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro a la hora de manipular el campo de batalla gracias a su visión y su cuidadoso estilo de combate. Pasa de salvar a PraY cuando se torna demasiado agresivo a aniquilar a sus rivales con ganchos y aturdimientos, por lo que su rol fue clave para el ascenso de posiciones de ROX en la clasificación de la LCK.</p>\n\n<p>Aunque GorillA se garantizó su primer trofeo de LCK en el torneo de clausura de la LCK 2016, varias veces se ha visto en el lugar equivocado en los momentos más inoportunos. Para un jugador con la historia de GorillA, estos tipos de errores fueron algo que nadie esperaba ver. Con el Campeonato Mundial 2016 aproximándose, GorillA deberá llevar su juego de vuelta a los niveles astronómicamente altos para poder coronar su año con el último (y más importante) trofeo.</p>"},"foreignIds":{"drupalId":"894","ESPORTSTMNT06":"200000372"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":572,"slug":"sangyoon","name":"Sangyoon","firstName":"Sangyun","lastName":"Kwon","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sangyoon-7zedseul.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:53:57.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4334","ESPORTSTMNT06":"200000376"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":742,"slug":"shy","name":"Shy","firstName":"Sangmyeon","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shy-flf80pma.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-31T00:47:21.000Z","bios":{"en_US":"<p>CJ Entus top lane player Sang-myeon \"Shy\" Park is one of the longest tenured professional League of Legends players in Korea. The 24 year old has been competing at the highest level since 2012 when he joined MiG Frost. Shy was at the forefront of CJ Entus’ golden age as an organization, when both CJ Entus Frost and sister team CJ Entus Blaze made the OGN Champions Finals with regularity. \n</p>\n<p>\nWhile sometimes timid off the Rift, Shy is quick with a smile, and quicker with a carry. Shy will need to lend all of his veteran experience to his teammates if they are going to succeed on the new ROX Tigers roster. But don’t count him out yet. Sometimes it’s the old dogs that have the biggest bite.\n</p>","fr_FR":"<p>Sur la voie du haut, CJ Entus dispose de Sang-myeon « Shy », l'un des vétérans les plus aguerris de la scène professionnelle coréenne. À 24 ans, il joue au plus haut niveau depuis 2012, époque à laquelle il a rejoint MiG Frost. Shy était aux avant-postes pendant l'âge d'or de CJ Entus en tant qu'organisation, c'est-à-dire lorsque les équipes sœurs CJ Entus Frost et CJ Entus Blaze terminaient régulièrement en finale d'OGN Champions. \n</p>\n<p>\nQuoiqu'il soit parfois timide en dehors de la Faille, Shy se rattrape avec un carry. Shy devra apporter toute son expérience de vétéran à ses coéquipiers s'ils entendent reprendre le flambeau de CJ lorsque le groupe était à son sommet. Ne l'oubliez pas trop vite. Le vieux lion a toujours un mot à dire face aux jeunes loups.\n</p>","pl_PL":"<p>Górny gracz CJ Entus, Sang-myeon „Shy” Park jest jednym z najbardziej doświadczonych profesjonalnych graczy w LoLa w Korei. Ten 24-latek grał na najwyższym poziomie od 2012 roku, kiedy dołączył do MiG Frost. Shy był kluczowym elementem złotej ery CJ Entus, kiedy zarówno CJ Entus Frost i siostrzana drużyna, CJ Entus Blaze regularnie docierały do finałów OGN Champions. \n</p>\n<p>\nChociaż niektórzy są nieśmiali poza Rift, Shy jest zawsze skory do uśmiechu i grania prowadzącym. Jeśli jego drużyna chce doprowadzić do kolejnej złotej ery CJ, musi podzielić się z nią całym swoim doświadczeniem. Nie należy go jednak ignorować. Czasem nawet skamieliny potrafią być groźne.\n</p>"},"foreignIds":{"drupalId":"371","ESPORTSTMNT06":"200000373"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":770,"slug":"pray","name":"Pray","firstName":"Jong In","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pray-dqs5qv2u.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-06-08T17:30:10.000Z","bios":{"en_US":"<p>Jong In \"Pray\" Kim is considered one of the best AD carries in Korea. Pray initially signed with Najin Black Sword in 2012, and he led the team to 1st place in the 2012-2013 OGN Champions Winter competition. Known for his Ezreal and Twitch mechanics, Pray demonstrated just how effective an aggressive AD carry could be in the Korean meta (hint: it was really effective).</p>\n\n\n<p>After a short personal break in 2014, Pray returned to esports when he joined the newly created ROX Tigers (previously KOO Tigers). His impact was immediate as the team rocketed to the 2015 World Championship Finals in their first year of existence. PraY and ROX followed that effort up with a second place finish in the 2016 LCK Spring Split and soon after in the 2016 LCK Summer Split, PraY took home his first LCK trophy. After finally finding domestic success, Pray found himself facing off with SK Telecom T1 at Worlds, and based on history, you can guess how that went. He’ll attempt to put another bitter loss to SKT behind him with a new team in 2017.</p>","fr_FR":"<p>Jong-in « PraY » Kim est considéré comme l'un des meilleurs carrys AD de Corée. À l'origine, PraY a signé avec NaJin Black Sword en 2012 et a conduit son équipe à la première place lors du tournoi OGN Champions Winter 2012-2013. Connu pour sa maîtrise d'Ezreal et de Twitch, PraY a démontré à quel point un carry AD agressif pouvait être efficace dans la méta coréenne. (spoiler : à un très haut point)</p>\n\n<p>Après une courte pause personnelle en 2014, PraY est revenu sur la scène e-sport lorsqu'il a rejoint l'équipe toute jeune des ROX Tigers (anciennement KOO Tigers). Son impact a été immédiat : l'équipe s'est propulsée vers la finale du Championnat du monde 2015 l'année même où il a été créé. PraY et ROX ont poursuivi leurs efforts pour décrocher la seconde place dans le segment de printemps des LCK 2016 et juste après dans le segment d'été de la même année, PraY a remporté son premier trophée LCK. Après avoir enfin rencontré le succès à domicile, PraY s'est retrouvé face à SK Telecom T1 lors du Mondial et, au vu des antécédents, l'issue n'est pas difficile de deviner. Il essaiera de laisser derrière lui une autre défaite amère face à SKT en réalisant de bonnes performances lors de l'événement All-Stars 2016.</p>","pl_PL":"Jong In „PraY” Kim uważany jest za jednego z najlepszych prowadzących w Korei. PraY początkowo dołączył do Najin Black Sword w 2012 roku i doprowadził drużynę do pierwszego miejsca na zawodach OGN Champions Winter 2012-2013. Znany ze świetnej gry Ezrealem i Twitchem PraY zademonstrował, jak skuteczny może być agresywny prowadzący w koreańskiej rzeczywistości (podpowiedź: był bardzo skuteczny).</p>\n\nPo krótkiej przerwie w 2014, wymuszonej sytuacją osobistą, PraY wrócił do e-sportu, dołączając do właśnie utworzonych ROX Tigers (dawniej KOO Tigers). Jego wpływ stał się widoczny natychmiast i drużyna pomknęła do finału Mistrzostw Świata 2015 w pierwszym roku swojego istnienia. Po tym osiągnięciu PraY i ROX zajęli drugie miejsce podczas wiosennego splitu LCK 2016. Wkrótce później, po letnim splicie 2016, PraY zabrał do domu swoje pierwsze trofeum LCK. Gdy wreszcie odniósł sukces lokalny, PraY stanął twarzą w twarz z SK Telecom T1 na Mistrzostwach, a znając ich ostateczne wyniki, można się domyślić, jak to się skończyło. Z pewnością spróbuje zatrzeć wspomnienie kolejnej gorzkiej porażki z SKT słodkim smakiem sukcesu podczas wydarzenia All-Star 2016.\n","de_DE":"<p>Jong-in „PraY“ Kim gilt als einer der besten AD-Carrys Koreas. PraY unterschrieb 2012 bei Najin Black Sword und führte die Mannschaft in den Jahren 2012 und 2013 zum Titel des „OGN Champions Winter“-Turniers. PraY ist für seine Fähigkeiten mit Ezreal und Twitch bekannt und hat allen gezeigt, wie effektiv ein aggressiver AD-Carry im koreanischen Metaspiel sein kann (kleiner Tipp: Er war wirklich effektiv).</p>\n\n<p>Nach einer kurzen persönlichen Auszeit kehrte PraY 2014 in die E-Sport-Szene zurück und wechselte zu den neu gegründeten ROX Tigers (ehemals KOO Tigers). Sein Einfluss war sofort spürbar, als die Mannschaft gleich in ihrem ersten Jahr das Finale der Weltmeisterschaft 2015 erreichte. PraY und ROX legten mit einem zweiten Platz beim Frühjahrs-Split der LCK 2016 nach, bevor sie beim Sommer-Split der LCK 2016 ihre erste Trophäe in der LCK mit nach Hause nehmen konnten. Nach diesem heimischen Erfolg traf PraY bei der Weltmeisterschaft auf SK Telecom T1 und der Rest ist Geschichte. Er wird versuchen, auch diese knappe Niederlage gegen SKT wegzustecken und beim All-Stars-Event 2016 eine ansprechende Leistung abzuliefern.</p>","es_ES":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores AD carry de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un AD carry agresivo en el metajuego coreano (creednos, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el split de primavera de la LCK 2016 y, poco después, en el split de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","pt_BR":"<p>Jong-in \"PraY\" Kim é considerado um dos melhores atiradores da Coreia. PraY a princípio assinou um contrato com a NaJin Black Sword in 2012 e levou a equipe ao 1º lugar na competição de Inverno da OGN Champions 2012-2013. Conhecido por suas habilidades com Ezreal e Twitch, PraY demonstrou o quão eficiente um atirador agressivo pode ser no meta coreano (tipo, muito eficiente).</p>\n\n<p>Depois de um descanso por motivos pessoais em 2014, PraY fez sua volta ao e-Sports quando entrou para a recém-formada ROX Tigers (antiga KOO/GE Tigers). Seu impacto foi imediato e sua equipe foi parar direto nas Finais do Campeonato Mundial 2015 logo em seu primeiro ano de existência. PraY e ROX continuaram com seus esforços e alcançaram o segundo lugar na Etapa de Primavera da LCK 2016, fazendo também a mesma façanha na Etapa de Verão, onde PraY levou para casa seu primeiro troféu da LCK. Após finalmente encontrar sucesso em casa, PraY enfrentou a SK Telecom T1 no Mundial e, bem, vocês sabem o que aconteceu. Ele tentará colocar outra derrota contra a SKT no passado e desempenhar bem no Evento All-Star 2016.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"PraY\" 김종인은 한국 최고의 원거리 딜러 중 하나로 여겨집니다. PraY는 맨 처음 2012년 Najin Black Sword와 계약했고 2012-2013 OGN 챔피언스 윈터 시즌에서 팀을 1위로 이끌었습니다. 이즈리얼, 트위치로 유명한 PraY는 공격적인 원거리 딜러가 한국 메타에서 얼마나 효과적인지 보여줬죠. </p>\n<p style=”font-family:”나눔고딕”;\">2014년 잠시 개인적으로 휴식을 취한 PraY는 e스포츠로 돌아와 새롭게 만들어진 팀 KOO Tigers (구 GE Tigers)에 합류했습니다. 그의 영향력은 즉시 나타났습니다. KOO Tigers가 창단 첫해에 2015 월드 챔피언십 결승전까지 진출했거든요. PraY와 KOO Tigers는 비록 결승전에서 SKT를 물리치진 못했지만 월드 챔피언십에서 보여준 PraY의 놀라운 경기력은 유럽 관중들에게 깊은 인상을 남겼습니다. </p>\n","es_AR":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","cs_CZ":"<p>Jong In „PraY“ Kim je považován za jednoho z nejlepších korejských ADC. Nejprve roku 2012 nastoupil do týmu Najin Black Sword a dotáhl jej na 1. místo soutěže OGN Champions Winter 2012–2013. PraY, proslulý především svou úžasnou herní technikou za Ezreala a Twitche, názorně předvedl, jak efektivní může být agresivní ADC v korejské metě (tzn. nesmírně efektivní).</p>\n\n<p>Po krátké pauze, kterou si z osobních důvodů udělal v roce 2014, se PraY k esportům vrátil a podepsal smlouvu s nově vytvořeným celkem ROX Tigers (dříve KOO Tigers). Jeho vliv se projevil prakticky okamžitě a hned během prvního roku katapultoval tým až do finále mistrovství světa 2015. PraY a ROX na tento úspěch navázali druhým místem v jarním splitu LCK 2016 a krátce poté, v letním splitu LCK 2016, získal PraY svou první ligovou trofej. Když se mu konečně začalo dařit na domácí scéně, čekal jej na MS boj s SK Telecom T1, a všichni víme, jak to dopadlo. Nyní se pokusí vzpomínky na hořkou prohru s SKT zahnat špičkovým výkonem na turnaji All-Star 2016.</p>","el_GR":"<p>Ο Jong In \"PraY\" Kim θεωρείται ένας από τους καλύτερους AD Carry στην Κορέα. Η πρώτη ομάδα του PraY ήταν οι Najin Black Sword το 2012, οι οποίοι με τη βοήθειά του κατάφεραν να πάρουν την 1η θέση στη διοργάνωση OGN Champions Winter 2012-2013. Γνωστός για τον άριστο χειρισμό του Έζρεαλ και του Τουίτς, ο PraY έδειξε στην κορεατική σκηνή πόσο αποτελεσματικός μπορεί να γίνει ένας επιθετικός AD Carry (πάρα πολύ αποτελεσματικός, όπως αποδείχτηκε).</p>\n\n<p>Μετά από ένα μικρό διάλειμμα για προσωπικούς λόγους το 2014, ο PraY επέστρεψε στα esports με μια νέα τότε ομάδα, τους ROX Tigers (προηγουμένως KOO Tigers). Έκανε αμέσως αισθητή την παρουσία του, καθώς η ομάδα εκτοξεύτηκε στον Τελικό Παγκοσμίου Πρωταθλήματος 2015 τον πρώτο χρόνο της σταδιοδρομίας τους. Ο PraY και οι ROX συνέχισαν εξίσου καλά, παίρνοντας τη δεύτερη θέση στο Spring Split 2016 του LCK και λίγο μετά, στο Summer Split 2016 του LCK, ο PraY κέρδισε το πρώτο του τρόπαιο στο LCK. Αφού κατάφερε να φτάσει επιτέλους στην κορυφή εντός των συνόρων, ο PraY βρέθηκε λίγο μετά να μάχεται με τους SK Telecom T1 στο Παγκόσμιο Πρωτάθλημα και τα υπόλοιπα τα γνωρίζετε. Είναι βέβαιο ότι θα προσπαθήσει να ξεπεράσει άλλη μια πικρή ήττα από τους SKT με μια δυνατή εμφάνιση στο Τουρνουά All-Star 2016.</p>","hu_HU":"Jong In „PraY” Kim Korea egyik legjobb lövészének számít. PraY 2012-ben a Najin Black Swordhoz igazolt, és az OGN Champions 2012-2013-as téli szakaszában győzelemre is vezette csapatát. Ezreallal és Twitchcsel félelmetesen játszik, és bizonyította, hogy milyen hatékony lehet egy agresszív lövész a koreai metajátékban (nagyon).</p>\n\nPraY magánéleti okokból rövid pihenőt tartott 2014-ben, és az újonnan alakított ROX Tigers (akkoriban KOO Tigers) kötelékében tért vissza az e-sportba. Jelentős hatása volt a csapat eredményeire, és már az első teljes évükben a 2015-ös világbajnokság döntőjéig jutottak. PraY és a ROX a lendületüket megőrizve másodikok lettek az LCK 2016-os tavaszi szakaszában, a nyári szakaszban pedig PraY megnyerte első LCK-s bajnoki címét. A hazai sikerek után az SK Telecom T1 lett a vesztük a vb-n, csakúgy, mint az előző évben. Az SKT-től elszenvedett újabb kellemetlen vereséget a 2016-os All-Star gálán próbálja majd feledni.\n","it_IT":"Jong In \"PraY\" Kim è considerato uno dei migliori ADC di tutta la Corea. PraY ha iniziato la sua carriera nei NaJin Black Sword nel 2012, e ha condotto alla vittoria la sua squadra nel Champions Winter OGN 2012-2013. Famoso per le sue giocate con Ezreal e Twitch, PraY ha dimostrato quanto può essere efficace un AD carry aggressivo all'interno del meta coreano (spoiler: è MOLTO efficace).</p>\n\nDopo una breve pausa per motivi personali nel 2014, PraY è tornato nel mondo degli eSport unendosi ai novellini ROX Tigers (ex KOO Tigers). Il suo impatto fu immediato e il team raggiunse la finale dei Mondiali 2015 al suo primo anno d'età. PraY e i ROX proseguirono la striscia positiva con un secondo posto allo Spring Split LCK 2016 e poi al Summer Split, dove PraY ha portato a casa il suo primo trofeo LCK. Dopo aver agguantato il successo in casa, PraY ha dovuto affrontare gli SKT ai Mondiali, e il resto è storia. All'All-Star cercherà di lasciarsi alle spalle l'amara sconfitta deliziandoci con una prestazione degna del suo nome.\n","ro_RO":"Jong In ''PraY'' Kim este privit ca unul dintre cei mai buni jucători ADC din Coreea. PraY și-a început cariera în 2012, alături de Najin Black Sword, conducându-și echipa către primul loc în competiția OGN Champions Winter 2012-2013. Cunoscut în principal pentru mecanicile sale de joc cu Ezreal și Twitch, PraY a demonstrat cât de eficient poate fi un ADC agresiv în meta-ul coreean (mai exact: extrem de eficient).</p>\n\nDupă o scurtă pauză din motive personale în 2014, PraY s-a întors la eSports, alăturându-se echipei ROX Tigers (cunoscuți anterior drept KOO Tigers), care de-abia fusese creată. Impactul lui a fost vizibil instantaneu, iar echipa a ajuns în finala Campionatului Mondial 2015 în primul an după ce a fost fondată. PraY și ROX au mers înainte cu aceeași hotărâre și au terminat pe locul al doilea în etapa de primăvară a LCK 2016 și, la scurtă vreme după aceea, PraY a luat acasă primul trofeu LCK în etapa de vară din 2016 a competiției. După ce a obținut în sfârșit succesul pe plan local, PraY a întâlnit SK Telecom T1 la Mondiale. Istoria și-a spus cuvântul și puteți ghici ce s-a întâmplat. Va încerca să treacă iar peste înfrângerea amară împotriva celor de la SKT printr-o victorie dulce la All-Star Event 2016.\n","es_MX":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>"},"foreignIds":{"drupalId":"369","ESPORTSTMNT06":"200000371"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1027,"slug":"bdd","name":"BDD","firstName":"Bo-sung","lastName":"Kwak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bdd-gqyzlus1.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:55.000Z","updatedAt":"2017-05-31T00:45:54.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000370"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1041,"slug":"zzus","name":"Zzus","firstName":"Jun-su","lastName":"Jang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zzus-in7b4s5r.png","hometown":"South Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:08:13.000Z","updatedAt":"2017-05-31T00:45:11.000Z","bios":{},"foreignIds":{"TRKR1":"225061"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1044,"slug":"lindarang","name":"Lindarang","firstName":"Manheung","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lindarang-8tddakt4.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:16:03.000Z","updatedAt":"2017-05-31T00:51:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000374"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1045,"slug":"seonghwan","name":"SeongHwan","firstName":"Seonghwan","lastName":"Yun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seonghwan-g8jv42cj.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:14:35.000Z","updatedAt":"2017-05-31T00:52:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000440"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1231,"slug":"key","name":"Key","firstName":"Hangi","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/key-9cxe5iyu.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-04-28T19:01:05.000Z","updatedAt":"2017-05-31T00:53:08.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000959"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1270,"slug":"mightybear","name":"Mightybear","firstName":"Min-soo","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mightybear-dx94b7va.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:33:03.000Z","updatedAt":"2017-05-31T00:46:49.000Z","bios":{"en_US":"<p>\nMin-soo “Mightybear” Kim launched his professional career in late 2014 while playing for team Positive Energy in China. He then moved on to powerhouse Chinese esports organization Newbee (best known for their Dota 2 teams), where he stayed until early 2016. \n</p>\n<p>\nIn mid-2016 Mightybear decided to make the move to Europe in order to play with Team Vitality. After a brief stay, he made his way to Korea for 2017.\n</p>","de_DE":"<p>Min-Soo „Mightybear“ Kim ist praktisch der Neue in der Klasse. Er fing mit der Schule direkt im Ausland an, wo er sich allerdings nicht wohl fühlte, weil er nie zu Wort kam. Der Suchdrang nach einem neuen Zuhause wuchs schnell und Worten folgten die Taten. </p>\n\n<p>Im Klartext heißt dies, dass der koreanische Amateur, der vorher unter „Moon“ und „PandaBears“ bekannt war, sein professionelles Debüt in der Zweitliga Chinas, der LSPL, feierte. Bei Positive Energy konnte er kein Spiel für seine erste Mannschaft absolvieren, doch gab es für ihn einen Hauch an Hoffnung, als Newbee (heute in der LPL) den Club aufkaufte. Tatsächlich kam er im Demacia Cup 2015 Summer gegen Team WE Future und während der LPL 2016 Spring Promotion zum Einsatz. Allerdings konnte er mit den einhergehenden sechs Niederlagen (beide 0:3-Spielstände) bisher noch nichts unter Beweis stellen und hofft wieder einmal von seinen Fans und Kollegen respektiert geachtet zu werden. </p>\n\n<p>Mit Vitality könnte dies sein Durchbruch sein, eine Mannschaft aus alten Veteranen und hungrigen Amateuren. Die Mischung hat sich in League of Legends stets als Formel für Erfolg bestätigt und mit dem frisch entzündetem Feuer in Mightybear, könnte er vielleicht der neue Kang-Yun „Trick“ Kim der EU LCS sein.\n</p>","fr_FR":"<p>La vague de jeunes junglers talentueux venus de Corée du Sud ne s’arrête pas ! Après Cho « H0R0 » Jae-hwan chez Millenium, Kim « Reignover » Yeu-jin puis Lee « Spirit » Da-yoon chez Fnatic et Kim « Trick » Gang-yun chez G2 Esports, voici que Kim « Mightybear » Min-su débarque à son tour sur le Vieux Continent. Sa destination n’est autre que la structure française Team Vitality. </p>\n\n<p>Mightybear a fait ses premiers pas en Chine, notamment dans l’équipe Newbee, qui évoluait en LSPL, la deuxième division chinoise. En 2016, il n’a disputé aucun match compétitif car il était le remplaçant de Baek « Swift » Da-hoon. </p>\n\n<p>Son intégration au sein de sa nouvelle équipe a été facilitée par sa maîtrise déjà très bonne de l’anglais, ce qui a facilité le choix de Vitality. Sa vision de jeu et son agressivité devraient permettre à Vitality de trouver un second souffle. Sa mission reste périlleuse car il doit faire oublier Ilyas « Shook » Hartsema en se montrant plus régulier et en montrant plus d’initiative. </p>","pl_PL":"<p>Min-su „Mightybear” Kim, pomimo koreańskiego pochodzenia, karierę profesjonalnego gracza rozpoczął w Chinach. W grudniu 2014 roku dołączył do pierwszej esportowej organizacji w Krainie Smoków – do Positive Energy. W szeregach chińskiego zespołu udało mu się wziąć udział w wielu pomniejszych turniejach, a nawet zagrać przeciwko krajowym potęgom, takim jak LGD Gaming czy Team WE. Do swoich sukcesów z tego okresu może zaliczyć utrzymanie się w drugorzędnej lidze w Chinach. Jednak już w maju 2015 roku grał pod nową banderą, gdyż został wykupiony z całym zespołem przez inną organizację. Dołączył do drużyny Newbee, gdzie miał największe osiągnięcia podczas pobytu w Chinach. Wraz z zespołem miał okazję zawalczyć w kwalifikacjach do najbardziej prestiżowej ligi w Państwie Środka, czyli LPL. Jednak na jego drodze kolejny raz stanął zespół WE, przeciwko któremu nie pomogły nadzwyczajne umiejętności Min-su w grze Gragasem. </p>\n<p>W maju 2016 roku został zapytany przez swojego agenta czy chciałby profesjonalnie grać w Europie. Odpowiedź Min-su była zdecydowanie pozytywna. Już wtedy potrafił mówić po angielsku, więc nie widział żadnych przeszkód w dołączeniu do Team Vitality. „Mightybear” od początku zaskakiwał swoim pogodnym usposobieniem. W wywiadzie przed letnim splitem EU LCS 2016 stwierdził, że nie odczuwa presji i jest bardzo optymistycznie nastawiony do gry w Europie. Po przyjeździe na nowy kontynent był zachwycony wyglądem miast i stylem życia Europejczyków. Jak tylko stał się członkiem Team Vitality, to założył konta na portalach społecznościowych. Od razu rozpoczął bardzo aktywne życie na tych stronach, przepełnione elementami humorystycznymi związanymi z jego pseudonimem „Mightybear”.</p>\n<p>W piątym sezonie zauważalnie gustował w niezwykle twardych dżunglerach, chociaż za swoich ulubionych bohaterów uważa Nidalee i Gravesa. Najlepiej sobie radził Gragasem i Rek’sai, lecz zdarzało się również, że wybierał bohaterów innego typu, jak na przykład ukochaną Nidalee. Od maja 2016 roku, czyli przeprowadzki do Europy, coraz częściej można było zobaczyć go w akcji Gravesem i Kindred. Jego największym osobistym osiągnięciem było wejście do Kręgu Pretendenta w Korei, który to wyczyn udało mu się powtórzyć na serwerze EU West w czasie krótszym niż miesiąc. Imponującym osiągnięciem oczywiście pochwalił się na portalach społecznościowych.</p>\n\n"},"foreignIds":{"TRLH3":"1001310014","TRLH4":"1001270014","TRLH2":"1001250062","FRA1TMNT2":"45034","ESPORTSTMNT06":"200001028"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1905,"slug":"rascal","name":"Rascal","firstName":"Kwanghee","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rascal-8urxxqt3.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:02.000Z","updatedAt":"2017-05-31T00:47:11.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1906,"slug":"khan","name":"Khan","firstName":"Dongha","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/khan-9ek3s7ka.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:16.000Z","updatedAt":"2017-07-20T17:16:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001338"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1907,"slug":"cuzz","name":"Cuzz","firstName":"Uchan","lastName":"Mun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuzz-h4602gy8.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:11:11.000Z","updatedAt":"2017-05-31T00:39:07.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000369"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1908,"slug":"justice","name":"Justice","firstName":"Seokjun","lastName":"Yoon","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/justice-ciws9z5c.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:05:33.000Z","updatedAt":"2017-05-31T00:45:08.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1909,"slug":"jin","name":"Jin","firstName":"Woojin","lastName":"Lee","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:13:13.000Z","updatedAt":"2017-05-25T19:13:13.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":2049,"slug":"lava","name":"Lava","firstName":"Taehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:26:19.000Z","updatedAt":"2017-07-01T23:40:36.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001525"},"socialNetworks":{},"champions":[],"liveGameTeam":108}],"scheduleItems":[{"id":"AVxHQRS3oUG4HPFjOKTJ","content":"urn:rg:lolesports:global:highlander:tournament:6e66df3c-1c99-46af-8903-51c562ca2a08:match:1cb3f6b1-e2ea-4363-998d-31fc3c17b440","scheduledTime":"2017-06-13T11:00:00.904+0000","tags":{"blockLabel":"3","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:6e66df3c-1c99-46af-8903-51c562ca2a08:bracket:2d95ef67-d967-4994-8ada-01c0041898a8","leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:6e66df3c-1c99-46af-8903-51c562ca2a08"},"match":"1cb3f6b1-e2ea-4363-998d-31fc3c17b440","tournament":"6e66df3c-1c99-46af-8903-51c562ca2a08","bracket":"2d95ef67-d967-4994-8ada-01c0041898a8","league":"6"}],"gameIdMappings":[{"id":"333cf83f-aef1-4c37-a901-c2d8110c835f","gameHash":"7ee879488d7bc029"},{"id":"9fa1df1e-8f94-42ad-a0ee-71757cd7ad7e","gameHash":"b64e11122aa10468"}],"videos":[{"id":7296,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:6e66df3c-1c99-46af-8903-51c562ca2a08:game:333cf83f-aef1-4c37-a901-c2d8110c835f","source":"https://www.youtube.com/embed/CJIrJCwkk9I?wmode=transparent&start=11520&rel=0","createdAt":"2017-06-13T19:01:58.000Z","updatedAt":"2017-06-13T19:01:58.000Z","game":"333cf83f-aef1-4c37-a901-c2d8110c835f"},{"id":7297,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:6e66df3c-1c99-46af-8903-51c562ca2a08:game:9fa1df1e-8f94-42ad-a0ee-71757cd7ad7e","source":"https://www.youtube.com/embed/CJIrJCwkk9I?wmode=transparent&start=14676&rel=0","createdAt":"2017-06-13T19:02:25.000Z","updatedAt":"2017-06-13T19:02:25.000Z","game":"9fa1df1e-8f94-42ad-a0ee-71757cd7ad7e"}],"htmlBlocks":[],"match":{"id":"1cb3f6b1-e2ea-4363-998d-31fc3c17b440","name":"LZ-vs-ROX","position":41,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"},{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}],"games":{"333cf83f-aef1-4c37-a901-c2d8110c835f":{"id":"333cf83f-aef1-4c37-a901-c2d8110c835f","name":"G1","generatedName":"LZ|ROX|G1|1cb3f6b1e2ea4363998d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"},{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}],"standings":{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380814101,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380550284,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"270070","gameRealm":"ESPORTSTMNT06","platformId":"ESPORTSTMNT06:270070","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"9fa1df1e-8f94-42ad-a0ee-71757cd7ad7e":{"id":"9fa1df1e-8f94-42ad-a0ee-71757cd7ad7e","name":"G2","generatedName":"LZ|ROX|G2|1cb3f6b1e2ea4363998d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"},{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}],"standings":{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497383450891,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380718021,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380530447,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"270074","gameRealm":"ESPORTSTMNT06","platformId":"ESPORTSTMNT06:270074","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b0edbf4e-d7fc-4400-aa6b-b21dbb7b5dae":{"id":"b0edbf4e-d7fc-4400-aa6b-b21dbb7b5dae","name":"G3","generatedName":"LZ|ROX|G3|1cb3f6b1e2ea4363998d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"},{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497383450893,"source":"bestOf","history":[{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380718054,"source":"bestOf","closed":true},{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380814102,"source":"bestOf","closed":true},{"result":[[{"roster":"1b13dee6-062d-4531-80ec-53f2940de496"}],[{"roster":"629c90ad-300e-40f7-a032-ece6cdc86865"}]],"timestamp":1497380530497,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"629c90ad-300e-40f7-a032-ece6cdc86865":0,"1b13dee6-062d-4531-80ec-53f2940de496":1}}}