{"teams":[{"id":169,"slug":"echo-fox","name":"Echo Fox","guid":"be70e203-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/echo-fox-ejngzoa3.png","acronym":"FOX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-04T23:27:05.000Z","updatedAt":"2017-08-06T19:57:02.000Z","bios":{"fr_FR":"<p>Que se passe-t-il quand une figure médiatique du basketball nord-américain s'intéresse aux LCS ? Ça donne Echo Fox. </p>\n\n<p>L'idée pourrait sembler saugrenue et l'aurait sans aucun doute été il y a deux ans. Oui mais voilà, l'e-sport continue de se développer, notamment grâce à League of Legends, et Echo Fox en est une preuve éclatante. Cette nouvelle équipe qui vient remplacer Gravity Gaming dans les LCS NA est en effet la propriété de Rick Fox, ancien joueur de la NBA notamment pour les Los Angeles Lakers, et acteur à ses heures perdues. Rien que ça ! </p>\n\n<p>Acheter une place en LCS c'est bien, mais ça ne suffit pas. Encore faut-il aligner une équipe compétitive et donc attirer des joueurs de haut niveau. C'est ce qu'a tenté de faire Echo Fox, avec un résultat qui soulève sans doute autant de questions que d'espoirs circonspects chez les fans d'e-sport en général et de League of Legends en particulier. Echo Fox est charpentée autour de son mid laner Henrik « Froggen » Hansen, légende du jeu et un nom qui attirera sans aucun doute le public. Mais le joueur européen a-t-il encore le niveau pour porter son équipe ? Et ses coéquipiers ont-ils les reins assez solides pour l'épauler efficacement ? Que ce soit le joueur coréen de file solo Jeong-hun « kfo » Park en voie du haut ou les trois nord-américains qui complètent l'effectif, les nouveaux compagnons de Froggen manquent pour le moment d'expérience. </p>\n\n<p>Cela peut signifier l'arrivée d'une nouvelle vague de jeunes joueurs bien décidés à faire des étincelles. Cela peut aussi être une saison d'apprentissage difficile qui aboutira à un nouveau passage dans les tréfonds du classement des LCS pour Froggen. Quoiqu'il en soit, les dés sont jetés et Rick Fox va pouvoir regarder ses joueurs depuis le banc tout au long des LCS NA. </p>","en_US":"<p>You'd have trouble finding an easier team to root for than Echo Fox. Given the team's many struggles since joining the league in 2016, including narrowly avoiding relegation in the 2017 NA LCS Spring Promotion tournament, another owner might have jumped ship. But former NBA star Rick Fox isn't just any other owner. His belief in his players is unwavering.</p>\n\n<p>In 2017, Fox is supplementing that belief with some new talent. Former RNG top laner Looper headlines the new additions, along with ex-P1 support Gate. Former Challenger scene jungler Akaadian also joins the team. Nobody has more faith in Echo Fox than its owner; now it's time for the players to prove that faith isn't misplaced.</p>\n\n<p>Coach: Nick \"Inero\" Smith</p>","pl_PL":"<p>Pojawienie się Echo Fox w wiosennym sezonie NA LCS 2016 to powiew świeżości wśród organizacji. Nowo powstała drużyna zastąpiła Gravity w elitarnych rozgrywkach NA LCS, więc śmiało można stwierdził, że od razu skoczyła na głęboką wodę. Ogłoszenie istnienia Echo Fox, a następnie jego składu, wzbudziło wiele emocji wśród społeczeństwa League of Legends. Wynikało to z bardzo małej ilości przecieków na temat powstającego zespołu i ujawnienia atrakcyjnych faktów tuż przed rozpoczynającym się sezonem 6. Dlatego wszyscy zainteresowani dosłownie wychodzili z siebie próbując zaspokoić swoją ciekawość.</p>\n<p>Jednak najbardziej zaskakującymi informacjami dotyczącymi zespołu Echo Fox, były wiadomości o jego właścicielu. Nabywcą miejsca Gravity w NA LCS była powszechnie znana w Ameryce Północnej gwiazda NBA – Rick Fox. Wielu graczy od razu zadało sobie pytanie: jak to się stało, że znana w skali światowej osobistość, tak się zainteresowała grą komputerową. Wyjaśnienia można się doszukać w wielkim uczuciu jego syna, Kyle’a Foxa, do drużyny Counter Logic Gaming. Wkrótce młodemu fanowi udało się zarazić pasją swojego sławnego ojca. W ten sposób trzykrotny mistrz NBA dowiedział się o League of Legends i bardzo szybko również pokochał tą rozrywkę. Można było spotkać Ricka Foxa wśród widzów na wielu wydarzeniach związanych z League of Legends, jak na przykład rozgrywki NA LCS. Rozmawiał z zawodnikami, w szczególności dużo z graczami Counter Logic Gaming, dodając im otuchy przed meczami. Te czynniki doprowadziły sławę do kroku, którego nikt się nie spodziewał – wykupił drużynę Gravity i przemianował ją na Echo Fox. W wywiadzie dla Breitbart powiedział: „Pragnienie, skupienie, poświęcenie i etyka, które widziałem u esportowych atletów przypominają mi presję rywalizacji kiedy ja goniłem za swoją karierą w koszykówkę. Moja pasja została wsparta przez społeczeństwo, jako właściciel drużyny Echo Fox zamierzam popierać jej zawodników w taki sam sposób.”</p>\n<p>Rick Fox zadbał żeby jego drużyna nie została na wstępie zdominowana przez zahartowanych weteranów. Oprócz młodych i obiecujących talentów znalazł w składzie miejsce dla poważanego weterana - Henrika \"Froggen\" Hansena. W wizji właściciela Echo Fox połączenie świeżych pomysłów w wydaniu debiutantów i doświadczenia starych wyjadaczy to przepis na sukces. Uwagę przyciąga także nazwa organizacji – wiadomo, że lisia część pochodzi od nazwiska założyciela, lecz pojawiło się wiele teorii na temat dodatku w postaci słowa „Echo”. Wiele osób doszukało się w tej chwytliwej nazwie nawiązania do międzynarodowego alfabetu lotniczego. Według tej teorii „Echo Fox” to skrócona nazwa fonetyczna dwóch następujących po sobie liter – E i F, czyli w rozwinięciu „Echo Foxtrot”.</p>\n","de_DE":"Es gibt kaum ein Team, das man lieber anfeuert als Echo Fox. Das Team hat seit dem Ligabeitritt 2016 schwer zu kämpfen. Der knapp verhinderte Abstieg im Aufstiegsturnier für die NA LCS 2017 ist nur ein Beispiel dafür, und ein anderer Besitzer hätte das sinkende Schiff sicher verlassen. Aber der ehemalige NBA-Star Rick Fox ist kein Besitzer wie jeder andere. Der Glaube an seine Spieler ist unerschütterlich.\n</p>\n2017 untermauert er diese Einstellung mit einigen neuen Talenten. Looper, der ehemalige Top-Laner von RNG, führt die Neuzugänge an, gemeinsam mit Gate, dem Ex-Supporter von P1. Akaadian, der früher in der Challenger Series als Jungler tätig war, schließt sich ebenfalls dem Team an. Niemand glaubt mehr an Echo Fox als ihr Besitzer, und jetzt liegt es an den Spielern, zu beweisen, dass sein Vertrauen nicht ungerechtfertigt ist.\n</p>\nCoach: Tim „Timkiro“ Cho\n"},"foreignIds":{},"players":[70,191,246,363,607,774,820,1096,1359],"starters":[191,363,774,820,1359],"subs":[70,246,607,1096]},{"id":264,"slug":"flyquest","name":"FlyQuest","guid":"be7244a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flyquest-89bnqpyh.png","acronym":"FLY","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2017-01-05T18:49:16.000Z","updatedAt":"2017-06-23T01:31:34.000Z","bios":{"en_US":"<p>Formerly Cloud9 Challenger, FlyQuest is about to reap the rewards of its Challenger Series success. The team’s mix of ex-Cloud9 veterans and fresh talent saw them rampage their way through to the 2017 NA LCS Spring Promotion Tournament, earning a spot in the NA LCS.</p>\n\n<p>Behind veteran mid laner Hai’s leadership, the team found unexpected success in the 2017 NA LCS Spring Split. LemonNation played the mastermind with his signature notebook, and Balls served as the team’s muscle in the top lane. Maybe you can teach old dogs new tricks.</p>\n\n<p>Coach: Thomas \"ThinkCard\" Slotkin</p>","de_DE":"FlyQuest, ehemals Cloud9 Challenger, ist drauf und dran, für ihren Erfolg in der Challenger Series belohnt zu werden. Mit einer Mischung aus alten Cloud9-Veteranen und neuen Talenten marschierten sie durch das Frühjahrs-Aufstiegsturnier der NA LCS 2017 und haben sich damit einen Platz in der NA LCS gesichert.\n</p>\nTrotz des neuen Besitzers bleibt die Mannschaft größtenteils unverändert. Unter der Führung des Mid-Laner-Veteranen Hai hat das Team hohe Erwartungen für 2017. LemonNation ist mit seinem unverkennbaren Notizblock zurück und Balls ist bereit, als treibende Kraft in der oberen Lane zu fungieren. Sollte FlyQuest Erfolg haben, sind sie der Beweis dafür, dass man auch einem alten Fuchs neue Tricks beibringen kann.\n"},"foreignIds":{},"players":[57,112,114,116,354,500,549],"starters":[57,112,114,116,549],"subs":[354,500]}],"players":[{"id":57,"slug":"wildturtle","name":"WildTurtle","firstName":"Jason","lastName":"Tran","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wildturtle-3siezu72.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-02T18:43:29.000Z","bios":{"en_US":"<p>Jason “WildTurtle” Tran has earned the \"wild\" part of his name through intense aggression in games. Whereas other AD carries excel at the delicate dance of staying out of reach, firing away, WildTurtle goes full aggro and can be found in melee range as often as not. When it backfires, he looks over-eager... but when it succeeds, the fans go crazy.</p>\n\n<p>After finding little playoff success with Immortals in 2016, WildTurtle made his way back to TSM for the start of 2017. Sporting his trademark all-in style, WildTurtle helped TSM to another title in the spring split. He finally shook off his playoff woes in the 2017 NA LCS Spring Finals, taking down Cloud9 in a close five game series. After Doublelift's return, WildTurtle heads to FlyQuest, where he should fit right in with Hai's aggressive shotcalls.</p>","fr_FR":"La partie « wild » (« sauvage ») du surnom de Jason « WildTurtle » Tran vient de son style de jeu particulièrement agressif. Alors que d'autres carrys AD excellent dans l'art délicat de rester hors de portée et d'attaquer à distance, WildTurtle aime aller au contact et se retrouve bien souvent à portée de mêlée. Quand la situation se retourne contre lui, il donne l'impression d'être trop zélé... mais quand il réussit, ses fans se déchaînent.\n\nAprès avoir connu un succès timide lors des play-offs avec les Immortals en 2016, WildTurtle est revenu chez TSM début 2017. Avec son style agressif caractéristique, il apporte à TSM le mordant qui lui manquait depuis le départ de Doublelift. Il a fini par oublier ses déboires lors de la finale du segment de printemps des LCS NA 2017, en éliminant Cloud9 lors d'un match serré en cinq manches. WildTurtle compte bien tout donner pour connaître un succès similaire au Brésil, lors du Mid-Season Invitational 2017.\n","pl_PL":"Jason „WildTurtle” Tran zawdzięcza „dziką” część swojego przydomka („wild” — z ang. „dziki”) niesamowitej agresji w grze. Podczas gdy inni prowadzący doskonalą delikatny taniec polegający na trzymaniu się poza zasięgiem i atakowaniu z daleka, WildTurtle idzie na całość i dość często można go zobaczyć walczącego w zwarciu. Gdy to się źle skończy, zarzuca się mu nadgorliwość... ale gdy się uda, fani szaleją.\n\nPonieważ nie osiągnął wielkich sukcesów z Immortals w 2016 roku, WildTurtle powrócił do TSM z początkiem 2017 roku. Prezentując swój firmowy, brawurowy styl gry, WildTurtle przywróci TSM agresję, której im brakowało po odejściu Doublelifta. Nareszcie otrząsnął się z problemów w play-offach, pokonując podczas finału wiosny NA LCS 2017 Cloud9 w wyrównanej serii pięciu gier. Wyruszając w podróż do Brazylii na Mid-Season Invitational 2017, zamierza kontynuować ten sukces\n","de_DE":"Jason „WildTurtle“ Tran verdankt das „Wild“ in seinem Namen seiner unglaublichen Aggressivität in den Spielen. Während andere AD-Carrys außerhalb der Reichweite bleiben und dennoch Schaden verursachen, geht WildTurtle immer volles Risiko und ist mindestens genauso häufig in Nahkampfreichweite. Wenn das nach hinten losgeht, wirkt er übereifrig, aber wenn er Erfolg hat, drehen seine Fans durch.\n</p>\nDa er mit den Immortals im Jahr 2016 keinen Erfolg in den Entscheidungsspielen hatte, wechselte WildTurtle Anfang 2017 wieder zu TSM zurück. Mit seinem „Alles oder nichts“-Stil bringt WildTurtle die Aggressivität nach Doublelifts Abgang zu TSM zurück. Er hofft, seine Probleme mit Entscheidungsspielen hinter sich lassen zu können, während er die Lebensleisten seiner Gegner leert, um TSM dabei zu helfen, die Krone im Frühjahrs-Split der NA LCS zu verteidigen.\n","es_ES":"Jason ''WildTurtle'' Tran se ha ganado la parte wild (salvaje) de su nombre gracias a su agresividad en las partidas. Si otros ADC destacan por sus ágiles movimientos, que los hacen inalcanzables y escurridizos, WildTurtle se lanza a tope y a menudo se le puede ver a distancia cuerpo a cuerpo. Cuando le sale el tiro por la culata, queda demasiado impaciente; si le sale bien, el público enloquece.\n\nTras quedarse a dos velas en los playoffs con Immortals en 2016, WildTurtle ha vuelto a TSM al comienzo de 2017. Gracias a su distintivo estilo de darlo todo, WildTurtle volverá a aportar un toque de agresividad a TSM tras la retirada de Doublelift. Logró acabar con su miedo a los playoffs en la final de primavera de la LCS NA 2017, en la que consiguió vencer a Cloud9 en una serie de cinco partidas. Intentará tener el mismo éxito en su viaje a Brasil para jugar en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Jason \"WildTurtle\" Tran ganhou a parte do “wild” do seu nome por causa da suas agressões intensas nos jogos. Enquanto outros carregadores mandam bem na delicada dança de ficar fora de alcance, atirando, WildTurtle ataca agressivamente e pode ser encontrado no combate corpo a corpo frequentemente. Quando isso não dá certo, ele parece muito afobado... mas quando dá, os fãs vão à loucura.</p>\n\n<p>Depois de ter um pouco de sucesso nas eliminatórias com a Immortals em 2016, o WildTurtle voltou para a TSM no início de 2017. Exibindo sua marca registrada de ir com tudo, WildTurtle traz a agressividade de volta à TSM depois da saída do Doublelift. Ele finalmente esqueceu o desgosto das eliminatórias nas Finais de Primavera da LCS NA 2017, derrotando a Cloud9 em cinco partidas acirradas. Ele tentará carregar esse sucesso consigo na viagem ao Brasil para o Mid-Season Invitational 2017.\n\n</p>"},"foreignIds":{"drupalId":"178","TRLH1":"200000251","TRLH2":"200000155","TRLT3":"200000235"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/WILDTURTLEX","twitter":"https://twitter.com/tsmwildturtle"},"champions":[],"liveGameTeam":264},{"id":70,"slug":"looper","name":"Looper","firstName":"Hyeongseok","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/looper-agve6x52.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-01-19T22:02:44.000Z","bios":{"en_US":"<p>Hyeongseok \"Looper\" Jang is the latest Korean top laner to make his LCS debut. The ex-Royal Never Give Up starter is a veteran of the scene, with a career that began back in 2013. Originally known for an aggressive playstyle, Looper has evolved into a multi-faceted laner. The former LPL champion is just as capable of tanking on Maokai as he is carrying on Irelia.</p>\n\n<p>Looper brings his many talents to Echo Fox in 2017. The team hopes to have more success with a Korean import this time around after another one, KFO, struggled as their top laner. Looper has the track record of success that Echo Fox sorely needed. At 23, he's one of the older players in the LCS -- but don't let his age fool you. He's still got plenty in the tank, and just one destination in mind: victory.</p>","es_AR":"<p>Hyeong-seok \"Looper\" Jang se posiciona en la cima como el carrilero superior de RNG y, mientras que otros carrileros superiores son alabados por su estabilidad y consistencia, Looper tiene una historia de ser un poco más agresivo. Fue originalmente conocido por su Singed en el 2013, pero Looper ha evolucionado y ahora es un carrilero multifacético. Eligió a Trundle y Rumble durante la temporada de verano de la LPL, pero es más que capaz de ramificarse, como fue demostrado con su habilidad para resistir con Moakai o acarrear con Irelia cuando es necesario. Con 23 años y con una carrera que data desde el 2013, Looper es uno de los jugadores más veteranos en el Mundial, pero no permitas que su vasta carrera te engañe. Es un maestro al que hace ya tiempo se le quitaron los nervios. Su objetivo está en la victoria.</p>","fr_FR":"<p>Hyeong-seok « Looper » Jang est un vétéran d'élite de la voie du haut. Ayant affronté la crème des joueurs d'Asie et remporté des championnats en Corée et en Chine, il est tout à fait capable d'écraser ses adversaires avec des champions tankys comme Poppy et Nautilus.</p>\n\n<p>Looper est bien souvent en première ligne pour RNG : il possède un réel talent pour utiliser la Téléportation et créer des situations favorables à son équipe, qui peut alors écraser ses adversaires lors d'un combat d'équipes ou contrer une rotation adverse en prenant les bonnes décisions.</p>\n\n<p>Alors qu'il jouait à l'origine un rôle de soutien avec Samsung White, il a su s'adapter au fil des différents patchs et constitue désormais un pilier central du line-up de RNG. C'est lui qui porte la lourde charge d'être un carry et une menace majeure au sein de l'équipe, et il est parfaitement synchronisé avec Mata. Vu le danger permanent qu'il incarne grâce à sa maîtrise de la Téléportation, ses adversaires réfléchiront toujours à deux fois avant de s'élancer hors de leur base.</p>\n\n<p>Ses performances ne sont d'ailleurs pas passées inaperçues : il a été nommé huit fois pour le titre de MVP lors du segment de printemps des LPL.\n</p>","es_ES":"<p>Hyeong-seok \"Looper\" Jang va con la cabeza bien alta como el jugador de la calle superior de RNG y, aunque otros de sus análogos son elogiados por la estabilidad y la regularidad, Looper tiene fama de ser un poco más agresivo. Era conocido inicialmente por su Singed, allá por 2013, pero desde entonces se ha transformado en un jugador polifacético. Añadió a Trundle y Rumble a su plantel durante la temporada de verano de la LPL, pero es más que capaz de expandirse, ya que ha demostrado su capacidad de hacer de tanque con Maokai o de ganar la partida con Irelia cuando haga falta.</p>\n\n<p>Con 23 años y una carrera que data de 2013, Looper es uno de los jugadores más adultos del Mundial, pero no dejéis que su larga trayectoria os engañe. Es un maestro que se deshizo de los nervios hace tiempo. Y ahora se concentra en la victoria.</p>","de_DE":"Hyeongseok „Looper“ Jang ist der neueste koreanische Top-Laner, der sein LCS-Debüt gibt. Das ehemalige Mitglied von Royal Never Give Up ist ein Veteran der Szene, der seine Karriere 2013 startete. Er wurde für seinen aggressiven Spielstil bekannt, aber seither hat sich Looper zu einem facettenreichen Top-Laner entwickelt. Der ehemalige Champion der LPL beherrscht es genauso gut, mit Maokai Schaden aufzusaugen wie mit Irelia Spiele im Alleingang zu entscheiden.\n</p>\nLooper unterstützt 2017 Echo Fox mit seinen vielen Talenten. Das Team hofft, dass sie mit diesem koreanischen Import mehr Erfolg haben, nachdem sich der letzte Koreaner, KFO, als Top-Laner nicht durchsetzen konnte. Loopers Erfolgsbilanz ist genau das, was Echo Fox so dringend braucht. Mit 23 Jahren ist er einer der älteren Spieler der LCS – aber man sollte sich nicht von seinem Alter täuschen lassen. Er hat noch immer genug Reserven und nur ein Ziel vor Augen: den Sieg.\n","pl_PL":"<p>Hyeong-seok „Looper” Jang jest doświadczonym weteranem górnej alei. Mając na koncie walki z najlepszymi zawodnikami z Azji, wygrywając mistrzostwa w Korei i Chinach, doskonale odnajduje się w tłuczeniu swoich przeciwników wytrzymałymi bohaterami, takimi jak Poppy czy Nautilus.</p>\n\n<p>Looper z reguły przewodzi RNG, ponieważ jest jednym z najlepszych graczy pod względem używania Teleportacji, aby tworzyć korzystne sytuacje dla swojej drużyny podczas walk drużynowych, lub przechytrzyć przeciwników w grach skupiających się na macro.</p>\n\n<p>Z początku miał bardziej wspierającą rolę podczas gry w Samsung White, ale przyzwyczajał się do zmian w różnych patchach i teraz jest głównym filarem składu RNG. Jego zadaniem w drużynie jest stanowienie zagrożenia dla wrogich prowadzących. Doskonale zgrywa się z Matą, a jego mistrzowskie stosowanie Teleportacji sprawia, że jego przeciwnicy muszą poważnie się zastanowić, zanim opuszczą swoją bazę.</p>\n\n<p>Jego wyniki nie zostały niezauważone, ponieważ był ośmiokrotnie nominowany na najlepszego gracza podczas wiosennego splitu LPL.</p>\n","pt_BR":"<p>Hyeong-seok \"Looper\" Jang marca presença como jogador do topo da RNG e enquanto outros topos são elogiados pela consistência e estabilidade, Looper tem um histórico de ser um pouco mais agressivo. Ele ficou conhecido inicialmente por seu Singed em 2013, mas Looper evoluiu muito desde então e agora é um jogador muito versátil. Ele escolheu Trundle e Rumble na etapa de verão da LPL, mas pode perfeitamente ampliar seu leque, pois já mostrou suas habilidades de tanque com Maokai e de carregador com Irelia quando foi preciso. Com 23 anos e uma carreira que remonta a 2013, Looper é um dos jogadores mais velhos do Mundial, mas não deixe que sua longa carreira o engane. Ele é um mestre que não se abala facilmente. Seu foco está apenas na vitória.</p>"},"foreignIds":{"drupalId":"683","TRLH1":"200000207","TRLH2":"200000111"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":264},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":264},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":264},{"id":191,"slug":"froggen","name":"Froggen","firstName":"Henrik","lastName":"Hansen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/froggen-ecvbey01.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-01-19T22:02:25.000Z","bios":{"en_US":"<p>One of the strongest control mage players in the world, Henrik “Froggen” Hansen is legendary in the mid lane on his favorite bird, Anivia. After rising to fame with CLG.eu utilizing a slow and methodical playstyle, Froggen and his squad went through a flurry of team and roster changes. From Evil Geniuses to Alliance, and then from Alliance to Elements, Froggen has had a tumultuous few years.</p>\n\n<p>After keeping Echo Fox from relegation by sheer force of will, Froggen has a new opportunity with 2017's retooled roster. With a former LPL champion in the top lane and a new jungler to gank his lane, the LCS icon is in a great spot to succeed. Now he just has to prove he's still got it after all these years. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">전장 장악형 마법사를 세계에서 가장 잘하는 선수 중 하나인 Henrik “Froggen” Hansen은, 애니비아 플레이로 오래 전부터 전설이 된 선수입니다. CLG.eu 시절 느리지만 정교한 플레이 스타일로 명성을 얻은 Froggen 선수는, 동료들과 함께 여러 번 팀을 바꾸었습니다. Evil Geniuses에서 Alliance로, 그리고 다시 Elements로, 지난 몇 년 간 평탄치 않은 시간을 보냈죠. </p>\n<p style=”font-family:”나눔고딕”;\">2015 유럽 LCS 스프링, 서머 스플릿에서 연속해서 7위를 기록한 Froggen 선수와 Elements가 세계 최고 수준의 팀들과 경쟁하려면 뭔가 근본적인 문제를 해결해야 한다는 사실은 자명해 보입니다. 하지만 Froggen 선수의 과거 활약을 생각해보면 아직 그에 대한 기대를 내려놓을 때는 아닙니다. 이번 올스타 대회가 부활의 신호탄을 올릴 수 있는 절호의 기회일지도 모르죠. </p>\n","fr_FR":"<p>Anivia le pigeon bleu. Est-il vraiment besoin de présenter Henrik « Froggen » Hansen ? Le Danois fait partie des quelques légendes de League of Legends encore en activité. Membre de la trilogie originale des dieux européens de la voie du milieu en saison 2, il déchaîne les foules depuis près de 4 ans. Considéré aujourd'hui encore comme le meilleur joueur d'Anivia au monde, Froggen porte avec lui le mythe de CLG.EU et des affrontements mythiques qu'il a menés contre Moscow 5 tout au long de la saison 2.</p>\n\n<p>Mais depuis, l'eau a coulé sous les ponts et le sort n'a pas été favorable au joueur. Dès la saison 3 et l'apparition des LCS, les anciens de CLG.EU ont souffert et laissé d'autres joueurs remporter titres et participation aux championnats du monde. Sentant que des changements étaient nécessaires, le joueur a alors construit autour de lui une équipe annoncée avant le début des LCS EU 2014 comme la première « superteam » de League of Legends. Malheureusement cette équipe construite pour tout gagner a enchaîné l'excellent et le bien moins bon, aussi bien capable de remporter un titre de champion des LCS EU lors du segment d'été que d'être la première équipe européenne à perdre contre des brésiliens lors du Championnat du monde 2014.</p>\n\n<p>La situation du Danois ne s'est pas arrangée en 2015 : il s'est retrouvé bien malgré lui à lutter non pas pour les titres mais pour éviter de se retrouver en tournoi de relégation des LCS EU. Pour la première fois de sa carrière, les critiques d'une partie du public ont été aussi sonores que l'enthousiasme de ses fans. L'ancien recordman du nombre de minions tués en un minimum de temps en compétitif s'est retrouvé considéré par certains comme un joueur trop passif et incapable de prises de décisions. Pire, l'arrivée en fanfare d'une nouvelle génération de joueurs professionnels a bousculé un peu plus chaque jour son statut de mid laner de classe mondiale.</p>\n\n<p>Alors Froggen a fait le grand saut, il est parti en NA, découvrir encore une nouvelle équipe et un nouvel environnement. Un nouveau défi, même s'il ne sera pas dépaysé de retrouver son vieil adversaire Alexey « Alex Ich » Ichetovkin dans les LCS NA. Un dernier défi peut-être aussi, pour celui qui doit plus que jamais prouver qu'il est toujours un monstre du jeu et pas seulement une ancienne gloire dépassée par la concurrence.</p>\n","pl_PL":"<p>Mało kto z europejskich graczy nie słyszał o Henriku \"Froggen\" Hansenie. Duńska ostoja doskonałości na mid-lanie imponuje fanom od pierwszego sezonu. Do grudnia 2011 próbował swojego szczęścia w różnych drużynach, z czego najcieplej wspomina poznanie przyjaciela – Mike’a \"Wickd\" Petersena. Wraz z nim pod koniec 2011 roku trafił do zespołu, gdzie spełniło się wiele z jego marzeń. W Counter Logic Gaming Europe Henrik spędził swój najbardziej owocny okres, konkurując na arenie światowej z najlepszymi ówczesnymi drużynami. W 2012 roku wygrał szereg poważnych i mniejszych międzynarodowych turniejów, lecz największym osiągnięciem było dostanie się na Mistrzostwa Świata drugiego sezonu. W związku z wejściem na arenę azjatyckich zespołów, drużyna CLG EU nie była faworytem, lecz udało im się wszystkich zaskoczyć. Nie tylko podołała wyjściu z grupy, ale również rozgromiła najstarszy chiński zespół Team WE w ćwierćfinale. W półfinale ekipie Henrika nie powiodło się tak dobrze, chociaż wygrali jeden mecz z trzech. Trzecia pozycja ex aequo na takim wydarzeniu była bardzo nobilitująca dla całego CLG EU. </p>\n<p>Wkrótce po tej imprezie drużyna została przemianowana na Evil Geniouses, lecz skład pozostał ten sam. Jednak w międzyczasie na profesjonalnej scenie pojawiło się wiele nowych talentów i konkurencja radykalnie urosła w siłę. W związku z czym „Froggen” nie odniósł tak oszałamiających sukcesów jak w poprzednim sezonie, nawet wiele osób nazwało wyniki EG w tym okresie przeciętnymi. Dlatego Henrik w grudniu 2013 roku opuścił wraz z przyjacielem Mike’iem bezpieczną przystań i w poszukiwaniu sukcesu stał się częścią nowej organizacji – Alliance. W niej osiągnął zdecydowanie więcej niż w poprzedniej drużynie, ponieważ po poznaniu własnych możliwości, w wiosennym sezonie EU LCS 2014, Alliance sięgnęło po złoto. W okresie letnim 2014 roku zajęła pierwsze miejsce w regularnych rozgrywkach, a następnie potwierdziła swoją dominację wygrywając również baraże. W ten sposób „Froggen” zagwarantował sobie udział w kolejnych Mistrzostwach Świata, tym razem sezonu 4. Niestety Alliance nie udało się wyjść z grupy, więc wyczyn z 2012 roku nie został powtórzony. Po tym wydarzeniu organizacja została przemianowana na Elements i zmieniła skład personalny zespołu. Jednak zmiany tylko pogorszyły sytuację Henrika, ponieważ jego drużyna w całym piątym sezonie wypadła przeciętnie, dwukrotnie zajmując 7 miejsce. Jak większość profesjonalnych graczy marzy o pokazaniu się na Mistrzostwach Świata, więc doszedł do wniosku, że musi podjąć radykalne kroki. Pod koniec roku 2015 przeniósł się do Ameryki Północnej żeby dołączyć do nowo powstałego zespołu Echo Fox – biorącego udział w wiosennym sezonie NA LCS 2016.</p>\n<p>„Froggen” osiągnął absolutne mistrzostwo w grze Anivią. W ciągu paru lat na scenie esportowej zyskał reputację najlepszego gracza tą postacią. Dlatego został wybrany do uczestnictwa w imprezie All-Stars Paris przez fanów po to, żeby zagrał Kriofeniksem. Osobistym wyczynem Henrika potwierdzającym jego masterię jest zwycięstwo z powszechnie znanym Lee’iem \"Faker\" Sang-hyeokiem. Zwyciężył z nim w pojedynku 1 vs 1 na wydarzeniu All-Stars Los Angeles 2015. Na tym nie kończą się prywatne sukcesy duńskiego mid-lanera – przez długi okres czasu był rekordzistą w zdobytej farmie w regularnych rozgrywkach. Pobił go Karthusem, zabijając 300 stworów w 23 minuty i 10 sekund.</p>","de_DE":"Mit seinem Lieblingsvögelchen Anivia hat sich Henrik „Froggen“ Hansen zu einem legendären Mid-Laner gemausert, der zu den stärksten Spielern der Welt gehört, die Magier mit Massenkontrolleffekten spielen. Nachdem er mit CLG.eu durch seinen langsamen und methodischen Spielstil zu Ruhm gekommen war, haben Froggen und seine Truppe eine Reihe an Mannschafts- und Aufstellungsänderungen durchgemacht. Froggen hat zwischen den Evil Geniuses, Alliance und Elements ein paar turbulente Jahre erlebt.\n</p>\nNachdem er Echo Fox durch reine Willenskraft vor dem Abstieg bewahren konnte, bietet sich 2017 mit der neuen Aufstellung eine neue Chance für ihn. Mit einem ehemaligen Champion der LPL auf der oberen Lane und einem neuen Jungler, der ihn auf der Lane unterstützt, befindet sich die LCS-Legende in einer guten Ausgangsposition. Jetzt muss er nur noch zeigen, dass er es nach all den Jahren immer noch drauf hat. \n","es_ES":"<p>\nHenrik “Froggen” Hansen es uno de los mejores jugadores del mundo con magos de control, y su Anivia mid es legendaria. Froggen dio el salto a la fama en CLG.eu gracias a su estilo de juego lento y metódico, y después de aquello tanto él como sus compañeros sufrieron una gran cantidad de cambios de equipo y plantilla. De Evil Geniuses a Alliance, y después a Elements. Froggen ha tenido unos años ajetreados. \n</p>\n<p>\nTras quedar en séptimo puesto en los splits de la LCS de 2015 de primavera y verano, está claro que Froggen y el resto de EL tienen que solucionar ciertos aspectos fundamentales antes de estar preparados para vencer a los mejores oponentes. Sin embargo, visto el rendimiento de Froggen, pensamos que no todo está perdido. El evento All-Star 2015 puede ser la ocasión perfecta para el resurgimiento de Froggen. \n</p>"},"foreignIds":{"drupalId":"80","TRLH1":"200000209","TRLH2":"200000113"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":354,"slug":"bigfatlp","name":"bigfatlp","firstName":"Michael","lastName":"Tang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bigfatlp-fvccyz4y.png","hometown":"Canada","region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2017-01-09T18:10:57.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"320"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":363,"slug":"keith","name":"Keith","firstName":"Yuri","lastName":"Jew","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keith-gmei2hih.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-05-24T21:45:13.000Z","bios":{"en_US":"Yuri \"Keith\" Jew has called himself \"the motivator.\" He was the player Liquid and TSM brought in to nip at the heels of an underperforming starter. He finally earned a starting role with Echo Fox in the 2016 NA LCS Summer Split, but he struggled to find his footing. Fortunately, he showed up when it counted, helping Echo Fox avoid relegation against NRG Esports.\n</p>\n<p>After a rough spring split in the bot lane with his new support Gate, Keith will look to bounce back this summer. While his positioning has been suspect, he's proven willing to play a more supportive role as ADC. With playmakers like Akaadian and Froggen on your team, sometimes all it takes is one Enchanted Crystal Arrow for Echo Fox to take a victory. </p>\n","fr_FR":"<p>Yuri « KEITH » Jew est le roi des « memes » et des réactions humoristiques sur internet. C'est aussi un carry AD nord-américain dont tout le monde reconnaît le talent et le titulaire d'Echo Fox sur ce rôle. Mais malgré quelques apparitions dans les LCS NA au cours de la saison 2015, KEITH est pour le moment connu du grand public avant tout pour sa personnalité, particulièrement aux États-Unis et sur Reddit.</p>\n\n<p>Pourtant, ce joueur d'à peine 18 ans n'est pas passé inaperçu lors de son bref passage en LCS NA, bien au contraire. Souvenez-vous, c'était au début du segment de printemps 2015 et tous les yeux étaient tournés vers Team Liquid après que l'organisation eut réussi à faire venir l'ancien champion du monde Chae « Piglet » Gwang-jin en Amérique du Nord. Mais hélas, impossible d'obtenir un visa pour le Coréen avant le début de la saison. C'est là qu'est entré en scène celui qui s'appelait alors KEITHMCBRIEF (oui, tout en majuscules!), engagé comme remplaçant pour les premiers matchs de la saison. Une pression énorme ? Pas pour le jeune carry AD, auteur de performances éclatantes lors de ses premiers matchs en tant que professionnel, avec deux victoires à la clé. Mieux encore, en raison des performances décevantes de Piglet lors des semaines suivant son arrivée, KEITH a eu le plaisir d'être rappelé deux semaines en cours de saison par Team Liquid. Pour prendre, un temps, la place d'un ancien champion du monde. Une sacrée carte de visite, d'autant plus quand on sait qu'il a réalisé à cette occasion des matchs plus qu'honorables, avec notamment une fiche de 9/1/12 sur Caitlyn. Après un retour infructueux en Challenger series, le joueur a de nouveau fait office de joker de luxe des LCS NA en remplaçant cette fois Jason « WildTurtle » Tran pour un match.</p>\n\n<p>Cette saison, c'est en tant que titulaire d'une toute nouvelle équipe que le jeune joueur va retrouver et affronter ceux qu'il remplaçait hier. Toujours sans pression, mais sans nul doute avec l'envie de bien faire.</p>\n","pl_PL":"<p>\"KEITH\" zainteresował się profesjonalną sceną w połowie 4 sezonu. Wcześniej grał w inne tytuły typu MOBA, lecz ostatecznie najbardziej spodobało mu się League of Legends, dlatego w maju 2014 roku dołączył do Team Gyrations. Tam miał okazję nabrać doświadczenia i poznać przyszłe sławy, takie jak: „NintendudeX” I “Adrian”. Dopiero w kolejnym zespole zaczął odnosić widoczne sukcesy, gdyż będąc w Team LoLPro zagrał w turnieju rozszerzającym skład NA LCS. Szansę Yuriego na coś więcej zostały przekreślone przez Team Coast, który pokonał jego drużynę we wczesnym stadium wydarzenia. Mogło to wynikać z tego, że \"KEITH\" w Team LoLPro zajmował pozycję supporta, a jego główną rolą jest AD Carry. </p>\n<p>W styczniu 2015 roku został zrekrutowany do Team Liquid Academy, co dało mu niesamowite możliwości rozwoju. Pierwszą okazję dostał kiedy na początku wiosennego sezonu 2015 główny AD Carry Team Liquid, „Piglet”, miał problemy z wizą. W związku z tym Yuri został poproszony o wystąpienie jako substytut w regularnym sezonie NA LCS. To był milowy krok w jego karierze profesjonalnego zawodnika, gdyż okazało się, że doskonale sobie radzi wśród najlepszych graczy. Już w pierwszym tygodniu wygrał z takimi potęgami jak Team Impulse i Counter Logic Gaming. Po powrocie brakującego AD, \"KEITH\" grał w szeregach Team Liquid Academy w Challenger Series, niestety bez większych sukcesów. Została mu również dana szansa na miejsce w głównym składzie Team SoloMid, jednak zagrał tylko w jednym tygodniu, po czym organizacja zdecydowała się wrócić do poprzedniego AD Carry. </p>\n<p>Ulubionym bohaterem Yuriego bez wątpienia jest Lucian. Grając głównie Klerykiem Broni siał zniszczenie wśród nieprzyjaciół, dzięki czemu szybko znalazł się w Kręgu Pretendenta. W profesjonalnych rozgrywkach nie dane mu było zagrać ukochaną postacią, lecz mimo tego poradził sobie śpiewająco. Reprezentując Team Liquid podczas NA LCS zaskoczył widzów swoimi zdolnościami w grze między innymi Corkim, Caitlyn i Kog’Mawem. Ciekawostką jest to, że pseudonim Yuriego jest pisany dużymi literami, ponieważ pragnął większej uwagi.</p>\n","de_DE":"Yuri „Keith“ Jew nannte sich selbst „der Motivator“. Er war der Spieler, den Liquid und TSM einwechselten, wenn einer der Stammspieler eine schwache Leistung ablieferte. Im Sommer-Split der NA LCS 2016 konnte er sich schließlich einen Startplatz bei Echo Fox sichern, aber er hatte Schwierigkeiten, seinen Rhythmus zu finden. Zum Glück konnte er gegen NRG Esports seine ganze Leistung abrufen und damit den Abstieg von Echo Fox verhindern.\n</p>\nIn seinem zweiten Split hat Keith erneut die Chance, als AD-Carry von Echo Fox zu glänzen. Wenn er gut mit seinem neuen Supporter Gate harmoniert, könnte die untere Lane von Echo Fox für eine Überraschung in der NA LCS sorgen. Dieses Jahr wird er nicht strauchelnde AD-Carrys ersetzen, sondern versuchen, mit seiner Mannschaft die Top-Teams der NA LCS ins Schwitzen zu bringen.\n"},"foreignIds":{"drupalId":"2999","TRLH1":"200000210","TRLH2":"200000114"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":500,"slug":"remilia","name":"Remilia","firstName":"Maria","lastName":"Creveling","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/remilia-2xae9ut5.png","hometown":"USA","region":"NA LCS","birthdate":"1995-02-02","createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-09T22:17:03.000Z","bios":{"en_US":"<p>\nMaria \"Remi\" Creveling is one of the most mechanically skilled up-and-coming supports in North America. Commonly known as \"MadWife\" due to her <a href=\"https://www.youtube.com/watch?v=Ju3VybZ3HY8\" target=\"_blank\">impeccable Thresh hooks</a>, Remi can (and has) single-handedly turned the tides of a game due to her individual skill.\n</p>","fr_FR":"<p>Maria « Remilia » Creveling est l'un des supports les plus prometteurs d'Amérique du Nord en termes de\n\nmécaniques de jeu. Également surnommée « MadWife » grâce à ses lancers de grappin impeccables \n\navec Thresh, Remilia peut renverser la tendance d'une partie à elle toute seule grâce à son talent \n\nindividuel (ce qu'elle ne se gêne pas pour faire). Bien qu'elle fasse ses débuts aux LCS NA, Remilia a \n\naccompli suffisamment d'exploits durant les Challenger Series NA et en file solo pour qu'on puisse avoir \n\nla certitude qu'elle saura terroriser son adversaire.</p>","pl_PL":"<p>To absolutnie unikatowy członek LA Renegades. Patrząc na jej mało znaną przeszłość, nikt się nie spodziewał, że w sezonie 6 to właśnie ona zapisze się na stałe w kartach historii League of Legends. Jest pierwszą kobietą, która wzięła udział w rozgrywkach LCS. Jednak dużo ciekawsza od tego faktu jest jej droga do tego celu. Podróż Marii do NA LCS rozpoczęła się bardzo wcześnie - chociaż pasjonuje się dziełem Riot Games od wczesnego pierwszego sezonu, to do trzeciego nie brała udziału w konkursowych rozgrywkach. W lipcu 2013 na miesiąc dołączyła do Curse Academy i miała okazję zagrać w MOBAFire Challenger Series. Przez kolejne 2 lata szukała swojego miejsca na profesjonalnej scenie League of Legends. Maria miała okazję grać z wieloma znanymi zawodnikami, jak np. \"Chaox”. Kompetencje zdobyte podczas tych poszukiwań, sprawiły, że stała się powszechnie znana i poważana wśród profesjonalnych graczy. W marcu 2015 roku dołączyła do Misfits i od tego momentu zaczęły się jej sukcesy.</p>\n<p>Pierwszym znaczącym wyczynem była wygrana w AlphaDraft Challenger League na przełomie kwietnia i maja 2015 roku. Maria i jej zespół przegrali tylko jeden mecz podczas całego wydarzenia. Następnie skończyła Challenger Series z rewelacyjnym wynikiem 8:2, jednak w dogrywce ulegli Team Coast. Ostatecznie w meczach barażowych pokonali Team Imagine 2:1, a następnie Team Coast 3:2. W ten sposób \"Remilia\" stała się pierwszą kobietą, która została zakwalifikowana do rozgrywek LCS. </p>\n<p>Doskonale widać jak Maria rozwijała swoje umiejętności podczas kolejnych sezonów – zaczynała od złota w pierwszym sezonie, a w każdym kolejnym była o szczebel wyżej. W społeczeństwie League of Legends często jest nazywana „Madwife”, ze względu na wyjątkowe umiejętności w grze swoim ulubionym bohaterem – Threshem. Jednak żaden bohater nadający się jako suport nie jest jej obcy. Grając w szeregach LA Renegades wielokrotnie pokazywała, że również potrafi grać na najwyższym poziomie Morganą, Nautilusem oraz Janną. Dużo można się dowiedzieć o jej preferencjach z portali społecznościowych, gdyż jest wyjątkowo aktywna m.in. na Twitterze. Już po pierwszym rzucie oka na profil Marii widać, że uwielbia anime, co też przysporzyło jej wielu wielbicieli.</p>\n"},"foreignIds":{"drupalId":"1327","TRLH1":"1001220129","TRLH2":"1001160179"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":607,"slug":"grigne","name":"Grig","firstName":"Jonathan","lastName":"Armao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/grigne-1oxeggm8.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-10T18:09:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3803","ESPORTSTMNT02":"200000546","TRLH1":"200000213","TRLH2":"200000117"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1359,"slug":"brandini","name":"Brandini","firstName":"Brandon","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brandini-3s9xhgwg.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-06-12T20:15:57.000Z","updatedAt":"2017-07-16T22:42:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000670","TRLH1":"200000616"},"socialNetworks":{},"champions":[],"liveGameTeam":169}],"scheduleItems":[{"id":"AVmEyNMeQMQFcjhwbQqa","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:1dd35973-9bf7-4f33-aae2-47d3bddf8e9b","scheduledTime":"2017-01-29T20:00:01.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4","blockLabel":"2","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:95ada0b9-bece-48cc-bd48-d9ee5bde901e"},"match":"1dd35973-9bf7-4f33-aae2-47d3bddf8e9b","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"95ada0b9-bece-48cc-bd48-d9ee5bde901e","league":"2"}],"gameIdMappings":[{"id":"db9024c9-d524-4abe-bab1-c94417d74b09","gameHash":"bccfef0c2162bafb"},{"id":"453d75cc-a158-4c58-8f3f-fa7ca645a184","gameHash":"a514722881038084"},{"id":"d6fe58a3-121a-41c7-863b-1f80c93aba44","gameHash":"8c5017b8c167bc4e"}],"videos":[{"id":5272,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:db9024c9-d524-4abe-bab1-c94417d74b09","source":"https://www.youtube.com/embed/Jw0RXOQjwG0?wmode=transparent","createdAt":"2017-01-29T22:35:32.000Z","updatedAt":"2017-01-29T22:35:32.000Z","game":"db9024c9-d524-4abe-bab1-c94417d74b09"},{"id":5273,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:453d75cc-a158-4c58-8f3f-fa7ca645a184","source":"https://www.youtube.com/embed/qv0srmfkTL0?wmode=transparent","createdAt":"2017-01-29T23:02:11.000Z","updatedAt":"2017-01-29T23:02:11.000Z","game":"453d75cc-a158-4c58-8f3f-fa7ca645a184"},{"id":5275,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:d6fe58a3-121a-41c7-863b-1f80c93aba44","source":"https://www.youtube.com/embed/JwPifibk7A8?wmode=transparent","createdAt":"2017-01-29T23:44:21.000Z","updatedAt":"2017-01-29T23:44:21.000Z","game":"d6fe58a3-121a-41c7-863b-1f80c93aba44"}],"htmlBlocks":[],"match":{"id":"1dd35973-9bf7-4f33-aae2-47d3bddf8e9b","name":"FOX-vs-FLY","position":9,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"games":{"db9024c9-d524-4abe-bab1-c94417d74b09":{"id":"db9024c9-d524-4abe-bab1-c94417d74b09","name":"G1","generatedName":"FLY|FOX|G1|1dd359739bf74f33aae","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"standings":{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485729421062,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485723137309,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002040367","gameRealm":"TRLH1","platformId":"TRLH1:1002040367","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"453d75cc-a158-4c58-8f3f-fa7ca645a184":{"id":"453d75cc-a158-4c58-8f3f-fa7ca645a184","name":"G2","generatedName":"FLY|FOX|G2|1dd359739bf74f33aae","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"},{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],"standings":{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}]],"timestamp":1485730822506,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}]],"timestamp":1485726068675,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002040389","gameRealm":"TRLH1","platformId":"TRLH1:1002040389","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d6fe58a3-121a-41c7-863b-1f80c93aba44":{"id":"d6fe58a3-121a-41c7-863b-1f80c93aba44","name":"G3","generatedName":"FLY|FOX|G3|1dd359739bf74f33aae","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"standings":{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485729374919,"source":"manual","note":"Updated from HQ 2","closed":true},"scores":{},"gameId":"1002040391","gameRealm":"TRLH1","platformId":"TRLH1:1002040391","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485730822506,"source":"bestOf","history":[{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485729421063,"source":"bestOf","closed":true},{"result":[[{"roster":"5e54260f-c117-4f2f-91cb-38c53ad85e82"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1485729374919,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"aa51266a-790a-41e9-8b71-9912e41a3c22":0,"5e54260f-c117-4f2f-91cb-38c53ad85e82":1}}}