{"teams":[{"id":72,"slug":"enemy-esports","name":"Enemy","guid":"be6dec22-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/enemy-esports-hash116b.png","acronym":"NME","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2015-05-26T21:11:28.000Z","updatedAt":"2016-03-03T00:06:11.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3494"},"players":[117,162,319,355,778,1096],"starters":[117,319,355,778],"subs":[162,1096]},{"id":185,"slug":"ember","name":"Ember","guid":"be71038e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/ember-4uu51lk6.png","acronym":"MBR","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-01-20T21:19:05.000Z","updatedAt":"2016-03-09T02:08:25.000Z","bios":{},"foreignIds":{},"players":[63,185,250,255,333,529,1105,1120],"starters":[185,250,333,529,1105],"subs":[63,255,1120]}],"players":[{"id":63,"slug":"gleeb","name":"Gleeb","firstName":"Nicolas","lastName":"Haddad","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/gleeb-aa87xfc9.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2016-03-08T00:26:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1577","TRLH1":"1001270010","TRLH2":"1001200010","FRA1TMNT1":"375195"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":117,"slug":"otter","name":"Otter","firstName":"Brian","lastName":"Thomas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/otter-diqco9ek.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2016-05-23T19:16:51.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"341","TRLH2":"1001090004","TRLH1":"1001090008","FRA1TMNT1":"375280"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":162,"slug":"thinkcard","name":"Thinkcard","firstName":"Thomas","lastName":"Slotkin","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/thinkcard-5l3tmaep.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-01-21T15:36:43.000Z","bios":{"en_US":"","fr_FR":"<p>\nThomas « Thinkcard » Slotkin a bâti sa réputation de jungler agressif aux Challenger Series NA. Il a été titulaire chez Counter Logic Gaming au cours d'événements internationaux comme la Saison IX des IEM de Cologne en 2015. Thinkcard est remplaçant chez Counter Logic Gaming depuis 2015. \n</p>","es_ES":"<p>\nThomas ''Thinkcard'' Slotkin se labró su reputación como jungla agresivo en la Challenger Series de NA. En 2015 ha jugado como titular con Counter Logic Gaming en torneos internacionales como el IEM Season IX de Colonia. Se unió a la disciplina de este equipo en 2015, en principio como suplente. \n</p>","de_DE":"<p>\nThomas „Thinkcard“ Slotkin genoss in der NA Challenger Series den Ruf eines aggressiven Junglers. Bei internationalen Veranstaltungen, wie dem IEM Season IX 2015 in Köln, trat er als Starter für Counter Logic Gaming an. 2015 kam Thinkcard als Ersatzspieler zu Counter Logic Gaming\n</p>","pl_PL":"<p>\nThomas „Thinkcard” Slotkin znany jest w północnoamerykańskim kręgu Pretendenta jako agresywny dżungler. Wystąpił w podstawowym składzie Counter Logic Gaming podczas wielu międzynarodowych zawodów, takich jak IEM Season IX, który odbył się w 2015 r. w Kolonii. Thinkcard dołączył do Counter Logic Gaming jako rezerwowy prowadzący w 2015 r. \n</p>","es_AR":"<p>Thomas \"Thinkcard\" Slotkin es el junglero suplente de Cloud9.</p>"},"foreignIds":{"drupalId":"2191","TRLH1":"200000206","TRLH2":"200000110"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":185},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":319,"slug":"obvious","name":"Obvious","firstName":"Dennis","lastName":"Sørensen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/obvious-ihi4kidd.png","hometown":"Danimarka","region":"Turkey Championship League","birthdate":null,"createdAt":"2015-01-19T23:39:47.000Z","updatedAt":"2017-06-29T17:24:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1933","TRLH3":"1001000136","TRLH4":"1001000136","FRA1TMNT1":"375279","esportstmnt05":"200000945","ESPORTSTMNT03":"200001277","ESPORTSTMNT04":"200002769"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":355,"slug":"i-kenny-u","name":"i KeNNy u","firstName":"Kenny","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/i-kenny-u-2kax4k3x.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2016-01-28T19:28:25.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1821","FRA1TMNT1":"375370"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":778,"slug":"wolfe","name":"Wolfe","firstName":"Michael","lastName":"Taylor","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/wolfe-3z6zywb8.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2015-06-03T20:26:47.000Z","updatedAt":"2016-02-20T00:06:56.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2562","FRA1TMNT1":"375176"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":72},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":185}],"scheduleItems":[{"id":"AVJnQ41SOPWArxM1l4cB","content":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:match:1e5e6652-5963-4246-bffa-4127869077f7","scheduledTime":"2016-02-11T04:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3","blockLabel":"3","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:bracket:808879a2-c11c-412f-9369-55e87c09e526"},"match":"1e5e6652-5963-4246-bffa-4127869077f7","tournament":"d35712b5-b3b9-4579-b88f-2b3999d9dda3","bracket":"808879a2-c11c-412f-9369-55e87c09e526","league":"4"}],"gameIdMappings":[{"id":"6e9e5d02-440c-4731-9aa6-5d297c3b4c55","gameHash":"a4d0abdf67cbe283"},{"id":"db510364-f930-4631-b3ad-3bd1f0ad51c4","gameHash":"d122154446c8f138"}],"videos":[{"id":815,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:db510364-f930-4631-b3ad-3bd1f0ad51c4","source":"https://www.youtube.com/embed/ANGPy6-wjvc?wmode=transparent","createdAt":"2016-02-11T05:36:41.000Z","updatedAt":"2016-02-11T05:36:41.000Z","game":"db510364-f930-4631-b3ad-3bd1f0ad51c4"},{"id":883,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:6e9e5d02-440c-4731-9aa6-5d297c3b4c55","source":"https://www.youtube.com/embed/jI73UUXtNRo?wmode=transparent","createdAt":"2016-02-13T19:05:05.000Z","updatedAt":"2016-02-13T19:05:05.000Z","game":"6e9e5d02-440c-4731-9aa6-5d297c3b4c55"}],"htmlBlocks":[],"match":{"id":"1e5e6652-5963-4246-bffa-4127869077f7","name":"NME-vs-MBR","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],"games":{"6e9e5d02-440c-4731-9aa6-5d297c3b4c55":{"id":"6e9e5d02-440c-4731-9aa6-5d297c3b4c55","name":"G1","generatedName":"MBR|NME|G1|1e5e665259634246bff","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"}]],"timestamp":1455161367819,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"890279","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:890279","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"db510364-f930-4631-b3ad-3bd1f0ad51c4":{"id":"db510364-f930-4631-b3ad-3bd1f0ad51c4","name":"G2","generatedName":"MBR|NME|G2|1e5e665259634246bff","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"},{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"}],"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"}]],"timestamp":1455165120926,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"890291","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:890291","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"6b5a7673-0fec-4929-8fbb-01851aa39ea0"}]],"timestamp":1455165120926,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"6b5a7673-0fec-4929-8fbb-01851aa39ea0":0,"5454d235-8c61-4d9a-ab84-2c08e2c54a99":3}}}