{"teams":[{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]},{"id":228,"slug":"misfits","name":"Misfits","guid":"be7195b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/misfits-8fnvxt30.png","acronym":"MSF","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2016-06-03T15:47:57.000Z","updatedAt":"2017-06-07T08:47:16.000Z","bios":{"en_US":"<p>Misfits performed extremely well in the European Challenger circuit, amassing win after win on their way to punching their EU LCS tickets. After making it into the LCS, the team underwent some roster changes, adding PowerOfEvil, and the surprise signing of veteran KaKAO. The team spent time in Korea bootcamping in order to prepare themselves for the next level of competition. With a great mix of veteran leadership and fresh faces, Misfits has a chance to make an unexpected splash this season.</p>\n\n<p>Coach: Hussain Moosvi</p>\n<p> Team Manager: Andy \"CrazyCaps\" Walda</p>","de_DE":"<p>Die Misfits wurden aus der Asche der Renegade: Banditos geboren, nachdem deren Dachgesellschaft aus der LCS verbannt worden war. Die Einheit schlug sich in der europäischen Challenger Series extrem gut und gewann ein Spiel nach dem anderen, bevor sie endlich das Ticket für die EU LCS lösen konnte. Nachdem es die Mannschaft in die LCS geschafft hatte, veränderte sich ihre Aufstellung durch die Zugänge von PowerOfEvil und dem Veteranen KaKAO. Die Mannschaft verbrachte einige Zeit in Korea, um dort zu trainieren und sich auf die Konkurrenz vorzubereiten. Dank der großartigen Mischung aus erfahrenen Anführern und frischen Gesichtern könnten die Misfits diesen Frühling für die ein oder andere Überraschung sorgen.</p>\n<p>Coach: Hussain \"Hussain\" Moosvi</p>\n<p>Mannschaftsleiter: Andy \"CrazyCaps\" Walda</p>","es_ES":"<p>Misfits rindió extremadamente bien en el Challenger Series europeo al conseguir una victoria tras otra en su camino hasta la LCS EU. Después de llegar a la LCS, Misfits ha sufrido algunos cambios de plantel con la adquisición de PowerOfEvil y el sorprendente fichaje del veterano KaKAO. El equipo ha estado en Corea entrenando para prepararse para el siguiente nivel de la competición. Con una gran mezcla de liderazgo veterano y rostros nuevos, Misfits tiene la oportunidad de dejar huella de forma inesperada durante esta temporada.</p>\n\n<p>Entrenador principal: Hussain Moosvi</p>\n<p>Jefe de equipo: Andy \"CrazyCaps\" Walda</p>\n","fr_FR":"<p>Les Misfits ont enregistré d'excellentes performances dans le circuit Challenger européen, enchaînant les victoires et décrochant ainsi leur place aux LCS EU. Après sa sélection pour les LCS, l'équipe a procédé à quelques changements de formation, avec l'ajout de PowerOfEvil et l'arrivée surprise du vétéran KaKAO. L'équipe a passé du temps à s'entraîner en Corée afin de se préparer à un niveau de compétition supérieur. En mélangeant des leaders vétérans et de nouveaux visages, Misfits a une chance de faire un coup d'éclat inattendu cette saison.</p>\n\n<p>Entraîneur principal : Hussain Moosvi</p>\n<p>Responsable d'équipe : Andy « CrazyCaps » Walda</p>\n","pl_PL":"<p>Misfits spisali się naprawdę dobrze podczas europejskich rozgrywek serii Pretendenta, zdobywając jedno zwycięstwo po drugim i zapewniając sobie wstęp do EU LCS. Po dostaniu się do LCS drużyna przeszła kilka zmian składu, dodając PowerOfEvila i zaskakując wszystkich podpisaniem kontraktu z weteranem KaKAO. Drużyna spędziła nieco czasu na obozie treningowym w Korei, chcąc przygotować się do walki na nowym poziomie rywalizacji. Dzięki świetnemu połączeniu przywództwa weteranów i entuzjazmu świeżej krwi, Misfits mają szanse osiągnąć niespodziewany sukces podczas tego sezonu.</p>\n\n<p>Główny trener: Hussain Moosvi</p>\n<p>Menedżer drużyny: Andy „CrazyCaps” Walda</p>\n"},"foreignIds":{},"players":[87,243,357,392,628,1090,1334],"starters":[243,357,628,1090,1334],"subs":[87,392]}],"players":[{"id":87,"slug":"h1iva","name":"H1Iva","firstName":"Aleksi","lastName":"Kaikkonen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/h1iva-3d3cbqxm.png","hometown":null,"region":"Challenge France","birthdate":"1994-08-31","createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-05-27T01:11:02.000Z","bios":{"en_US":"","fr_FR":"<p> H1iva est un support de niveau Challenger. C'est un joueur qui connaît bien la scène professionnelle de League of Legends, après avoir joué dans les équipes Gamers 2 ou Renegades en Challenger Series. Pour cette saison 2016-2017, il rejoint l'équipe Millenium aux objectifs européens.\nSes exploits avec la Team Forge et Renegades ont permis au finlandais de se démarquer et d'acquérir une certaine renommée dans son pays d'origine. Très bon joueur de Tresh, il compte bien prouver à la communauté française qu'il saura être au niveau et mener ses coéquipiers vers la victoire. </p>","cs_CZ":""},"foreignIds":{"drupalId":"1496","TRLH3":"1000145041","TRLH4":"1000125041","FRA1TMNT1":"375321","TRNA1":"1000525385","TREU":"1000565129","FRA1TMNT2":"25245"},"socialNetworks":{"twitter":"https://twitter.com/HiivaLoL"},"champions":[],"liveGameTeam":228},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":243,"slug":"powerofevil","name":"PowerOfEvil","firstName":"Tristan","lastName":"Schrage","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/powerofevil-dvzrzaxn.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T10:20:35.000Z","bios":{"en_US":"<p>Tristan “PowerOfEvil” Schrage has skill well beyond his years. PowerOfEvil is best known for his mechanical outplays, especially on Cassiopeia, Syndra, and Orianna. And if you don't know him for his mechanical ability, you probably know him for his bizarre champion picks in the mid lane -- we're looking at you, Smite Kayle... with Devourer. PowerOfEvil's success led him to a new team at the end of 2015 -- Origen.</p>\n\n<p>Even under the tutoring of 2016 All-Star mid laner xPeke, PowerOfEvil struggled to find his groove and eventually left Origen at the end of the year. He’s still brimming with untapped potential, and Misfits decided to pick him up in order to bolster their roster. A change of scenery may finally unlock all the talent that has only been seen in spurts since his move to Origen. The time has come for PowerOfEvil to show that his resilience has lead to growth. It’s now or never for the youngster and the stakes can’t get much higher.</p>","pl_PL":"<p>Tristan rozpoczął piąć się w górę w czwartym sezonie, kiedy zaczął być rozpoznawalny w społeczeństwie League of Legends jako naprawdę silny mid-laner. Co prawda grał w różnych drużynach, lecz skupiał się głównie na grze ESL Pro Series i Challenger Series. Jego celem było dostanie się do rozgrywek EU LCS. Ostatecznie dołączył do zespołu Unicorns Of Love, jednak po przegranej z Ninjas in Pyjamas opuścił go na miesiąc. Po tym meczu bardzo pozytywnie wypowiedział się o nim „Alex Ich”, weteran sceny esportowej, będący pod wrażeniem jego umiejętności na mid-lanie. Kiedy \"PowerOfEvil\" wrócił do różowej drużyny, ona w międzyczasie dostała się do turniej kwalifikacyjnego do wiosennego sezonu LCS 2015. To zmobilizowało go do poprawy swoich wyników. Pomimo przegranej z H2K, udało mu się dokonać zemsty na zespole NiP, wygrywając z nim. Dzięki temu zwycięstwu znalazł się w EU LCS 2015.</p>\n<p>\nKiedy \"PowerOfEvil\" znalazł się na profesjonalnej scenie, miał okazję zademonstrować publice swoje najsilniejsze strony. Poprowadził Unicorns Of Love do wielu zwycięstw w wiosennym sezonie 2015, bezlitośnie niszcząc przeciwników Syndrą i Cassiopeią – jednymi ze swoich ulubionych bohaterów. Jego zdolność do zdobywania przewagi samemu, bez dużej pomocy drużyny, sprawiła, że miał też dużą swobodę np. w wyborze postaci. Dzięki dominującej postawie Tristana UOL skończył ten okres na piątym miejscu, czyli naprawdę przyzwoicie. On sam dwukrotnie został wytypowany MVP tygodnia w tym semestrze LCS. Z kolei w letnim sezonie 2015 \"PowerOfEvil\" pokazał jak bardzo niebezpieczny jest grając Orianną i Kog’mawem. Tym razem udało mu się wnieść swoją różową drużynę aż na czwarte miejsce w tym okresie, co jak na gracza, który dopiero w tym roku znalazł się w EU LCS, było niezwykłym osiągnięciem.</p>\n<p>\nNa początku sezonu 6, 13 listopada 2015, Tristan dołączył do zespołu Origen jako szósty zawodnik. Został uznany za tak dobrego mid-lanera, że został z otwartym ramionami przyjęty do drużyny, która dotarła aż do półfinału na ostatnich Mistrzostwach Świata. Swoje członkostwo w nowej organizacji zaczął od sukcesów – wraz z nią wygrał trzecią część 10 sezonu IEM w San Jose. Pokonał tam doświadczone amerykańskie zespoły Team SoloMid i Counter Logic Gaming, nie przegrywając ani jednej gry. To jego pierwsze i prawdopodobnie nie ostatnie tak zdecydowanie zwycięstwo.</p>\n<p>\nPoza mid-lanem PowerOfEvil\" lubi też grać na top-lanie i jako support, lecz zapowiedział już, że na pewno nie zmieni swojej roli. Tak samo jak swojego pseudonimu, którego używał w innych grach przed swoją karierą świecie Runeterry. Jest dumny ze swojej odporności na porażki i panowania nad własnymi emocjami. Na co dzień \" Tristan jest chłopakiem z Bad Soden, w Niemczech, który niegdyś marzył o zostaniu pilotem i lataniu po całym świecie. Zamiast tego, starszy brat zachęcił go do gry w League of Legends, więc realizuje swoje marzenia latając na i wygrywając turnieje. Poza grą na komputerze lubi grać w tenisa i piłkę nożną z przyjaciółmi. Ma szczęście posiadając rodziców, którzy pomimo tego, że woleliby żeby skończył szkołę, wspierają go i pomagają osiągnąć jego cele. </p>\n","es_ES":"<p>Integrante de una familia de ávidos jugones, no es de extrañar que Tristan ‘PowerOfEvil’ Schrage tenga un instinto natural para los videojuegos. Su hermano siguió la estela de su padre, que desde pequeño le introdujo al mundillo ya que acudía a concentraciones de jugadores, y se convirtió en su mentor tras enseñarle el universo de Runaterra.</p>\n\n<p>El alumno, que ocupó la calle central al ser el único rol disponible entre sus amigos, no tardó mucho en superar al maestro. Aunque ambos escalaron posiciones en el ránking hasta alcanzar el rango Aspirante y se iniciaron juntos en el ámbito competitivo con Team Mistral, Gunnar Schrage decidió centrarse en sus estudios. Por contrapartida, PowerOfEvil persiguió la carrera del jugador profesional.</p>\n\n<p>El alemán se unió a EYES ON U, una modesta entidad cuya división europea compitió en la Challenger Series durante la primera mitad de la edición primaveral. Descontento con los mediocres resultados del equipo, que no alcanzó los Playoffs, PowerOfEvil pasó a jugar en dos escuadras al mismo tiempo: por un lado participaba en la ESL Pro Series con Planetkey Dynamics; por otro, ingresó en las filas de Unicorns of Love para volver a competir en la Challenger Series.</p>\n\n<p>Aunque esta vez sí alcanzó la fase eliminatoria, la derrota contra Ninjas in Pyjamas en los cuartos de final le hizo abandonar a los equinos. Para cuando decidió volver a Unicorns of Love, el equipo había logrado la clasificación para los Playoffs de verano. Esta vez galoparon por encima de los ninjas suecos, que les habían derrotado en dos ediciones consecutivas, y consiguieron el pase al Torneo de Promoción.</p>\n\n<p>Aquella eliminatoria contra Millenium supuso la eclosión de Unicorns of Love, que se metió al público en el bolsillo con una quinta partida épica en la que PowerOfEvil destruyó el nexo de los franceses con los últimos puntos de vida que le quedaban a su emblemática Cassiopeia. Sin embargo, fue la primera Intel Extreme Masters celebrada en San José la que catapultó definitivamente a PowerOfEvil al estrellato.</p>\n\n<p>Unicorns of Love acudió al evento gracias a la votación en masa de sus nuevos seguidores, pero aun así llegaba como tapado. Puede que por esta razón el cuerpo técnico de Team SoloMid pasara por alto a Syndra en la fase de selección de campeones, algo que el alemán aprovechó para destrozar a Søren ‘Bjergsen’ Bjerg. Los unicornios no se llevaron el trofeo a casa, pero el joven que quería ser piloto voló de vuelta a casa con una legión de aficionados a sus espaldas.</p>\n\n<p>Ya en la LCS, PowerOfEvil se consolidó como la mayor amenaza de Unicorns of Love, que hizo historia al ganar en los Playoffs al primer clasificado de la fase regular, SK Gaming, gracias a un crucial robo de Barón del mid con Orianna. En la final contra Fnatic sorprendió con Varus, una de sus innovadoras aportaciones al metajuego, pero no fue suficiente para llevarse la corona. Durante el split de verano de la LCS EU 2015, PowerOfEvil continuó siendo el motor de los suyos con campeones relevantes en fases tardías de la partida, como Kog’Maw u Orianna.</p>\n\n<p>Aunque los unicornios no emularon su exitoso paso por los Playoffs, el buen rendimiento del alemán captó la atención de Origen, el equipo que le privó de participar en el Campeonato Mundial 2015. Con sus nuevos compañeros regresó a San José para, esta vez sí, conquistar el campeonato como reemplazo de Enrique ‘xPeke’ Cedeño, uno de los jugadores a los que admira y con el que compartirá el puesto en 2016.</p>","fr_FR":"<p>Le jeune espoir Tristan « PowerOfEvil » Schrage est la première recrue d’Origen depuis la création de la structure. En 2014, le mid laner participe aux Challengers series mais son équipe ne signe pas une grande prestation. Plus tard, il rejoint la formation avec laquelle il se fera connaître : Unicorns of Love. Malgré des résultats discutables, UoL parvient à se qualifier sur le fil pour les play-offs des Challenger series. C’est à ce moment-là que le vent tourne. Plus motivé que jamais, UoL et celui qui se fait surnommer PoE réussissent à obtenir la 3e place en écrasant une équipe Ninjas in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et Aleš « Freeze » Kněžínek, ne cédant que face aux H2k de Fabian « Febiven » Diepstraten.\n\n<p>PowerOfEvil doit alors remporter un match en trois manches gagnantes s’il veut accéder aux League of Legends Championship Series. La victoire semble compromise puisque Millenium, l’équipe adverse, s’offre trois balles de match après avoir remporté les deux premières parties. Mais à ce moment-là, UoL décide de sortir sa botte secrète, Poppy top, et réussit l’impensable, se qualifiant de justesse au segment de printemps 2015.\n\n<p>Devant cette remontée fantastique, un style de jeu osé, des champions atypiques et un nom d’équipe attachant, les invocateurs décident de voter à 48% pour Unicorns of Love afin qu’ils participent aux Intel Extreme Masters San Jose. PowerOfEvil et ses coéquipiers font honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, PoE signe un tournoi exemplaire en se faisant particulièrement remarquer avec LeBlanc et Syndra.\n\n<p>En LCS, le mid laner impressionne encore et obtient le titre de meilleur joueur de la semaine à deux reprises. Il hisse son équipe à la très correcte 5e place de la saison régulière et arrive aux play-offs en tant qu’outsider, mais lui et son équipe démontrent très vite qu’ils sont déterminés en éliminant Gambit Gaming sans trembler. PowerOfEvil ne s’arrête pas en si bon chemin et s’impose face au premier de la saison régulière, SK Gaming, avant de donner du fil à retordre à Fnatic en finale.\n\n<p>Plus qu’un bon joueur, PowerOfEvil aime l’innovation et n’hésite pas à sortir des sentiers battus. Lors du segment de printemps, il joue Orianna avec Châtiment pour s’équiper de l’enchantement Glaive Runique et réussit un quintuplé. Cependant, ses expériences ne sont pas toujours un succès, en témoigne sa Kayle équipée d’un enchantement Dévoreur. Pendant le segment d’été, Unicorns of Love réitère une bonne performance mais échoue à obtenir la troisième place de play-offs. UoL se fait ensuite balayer par Origen et perd toute chance d’accéder au mondial 2015.\n\n<p>Fin novembre, lors des IEM San Jose, PowerOfEvil dispute ses premières rencontres au sein d’Origen, sa nouvelle équipe. Aux commandes de champions qu’il connaît bien, l’Allemand permet à sa nouvelle équipe d’éliminer TSM puis de remporter la finale face à Counter Logic Gaming, sans encaisser la moindre défaite et en montrant un niveau de jeu très convaincant. Ce début est de bonne augure et PoE devrait profiter de l’expérience de Enrique « xPeke » Cedeño-Martinez pour atteindre son plein potentiel cette année.\n","de_DE":"<p>Tristan „PowerOfEvil“ Schrage ist in seinen jungen Jahren bereits extrem talentiert. PowerOfEvil ist vor allem dafür bekannt, seine Gegner mit Cassiopeia, Syndra und Orianna in Sachen Spielmechanik zu übertreffen. Und wer ihn nicht deshalb kennt, kennt ihn wahrscheinlich aufgrund seiner seltsamen Championwahlen für die mittlere Lane – damit meinen wir vor allem Kayle mit Zerschmettern … und Verschlinger. Ende 2015 führte der Erfolg PowerOfEvil zu einer neuen Mannschaft – Origen.\n\nBei Origen hatte PowerOfEvil jedoch trotz der Hilfe des Mid-Laners des All-Stars-Events 2016, xPeke, Probleme, seinen Rhythmus zu finden, weshalb er die Mannschaft am Ende des Jahres wieder verließ. Er steckt immer noch voller Potenzial und die Misfits haben ihn aufgenommen, um ihre Aufstellung zu verstärken. Dieser Tapetenwechsel könnte sein Talent endgültig zum Vorschein bringen, das in seiner Zeit bei Origen nur selten zu sehen war. PowerOfEvil muss jetzt beweisen, dass er sich dank seiner Belastbarkeit verbessern konnte. Der Einsatz ist hoch und für ihn heißt es jetzt: „Alles oder nichts.“</p>"},"foreignIds":{"drupalId":"1455","TRLH3":"200000051","TRLH4":"200000154"},"socialNetworks":{"facebook":"www.facebook.com/thepowerofevil","twitter":"https://twitter.com/PowerOfEvilLoL"},"champions":[],"liveGameTeam":228},{"id":357,"slug":"ignar","name":"IgNar","firstName":"Dong-geun","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ignar-5rj4dfc4.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-09T11:01:30.000Z","bios":{"en_US":"Dong-geun \"IgNar\" Lee hails from South Korea but got his professional start in North America with Winterfox, although he didn’t appear in a single game for them. He eventually moved back to Korea and played with both Incredible Miracle and KT Rolster, gaining valuable top tier competitive experience.\n\nAfter proving that he could hang with the best in Korea, IgNar once again moved continents, except this time he made his way to Europe to play for the EUCS squad Misfits. He excelled as their support and helped them into the EU LCS. While assisting his team in cutting the Challenger competition down to size, IgNar played Braum, Bard and everything in-between. His wide champion pool should help give Misfits a fighting chance against the best teams Europe has to offer.</p>","de_DE":"<p>Dong-geun „IgNar“ Lee stammt aus Südkorea, hat seine professionelle Karriere aber bei Winterfox in Nordamerika begonnen (obwohl er für die Mannschaft kein einziges Spiel bestritten hat). Daraufhin ging er zurück nach Korea, wo er sowohl mit Incredible Miracle als auch mit KT Rolster Erfahrungen sammeln konnte.\n\nNachdem er bewiesen hatte, dass er es mit den besten Spielern Koreas aufnehmen konnte, zog IgNar nach Europa, um dort in der EU CS für die Misfits zu spielen. Dort lieferte er eine überragende Leistung als Supporter ab und half der Mannschaft, in die EU LCS einzuziehen. IgNar spielte sämtliche Champions von Braum bis Bard und half seiner Mannschaft, die Konkurrenz in der Challenger Series dem Erdboden gleich zu machen. Sein umfangreicher Champion-Pool sollte den Misfits helfen, gegen die besten Mannschaften Europas bestehen zu können.</p>"},"foreignIds":{"drupalId":"3777","TRLH4":"200000156","TRLH3":"200000053"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":392,"slug":"paragon","name":"Paragon","firstName":"Hyun-Il","lastName":"Choi","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/paragon-6qnhxpgh.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-03-07T19:18:45.000Z","updatedAt":"2017-05-31T21:00:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2126","TRLH1":"1001070001","ESPORTSTMNT02":"200000987","TRLH3":"200000252","TRLH4":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1090,"slug":"liv","name":"Hanssama","firstName":"Steven","lastName":"Liv","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/liv-a4dgwahi.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-21T21:14:43.000Z","updatedAt":"2017-06-09T10:54:49.000Z","bios":{"en_US":"<p>Steven \"Hans sama\" Liv got his competitive start in 2015, where he joined up with Milenium. Soon after Milenium lost in the EUCS playoffs, Hans sama made his way to Misfits in June of 2016. He helped propel them through Challenger and into the EU LCS for the 2017 Spring Split.</p>\n\n<p>Hans sama comes into the EU LCS at just 17 years old. Largely unproven and lacking the years of experience that many players have at this level, he will have to learn to adapt quickly and step his game up accordingly. Playing against tried and tested world class talent like Rekkles and Zven will prove to be one of the biggest hurdles of his career. He will need to stand up to the best or get swept aside like the rest. Game on.</p>","de_DE":"<p>Steven „Hans Sama“ Liv begann seine professionelle Karriere 2015, als er von Millenium aufgenommen wurde. Im Juni 2016 wechselte Hans Sama kurz nach der Niederlage von Millenium in den Entscheidungsspielen der EU CS zu den Misfits. Er half der Mannschaft, sich über die Challenger Series für den Frühjahrs-Split der EU LCS 2017 zu qualifizieren.\n\nHans Sama ist gerade einmal 17 Jahre alt, wenn er zum ersten Mal in der EU LCS spielen wird. Ihm fehlt die langjährige Erfahrung der meisten Spieler auf diesem Niveau und er wird lernen müssen, sich schnell anzupassen und zu verbessern. Dabei werden die Spiele gegen herausragende Talente wie Rekkles und Zven zu den größten Hürden seiner bisherigen Karriere. Er wird sich gegen die Besten behaupten müssen, sonst wird er wie der Rest aus der Kluft gefegt. Das Spiel kann beginnen.</p>"},"foreignIds":{"TRLH4":"200000155","TRLH3":"200000052"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1334,"slug":"alphari","name":"Alphari","firstName":"Barney","lastName":"Morris","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alphari-3ozuf4zl.png","hometown":"UK","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:04:28.000Z","updatedAt":"2017-06-09T10:15:34.000Z","bios":{"en_US":"<p>Barney \"Alphari\" Morris began his career in 2015 and his play attracted the attention of Misfits who picked him up for their Challenger squad in 2016. He helped them carve a path through Europe’s Challenger scene and straight into the 2017 EU LCS Spring Split.</p>\n\n<p>Alphari spent time in Korea with his teammates in order to prepare for the challenge of playing at the highest level in Europe. He’ll need to come out of the gate swinging in order to keep up with hardened veterans in the top lane. It’ll largely be a trial by fire for the young talent, but the team’s bootcamp, coupled with tutelage from their veteran players, will play a key role in his development as he steps into one of the greatest challenges of his young career.</p>","de_DE":"<p>Barney „Alphari“ Morris begann seine Karriere 2015 und erregte mit seiner Spielweise die Aufmerksamkeit der Misfits, die ihn 2016 in die Mannschaft aufnahmen. Daraufhin half er der Mannschaft, sich einen Weg durch die europäische Challenger Series zu bahnen und den Frühjahrs-Split der EU LCS 2017 zu erreichen. \n\nAlphari verbrachte mit seinen Teamkameraden einige Zeit in Korea, um sich dort auf die kommenden Herausforderungen in Europa vorzubereiten. Er wird sein Bestes geben müssen, wenn er mit den abgehärteten Veteranen auf der oberen Lane mithalten will. Das junge Talent muss gleich eine Feuerprobe bestehen, wenn die größte Herausforderung seiner bisherigen Karriere beginnt, aber das Training mit der Mannschaft und die Hilfe der Veteranen sollten seine Entwicklung vorangetrieben haben.</p>"},"foreignIds":{"TRLH4":"200000152","TRLH3":"200000049"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34}],"scheduleItems":[{"id":"AV2jpXGWQMQFcjhwbQ-C","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:2259b444-c9c1-4f7c-a50a-c056cfb8b94c","scheduledTime":"2017-08-19T15:00:00.479+0000","tags":{"blockLabel":"Quarterfinals","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:2a23f939-daab-4ac9-8be7-0ba07edbde2f","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"2259b444-c9c1-4f7c-a50a-c056cfb8b94c","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"2a23f939-daab-4ac9-8be7-0ba07edbde2f","league":"3"}],"gameIdMappings":[{"id":"fc515765-c75b-4cb5-ae31-af2514ae2134","gameHash":"9c4815b5a036f9ad"},{"id":"eec0f79e-9acc-4c94-937e-8c77869aeadb","gameHash":"c0d5f8b5a29e5607"},{"id":"35af7271-a158-49e2-9cf5-d00e5da31fe9","gameHash":"4b7d4db965f97df6"}],"videos":[{"id":8572,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:35af7271-a158-49e2-9cf5-d00e5da31fe9","source":"https://www.youtube.com/embed/Z6MJ8fO3Mes?wmode=transparent&rel=0","createdAt":"2017-08-19T21:50:35.000Z","updatedAt":"2017-08-19T21:50:35.000Z","game":"35af7271-a158-49e2-9cf5-d00e5da31fe9"},{"id":8573,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:fc515765-c75b-4cb5-ae31-af2514ae2134","source":"https://www.youtube.com/embed/xU3GGOJcAH8?wmode=transparent&rel=0","createdAt":"2017-08-19T23:04:04.000Z","updatedAt":"2017-08-19T23:04:04.000Z","game":"fc515765-c75b-4cb5-ae31-af2514ae2134"},{"id":8574,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:eec0f79e-9acc-4c94-937e-8c77869aeadb","source":"https://www.youtube.com/embed/ODbzsXoc2ng?wmode=transparent&rel=0","createdAt":"2017-08-19T23:15:13.000Z","updatedAt":"2017-08-19T23:15:13.000Z","game":"eec0f79e-9acc-4c94-937e-8c77869aeadb"}],"htmlBlocks":[],"match":{"id":"2259b444-c9c1-4f7c-a50a-c056cfb8b94c","name":"quarter-final-1","position":0,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3},{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],"games":{"fc515765-c75b-4cb5-ae31-af2514ae2134":{"id":"fc515765-c75b-4cb5-ae31-af2514ae2134","name":"G2","generatedName":"MSF|UOL|G2|2259b444c9c14f7ca50","input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3},{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503184328310,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503161868158,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210070","gameRealm":"TRLH3","platformId":"TRLH3:1002210070","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"35af7271-a158-49e2-9cf5-d00e5da31fe9":{"id":"35af7271-a158-49e2-9cf5-d00e5da31fe9","name":"G1","generatedName":"MSF|UOL|G1|2259b444c9c14f7ca50","input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4},{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503179277029,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503158519239,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210055","gameRealm":"TRLH3","platformId":"TRLH3:1002210055","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b666467a-9913-49c0-8ddd-e4a71df56f99":{"id":"b666467a-9913-49c0-8ddd-e4a71df56f99","name":"G5","generatedName":"MSF|UOL|G5|2259b444c9c14f7ca50","input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3},{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"eec0f79e-9acc-4c94-937e-8c77869aeadb":{"id":"eec0f79e-9acc-4c94-937e-8c77869aeadb","name":"G3","generatedName":"MSF|UOL|G3|2259b444c9c14f7ca50","input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4},{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503184226155,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3}]],"timestamp":1503165273141,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210074","gameRealm":"TRLH3","platformId":"TRLH3:1002210074","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"031f497c-33bd-44bf-971c-19441c00a46e":{"id":"031f497c-33bd-44bf-971c-19441c00a46e","name":"G4","generatedName":"MSF|UOL|G4|2259b444c9c14f7ca50","input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":3},{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7","breakpoint":"1679c22b-e1b6-4c65-bf86-a441c061e700","standing":4}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1503184226156,"source":"bestOf","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1503184328311,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1503179277029,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1503165273141,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7":1,"e23eee5c-837e-42c9-8f4c-80b68280f980":0}}}