{"teams":[{"id":78,"slug":"vici-gaming","name":"Vici Gaming","guid":"be6dfa03-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vici-gaming-hzibc6u0.png","acronym":"VG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-01-09T23:34:54.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3753"},"players":[47,402,550,638,649,653,1034,1297,1662,1663],"starters":[47,402,550,649,1034],"subs":[638,653,1297,1662,1663]},{"id":218,"slug":"i-may","name":"I May","guid":"be7140e4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/i-may-g9vriddl.png","acronym":"IM","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-05-18T20:51:23.000Z","updatedAt":"2017-06-06T23:41:14.000Z","bios":{"en_US":"","de_DE":"<p>I MAY ist ein Name, der Hoffnung ausstrahlt. Und das passt zum Ursprung dieser Mannschaft. IM war ursprünglich die zweite Mannschaft von Edward Gaming in der LSPL – ein bescheidener Anfang für eine Mannschaft, die jetzt zur WM fährt. Die Mannschaft, die damals noch als EDE bekannt war, gewann die LSPL und trat als I MAY beim Sommer-Split der LPL an. Ihr Erfolgslauf setzte sich im Sommer-Split fort und gipfelte in einem 3–2 Sieg über Team WE, mit dem sie sich für die Weltmeisterschaft qualifizierten. IM hat es allen Zweiflern und Kritikern gezeigt, die sich sichern waren, dass sie wegen ihres knappen Aufstiegs in die LPL niemals das höchste spielerische Niveau erreichen würden. Doch IM ließ sich von dieser Einschätzung nicht abschrecken und konnte in den Schlüsselmomenten Siege einfahren. Jetzt fährt die Mannschaft zur größten Bühne von League, um herauszufinden, ob sie mit ihrer verwegenen Art weitere überraschende Siege einfahren können.</p>","es_AR":"<p>I MAY es un nombre que denota esperanza, más que nada si se tiene en cuenta el origen de este equipo. IM comenzó en la LSPL como el segundo equipo de Edward Gaming, y sus comienzos fueron bastante humildes para ser un equipo que esté camino al Mundial. El equipo, conocido como EDE, logró salir del LSPL con un boleto al torneo de clausura de la LPL y bajo el nombre de I MAY. Su maravillosa actuación continuó a lo largo del torneo de clausura y terminó con una victoria por 3-2 contra Team WE y un pase al Campeonato Mundial. IM despejó las dudas de los escépticos y los críticos que sugerían que su casual ascenso a la LPL demostraba que nunca lograrían llegar a los más altos niveles de competición. Sin dejarse llevar por estos comentarios, IM continuó con su perfil bajo y obteniendo victorias en momentos clave. Ahora deberán saborear el escenario más grande de League of Legends y ver si pueden continuar con su audaz empresa de obtener más victorias de estas inesperadas.</p>\n\n<p><strong>Entrenador: Son \"Kezman\" Dae-young</strong></p>","pt_BR":"I MAY, \"eu posso\" em inglês, é um nome que irradia esperança e reflete as origens do time. A IM começou na LSPL com o segundo time da Edward Gaming -- começo humilde para uma equipe que agora vai para o Mundial. A equipe, antes conhecida como EDE, conseguiu sair da LSPL e chegou à Etapa de Verão da LPL como I MAY. Sua jornada de sucesso continuou até a Etapa de Verão, culminando com a classificação para o Mundial com uma vitória por 3 a 2 contra a WE. A IM calou a boca dos críticos e céticos que sugeriam que sua disputada ascensão à LPL era a prova de que eles não conseguiriam chegar aos níveis mais altos da competição. Sem temer essa percepção, a IM manteve a cabeça erguida e continuou vencendo em momentos cruciais. Agora chegou a hora da equipe vivenciar o nível máximo de League e ver se consegue dar continuidade a ousada tendência de abocanhar vitórias surpreendentes."},"foreignIds":{},"players":[293,505,507,974,1051,1278,1643,1983],"starters":[505,507,974,1051,1278],"subs":[293,1643,1983]}],"players":[{"id":47,"slug":"bengi","name":"Bengi","firstName":"Seongung","lastName":"Bae","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bengi-bv0g2g0j.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2016-12-10T16:23:42.000Z","bios":{"en_US":"<p>Seongung \"Bengi\" Bae is a League of Legends World Champion and star jungler for SK Telecom T1. His quiet attitude aligns perfectly with his playstyle. Bengi is a core component in the Faker terror train, focusing his efforts on feeding SKT’s solo lanes instead of getting himself ahead. Multiple Korean coaches believe Bengi was the key factor behind SKT’s incredible run during 2013-2014 Champions Winter. He exerts an enormous amount of pressure throughout the map, keeping his opponents on their toes.</p>\n\n<p>After achieving first place multiple times in the LCK, and winning his third World Championship title in 2016, Bengi has just about done it all. The fans decided that wasn’t the case though, and they voted the wily veteran into the 2016 All-Star event over LCK young blood, Peanut. He might be an old dog, but the fans believe he doesn’t need any new tricks to be successful.</p>","fr_FR":"<p>Seong-woong « Bengi » Bae est un champion du monde de League of Legends et le jungler vedette de SK Telecom T1. Son tempérament calme est en parfaite adéquation avec son style de jeu. Bengi est un élément central du succès spectaculaire de l'équipe de Faker, car sa tactique est de « feed » les voies solo de SKT au lieu de prendre lui-même l'avantage. De nombreux entraîneurs coréens pensent que Bengi est le facteur clé derrière le parcours spectaculaire de SKT durant le tournoi Champions Winter 2013-2014. Il exerce une pression exceptionnelle sur la carte, obligeant ses adversaires à la prudence.</p>\n\n<p>Après avoir décroché la première place plusieurs fois aux LCK et avoir remporté son troisième titre de champion du monde en 2016, Bengi n'a plus grand chose à prouver. Mais les fans en ont décidé autrement et ils ont voté pour la participation du vétéran rusé à l'événement All-Stars 2016, plutôt que pour le petit nouveau de LCK, Peanut. Les fans estiment que ce vieux singe n'a plus besoin d'apprendre de nouveaux tours pour réussir.</p>","pl_PL":"Seongung „Bengi” Bae jest byłym mistrzem świata League of Legends i gwiazdorskim dżunglerem SK Telecom T1. Jego spokojne usposobienie idealnie pasuje do prezentowanego stylu gry. Bengi stanowi podstawowy element machiny terroru rozpędzanej przez Fakera, starając się zapewnić przewagę jemu i Smebowi, zamiast skupiać się na sobie. Wielu koreańskich trenerów uważa, że Bengi miał kluczowe znaczenie dla niesamowitych występów SKT podczas Champions Winter 2013-2014. Wywiera niesamowitą presję na całej mapie, nie dając przeciwnikom ani chwili spokoju.</p>\n\nPo kilkukrotnym zdobyciu pierwszego miejsca w LCK i wygraniu trzeciego Mistrzostwa Świata w 2016 roku Bengi osiągnął już właściwie wszystko. Jednak fani zdecydowali, że tak nie jest i wybrali chytrego weterana na wydarzenie All-Star 2016, zapewniając mu przewagę głosów nad młodą krwią LCK, Peanutem. Być może Bengi ma ograny repertuar, ale fani są zdania, że nie musi uczyć się żadnych nowych sztuczek, by osiągnąć sukces.\ns. Zdecydowanie nie. Nigdy.</p>","de_DE":"<p>Seong-ung „Bengi“ Bae ist ein „League of Legends“-Weltmeister und der Jungler von SK Telecom T1. Seine ruhige Art passt perfekt zu seinem Spielstil. Bengi ist ein Hauptbestandteil von Fakers furchteinflößender Bande und konzentriert sich mehr darauf, SKTs Solo-Lanes zu unterstützen als selbst voranzukommen. Viele koreanische Coaches glauben, dass Bengi der Schlüssel zu SKTs unglaublichem Durchlauf beim Champions Winter 2013–2014 war. Er baut auf der gesamten Karte einen unglaublichen Druck auf und sorgt dafür, dass sich seine Gegner keine Sekunde ausruhen können.</p>\n\n<p>Nach mehreren ersten Plätzen in der LCK und dem dritten Weltmeistertitel 2016 hat Bengi so gut wie alles erreicht. Die Fans sahen das jedoch anders und wollen den Veteranen anstelle des jungen Peanut beim All-Stars-Event 2016 sehen. Er ist vielleicht ein alter Hund, aber die Fans sind der Meinung, dass er keine neuen Tricks mehr lernen muss, um erfolgreich zu sein.</p>","es_ES":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el jungla estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que centra sus esfuerzos en hacer avanzar las calles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Puede que sea un veterano de costumbres, pero sus fans consideran que no necesita cambiarlas para llegar hasta lo más alto.</p>","pt_BR":"<p>Seongung \"Bengi\" Bae é um tricampeão mundial de League of Legends e o ex-caçador da SK Telecom T1. Sua atitude calma se alinha perfeitamente com seu estilo de jogo. Bengi era um componente essencial para o trem do terror de Faker, focando seus esforços em feedar as rotas solo da SKT em vez de acumular recursos para ele mesmo. Muitos técnicos coreanos acreditam que Bengi foi o fator chave para o incrível sucesso da SKT durante o Inverno da Champions 2013-2014. Ele exerce uma enorme pressão no mapa, mantendo seus inimigos aos seus pés.</p>\n\n<p>Depois de alcançar o primeiro lugar diversas vezes na LCK e três vezes no Campeonato Mundial, Bengi já provou o que tinha que provar. Os fãs decidiram que não era esse o caso, e votaram no veterano para o Evento All-Star 2015. Ele pode ser um cão velho, mas ele não precisa de nenhum novo truque para mostrar do que é capaz.</p>","es_AR":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el junglero estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que concentra sus esfuerzos en hacer avanzar los carriles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Quizá sea un veterano, pero sus fans consideran que no necesita cambiar nada para llegar hasta lo más alto.</p>","cs_CZ":"<p>Seongung „Bengi“ Bae je trojnásobný mistr světa v League of Legends a hvězdný džungler týmu SK Telecom T1. Jeho tichá nátura skvěle ladí s jeho herním stylem. Bengi je nedílnou součástí Fakerova vlaku hrůzy a místo aby se snažil získat náskok sám pro sebe, upíná veškeré své úsilí ke krmení sólových lajn SKT. Celá řada korejských trenérů se domnívá, že to byl právě Bengi, kdo sehrál klíčovou roli v oné úžasné sérii výher SKT na turnaji Champions Winter 2013–2014. Dokáže vyvíjet enormní tlak po celé mapě a nedá svým soupeřům ani na okamžik vydechnout.</p>\n\n<p>S množstvím trofejí z LCK a třetím titulem mistra světa, který získal roku 2016, by už Bengi mohl klidně odejít na odpočinek. Fanoušci si to ovšem nepřejí a dali v hlasování k turnaji All-Star 2016 přednost tomuto prohnanému veteránovi před Peanutem, jenž je představitelem mladé krve v LCK. Bengi je sice už starý pes, ale jeho příznivci se domnívají, že k úspěchu žádné nové kousky nepotřebuje.</p>","el_GR":"<p>Ο Seongung \"Bengi\" Bae είναι Παγκόσμιος Πρωταθλητής του League of Legends και διάσημος παίκτης ζούγκλας για τους SK Telecom T1. Ο συγκρατημένος χαρακτήρας του ταιριάζει τέλεια με το στυλ παιχνιδιού του. Ο Bengi είναι ένας από τους πιο σημαντικούς βοηθούς του οδοστρωτήρα που λέγεται Faker, καθώς εστιάζει τις προσπάθειές του στις σόλο λωρίδες των SKT και όχι στο δικό του προβάδισμα. Πολλοί Κορεάτες προπονητές θεωρούν ότι ο Bengi ήταν ο βασικός παράγοντας που επέτρεψε στους SKT να ισοπεδώσουν τα πάντα στο πέρασμά τους στο Champions Winter 2013-2014. Έχει τη δυνατότητα να ασκεί τεράστια πίεση σε όλα τα μήκη και τα πλάτη του χάρτη και δεν αφήνει ποτέ τους αντιπάλους του να ησυχάσουν.</p>\n\n<p>Ο Bengi έχει τερματίσει πρώτος πολλές φορές στο LCK και το 2016 κατέκτησε το τρίτο του Παγκόσμιο Πρωτάθλημα. Θα έλεγε κανείς, λοιπόν, ότι έχει πετύχει τα πάντα. Όμως οι φίλοι του παιχνιδιού αποφάσισαν ότι αυτό δεν είναι αρκετό και έτσι τον ψήφισαν για να πάει στο Τουρνουά All-Star 2016, αντί για τον Peanut, τον νεοφώτιστο του LCK. Μπορεί να μην έχει τη φρεσκάδα ενός νέου παίκτη, αλλά ο κόσμος προφανώς πιστεύει ότι δεν τη χρειάζεται.</p>","hu_HU":"Seongung „Bengi” Bae League of Legends-világbajnok és az SK Telecom T1 dzsungelharcos sztárja. Csendes viselkedése jól illik a játékstílusához. Faker terrorvonatán bizony Bengi a masiniszta, és előszeretettel segíti az SKT egyéni ösvényeit a saját hősének erősítése helyett. Több koreai edző szerint is Bengi volt a kulcsa az SKT elképesztő szereplésének a Champions 2013-2014-es téli szakaszában. Az egész térképet nyomás alatt tartja, így az ellenfelek sosem lehetnek nyugodtak.</p>\n\nMiután többször is bajnok lett az LCK-ben, és háromszoros világbajnok lett 2016-ban, Bengi már igazán nem hajkurássza a címeket. A rajongók viszont szeretnék újra látni őt, a 2016-os All-Star gálára az LCK-s újonc Peanut helyett őt szavazták be. Lehet, hogy nem a legújabb modell, de a nézők imádják.\n","it_IT":"Seongung \"Bengi\" Bae è la stella della giungla degli SK Telecom T1, gli attuali campioni del mondo di League of Legends. Il suo atteggiamento tranquillo si abbina perfettamente al suo stile di gioco. Bengi è una componente fondamentale della squadra letale di Faker e preferisce concentrare i suoi sforzi nel dare uccisioni alle corsie singole piuttosto che prenderle per sé. Molti allenatori coreani sostengono che sia Bengi il fattore chiave alla base dell'incredibile cavalcata degli SKT durante il Champions Winter 2013-2014. È in grado di esercitare un'immensa pressione su tutta la mappa, tenendo sempre gli avversari sulla spine.</p>\n\nOra che si è piazzato più volte al primo posto nella LCK e ha vinto il suo terzo titolo mondiale nel 2016, Bengi sembra aver conquistato tutto il conquistabile. I fan però hanno deciso che per lui non era ancora arrivato il momento dei saluti e hanno votato in massa per la sua partecipazione all'All-Star 2016 a scapito della giovane promessa della LCK, Peanut. A quanto pare questo veterano è ancora in grado di far sognare in grande i suoi fan.\n","ro_RO":"Seongung \"Bengi\" Bae este un Campion Mondial de League of Legends și junglerul excepțional din SK Telecom T1. Atitudinea sa liniștită se potrivește perfect stilului său de joc. Bengi este un element important al aurei de teroare a lui Faker, concentrându-se să le asigure asasinate culoarelor solo din SKT, în loc s-o ia chiar el înainte. Mulți antrenori coreeni sunt de părere că Bengi este factorul cheie din spatele performanțelor incredibile ale SKT de la Champions Winter 2013-2014. Exercită o presiune enormă pe hartă, ținându-și mereu adversarii în alertă.</p>\n\nDupă ce a obținut de mai multe ori primul loc în LCK și a câștigat al treilea titlu de Campion Mondial în 2016, Bengi a obținut cam tot ce se poate obține. Fanii au decis însă că merită și mai mult și l-au votat pe veteranul viclean la All-Star Event 2016 în detrimentul tânărului star din LCK, Peanut. Poate că e de multă vreme pe scena profesionistă, dar fanii cred că succesul se bazează pe experiență.\n","es_MX":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el junglero estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que concentra sus esfuerzos en hacer avanzar los carriles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Quizá sea un veterano, pero sus fans consideran que no necesita cambiar nada para llegar hasta lo más alto.</p>"},"foreignIds":{"drupalId":"693","TRLH1":"1001380057","TRLH2":"1001280027","TRLH3":"1001360052","TRLH4":"1001310052","TRKR1":"225040","TRLT3":"35089"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":293,"slug":"ff","name":"FF","firstName":"Kui","lastName":"Xie","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ff-db69okzf.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-02-23T00:50:59.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3173"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":402,"slug":"easyhoon","name":"Easyhoon","firstName":"Ji-hoon","lastName":"Lee","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/easyhoon-du1h26yq.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2016-02-02T00:58:59.000Z","bios":{"en_US":"<p>Ji-hoon “EasyHoon” Lee has bumped heads in the mid lane with some of the best players in the world, including Faker, Ambition, Ryu, and more.He currently plies his trade for SKT T1, operating as a dynamic mid lane substitute in tandem with Faker. EasyHoon’s control-mage focused style compliments Faker’s assassin play perfectly, allowing SKT to prepare a diverse set of strategies. Easyhoon is also Faker’s go-to practice partner for testing new champions. Lest we forget, only the apprentice has a chance to defeat the master. </p>","fr_FR":"<p>Ji-hoon « EasyHoon » Lee a fait jeu égal sur la voie du milieu avec quelques-uns des meilleurs joueurs du monde, y compris Faker, Ambition, Ryu et d'autres encore. Il partage aujourd'hui la destinée de SKT T1, opérant avec énergie comme substitut sur la voie du milieu, en tandem avec Faker. EasyHoon, avec son style fondé sur les mages de contrôle, complète parfaitement les assassins de Faker, ce qui offre à SKT un vaste éventail de stratégies. Easyhoon est également le partenaire d'entraînement de Faker lorsqu'il teste de nouveaux champions. La tradition veut que seul l'apprenti puisse battre le maître. </p>","pl_PL":"<p>Ji-hoon „EasyHoon” Lee ścierał się na środku z jednymi z najlepszych graczy na świecie, takimi jak Faker, Ambition, Ryu i wielu innych. Aktualnie swoje zadanie wypełnia dla SKT T1, działając jako zastępczy środkowy do spółki z Fakerem. Styl EasyHoona, który gra magami skupiającymi się na kontroli, doskonale uzupełnia się z zabójczym stylem Fakera, co pozwala SKT na przygotowanie zróżnicowanych strategii. Easyhoon jest także partnerem Fakera podczas testowania nowych bohaterów. Nie zapominajmy, że tylko uczeń może przerosnąć mistrza. </p>","de_DE":"<p>Ji-hoon “EasyHoon” Lee ist wahrscheinlich der beste Spieler Korea, der auf der Bank sitzt. Er sitzt zwar auch im Schatten Fakers, doch ist er immer noch einer der besten Mid-Laner der Welt, wenn es um Kontrollmagier geht. In der vierten Saison hat er unter dem SKT T1 S-Banner in fast jedem Spiel Ziggs-Banns auf sich gezogen und somit seine Freunde um sich herum entlastet. Heute besteht sein Championpool weiterhin aus ähnlichen Facetten wie Cassiopeia und Azir, mit welchem er ohne Frage mit Faker mithalten kann.</p>","es_ES":"<p>Ji-hoon “Easyhoon” Lee se ha medido en la calle central a algunos de los mejores jugadores del mundo, Faker, Ambition, Ryu, y muchos más. Hoy día ha puesto su ratón al servicio de SKT T1, como mid suplente formando un tándem con el titular, Faker. La preferencia de Easyhoon por magos que pueden controlar al enemigo se complementa muy bien con el estilo de Faker, al que le gustan más los asesinos, permitiendo así a SKT T1 tener más variedad en las estrategias. Easyhoon además es el compañero de prácticas de Faker a la hora de probar nuevos campeones. Y no nos olvidemos, solamente el aprendiz puede superar al maestro. </p>","pt_BR":"<p>EasyHoon já enfrentou alguns dos melhores jogadores do mundo na rota do meio, como Faker, Ambition, Ryu e outros. Atualmente, ele se reveza com Faker na rota do meio, como um reserva de luxo que pode entrar a qualquer momento. Seu estilo voltado para magos complementa muito bem o estilo de Assassinos de Faker, permitindo que a SKT diversifique suas estratégias. Ele também é o parceiro de treinos oficial de Faker para testar novos Campeões. Não se esqueça: apenas o aprendiz tem a chance de derrotar o mestre.</p>"},"foreignIds":{"drupalId":"880","TRLH1":"1001100020","TRLH2":"1001080020","TRLH3":"1001160015","TRLH4":"1001160015"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":505,"slug":"amazingj","name":"AmazingJ","firstName":"Waiho","lastName":"Shek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazingj-9y5n6mpk.png","hometown":"Hong Kong","region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:16.000Z","updatedAt":"2017-06-06T23:41:30.000Z","bios":{"en_US":"","fr_FR":"<p>\nWaiho « AmazingJ » Shek est un féroce invocateur de requins (ou de lamantins). AmazingJ a obtenu un record de 11/1/2 (et de multiples doublés) en jouant Fizz dans son tout premier match, contre Edward Gaming. D'abord engagé comme top laner remplaçant, AmazingJ a réussi une telle performance qu'il a gagné le droit de démontrer son talent dans d'autres parties tout au long de la saison de la LPL 2015. Il est arrivé au bout du segment d'été avec un score de 8 victoires contre 4 défaites. \n</p>","es_ES":"<p>\nWaiho ''AmazingJ'' Shek es un feroz invocador de tiburones (o manatíes). En su debut con Edward Gaming se marcó un 11/1/2 (con varios asesinatos dobles) con Fizz, el Gamberro de las Mareas. Aunque llegó al equipo como suplente, su magnífico rendimiento en las procelosas aguas de la LPL le ha llevado a ser titular varias veces durante la temporada 2015. Terminó el Split de verano con un registro de 8V-4D.\n</p>","pl_PL":"<p>\nWaiho „AmazingJ” Shek jest zaciekłym przywoływaczem rekinów (oraz manatów). AmazingJ osiągnął zachwycający wynik 11/1/2 (a także wiele podwójnych zabójstw), grając Fizzem, Szachrajem Sztormów, podczas swojego debiutanckiego meczu z Edward Gaming. AmazingJ pierwotnie odgrywał rolę zawodnika z górnej alei. Jego pierwszy występ sprawił, że wystąpił jeszcze wielokrotnie podczas LPL 2015. Zakończył letni split z wynikiem ośmiu zwycięstw do czterech porażek. \n</p>","de_DE":"<p>Shek „AmazingJ“ Wai Ho marschiert in seinem eigenen Takt. AmazingJ, der wegen seiner Liebe für einen gewissen patriotischen Demacianer auch „Garen-Bro“ genannt wird, schwor zu Beginn seiner Karriere in der LPL, dass er seine Mannschaft zur Weltmeisterschaft führen würde. Nach dem knappen Einzug in die LPL war das eine ziemlich gewagte Aussage, aber AmazingJ hielt sein Versprechen. Er lieferte bei der regionalen Qualifikationsrunde eine gigantische Leistung gegen World Elite ab, beendete das Spiel mit einer unglaublichen Teleportation und sicherte seiner Mannschaft so einen Platz bei der Weltmeisterschaft. AmazingJ hat allen gezeigt, wie gerne er mit dem Zeitbrecher spielt, und Ekko im Verlauf des Sommer-Splits 10-mal ausgewählt. Aber er kann seine Mannschaft auch mit Irelia tragen oder mit Shen die Karte kontrollieren. Jetzt, wo AmazingJ seine Mannschaft zur Weltmeisterschaft geführt hat, muss er noch besser spielen, um allen zu beweisen, dass I MAY auch gegen die Besten bestehen kann.</p>","pt_BR":"<p>Shek \"AmazingJ\" Wai Ho tem o seu próprio ritmo e tende a se manter nele. Além de ser chamado de \"Mano Garen\" por amar um certo patriota demaciano, AmazingJ iniciou sua carreira na LPL jurando que levaria sua equipe ao Mundial. Foi uma declaração bem ousada para alguém que teve dificuldades em chegar à LPL, mas ele cumpriu sua promessa. Ele jogou as Classificatórias Regionais na raça contra a World Elite, e conseguiu executar um teleporte incrível para encerrar o jogo e se classificar para o Mundial. AmazingJ se mostrou muito confiante com o Rapaz que Estilhaçou o Tempo, usando e abusando de Ekko em dez jogos da Etapa de Verão. Mas ele também consegue jogar com Irelia ou exercer pressão no mapa com Shen. Agora que AmazingJ levou seu time ao Mundial, ele precisa jogar mais do que nunca para provar que a I MAY pode brilhar no ambiente mais competitivo que pode existir.</p>","es_AR":"<p>Shek \"AmazingJ\" Wai Ho marcha al ritmo de su propio tambor. No solo es conocido como el \"hermano de Garen\" por su amor típico de buen patriota demaciano, sino por haber comenzado su carrera en la LPL jurando que llevaría al equipo al Campeonato Mundial. Fue una declaración jugada luego de haber llegado con lo justo a la LPL, pero AmazingJ cumplió con su promesa. Transpiró mucho la camiseta en las clasificatorias regionales contra World Elite, y logró una asombrosa jugada de teleportación para acabar la partida y calificar para el Campeonato Mundial. AmazingJ se ha sentido muy cómodo con el Joven que Fragmentó el Tiempo, y arrasó con Ekko en diez partidas durante el torneo de clausura. De todas formas, también acarrea muy bien con Irelia y aplica presión en el mapa con Shen. Ahora que AmazingJ ha llevado a su equipo al Campeonato Mundial, deberá jugar más duro que nunca para probar que I MAY puede prosperar en el evento más competitivo de todos.</p>"},"foreignIds":{"drupalId":"2083","TRLH3":"1001160042","TRLH4":"1001160042","TRLH1":"1001380045","TRLH2":"1001280015"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":507,"slug":"jinjiao","name":"Jinjiao","firstName":"Jinshan","lastName":"Xie","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jinjiao-djee7q8y.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-06-06T23:40:37.000Z","bios":{"en_US":"","de_DE":"<p>Xie „Jinjiao“ Jin-Shan spielte sowohl in der LSPL als auch in der LPL, bevor er bei I MAY ein neues Zuhause fand. Dieser AD-Carry spielt bevorzugt Jhin und Sivir, die er im Verlauf des Sommer-Splits der LPL 2016 jeweils 12- und 11-mal auswählte. Aber falls der Virtuose und die Kampfmeisterin einmal gebannt werden, kann sich Jinjiao wie jeder andere professionelle AD-Carry anpassen. Er hat in seiner Karriere auch schon mit Ashe, Lucian und einmal sogar mit Kog’Maw gespielt.\nJinjiao ist ein ADC, der von seinem Supporter abhängig ist – er ist dafür bekannt, unglaubliche Schadensmengen auszuteilen, wenn er mit einem defensiven Supporter auf der Lane ist, der ihn unterstützt und ihm riskante Spielzüge ermöglicht. Jetzt, wo Jinjiao in I MAY ein neues Zuhause gefunden hat und mit Road an seiner Seite zur Weltmeisterschaft fährt, sind alle Siegesbedingungen erfüllt.</p>","es_AR":"<p>Xie \"Jinjiao\" Jin-Shan jugó tanto en la LSPL como en la LPL antes de encontrar su hogar en el plantel de I MAY. Este ADC se inclina por Jhin y Sivir, con los que jugó en 12 y 11 partidas respectivamente durante el torneo de clausura de la LPL 2016. Pero al igual que otros ADC profesionales, si le sacas a el Virtuoso y la Señora de la Batalla, Jinjiao se adapta igual. Ha jugado con Ashe y Lucian, y hasta usó a Kog’Maw en algunas partidas durante su carrera.</p>\n\n<p>Jinjiao es un ADC que vive exclusivamente de su soporte. Es conocido por infligir una enorme cantidad de daño cuando se lo pone a la par de un soporte defensivo que pueda cubrirlo y permitirle hacer sus jugadas riesgosas. Ahora que Jinjiao ha encontrado su hogar en I MAY y se dirige al Campeonato Mundial con su soporte Road, puede decirse que ha logrado la condición de ganador.</p>","pt_BR":"<p>Xie \"Jinjiao\" Jin-Shan já jogou na LSPL e na LPL, e encontrou um lar no elenco da I MAY. Esse Atirador prefere Jhin e Sivir e jogou com eles em 12 e 11 jogos respectivamente na Etapa de Verão de 2016 da LPL. Mas como vários outros Atiradores profissionais, se o Virtuoso e a Mestra da Batalha não estiverem disponíveis, Jinjiao se adapta. Ele já jogou com Ashe e Lucian, e até já se aventurou com Kog’Maw em alguns jogos da sua carreira.</p>\n\n<p>Jinjiao é um Atirador que vive e morre ao lado do seu suporte - ele é conhecido por causar uma quantidade de dano impressionante quando joga em parceria com um suporte defensivo que o proteja e possibilite suas jogadas arriscadas. Agora que Jinjiao encontrou seu lar na I MAY e está a caminho do Mundial com Road como suporte, ele finalmente está em condições de vencer.</p>"},"foreignIds":{"drupalId":"4215","TRLH1":"1001380048","TRLH2":"1001280018"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":550,"slug":"loong","name":"Loong","firstName":"Xiao-long","lastName":"Zhu","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/loong-gcrqxsjf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2016-02-02T01:00:56.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4515"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":638,"slug":"hetong","name":"HeTong","firstName":"Wang","lastName":"Bin","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/hetong-2kxssfsn.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2015-10-26T18:35:53.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3780"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":649,"slug":"endless","name":"Endless","firstName":"Xu","lastName":"Hao","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/endless-7zp3yn9q.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2016-02-02T01:01:34.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4518"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":653,"slug":"peng","name":"Peng","firstName":"Yi-bo","lastName":"Peng","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/peng-8q44wtkl.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2015-10-26T18:32:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4519"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":974,"slug":"athena","name":"Athena","firstName":"Ha-woon","lastName":"Kang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/athena-2yuxd9y6.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T20:39:28.000Z","updatedAt":"2017-06-06T23:34:39.000Z","bios":{"en_US":"","de_DE":"<p>Athena ist dank seiner Zeit bei der koreanischen Mannschaft Ever einer der bekanntesten Spieler bei I MAY. Nach der Weltmeisterschaft in Saison 5 setzte Ever mit einem 2–0 Sieg beim LoL KeSPA Cup 2015 über SKTelecom T1 ein Ausrufezeichen und konnte am Ende mit einem 3–0 Sieg über CJ Entus sogar den Titel gewinnen. Doch nach diesem Erfolg verschwand Athena aus dem Rampenlicht. Für manche Fans war er eher Pawns Ersatz als ein eigenständiger Spieler. Aber dann heuerte er bei I MAY an.</p>\n\n<p>Athena war eine Schlüsselfigur beim kometenhaften Aufstieg der Mannschaft, die es in einem Split von der LSPL zur Weltmeisterschaft geschafft hatte. Er agiert lieber aus den hinteren Reihen, anstatt mit Assassinen oder robusten Champions in die Schlacht zu ziehen. Athena wird versuchen, allen zu beweisen, dass er ein eigenständiger Mid-Laner ist, der sich nicht in Pawns Schatten verstecken muss. Er ist einer der Veteranen in der Mannschaft und er weiß genau, wie hart es wird – aber er ist gerüstet und bereit, seinen Wert auf der größten Bühne der Welt unter Beweis zu stellen.</p>","es_AR":"<p>Athena es uno de los jugadores más conocidos del equipo de novatos de I MAY, gracias a su paso por el equipo coreano Ever. Después del Campeonato Mundial de la temporada 5, Ever pasó a la historia al derrotar a SKTelecom T1 por 2-0 en la Copa KeSPA de LoL en el 2015, para luego llevarse el campeonato entero con una victoria por 3-0 ante CJ Entus. Desde ese éxito inicial, Athena pasó a tener una presencia débil. Algunos simpatizantes lo veían más como un sustituto de Pawn que como un jugador hecho y derecho. Hasta que se unió a I MAY.</p>\n\n<p>Athena fue fundamental en el ascenso astronómico del equipo de la LSPL al Campeonato Mundial en un solo torneo. Se lo conoce mucho por su contribución desde la retaguardia, lanzando hechizos con campeones de golpes en lugar de dirigirse a la escaramuza con personajes asesinos o tanques. Athena intentará probar que es un carrilero central digno de ver, y no solo un rostro opacado por la figura de Pawn. Como uno de los veteranos del equipo, sabe lo dura que será lucha, pero, aún así, está preparado y listo para probar su valía en el escenario mundial.</p>","pt_BR":"<p>Athena é um dos jogadores mais conhecidos do elenco de calouros da I May, graças à sua equipe coreana, Ever. Depois do Campeonato Mundial de 2015, a Ever deixou sua marca ao derrotar a SKTelecom T1 por 2 a 0 na KeSPA Cup 2015, para no final levar o campeonato com uma vitória de 3 a 0 sobre a CJ Entus. Depois daquele sucesso inicial, Athena caiu no esquecimento. Alguns torcedores o viam mais como o substituto de Pawn do que como um jogador com méritos próprios. Foi aí que ele entrou na I MAY.</p>\n\n<p>Athena foi essencial para a ascensão meteórica da equipe, que saiu da LSPL para o Mundial em apenas uma Etapa. Ele é conhecido por suas contribuições na retaguarda, lançando feitiços em campeões de assalto em vez de entrar na briga com assassinos ou tanques. Athena tentará provar que ele é um jogador de meio que vale a pena ser observado, e não só um rostinho colado à sombra de Pawn. Como um dos veteranos da equipe, ele sabe que vai ser muito difícil - mas ele também está preparado e ponto para provar seu valor no palco mundial.</p>"},"foreignIds":{"TRLH1":"1001380047","TRLH2":"1001280017"},"socialNetworks":{},"champions":[{"id":213,"playerId":974,"championId":268,"championKey":"Azir","championName":"Azir","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":214,"playerId":974,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":215,"playerId":974,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"}],"liveGameTeam":218},{"id":1034,"slug":"duan","name":"Caveman","firstName":"Duan","lastName":"Deliang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/duan-d0j88gim.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:28.000Z","updatedAt":"2016-05-19T00:02:48.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1051,"slug":"flawless","name":"Flawless","firstName":"Yeon-joon","lastName":"Seong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flawless-5i9ua7sb.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:20:35.000Z","updatedAt":"2017-02-23T00:52:00.000Z","bios":{},"foreignIds":{"TRKR1":"225085"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1278,"slug":"road","name":"Road","firstName":"Hankil","lastName":"Yoon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/road-hcih3cbd.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:27:35.000Z","updatedAt":"2017-06-06T23:42:38.000Z","bios":{"en_US":"","de_DE":"<p>Ein paar der legendärsten Supporter in League fahren zur Weltmeisterschaft 2016 und Yun „Road“ Han-gi ist gleich in seinem ersten Jahr mit dabei. Und er hofft immer noch, dass er sich einen Namen machen kann. Road hat sich an Jinjiao, den erfahreneren Spieler auf seiner Lane, angepasst und sich zu einem defensiven Supporter entwickelt, der seinem ADC immer den Rücken freihält. Road, der bei den Fans nach der überraschenden Auswahl von Leona während des Mid-Season Invitational noch beliebter geworden sein dürfte, spielt am liebsten den strahlenden Sonnenaufgang sowie Thresh und Braum. \nAber egal, welchen Champion Road auswählt, er hat eine schwierige Aufgabe vor sich. Er ist immer noch ein Anfänger und fährt mit einer Mannschaft, die sich gerade erst für die LPL qualifizieren konnte, zur Weltmeisterschaft. Sein Name war niemals passender, dann er ist kurz davor, den wichtigsten Weg seines Lebens anzutreten.</p>","es_AR":"<p>Algunos de los soportes más legendarios de League of Legends se dirigen al Campeonato Mundial 2016, y Yun \"Road\" Han-gi se les unirá en su torneo de novatos. En esta ocasión, espera hacer historia. Road ha sabido complementarse con el jugador más experimentado del carril, Jinjiao, y se ha convertido en un soporte defensivo que siempre cuenta con un ADC que lo cubre. Los simpatizantes que lo vitorearon ante su sorpresiva elección de Leona en el Torneo por Invitación de Mitad de Temporada comienzan a identificarse con él. Se lo conoce más por inclinarse por el Radiante Amanecer, como también Thresh y Braum.</p>\n\n<p>Sin importar el campeón que elija, Road tiene un duro camino por delante. Sigue siendo un novato que va al Campeonato Mundial con un equipo que simplemente clasificó para la LPL. Su nombre no podría ser más adecuado, ya que este será el recorrido más importante en toda su carrera.</p>","pt_BR":"<p>Alguns dos suportes mais lendários de League estarão no Mundial 2016 e Yun \"Road\" Han-gi estará junto a eles em sua Etapa de estreia. E ele espera conseguir deixar sua marca. Road aprendeu a se entrosar com o jogador mais experiente da sua rota, Jinjiao, e se tornou um suporte defensivo que está sempre preparado para proteger seu Atirador. Os torcedores que gostaram a escolha surpresa de Leona no MSI vão gostar de Road; ele é conhecido por preferir a Alvorada Radiante, bem como Thresh e Braum.</p>\n \n<p>Não importa que campeão ele escolha, Road tem um caminho difícil pela frente. Ele ainda é um calouro indo para o Mundial com uma equipe que acabou de se classificar para a LPL. Seu nome nunca foi tão oportuno, pois esse é o caminho mais importante que ele já trilhou.</p>"},"foreignIds":{"TRLH1":"1001380049","TRLH2":"1001280019"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1297,"slug":"xuanxuanpi","name":"XuanXuanPI","firstName":"Pi","lastName":"Xiaoxuan","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-05-19T00:03:16.000Z","updatedAt":"2016-05-19T00:03:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1643,"slug":"ben4","name":"Ben4","firstName":"Xincheng","lastName":"Tu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben4-6j90qcxn.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:24:59.000Z","updatedAt":"2017-06-06T23:34:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1662,"slug":"ocean","name":"Ocean","firstName":"Haiqin","lastName":"Tang","roleSlug":"jungle","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:31:17.000Z","updatedAt":"2017-01-09T23:31:17.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1663,"slug":"onion","name":"OniOn","firstName":"Songxi","lastName":"Liang","roleSlug":"toplane","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:33:27.000Z","updatedAt":"2017-01-09T23:33:27.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1983,"slug":"starlight","name":"Starlight","firstName":"Shun-Jie","lastName":"Li","roleSlug":"support","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:39:34.000Z","updatedAt":"2017-06-06T23:39:34.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218}],"scheduleItems":[{"id":"AVmFdoJVQMQFcjhwbQrz","content":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:match:23b46ce9-9075-4e6b-8fa2-0932a729ad89","scheduledTime":"2017-03-04T05:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696","blockLabel":"4","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:bracket:8aad9de4-4ef3-43e3-8562-55d87ce468e8"},"match":"23b46ce9-9075-4e6b-8fa2-0932a729ad89","tournament":"5ca2f3d5-3682-4635-bac2-87f5a7f41696","bracket":"8aad9de4-4ef3-43e3-8562-55d87ce468e8","league":"7"}],"gameIdMappings":[],"videos":[{"id":5865,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:c88680a3-7fb9-45ff-a8cd-2cc73237a5f7","source":"https://www.youtube.com/embed/fmYWEyZ8XH8?wmode=transparent&start=3319","createdAt":"2017-03-04T21:38:24.000Z","updatedAt":"2017-03-04T21:38:24.000Z","game":"c88680a3-7fb9-45ff-a8cd-2cc73237a5f7"},{"id":5866,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:7a518d87-0684-4fd2-bbd3-a03474b59c69","source":"https://www.youtube.com/embed/fmYWEyZ8XH8?wmode=transparent&start=6949","createdAt":"2017-03-04T21:33:44.000Z","updatedAt":"2017-03-04T21:33:44.000Z","game":"7a518d87-0684-4fd2-bbd3-a03474b59c69"}],"htmlBlocks":[],"match":{"id":"23b46ce9-9075-4e6b-8fa2-0932a729ad89","name":"IM-vs-VG","position":20,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],"games":{"7a518d87-0684-4fd2-bbd3-a03474b59c69":{"id":"7a518d87-0684-4fd2-bbd3-a03474b59c69","name":"G2","generatedName":"IM|VG|G2|23b46ce990754e6b8fa20","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488663347118,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488658339218,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c88680a3-7fb9-45ff-a8cd-2cc73237a5f7":{"id":"c88680a3-7fb9-45ff-a8cd-2cc73237a5f7","name":"G1","generatedName":"IM|VG|G1|23b46ce990754e6b8fa20","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"},{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488663311560,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488658336954,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"86a6d0aa-6124-4066-9258-d7311d32a390":{"id":"86a6d0aa-6124-4066-9258-d7311d32a390","name":"G3","generatedName":"IM|VG|G3|23b46ce990754e6b8fa20","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"},{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488663347118,"source":"bestOf","history":[{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488663311560,"source":"bestOf","closed":true},{"result":[[{"roster":"79de9e54-4454-430b-8578-1dfd6c055343"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1488658339218,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"02f0a8c7-0e55-4d87-a88f-d3cca64f8786":0,"79de9e54-4454-430b-8578-1dfd6c055343":1}}}