{"teams":[{"id":21,"slug":"team-dignitas","name":"Team Dignitas","guid":"be6c8d0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-dignitas-c5j84saq.png","acronym":"DIG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-21T21:17:20.000Z","bios":{"en_US":"<p>From the ashes they rise (Phoenix1, is that you?). Dignitas looked all but lost to the NA LCS after they failed to re-qualify for the LCS, and consequently sold their Challenger spot to Apex Pride. But the League gods had other plans for the organization. In September of 2016 it was announced that both Dignitas and Apex had been bought by the Philadelphia 76ers. .</p>\n\n<p>The two entities were merged in order to play under a unified Dignitas banner, and thus a legendary League of Legends team was reborn. Sporting a roster mixed with domestic and international stars, Dignitas got off to a slow start but picked up steam near the end of the 2017 NA LCS Spring Split. Heading into summmer, Dignitas will look to build on their late-season success from spring -- let’s just hope they fare better than their basketball counterparts.</p>\n\n<p>Coach: David \"Cop\" Roberson</p>","fr_FR":"<p>Dignitas est un nom que tous les fans de League of Legends et d'e-sport en général connaissent au moins de réputation. Il faut dire qu'il s'agit d'une des plus vieilles organisations présentes sur le jeu, depuis l'acquisition en septembre 2011 de Rock Solid, l'équipe de Joedat « Voyboy » Esfahani, William « scarra » Li et Joshua « Jatt » Leesman (oui, le même Jatt qui est aujourd'hui l'un des commentateurs des LCS). Une entrée remarquée sur une scène qui n'était alors que bourgeonnante et surtout le début d'une belle aventure avec des joueurs qui, comme Michael « Imaqtpie » Santana sont aujourd'hui considérés comme des figures historiques de l'e-sport nord-américain.</p>\n\n<p>Malheureusement pour Dignitas, cette popularité a depuis longtemps du mal à être suivie de titres. L'organisation a tenté divers changements au fil des saisons, que ce soit au niveau de l'encadrement ou des joueurs, mais en vain. Si l'équipe américaine peut se targuer d'avoir toujours su maintenir sa place dans les LCS depuis la création de cette ligue, ils n'y ont jamais vu ne serait-ce qu'une finale des play-offs, sans même parler d'une qualification au Championnat du monde. Pire, lors du segment de printemps de la saison 5 l'équipe a terminé à la 9e place et a donc dû participer aux relégations. Certes, ils l'ont emporté avec 3 victoires pour 2 défaites contre Team Fusion, l'équipe de Choi « Huhi » Jae-hyun, à présent mid laner de Counter Logic Gaming, et ont conservé leur place dans les LCS. Mais ce n'est pas avec des performances pareilles que Dignitas allait satisfaire ses fans. Le segment d'été a bien mieux débuté pour l'équipe qui a culminé à 6 victoires pour seulement 2 défaites à l'issue de la 4e semaine de compétition.</p>\n\n<p>Mais, comme souvent avec ceux que leurs fans surnomment affectueusement « Dignitoss » pour leur capacité à jeter leur avance aux orties, le retour à la réalité fut rude. Après une deuxième partie de segment médiocre, l’équipe de Danny « Shiphtur » Le a terminé la saison régulière à la 4e place seulement avant d'être envoyée prématurément en vacances par Team Impulse dès le 4e tour des play-offs.</p>\n\n<p>Aujourd'hui, avec une équipe remaniée à coup de sang neuf européen, Dignitas entend bien faire taire, enfin, toutes les critiques.</p>","pl_PL":"<p>Team Dignitas stanowi jedną z najstarszych organizacji na światowej scenie esportowej. Jej powstanie miało miejsce 9 września 2003 roku w efekcie fuzji dwóch innych stowarzyszeń z gier FPS. Świetnie się rozwijała, więc po zainteresowaniu się i dodaniu kolejnych gier, w czerwcu 2004 roku została zarejestrowana jako spółka z o.o. Od tego czasu Team Dignitas ciągle się rozrasta, nabywając oddziały w kolejnych grach o bogatej scenie esportowej. Dywizja League of Legends powstała 22 września 2011 roku, poprzez nabycie graczy z zespołu Rock Solid. Pierwszym wpisem w długiej historii organizacji było pierwsze miejsce na IGN ProLeague, gdzie pokonali dobrze znane drużyny: Counter Logic Gaming i Curse Gaming. Od tego czasu często plasowali się w okolicy trzeciego miejsca w różnych turniejach. Ich największym osiągnięciem z pierwszych sezonów jest zostanie najlepszym zespołem po Moscow Five na 6 Mistrzostwach Świata IEM. Drużyna Team Dignitas miała również okazję zaprezentować się na Mistrzostwach Świata drugiego sezonu, lecz niestety nie udało się jej się wyjść z fazy grupowej.</p>\n<p>\nZe względu na stale rosnącą konkurencję po trzecim sezonie Team Dignitas dużo częściej znajdował się w okolicach 5 miejsca w różnej rangi rozgrywkach. Jednak ich były AD Carry „CoreJJ” podsumował ideologię Team Dignitas w krótkim zdaniu: „Naszym celem zawsze będzie znalezienie się na podium i kwalifikacja do Mistrzostw Świata, nie uważamy tego za zamiar nie do osiągnięcia.” Te słowa podkreślają świadomość organizacji w kwestii ostatnich niepowodzeń. Raz nawet zmierzyła się z groźbą relegacji, lecz wyszła z tej próby zwycięsko. Jednak cel Team Dignitas pozostaje jeden – szczyt NA LCS. </p>\n<p>\nSama organizacja jest znana z poświęcania uwagi portalom społecznościowym. Często wydaje różnego rodzaju poradniki, które mają być pomocą we wszystkich grach, które wspiera. Dba też o kadrę dla swoich drużyn. Do ich oddziału League of Legends 30 października 2015 roku jako menadżer dołączył Joe \"InnerFlame\" Elouassi, znanym z prowadzenia spraw SK Gaming, a potem Gamers2. Wraz z nim Team Dignitas podpisało kontrakt z Ramem \"Brokenshard\" Djemalem, powszechnie popularnym i bardzo doświadczonym zawodnikiem. Sama organizacja stara się też zakontraktować możliwie najlepszych graczy. Wielu światowej sławy zawodników i nie tylko wyszło właśnie spod skrzydeł Team Dignitas. Joshua \"Jatt\" Leesman, Joedat \"Voyboy\" Esfahani, William \"scarra\" Li i Alberto \"Crumbz\" Rengifo to tylko niektórzy z tłumu, który wyszedł z tej kuźni talentów.</p>\n","de_DE":"Sie erheben sich aus der Asche. Team Dignitas schien für immer aus der NA LCS auszuscheiden, nachdem sie sich zum ersten Mal nicht für die LCS qualifizieren konnten und ihren Platz in der Challenger Series an Apex Pride verkauft hatten. Aber die Götter von League hatten andere Pläne für die Organisation und im September 2016 verkündeten die Philadelphia 76ers, dass sie sowohl Dignitas als auch Apex gekauft hatten. \n</p>\nDie beiden Mannschaften wurden zusammengelegt, um unter dem Namen Dignitas zu spielen. Und so wurde die legendäre „League of Legends“-Mannschaft wiedergeboren. Mit einer Aufstellung aus heimischen und internationalen Stars will Dignitas versuchen, den Frühjahrs-Split der NA LCS 2017 zu gewinnen. Dank der neuen Führung und Aufstellung hat Dignitas eine Chance, die Liga im Sturm zu erobern – bleibt nur zu hoffen, dass sie sich besser schlagen als ihr Gegenstück im Basketball.\n</p>\nCoach: Jung Su Kim\n"},"foreignIds":{"drupalId":"3"},"players":[168,266,325,333,399,751,967],"starters":[168,266,325,399,751],"subs":[333,967]},{"id":215,"slug":"team-envy","name":"Team Envy","guid":"be713b5f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-1tyrikdl.png","acronym":"NV","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-i4es8cq5.png","createdAt":"2016-05-18T22:11:40.000Z","updatedAt":"2017-07-19T23:33:05.000Z","bios":{"en_US":"<p>Team Envy burst into the NA LCS in 2016 after acquiring the slot of Renegades. Their team fared well, gaining a playoff berth in their first split as an organization. The honeymoon period quickly ended though, and the team switched up their roster ahead of the 2017 Spring Split, adding veterans Lira and Apollo into the mix. After narrowly avoiding relegation, Envy will build around their breakout jungler Lira as they head into the summer split.</p>\n<p>Coach: Dong Hwan \"Violet\" Kim</p>","de_DE":"Team Envy stürmte 2016 in die NA LCS, nachdem sie den Platz der Renegades ergattert hatten. Die Mannschaft präsentierte sich gut und schaffte es gleich in ihrem ersten Split, in die Entscheidungsspiele einzuziehen. Kurz darauf endete die Hochphase jedoch und die Mannschaft ergänzte ihre Aufstellung für den Frühjahrs-Split 2017 um die Veteranen Lira und Apollo. Die beiden stoßen gerade noch rechtzeitig zum Rest der Mannschaft, um vor dem Beginn des Frühjahrs-Splits, in dem sie wieder die Entscheidungsspiele erreichen wollen, trainieren zu können."},"foreignIds":{},"players":[149,160,247,347,545,680,1449],"starters":[160,247,545,680,1449],"subs":[149,347]}],"players":[{"id":149,"slug":"nien8","name":"Nientonsoh","firstName":"Zach","lastName":"Malhas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nien8-cf8vutwb.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-19T22:31:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"176","TRLH1":"200000231","TRLH2":"200000135"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":325,"slug":"adrian","name":"Adrian","firstName":"Adrian","lastName":"Ma","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/adrian-d97sgu2b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-08-04T00:05:38.000Z","bios":{"en_US":"<p>Adrian \"Adrian\" Ma might not be known for his playmaking. But that doesn't mean he isn't a vital part to his team's successes. As a member of Immortals, he was the yin to Huni's yang, balancing his top laner's aggression with his own methodical, thoughtful playstyle. He's always ready to save his teammates and focuses heavily on warding, map movements and strategizing. He pioneered a trend in the 2016 NA LCS Summer Split of playing ranged supports like Karma and Soraka over the favoured melee champions.</p>","fr_FR":"<p>À 18 ans, Adrian « Adrian » Ma s'apprête à entamer sa deuxième année en tant que joueur professionnel de League of Legends, au poste de support pour l'équipe Immortals.</p>\n\n<p>Auparavant, il a passé un peu plus d'un an comme support de LMQ en remplacement de Zhang « Mor » Hong-Wei, retourné jouer en Chine. Recruté par une équipe alors en pleine restructuration et qui a d'ailleurs changé de nom pour l'actuel, Team Impulse, quelques semaines seulement après l'arrivée d'Adrian, le jeune joueur américain a pris un risque en signant son contrat. Un pari qui s'est vite révélé gagnant puisque Team Impulse a su, après quelques semaines d'adaptation, trouver les clés pour s'imposer comme l'une des principales menaces des LCS NA. Ils n'ont en revanche pas su concrétiser leur domination lors des play-offs, terminant à la quatrième place lors du segment de printemps puis d'été. Pire, ils n'ont pas réussi à se qualifier pour les championnats du monde, malgré un rang de tête de série numéro 2, lors du tournoi de qualification régional pour la troisième place nord-américaine de la compétition la plus importante de l'année.</p>\n\n<p>Au niveau individuel, Adrian a malgré tout prouvé lors de sa première année au plus haut niveau qu'il est un joueur versatile, capable d’incarner des champions différents en fonction des besoins de l'équipe. Il a aussi montré qu'il savait réagir rapidement et protéger ses coéquipiers même dans des situations inattendues. Une qualité forcément utile pour soutenir un carry AD tel que Jason « WildTurtle » Tran, son nouveau comparse chez Immortals, connu pour être parfois trop agressif lors des combats d’équipes.</p>\n\n<p>Au sein d'une équipe ayant l'expérience de la scène compétitive, le support américain bénéficie en tout cas d’une occasion en or pour passer du statut de jeune joueur prometteur à celui de star titrée au plus haut niveau.</p>\n","pl_PL":"<p>Adrian poznał dzieło Riot Games grając z przyjaciółmi, wkrótce prześcignął ich i znalazł się w akademickim zespole. Jako członek amatorskiej drużyny, brał udział w Challenger League, skąd było bardzo blisko do Challenger Series. Jednak jego zainteresowanie League of Legends zbiegło się w czasie z pójściem na studia. Miał świadomość, że profesjonalna gra pochłania naprawdę dużo codziennego czasu na ćwiczenia, podobnie jak nauka na poziomie uniwersyteckim. Przez to miał wiele wątpliwości, m.in. czy warto porzucić naukę na rzecz esportowej kariery i czy w ogóle ma szanse się wybić. W podjęciu decyzji pomógł mu trener drużyny esportowej, który dał ogłoszenie w sieci o college’u przyjaznym zawodowym graczom. Adrian na początku nie chciał w to uwierzyć. Kiedy się przekonał, że to prawda, podjął decyzję o zaangażowaniu się w scenę League of Legends. Został jednym z pierwszych graczy wspieranych przez uczelnię - Robert Morris University w Illinois.</p>\n<p>\nChociaż \"Adrian\" grał w profesjonalnych drużynach od marca 2014 roku, pokazał się dopiero w Team Impulse w grudniu tego roku. Wraz z tą organizacją zaistniał jako solidny zawodnik, jeden z najlepszych. Niestety zarówno w wiosennym sezonie NA LCS 2015, jak i w letnim skończył na czwartej pozycji, tuż przed podium. Wiązało się to z licznymi problemami, które na swojej drodze po zwycięstwo napotkała jego drużyna. Był blisko dostania się do Mistrzostw Świata, lecz ostatecznie nie udało mu się do nich zakwalifikować. Jednak występy Adriana zrobiły wrażenie na właścicielach organizacji Immortals, której szeregi zasilił w grudniu 2015 roku, a następnie, wraz z nimi zawalczył o więcej w wiosennym sezonie NA LCS 2016.</p>\n<p>\nAdrian to osoba lubiana w środowisku League of Legends, pierwotnie znany jako „10q”, ponieważ fonetycznie brzmiało jak „thank you”. Pochodzący z Texasu support jest znany z doskonałej kontroli wizji na mapie. Przepada za graniem bohaterami, którzy potrafią przyciągnąć nie tylko uwagę przeciwnika, ale także jego postać. Ulubionymi wyborami Adriana są Thresh i Blitzcrank. Dzięki występom w NA LCS i wysokiej pozycji w Kręgu Pretendenta zdobył skromne grono wielbicieli. Na pytania fanów „jak sobie radzi” odpowiada: „Nie pozwalam żeby cokolwiek poza grą mnie rozpraszało, skupiam się na meczu. Po prostu daję z siebie wszystko i nie martwię się co sądzą inni. \nW ogóle w takich sytuacjach się nie denerwuję.” Z takim nastawieniem ma zamiar spełnić swoje marzenie – znaleźć się w drużynie, która zajmuje czołowe miejsce w NA LCS.\n</p>","de_DE":"Adrian „Adrian“ Ma wäre der Erste, der dir sagen würde, dass er kein Spielmacher ist. Aber das bedeutet nicht, dass er keine tragende Rolle für den Erfolg seines Teams spielt. Als Mitglied der Immortals war er das Yin zu Hunis Yang. Die Aggressivität seines Top-Laners konnte er mit seinem methodischen, durchdachten Spielstil ausgleichen. Er ist stets bereit, seinen Teamkollegen zu helfen, und legt großen Wert auf die Platzierung von Augen, Bewegungen auf der Karte und das Entwickeln von Strategien. Er war es, der im Sommer-Split der NA LCS 2016 den Trend zu Fernkampf-Supportern wie Karma und Soraka gesetzt und die zu diesem Zeitpunkt beliebteren Nahkampf-Champions abgelöst hat.</p>\n\nObwohl er sich mit Phoenix1 einem neuen Team anschließt, sollte sich Adrians Spielstil 2017 kaum verändern. Dieses Mal muss er der Gegenpol seines aggressiven Junglers Inori sein. Adrian sorgt vielleicht nicht für Spiele-Highlights, aber er wird auf jeden Fall eine Schlüsselrolle in Phoenix1s neuer Mannschaft spielen.\n"},"foreignIds":{"drupalId":"3041","TRLH1":"200000236","TRLH2":"200000140"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":545,"slug":"lira","name":"LirA","firstName":"Taeyou","lastName":"Nam","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lira-8wdoxm79.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-25T23:33:32.000Z","bios":{"en_US":"<p>Tae-yoo \"LirA\" Nam has been on his jungle game ever since 2013. A veteran of Korea’s LCK, he’s played for teams like CJ Entus, KT Rolster, and the Afreeca Freecs. LirA has impressed while on the Rift, and he’s only gotten better with age. Even though his play improved over time, he began sharing his role with SeongHwan while on the Afreeca Freecs.</p>\n\n<p>The uncertainty with his role going forward lead LirA to look for opportunities elsewhere and soon enough he was on a flight headed to Los Angeles. He joined up with Team Envy as their new starting jungler and looks like a star. Despite a disappointing record, Lira's play in the jungle earned his team leads early in many games. If he can help convert just some of those early leads to late-game ones, LirA and Team Envy can run with the best of them.</p>","de_DE":"Tae-yoo „Lira“ Nam dominiert schon seit 2013 im Dschungel. Als Veteran der koreanischen LCK hat er schon bei CJ Entus, KT Rolster und Afreeca Freecs gespielt. Lira hat in der Kluft beeindruckende Leistungen abgeliefert und er wurde mit dem Alter nur besser. Obwohl er mit der Zeit immer besser wurde, teilte er sich seinen Platz bei den Afreeca Freecs mit SeongHwan.\n</p>\nDa er sich seines Arbeitsplatzes nicht mehr sicher sein konnte, schaute er sich nach anderen Möglichkeiten um, und nur kurze Zeit später saß er in einem Flugzeug Richtung Los Angeles. Er hat sich Team Envy angeschlossen und wie es scheint, ist er eine unmittelbare Verbesserung im Dschungel. Er beherrscht jeden Champion von Lee Sin bis Kindred, es geht nur darum, was sein Team gerade braucht. Liras Reichtum an Wissen und Erfahrung wird es dem neuen Team Envy ermöglichen, im Frühjahrs-Split 2017 wieder um den Einzug in die Entscheidungsspiele zu kämpfen.\n"},"foreignIds":{"drupalId":"4332","TRLH1":"200000225","TRLH2":"200000129"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":751,"slug":"ssumday","name":"Ssumday","firstName":"Chan-ho","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssumday-h9yau0jj.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-27T01:00:31.000Z","bios":{"en_US":"<p>Chan-ho \"Ssumday\" Kim is a feared top laner -- and justifiably so. Widely regarded as one of the world’s premier top laners, Ssumday spent a majority of his career with KT Rolster before becoming one of the most sought after free agents of 2016 and moving to North America to join up in the rebirth of Team Dignitas.</p>\n\n<p>Ssumday’s insanely deep champion pool gives the opposition no chance to shut him down in picks and bans. He poses a serious threat no matter the champion. Need him to tear apart the enemy with magic? Give him Ryze. Oh, you needed a tank to help lock down those pesky damage dealers? Gift him Maokai. Need to cut tanks down to size? Let him slice and dice with Fiora. Sometimes, it feels like Ssumday leaves you with just one option: lose.</p>","fr_FR":"<p>Sur la voie du haut, KT Rolster dispose de Chan-ho « ssumday » Kim, l'un des jeunes loups coréens, tout juste âgé de 19 ans. En dépit de sa jeunesse, ssumday est redouté, et à juste titre. Ssumday a été élu meilleur joueur du Segment d'été des LCK 2015 avec un ratio KDA de 5,22 qui le place en tête du Segment. Concédez-lui un mètre, il vous prend un kilomètre. Essayez, si vous ne me croyez pas.\n</p>\n<p>\nSsumday est efficace avec les mages et les combattants, mais au cours du Segment d'été des LCK c2015, il a surtout dominé avec des tanks. À plusieurs reprises, il a pris KT Rolster sur ses épaules et l'a portée jusqu'à la ligne d'arrivée. S'il met les mains sur Maokai ou Shen, vous devez préparer de quoi vous désengager, parce que ssumday vous poursuivra jusqu'aux extrémités de la carte pour réussir une élimination.\n</p>","pl_PL":"<p>Górny KT Rolster, Chan-ho „ssumday” jest jednym z najmłodszych Koreańczyków – ma Tylko 19 lat. Pomimo młodego wieku ssumday jest niezwykle przerażającym górnym – i całkiem słusznie. Został on wybrany najlepszym graczem letniego splitu LCK 2015, zajmując 1. miejsce ze stosunkiem zabić do zgonów wynoszącym 5,22. Jeżeli dacie mu dłoń, weźmie całą rękę. I to nie jest przesada.\n</p>\n<p>\nSsumday gra niezwykle skutecznie magami i wojownikami, ale większość meczów podczas letniego splitu LCK 2015 rozegrał obrońcami. Wiele razy ciągnął ze sobą całe KT Rolster i doprowadzał ich do linii mety. Jeżeli uda mu się dorwać Maokaia lub Shena, lepiej, żeby wasza drużyna miała jakiś sposób na przerwanie walki, ponieważ ssumday będzie was ścigał na kraniec świata, aby zagwarantować zabójstwo.\n</p>","de_DE":"Chan-ho „Ssumday“ Kim ist ein gefürchteter Top-Laner – und das zu Recht. Ssumday gilt als einer der besten Top-Laner der Welt und hat den Großteil seiner Karriere bei KT Rolster verbracht, bevor er 2016 zu einem der begehrtesten mannschaftslosen Spieler wurde und nach Nordamerika zog, um Teil der Wiedergeburt von Team Dignitas zu werden.\n</p>\nSsumdays unglaublich umfangreicher Championpool macht es seinen Gegnern nahezu unmöglich, ihn aufzuhalten. Er ist immer eine Gefahr, egal, mit welchem Champion er spielt. Soll er die gegnerische Mannschaft mit Magie vernichten? Gib ihm einfach Ryze. Oh, du brauchst einen Tank, der die lästigen Schadensverursacher ausschaltet? Gib ihm Maokai. Brauchst du jemanden, der die Tanks unschädlich macht? Gib ihm Fiora und sieh dabei zu, wie er sie in Stücke schneidet. Wenn du ihn nicht mit Bannen unschädlich machst, bleibt dir meistens nur noch eine Option: verlieren.\n","es_ES":"<p>Chanho \"ssumday\" Kim es uno de los jugadores más jóvenes del panorama competitivo de Corea del Sur, con sólo 19 años. A pesar de su juventud, es un top temido por sus enemigos -- y con razón. Ssumday fue elegido mejor jugador del Split de verano de 2015 con un KDA de 5.22 a lo largo de la temporada. </p>\n\n<p>Ssumday rinde tanto con magos como luchadores, pero en el Split de verano de la LCK 2015 donde mejor ha rendido ha sido con tanques. No han sido pocas las veces en las que se ha echado el equipo a la espalda y lo ha llevado a la victoria. Si consigue jugar con Maokai o Shen, más vale que escojas campeones que puedan quitártelo de encima, porque ssumday te perseguirá hasta el fin del mundo si hace falta para acabar contigo. </p>\n","pt_BR":"<p>O topo da KT Rolster, Chan-ho \"ssumday\" Kim, é uma das jovens armas da Coreia, com apenas 19 anos de idade. Apesar de novo, ssumday é um topo muito temido - e isso é justificável. Ele foi votado como o Melhor Jogador da LCK de Verão 2015, sendo campeão de A/M/A com 5.22 durante a etapa. Dê um centímetro de espaço, e ele pegará um quilômetro. E não, não foi uma piada.\n</p>\n<p>\nSsumday é competente com magos e lutadores, mas a maioria de suas atuações dominantes na LCK de Verão em 2015 foi com tanques. Em múltiplas ocasiões ele colocou a KT Rolster nas costas e carregou até a linha final. Se ele colocar as mãos no Maokai ou no Shen, tenha a certeza de que você vai trazer um pouco de contra-iniciação, porque Ssumday vai te caçar até o fim do mundo.\n</p>"},"foreignIds":{"drupalId":"2147","TRLH1":"200000192","TRLH2":"200000096"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":967,"slug":"big","name":"Big","firstName":"Terry","lastName":"Chuong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/big-9eh6ixp9.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:09:32.000Z","updatedAt":"2017-06-14T20:10:51.000Z","bios":{"fr_FR":"<p>Terry « BIG » Chuong, connaît déjà les LCS NA, mais seulement en tant que remplaçant.</p> \n\n<p>Celui qui se faisait auparavant appeler « Baby » a découvert les studios des LCS lors de la 11e semaine du segment d'été de la saison 2014 au sein de CLG, en remplacement des joueurs de l'équipe première partis s’entraîner en Corée du Sud. Il est ensuite retourné acquérir de l'expérience au sein de la scène challenger nord-américaine chez Storm, au côté de Samson « Lourlo » Jackson, à présent top laner de Team Liquid, et Zachary « Mandatorycloud » Allan, ancien mid laner de XDG. Puis retour en LCS en 2015 lors des trois premiers matchs du segment d'été en tant que support de Team Dragon Knight. Une expérience difficile pour le joueur dans une équipe réunie à la va-vite en raison de l'impossibilité pour l'organisation de faire venir ses titulaires en NA à temps pour le début de la saison.</p>\n\n<p>Pas dégoûté du monde professionnel pour autant, Big est derechef retourné sur la scène challenger, cette fois au sein d'Imagine. Equipe dans laquelle le joueur s'est retrouvé support d'un carry AD français, Pierre « Steeelback » Medjald, fraîchement débarqué en NA après la fin de son contrat chez Fnatic. Une opportunité sans nulle doute formatrice pour le joueur, même s'il n'a pas réussi à se qualifier en LCS avec cette équipe, défaite 3 victoires à 1 par Team 8 lors du tournoi de promotion. </p>\n\n<p>Qu'à cela ne tienne, Baby est aujourd'hui de retour en LCS NA, enfin en tant que titulaire. Il est certes une fois de plus dans un effectif qui pose plus de questions qu'il n'apporte de certitudes, mais ça n'en reste pas moins une occasion en or pour lui de montrer quel est véritablement son niveau. </p>\n","en_US":"<p>\nYou may know Terry “Big” Chuong from his time spent on Team Dragon Knights. While the organized LCS competition tore TDK apart, Big’s presence in the bot lane did not go unnoticed. He caught the eye of Echo Fox, and was brought on board for the 2016 NA LCS Spring Split.\n</p>\n<p>\nBig has proven to be a protector down to his very bones -- Alistar, Janna, and Braum were his supports of choice. But FOX had their fair share of struggles in spring. Now with a new shot in Dignitas's bot lane, he'll have to prove he's up to the challenge.\n</p>","pl_PL":"<p>Terry bardzo wcześnie zaczął swoją przygodę w wirtualnym świecie, ponieważ w wieku 8 lat już czuł się tam jak ryba w wodzie. Był zafascynowany League of Legends od wydania wczesnej bety, w szczególności uwielbiał grać Heimerdingerem. Sceną esportową zainteresował się dopiero za sprawą prośby przyjaciela żeby zajął pozycję junglera w jego drużynie. „BIG” doskonale się wtedy sprawdził w profesjonalnych meczach, w związku z czym podjął wyzwanie osiągnięcia czegoś w tej dziedzinie. Od października 2013 roku do stycznia 2016 roku starał się znaleźć drużynę, wraz z którą dostanie się do NA LCS. Nie powiodło mu się, ale wielokrotnie był o włos od tego wyczynu. Jednak szczęście mu dopisało i został zauważony przez swoich przeszłych przeciwników – Team Dragon Knights. Dzięki temu miał okazję zostać substytutem dla ich supporta w pierwszych tygodniach letniego sezonu NA LCS 2015. Zyskał bezcenne doświadczenie w profesjonalnej lidze, lecz nie udało mu się spełnić marzeń. Kolejny raz los uśmiechnął się do niego w styczniu 2016 roku kiedy został zaproszony do głównego składu nowo utworzonej drużyny Echo Fox. Pod lisim sztandarem zadebiutował w rozgrywkach NA LCS 2016 w okresie wiosennym.</p>\n<p>Urodzony w Los Angeles, w Kaliforni, wcześniej w karierze znany jako „Baby”, Terry nie jest dedykowanym supportem. Lubi zajmować rolę wspierającego w drużynie, lecz na początku swojej kariery doskonale odnalazł się w jungli. Ponadto oświadczył, że aktualnie, jeśli by nie grał na bot-lanie to zdecydowałby się na objęcie pozycji mid-lanera. Póki co „BIG” dobrze się czuje w roli wspierającego, w szczególności jeżeli kompozycja drużyny pozwala mu na wybór bohatera o olbrzymiej ilości punktów zdrowia. Gustuje w postaciach takich jak Thresh, Braum i Nautilus. Styl gry Terry’ego najlepiej charakteryzuje zawrotna ilość asyst podczas rankingowych meczów – jak na prawdziwego supporta przystało.</p>\n"},"foreignIds":{"ESPORTSTMNT02":"200000673","TRLH1":"200000614"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":215}],"scheduleItems":[{"id":"AVw2eygfoUG4HPFjOKQO","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:24b03d42-ec25-41f6-90e2-29b003e91775","scheduledTime":"2017-06-03T22:00:01.511+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"24b03d42-ec25-41f6-90e2-29b003e91775","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"2dd37117-05c9-4944-bf05-62a5baa6ad32","gameHash":"c4f3da0e6c667947"},{"id":"47913846-5e7f-45fd-b186-9c25c8054b9f","gameHash":"4ab73925b54ae5e8"},{"id":"ebeca86f-710a-471e-a058-a5d337b6c8fc","gameHash":"845c652b1663ae8d"}],"videos":[{"id":7090,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:2dd37117-05c9-4944-bf05-62a5baa6ad32","source":"https://www.youtube.com/embed/hkwVrl5miXo?wmode=transparent&rel=0","createdAt":"2017-06-03T23:11:41.000Z","updatedAt":"2017-06-05T05:51:18.000Z","game":"2dd37117-05c9-4944-bf05-62a5baa6ad32"},{"id":7092,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:ebeca86f-710a-471e-a058-a5d337b6c8fc","source":"https://www.youtube.com/embed/r4_M7E5uClY?wmode=transparent&rel=0","createdAt":"2017-06-04T00:11:31.000Z","updatedAt":"2017-06-05T05:45:14.000Z","game":"ebeca86f-710a-471e-a058-a5d337b6c8fc"},{"id":7098,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:47913846-5e7f-45fd-b186-9c25c8054b9f","source":"https://www.youtube.com/embed/9pzoTmvAYns?wmode=transparent&rel=0","createdAt":"2017-06-04T03:02:16.000Z","updatedAt":"2017-06-05T05:51:30.000Z","game":"47913846-5e7f-45fd-b186-9c25c8054b9f"}],"htmlBlocks":[],"match":{"id":"24b03d42-ec25-41f6-90e2-29b003e91775","name":"DIG-vs-NV","position":21,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"},{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],"games":{"2dd37117-05c9-4944-bf05-62a5baa6ad32":{"id":"2dd37117-05c9-4944-bf05-62a5baa6ad32","name":"G1","generatedName":"DIG|NV|G1|24b03d42ec2541f690e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"},{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],"standings":{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641695241,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496640847454,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496531323211,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496527152413,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210060","gameRealm":"TRLH1","platformId":"TRLH1:1002210060","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"47913846-5e7f-45fd-b186-9c25c8054b9f":{"id":"47913846-5e7f-45fd-b186-9c25c8054b9f","name":"G3","generatedName":"DIG|NV|G3|24b03d42ec2541f690e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"},{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],"standings":{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641706841,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641042986,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641041343,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496545250926,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496535679245,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210074","gameRealm":"TRLH1","platformId":"TRLH1:1002210074","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"ebeca86f-710a-471e-a058-a5d337b6c8fc":{"id":"ebeca86f-710a-471e-a058-a5d337b6c8fc","name":"G2","generatedName":"DIG|NV|G2|24b03d42ec2541f690e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"},{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],"standings":{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}]],"timestamp":1496641795560,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}]],"timestamp":1496640958003,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}]],"timestamp":1496535475437,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}]],"timestamp":1496531062804,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002210072","gameRealm":"TRLH1","platformId":"TRLH1:1002210072","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641706842,"source":"bestOf","history":[{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641795560,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641695241,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641042986,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496641041344,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496640958004,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496640847454,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496545250926,"source":"bestOf","closed":true},{"result":[[{"roster":"1c62fdda-cbcf-4857-8d87-d959920b2a51"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1496535679249,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"1c62fdda-cbcf-4857-8d87-d959920b2a51":1,"295cd840-d1b2-4fda-8a23-af9d1fd24340":0}}}