{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":91,"slug":"flash-wolves","name":"Flash Wolves","guid":"be6e12bc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-hksj5z2h.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-72ikguj5.png","acronym":"FW","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T17:45:02.000Z","bios":{"en_US":"<p>\nThe Flash Wolves are one of the most successful and storied teams in the LMS, and are hungry for another shot at the world stage. They’re no strangers to playing against global teams with the world watching; they've built a reputation as one of the only teams to consistently take games off world champions SK telecom T1. The players have spoken often and publicly about their drive to keep pushing LMS as a strong region that can compete with the best.\n</p>\n<p>\nOriginally founded in 2013, the Flash Wolves have consistently maintained their strength in the LMS. They've captured three straight LMS titles going back to last year. The team isn’t happy with running roughshod over the competition in their native region, though -- they’re gearing up to take the fight to the champions of each region.\n</p>\n\n<p>Coach: Chou “Steak” Frank</p>","fr_FR":"Les Flash Wolves sont l'une des équipes des LMS qui ont obtenu les plus grands succès et dont on a le plus parlé, et ils ont hâte de bénéficier d'une nouvelle chance sur la scène mondiale. Ils sont habitués à affronter des équipes internationales sous le regard du monde entier ; ils comptent même parmi les rares organisations à battre systématiquement les champions du monde de SK Telecom T1. Les joueurs ont souvent et publiquement parlé de leur désir de faire des LMS une puissante région capable d'affronter les meilleurs.\n\nFondée en 2013, l'équipe Flash Wolves a constamment maintenu son niveau aux LMS. Ils détiennent d'ailleurs le titre de champions LMS depuis trois années consécutives. Mais l'équipe ne veut pas se contenter de ces succès locaux : elle a bien l'intention d'affronter les champions de toutes les régions et de prouver qu'elle est de taille à attaquer n'importe quelle horde au Mid-Season Invitational 2017.\n\nEntraîneur : Chou « Steak » Frank\n","pl_PL":"Flash Wolves są jedną z najlepszych drużyn w LMS, a jej członkowie po raz kolejny spróbują sięgnąć po chwałę na światowej arenie. Gra przeciwko najwyższej klasy drużynom na oczach całego świata nie jest im obca; zdobyli sobie reputację jednej z niewielu drużyn, które konsekwentnie wygrywają mecze z mistrzami świata, SK Telecom T1. Zawodnicy drużyny często publicznie wspominają, że chcą zaprezentować LMS jako silny region, który może rywalizować z najlepszymi.\n\nZałożona w 2013 roku drużyna Flash Wolves stale osiąga dobre wyniki w LMS. Do zeszłego roku zdobyła trzy tytuły LMS z rzędu. Drużyna nie jest jednak usatysfakcjonowana poniewieraniem lokalnymi rywalami — przygotowuje się do walki z mistrzami  regionów, aby dowieść, że jest watahą, która potrafi pokonać najlepszych na Mid-Season Invitational 2017.\n\nTrener: Chou „Steak” Frank\n","de_DE":"Die Flash Wolves sind eine der erfolgreichsten und bekanntesten Mannschaften der LMS und wollen sich endlich einen internationalen Titel sichern. Sie sind es gewohnt, gegen Mannschaften aus anderen Regionen zu spielen, während die Welt zusieht, und gehören zu den wenigen Mannschaften, die gegen die Weltmeister von SK Telecom T1 gewinnen können. Die Spieler haben auch in der Öffentlichkeit immer wieder betont, dass sie die LMS zu einer Region machen wollen, die sich mit den besten der Welt messen kann.\n\nSeit ihrer Gründung 2013 haben die Flash Wolves stets ihre Stärke in der LMS unter Beweis gestellt. Seit dem letzten Jahr konnten sie sich in der LMS drei Titel sichern. Aber die Mannschaft will sich nicht damit begnügen, ihre Heimregion zu dominieren – sie bereiten sich darauf vor, den Kampf zu den Champions der anderen Region zu tragen und zu beweisen, dass es dieses Wolfsrudel beim Mid-Season Invitational 2017 mit den Größten aufnehmen kann.\n\nTrainer: Chou „Steak“ Frank\n","es_ES":"Flash Wolves es uno de los equipos más laureados y veteranos de la LMS, y está deseando tener una nueva oportunidad en el escenario mundial. No es la primera vez que compite contra equipos de todo el mundo con los espectadores internacionales como público; de hecho, se han forjado una reputación como uno de los pocos equipos capaces de ganar partidas contra los campeones mundiales SK telecom T1. Sus jugadores han hablado en más de una ocasión de forma pública sobre lo decididos que están a conseguir que la LMS se convierta en una región fuerte capaz de competir contra las mejores.\n\nFundado en 2013, Flash Wolves ha mostrado en todo momento su superioridad en la LMS: ha conseguido hacerse con tres títulos de la LMS seguidos. Pero el equipo no se conforma con triunfar en las competiciones de su región, sino que quiere enfrentarse a los campeones de todas las regiones y demostrar que su manada de lobos puede aplastar a los mejores en el Mid-Season Invitational 2017.\n\nEntrenador: Chou ''Steak'' Frank\n","pt_BR":"<p>A Flash Wolves é uma das equipes mais bem-sucedidas e celebradas na LMS e está ávida para outra chance no cenário mundial. Eles sabem bem como é jogar contra equipes globais com o mundo inteiro assistindo; construíram sua reputação como uma das únicas equipes a ganhar consistentemente dos campeões mundiais SK Telecom T1. Os jogadores têm falado frequente e publicamente sobre sua vontade de continuar tornando a LMS uma região forte e capaz de competir com os melhores.</p>\n\n<p>Fundada originalmente em 2013, a Flash Wolves tem mantido sua força na LMS. Eles capturaram três títulos seguidos na LMS desde o ano passado. Mas a equipe não está feliz com seu tratamento da oposição na sua região nativa. E eles estão se preparando para lutar contra os campeões de cada região e provar que esta matilha é capaz de derrotar os melhores no Mid-Season Invitational 2017.</p>\n\nTécnico: Chou \"Steak\" Frank</p>","es_AR":"<p>The Flash Wolves son uno de los equipos con más historia y éxito de la LMS, y se encuentran ansiosos de extender sus galardones al ámbito internacional. No son extraños a estos eventos globales; tienen una rivalidad con el equipo de Norteamérica Counter Logic Gaming, y han ganado partidas contra Cloud9 y Team SoloMid en la IEM Katowice 2015. Sus jugadores intentan llevar a la LMS al punto en que puedan competir con las mejores regiones mundiales, y trabajan para eso diariamente.</p>\n\n<p>Fundado en el 2013, los Flash Wolves se han mantenido a tope de la LMS consistentemente. Su trofeos incluyen el 1º lugar del Spring Split de la LMS en el 2015 y 2016. Pero el equipo no se conforma con liderar su región, se están preparando para pelear contra los campeones de cada rincón del mundo, y probar que esta jauría de lobos puede bajar a los más grandes.</p>\n\n<p><strong>Entrenador: Chen \"WarHorse\" Ju-Chih</strong></p>"},"foreignIds":{"drupalId":"1694"},"players":[110,617,631,633,1646,1849],"starters":[110,617,631,633,1646],"subs":[1849]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":110,"slug":"maple","name":"Maple","firstName":"Yi-Tang","lastName":"Huang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maple-g0kqxct3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":"","createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-07-06T14:27:55.000Z","bios":{"en_US":"<p>Yi-Tang “Maple” Huang is one of the most versatile mid laners around. He’s already proven to be practically unopposed in the LMS region, where he led all mid laners with a 6.9 KDA during the regular season. What’s even more impressive is that he’s still a teenager, with what looks to be a promising future ahead of him on the Flash Wolves.</p>\n\n<p>Maple demonstrated his wide champion pool when he played six different champions in six games at the 2016 World Championship. Unfortunately, he failed to find consistent success, and Flash Wolves failed to make it out of the Group Stage. Maple will no doubt jump at another chance to prove himself on the international stage.</p>","fr_FR":"Yi-Tang « Maple » Huang est l'un des midlaners les plus polyvalents. Il a déjà prouvé qu'il n'avait quasiment aucun adversaire dans la région LMS, où il a devancé tous les autres midlaners avec un KDA de 6,9 pendant la saison régulière. C'est d'autant plus impressionnant quand on sait qu'il est encore adolescent et qu'il a donc un avenir prometteur chez les Flash Wolves.\n\nMaple a montré son vaste pool de champions en jouant six champions différents dans six matchs lors du Championnat du monde 2016. Malheureusement, il a manqué de constance et les Flash Wolves n'ont pas réussi à sortir gagnants de la phase de groupe. Maple ne manquera pas de saisir cette nouvelle chance de montrer toute l'ampleur de son talent sur la scène internationale lors du Mid-Season Invitational 2017\n","pl_PL":"Yi-Tang „Maple” Huang jest aktualnie jednym z najwszechstronniejszych środkowych. Pokazał już, że jest praktycznie niepokonany w regionie LMS, w którym prowadził wśród środkowych z wynikiem 6,9 Z/Z/A w sezonie zasadniczym. Jeszcze większe wrażenie robi fakt, że wciąż jest nastolatkiem, którego czeka obiecująca przyszłość we Flash Wolves.\n\nMaple zademonstrował swoją szeroką pulę bohaterów, gdy zagrał sześcioma różnymi bohaterami w sześciu grach Mistrzostw Świata 2016. Niestety nie udało mu się powtórzyć wcześniejszych sukcesów i Flash Wolves nie zdołali wyjść z fazy grupowej. Maple bez wątpienia z radością skorzysta z kolejnej okazji, by dowieść swojej wartości na międzynarodowej arenie Mid-Season Invitational 2017.\n","de_DE":"Yi-Tang „Maple“ Huang ist einer der vielseitigsten Mid-Laner überhaupt. Mit einer TTU von 6,9 (der höchste Wert aller Mid-Laner) während der regulären Saison hat er bewiesen, dass es in der LMS-Region niemanden gibt, der es mit ihm aufnehmen kann. Noch beeindruckender ist, dass er noch ein Teenager ist, der zusammen mit den Flash Wolves eine große Zukunft vor sich hat.\n\nMaple hat mit sechs unterschiedlichen Champions in sechs Spielen der Weltmeisterschaft 2016 bewiesen, wie vielseitig er ist. Leider war er zu unbeständig und die Flash Wolves schieden in der Gruppenphase aus. Maple wird beim Mid-Season Invitational 2017 ohne Zweifel versuchen, sein Können unter Beweis zu stellen.\n","es_ES":"Yi-Tang ''Maple'' Huang es uno de los mid más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la región LMS, donde ha destacado entre los mid con un A/M/A de 6,9 puntos durante la temporada regular. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.\n\nMaple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió mantener la regularidad y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para ponerse a prueba en el escenario internacional del Mid-Season Invitational 2017.\n","pt_BR":"<p>Yi Tang “Maple” Huang é um dos jogadores de meio mais versáteis que existe. Ele já provou ser praticamente imbatível na região LMS, onde conseguiu 48,6% dos votos da rota. O que é ainda mais impressionante é que ainda é um adolescente, ostentando o que parece ser um futuro promissor na Flash Wolves.</p>\n\n<p>Maple demonstrou seu grande rol de Campeões quando jogou com seis personagens diferentes em seis partidas do Campeonato Mundial 2016. Infelizmente, ele não conseguiu manter o sucesso e a Flash Wolves falhou em sair da Fase de Grupos. Dada outra chance, Maple certamente vai agarrar a oportunidade de batalhar contra outros dos melhores jogadores de meio do mundo.</p>","es_AR":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>","cs_CZ":"<p>Yi Tang „Maple“ Huang je jedním z nejvšestrannějších středových lajnařů, na které jen můžete narazit. Jasně prokázal, že v celém LMS by jen těžko hledal nějakou konkurenci, o čemž svědčí i 48,6 % hlasů, které ve středové lajně získal. Tento fakt je o to působivější, že je dosud teenager. Vše nasvědčuje tomu, že jej v řadách Flash Wolves čeká slibná budoucnost.</p>\n\n<p>Maple na mistrovství světa 2016 demonstroval šíři své množiny šampionů, v šesti utkáních totiž hrál za šest různých postav. Bohužel se mu ne vždy dařilo a Flash Wolves nepostoupili ze skupiny. Maple tedy určitě využije druhou šanci rozpoutat masakr mezi těmi nejlepšími středovými lajnaři světa.</p>","el_GR":"<p>Ο Yi Tang “Maple” Huang είναι ένας από τους πιο ευέλικτους παίκτες μεσαίας λωρίδας. Έχει αποδείξει ήδη ότι δεν έχει αντίπαλο στο LMS, άρα δεν ήταν καθόλου περίεργο που συγκέντρωσε το 48,6% των ψήφων της περιοχής. Αυτό που είναι ακόμα πιο εντυπωσιακό είναι ότι ακόμα δεν έχει κλείσει καν τα είκοσι και, όπως όλα δείχνουν, έχει μπροστά του ένα λαμπρό μέλλον με τους Flash Wolves.</p>\n\n<p>Ο Maple έδειξε σε όλους πόσο καλά χειρίζεται μια τεράστια γκάμα ηρώων, όταν έπαιξε με έξι διαφορετικούς ήρωες σε έξι παιχνίδια του Παγκοσμίου Πρωταθλήματος 2016. Δυστυχώς, δεν κατάφερε να πιάσει σταθερή απόδοση, με αποτέλεσμα να μην καταφέρουν οι Flash Wolves να περάσουν τη Φάση Ομίλων. Είναι βέβαιο ότι ο Maple θα αδράξει τη δεύτερη ευκαιρία που του δίνεται για να αποδείξει ότι αξίζει μια θέση στους καλύτερους παίκτες μεσαίας λωρίδας στον κόσμο.</p>\n","hu_HU":"Yi Tang „Maple” Huang az egyik legsokoldalúbb középső ösvényes játékos. Az LMS régióban gyakorlatilag nincs kihívója, és a középső ösvényesekre leadott szavazatok 48,6%-át gyűjtötte be. Ez úgy érte el, hogy még tizenéves, és ígéretes karrier áll előtte a Flash Wolves tagjaként.</p>\n\nMaple a 2016-os világbajnokságon is megcsillogtatta nagy hősrepertoárját, és hat játékban hat különböző hőssel játszott. Sajnos nem sikerült következetesen nyerniük, és a Flash Wolves nem jutott tovább a csoportkörből. Ha esélyt kap rá, Maple örömmel veti bele magát a harcba a világ legjobb középső ösvényesei ellen.\n","it_IT":"Yi Tang \"Maple\" Huang è uno dei centrali più versatili attualmente in circolazione. Ha già dimostrato più volte di non avere rivali nella LMS, dove ha conquistato il 48,6% dei voti per la sua categoria. La cosa che più colpisce di lui è però la sua giovane età e il brillante futuro che lo attende assieme ai Flash Wolves.</p>\n\nMaple ha dato prova della sua grande abilità con numerosi campioni durante i Mondiali 2016 giocando 6 incontri con 6 personaggi diversi. Purtroppo non è riuscito a ottenere un successo costante, e i Flash Wolves hanno dovuto abbandonare il torneo durante la fase a gironi. Maple sfrutterà sicuramente questa seconda opportunità per portare scompiglio tra i migliori centrali del mondo.\n","ro_RO":"Yi Tang ''Maple'' Huang este unul dintre cei mai adaptabili jucători de pe culoarul din mijloc. A dovedit deja că practic nimeni nu se poate pune cu el în regiunea LMS, unde a obținut 48,6 la sută din voturile pentru culoarul din mijloc. Și mai impresionat, Maple e încă adolescent, așa că probabil că are un viitor promițător alături de Flash Wolves.\n</p>\nA demonstrat la Campionatul Mondial 2016 că poate juca cu un număr mare de campioni, făcând șase alegeri diferite în șase meciuri. Din păcate, nu a avut mereu succes, iar Flash Wolves nu a reușit să treacă de faza grupelor. Acum că a primit o nouă șansă, cu siguranță că va profita de ea și va dezlănțui haosul împotriva celor mai buni jucători din lume de pe culoarul din mijloc.\n","es_MX":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>"},"foreignIds":{"drupalId":"674","TRLH3":"1001360063","TRLH4":"1001310063","TRTW":"200000014","TRLT3":"200000254","TRLH1":"200000436","TRLH2":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":617,"slug":"swordart","name":"SwordArT","firstName":"Shou-Chieh","lastName":"Hu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swordart-23wa49d3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:28:19.000Z","bios":{"en_US":"<p>Behind every great marksman is a great support. Chieh “SwordArT” Hu a perfect example of that. The LMS veteran excels on champions that can peel, zone and protect for his rookie ADC in the bot lane. He’s played a key role in all of the Flash Wolves’ upset victories over SK telecom T1, providing the vision and crowd control his team needs to win.</p> <p>He’s already established himself as the best support in the LMS, leading his role during the regular season with a ridiculous 12.0 KDA. While Maple and Karsa get the acclaim for their big plays, SwordArT is the guy behind the scenes making it all happen. The calm, cool, and collected shotcaller of the team, SwordArT can be found where the action is hottest, directing his teammates and keeping them alive.</p>","fr_FR":"Derrière chaque grand tireur se cache un grand support. Chieh « SwordArT » Hu illustre parfaitement cette maxime. Ce vétéran des LMS excelle avec les champions qui lui permettent de contrôler l'espace et de protéger son jeune ADC sur la voie du bas. Il a joué un rôle clé dans les victoires surprises des Flash Wolves face à SK Telecom T1, apportant la vision du jeu et les capacités de contrôle de foule dont son équipe avait besoin pour gagner.\n\nIl s'est illustré en devenant le meilleur support des LMS lors de la saison régulière, grâce à un KDA effarant de 12,0. Maple et Karsa sont acclamés pour leurs actions spectaculaires, mais SwordArT est bel et bien l'homme de l'ombre qui rend tout ceci possible. Décideur calme et posé au sein de l'équipe, SwordArT se trouve là où l'action est la plus débridée, dirigeant ses équipiers et les gardant en vie.\n","pl_PL":"Za każdym świetnym strzelcem stoi świetny wspierający. Chieh „SwordArt” Hu jest tego idealnym przykładem. Ten weteran LMS najlepiej gra bohaterami, którzy potrafią eskortować, utrudniać dostęp wrogom i chronić jego debiutującego prowadzącego na dolnej alei. Odegrał kluczową rolę we wszystkich niesamowitych zwycięstwach Flash Wolves z SK Telecom T1, zapewniając wizję i kontrolę tłumu, których drużyna potrzebuje, by wygrywać.\n\nJuż pokazał, że jest najlepszym wsparciem w LMS, osiągając szczyt w swojej roli podczas sezonu zasadniczego z nieprawdopodobnym wynikiem 12,0 Z/Z/A. Podczas gdy Maple i Karsa zachwycają swoimi wspaniałymi zagrywkami, SwordArT to gość, który stoi za kulisami i sprawia, że kolegom udaje się osiągnąć wszystko, co zamierzyli. Spokojnego i opanowanego lidera drużyny, jakim jest SwordArT, można znaleźć wszędzie tam, gdzie toczy się najgorętsza akcja. Stamtąd kieruje kolegami i utrzymuje ich przy życiu.\n","de_DE":"Hinter jedem großen Schützen steht ein großer Supporter. Und Chieh „SwordArT“ Hu ist ein perfektes Beispiel dafür. Der Veteran der LMS zeichnet sich vor allem mit Champions aus, mit denen er die Gegner abdrängen und seinen AD-Carry beschützen kann. Er spielte bei den Siegen der Flash Wolves gegen SK Telecom T1 eine entscheidende Rolle, weil er für die notwendige Sicht sorgte und seine Gegner mit Effekten zur Massenkontrolle unschädlich machte.\n\nMit einer unglaublichen TTU von 12,0 in der regulären Saison hat er bereits bewiesen, dass er der beste Supporter der LMS ist. Während Maple und Karsa für ihre „Big Plays“ bejubelt werden, ist SwordArT der Mann im Hintergrund, der all das überhaupt erst möglich macht. SwordArT ist der ruhige, gelassene und gefasste Spielführer der Mannschaft, der immer dort ist, wo es am heißesten wird, um seinen Teamkameraden die Richtung vorzugeben und sie am Leben zu halten.\n","es_ES":"Detrás de todo buen tirador, hay un buen apoyo. Chieh ''SwordArt'' Hu es un perfecto ejemplo de eso. El veterano de la LMS destaca con campeones que pueden defender, aislar y proteger a su ADC novato en la calle inferior. Ha jugado un papel clave en todas las victorias inesperadas de Flash Wolves contra SK telecom T1, pues ha facilitado la visión y el control de adversario que su equipo necesitaba para ganar.\n\nSe ha consolidado como el mejor apoyo de la LMS, destacando durante la temporada regular con un apabullante A/M/A de 12 puntos. Maple y Karsa serán los que se lleven los vítores por las grandes jugadas, pero SwordArT será quien las haga posibles entre bambalinas. El calmado líder del equipo, SwordArT, siempre se encontrará donde esté la acción, dirigiendo a sus compañeros y manteniéndolos con vida.\n","pt_BR":"<p>Atrás de todo ótimo carregador há um ótimo suporte. Chieh \"SwordArT\" Hu é um exemplo perfeito disso. O veterano da LMS manda bem com Campeões que podem iniciar, zonear e proteger o seu carregador novato na rota inferior. Ele teve um papel essencial em todas as vitórias da Flash Wolves sobre a SK Telecom T1, dando a visão e o Controle de Grupo que sua equipe precisou para vencer.</p> <p>Ele já se estabeleceu como o melhor suporte da LMS, liderando sua função durante a temporada regular com uma AMA absurdo de 12,0. Apesar de Maple e Karsa levarem todo o crédito pelas grandes jogadas, SwordArT é o cara que torna tudo isso possível. O calmo e tranquilo tomador de decisões da equipe pode ser encontrado sempre onde a ação estiver bombando, guiando seus companheiros e mantendo-os vivos. </p>","es_AR":"<p>Tras cada tirador agresivo hay un hábil soporte, un dicho que se ha confirmado en la carrera de Hu \"SwordArT\" Shou-Chieh. A SwordArT se lo considera un soporte mecánico increíblemente fuerte que lucha usando un campeón que pueda impedir acciones del enemigo, cubrir zonas y proteger (habilidades útiles cuando se está en un carril con NL). Si bien sus compañeros de equipo le recriminan algún combo ocasional fallido o Pulverizar de Alistar que solo golpea el aire, siempre busca proteger y defender a su equipo, símbolo de una verdadera leyenda de soporte.</p>\n\n<p>Buscará ser considerado como uno de los mejores soportes del mundo en Shanghai. Mientras Maple y Karsa reciben la atención por sus grandes actuaciones, SwordArT es quien se queda en segundo plano y hace que todo funcione. SwordArT, el tranquilo, relajado y sereno tirador del equipo, puede encontrarse donde la acción es más intensa, dirigiendo a sus compañeros y manteniéndolos con vida.</p>"},"foreignIds":{"drupalId":"676","TRLH3":"1001160054","TRLH4":"1001160054","TWTW":"135240","TRTW":"200000109","TRLT3":"200000256","TRLH1":"200000438","TRLH2":"200000338"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":631,"slug":"karsa","name":"Karsa","firstName":"Hao-Xuan","lastName":"Hong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/karsa-4n8bncs5.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:35:08.000Z","bios":{"en_US":"<p>Hao-Xuan “Karsa” Hong is the epitome of a “carry” jungler. Nothing strikes fear in Flash Wolves’ opponents as much as when Karsa locks in a Lee Sin or Graves pick for an important match. His legion of fans wouldn’t have it any other way.</p>\n\n<p>Karsa and the Flash Wolves impressed at Worlds last year by taking a game off soon-to-be champs SK telecom T1 in the group stage. The victory continued a trend for the Flash Wolves, who have built a name for themselves by upsetting SKT at international events.</p>","fr_FR":"Hao-Xuan « Karsa » Hong est la quintessence même d'un jungler « carry ». Rien ne fait plus peur aux adversaires des Flash Wolves que de voir Karsa choisir Lee Sin ou Graves pour un match important. Et ce n'est pas sa légion de fans qui nous contredira.\n\nKarsa et les Flash Wolves ont fait grande impression au Mondial l'an dernier en infligeant une défaite aux futurs champions de SK Telecom T1 lors de la phase de groupe. La chance a continué de sourire aux Flash Wolves qui se sont faits un nom en triomphant de SKT lors d'événements internationaux. Karsa va maintenant apporter son style de jeu spectaculaire et riche en ganks au Brésil, où il tentera de répéter son exploit contre les champions du monde.\n","pl_PL":"Hao-Xuan „Karsa” Hong to uosobienie „prowadzącego” dżunglera. Nikt nie budzi takiego lęku u przeciwników Flash Wolves, jak Karsa wybierający Lee Sina lub Gravesa w ważnym meczu. Legiony jego fanów uważają, że dzieje się tak nie bez powodu.\n\nKarsa i Flash Wolves zaimponowali na zeszłorocznych Mistrzostwach, wygrywając grę z SK Telecom T1 (przyszłymi mistrzami) w fazie grupowej. Zwycięstwo stanowiło kontynuację tradycji Flash Wolves, którzy zasłynęli drażnieniem SKT na imprezach międzynarodowych. Teraz Karsa pokaże swój oparty na gankowaniu, błyskotliwy styl gry w Brazylii, gdzie zamierza kolejny raz dogryźć mistrzom świata.\n","de_DE":"Hao-Xuan „Karsa“ Hong ist der Inbegriff eines „Carry“-Junglers. Nichts jagt den Gegnern der Flash Wolves mehr Angst ein als Karsa, wenn er in einem wichtigen Spiel Lee Sin oder Graves auswählt. Und genau das wollen seine zahlreichen Fans sehen.\n\nKarsa und die Flash Wolves haben bei der WM im letzten Jahr beeindruckt, indem sie in der Gruppenphase ein Spiel gegen die zukünftigen Weltmeister SK Telecom T1 gewinnen konnten. Mit diesem Sieg konnten die Flash Wolves den Trend fortsetzen und SKT wieder bei einem internationalen Turnier überraschen. Jetzt reist Karsa mit seinem auf Ganks basierenden Spielstil nach Brasilien, wo er den Weltmeister erneut in die Knie zwingen will.\n","es_ES":"Hao-Xuan ''Karsa'' Hung es la personificación del jungla carry. Nada despierta más terror entre los oponentes de Flash Wolves que ver a Karsa seleccionar a Lee Sin o a Graves en una partida importante. Su legión de fans lo tiene claro.\n\nKarsa y Flash Wolves dejaron a la audiencia boquiabierta el año pasado tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK telecom T1. La victoria continuó la tradición de Flash Wolves, que se ha ganado la fama vencer inesperadamente a SKT en los eventos internacionales. Karsa ahora trasladará su llamativo estilo de juego basado en las emboscadas a Brasil, donde intentará vencer una vez más a los campeones del mundo.\n","pt_BR":"<p>Hao-Xuan \"Karsa\" Hong é um verdadeiro caçador \"carregador\". Nada causa tanto medo nos adversários da Flash Wolves como o Karsa de Lee Sin ou Graves em uma partida importante. Sua legião de fãs não aceitaria nada diferente.</p>\n\n<p>Karsa e a Flash Wolves impressionaram no Mundial do ano passado, conseguindo uma vitória contra a campeã SK Telecom T1 na Fase de Grupos. A vitória continuou um tema recorrente para a Flash Wolves, que fez seu nome vencendo a SKT em eventos internacionais. Karsa agora trará seu estilo de jogo exuberante e de fortes emboscadas para o Brasil, onde ele vai tentar dar outra mordida nos campeões mundiais.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hau-Hsuan \"Karsa\" Hung은 Flash Wolves 선수들 중에서 2013 월드 챔피언십에 Gamania Bears로 출전하지 않은 유일한 선수입니다. 하지만 팀에서 소외감을 느끼진 않죠. Karsa는 전 Gama Bears 정글러 Winds를 보며 정글 운영의 요령을 배웠습니다. 덕분에 정신적으로 그의 후임자가 된 동시에 팀에 자연스럽게 어울리게 됐죠. </p>\n<p style=”font-family:”나눔고딕”;\">Karsa는 현재 대만에서 가장 강력한 정글러 중 하나로 꼽힙니다. 2015 월드 챔피언십에서 킬 관여율 75%라는 엄청난 기록을 낸 걸 보면 알 수 있죠. Flash Wolves는 8강에서 멈춰야 했지만 여전히 LMS 지역의 자부심입니다. 믿겨지지 않는다면 그의 팬이 얼마나 많은지 확인해 보세요. Karsa는 Flash Wolves 선수들 중에서 팬클럽 규모가 가장 큽니다. Karsa에게 가면 다신 돌아올 수 없죠. 늑대 무리에 들어온 걸 환영합니다. </p>\n","es_AR":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>","cs_CZ":"<p>Hao Hsuan „Karsa“ Hung je učebnicovým příkladem „tahounského“ džunglera. Nic nenažene soupeřům Flash Wolves takový strach, jako když si Karsa při důležitém utkání vybere Lee Sina nebo Gravese. Zástupy jeho fanoušků jsou ovšem spokojeny – důkazem je, že obdržel 49 % hlasů pro džunglera z LMS.</p>\n\n<p>Karsa a Flash Wolves podali na MS velice slušný výkon, za zmínku stojí především fakt, že ve skupině porazili budoucí šampiony z SK Telecom T1. Tato výhra byla pokračováním zavedeného trendu, Flash Wolves se totiž proslavili tím, jak na mezinárodních turnajích s oblibou šlapou SKT na kuří oko. Karsův efektní herní styl plný přepadů bude na All-Star 2016 jistě vzbuzovat pozornost, tento turnaj je totiž jako stvořený pro mladé kreativní hráče typu tohoto hvězdného džunglera z Flash Wolves.</p>","el_GR":"<p>Ο Hao Hsuan “Karsa” Hung είναι η επιτομή του παίκτη ζούγκλας τύπου carry. Όταν ο Karsa καταφέρνει να πάρει τον Λι Σιν ή τον Γκρέιβς σε έναν σημαντικό αγώνα, προκαλεί τον τρόμο σε όλους τους αντιπάλους των Flash Wolves. Οι στρατιές των οπαδών του θέλουν να τον δουν να κάνει αυτό που ξέρει καλύτερα, για αυτό του έδωσαν το 49% των ψήφων του LMS για τη θέση της ζούγκλας.</p>\n\n<p>Ο Karsa και οι Flash Wolves έκαναν αίσθηση φέτος στο Παγκόσμιο Πρωτάθλημα όταν κατάφεραν να πάρουν ένα παιχνίδι από τους αδιαμφισβήτητους πρωταθλητές SK Telecom T1 στη φάση ομίλων. Η νίκη αυτή συνέχισε την παράδοση των Flash Wolves, οι οποίοι καταφέρνουν να νικούν τους SKT σχεδόν σε κάθε διεθνές τουρνουά. Ο Karsa έχει ένα θεαματικό στυλ παιχνιδιού με έμφαση στον αιφνιδιασμό, το οποίο σίγουρα θα προκαλέσει αίσθηση στο Τουρνουά All-Star 2016, μια διοργάνωση που συνήθως αναδεικνύει νεαρούς οργανωτές, όπως ο διάσημος παίκτης ζούγκλας των Flash Wolves.</p>\n","hu_HU":"Hao Hsuan „Karsa” Hung egy igazi „lövész” dzsungelharcos. A Flash Wolves ellenfelei joggal félhetnek, ha Karsa megszerzi Lee Sint vagy Gravest egy fontos meccsen. A rajongói is szeretnék újra látni őt, mivel az LMS dzsungelharcos-szavazásában 49%-nyi szavazatot söpört be.</p>\n\nKarsa és a Flash Wolves a vb-n játékot tudott nyerni a későbbi bajnok SK Telecom T1 ellen a csoportkörben. A győzelemmel a Flash Wolves tovább építette a hírnevét, és rendszeresen odaszúrnak az SKT-nek a nemzetközi versenyeken. Karsa szereti a rajtaütéseket és a látványos akciókat, amit a 2016-os All-Star gála közönsége is imádni fog, hiszen a versenyt gyakorlatilag a Flash Wolves dzsungelharcos sztárjához hasonló fiatal tehetségeknek találták ki.\n","it_IT":"Hao Hsuan \"Karsa\" Hung è l'incarnazione del perfetto \"carry\" da giungla. Nulla instilla più paura negli avversari dei Flash Wolves di quando Karsa sceglie Lee Sin o Graves durante un incontro importante. Le sue legioni di fan non hanno dubbi su di lui, come testimoniato dal 49% di voti ottenuti nella categoria Giungla della LMS.</p>\n\nKarsa e i Flash Wolves hanno mostrato grandi numeri ai Mondiali di quest'anno, vincendo una partita nei gironi contro coloro che poi si sarebbero confermati campioni del mondo, gli SK Telecom T1. Questa vittoria rappresenta quasi una consuetudine per i Flash Wolves, che sono ormai noti per essere una spina nel fianco degli SKT negli eventi internazionali. Lo stile vistoso e fortemente basato su assalti di Karsa terrà di sicuro molti occhi incollati agli schermi durante l'All-Star 2016, un evento che molti considerano fatto su misura per giovani registi come la star della giungla dei Flash Wolves.\n","ro_RO":"Hao Hsuan ''Karsa'' Hung este întruchiparea unui jungler ''carry''. Adversarii celor de la Flash Wolves au de ce să se teamă când Karsa îl alege pe Lee Sin sau pe Graves într-un meci important. Numeroșii săi fani n-au vrut nici ei să-l lase la greu și l-au onorat cu 49 la sută din voturile pentru junglerul LMS.\n</p>\nKarsa și Flash Wolves au impresionat la Mondialele din acest an, câștigând un meci în faza grupelor împotriva viitorilor campioni, SK Telecom T1. Victoria a continuat tendința deja renumită a echipei de a-i surprinde în mod neplăcut pe cei din SKT la evenimente internaționale. Stilul de joc bazat pe gank-uri al lui Karsa va atrage cu siguranță multe priviri la All-Star 2016, un eveniment care pare parcă făcut special pentru playmakeri tineri precum junglerul extraordinar din Flash Wolves.\n","es_MX":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>"},"foreignIds":{"drupalId":"3721","TRLH3":"1001360062","TRLH4":"1001310062","TRLH1":"200000435","TRLH2":"200000335","TRTW":"200000013","TRLT3":"200000253"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":633,"slug":"mmd","name":"MMD","firstName":"Li-Hong","lastName":"Yu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mmd-hhy6fhit.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:37:03.000Z","bios":{"en_US":"<p>\nA one-time sub who stood behind Steak, Li-Hong “MMD” Yu has now built a name for himself as the Flash Wolves' top laner. MMD is known for his aggression and carry style, and his mechanics are top tier. However, he’s perfectly happy to switch to supportive tank picks and funnel resources towards the rest of his team. His Equalizers were on point as Rumble in the LMS Finals, which helped his team pick up the 3-1 victory over ahq e-Sports Club.\n</p>","es_AR":"<p>Yu \"MMD\" Li-Hung, que alguna vez fue espectador de la escena competitiva, es ahora el carrilero superior inicial de FW, su miembro más reciente y una pieza esencial de su éxito. MMD fue famoso anteriormente por sus juegos como acarreador y por su agresividad, siendo aún una clara mejora mecánica sobre su predecesor. En el meta actual, está feliz de cambiar al enfoque de tanque de soporte que actualmente lucha como Ekko y canaliza recursos para los acarreadores de su equipo. A pesar de que desempeña un papel de soporte, tiene lo suyo: su Poppy 6/1/11 contra AHQ en la Final del LMS de primavera es prueba de que es capaz de ir al frente y hacer el trabajo en la primera línea. Con Steak aún en la mayoría de los simpatizantes, MMD buscará su lugar frente al mundo en el Campeonato Mundial 2016.</p>","fr_FR":"Suite à son expérience de remplaçant pour Steak, Li-Hong « MMD » Yu s'est fait un nom en tant que toplaner des Flash Wolves. MMD est connu pour son agressivité et son style de carry, ainsi que pour ses mécaniques de premier ordre. Cependant, il est heureux d'incarner des supports tankys et de canaliser les ressources vers le reste de son équipe. Les Éradications de son Rumble ont fait des miracles lors de la finale des LMS et ont permis à son équipe de remporter une victoire à 3-1 contre ahq e-Sports Club. Il s'apprête maintenant à participer au Mid-Season Invitational 2017 pour avoir une nouvelle chance de vaincre SK Telecom T1.","es_ES":"El que fuera suplente de Steak, Li-Hong ''MMD'' Yu, ahora se ha forjado una reputación como top de Flash Wolves. MMD es famoso por su agresividad y liderazgo, y sus mecánicas son del más alto nivel. No obstante, está encantado de pasar a usar tanques de apoyo y concentrar todos sus recursos en ayudar a su equipo. En la final de la LMS consiguió usar justo a tiempo los Equilibradores de Rumble, lo que ayudó a que su equipo consiguiese una victoria 3-1 contra ahq e-Sports Club. Ahora se dirige al Mid-Season Invitational 2017 para enfrentarse una vez más a SK telecom T1","de_DE":"Der ehemalige Ersatzspieler für Steak, Li-Hong “MMD” Yu, konnte sich im Laufe der Zeit als Top-Laner der Flash Wolves einen Namen machen. MMD ist für seinen aggressiven Carry-Stil und seine überragenden Spielmechaniken bekannt. Er hat jedoch auch kein Problem damit, unterstützende Tanks zu spielen und dem Rest seiner Mannschaft Ressourcen zukommen zu lassen. Beim 3–1 Sieg über ahq e-Sports Club im Finale der LMS brachte er seine Gegner mit Rumbles Einebner zur Verzweiflung. Jetzt ist er zum Mid-Season Invitational 2017 unterwegs, wo er wieder versuchen wird, SK Telecom T1 zu Fall zu bringen.","pl_PL":"Jednorazowy zastępca Steaka, Li-Hong „MMD” Yu zdobył sobie rozgłos jako górny Flash Wolves. MMD jest znany ze swojej agresji i stylu prowadzenia, a jego umiejętności mechaniczne są najwyższej klasy. Potrafi też bez żadnych problemów zmienić rolę na wspierającego obrońcę, aby uzupełniać zasoby pozostałych członków drużyny. Doskonale wykorzystał Wyrównywacze Rumble’a w finale LMS, co pomogło drużynie osiągnąć zwycięstwo 3−1 z ahq e-Sports Club. Teraz zmierza na Mid-Season Invitational 2017, by jeszcze raz spróbować pobić SK Telecom T1.","pt_BR":"<p>O antes reserva de Steak, Li-Hong \"MMD\" Yu, agora deixou seu nome famoso como jogador da rota superior da Flash Wolves. MMD é conhecido pelo seu estilo agressivo e carregador, e por suas mecânicas de primeira. No entanto, ele ficou feliz de trocar para escolhas de tanques suportes e canalizar recursos para o resto de sua equipe. Seus Equalizadores estavam perfeitos como Rumble na final da LMS, quando ele ajudou a equipe a conquistar uma vitória de 3-1 sobre a ahq e-Sports Club. Agora ele vai para o Mid-Season Invitational 2017 para conseguir revanche contra a SK Telecom T1.</p>"},"foreignIds":{"drupalId":"3720","TRTW":"200000150","TRLT3":"200000252","TRLH1":"200000434","TRLH2":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1646,"slug":"betty","name":"Betty","firstName":"Yu-Hung","lastName":"Lu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betty-i225lkpn.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-01-09T22:47:23.000Z","updatedAt":"2017-07-06T14:28:07.000Z","bios":{"en_US":"<p>Yu-Hung \"Betty\" Lu is the standout rookie AD carry for the Flash Wolves. He joined the squad late last year, replacing former starter NL. Formerly known as \"DoubleRed,\" he made his debut at IEM Oakland and later picked up his first trophy at the IEM World Championship in Katowice. He continued to impress in the 2017 LMS Spring Split, leading all AD carries with an 8.8 KDA. He excelled on Ashe and Varus, going 16-0 combined on those two champions.</p>","pl_PL":"Yu-Hung „Betty” Lu jest wyróżniającym się debiutantem w roli prowadzącego Flash Wolves. Dołączył do drużyny pod koniec zeszłego roku, zastępując wcześniejszego zawodnika pierwszego składu, NL-a. Znany dawniej jako „DoubleRed” debiutował na IEM Oakland, a później zdobył swoje pierwsze trofeum na Mistrzostwach Świata IEM w Katowicach. \n\nNie przestawał imponować podczas splitu wiosennegoLMS 2017, stając się liderem wszystkich prowadzących z 8,8 Z/Z/A. Błyszczał, grając Ashe i Varusem, i w efekcie zdobył z tą dwójką bohaterów łączny wynik 16−0. Teraz jego determinacja zostanie przetestowana podczas Mid-Season Invitational 2017, na którym zmierzy się z kilkoma najlepszymi dolnymi, jakich zna świat.\n","fr_FR":"Yu-Hung « Betty » Lu est le jeune carry AD prodige des Flash Wolves. Il a rejoint la formation l'année dernière, remplaçant NL. Anciennement connu sous le pseudo « DoubleRed » Betty a fait ses débuts aux IEM d'Oakland et a, par la suite, remporté son premier trophée lors des IEM World Championship de Katowice. \n\nIl a fait forte impression lors du segment de printemps 2017 de la région LMS, dominant tous les carrys AD avec un KDA de 8,8. Lors du championnat, il a fait des merveilles avec Ashe et Varus en réalisant une série de victoires combinées de 16-0 avec ces deux personnages. Sa résolution sera mise à l'épreuve lors du Mid-Season Invitational 2017, où il affrontera certains des meilleurs spécialistes au monde de la voie du bas.\n","es_ES":"Yu-Hung ''Betty'' Lu es el prodigioso novato ADC de Flash Wolves. Se unió al grupo al final del año pasado, para reemplazar al titular NL. Conocido anteriormente como ''DoubleRed'', hizo su debut en el IEM Oakland y no tardaría en conseguir su primer trofeo en el IEM World Championship de Katowice. \n\nSiguió sorprendiendo al público en el split de primavera de la LMS 2017, donde superó a todos los carries con un A/M/A de 8,8 puntos. Destacó con campeones como Ashe y Varus, con los que consiguió quedar 16-0. Ahora tendrá que demostrar su determinación en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores dúos de bot del mundo.\n","de_DE":"Yu-Hung „Betty“ Lu ist der AD-Carry der Flash Wolves und ein herausragender Nachwuchsspieler. Er stieß Ende des letzten Jahres als Ersatz für NL zur Mannschaft. Betty, früher bekannt als „DoubleRed“, gab sein Debüt beim IEM Oakland und gewann seinen ersten Titel bei der IEM-Weltmeisterschaft in Katowice. \n\nEr konnte auch im Frühjahrs-Split der LMS 2017 beeindrucken, wo er mit einer TTU von 8,8 der beste AD-Carry war. Dabei lieferte er vor allem mit Ashe und Varus überragende Leistungen ab, mit denen er zusammen 16 Spiele gewinnen konnte. Beim Mid-Season Invitational 2017 wird er seine Entschlossenheit unter Beweis stellen müssen, wenn er es auf der unteren Lane mit einigen der besten Duos der Welt zu tun bekommt.\n","pt_BR":"<p>Yu-Hung \"Betty\" Lu é o carregador novato de destaque da Flash Wolves. Ele entrou na equipe no final do ano passado, substituindo o antigo titular NL. Anteriormente era conhecido como \"DoubleRed\" e seu debut foi na IEM Oakland. Mais tarde, ele pegou seu primeiro troféu no Campeonato Mundial IEM, em Katowice. </p>\n\n<p>Ele continuou a impressionar na Etapa de Primavera LMS 2017, liderando todos os carregadores com uma AMA de 8,8. Ele foi excelente com a Ashe e o Varus, com 16-0 combinado na soma dos dois Campeões. Sua determinação será testada no Mid-Season Invitational 2017, onde ele enfrentará alguns dos melhores jogadores de rota inferior que o mundo tem a oferecer.</p>"},"foreignIds":{"TRTW":"200000015","TRLT3":"200000255","TRLH1":"200000437","TRLH2":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1849,"slug":"cyo","name":"Cyo","firstName":"Shi-Yo","lastName":"Lin","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-03-17T19:03:22.000Z","updatedAt":"2017-07-06T14:38:40.000Z","bios":{},"foreignIds":{"TRTW":"200000452","TRLT3":"200000204"},"socialNetworks":{},"champions":[],"liveGameTeam":91}],"scheduleItems":[{"id":"AVvpJRwXoUG4HPFjOKOy","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:282765fe-9898-41ec-aca3-31627a61cca5","scheduledTime":"2017-05-14T19:00:00.161+0000","tags":{"blockLabel":"5","blockPrefix":"day","subBlockLabel":"Sub Block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:ecc482a1-3d62-480d-8e84-b46e28317fa7","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"282765fe-9898-41ec-aca3-31627a61cca5","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"ecc482a1-3d62-480d-8e84-b46e28317fa7","league":"10"}],"gameIdMappings":[{"id":"ddfac9c1-a636-465b-a21d-3b71003a832c","gameHash":"530570051d84c333"}],"videos":[{"id":6867,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:ddfac9c1-a636-465b-a21d-3b71003a832c","source":"https://www.youtube.com/embed/RCu5nPxjnW0","createdAt":"2017-05-14T20:11:20.000Z","updatedAt":"2017-05-14T20:11:20.000Z","game":"ddfac9c1-a636-465b-a21d-3b71003a832c"},{"id":6871,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:ddfac9c1-a636-465b-a21d-3b71003a832c","source":"https://www.youtube.com/embed/lYYDDtUJ8iY?wmode=transparent","createdAt":"2017-05-14T21:13:11.000Z","updatedAt":"2017-05-14T21:13:11.000Z","game":"ddfac9c1-a636-465b-a21d-3b71003a832c"},{"id":6888,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:ddfac9c1-a636-465b-a21d-3b71003a832c","source":"https://www.youtube.com/watch?v=DFb2p5_LL7k&wmode=transparent","createdAt":"2017-05-15T14:03:03.000Z","updatedAt":"2017-05-15T14:03:03.000Z","game":"ddfac9c1-a636-465b-a21d-3b71003a832c"},{"id":6988,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:ddfac9c1-a636-465b-a21d-3b71003a832c","source":"https://www.youtube.com/embed/1hUBz_4Q-fo","createdAt":"2017-05-29T04:12:49.000Z","updatedAt":"2017-05-29T04:12:49.000Z","game":"ddfac9c1-a636-465b-a21d-3b71003a832c"}],"htmlBlocks":[],"match":{"id":"282765fe-9898-41ec-aca3-31627a61cca5","name":"TSM-vs-FW","position":12,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"},{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}],"games":{"ddfac9c1-a636-465b-a21d-3b71003a832c":{"id":"ddfac9c1-a636-465b-a21d-3b71003a832c","name":"G1","generatedName":"FW|TSM|G1|282765fe989841ecaca3","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"},{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}],"standings":{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1496031012730,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494857001334,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494792698202,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494792447066,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002180314","gameRealm":"TRLH1","platformId":"TRLH1:1002180314","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1496031012730,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494857001334,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494792698202,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"76f35ef2-4876-42d6-8287-de280206f3fc"}],[{"roster":"c12279fe-9491-46e5-831b-6f9ac853dba6"}]],"timestamp":1494792447066,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"76f35ef2-4876-42d6-8287-de280206f3fc":1,"c12279fe-9491-46e5-831b-6f9ac853dba6":0}}}