{"teams":[{"id":79,"slug":"invictus-gaming","name":"Invictus Gaming","guid":"be6dfd0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/invictus-gaming-cnnnfwdo.png","acronym":"IG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:30:22.000Z","bios":{"en_US":"","fr_FR":"Invictus Gaming piaffe devant la porte de la gloire depuis si longtemps que l'équipe paraît presque frappée d'une malédiction. Au cours des deux dernières années, ils sont arrivés quatre fois 3e aux finales régionales ou aux play-offs de printemps de la LPL. Cependant, avec l'aide de joueurs dynamiques comme KaKAO et RooKie, Invictus va peut-être enfin briser la malédiction et parvenir au sommet.","pl_PL":"Invictus Gaming przez tak długo znajdowało się na krawędzi osiągnięcia sukcesu, że można pomyśleć, że drużyna jest przeklęta. Zajęli 3. miejsce podczas wiosennych playoffów LPL / finałów regionalnych 4 razy w ciągu ostatnich dwóch lat. Jednakże dzięki dołączeniu tak utalentowanych graczy, jak KaKAO i Rookie być może Invictus wreszcie przełamie klątwę i wywalczy sobie drogę na szczyt tabeli.","de_DE":"Invictus Gaming schwebte lange Zeit an der Grenze zum Erfolg, sodass es schien, sie seien verflucht. In zwei Jahren brachten sie viermal den dritten Platz in den LPL Spring Playoffs/Regional Finals nach Hause. Aber vielleicht schafft es diesmal Invictus, mit den dynamischen Talenten wie KaKAO und RooKie, den Fluch zu durchbrechen und sich den ganz Großen anzuschließen.","es_ES":"Invictus Gaming se ha quedado tantas veces a la puertas de la gloria que casi parece que están gafados. Han quedado en tercera posición en los Playoffs de primavera de la LPL y en las finales regionales de China cuatro veces en los dos últimos años. Aunque con los fichajes de los coreanos KaKAO y RooKie, quizás Invictus va a romper la maldición definitivamente y a hacerse un hueco entre los mejores equipos del mundo.","pt_BR":"A Invictus Gaming se aproximou da consagração tantas vezes, que até parece um time amaldiçoado. Eles ficaram em terceiro lugar nas Regionais e Eliminatórias da LPL quatro vezes nos últimos dois anos. Talvez agora, com a chegada de pequenos monstros como KaKAO e RooKie, eles consigam quebrar a maldição e chegar entre os grandes do Mundial. \n"},"foreignIds":{"drupalId":"632"},"players":[122,519,522,1664,1871,1980,1981,1982],"starters":[122,519,522,1664,1871],"subs":[1980,1981,1982]},{"id":170,"slug":"energy-peace-maker","name":"Game Talents","guid":"be70e44c-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/energy-peace-maker-3k0bttlq.png","acronym":"GT","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-01-05T00:07:46.000Z","updatedAt":"2017-01-10T00:24:52.000Z","bios":{},"foreignIds":{},"players":[648,733,975,1005,1007,1037,1639,1640],"starters":[648,975,1005,1007,1037],"subs":[733,1639,1640]}],"players":[{"id":122,"slug":"duke","name":"Duke","firstName":"Hoseong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/duke-e8izehd9.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-06T23:30:15.000Z","bios":{"en_US":"","es_AR":"<p>Ho-seong \"Duke\" Lee ha sido parte de la escena coreana desde el 2013. Al comienzo, jugaba bajo el nombre de \"Leopard\", pero lo cambió a Duke luego de unirse a NaJin Black Sword. Después de la fusión con NaJin, Duke se convirtió en el carrilero superior inicial de NaJin e-mFire, grupo formado poco tiempo antes. Aunque los resultados del equipo fueron muy variados, Duke fue considerado uno de los mejores carrileros superiores de Corea. Luego de más resultados regulares, Duke dejó la organización NaJin a finales del 2015.</p>\n\n<p>Poco después de su partida de NaJin, SKTelecom sumó a Duke para que ocupe el lugar de uno de los mejores carrileros superiores en el 2015, MaRin, luego de que este se fuera a jugar a China. A pesar de que Duke y compañía tuvieron un mal arranque del 2016, encontraron el equilibrio y terminaron adjudicándose el trofeo del torneo de apertura de la LCK 2016. Incluso con la descalificación temprana de SKTelecom en las eliminatorias del torneo de clausura de la LCK 2016, sus esperanzas están puestas en lo más alto de todo: el Mundial. Con su reservada forma de ser, Duke jamás lo aceptaría, pero es uno de los carrileros superiores más emocionantes de Corea, ¡y no se llama Smeb! Valdrá mucho la pena seguirlo en el Mundial.</p>","fr_FR":"<p>Ho-seong « Duke » Lee est présent sur la scène coréenne depuis 2013. Il jouait alors sous le nom de « Leopard », mais il a changé son surnom pour devenir « Duke » après avoir rejoint NaJin Black Sword. Après la fusion de NaJin, Duke a pris la position de toplaner titulaire au sein de l'équipe nouvellement créée des NaJin e-mFire. Même si les résultats de cette nouvelle escouade ont été mitigés, Duke a été perçu comme l'un des meilleurs toplaners de Corée. Voyant que les résultats restaient peu convaincants, Duke a décidé de quitter l'organisation NaJin fin 2015.</p>\n\n<p>Peu après son départ de NaJin, SKTelecom s'est tournée vers Duke pour qu'il reprenne le flambeau de l'un des plus grands toplaners de 2015, MaRin, après son départ vers la Chine. Bien que Duke et ses nouveaux coéquipiers aient quelque peu lutté au début de l'année 2016, ils ont trouvé leurs marques au fil des semaines. C'est à l'approche de la fin du segment de printemps que Duke a finalement développé tout son talent : le timing parfait pour révéler tout son potentiel. Après avoir éliminé les ROX Tigers pour décrocher la couronne du tournoi Champions Spring 2016, Duke va enfin avoir la chance de remporter un deuxième trophée international depuis qu'il a rejoint SKTelecom. Avec sa nature réservée, Duke ne vous le dirait probablement jamais lui-même, mais il est l'un des toplaners les plus en vue de Corée. À votre place, on garderait un œil sur lui.</p>\n","de_DE":"<p>Ho-seong „Duke“ Lee ist bereits seit 2013 Teil der koreanischen Szene. Ursprünglich unter dem Namen „Leopard“ bekannt, wechselte er seinen Namen zu „Duke“, als er den NaJin Black Swords beitrat. Nachdem sich NaJin zusammenschloß, wurde Duke zu einem festen Mitglied als Top-Laner in der Startformation des neu geformten NaJin e-mFire-Teams. Obowohl die Ergebnisse des Teams eher gemischter Natur waren, wurde Duke stets als einer der besten Top-Laner Koreas bezeichnet und als sich die bescheidenden Resultate von NaJin fortsetzten, verließ er NaJin Ende 2015.</p>\n\n<p>Kurz nach seinem Abgang von NaJin wendete sich SKTelecom an Duke und bat ihn, in die Fußstapfen von MaRin, dem besten Top-Laner 2015, zu treten, der nach China gewechselt war. Obwohl Duke und seine Kameraden zu Beginn des Jahres Probleme hatten, fanden sie wieder in die Spur und gewannen den Frühjahrs-Split der LCK 2016. Trotz des frühen Ausscheidens von SKTelecom beim Sommer-Split der LCK 2016 sind die Erwartungen für die Weltmeisterschaft hoch. Duke ist zurückhaltend und würde so etwas nie selbst sagen, aber er ist neben Smeb einer der interessantesten Top-Laner in Korea. An deiner Stelle würde ich ihn bei der WM im Auge behalten.</p>","pl_PL":"<p>Ho-seong „Duke” Lee występuje na koreańskiej scenie od 2013 roku. Zaczynał grać pod ksywką „Leopard”, ale zmienił ją na „Duke” po dołączeniu do NaJin Black Sword. Po połączeniu NaJin, Duke został początkowym górnym w nowoutworzonym NaJin e-mFire. Mimo że wyniki drużyny były przeciętne, Duke był uznawany za jednego z najlepszych górnych w Korei, a po kolejnych podobnych rezultatach Duke opuścił organizację NaJin pod koniec 2015 roku.</p>\n\n<p>Wkrótce po tym SKTelecom odezwało się do Duke'a, aby zastąpił jednego z najlepszych górnych 2015 roku, MaRina, gdy ten odszedł, aby grać w Chinach. Mimo że Duke i reszta mieli problemy na początku 2016 roku, wraz z upływem czasu zaczęli radzić sobie coraz lepiej. Pod koniec wiosennego splitu Duke wreszcie się rozkręcił i to akurat w idealnym czasie. Po pokonaniu ROX Tigers podczas Champions Spring 2016, Duke ma teraz szansę na zdobycie drugiego międzynarodowego trofeum od kiedy dołączył do SKTelecom. Ze względu na swoją skromność, Duke nigdy by tego nie powiedział, ale jest jednym z najbardziej ekscytujących graczy z Korei. Na waszym miejscu obserwowalibyśmy go uważnie.</p>\n","es_ES":"<p>Ho-seong ''Duke'' Lee lleva siendo parte del panorama coreano desde 2013. Antes jugaba bajo el nombre de \"Leopard\", pero cuando llegó a NaJin Black Sword decidió cambiarse el nombre a Duke. Tras la fusión de equipos, Duke se convirtió en el top inicial de NaJin e-mFire. A pesar de que los resultados del equipo eran bastante mixtos, Duke fue considerado uno de los mejores top de Corea, y terminó dejando NaJin a finales de 2015.</p>\n\n<p>Tras dejar NaJin, SKTelecom le pidió a Duke que llenara el vacío que había dejado MaRin, uno de los mejores jugadores de la calle superior de 2015, que había abandonado el equipo para jugar en China. Aunque Duke y compañía lo pasaron mal a principios de 2016, recuperaron fuerzas y se llevaron el trofeo del split de primavera de la LCK 2016 a casa. Puede que SKTelecom tuviese que abandonar antes de lo previsto tras perder en los playoffs del split de verano de la LCK 2016, pero las esperanzas de ganar el Mundial siguen siendo altas. Al ser tan reservado, él nunca os lo diría, pero Duke es uno de los top más prometedores de Corea, aparte de Smeb. Os aconsejamos que sigáis su progreso en el Campeonato Mundial de cerca.</p>","pt_BR":"<p>Ho-seong “Duke” Lee tem participado do cenário coreano desde 2013. Jogando a princípio sob o nome de “Leopard”, ele mudou seu nome para “Duke” quando entrou para a NaJin Black Sword. Depois da união da NaJin, Duke se tornou o topo titular da recém-formada NaJin e-mFire. Apesar dos resultados da equipe terem sido inconsistentes, Duke era visto como um dos melhores topos da Coreia, mas depois de constantes resultados medianos, Duke decidiu sair da formação da NaJin no final de 2015.</p>\n\n<p>Logo depois de sua saída da NaJin, Duke foi chamado pela SK Telecom para substituir um dos melhores topos de 2015, MaRin, após sua saída para jogar na China. Apesar de Duke e seus companheiros terem sofrido um pouco no início de 2016, eles conseguiram encontrar sua sintonia e terminaram levando para casa o troféu da Etapa de Primavera da LCK 2016. Mesmo com a saída precoce da SKT nas eliminatórias da Etapa de Verão da LCK 2016, as esperanças ainda são altas para o Mundial. Tendo uma natureza reservada, Duke provavelmente nunca falaria isso, mas ele é um dos topos mais promissores da Coreia que não tem o nome de Smeb. Eu ficaria de olho nele no Mundial se fosse você.</p>"},"foreignIds":{"drupalId":"2811","TRKR1":"225039","TRLT3":"35084","TRLH1":"1001380052","TRLH2":"1001280022"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":519,"slug":"kid","name":"Kidkid","firstName":"Yan","lastName":"Ge","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kid-d4hufczg.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:24:40.000Z","bios":{"en_US":"","fr_FR":"<p>Ge « Kid » Yan est un incroyable carry AD. Il s'entraîne constamment pour s'améliorer et développer de meilleures synergies avec son partenaire de la voie du bas, Kitties. Et tout cet entraînement a fini par payer : ses performances régulières aux LPL lui a valu le surnom « d'ancre de stabilité ».</p>\n\n<p>À la différence de bon nombre de joueurs pro, Kid n'a pas perdu sa nonchalance en devenant une star, du moins pas en dehors de son rigoureux programme d'entraînement ! Mais quand l'entraînement prend fin, c'est un Kid très relax qu'on retrouve. Quand il est l'heure de s'amuser, il est prêt à se donner à fond.</p>","pl_PL":"<p>Ge „Kid” Yan to rzetelny prowadzący. Ciągle trenuje, starając się poprawić swoją formę i współpracę z partnerem z dołu, Kitties. Ćwiczenia opłaciły się – jego stabilna gra w LPL sprawiła, że zaczęto go nazywać „Ostoją stabilności”.</p>\n\n<p>W przeciwieństwie do innych zawodowców Kid nie przestał być wyluzowany, gdy stal się gwiazdą. Oczywiście nie dotyczy to jego rygorystycznych treningów. Jednak po treningu pojawia się na powrót zrelaksowany Kid. Kiedy przychodzi pora na zabawę, oddaje jej się bez reszty.</p>","de_DE":"<p>Ge “Kid” Yan ist ein Arbeitstier als AD Carry. Er trainiert konstant, um besser zu werden und arbeitet an seiner Synergie mit seinem Supporter, Kitties. Und die ganze Arbeit hat sich ausgezahlt, seine konstanten Leistungen in der LPL brachten ihm den Namen “The Anchor of Stability”.</p>\n\n<p>Im Gegensatz zu anderen Profis opferte er nicht sein entspanntes Wesen, um ein Star zu werden – zumindest nicht abseits seines harten Trainingsplanes! Aber wenn das Training vorbei ist, kommt das entspannte Kind zu Tage. Wenn die Zeit zum Spaß haben gekommen ist, ist er mittendrin dabei. </p>\n","es_ES":"<p>Ge “Kid” Yan es un trabajador por naturaleza. Este tirador se somete a duras sesiones de entrenamiento para que mejoren tanto él como jugador como la sinergia de la calle inferior con su compañero y support, Kitties. Y tanto entrenamiento ha dado sus frutos -- gracias a sus actuaciones consistentes en la LPL se ha ganado el apodo de “El Ancla de la Estabilidad”. </p>\n\n<p>A diferencia de muchos jugadores profesionales, Kid no ha sacrificado su actitud relajada y alegre para convertirse en una estrella -- ¡Al menos fuera de las sesiones de entrenamiento con su equipo! Cuando la práctica termina, descubrimos Kid relajado y bromista. Porque si es la hora de divertirse, ahí está él. </p>\n","pt_BR":"<p>Kid é um atirador incansável. Ele está sempre treinando para evoluir e ter uma sinergia melhor com seu parceiro de rota, Kitties. E tanta dedicação deu resultado -- com atuações consistentes na LPL, ele ganhou o apelido de \"Âncora da Estabilidade\".</p>\n<p>Ao contrário de vários jogadores, ele não sacrificou seu temperamento tranquilo para virar uma estrela -- pelo menos não fora do horário de treino. Quando o jogo acaba, surge o Kid tranquilão, pronto para se divertir.</p>"},"foreignIds":{"drupalId":"2064","TRLH4":"1001160033","TRLH3":"1001160033"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":522,"slug":"rookie","name":"Rookie","firstName":"Ui-jin","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rookie-3ohvy99s.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:27:32.000Z","bios":{"en_US":"","fr_FR":"<p>Eui-jin « RooKie » Song n'est qu'un nouveau venu aux LPL, mais ne vous laissez pas tromper par son pseudo (« le bleu » en anglais) : il a affronté bon nombre des meilleurs joueurs du monde. RooKie a été en première ligne du nouveau départ de KT Rolster en 2014, et le lien qu'il a développé avec son coéquipier jungler de KT, KaKAO, les a aidés à remporter plusieurs matchs des LCK.</p>\n\n<p>Lorsque KaKAO a décidé de participer aux LPL, RooKie a suivi le mouvement. Il a emporté avec lui son affinité pour les mages de contrôle, comme Azir et Orianna, ainsi qu'une tendance à utiliser des coups flamboyants pour remporter les parties. Si cette tendance a quelque peu reflué lors de sa première année aux LPL, RooKie a encore bon nombre de tours dans sa manche, notamment une excellente Cassiopeia.</p>","pl_PL":"<p>Eui-jin „RooKie” Song może i od niedawna gra w LPL, ale walczył już z najtrudniejszymi przeciwnikami na świecie. RooKie był główną siłą napędową KT Rolster w 2014 roku, a przyjaźń nawiązana z dżunglerem KaKAO pozwoliła wygrać wiele meczów w LCK.</p>\n\n<p>Kiedy KaKAO przeniósł się do LPL, RooKie zabrał się z nim. Zawsze lubił kontrolujących magów takich jak Azir czy Orianna i dalej ma tendencje do wygrywania popisowymi akcjami. Chociaż jego popisy nieco osłabły podczas pierwszego roku w LPL, RooKie wciąż ma kilka asów w rękawie, np. grę Cassiopeią.</p>","de_DE":"<p>Eui-jin “RooKie” Song mag zwar neu in der LPL sein, aber lass dich nicht von seinem Namen täuschen – er spielte schon gegen einige der besten Teams auf der Welt. RooKie war bei der Verjüngung von KT Rolster 2014 vorne mit dabei, und die Verbindung mit seinem Teamkameraden und Jungler von KT KaKAO trug dazu bei, viele Spiele in der LCK zu gewinnen. </p>\n\n<p>Als KaKAO in die LPL wechselte, zog RooKie nach. Er brachte eine Vorliebe für Kontrollmagier wie Azir und Orianna zu seinem neuen Arbeitsplatz mit und eine Tendenz zu riskanten Zügen, um Spiele zu gewinnen. Während sein Vertrauen auf riskante Spielzüge während seinem ersten Jahr in der LPL verblasste, packt er immer wieder ein Ass aus dem Ärmel – inklusive einer tödlichen Cassiopeia. </p>\n","es_ES":"<p>Puede que Eui-jin “RooKie” Song sea relativamente nuevo en la LPL, pero no dejes que su nombre te engañe -- ha jugado contra algunos de los rivales más fuertes del mundo. RooKie estuvo al frente en el proceso de renovación que sufrió KT Rolster durante 2014, y el lazo que desarrolló con su compañero en la jungla KaKAO ayudó a su equipo a ganar bastantes partidos en la LCK. </p>\n\n<p>Cuando KaKAO se fue a la LPL, RooKie hizo las maletas y se fue con él. En China, ha desarrollado una afinidad por magos que controlan a sus enemigos como Azir y Orianna, y una tendencia a depender de jugadas brillantes para ganar las partidas. Aunque durante su primer año en la LPL se ha vuelto más sobrio, RooKie sigue teniendo algún as en la manga -- incluída una Cassiopeia demoledora. </p>\n","pt_BR":"<p>RooKie pode ser novo na LPL, mas não se engane. Ele já jogou contra alguns dos melhores jogadores do mundo. Ele foi parte fundamental do rejuvenescimento da KT Rolster em 2014, e sua sinergia com o caçador KAKAO ajudou o time a vencer muitas particas na LCK.</p>\n<p>Quando KAKAO mudou-se da Coreia para a China, RooKie foi junto. Levou consigo o controle de magos como Azir e Orianna, criando uma tendência de jogadas exuberantes para vencer partidas. Apesar de essa exuberância ter perdido o encanto com o passar do tempo, ele ainda tem vários truques na manga -- incluindo uma Cassiopeia venenosa.</p>\n","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “RooKie” 송의진 선수가 LPL에 진출한 진 그리 오래되지 않았지만 아이디대로 신인인 건 아닙니다. 세계에서 가장 치열한 리그에서 뛴 적 있는 선수죠. RooKie 선수는 kt 롤스터가 2014년 팀을 재정비할 때 최전선에 섰고 같은 팀의 정글러 KaKAO 선수와 멋진 호흡으로 LCK에서 팀의 선전을 이끌었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">KaKAO 선수가 LPL로 이적할 때, RooKie 선수도 따라가면서 아지르나 오리아나 같은 장악형 마법사 플레이와 현란한 플레이로 승리하는 전략을 새 팀에 선사했죠. 비록 현란한 플레이에 의존하는 플레이는 LPL 진출 첫해를 보내며 사라졌지만 그 외에도 적을 떨게 하는 카시오페아 플레이처럼 여러 전술을 갖춘 선수입니다. </p>\n"},"foreignIds":{"drupalId":"2149","TRLH3":"1001160032","TRLH4":"1001160032","TRLH1":"1001180003","TRLH2":"1001140003"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":648,"slug":"republic","name":"Republic","firstName":"Bong-guen","lastName":"Tae","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/republic-bv5d49rz.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-02-22T23:30:37.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4371"},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":733,"slug":"soul","name":"Soul","firstName":"Hyun-seok","lastName":"Seo","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/soul-4edhtacv.png","hometown":null,"region":"LCK","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-04-21T18:43:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4341","ESPORTSTMNT06":"200000395"},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":975,"slug":"gimgoon","name":"GimGoon","firstName":"Han-saem","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gimgoon-cgshqp9e.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T21:11:40.000Z","updatedAt":"2017-02-22T23:29:34.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1005,"slug":"qpqtq","name":"PentaQ","firstName":"Xu","lastName":"Minshu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/qpqtq-byzcr2w.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:40:57.000Z","updatedAt":"2016-02-02T00:18:50.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1007,"slug":"savoki","name":"Savoki","firstName":"Jin","lastName":"Hao","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/savoki-di2hnl9b.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T21:39:36.000Z","updatedAt":"2017-02-22T23:33:45.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1037,"slug":"wushuang","name":"Wushuang","firstName":"Wang","lastName":"Haili","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wushuang-7y94capi.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:07:41.000Z","updatedAt":"2017-02-22T23:36:27.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1639,"slug":"xiaoyu","name":"Xiaoyu","firstName":"Jian","lastName":"Liang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaoyu-51er3pge.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-01-09T20:30:46.000Z","updatedAt":"2017-02-22T23:37:17.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1640,"slug":"xubin","name":"Xubin","firstName":"Qingbin","lastName":"Xu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xubin-a80msutw.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T20:37:11.000Z","updatedAt":"2017-02-22T23:37:41.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":170},{"id":1664,"slug":"megan","name":"Megan","firstName":"Liu-Yi","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/megan-900drhog.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:38:18.000Z","updatedAt":"2017-06-06T23:28:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1871,"slug":"ning","name":"Ning","firstName":"Zhen-Ning","lastName":"Gao","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T18:39:15.000Z","updatedAt":"2017-04-16T18:39:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1980,"slug":"west","name":"West","firstName":"Long","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:18:02.000Z","updatedAt":"2017-06-06T23:18:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1981,"slug":"theshy","name":"TheShy","firstName":"Seung-Lok","lastName":"Kang","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:24:15.000Z","updatedAt":"2017-06-06T23:24:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1982,"slug":"rio","name":"Rio","firstName":"Fu-Hua","lastName":"Wen","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:28:00.000Z","updatedAt":"2017-06-06T23:28:00.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79}],"scheduleItems":[{"id":"AVIaBImHJTrHluSI14K6","content":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:match:29c05528-a90b-49d4-9fdd-2eb15ed8f758","scheduledTime":"2016-02-26T09:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","blockLabel":"5","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0e89b83d-4b66-46dd-89d3-c9cb6246d9f3:bracket:77bd0264-3856-4643-a3f6-ecd2fe66de30"},"match":"29c05528-a90b-49d4-9fdd-2eb15ed8f758","tournament":"0e89b83d-4b66-46dd-89d3-c9cb6246d9f3","bracket":"77bd0264-3856-4643-a3f6-ecd2fe66de30","league":"7"}],"gameIdMappings":[],"videos":[],"htmlBlocks":[],"match":{"id":"29c05528-a90b-49d4-9fdd-2eb15ed8f758","name":"IG-vs-EPA","position":21,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"},{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}],"games":{"2f9845c3-f27c-4785-99ea-0ee1e68b9e8a":{"id":"2f9845c3-f27c-4785-99ea-0ee1e68b9e8a","name":"G1","generatedName":"EPA|IG|G1|29c05528a90b49d49fdd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"},{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}],"standings":{"result":[[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"}],[{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}]],"timestamp":1456498482693,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0d61c2b3-7140-4a24-9d8d-b5d29d6daf64":{"id":"0d61c2b3-7140-4a24-9d8d-b5d29d6daf64","name":"G2","generatedName":"EPA|IG|G2|29c05528a90b49d49fdd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"},{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"}],"standings":{"result":[[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"}],[{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}]],"timestamp":1456498511825,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d9a0736e-5c87-4c50-b569-40207313a9c7":{"id":"d9a0736e-5c87-4c50-b569-40207313a9c7","name":"G3","generatedName":"EPA|IG|G3|29c05528a90b49d49fdd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"},{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"caf1d9ea-8d33-41c1-82ef-5da53a694c0b"}],[{"roster":"7fa786d9-2933-4d88-b1eb-75d2280c3d26"}]],"timestamp":1456498511825,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}