{"teams":[{"id":76,"slug":"lgd-gaming","name":"LGD Gaming","guid":"be6df3df-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-5n0d69lg.png","acronym":"LGD","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-if86jc4q.png","createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:34:16.000Z","bios":{"en_US":"","fr_FR":"Pendant des années, LGD est restée coincée au milieu du classement des LPL. En dépit de quelques succès dans des tournois mineurs, ces joueurs n'ont pas menacé la domination d'EDG et de SHRC dans l'e-sport chinois. Puis LGD a décidé que ça suffisait comme ça. Elle a reconstruit l'équipe avec des joueurs coréens aguerris (imp, Flame et Acorn) à la fin de 2014. Les résultats parlent d'eux-mêmes : 1re place lors des play-offs d'été au LPL 2015.","pl_PL":"Od lat LGD znajduje się pośrodku tabeli LPL. Pomimo sukcesów w mniejszych turniejach nawet nie zbliżyło się do sukcesów EDG i SHRC w chińskim E-sporcie. I wtedy właśnie LGD stwierdziło, że starczy tego dobrego. Do swojego składu wcielili niezwykle utalentowanych Koreańczyków – impa, Flame'a i Acorna – pod koniec 2014 roku. Wyniki mówią same za siebie – 1. miejsce w letnich playoffach LPL 2015.","de_DE":"Seit Jahren steckte LGD in der Mitte der LPL-Tabelle fest. Trotz einigen Erfolgen bei kleineren Turnieren, schafften sie es nicht, die Dominanz von EDG oder SHRC zu beenden. Doch damit sollte nun ein für alle Mal Schluss sein. Sie verbesserten ihr Team mit den bekannten koreanischen Talenten imp, Flame und Acorn im Sommer 2014. Die Ergebnisse sprechen für sich - erster Platz der LPL Sommersaison in diesem Jahr.","es_ES":"LGD se pasó varios años estancado en centro de la tabla de la LPL. A pesar de obtener algunos éxitos en torneos menores, apenas alcanzó a mellar el férreo dominio que ejercían EDG o SHRC sobre los deportes electrónicos en China. Hasta que decidieron que ya estaba bien. A finales de 2014 reconstruyeron la plantilla con talentos coreanos de primera categoría, como Imp, Flame o Acorn. Los resultados hablan por sí mismos: Primer puesto de las eliminatorias de verano de la LPL 2015.","pt_BR":"A LGD passou anos vivendo na parte do meio da tabela LPL. Apesar de vitórias em alguns torneios menores, eles estavam longe de ameaçar a EDG ou a Royal Club no cenário chinês. Mas então eles deram um basta. Reconstruíram o time no final de 2014 com grandes astros coreanos: imp, Flame e Acorn. Os resultados falam por sisó -- campeões das eliminatórias de verão da LPL 2015.\n"},"foreignIds":{"drupalId":"1850"},"players":[56,67,541,589,605,998,1431],"starters":[67,541,589,605,998],"subs":[56,1431]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":56,"slug":"cool","name":"Cool","firstName":"Jia-Jun","lastName":"Yu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/cool-esrj8abc.png","hometown":"Yiyang, China","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:14.000Z","updatedAt":"2017-06-06T23:29:21.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"698","TRLH1":"1000185041","TRLH3":"1000105048"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":67,"slug":"imp","name":"imp","firstName":"Seung-bin","lastName":"Gu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/imp-5lcuchzd.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:27.000Z","updatedAt":"2016-02-01T22:57:45.000Z","bios":{"en_US":"<p>Seung-bin “imp” Gu is notorious for his former rivalry with Gwang-jin “Piglet” Chae and his unabashed trash talk. But imp is more than just talk, and his recent results speak for themselves. Imp started his career on Samsung White (formerly MVP Ozone), a team that would eventually be one of the greatest of all time. Imp played a key role in their dominant performance -- and 1st place finish -- at the 2014 World Championship.</p>\n\n<p>In the wake of his move to LGD, imp matured. When naysayers said he would fail without his world-class support partner Mata, he proved them wrong. When his interviewers expected trash talk and arrogance, imp displayed humility and courteous manners. But there’s still a monster hiding beneath imp’s newfound modesty. The fact is, imp is very good at League of Legends, and he knows it.</p>","fr_FR":"<p>Seung-bin « imp » Gu est célèbre pour son ancienne rivalité avec Gwang-jin « Piglet » Chae et pour sa gouaille insolente. Mais imp n'est pas celui qui parle le plus : ses récents résultats sont plus éloquents encore que lui. Imp a commencé sa carrière chez Samsung White (anciennement MVP Ozone), une équipe qui allait compter parmi les meilleures de tous les temps. Imp a joué un rôle clé dans ses performances spectaculaires (et sa première place) aux Championnats du monde 2014.</p>\n\n<p>À la suite de son arrivée chez LGD, imp est devenu plus mûr. Quand les mauvaises langues ont prédit qu'il allait forcément échouer sans l'aide de son exceptionnel support, Mata, il leur a prouvé le contraire. Alors que ses interlocuteurs s'attendaient à le voir arrogant et désagréable, imp s'est montré humble et courtois. Mais cela ne veut pas dire qu'il n'y a pas un monstre qui dort derrière la nouvelle modestie dont fait preuve imp. De fait, imp est un excellent joueur de League of Legends et il le sait. Après tout, il est le premier des cinq anciens membres de Samsung White à s'être assuré une place aux Championnats du monde 2015. </p>","pl_PL":"<p>Seung-bin „imp” Gu okrył się złą sławą przez swą niegdysiejszą rywalizację z Gwang-jinem „Pigletem” Chae, a także bezwstydną krytykę innych zawodników. Imp nie jest jednak mocny wyłącznie w gębie, a jego niedawne rezultaty mówią same za siebie. Imp rozpoczął karierę jako zawodnik Samsung White (dawniej MVP Ozone) – drużyna ta przeszła do historii jako jedna z najlepszych. Rola impa w zajęciu przez drużynę pierwszego miejsca podczas mistrzostw świata 2014 była kluczowa.</p>\n\n<p>Po dołączeniu do LGD imp bardzo dojrzał jako gracz. Udowodnił malkontentom mówiącym, że nie poradzi sobie bez światowej klasy zawodnika wsparcia, Maty, jak bardzo się mylą. Ilekroć prowadzący wywiad oczekiwali przechwałek i arogancji, imp wykazywał się grzecznością i pokorą. Pod przykrywką skromności wciąż jednak drzemie w nim bestia. Prawda jest taka, że imp jest świetnym graczem w League of Legends i doskonale zdaje sobie z tego sprawę. Bądź co bądź jako pierwszy spośród pięciu zawodników Samsung White zdołał zająć pierwsze miejsce w mistrzostwach świata 2015. </p>","de_DE":"<p>Seung-bin “imp” Gu ist berühmt berüchtigt wegen seiner früheren Rivalität mit Gwang-jin “Piglet” Chae und ihren unerreichten Provokationen. Aber imp ist mittlerweile mehr als nur heiße Luft, was seine letzten Erfolge unter Beweis stellen. Imp begann seine Karriere bei Samsung White (früher MVP Ozone), einem Team das eventuell eines der besten der Welt für alle Zeit werden kann. Imp spielte eine Schlüsselrolle bei ihren dominanten Auftritten- und beendete die Weltmeisterschaft mit dem Titel. </p>\n\n<p>Durch seinen Wechsel zu LGD reifte imp. Die Pessimisten, die Imp´s Zukunft ohne seinen früheren Supporter Mata zum Scheitern verurteilten, überzeugte er deutlich. Wenn Reporter auf Provokation und Arroganz warteten, zeigte er Menschlichkeit und gutes Benehmen. Aber hinter seinem neugefundenen Anstand ist immer noch der frühere imp versteckt. Denn imp ist verdammt gut in League of Legends und genau das weiß er auch. Nach all dem war er der Erste von seinen früheren Mitspielern von Samsung White, der sich seinen Platz bei Worlds 2015 sicherte. </p>\n","es_ES":"Seung-bin ''Imp'' Gu es famoso tanto por su feroz rivalidad con Gwang-jin ''Piglet'' Chae como por una extraordinaria capacidad de meter la pata al hablar. Pero al margen de comentarios desafortunados, sus actuaciones de los últimos tiempos son aún más elocuentes. Comenzó su carrera en Samsung White (el antiguo MVP Ozone), un equipo que terminaría por convertirse en el mejor de la historia. De hecho, Imp desempeñó un papel fundamental en la exhibición realizada en el Campeonato Mundial de 2014 (y en la victoria que le puso la guinda).\n\nTras su paso a LGD, Imp ha madurado. Cuando algunos agoreros aseguraron que se vendría abajo sin su compañero, el fabuloso apoyo Mata, Imp demostró que se equivocaban. Y cuando toda la prensa esperaba que exhibiera su habitual arrogancia, respondió con una humildad y una educación impropias de él. Pero debajo de esta nueva prudencia se esconde todavía una bestia. El hecho es que Imp es un grandísimo jugador de League of Legends y lo sabe. A fin de cuentas, ha sido el primero de los cinco antiguos integrantes de Samsung White en asegurarse una plaza en el Campeonato Mundial de 2015. \n","pt_BR":"<p>Seung-bin “imp” Gu é famoso por sua antiga rivalidade com Gwang-jin “Piglet” Chae e todas as provovações que a seguiram. Mas imp é mais do que apenas conversa fiada, e seu histórico recente prova isso. Ele começou sua carreira na Samsung White (antes conhecida como MVP Ozone), uma equipe que eventualmente entraria na história como uma das melhores de todos os tempos. Imp foi uma peça chave na atuação dominante - e o primeiro lugar - no Campeonato Mundial de 2014.</p>\n\n<p>Entre todas as conversas durante sua mudança para a LGD, Imp amadureceu. Quando críticos disseram que sem Mata como suporte ele iria falhar, ele provou o contrário. Quando seus entrevistadores esperavam arrogância e provocações, Imp foi cordial e humilde. Mas ainda há um monstro por trás de sua nova modéstia. O fato é: Imp é muito bom em League of Legends. E ele sabe. Afinal, ele foi o primeiro dos cinco ex-integrantes da Samsung White a assegurar sua vaga no Campeonato Mundial 2015.</p>"},"foreignIds":{"drupalId":"681","TRLH3":"1001160026","TRLH1":"1001180006","TRLH4":"1001160026","TRLH2":"1001140006"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":541,"slug":"eimy","name":"Eimy","firstName":"Dan","lastName":"Xie","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/eimy-fmyi9due.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:36:23.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4513"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":589,"slug":"pyl","name":"Pyl","firstName":"Bo","lastName":"Chen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pyl-ahtd159j.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:30:25.000Z","bios":{"en_US":"<p>\nBo “Pyl” Chen is one of the best supports in the LPL, with much of his strength coming from the diverse champion pool he brings to the bot lane and his dynamic shot-calling. He’s no slouch on his mechanics either; His Thresh is a must-ban, his Alistar tramples the competition, and his Janna always finds the right position to blow away the opposition. But as the captain of LGD, his ability to call out rotations and map objective prioritization truly set him apart. Pyl is the glue that holds LGD together.\n</p>","fr_FR":"<p>\nChen « Pyl » Bo est l'un des meilleurs supports des LPL, et l'une de ses principales forces, c'est la variété de champions qu'il peut faire intervenir sur la voie du bas et sa capacité à donner des ordres en s'adaptant à la situation. Il est également loin d'être manchot en ce qui concerne les compétences techniques : son Thresh est à bannir absolument, son Alistar écrabouille l'adversaire et sa Janna est toujours au bon endroit au bon moment pour souffler l'ennemi. Mais en tant que capitaine de LGD, c'est surtout sa capacité à donner des ordres et à définir les priorités pour les objectifs de la carte qui font la différence. Pyl est le ciment qui fait tenir LGD ensemble. Il devrait continuer dans cette optique lorsqu'il accueillera ses amis des LPL à l'événement All-Star 2015 avec son fameux sourire.\n</p>","pl_PL":"<p>\nChen „Pyl“ Bo gehört zu den besten Supportern in der LPL, und ein großer Teil seiner Stärke beruht auf seinem breitgefächerten Championpool, den er in die untere Lane mitbringt, und auf seinem dynamischen Shot-Calling. Doch auch seine Mechaniken können sich sehen lassen. Seinen Thresh zu bannen ist Pflicht, sein Alistar zertrampelt seine Rivalen und seine Janna findet immer die richtige Position, um den Gegner auszuschalten. Was ihn jedoch als Teamleiter wirklich ausmacht, ist seine Fähigkeit, Wechsel anzuordnen und bei den Kartenzielen Prioritäten zu setzen. Pyl ist der Leim, der LGD zusammenhält. Dies werden wir auch beim All-Star-Event 2015 erleben, wenn er die anderen Stars der LPL mit seinem berühmten Lächeln begrüßt.\n</p>","de_DE":"<p>Chen “Pyl” Bo ist einer der besten Supporter in der LPL, was vor allem von seinem großen Championpool für die Bot-Lane und seinem dynamischen Shotcalling herrührt. Aber auch seine Mechaniken sind nicht die schlechtesten; sein Thresh ist ein Must-Ban, sein Alistar trampelt die Spiele nieder und seine Janna findet immer die richtige Position, um die Gegner wegzuwehen. Zudem hebt ihn seine Fähigkeit als Kapitän das Team über die Karte zu navigieren und sein Fokus auf Objekte hervor. Pyl ist der Kleber, der LGD zusammenhält. </p>\n\n<p>Tatsächlich sind seine Fähigkeiten so begehrt, dass sich selbst Seung-bin “imp” Gu für LGD entschieden hat, nur um mit Pyl zusammenspielen zu können. Während er vorher seine Bot-Lane-Partner übertroffen hat, fand er mit Imp einen Partner, der jeden seiner Züge mitgehen kann. </p>\n","es_ES":"<p>\nChen ''Pyl'' Bo es uno de los mejores apoyos de la LPL, gracias a la diversidad del arsenal de campeones que puede usar en la calle inferior y a su dinamismo a la hora de marcar jugadas. Y por mecánicas tampoco es manco: Aunque los rivales bloqueen a su Thresh (como suelen hacer), es perfectamente capaz de pisotearlos con Alistar y siempre encuentra el modo de hacerlos volar por los aires con Janna. Como capitán de LGD, su habilidad para organizar las rotaciones y priorizar los objetivos lo convierte en único. Pyl es el pegamento que mantiene unido a LGD. Y seguirá siéndolo en el All-Star 2015, cuando luzca su ya famosa sonrisa para dar la bienvenida a otras estrellas de la LPL.\n</p>","pt_BR":"<p>Chen “Pyl” Bo é um dos melhores suportes na LPL, com muito de sua força vindo de um vasto leque de Campeões aliado à sua dinâmica de chamadas de equipe. Ele não é fraco em mecânicas também; seu Thresh é um banimento quase permanente, seu Alistar atropela as rotas, e sua Janna sempre sabe o lado certo para jogar os furacões. Mas como capitão da LGD, sua habilidade de chamar rotações, posicionar a equipe para objetivos e pressão pelo mapa é o que o diferencia. Pyl é a cola que segura a LGD junta.</p>\n\n<p>De fato, as habilidades de Pyl são tão aclamadas que Seung-bin “imp” Gu escolheu propositalmente a LGD somente para jogar com o suporte. Se antes ele brilhava mais do que seus parceiros de rota, quando Imp entrou na equipe, Pyl encontrou um companheiro de equipe que pudesse ser o seu par perfeito.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Chen “Pyl” Bo 선수는 LPL 최고의 서포터로 꼽힙니다. 넓은 챔피언 폭과 적극적인 지휘에서 그 저력이 나오는 선수입니다. 게다가 피지컬까지 뛰어납니다. 항상 쓰레쉬를 밴당하고 알리스타를 플레이할 땐 상대를 짓뭉개버리죠. 잔나를 잡으면 항상 정확한 위치 선정으로 상대를 날려버립니다. 그리고 LGD의 주장으로서 맵 상의 주요 목표물을 노릴 시기나 어떤 목표물을 먼저 노릴지 정하는 능력이 아주 뛰어납니다. Pyl 선수는 LGD를 하나로 묶는 구심점이기도 합니다. 이번 올스타 대회에서 다른 LPL 올스타를 만났을 때도 특유의 미소로 반기며 팀을 끈끈하게 만들어 주리라 기대해 봅니다. </p>"},"foreignIds":{"drupalId":"2069","TRLH3":"1001160027","TRLH4":"1001160027","TRLH1":"1001180005","TRLH2":"1001140005"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":605,"slug":"godv","name":"GodV","firstName":"Zhen","lastName":"Wei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/godv-awtbwftn.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:35:21.000Z","bios":{"en_US":"","fr_FR":"<p>Wei « We1less » Zhen, précédemment connu sous le nom de GODV, a placé la barre très haut lorsqu'il a choisi son premier surnom. Mais, sachant que We1less est devenu l'un des mid laners les plus réputés des LPL, il savait peut-être exactement ce qu'il faisait. Sa carrière n'a pas été de tout repos, mais on dirait que We1less est enfin sur le point d'arriver à ses fins.</p>\n\n<p>À l'origine, We1less était meneur de jeu chez Vici Gaming. Il jouait de façon égoïste et, s'il voyait une opportunité de plonger dans le combat, il n'hésitait pas une seule seconde. Évidemment, cette stratégie ne portait pas forcément ses fruits, que ce soit pour lui ou pour son équipe. Cependant, avec le temps, We1less est devenu plus réfléchi et a développé son esprit d'équipe. C'est un joueur dynamique qui réfléchit toujours à ce qu'il pourrait apporter à son équipe plutôt que le contraire.</p>\n\n<p>Même si We1less a eu du mal à rejoindre la Faille en 2016 à cause d'une blessure persistante, il a pu prouver son énorme potentiel de jeu à la toute fin du segment d'été. Enregistrant des scores hallucinants, We1less nous a montré à quel point son niveau était élevé. Ses éclairs de génie ont ébloui les fans, qui l'ont choisi pour participer à l'événement All-Stars 2016 de Barcelone. Il déborde de talent et, à en croire ses dernières performances, ses sorts risquent d'être précoces et nombreux. </p>","pl_PL":"Wei „We1less” Zhen, dawniej znany jako GODV, całkiem wysoko ustawił sobie poprzeczkę, wybierając swoje stare przezwisko. Jednak biorąc pod uwagę, że We1less został okrzyknięty jednym z najlepszych środkowych w LPL, może dokładnie wiedział, co robi. Jego podróż była trudna, ale wydaje się, że We1less nareszcie dociera do celu.</p>\n\nDawno, dawno temu We1less był rozgrywającym w Vici Gaming. Grał egoistycznie i gdy tylko dostrzegał okazję do ataku, zazwyczaj z niej korzystał. Oczywiście taka strategia nie zawsze kończyła się dobrze dla niego lub jego drużyny. Teraz jednak We1less jest rozważniejszy i bardziej zorientowany na drużynę. To dynamiczny zawodnik, który zawsze myśli o tym, jak może zapewnić korzyści swojej drużynie (a nie odwrotnie).</p>\n\nChociaż We1less miał problemy z grą na Summoner’s Rift w 2016 roku z powodu uporczywej kontuzji, pod sam koniec letniego splitu zaprezentował swój pełny potencjał jako zawodnik. Zdobywając naprawdę niesamowite wyniki punktowe, We1less pokazał nam, że ustawił sobie poprzeczkę naprawdę wysoko. Jego przebłyski geniuszu oszołomiły fanów, którzy zagłosowali na niego i wysłali na wydarzenie All-Star 2016 w Barcelonie. Ma ogromy potencjał i jeśli można robić założenia w oparciu o jego wcześniejsze występy, to czary We1lessa na turnieju będą latały szybko i często. \n","de_DE":"<p>Wei „We1less“ Zhen, ehemals bekannt als GODV, legte die Latte für sich selbst ziemlich hoch, als er sich für seinen alten Namen entschied. Aber wenn man bedenkt, dass We1less zu einem der am meisten gelobten Mid-Laner der LPL wurde, dann könnte man meinen, er wusste damals ganz genau, was er tat. Sein Weg war steinig, aber es scheint, als wäre We1less endlich angekommen.</p>\n\n<p>Vor langer Zeit war We1less der Spielmacher von Vici Gaming. Er war ein egoistischer Spieler, der so gut wie jede Gelegenheit nutzt, einen Gegner bis zum Schluss zu verfolgen. Natürlich endete diese Strategie nicht immer gut für ihn oder seine Mannschaft. Heute spielt We1less jedoch wesentlich berechnender und teamorientierter. Er ist ein dynamischer Spieler, der immer darüber nachdenkt, wie er seiner Mannschaft helfen kann.</p>\n\n<p>Und obwohl We1less 2016 mit einer hartnäckigen Verletzung zu kämpfen hatte, war sein Potenzial gegen Ende des Sommer-Splits klar zu erkennen. We1less lieferte ein paar unglaubliche Ergebnisse ab und zeigte uns, wie gut er wirklich sein kann. Er ließ immer wieder seine Klasse aufblitzen und begeisterte damit die Fans, die ihn beim All-Stars-Event 2016 in Barcelona sehen wollen. Er steckt voller Potenzial, und wenn man an seine vergangenen Leistungen denkt, ist davon auszugehen, dass er schnell mit viel Zaubern um sich schleudern wird.</p>","es_ES":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores de la calle central más codiciados de la LPL, puede que supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del split de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes.</p>","pt_BR":"<p>Wei “We1less” Zhen, antes conhecido como GODV, subiu bastante o patamar quando escolheu seu antigo apelido. Porém, considerando que We1less se tornou um dos jogadores de meio mais prolíficos da LPL, é provável que ele soubesse direitinho o que estava fazendo. Sua jornada foi difícil, mas parece que We1less finalmente está para chegar.\n\nUm dia, We1less foi um criador de jogadas na Vici Gaming. Ele jogava de forma egoísta e, se tivesse a oportunidade de mergulhar, ele normalmente o fazia. Obviamente, essa estratégia nem sempre dava certo, tanto para ele, quanto para sua equipe. Agora, We1less é mais calculado e pensa mais na equipe. Ele é um jogador dinâmico, sempre pensando em como ele pode beneficiar sua equipe, em vez do contrário.</p>\n\n<p>Apesar de We1less ter tido problemas entrando em Summoner’s Rift em 2016 com uma lesão, seu grande potencial de jogo estava à mostra no fim da Etapa de Verão. Ostentando alguns placares ridiculamente bons, We1less nos mostrou quão alto pode chegar. Seu desempenho incrível deixou uma boa impressão nos fãs que deixaram claro que o queriam no Evento All-Star 2016 em Barcelona. Ele está repleto de potencial para grandes jogadas e, se seus desempenhos anteriores são qualquer indicador, vai ter muito feitiço voando pelo mapa. </p>","cs_CZ":"<p>Wei „We1less“ Zhen, dříve známý jako GODV, si při výběru své předchozí přezdívky nasadil laťku pěkně vysoko. Ale jelikož se z něj stal jeden z nejsledovanějších středových lajnařů v LPL, možná věděl, co dělá. Jeho cesta na výsluní byla trnitá, ovšem zdá se, že konečně nese svoje ovoce.</p>\n\n<p>We1less býval kapitánem Vici Gaming. Hrával sobecky, a když se mu naskytla příležitost vrhnout se po hlavě do boje, jen málokdy jí odolal. Tato strategie samozřejmě pro něj i jeho tým nekončila pokaždé dobře. Nyní je We1less prozíravější a víc myslí na své spolubojovníky. Hraje dynamicky a neustále přemýšlí, čím by mohl svému týmu prospět on, ne naopak.</p>\n\n<p>A ačkoliv se kvůli nepříjemnému zranění podíval We1less do Žlebu v roce 2016 jen málokdy, na konci letního splitu bylo jeho řádění na bojišti hodně znát. Jeho statistiky poskočily do závratných výšin a ukázal nám, co můžeme očekávat od skutečně hvězdného hráče. Fanoušky tyto záblesky dokonalosti náležitě okouzlily, takže jej v hlasování vyslali na turnaj All-Star 2016. Dokáže provádět naprosto úchvatné akce a z jeho předchozích výkonů lze soudit, že i v Barceloně budou kouzla létat často a již krátce po zahájení utkání. </p>","el_GR":"<p>Ο Wei “We1less” Zhen, γνωστός στο παρελθόν ως GODV, ανέβασε μόνος του ψηλά τον πήχη με το όνομα που διάλεξε τότε. Από την άλλη πλευρά, ο We1less έχει γίνει ένας από τους πιο διάσημους παίκτες μεσαίας λωρίδας στο LPL, επομένως ίσως και να μην το έκανε κατά τύχη. Η διαδρομή του ήταν πολύ δύσκολη, αλλά όλα δείχνουν ότι ο We1less κοντεύει να φτάσει στον προορισμό του.</p>\n\n<p>Μια φορά κι έναν καιρό, ο We1less ήταν ο οργανωτής των Vici Gaming. Έπαιζε με πολύ εγωιστικό τρόπο και, όταν έβλεπε μια ευκαιρία να χωθεί στη δράση, ποτέ δεν την άφηνε να πάει χαμένη. Προφανώς, αυτή η στρατηγική δεν είχε πάντα καλή κατάληξη για αυτόν και για την ομάδα του. Τώρα, όμως, ο We1less παίζει πολύ πιο ομαδικά και στρατηγικά. Είναι ένας ευέλικτος παίκτης που σκέφτεται πάντα πώς μπορεί να βοηθήσει την ομάδα του και όχι πώς μπορεί να βοηθήσει αυτόν η ομάδα.</p>\n\n<p>Παρόλο που ο We1less δυσκολεύτηκε αρκετά να βρει το ρυθμό του στο 2016 λόγω ενός πολύ επίμονου τραυματισμού, έδειξε πολύ καλά τι μπορεί να κάνει στο τέλος του Summer Split. Σε μια σειρά αγώνων όπου πέτυχε εξωπραγματικές επιδόσεις, ο We1less έδειξε σε όλους πόσο ψηλά μπορεί να φτάσει. Αυτές οι θεαματικές του εκλάμψεις γοήτευσαν το κοινό που τον έστειλε στο Τουρνουά All-Star 2016. Είναι πάντα έτοιμος για μια μεγάλη κίνηση και, αν κρίνουμε από τις προηγούμενες εμφανίσεις του, θα δούμε πολλά ξόρκια στο παιχνίδι, συχνά και από νωρίς. </p>","hu_HU":"<p>Wei „We1less” Zhen, korábbi nevén GODV, elég magasra tette a lécet a korábbi neve megválasztásával. De mivel We1less lett az LPL egyik legfelkapottabb középső ösvényese, valószínűleg már akkor is tudta, hogy mi a dörgés. Nem volt egyszerű az út, de úgy tűnik, hogy We1less révbe érhet.</p>\n\n<p>We1less régebben a Vici Gaming irányítója volt. Önzően játszott, és ha meglátott egy lehetőséget, azonnal lecsapott rá. Ez a „stratégia” nyilván nem mindig volt előnyös a csapata számára. Mára We1less sokkal számítóbb és csapatközpontúbb lett. Dinamikus játékos, aki mindig azt nézi, hogyan segítheti a csapatát, és nem fordítva.</p>\n\nWe1less nehezen tudott belevágni a 2016-os évbe egy zavaró sérülés miatt, de a nyári szakasz végén ismét megcsillogtatta játéktudását. We1less elképesztő statisztikákat produkált, jelezve, hogy a határ számára a csillagos ég. Ezek a felvillanások is meggyőzték a rajongókat, hogy ott a helye a 2016-os All-Star gálán Barcelonában. Mindig ott van benne egy látványos akció esélye, és ha a korábbiak alapján kellene tippelni, akkor hamar el fog szabadulni a pokol a Szurdokban. \n","it_IT":"<p>Wei \"We1less\" Zhen, già noto come GODZ, ha scelto per se stesso un nome pieno di aspettative. E a quanto pare sapeva cosa stava facendo, visto che è riuscito a diventare uno dei centrali più apprezzati della LPL. Il suo viaggio non è stato dei più semplici, ma a quanto pare sta per arrivare alla sua meta.</p>\n\nIn passato We1less ha fatto il regista in Vici Gaming. Il suo stile era molto egoistico e sfruttava ogni occasione per tuffarsi all'attacco. Ovviamente, quella strategia non funzionava sempre. Ora però We1less è diventato più riflessivo e aperto al gioco di squadra. È un giocatore dinamico, sempre intento a pensare a come aiutare il proprio team, invece che usare il supporto della squadra a suo beneficio.</p>\n\nPur avendo avuto difficoltà ad affacciarsi sulla Landa nel 2016 a causa di un infortunio, il suo grande potenziale è stato sotto gli occhi di tutti verso la fine del Summer Split. Con le sue cifre da capogiro, We1less ci ha dimostrato di non avere limiti. Le sue brillanti giocate hanno abbagliato i fan, che hanno votato per la sua presenza all'All-Star 2016 di Barcellona. We1less ha un potenziale incredibile, e a giudicare dalle sue prestazioni passate vedremo qualcosa di straordinario. \n","ro_RO":"Wei ''We1less'' Zhen, cunoscut în trecut ca GODV, și-a stabilit un standard destul de înalt când și-a ales vechiul nume. Dar, având în vedere că a devenit unul dintre cei mai titrați jucători de pe culoarul din mijloc din LPL, poate că era conștient de ceea ce face. Drumul său a fost unul cu suișuri și coborâșuri, dar se pare că We1less e în sfârșit aproape de destinație.</p>\n\nDemult, We1less era playmaker la Vici Gaming. Era un jucător egoist; dacă vedea o oportunitate de a se arunca în luptă, de obicei profita de ea. Evident, acea strategie n-a fost întotdeauna strălucită, nici pentru el și nici pentru Vici. Acum, însă, We1less este mai calculat și mai atent la interesele echipei. E un jucător dinamic, care se gândește mereu cum își poate ajuta coechipierii, în loc să se gândească cum îl pot ajuta ei pe el.</p>\n\nChiar dacă We1less nu a putut intra în Rift în 2016 din cauza unei accidentări, potențialul său de a crea situații favorabile a ajuns în lumina reflectoarelor spre finalul etapei de vară. Reușind niște scoruri incredibile, We1less ne-a arătat cât de bun este cu adevărat. Reușitele sale impresionante i-au uimit pe fani, care l-au votat la All-Star Event 2016 din Barcelona. Are un potențial uriaș de a crea faze spectaculoase și, dacă e să ne luăm după reușitele sale din trecut, va lansa vrăji des, încă de la început. \n","es_AR":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>","es_MX":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>"},"foreignIds":{"drupalId":"4529","TRLH3":"1001360058","TRLH4":"1001310058"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":998,"slug":"jinoo","name":"Jinoo","firstName":"Jin-woo","lastName":"Lim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jinoo-53memnp9.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:32:05.000Z","updatedAt":"2016-02-01T22:57:58.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1431,"slug":"intruder","name":"Intruder","firstName":"Sheng","lastName":"Tang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/intruder-3ffozme5.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:35:52.000Z","updatedAt":"2016-08-24T21:36:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84}],"scheduleItems":[{"id":"AVTGnnsWQMQFcjhwbQh-","content":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:match:2b2b2ae7-aec7-46c4-ba58-745bfac14860","scheduledTime":"2016-06-10T09:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","blockLabel":"3","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:bracket:f2da20fc-a258-4faa-8a9f-0e4c7555d168"},"match":"2b2b2ae7-aec7-46c4-ba58-745bfac14860","tournament":"ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","bracket":"f2da20fc-a258-4faa-8a9f-0e4c7555d168","league":"7"}],"gameIdMappings":[],"videos":[{"id":3054,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:5d0e110d-44fb-46f5-b0e9-9d61cc5ac3ed","source":"https://www.youtube.com/embed/CypmFdn3ocw?wmode=transparent&start=5905","createdAt":"2016-06-10T19:06:27.000Z","updatedAt":"2016-06-10T19:06:27.000Z","game":"5d0e110d-44fb-46f5-b0e9-9d61cc5ac3ed"},{"id":3055,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:da74d4ec-4ed0-46ff-a7d7-72a8bd3688f5","source":"https://www.youtube.com/embed/CypmFdn3ocw?wmode=transparent&start=2505","createdAt":"2016-06-10T19:09:53.000Z","updatedAt":"2016-06-10T19:09:53.000Z","game":"da74d4ec-4ed0-46ff-a7d7-72a8bd3688f5"}],"htmlBlocks":[],"match":{"id":"2b2b2ae7-aec7-46c4-ba58-745bfac14860","name":"LGD-vs-RNG","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"},{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],"games":{"da74d4ec-4ed0-46ff-a7d7-72a8bd3688f5":{"id":"da74d4ec-4ed0-46ff-a7d7-72a8bd3688f5","name":"G1","generatedName":"LGD|RNG|G1|2b2b2ae7aec746c4ba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"},{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}],"standings":{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465585201663,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465584947019,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465567601907,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5d0e110d-44fb-46f5-b0e9-9d61cc5ac3ed":{"id":"5d0e110d-44fb-46f5-b0e9-9d61cc5ac3ed","name":"G2","generatedName":"LGD|RNG|G2|2b2b2ae7aec746c4ba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"},{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],"standings":{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465585413346,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465584990786,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465567606977,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"61ca97e0-cbbe-4560-8e4a-e273d3a8075d":{"id":"61ca97e0-cbbe-4560-8e4a-e273d3a8075d","name":"G3","generatedName":"LGD|RNG|G3|2b2b2ae7aec746c4ba5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"},{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465585201663,"source":"bestOf","history":[{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465585413346,"source":"bestOf","closed":true},{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465584990786,"source":"bestOf","closed":true},{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465584947020,"source":"bestOf","closed":true},{"result":[[{"roster":"62f0bfaf-35fc-414c-ad1e-c07b55fe9535"}],[{"roster":"0dfc361c-d371-46e7-aea2-68b8c4e666a7"}]],"timestamp":1465567606978,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"62f0bfaf-35fc-414c-ad1e-c07b55fe9535":1,"0dfc361c-d371-46e7-aea2-68b8c4e666a7":0}}}