{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]}],"players":[{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163}],"scheduleItems":[{"id":"AVxHBnHPQMQFcjhwbQ3k","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:2b96b732-14b1-413a-87bd-e02d3cd7e1f6","scheduledTime":"2017-06-02T15:00:00.644+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"2b96b732-14b1-413a-87bd-e02d3cd7e1f6","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"4ff147d1-4980-488e-a799-d0a25171d7a1","gameHash":"60956f147ce04563"},{"id":"5b3754b6-b556-4313-982d-5a2f12b888c5","gameHash":"347cdc4294db57fe"},{"id":"d7237aa0-dfbe-477a-bd4d-08af44427843","gameHash":"bd9175476e658729"}],"videos":[{"id":7066,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:d7237aa0-dfbe-477a-bd4d-08af44427843","source":"https://www.youtube.com/embed/etbtgGVhBHk?wmode=transparent&rel=0","createdAt":"2017-06-03T02:20:10.000Z","updatedAt":"2017-06-05T05:49:08.000Z","game":"d7237aa0-dfbe-477a-bd4d-08af44427843"},{"id":7067,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:5b3754b6-b556-4313-982d-5a2f12b888c5","source":"https://www.youtube.com/embed/8oUPKsL6oTs?wmode=transparent&rel=0","createdAt":"2017-06-03T02:14:36.000Z","updatedAt":"2017-06-05T05:43:05.000Z","game":"5b3754b6-b556-4313-982d-5a2f12b888c5"},{"id":7068,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:4ff147d1-4980-488e-a799-d0a25171d7a1","source":"https://www.youtube.com/embed/-rkjEtrD8mM?wmode=transparent&rel=0","createdAt":"2017-06-03T02:15:01.000Z","updatedAt":"2017-06-05T05:49:20.000Z","game":"4ff147d1-4980-488e-a799-d0a25171d7a1"}],"htmlBlocks":[],"match":{"id":"2b96b732-14b1-413a-87bd-e02d3cd7e1f6","name":"ROC-vs-G2","position":28,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"games":{"4ff147d1-4980-488e-a799-d0a25171d7a1":{"id":"4ff147d1-4980-488e-a799-d0a25171d7a1","name":"G3","generatedName":"G2|ROC|G3|2b96b73214b1413a87bd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496641567355,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496456278509,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496426558349,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002090071","gameRealm":"TRLH3","platformId":"TRLH3:1002090071","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5b3754b6-b556-4313-982d-5a2f12b888c5":{"id":"5b3754b6-b556-4313-982d-5a2f12b888c5","name":"G2","generatedName":"G2|ROC|G2|2b96b73214b1413a87bd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496641561207,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496456262677,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496423152515,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002090067","gameRealm":"TRLH3","platformId":"TRLH3:1002090067","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d7237aa0-dfbe-477a-bd4d-08af44427843":{"id":"d7237aa0-dfbe-477a-bd4d-08af44427843","name":"G1","generatedName":"G2|ROC|G1|2b96b73214b1413a87bd","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"standings":{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}]],"timestamp":1496641555548,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}]],"timestamp":1496456429486,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}]],"timestamp":1496419685379,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002090056","gameRealm":"TRLH3","platformId":"TRLH3:1002090056","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496641567355,"source":"bestOf","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496641561207,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496641555548,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496456278510,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496456262677,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496456429486,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1496426558350,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"448614f1-757e-4a44-8c84-80a48cf8b425":1,"f7aa5e2f-7241-45ce-be56-4f324d15a566":0}}}