{"teams":[{"id":21,"slug":"team-dignitas","name":"Team Dignitas","guid":"be6c8d0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-dignitas-c5j84saq.png","acronym":"DIG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-21T21:17:20.000Z","bios":{"en_US":"<p>From the ashes they rise (Phoenix1, is that you?). Dignitas looked all but lost to the NA LCS after they failed to re-qualify for the LCS, and consequently sold their Challenger spot to Apex Pride. But the League gods had other plans for the organization. In September of 2016 it was announced that both Dignitas and Apex had been bought by the Philadelphia 76ers. .</p>\n\n<p>The two entities were merged in order to play under a unified Dignitas banner, and thus a legendary League of Legends team was reborn. Sporting a roster mixed with domestic and international stars, Dignitas got off to a slow start but picked up steam near the end of the 2017 NA LCS Spring Split. Heading into summmer, Dignitas will look to build on their late-season success from spring -- let’s just hope they fare better than their basketball counterparts.</p>\n\n<p>Coach: David \"Cop\" Roberson</p>","fr_FR":"<p>Dignitas est un nom que tous les fans de League of Legends et d'e-sport en général connaissent au moins de réputation. Il faut dire qu'il s'agit d'une des plus vieilles organisations présentes sur le jeu, depuis l'acquisition en septembre 2011 de Rock Solid, l'équipe de Joedat « Voyboy » Esfahani, William « scarra » Li et Joshua « Jatt » Leesman (oui, le même Jatt qui est aujourd'hui l'un des commentateurs des LCS). Une entrée remarquée sur une scène qui n'était alors que bourgeonnante et surtout le début d'une belle aventure avec des joueurs qui, comme Michael « Imaqtpie » Santana sont aujourd'hui considérés comme des figures historiques de l'e-sport nord-américain.</p>\n\n<p>Malheureusement pour Dignitas, cette popularité a depuis longtemps du mal à être suivie de titres. L'organisation a tenté divers changements au fil des saisons, que ce soit au niveau de l'encadrement ou des joueurs, mais en vain. Si l'équipe américaine peut se targuer d'avoir toujours su maintenir sa place dans les LCS depuis la création de cette ligue, ils n'y ont jamais vu ne serait-ce qu'une finale des play-offs, sans même parler d'une qualification au Championnat du monde. Pire, lors du segment de printemps de la saison 5 l'équipe a terminé à la 9e place et a donc dû participer aux relégations. Certes, ils l'ont emporté avec 3 victoires pour 2 défaites contre Team Fusion, l'équipe de Choi « Huhi » Jae-hyun, à présent mid laner de Counter Logic Gaming, et ont conservé leur place dans les LCS. Mais ce n'est pas avec des performances pareilles que Dignitas allait satisfaire ses fans. Le segment d'été a bien mieux débuté pour l'équipe qui a culminé à 6 victoires pour seulement 2 défaites à l'issue de la 4e semaine de compétition.</p>\n\n<p>Mais, comme souvent avec ceux que leurs fans surnomment affectueusement « Dignitoss » pour leur capacité à jeter leur avance aux orties, le retour à la réalité fut rude. Après une deuxième partie de segment médiocre, l’équipe de Danny « Shiphtur » Le a terminé la saison régulière à la 4e place seulement avant d'être envoyée prématurément en vacances par Team Impulse dès le 4e tour des play-offs.</p>\n\n<p>Aujourd'hui, avec une équipe remaniée à coup de sang neuf européen, Dignitas entend bien faire taire, enfin, toutes les critiques.</p>","pl_PL":"<p>Team Dignitas stanowi jedną z najstarszych organizacji na światowej scenie esportowej. Jej powstanie miało miejsce 9 września 2003 roku w efekcie fuzji dwóch innych stowarzyszeń z gier FPS. Świetnie się rozwijała, więc po zainteresowaniu się i dodaniu kolejnych gier, w czerwcu 2004 roku została zarejestrowana jako spółka z o.o. Od tego czasu Team Dignitas ciągle się rozrasta, nabywając oddziały w kolejnych grach o bogatej scenie esportowej. Dywizja League of Legends powstała 22 września 2011 roku, poprzez nabycie graczy z zespołu Rock Solid. Pierwszym wpisem w długiej historii organizacji było pierwsze miejsce na IGN ProLeague, gdzie pokonali dobrze znane drużyny: Counter Logic Gaming i Curse Gaming. Od tego czasu często plasowali się w okolicy trzeciego miejsca w różnych turniejach. Ich największym osiągnięciem z pierwszych sezonów jest zostanie najlepszym zespołem po Moscow Five na 6 Mistrzostwach Świata IEM. Drużyna Team Dignitas miała również okazję zaprezentować się na Mistrzostwach Świata drugiego sezonu, lecz niestety nie udało się jej się wyjść z fazy grupowej.</p>\n<p>\nZe względu na stale rosnącą konkurencję po trzecim sezonie Team Dignitas dużo częściej znajdował się w okolicach 5 miejsca w różnej rangi rozgrywkach. Jednak ich były AD Carry „CoreJJ” podsumował ideologię Team Dignitas w krótkim zdaniu: „Naszym celem zawsze będzie znalezienie się na podium i kwalifikacja do Mistrzostw Świata, nie uważamy tego za zamiar nie do osiągnięcia.” Te słowa podkreślają świadomość organizacji w kwestii ostatnich niepowodzeń. Raz nawet zmierzyła się z groźbą relegacji, lecz wyszła z tej próby zwycięsko. Jednak cel Team Dignitas pozostaje jeden – szczyt NA LCS. </p>\n<p>\nSama organizacja jest znana z poświęcania uwagi portalom społecznościowym. Często wydaje różnego rodzaju poradniki, które mają być pomocą we wszystkich grach, które wspiera. Dba też o kadrę dla swoich drużyn. Do ich oddziału League of Legends 30 października 2015 roku jako menadżer dołączył Joe \"InnerFlame\" Elouassi, znanym z prowadzenia spraw SK Gaming, a potem Gamers2. Wraz z nim Team Dignitas podpisało kontrakt z Ramem \"Brokenshard\" Djemalem, powszechnie popularnym i bardzo doświadczonym zawodnikiem. Sama organizacja stara się też zakontraktować możliwie najlepszych graczy. Wielu światowej sławy zawodników i nie tylko wyszło właśnie spod skrzydeł Team Dignitas. Joshua \"Jatt\" Leesman, Joedat \"Voyboy\" Esfahani, William \"scarra\" Li i Alberto \"Crumbz\" Rengifo to tylko niektórzy z tłumu, który wyszedł z tej kuźni talentów.</p>\n","de_DE":"Sie erheben sich aus der Asche. Team Dignitas schien für immer aus der NA LCS auszuscheiden, nachdem sie sich zum ersten Mal nicht für die LCS qualifizieren konnten und ihren Platz in der Challenger Series an Apex Pride verkauft hatten. Aber die Götter von League hatten andere Pläne für die Organisation und im September 2016 verkündeten die Philadelphia 76ers, dass sie sowohl Dignitas als auch Apex gekauft hatten. \n</p>\nDie beiden Mannschaften wurden zusammengelegt, um unter dem Namen Dignitas zu spielen. Und so wurde die legendäre „League of Legends“-Mannschaft wiedergeboren. Mit einer Aufstellung aus heimischen und internationalen Stars will Dignitas versuchen, den Frühjahrs-Split der NA LCS 2017 zu gewinnen. Dank der neuen Führung und Aufstellung hat Dignitas eine Chance, die Liga im Sturm zu erobern – bleibt nur zu hoffen, dass sie sich besser schlagen als ihr Gegenstück im Basketball.\n</p>\nCoach: Jung Su Kim\n"},"foreignIds":{"drupalId":"3"},"players":[168,266,325,333,399,751,967],"starters":[168,266,325,399,751],"subs":[333,967]},{"id":53,"slug":"team-liquid","name":"Team Liquid","guid":"be6cab43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-liquid-3g983dra.png","acronym":"TL","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-08-05T20:07:01.000Z","bios":{"en_US":"<p>Formed in the wake of the Team Liquid and Team Curse organizations merging, Liquid debuted in the NA LCS 2015 Spring Split. After a tumultuous Spring Split, where they lost three of their tested talents and replaced them with rookies Lourlo, Dardoch, and Matt, many players thought that they’d struggle to avoid the bottom of the rankings. Instead, the team stepped up huge and outperformed expectations.</p>\n\n<p>Unfortunately, all good things must come to an end and Liquid released some of their top talent at the end of 2016. The team acquired a couple of new players (including world class jungler Reignover) and a returning world champion in Piglet. With a new outlook and the air successfully cleared after a rough split, Liquid is ready to make a run at playoffs.</p>\n\n<p>Coach: Nu-ri \"Cain\" Jang</p>","fr_FR":"<p>Née de la fusion entre Team Liquid et Team Curse, Liquid a fait ses débuts dans le segment de printemps des LCS NA 2015. Malgré un départ un peu poussif, avec un score de 9 victoires pour 9 défaites lors de la saison, TL est remontée à un score final de 11 victoires après s'être battue bec et ongles pour arracher la 3e place. Le roster de Liquid est resté quasi-intact au fil des péripéties connues par l'équipe depuis ses débuts, et les fans espèrent que les quelques nouveaux éléments intégrés au roster sauront s'adapter rapidement, en particulier leur nouveau top laner, Lourlo, qui doit encore faire ses preuves.</p>","pl_PL":"<p>Ta organizacja założona w 2010 roku w Holandii zrzesza graczy z całego świata. Posiada swoje oddziały w większości gier gdzie istnieje scena esportowa, więc naturalną koleją rzeczy jej pragnieniem było dołączenie do nich League of Legends. Taka okazja nadarzyła się 6 stycznia 2015 roku – drużyna Team Curse dokonała fuzji z organizacją Liquid. W ten sposób zespół sięgający swoimi korzeniami do pierwszego sezonu zmienił nazwę na Team Liquid. Ze względu na integrację kadra pozostała bez zmian, tylko nadzór nad nią i jej wsparcie uległy modyfikacji.</p>\n<p>\nJej właścicielami są Victor \"Nazgul\" Goossens i Steve \"LiQuiD112\" Arhancet, którzy aktywnie biorą udział w życiu drużyny. Victor to założyciel Team Liquid i były profesjonalny gracz strategicznych produkcji. 1 maja 2001 roku powstała strona dotycząca gier tej kategorii. W kolejnych latach jego organizacja rozwijała się o kolejne gry różnych typów. W momencie fuzji była poważaną instytucją zrzeszającą graczy z całego świata. Steve był częścią sceny esportowej League of Legends w pierwszym i drugim sezonie. Uwielbiał grać jako support, w szczególności Soraką. Posiada wykształcenie z zakresu finansów, co po 12 latach pracy w biznesie, zdecydował się połączyć ze swoją pasją. W sierpniu 2011 roku, po tym jak jego drużyna dostała się pod skrzydła Curse Gaming, został Dyrektorem do spraw esportu w Curse Inc. Po fuzji automatycznie stał się współwłaścicielem Team Liquid. Często można go zobaczyć na filmach przedstawiających życie zawodników, jak i również w spotach reklamowych organizacji. Razem z Victorem dbają o wizerunek i potrzeby swojej wspólnej drużyny.</p>\n<p>                                             \nDebiut Team Liquid, jako marki, w NA LCS miał miejsce w piątym sezonie. W okresie wiosennym poradzili sobie przyzwoicie, kończąc na szóstym miejscu z wynikiem 9:9. Biało-niebiescy zawodnicy zdobyli tytuł najbardziej wartościowego gracza aż dwukrotnie w tym okresie. Swoją prawdziwą siłę pokazali dopiero w letnim sezonie NA LCS 2015. Zadziwiające jest to, że udało im się tego dokonać bez żadnych zmian w składzie osobowym.Drużyna Team Liquid skończyła z najlepszym wynikiem – 13:5, zajęła pierwsze miejsce w tabeli ex aequo z Counter Logic Gaming. Jednak w dogrywce nie pozostawiła złudzeń, że to właśnie jej należy się pierwsze miejsce i pokonała CLG. W tym okresie, oprócz kolejnych dwóch laurów MVP, nagrodzony został trener Team Liquid - Peter Zhang. Na zdobyciu szczytu w letnim sezonie NA LCS 2015 skończyła się dobra passa biało-niebieskich. Po rozegraniu meczy kwalifikacyjnych do Mistrzostw Świata, niestety nie udało im się przejść dalej. Jednak Team Liquid pomyślnie wykreował swój wizerunek na scenie esportowej, gdyż po sezonie piątym jej popularność wśród społeczeństwa League of Legends zdecydowanie wzrosła. Przez fanów postrzegana jest jako nowoczesna i prężna organizacja, po której zawsze można się spodziewać czegoś dobrego.</p>\n","de_DE":"Liquid entstand aus der Fusion von Team Liquid und Team Curse, und sie traten zum ersten Mal im Frühjahrs-Split der nordamerikanischen LCS 2015 auf den Plan. Nach einem turbulenten Frühjahrs-Split, in dem sie drei ihrer erfahrenen Talente verloren hatten und sie mit den Nachwuchsspielern Lourlo, Dardoch und Matt ersetzen mussten, dachten viele Spieler, sie würden am Ende der Tabelle landen. Stattdessen machte die Mannschaft einen großen Sprung und übertraf alle Erwartungen.</p>\n<p>\nLeider hat alles Gute einmal ein Ende und Team Liquid musste Ende 2016 ein paar seiner besten Spieler ziehen lassen. Die Mannschaft verpflichtete ein paar neue Spieler (dazu gehört auch der Weltklasse-Jungler Reignover) sowie den Weltmeister Piglet. Dank der neuen Aufstellung und einem sauberen Schnitt nach dem Sommer-Split 2016 ist Team Liquid bereit, um die Krone der LCS mitzuspielen.\n<p>\nCoach: David „Varsix“ Lim\n"},"foreignIds":{"drupalId":"3654"},"players":[44,250,326,372,395,558,626,777,969,2081],"starters":[44,558,626,777,969],"subs":[250,326,372,395,2081]}],"players":[{"id":44,"slug":"piglet","name":"Piglet","firstName":"Gwang-jin","lastName":"Chae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/piglet-4smmppa.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-05-25T17:21:49.000Z","bios":{"en_US":"<p>Gwang-jin “Piglet” Chae experienced the highest highs a League of Legends pro player can experience when he took home the Summoner’s Cup at the 2014 World Championship. But he has since had to endure some of the lowest lows to get another shot at glory. He struck out into the unknown and joined Liquid. It’s been a rocky road which eventually led to Piglet stepping down to play with Team Liquid Academy.</p>\n\n<p>After opting to play largely with Team Liquid Academy in 2016, Piglet is finally making his return to Team Liquid and the NA LCS. Piglet’s mechanical skill is the stuff of legends, and he’s renown for his ability to make even the most skillful plays look deceptively easy. Quite simply: Piglet is a playmaker that Team Liquid has gone far too long without. The kind of firepower that Piglet is capable of unleashing has the potential to make Team Liquid an instant contender for the NA LCS throne. Bot lane beware -- Piglet is back.</p>","fr_FR":"<p>Gwang-jin « Piglet » Chae a vécu ce qu'un joueur pro de League of Legends peut vivre de plus\n\nfantastique ; il a rapporté chez lui la Coupe de l'invocateur du mondial 2014. Mais depuis, il a dû \n\nsupporter le pire du pire dans l'espoir de revivre cette heure de gloire. Après s'être lancé dans l'inconnu \n\nen rejoignant Team Liquid de l'autre côté de l'océan, Piglet s'est pris un mur. Les choses ne se passaient \n\npas comme prévu. Au lieu de mener son équipe au sommet des LCS, il s'est retrouvé sur le banc de \n\ntouche pendant qu'un jeune n'ayant pratiquement aucune expérience pro jouait son rôle.</p>\n\n<p>Mais Piglet n'a pas été champion du monde par hasard et il a su relever ce nouveau défi. S'entraînant \n\nencore plus qu'avant, donnant tout pour établir une vraie synergie avec ses coéquipiers, Piglet et Liquid \n\nsont finalement parvenus à se fondre dans une entité efficace. Malgré quelques difficultés persistantes, \n\nPiglet retrouve peu à peu sa forme d'antan. Profitant pleinement des compétences techniques qui lui \n\navaient permis de remporter le championnat du monde, Piglet ne vise plus qu'un seul objectif : revenir \n\nune fois encore sur la plus grande scène que l'e-sport de LoL puisse offrir.</p>","pl_PL":"<p>Ten utalentowany AD Carry pojawił się na scenie esportowej League of Legends w lutym 2013 roku. Jako debiutant, doświadczony tylko w solo que, dołączył do SK Telecom T1 2. Ten skład został utworzony wokoło  Lee’a \"Faker\" Sang-hyeoka, jako siostrzana drużyna SK Telecom T1 1. \"Piglet\" wraz z ekipą osiągnęli powodzenie już na pierwszym turnieju, pomimo tego, że w większości byli nowicjuszami. Co prawda zajęli tylko trzecie miejsce, ale dzięki temu zaistnieli wśród najlepszych w Korei, pokonując m.in. CJ Entus Frost. Zaledwie parę miesięcy później pokazali na co naprawdę ich stać, wygrywając HOT6iX Champions Summer 2013. Dzięki zdobytym punktom na tym wydarzeniu, zdecydowane zwycięstwozagwarantowało Chae’owi \" Gwang-jinowi wejście do Mistrzostw Świata 2013 z trzeciego miejsca w Korei. Tam, na arenie międczynarodowej, \"Piglet\" pokazał jak bardzo wybitnym jest AD Carrym. Z grupy SKT T1 wyszło z wynikiem 7:1, tracąc tylko jedną grę przeciwko OMG. W fazie eliminacji tylko Najin Black Swordz powodzeniem stawiło czoła ich potędze, przegrywając z SKT T1 2:3. Tytuł mistrza świata to zdecydowanie największy sukces Chae’a Gwang-jina.</p>\n<p>\nCzwarty sezon w Korei rozpoczął kolejnymi triumfami, lecz wraz z upływem czasu SKT T1 coraz gorzej sobie radziło. Ostatecznie, we wrześniu 2014 roku, \"Piglet\" i jego partner \"PoohManDu\"  pożegnali się z tą organizacją. Wspomnieniem po tej współpracy pozostały skarpetki Chae’a Gwang-jina z Kubusiem Puchatkiem, które nosił podczas meczów ze swoim supportem, ponieważ przynosiły mu szczęście. Taki talent nie mógł zostać wolnym strzelcem zbyt długo, już październiku 2014 roku dostał ofertę od Team Curse. Po przeprowadzce do Stanów Zjednoczonych czekało go dużo pracy – pokonanie bariery językowej, problemy z wizą i zyskanie komunikacji z nowym kolegami. Jednak znany z zaangażowania \"Piglet\" dał z siebie wszystko. W końcu, w letnim sezonie 2015, już pod marką Team Liquid, udało mu się znaleźć na szczycie NA LCS.</p>\n<p> \nDo jego osobistych osiągnięć przede wszystkim należy nagroda za najlepszego AD Carry podczas 2013 Korea e-Sports Awards. Dokonał tego głównie grając swoją ulubioną postacią – Vayne. Poza nią, częściej od innych bohaterów, wybiera Ezreala, Corkiego i Caitlyn.Wspominając swoje najszczęśliwsze momenty w życiu, jako pierwszy przytacza dostanie się do SKT T1, a jako drugi z kolei wygranie OGN Summer 2013. Słynie ze swojego niezmiennego, defensywnego stylu gry i godnej podziwu pozycji w walkach drużynowych. To bardzo dumny zawodnik, poważnie traktujący rywalizację z AD Carry z innych zespołów, w szczególności z Gu’em \"Imp\" Seung-binem. Wśród innych graczy wyróżnia go sumienność i pracowitość. Przez to, że sypiał po 4 do 5 godzin i ćwiczył swoje umiejętności w League of Legends przez kolejne 15 do 16, zyskał przydomek „Practice Worm”. Można również o nim powiedzieć, że jest emocjonalny. Wielokrotnie reagował na krytykę lub porażkę bardzo silnie, w szczególności w kontaktach ze swoimi trenerami i menadżerami.\n</p>","de_DE":"Gwang-jin „Piglet“ Chae hat alle Höhen eines professionellen „League of Legends“-Spieler erlebt, als er die Weltmeisterschaft 2014 gewann und den Beschwörerpokal mit nach Hause nahm. Seither musste er jedoch auch einige Tiefen verkraften, um wieder eine Chance auf Ruhm und Ehre zu bekommen. Er machte sich auf ins Unbekannte und wechselte zu Liquid. Es war ein steiniger Weg, der schließlich dazu führte, dass sich Piglet zurückzog und für Team Liquid Academy spielte. \n</p>\nNachdem Piglet sich entschieden hatte, 2016 hauptsächlich für Team Liquid Academy zu spielen, kehrt er schließlich wieder zu Team Liquid in die NA LCS zurück. Piglets mechanisches Können ist legendär, und er ist bekannt dafür, selbst die schwierigsten Spielzüge ganz einfach aussehen zu lassen. Es ist ganz einfach: Piglet ist der Spielmacher, auf den Team Liquid zu lange verzichten musste. Die Feuerkraft, die in Piglet steckt, kann Team Liquid sofort zu einem Anwärter auf den Thron der NA LCS machen. Die untere Lane sei gewarnt – Piglet ist zurück.\n"},"foreignIds":{"drupalId":"690","TRLH1":"200000244","TRLH2":"200000148"},"socialNetworks":{"twitch":"","twitter":"https://twitter.com/LiquidPiglett"},"champions":[],"liveGameTeam":53},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":325,"slug":"adrian","name":"Adrian","firstName":"Adrian","lastName":"Ma","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/adrian-d97sgu2b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-08-04T00:05:38.000Z","bios":{"en_US":"<p>Adrian \"Adrian\" Ma might not be known for his playmaking. But that doesn't mean he isn't a vital part to his team's successes. As a member of Immortals, he was the yin to Huni's yang, balancing his top laner's aggression with his own methodical, thoughtful playstyle. He's always ready to save his teammates and focuses heavily on warding, map movements and strategizing. He pioneered a trend in the 2016 NA LCS Summer Split of playing ranged supports like Karma and Soraka over the favoured melee champions.</p>","fr_FR":"<p>À 18 ans, Adrian « Adrian » Ma s'apprête à entamer sa deuxième année en tant que joueur professionnel de League of Legends, au poste de support pour l'équipe Immortals.</p>\n\n<p>Auparavant, il a passé un peu plus d'un an comme support de LMQ en remplacement de Zhang « Mor » Hong-Wei, retourné jouer en Chine. Recruté par une équipe alors en pleine restructuration et qui a d'ailleurs changé de nom pour l'actuel, Team Impulse, quelques semaines seulement après l'arrivée d'Adrian, le jeune joueur américain a pris un risque en signant son contrat. Un pari qui s'est vite révélé gagnant puisque Team Impulse a su, après quelques semaines d'adaptation, trouver les clés pour s'imposer comme l'une des principales menaces des LCS NA. Ils n'ont en revanche pas su concrétiser leur domination lors des play-offs, terminant à la quatrième place lors du segment de printemps puis d'été. Pire, ils n'ont pas réussi à se qualifier pour les championnats du monde, malgré un rang de tête de série numéro 2, lors du tournoi de qualification régional pour la troisième place nord-américaine de la compétition la plus importante de l'année.</p>\n\n<p>Au niveau individuel, Adrian a malgré tout prouvé lors de sa première année au plus haut niveau qu'il est un joueur versatile, capable d’incarner des champions différents en fonction des besoins de l'équipe. Il a aussi montré qu'il savait réagir rapidement et protéger ses coéquipiers même dans des situations inattendues. Une qualité forcément utile pour soutenir un carry AD tel que Jason « WildTurtle » Tran, son nouveau comparse chez Immortals, connu pour être parfois trop agressif lors des combats d’équipes.</p>\n\n<p>Au sein d'une équipe ayant l'expérience de la scène compétitive, le support américain bénéficie en tout cas d’une occasion en or pour passer du statut de jeune joueur prometteur à celui de star titrée au plus haut niveau.</p>\n","pl_PL":"<p>Adrian poznał dzieło Riot Games grając z przyjaciółmi, wkrótce prześcignął ich i znalazł się w akademickim zespole. Jako członek amatorskiej drużyny, brał udział w Challenger League, skąd było bardzo blisko do Challenger Series. Jednak jego zainteresowanie League of Legends zbiegło się w czasie z pójściem na studia. Miał świadomość, że profesjonalna gra pochłania naprawdę dużo codziennego czasu na ćwiczenia, podobnie jak nauka na poziomie uniwersyteckim. Przez to miał wiele wątpliwości, m.in. czy warto porzucić naukę na rzecz esportowej kariery i czy w ogóle ma szanse się wybić. W podjęciu decyzji pomógł mu trener drużyny esportowej, który dał ogłoszenie w sieci o college’u przyjaznym zawodowym graczom. Adrian na początku nie chciał w to uwierzyć. Kiedy się przekonał, że to prawda, podjął decyzję o zaangażowaniu się w scenę League of Legends. Został jednym z pierwszych graczy wspieranych przez uczelnię - Robert Morris University w Illinois.</p>\n<p>\nChociaż \"Adrian\" grał w profesjonalnych drużynach od marca 2014 roku, pokazał się dopiero w Team Impulse w grudniu tego roku. Wraz z tą organizacją zaistniał jako solidny zawodnik, jeden z najlepszych. Niestety zarówno w wiosennym sezonie NA LCS 2015, jak i w letnim skończył na czwartej pozycji, tuż przed podium. Wiązało się to z licznymi problemami, które na swojej drodze po zwycięstwo napotkała jego drużyna. Był blisko dostania się do Mistrzostw Świata, lecz ostatecznie nie udało mu się do nich zakwalifikować. Jednak występy Adriana zrobiły wrażenie na właścicielach organizacji Immortals, której szeregi zasilił w grudniu 2015 roku, a następnie, wraz z nimi zawalczył o więcej w wiosennym sezonie NA LCS 2016.</p>\n<p>\nAdrian to osoba lubiana w środowisku League of Legends, pierwotnie znany jako „10q”, ponieważ fonetycznie brzmiało jak „thank you”. Pochodzący z Texasu support jest znany z doskonałej kontroli wizji na mapie. Przepada za graniem bohaterami, którzy potrafią przyciągnąć nie tylko uwagę przeciwnika, ale także jego postać. Ulubionymi wyborami Adriana są Thresh i Blitzcrank. Dzięki występom w NA LCS i wysokiej pozycji w Kręgu Pretendenta zdobył skromne grono wielbicieli. Na pytania fanów „jak sobie radzi” odpowiada: „Nie pozwalam żeby cokolwiek poza grą mnie rozpraszało, skupiam się na meczu. Po prostu daję z siebie wszystko i nie martwię się co sądzą inni. \nW ogóle w takich sytuacjach się nie denerwuję.” Z takim nastawieniem ma zamiar spełnić swoje marzenie – znaleźć się w drużynie, która zajmuje czołowe miejsce w NA LCS.\n</p>","de_DE":"Adrian „Adrian“ Ma wäre der Erste, der dir sagen würde, dass er kein Spielmacher ist. Aber das bedeutet nicht, dass er keine tragende Rolle für den Erfolg seines Teams spielt. Als Mitglied der Immortals war er das Yin zu Hunis Yang. Die Aggressivität seines Top-Laners konnte er mit seinem methodischen, durchdachten Spielstil ausgleichen. Er ist stets bereit, seinen Teamkollegen zu helfen, und legt großen Wert auf die Platzierung von Augen, Bewegungen auf der Karte und das Entwickeln von Strategien. Er war es, der im Sommer-Split der NA LCS 2016 den Trend zu Fernkampf-Supportern wie Karma und Soraka gesetzt und die zu diesem Zeitpunkt beliebteren Nahkampf-Champions abgelöst hat.</p>\n\nObwohl er sich mit Phoenix1 einem neuen Team anschließt, sollte sich Adrians Spielstil 2017 kaum verändern. Dieses Mal muss er der Gegenpol seines aggressiven Junglers Inori sein. Adrian sorgt vielleicht nicht für Spiele-Highlights, aber er wird auf jeden Fall eine Schlüsselrolle in Phoenix1s neuer Mannschaft spielen.\n"},"foreignIds":{"drupalId":"3041","TRLH1":"200000236","TRLH2":"200000140"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":326,"slug":"reignover","name":"Reignover","firstName":"Yeu-Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reignover-cswdikvi.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-29T02:29:09.000Z","bios":{"en_US":"<p>Yeu-jin “Reignover” Kim has left his mark on both the EU and NA LCS. After guiding Fnatic to an INSANE (incredible, amazing, eye-popping) 18-0 record in 2015, Reignover took a flight across the pond to play for the newly-formed Immortals squad. That team was wildly successful during regular seasons, where Reignover earned himself MVP honors in the 2016 NA LCS Spring Split. Their inability to win in the postseason led to most players, including Reignover, to seek opportunities elsewhere.</p>\n\n<p>Reignover became Team Liquid’s biggest acquisition of the offseason after they parted ways with troubled jungler, Dardoch. He’ll look to continue his dominant ways in 2017 as part of the revamped Team Liquid squad. His arrival coupled with the return of powerhouse AD Carry, Piglet, has given Team Liquid fans more than enough reason to get pumped for the upcoming split. Whether he’s cleaving enemies to death as Olaf, or tunneling his way to victory with Rek’Sai, rest assured that Reignover is going to put on one hell of a show.</p>","pl_PL":"Yeu-jin „Reignover” Kim w tym roku odcisnął swoje piętno na NA LCS. Chociaż Immortals nie udało się zakwalifikować do Mistrzostw, występy Reignovera podczas splitów wiosennego i letniego zapadły w pamięci głosujących, którzy przyznali mu 36 procent głosów na dżunglera. Najwyraźniej fani wierzą, że chociaż Reignover nie pojawił się na Mistrzostwach, bez problemów dorówna reszcie najlepszych dżunglerów świata. </p>\n\nPo odejściu z legendarnej europejskiej drużyny, Fnatic, Reignover podbił Amerykę Północną szturmem, gdy poprowadził dopiero co utworzonych Immortals przez zakończony wynikiem 17-1 sezon zasadniczy i zdobył tytuł najlepszego zawodnika wiosennego splitu NA LCS 2016. Utrzymywał dominację podczas letniego splitu, a Immortals przez cały sezon siedzieli na ogonie zdobywców pierwszego miejsca, TSM. Jednak pomimo stałej dominacji w sezonie zasadniczym, Reignover oraz Immortals zawiedli w fazie pucharowej i kwalifikacjach regionalnych. Podczas wydarzenia All-Star 2016 będzie mógł raz jeszcze pokazać, na co go stać i przypomnieć fanom, dlaczego jest uważany za jednego z najlepszych dżunglerów na świecie.\n","fr_FR":"<p>Yeu-jin \"Reignover\" Kim a marqué les LCS NA cette année. Même si Immortals n'a pas réussi à se qualifier pour le Mondial, les performances de Reignover durant les segments de printemps et d'été sont restés gravées dans les esprits, ce qui lui a valu de remporter 36 pour cent du vote jungler. Les fans pensent clairement que même si Reignover n'a pas participé au Mondial, il aurait été à la hauteur des autres meilleurs junglers du monde.</p>\n\n<p>Après avoir quitté Fnatic, l'équipe européenne historique, Reignover a pris d'assaut l'Amérique du Nord lorsqu'il a permis à l'équipe nouvellement créée des Immortals d'établir un record de 17-1 pendant la saison régulière, ce qui lui a valu le titre de MVP du segment de printemps des LCS NA 2016. Il a continué de dominer le segment d'été, permettant aux Immortals d'être toujours dans la course derrière l'équipe TSM, premiers durant toute la saison. Malgré leur domination dans la saison régulière, Reignover et les Immortals ont échoué lors des play-offs et des qualifications régionales. Au cours de l'événement All-Stars 2016, il va devoir de nouveau faire ses preuves et rappeler aux fans pourquoi il est l'un des meilleurs junglers du monde.</p>","de_DE":"Yeu-jin „Reignover“ Kim hat sowohl der EU LCS als auch der NA LCS seinen Stempel aufgedrückt. Nachdem er Fnatic 2015 zu einem Rekord von 18–0 geführt hatte, zog es Reignover über den großen Teich, um für die neu formierten Immortals zu spielen. Die Mannschaft war in der regulären Saison außerordentlich erfolgreich und Reignover wurde zum MVP des Frühjahrs-Split der NA LCS 2016 gewählt. Doch da die Immortals in der Nachsaison kein Spiel mehr gewinnen konnten, suchten die meisten Spieler, inklusive Reignover, ihr Glück bei anderen Mannschaften.\n<p>\nReignover wurde Team Liquids größte Neuverpflichtung in der Nebensaison, nachdem sie sich von ihrem Jungler, Dardoch, aufgrund von Problemen verabschiedet hatten. Als Teil der neuen Aufstellung von Team Liquid wird Reignover 2017 versuchen, seine Dominanz fortzusetzen. Zusammen mit der Rückkehr des AD-Carrys Piglet hat er dafür gesorgt, dass es die Fans von Team Liquid kaum noch erwarten können, bis der Frühjahrs-Split endlich beginnt. Egal, ob er seine Gegner mit Olaf in Stücke hackt oder sich mit Rek’Sai zum Sieg gräbt, Reignover wird eine verdammt gute Vorstellung abliefern.\n","es_ES":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los split de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores junglas del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviese un récord de 17-1 durante la temporada regular. Además, el jungla ganó el premio al mejor jugador del split de primavera de la LCS NA 2016. Durante el split de verano siguió dominando e hizo que Immortals le pisase los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en los playoffs y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores junglas del mundo.</p>","pt_BR":"<p>Yeu-jin “Reignover” Kim deixou sua marca na LCS NA deste ano. Apesar da Immortals não conseguir a vaga no Mundial, o desempenho de Reignover durante as duas etapas da temporada ficou na cabeça dos jogadores, deixando-o com 36% dos votos da Selva. Fãs claramente acreditam que, apesar de não ter aparecido no Mundial, o rapaz teria se saído tão bem quanto o restante dos melhores caçadores do mundo. </p>\n\n<p>Após sair da europeia Fnatic, Reignover tomou a América do Norte de assalto, liderando a recém-formada Immortals a uma temporada regular com um placar de 17 a 1 e recebendo o prêmio de Jogador Mais Valioso da Etapa de Primavera da LCS NA 2016. Ele continuou a dominar na Etapa de Verão, mantendo a Immortals na cola da líder, TSM, por toda a temporada. Apesar de dominar a fase regular, Reignover e a Immortals não conseguiram se dar bem nas Eliminatórias e classificatórias regionais. No Evento All-Star 2016, ele poderá nos mostrar do que é capaz novamente e lembrar seus fãs do porque ele é um dos melhores caçadores do mundo.</p>","cs_CZ":"<p>Yeu-jin „Reignover“ Kim během letošních bojů v severoamerickém LCS rozhodně nestál v koutě. Immortals se sice na MS nekvalifikovali, Reignoverovy výkony z jarního a letního splitu se ovšem do paměti účastníků hlasování vryly natolik, že získal v kategorii džunglerů 36 % hlasů. Fanoušci očividně věří, že i když se nezúčastnil MS, dokáže se bez obav poprat se světovou džunglerskou špičkou.</p>\n\n<p>Po svém odchodu z věhlasného evropského týmu Fnatic vzal Reignover Severní Ameriku útokem. Nově vytvořené Immortals dovedl k bilanci ze základní sezóny 17:1 a sám získal ocenění pro nejužitečnějšího hráče jarního splitu severoamerického LCS 2016. Jeho dominance pokračovala i v letní části soutěže, během níž Immortals neustále šlapali na paty prvním TSM. Navzdory úspěchům ze základní sezóny však Reignover a Immortals při play-off a regionálních kvalifikacích vypadli z formy. Na turnaji All-Star 2016 tak bude moci opět předvést, co umí, a připomenout fanouškům, proč je označován za jednoho z nejlepších džunglerů na světě.</p>","el_GR":"<p>Ο Yeu-jin “Reignover” Kim άφησε το σημάδι του στο φετινό LCS Βόρειας Αμερικής. Παρόλο που οι Immortals δεν κατάφεραν να προκριθούν στο Παγκόσμιο Πρωτάθλημα, η απόδοση του Reignover στο Spring Split και στο Summer Split έμεινε χαραγμένη στη μνήμη των ψηφοφόρων, με αποτέλεσμα να πάρει το 36% των ψήφων για το ρόλο του παίκτη ζούγκλας. Προφανώς, το κοινό πιστεύει ότι, αν τα κατάφερνε να εμφανιστεί στο Παγκόσμιο Πρωτάθλημα, ο Reignover θα τα πήγαινα μια χαρά σε μια αναμέτρηση με τους καλύτερους παίκτες ζούγκλας του κόσμου.</p> \n\n<p>Μετά την αποχώρησή του από τους Fnatic, μιας από τις ποιο ιστορικές ομάδες της Ευρώπης, ο Reignover γνώρισε τεράστια επιτυχία στη Βόρεια Αμερική όταν οδήγησε τους νεοφώτιστους Immortals σε ένα εκπληκτικό σερί 17-1 στην κανονική σεζόν, κατακτώντας στην πορεία και το βραβείο του MVP για το Spring Split 2016 του LCS Βόρειας Αμερικής. Η ασταμάτητη πορεία του συνεχίστηκε και στο Summer Split, με αποτέλεσμα να κρατήσει τους Immortals σε μικρή διαφορά από τους πρώτους TSM σε όλη τη διάρκεια της σεζόν. Παρά την καταπληκτική τους πορεία στην κανονική σεζόν, ο Reignover και οι Immortals δεν κατάφεραν να προχωρήσουν στα πλέι οφ και στους περιφερειακούς προκριματικούς. Στο Τουρνουά All-Star 2016, θα έχει την ευκαιρία να δείξει και πάλι τι αξίζει και να υπενθυμίσει στους φίλους του παιχνιδιού γιατί είναι ένας από τους καλύτερους παίκτες ζούγκλας στον κόσμο.</p>","hu_HU":"Yeu-jin „Reignover” Kim idén fontos szereplője volt az NA LCS-nek. Bár az Immortals nem jutott ki a vb-re, Reignover tavaszi és nyári teljesítménye olyan mély nyomott hagyott a szavazókban, hogy a dzsungelharcosokra leadott szavazatok 36%-a landolt nála. A rajongók szilárdan hisznek abban, hogy bár Reignover nem játszott a vb-n, állta volna a sarat a világ legjobb dzsungelharcosai ellen. \n</p>\nA legendás európai csapat, a Fnatic elhagyása után Reignover bevette Észak-Amerikát, az újonnan alakult Immortals élén 17-1-es eredményt ért el az alapszakaszban, és ő lett az NA LCS 2016-os tavaszi szakaszának legértékesebb játékosa (MVP). A nyári szakaszban is remekül folytatta, az Immortals végig az első helyen álló TSM nyakában loholt. Az alapszakaszbeli kiváló játékuk ellenére Reignover és az Immortals a rájátszásban és a regionális selejtezőkben is rosszul szerepelt. A 2016-os All-Star gálán ismét bizonyíthat, és megmutathatja, hogy ő a világ legjobb dzsungelharcosa.\n","it_IT":"Quest'anno Yeu-jin \"Reignover\" Kim ha davvero lasciato il segno nella LCS NA. Anche se gli Immortals non sono riusciti a qualificarsi per i Mondiali, le sue prestazioni durante lo Spring e il Summer Split hanno fatto decisamente colpo sui votanti, che lo hanno premiato con il 36% dei voti per la categoria Giungla. È evidente per i fan che, nonostante la sua assenza ai Mondiali, Reignover abbia le carte in regola per duellare con i giocatori da giungla più abili al mondo. </p>\n\nDopo aver lasciato lo storico team europeo di Fnatic, Reignover ha fatto furore in Nord America guidando i neonati Immortals a un record stagionale di ben 17-1, guadagnandosi il riconoscimento di MVP nello Spring Split LCS NA 2016. Il suo predominio è proseguito durante il Summer Split, in cui è riuscito a tenere la sua squadra sempre alle calcagna della capolista TSM per l'intera stagione. Nonostante le loro eccellenti prestazioni nella stagione regolare, Reignover e gli Immortals hanno ceduto durante i playoff e le qualificazioni regionali. Nell'All-Star 2016 Reignover potrà mostrare nuovamente le sue abilità e ricordare ai suoi ammiratori che rimane sempre uno dei migliori giocatori di giungla del mondo.\n\n","ro_RO":"Yeu-jin ''Reignover'' Kim și-a pus amprenta anul acesta pe LCS NA. Cu toate că cei din Immortals n-au reușit să se califice la Mondiale, reușitele lui Reignover din etapele de primăvară și de vară au rămas întipărite în mintea celor care l-au votat, obținându-i 36 la sută din voturile pentru junglă. E clar că fanii sunt de părere că, deși nu a participat la Mondiale, s-ar fi descurcat foarte bine împotriva celorlalți jungleri de top ai lumii. </p>\n\nDupă ce a părăsit Fnatic, echipa europeană care a făcut istorie, Reignover a luat cu asalt America de Nord și a reușit să conducă echipa nou-formată Immortals către un record de 17-1 în sezonul normal, obținând titlul de cel mai valoros jucător (MVP) în etapa de primăvară LCS NA 2016. A continuat să domine și în etapa de vară, Immortals rămânând foarte aproape de TSM, echipa de pe primul loc, de-a lungul întregului sezon. Însă chiar dacă și-au distrus adversarii în sezonul normal, cei din Immortals au dat greș în playoff-uri și la calificările regionale. La All-Star 2016, Reignover va avea șansa să demonstreze de ce e în stare și să le reamintească fanilor de ce e unul dintre cei mai buni jungleri din lume.\n","es_AR":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>","es_MX":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>"},"foreignIds":{"drupalId":"885","TRLH1":"200000242","TRLH2":"200000146"},"socialNetworks":{"twitch":"","facebook":"www.facebook.com/pages/Yeujin-Reignover-Kim/1572697482942877","twitter":"https://twitter.com/FnaticReignover"},"champions":[],"liveGameTeam":53},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":372,"slug":"inori","name":"Inori","firstName":"Rami","lastName":"Charagh","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inori-1sztspha.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:11.000Z","updatedAt":"2017-08-04T00:04:15.000Z","bios":{"en_US":"<p>Rami \"Inori\" Charagh is Phoenix1's fearless jungler. Phoenix1's 2016 NA LCS Summer Split looked like it was played by two entirely different teams. Before Inori joined, the team looked lost. After he arrived, they found a leader. While it wasn't enough to avoid the 2017 NA LCS Promotion tournament, Inori helped the team easily escape relegation.</p>","de_DE":"Rami „Inori“ Charagh ist der furchtlose Jungler von Phoenix1. Beim Sommer-Split der NA LCS 2016 von Phoenix1 hatte man das Gefühl, dass zwei komplett verschiedene Mannschaften an den Start gingen. Vor Inoris Beitritt wirkte das Team verloren. Aber mit ihm haben sie einen neuen Anführer gefunden. Auch wenn es nicht ganz gereicht hatte, das Aufstiegsturnier der NA LCS 2017 zu verhindern, konnten sie mit Inoris Hilfe dem Abstieg mit Leichtigkeit entgehen.\n<p>\nDamit können Inori und Phoenix1 den gesamten Split 2017 ohne Rückstand in Angriff nehmen. Wenn es die neue Mannschaft schafft, seinen aggressiven Spielstil im Dschungel mit Champions wie Rengar und Hecarim zu unterstützen, werden sie ein harter Gegner für jedes Team der NA LCS. Inori ist für seinen Raubtierinstinkt bekannt, und wenn er sich erst einmal einen Vorteil erarbeitet hat, wird er nicht zögern, seinem Gegner den Todesstoß zu versetzen.\n"},"foreignIds":{"drupalId":"2580","TRLH1":"200000233","TRLH2":"200000137"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":558,"slug":"mickey","name":"Mickey","firstName":"Youngmin","lastName":"Son","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mickey-emcoa162.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-05T21:03:01.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3190","ESPORTSTMNT06":"200000962","TRLH1":"200000719"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":626,"slug":"lourlo","name":"Lourlo","firstName":"Samson","lastName":"Jackson","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lourlo-fmal547y.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-29T02:26:38.000Z","bios":{"en_US":"<p>Samson \"Lourlo\" Jackson made his LCS debut in the 2016 NA LCS Spring Split when he was known as Lourlo. His previous experience with CLG Black prepared him for the jump from semi-pro to pro, and while he didn’t stand out, it’s hard to blame him - with Dardoch and Piglet on your team, it’s hard to get attention.</p>\n\n<p>Yet analysts and fans noticed Lourlo’s rock solid dedication. Even when Liquid had a rough game, Lourlo was playing his heart out. His commitment to constantly bettering himself led to him netting more consistent performances. He may not be the flashiest player on the Rift, but you’d be hard pressed to find anyone that works harder. Team Liquid kept him on board during their roster shuffle, cementing that they believe Lourlo still has heaps of potential that they’re keen to unlock.</p>","fr_FR":"<p>Sam « Lourlo » Jackson fait ses débuts dans les LCS NA en participant à ce segment de printemps 2016. Son expérience passée auprès de CLG Black l'a préparé pour son passage du statut de semi-pro à pro véritable, mais rien ne vaut un premier segment pour réellement faire la distinction entre le bon et la brute (ou le truand). Étant donné que Lourlo est actuellement en 26e place du serveur NA, il devrait à tout le moins être capable de s'affirmer au niveau des mécaniques de jeu.</p>\n<p>Nous n'avons pas vu Lourlo participer à un événement majeur de League of Legends depuis les Challenger Series du printemps 2015. Impossible de prévoir quel genre de nouveauté il pourrait apporter à la méta aujourd'hui ! D'après ses performances en file solo, il maîtrise une multitude de champions, parmi lesquels figurent Riven, Irelia, Nidalee et Rumble.</p>","pl_PL":"<p>\"Lourlo\" zaczął grać w League of Legends w pierwszym sezonie, lecz na grę w profesjonalnym zespole zdecydował się dopiero we wrześniu 2014 roku. Był jednym z założycieli drużyny Storm, wraz z takimi znanymi zawodnikami jak: Zachary \"mancloud\" Allan Hoschar i Terry \"BIG\" Chuong. Planowali zakwalifikować się do wiosennego sezonu NA LCS 2015, lecz Samson jeszcze nie miał wtedy skończonych 17 lat. Dlatego ostatecznie cała drużyna pozostała na scenie Kręgu Pretendenta. Jednak już w lutym 2015 roku zdecydował się grać w Challenger Series dla innej organizacji – Counter Logic Gaming Black. Nie osiągnął za wiele w ich szeregach, gdyż skończył wiosenny okres na 6 pozycji, co było dosyć przeciętnym wynikiem. Jednak \"Lourlo\" dokonał najważniejszej rzeczy dla niego samego – pokazał się wśród profesjonalistów. Swoimi wynikami w Challenger Series zachęcił poważną organizację, Team Liquid, do zaproszenia go do pierwszego składu. Sam powiedział, że gra w CLG Black pozwoliła mu zdobyć doświadczenie na profesjonalnej scenie i rozwinąć swój zasób bohaterów, co było niezbędne dla przejścia do wyższej ligi.</p>\n<p>W wywiadzie dla theScore eSports Samson opowiedział o swoich uczuciach związanych z objęciem tak odpowiedzialnej pozycji. Przyznał, że w tak wczesnym etapie jego kariery, taki „awans” to dla niego olbrzymia nobilitacja. Uważa, że dla debiutanta zastąpienie takiego weterana jak Diego \"Quas\" Ruiz to zaszczyt i jednocześnie wyzwanie. \"Lourlo\" przyznał, że „ma nadzieję, że sprosta tej próbie sił i dowiedzie swoich umiejętności wśród najlepszych zawodników”. Wiele osób opisuje Samsona jako niezwykle agresywnego top-lanera, który zawsze podejmuje próbę carrowania swojej drużyny. Jednak zaraz po dołączeniu do Team Liquid, on sam zaznaczył, że dostosuje się do nowego zespołu i jeśli zajdzie potrzeba zmieni swój styl gry. Wywiad podsumował stwierdzeniem, że w wiosennym sezonie NA LCS 2016 da z siebie wszystko. </p>\n<p>Pseudonim Samsona pochodzi z czasów kiedy grał w inne gry. Spędzał tak czas ze swoim bratem, który jest profesjonalnym zawodnikiem innych komputerowych tytułów. Na swoją pozycję najbardziej lubi wybierać Nidalee i Irelię, ponieważ docenia ich możliwości w agresywnych zagraniach. Wojowniczym postaciom na top-lanie zawdzięcza wejście do Kręgu Pretendenta w Ameryce Północnej. Jednak, gdy pojawia się konieczność, świetnie sobie radzi takimi bohaterami jak Sion czy Maokai. </p>\n","de_DE":"Sam „Lourlo“ Jackson gab sein LCS-Debüt im Frühjahrs-Split der nordamerikanischen LCS 2016. Seine Erfahrungen mit CLG Black haben ihn auf den Sprung vom Halbprofi zum Profi vorbereitet und obwohl er keine überragende Leistung ablieferte, kann man ihm nichts vorwerfen – wenn Dardoch und Piglet in deiner Mannschaft sind, ist es schwer, Aufmerksamkeit zu erregen.\n</p>\nDennoch fiel den Analysten und Fans Lourlos unglaubliches Engagement auf. Selbst in schwierigen Spielen gab Lourlo alles. Seine Hingabe, sich ständig selbst zu verbessern, führte dazu, dass er immer beständigere Leistungen ablieferte. Er ist vielleicht nicht der auffälligste Spieler in der Kluft, aber man muss schon ziemlich lange suchen, um jemanden zu finden, der härter arbeitet als er. Team Liquid hat an Lourlo festgehalten und die Entscheidung damit gerechtfertigt, dass er ihrer Meinung nach noch unglaublich viel Potenzial hat, das sie gerne entfesseln würden.\n"},"foreignIds":{"drupalId":"3814","TRLH1":"200000241","TRLH2":"200000145"},"socialNetworks":{"twitch":"http://www.twitch.tv/lourlo","twitter":"https://twitter.com/LiquidLourlo"},"champions":[],"liveGameTeam":53},{"id":751,"slug":"ssumday","name":"Ssumday","firstName":"Chan-ho","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssumday-h9yau0jj.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-27T01:00:31.000Z","bios":{"en_US":"<p>Chan-ho \"Ssumday\" Kim is a feared top laner -- and justifiably so. Widely regarded as one of the world’s premier top laners, Ssumday spent a majority of his career with KT Rolster before becoming one of the most sought after free agents of 2016 and moving to North America to join up in the rebirth of Team Dignitas.</p>\n\n<p>Ssumday’s insanely deep champion pool gives the opposition no chance to shut him down in picks and bans. He poses a serious threat no matter the champion. Need him to tear apart the enemy with magic? Give him Ryze. Oh, you needed a tank to help lock down those pesky damage dealers? Gift him Maokai. Need to cut tanks down to size? Let him slice and dice with Fiora. Sometimes, it feels like Ssumday leaves you with just one option: lose.</p>","fr_FR":"<p>Sur la voie du haut, KT Rolster dispose de Chan-ho « ssumday » Kim, l'un des jeunes loups coréens, tout juste âgé de 19 ans. En dépit de sa jeunesse, ssumday est redouté, et à juste titre. Ssumday a été élu meilleur joueur du Segment d'été des LCK 2015 avec un ratio KDA de 5,22 qui le place en tête du Segment. Concédez-lui un mètre, il vous prend un kilomètre. Essayez, si vous ne me croyez pas.\n</p>\n<p>\nSsumday est efficace avec les mages et les combattants, mais au cours du Segment d'été des LCK c2015, il a surtout dominé avec des tanks. À plusieurs reprises, il a pris KT Rolster sur ses épaules et l'a portée jusqu'à la ligne d'arrivée. S'il met les mains sur Maokai ou Shen, vous devez préparer de quoi vous désengager, parce que ssumday vous poursuivra jusqu'aux extrémités de la carte pour réussir une élimination.\n</p>","pl_PL":"<p>Górny KT Rolster, Chan-ho „ssumday” jest jednym z najmłodszych Koreańczyków – ma Tylko 19 lat. Pomimo młodego wieku ssumday jest niezwykle przerażającym górnym – i całkiem słusznie. Został on wybrany najlepszym graczem letniego splitu LCK 2015, zajmując 1. miejsce ze stosunkiem zabić do zgonów wynoszącym 5,22. Jeżeli dacie mu dłoń, weźmie całą rękę. I to nie jest przesada.\n</p>\n<p>\nSsumday gra niezwykle skutecznie magami i wojownikami, ale większość meczów podczas letniego splitu LCK 2015 rozegrał obrońcami. Wiele razy ciągnął ze sobą całe KT Rolster i doprowadzał ich do linii mety. Jeżeli uda mu się dorwać Maokaia lub Shena, lepiej, żeby wasza drużyna miała jakiś sposób na przerwanie walki, ponieważ ssumday będzie was ścigał na kraniec świata, aby zagwarantować zabójstwo.\n</p>","de_DE":"Chan-ho „Ssumday“ Kim ist ein gefürchteter Top-Laner – und das zu Recht. Ssumday gilt als einer der besten Top-Laner der Welt und hat den Großteil seiner Karriere bei KT Rolster verbracht, bevor er 2016 zu einem der begehrtesten mannschaftslosen Spieler wurde und nach Nordamerika zog, um Teil der Wiedergeburt von Team Dignitas zu werden.\n</p>\nSsumdays unglaublich umfangreicher Championpool macht es seinen Gegnern nahezu unmöglich, ihn aufzuhalten. Er ist immer eine Gefahr, egal, mit welchem Champion er spielt. Soll er die gegnerische Mannschaft mit Magie vernichten? Gib ihm einfach Ryze. Oh, du brauchst einen Tank, der die lästigen Schadensverursacher ausschaltet? Gib ihm Maokai. Brauchst du jemanden, der die Tanks unschädlich macht? Gib ihm Fiora und sieh dabei zu, wie er sie in Stücke schneidet. Wenn du ihn nicht mit Bannen unschädlich machst, bleibt dir meistens nur noch eine Option: verlieren.\n","es_ES":"<p>Chanho \"ssumday\" Kim es uno de los jugadores más jóvenes del panorama competitivo de Corea del Sur, con sólo 19 años. A pesar de su juventud, es un top temido por sus enemigos -- y con razón. Ssumday fue elegido mejor jugador del Split de verano de 2015 con un KDA de 5.22 a lo largo de la temporada. </p>\n\n<p>Ssumday rinde tanto con magos como luchadores, pero en el Split de verano de la LCK 2015 donde mejor ha rendido ha sido con tanques. No han sido pocas las veces en las que se ha echado el equipo a la espalda y lo ha llevado a la victoria. Si consigue jugar con Maokai o Shen, más vale que escojas campeones que puedan quitártelo de encima, porque ssumday te perseguirá hasta el fin del mundo si hace falta para acabar contigo. </p>\n","pt_BR":"<p>O topo da KT Rolster, Chan-ho \"ssumday\" Kim, é uma das jovens armas da Coreia, com apenas 19 anos de idade. Apesar de novo, ssumday é um topo muito temido - e isso é justificável. Ele foi votado como o Melhor Jogador da LCK de Verão 2015, sendo campeão de A/M/A com 5.22 durante a etapa. Dê um centímetro de espaço, e ele pegará um quilômetro. E não, não foi uma piada.\n</p>\n<p>\nSsumday é competente com magos e lutadores, mas a maioria de suas atuações dominantes na LCK de Verão em 2015 foi com tanques. Em múltiplas ocasiões ele colocou a KT Rolster nas costas e carregou até a linha final. Se ele colocar as mãos no Maokai ou no Shen, tenha a certeza de que você vai trazer um pouco de contra-iniciação, porque Ssumday vai te caçar até o fim do mundo.\n</p>"},"foreignIds":{"drupalId":"2147","TRLH1":"200000192","TRLH2":"200000096"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":777,"slug":"dardoch","name":"Dardoch","firstName":"Joshua","lastName":"Hartnett","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dardoch-h91p55co.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:26:47.000Z","updatedAt":"2017-08-04T00:04:43.000Z","bios":{"en_US":"Joshua “Dardoch” Hartnett is a true competitor. He demonstrated that in his impressive rookie season that saw him carry and trash talk with the best of them. But his obsession with winning over all else caused problems during a tumultuous Summer Split for Liquid, and he was forced off the team.\n</p>\n<p>Talent has never been a question for Dardoch. If he can work his team, his competitive drive could carry them to new heights.</p>\n\n","de_DE":"Joshua „Dardoch“ Hartnett ist ein echter Wettkämpfer. In seiner beeindruckenden ersten Saison hat er gezeigt, dass er Spiele im Alleingang entscheiden und auch die Besten der Besten gegen die Wand reden kann. Aber seine Versessenheit darauf, um jeden Preis zu gewinnen, hat während des turbulenten Sommer-Splits für Probleme bei Liquid gesorgt, weshalb er auch aus dem Team geworfen wurde.\n</p>\nDie Immortals bieten Dardoch im Jahr 2017 die Chance auf einen Neuanfang. Nach den Umbrüchen in der gesamten NA LCS ist der Titel des Frühjahrs-Splits 2017 reif für die Ernte. Dardochs Talent steht außer Frage. Wenn er mit seinem neuen Team harmoniert, könnte er den Immortals mit seiner wettkampforientierten Einstellung zu neuen Höchstleistungen verhelfen.\n"},"foreignIds":{"drupalId":"3835","TRLH1":"200000216","TRLH2":"200000120"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":967,"slug":"big","name":"Big","firstName":"Terry","lastName":"Chuong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/big-9eh6ixp9.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:09:32.000Z","updatedAt":"2017-06-14T20:10:51.000Z","bios":{"fr_FR":"<p>Terry « BIG » Chuong, connaît déjà les LCS NA, mais seulement en tant que remplaçant.</p> \n\n<p>Celui qui se faisait auparavant appeler « Baby » a découvert les studios des LCS lors de la 11e semaine du segment d'été de la saison 2014 au sein de CLG, en remplacement des joueurs de l'équipe première partis s’entraîner en Corée du Sud. Il est ensuite retourné acquérir de l'expérience au sein de la scène challenger nord-américaine chez Storm, au côté de Samson « Lourlo » Jackson, à présent top laner de Team Liquid, et Zachary « Mandatorycloud » Allan, ancien mid laner de XDG. Puis retour en LCS en 2015 lors des trois premiers matchs du segment d'été en tant que support de Team Dragon Knight. Une expérience difficile pour le joueur dans une équipe réunie à la va-vite en raison de l'impossibilité pour l'organisation de faire venir ses titulaires en NA à temps pour le début de la saison.</p>\n\n<p>Pas dégoûté du monde professionnel pour autant, Big est derechef retourné sur la scène challenger, cette fois au sein d'Imagine. Equipe dans laquelle le joueur s'est retrouvé support d'un carry AD français, Pierre « Steeelback » Medjald, fraîchement débarqué en NA après la fin de son contrat chez Fnatic. Une opportunité sans nulle doute formatrice pour le joueur, même s'il n'a pas réussi à se qualifier en LCS avec cette équipe, défaite 3 victoires à 1 par Team 8 lors du tournoi de promotion. </p>\n\n<p>Qu'à cela ne tienne, Baby est aujourd'hui de retour en LCS NA, enfin en tant que titulaire. Il est certes une fois de plus dans un effectif qui pose plus de questions qu'il n'apporte de certitudes, mais ça n'en reste pas moins une occasion en or pour lui de montrer quel est véritablement son niveau. </p>\n","en_US":"<p>\nYou may know Terry “Big” Chuong from his time spent on Team Dragon Knights. While the organized LCS competition tore TDK apart, Big’s presence in the bot lane did not go unnoticed. He caught the eye of Echo Fox, and was brought on board for the 2016 NA LCS Spring Split.\n</p>\n<p>\nBig has proven to be a protector down to his very bones -- Alistar, Janna, and Braum were his supports of choice. But FOX had their fair share of struggles in spring. Now with a new shot in Dignitas's bot lane, he'll have to prove he's up to the challenge.\n</p>","pl_PL":"<p>Terry bardzo wcześnie zaczął swoją przygodę w wirtualnym świecie, ponieważ w wieku 8 lat już czuł się tam jak ryba w wodzie. Był zafascynowany League of Legends od wydania wczesnej bety, w szczególności uwielbiał grać Heimerdingerem. Sceną esportową zainteresował się dopiero za sprawą prośby przyjaciela żeby zajął pozycję junglera w jego drużynie. „BIG” doskonale się wtedy sprawdził w profesjonalnych meczach, w związku z czym podjął wyzwanie osiągnięcia czegoś w tej dziedzinie. Od października 2013 roku do stycznia 2016 roku starał się znaleźć drużynę, wraz z którą dostanie się do NA LCS. Nie powiodło mu się, ale wielokrotnie był o włos od tego wyczynu. Jednak szczęście mu dopisało i został zauważony przez swoich przeszłych przeciwników – Team Dragon Knights. Dzięki temu miał okazję zostać substytutem dla ich supporta w pierwszych tygodniach letniego sezonu NA LCS 2015. Zyskał bezcenne doświadczenie w profesjonalnej lidze, lecz nie udało mu się spełnić marzeń. Kolejny raz los uśmiechnął się do niego w styczniu 2016 roku kiedy został zaproszony do głównego składu nowo utworzonej drużyny Echo Fox. Pod lisim sztandarem zadebiutował w rozgrywkach NA LCS 2016 w okresie wiosennym.</p>\n<p>Urodzony w Los Angeles, w Kaliforni, wcześniej w karierze znany jako „Baby”, Terry nie jest dedykowanym supportem. Lubi zajmować rolę wspierającego w drużynie, lecz na początku swojej kariery doskonale odnalazł się w jungli. Ponadto oświadczył, że aktualnie, jeśli by nie grał na bot-lanie to zdecydowałby się na objęcie pozycji mid-lanera. Póki co „BIG” dobrze się czuje w roli wspierającego, w szczególności jeżeli kompozycja drużyny pozwala mu na wybór bohatera o olbrzymiej ilości punktów zdrowia. Gustuje w postaciach takich jak Thresh, Braum i Nautilus. Styl gry Terry’ego najlepiej charakteryzuje zawrotna ilość asyst podczas rankingowych meczów – jak na prawdziwego supporta przystało.</p>\n"},"foreignIds":{"ESPORTSTMNT02":"200000673","TRLH1":"200000614"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":969,"slug":"matt","name":"Matt","firstName":"Matt","lastName":"Elento","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/matt-g07k92st.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:10:14.000Z","updatedAt":"2017-01-29T02:27:14.000Z","bios":{"en_US":"<p>Matt \"Matt\" Elento is a Hawaiian who often wears a huge smile and a relaxed attitude. If you saw him out of game, you might not realize that you’re looking at one of the best Bard players around. Stand near a wall? Matt’s going to get you. Group up in a bad location? Ult incoming. Playing a mechanically intensive and unorthodox champion is rough at the best of times -- now imagine you’re doing it in your rookie season, and oh yeah, you’re playing with a World Champion in your lane. Welcome to Matt’s life.</p>\n\n<p>Matt has proven that he has big play potential on the LCS stage, but he has admittedly questioned his own decision making in game which lead to fluctuating performances in the 2016 NA LCS Summer Split. If the first step to fixing yourself is admitting your faults, Matt is well on his way to improving his play. He comes into 2017 with his explosive laning buddy Piglet back by his side and has the chance to make good on his promises to improve. He has the ability to make electric plays -- now it’s time to hit the Rift and prove it.</p>\n\n<p>Learn more about Matt in his <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">Drive documentary.</a></p>","de_DE":"Matt „Matt“ Elento ist ein Hawaiianer, der meistens mit einem breiten Grinsen und einer entspannten Grundhaltung zu sehen ist. Wenn man ihm außerhalb des Spiels begegnet, merkt man nicht, dass man gerade vor einem der besten Bard-Spieler der Welt steht. Du stehst neben einer Mauer? Matt wird dich schnappen. Du hast dich mit deinem Team an einem schlechten Ort versammelt? Schon kommt der Ult. Es ist meistens schwierig, einen mechanisch anspruchsvollen, unkonventionellen Champion zu spielen – und jetzt stell dir vor, du machst das in deiner ersten Saison und dein Partner auf der Lane ist ein Weltmeister. Willkommen in Matts Leben.\n</p>\nMatt hat auf der Bühne der LCS bewiesen, dass er großes Potenzial hat, aber er hat auch seine eigenen Entscheidungen im Spiel hinterfragt, die zu durchwachsenen Leistungen im Sommer-Split der NA LCS 2016 geführt haben. Wenn der erste Schritt zur Besserung die Selbsterkenntnis ist, dann ist Matt auf dem besten Weg, sich als Spieler zu verbessern. 2017 hat er mit Piglet einen explosiven Partner auf der Lane und die Chance, sein Versprechen, sich zu verbessern, in die Tat umzusetzen. Er ist imstande, elektrisierende Spielzüge auszuführen – und jetzt wird es Zeit, sein Können in der Kluft unter Beweis zu stellen.</p>\n<p>Erfahre mehr über Matt in seiner  <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">DRIVE-Geschichte.</a></p>"},"foreignIds":{"TRLH1":"200000245","TRLH2":"200000149"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":2081,"slug":"insanity","name":"Insanity","firstName":"David","lastName":"Challe","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/insanity-5ba0sw13.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-07-28T01:25:57.000Z","updatedAt":"2017-07-28T01:42:26.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":53}],"scheduleItems":[{"id":"AVmEyNUUoUG4HPFjOKHI","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:2c1919bd-6652-47ac-aa6a-1538208b4e90","scheduledTime":"2017-03-17T22:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4","blockLabel":"8","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:95ada0b9-bece-48cc-bd48-d9ee5bde901e"},"match":"2c1919bd-6652-47ac-aa6a-1538208b4e90","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"95ada0b9-bece-48cc-bd48-d9ee5bde901e","league":"2"}],"gameIdMappings":[{"id":"6325ca6d-62c5-4a4f-9e0a-9f396cfff97c","gameHash":"4a22c23cec501d07"},{"id":"583d1a49-ed8d-414a-b809-cf4b37e1d229","gameHash":"3a5b38117ca9fa2c"}],"videos":[{"id":6150,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:6325ca6d-62c5-4a4f-9e0a-9f396cfff97c","source":"https://www.youtube.com/embed/2eDVax2UeyM?wmode=transparent","createdAt":"2017-03-17T23:51:00.000Z","updatedAt":"2017-03-17T23:51:00.000Z","game":"6325ca6d-62c5-4a4f-9e0a-9f396cfff97c"},{"id":6152,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:583d1a49-ed8d-414a-b809-cf4b37e1d229","source":"https://www.youtube.com/embed/YFJO5bDukTM?wmode=transparent","createdAt":"2017-03-18T02:06:35.000Z","updatedAt":"2017-03-18T02:06:35.000Z","game":"583d1a49-ed8d-414a-b809-cf4b37e1d229"}],"htmlBlocks":[],"match":{"id":"2c1919bd-6652-47ac-aa6a-1538208b4e90","name":"DIG-vs-TL","position":35,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}],"games":{"9e7ade43-bcda-4bea-8b6e-72653b942425":{"id":"9e7ade43-bcda-4bea-8b6e-72653b942425","name":"G3","generatedName":"DIG|TL|G3|2c1919bd665247acaa6a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6325ca6d-62c5-4a4f-9e0a-9f396cfff97c":{"id":"6325ca6d-62c5-4a4f-9e0a-9f396cfff97c","name":"G1","generatedName":"DIG|TL|G1|2c1919bd665247acaa6a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}],"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489794453761,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489790724819,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120028","gameRealm":"TRLH1","platformId":"TRLH1:1002120028","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"583d1a49-ed8d-414a-b809-cf4b37e1d229":{"id":"583d1a49-ed8d-414a-b809-cf4b37e1d229","name":"G2","generatedName":"DIG|TL|G2|2c1919bd665247acaa6a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"},{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489802951763,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489794015835,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120031","gameRealm":"TRLH1","platformId":"TRLH1:1002120031","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489802951769,"source":"bestOf","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489794453762,"source":"bestOf","closed":true},{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"2eb88abb-b73c-42b1-8097-4e960a90143a"}]],"timestamp":1489794015835,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"2eb88abb-b73c-42b1-8097-4e960a90143a":0,"7a645a6c-d674-4273-96e3-9c2ec980c59f":1}}}