{"teams":[{"id":26,"slug":"sk-gaming","name":"SK Gaming","guid":"be6c91c6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/sk-gaming-ai9aqsix.png","acronym":"SKG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"http://assets.lolesports.com/team/sk-gaming-hn9jn4b4.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2016-02-12T18:43:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"67"},"players":[219,240,802,1116,1117,1118,1119],"starters":[219,240,1116,1118,1119],"subs":[802,1117]},{"id":55,"slug":"fc-schalke-04","name":"FC Schalke 04","guid":"be6cad42-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fc-schalke-04-h992ofkj.png","acronym":"S04","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-07-06T22:27:08.000Z","bios":{"en_US":"<p>\nFC Schalke 04 bought Elements’  EU LCS seed just before the beginning of the 2016 EU LCS Summer Split. The team's remained largely the same, aside from a key addition in the mid lane with Hampus “Fox” Myhre. \n</p>\n<p>\nSchalke has a long history in organized sports, dating back to the early 1900s. This marks their first foray into the world of League of Legends esports. With a group that finished 7th last split, Schalke is looking to turn around the team’s fortunes and carve a name for themselves in the esports world.\n</p>\n<p>\nCoach: Michael \"Veteran\" Archer\n</p>","pl_PL":"<p>Organizacja, która istnieje dzięki zaangażowaniu graczy udzielających się w League of Legends od jej początków. Drużyna Elements powstała z Alliance, po której odziedziczyła miejsce w wiosennym sezonie EU LCS 2015. Przymusowa przemiana była spowodowana zmianami praw dotyczących zespołów, zbiegła się również ze zmianami w składzie osobowym drużyny. W sezonie piątym cała drużyna został zbudowana w około Henrika \"Froggen\" Hansena, jednego z najpopularniejszych graczy Europy. Stworzeniu organizacji towarzyszyła ciekawa i bardzo oryginalna kampania reklamująca jej członków. W sieci pojawiła się seria zdjęć przedstawiająca buty każdego z zawodników, dzięki czemu część z nich została rozpoznana przez fanów przed oficjalnym ogłoszeniem całej ekipy. Pojawił się również ich znak firmowy – logo przedstawiające pięć żywiołów. Dzięki znanym i lubianym graczom, którzy znaleźli się w szeregach organizacji, rzesza wielbicieli kibicowała kolejnym ujawnianym informacjom o powstającej drużynie.</p>\n<p>\nPo nowo utworzonej organizacji fani spodziewali się wyników, które zagwarantują Elements podium. Niestety rzeczywistość i poważna konkurencja zweryfikowały te oczekiwania. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 żywiołowej ekipie poszło przeciętnie. Dwukrotnie znaleźli się na siódmej pozycji mało imponującym wynikiem 7:11. Zwolennicy nie byli w pełni zawiedzeni, gdyż zespół Elements nie radził sobie najgorzej na tle innych drużyn. Jednak wszyscy, analitycy i fani, spodziewali się dużo więcej po tak hucznie ogłoszonym składzie graczy. Pozytywnym aspektem ich pozycji było znalezienie się poza trzema zespołami trafiającymi do rozgrywek relegacyjnych. Niestety będąc na siódmym miejscu nie mogli wziąć udziału w meczach barażowych.</p>\n<p>\nWłaściciel organizacji Elements, Jacob Toft-Andersen, w sezonie piątym starał się żeby polepszyć wyniki swojej drużyny. Wiele zmian osobowych wynikało z jego troski, lecz prawdopodobnie w tym okresie było ich zbyt dużo. Na przykład po wiosennym sezonie został wymieniony cały skład, oprócz mid-lanera.  Zawodnicy nie zdążyli się zgrać, w efekcie czego nie poprawiła się ani pozycja ani kondycja zespołu. Ostatecznie nie był zadowolony z osiągnięć Elements, w związku z czym podjął próbę sprzedania miejsca w wiosennym sezonie EU LCS 2016. Nieszczęśliwie dla Jacoba, nie znalazł się żaden chętny. Dlatego zdecydował się podjąć wyzwanie w czołowych europejskich rozgrywkach w 2016 roku. </p>\n","de_DE":"<p>Nachdem Alliance als erstes Team seit Entstehung der LCS Fnatic vom ersten Platz stieß, kam der Namenswechsel zum heutigen Elements. Mit lediglich einem Wechsel der Schützen Position von Erik \"Tabzz\" Van Helvert auf Martin \"Rekkles\" Larsson sollte ein Team entstehen, das fortan die europäische Liga dominieren sollte. Zu den erwünschten Resultaten kam es jedoch nie. Seit der Entstehung Anfang 2015 wurden nur mittelmäßige Erfolge erzielt. </p>\n<p><h2>Änderung sind nötig</p></h2>\n<p>Schon zum Spring Split 2015 nahm das Team um den damaligen Captain Henrik \"Froggen\" Hansen erste Änderungen vor, nachdem es das Team nicht schaffte, sich vom Mittelfeld im Ranking zu lösen. Ergebnis des Splits: Ein siebter Platz und damit verbunden erste große Spielerwechsel. Es wurden abgesehen von der Mitte und dem Support alle Positionen ausgetauscht, weiterhin mit Froggen als Kernspieler. Zu diesem Zeitpunkt stieß mit Hampus \"promisQ\" Abrahamsson, erstmals ein unbeschriebenes Blatt, zum Team. </p>\n<p>Die Resultate blieben weiterhin nicht zufriedenstellend. So hatte das Team nach einem erneuten siebten Platz im Summer Split keine Chance mehr, sich bei den Playoffs für die Weltmeisterschaft zu qualifizieren. Weitere Änderungen in der Teamaufstellung waren also schon zu erwarten. </p>\n<p><h2>Eine Legende verschwindet</p></h2>\n<p>Das Team hat nun seine bisher größte Änderung erfahren. Mit dem Wechsel von vier Spielern, darunter auch Froggen, ist die neue Stärke nur sehr schwer einzuschätzen. Bisher war eines der großen Probleme, dass das Team die Spiele möglichst in die Länge ziehen musste, um einen Sieg zu erreichen. Die neue Aufstellung sollte nun eine gute Gelegenheit bieten, mit neuen Taktiken in die Kluft der Beschwörer zu ziehen. Mit Patrick \"Nyph\" Funke steht in jedem Fall ein sehr erfahrener Spieler als Coach hinter den Spielern. </p>\n<p>Die sechste Saison wird in jedem Fall eine große Herausforderung werden. Elements wird als einer der Underdogs ins Rennen gehen und sich seinen Platz hart erkämpfen müssen. Die Priorität sollte darauf liegen, sich erst einmal aufeinander einzuspielen und mit gutem Teamwork zu überzeugen. Erst nachdem die Spieler gewisse Konsistenz unter Beweis gestellt haben, würde sich eine weitere Spezialisierung auf die Konkurrenz lohnen. </p>\n<p> Im Sommer wurde das Team nun von dem Bundesliga-Club Schalke 04 übernommen und dadurch größte Aufmerksamkeit erreicht. Wie sich das neue Team schlagen wird, muss man in den nächsten Wochen beobachten.</p>\n<p>Zu hoch gesteckte Ziele haben in der Vergangenheit eher einen gegenteiligen Effekt zum gewünschten Erfolg gebracht. Stattdessen haben die Spieler nun die Chance, bei niedrigen Erwartungen die Zuschauer zu überraschen. </p>\n","es_ES":"<p>Elements es uno de los equipos con más historia dentro de la LCS EU, historia que se remonta hasta CLG.EU en el año 2012. Como Alliance en 2014 consiguieron la victoria en los playoffs de verano de la LCS EU 2014, lo que los coronó como el mejor equipo de Europa por aquel entonces, y un equipo a tener en cuenta en el Campeonato Mundial de ese mismo año. Pero todo se vino abajo cuando fueron eliminados en la fase de grupos al perder con el equipo brasileño KaBuM! e-Sports, algo que todavía queda en la memoria de los aficionados.</p>\n\n<p>2015 no empezó mejor para el equipo europeo que después de ganar la LCS no pudo pasar del séptimo puesto en el Split de primavera de 2015, algo decepcionante que hizo retumbar los cimientos de la organización. El Split de verano iba a ser otro nuevo comienzo para Elements, pero no pudieron más que repetir la séptima posición. Para esta nueva temporada todo ha cambiado, en la LCS 2016 Elements busca una nueva dirección. ¿Conseguirán reconducir la dinámica negativa de la última temporada?</p>","fr_FR":"<p>Le FC Schalke 04 a une histoire très riche. Ce club sportif allemand a fêté son centenaire en 2004 et est le deuxième plus grand club d’Allemagne. Rien que ça. Plus de 100 000 membres y sont licenciés et le club possède des sections dans les plus grandes disciplines sportives comme le basket-ball, le handball, l’athlétisme, le tennis de Table et évidemment le football. Et depuis le mois de mai 2016, le FC Schalke 04 a mis un pied dans l’e-sport en choisissant d’investir dans une équipe League of Legends, rachetant l’équipe Elements et devenant le second club sportif à acheter une équipe League of Legends après l’équipe turque Beşiktaş au début de l’année 2015.</p> \n\n<p>Seul un joueur a été remplacé lors de la transition : le Français Jérémy « Eika » Valdenaire, au profit du Suédois Hampus « Fox » Myhre. Fox rejoint donc le cinq majeur dont les autres membres sont le Français Etienne « Steve » Michels au top, l’Allemand Berk « Gilius » Demir dans la jungle, le Danois Rasmus « MrRallez » Skinneholm en botlane et le Suédois Hampus « sprattel » Abrahamsson en support.</p>  \n\n<p>Ces joueurs vont pouvoir profiter d’un encadrement expérimenté qui devrait les mettre dans les meilleures conditions pour préparer leur saison. Le centre de formation de l’équipe de football a formé certains des meilleurs joueurs du monde, le club sait donc comment donner les armes à ses joueurs pour exprimer leur plein potentiel. L’avenir nous dira si le même destin attend la section League of Legends !</p> \n"},"foreignIds":{"drupalId":"3659"},"players":[233,490,824,1337,1376,1377,1752,2013],"starters":[233,824,1337,1376,1377],"subs":[490,1752,2013]}],"players":[{"id":219,"slug":"unlimited","name":"Unlimited","firstName":"Petar","lastName":"Georgiev","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/unlimited-bgxn0m2c.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:02.000Z","updatedAt":"2016-09-23T00:20:16.000Z","bios":{"en_US":"","es_AR":"<p>Petar \"Unlimited\" Georgiev es el soporte suplente de G2 Esports.</p>"},"foreignIds":{"drupalId":"1105","TRLH3":"1001000066","TRLH4":"1001000066","FRA1TMNT1":"375401","TRLH2":"1001280069","FRA1TMNT2":"25366","TRLH1":"1001380099"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":233,"slug":"smittyj","name":"Smittyj","firstName":"Lennart ","lastName":"Warkus","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smittyj-8owo56ml.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2017-03-28T15:13:21.000Z","bios":{"en_US":"<p>\nLennart \"SmittyJ\" Warkus isn't afraid to hop, jump, dive, or charge his way into the enemy team. SmittyJ's aggression often has a purpose though -- if he causes enough chaos in the enemy ranks, his teammates can cut through them like a knife through warm butter.\nUnfortunately for SmittyJ, his dives often leave him up the proverbial creek without a paddle. Or, maybe more accurately, stranded in the Baron pit without a dash to escape over the wall. \n</p>\n<p>\nAfter a short stint in North America with Team Dignitas, Smittyj headed home to Europe to compete with Giants Gaming. They hope to turn his aggression into something special, but his aggression may be punished heading into his first full EU LCS Split.\n</p>","fr_FR":"<p>Lennart « Smittyj » Warkus est le nouveau top laner de Dignitas, tout droit débarqué des Challenger series... européennes ! Comme de nombreux joueurs professionnels et semi-professionnels ces dernières années, Smittyj a traversé l'Atlantique pour rejoindre une équipe nord-américaine.</p>\n\n<p>Auparavant, ce joueur allemand de 19 ans a passé pas loin de deux ans à arpenter la deuxième division professionnelle dans l'espoir de percer au plus haut niveau. En saison 4, avec SK Prime, le jeune joueur est parvenu à se qualifier en deuxième position pour le tournoi de promotion/relégation, mais a dû s'avouer vaincu face à des Gambit Gaming largement supérieurs. Même scénario lors du segment de printemps de la saison 5, cette fois en tant que top laner de Gamers 2. Pire, lors de cette saison des Challenger series, Smittyj et ses camarades n'ont même pas réussi à se qualifier pour le tournoi de promotion/relégation, ratant la 3e place qualificative de peu, lors d'une défaite 2 victoires à 1 face à Reason Gaming.</p>\n\n<p>Qu'à cela ne tienne, l'Allemand ne s'est pas découragé et a eu de nouveau l'occasion de toucher le graal à l'issue de la saison estivale des Challenger series de la saison 5. Une fois de plus, son équipe et lui ont perdu en demi-finale des play-offs face à Dignitas, par la suite qualifiée aux LCS EU, mais ils ont cette fois su se reprendre à temps pour arracher la troisième place qualificative des mains de Denial Esports. Au niveau individuel, Smittyj en a profité pour remporter sa voie par deux fois face à Mike « Wickd » Petersen, ancienne gloire de League of Legends. Tout un symbole.\nAutre symbole, la victoire de Gamers 2 et SmittyJ en tournoi de relégation face à l'une des plus anciennes organisations européennes du jeu, SK Gaming, vaincus 3-2 et boutés hors des LCS par le jeune top laner et ses coéquipiers.</p>\n\n<p>Sa qualification au plus haut niveau enfin en poche, Smittyj aurait pu tranquillement se préparer à découvrir les LCS EU, mais il a préféré repartir à nouveau à l'aventure, cette fois sur le serveur nord-américain au sein de l'équipe Dignitas, ce qui implique forcément beaucoup plus de pression de la part des fans et du grand public. Changement de rythme assez brutal pour le joueur qui, avec son manque d'expérience en LCS, peine à obtenir des résultats suffisants dans l'écurie Dignitas. Peu à peu, son style de jeu se confirme et bientôt, SmittyJ devient un joueur agressif, n'ayant pas peur de s'engouffrer dans des situations hasardeuses sur la voie du haut.</p>\n\n<p>Après une année en dents de scie en Amérique, le joueur revient en Europe en tant que toplaner titulaire pour les Giants Gaming. SmittyJ est prêt à relever le défi une nouvelle fois, avec une place en LCS Europe qu'il a longuement attendu.</p>\n","pl_PL":"<p>Lennart \"Smittyj\" Warkus  jest członkiem profesjonalnych drużyn League of Legends od początku czwartego sezonu. Zaczynał w lutym 2014 roku, w mało znanej drużynie COREPLAY, lecz już po miesiącu trafił do SK Gaming Prime. Pod skrzydłami tej organizacji nabrał doświadczenia na esportowej scenie. Jednak po połowie roku stwierdził, że tam nie odniesie sukcesu, więc opuścił tą drużynę i szukał szczęścia gdzie indziej. Ostatecznie, w lutym 2015 roku, dołączył do Gamers2, później przemianowanych na G2 Esports. Dopiero w tym zespole \"Smittyj\" miał okazję się zrealizować, biorąc udział w Challenger Series. W tych rozgrywkach pokazał jak umiejętnym jest zawodnikiem, kończąc na szczycie tabeli z wynikiem 8:2. Równie dobrze poszło mu w meczach barażowych, aż w końcu stanął przeciwko weteranom EU LCS – SK Gaming.</p>\n<p>\nPrzed grą z SK Gaming o wejście do EU LCS \"Smittyj\" był bardzo pewny siebie i swoich umiejętności. W nagraniu internetowym G2 Esports „Road to LCS” oświadczył, że pokona junglera przeciwników z łatwością. Co prawda nie była to dziecinna igraszka, jak zapowiadał, ale i tak bardzo doświadczony \"fredy122\" został przez niego znokautowany. Dzięki wygranej 3:2 z SK Gaming zakwalifikował się wraz z drużyną do wiosennego sezonu 2016 EU LCS, co było jego największym osiągnięciem w karierze gracza.</p>\n<p>\nNie dane mu jednak było wystąpić w Europie, gdyż jego umiejętności zaimponowały również analitykom zza oceanu. \"Smittyj\" został przez nich nazwany „niedocenianym, młodym talentem, który może wkrótce rozkwitnąć”. W listopadzie 2015 roku dołączył do Team Dignitas, jednej z najstarszych i niezatapialnych drużyn w League of Legends. Wiązało się to oczywiście z przeprowadzką młodego Niemca do Stanów Zjednoczonych, co przyjął zaskakująco dobrze. Jego debiut w ich szeregach miał miejsce na top-lanie w wiosennym sezonie 2016 NA LCS. </p>\n<p>\nZ wszystkich bohaterów najbardziej przepada za Riven, aczkolwiek równie dobrze gra innym postaciami na top-lanie. Wszechstronność jest zaletą Lennarta - świetnie sobie radzi zarówno asasynami jak i obrońcami, bądź molochami. Opierając się na swoich umiejętnościach udało mu się dostać do Kręgu Pretendenta w Europie. Oprócz uniwersalności w League of Legends wyróżnia go wrażliwość na ludzką krzywdę. Aktywnie bierze udział w streamowaniu na rzecz dzieci współpracując z organizacjami charytatywnymi. </p>\n","de_DE":"<p>Der Deutsche Lennart \"SmittyJ\" Warkus startete ursprünglich mit G2 im Jahr 2015 durch, spielte im letzten Split für Team Dignitas und ist nun Top-Laner für Giants! Gaming. Er konnte viel Erfahrung in den letzten Monaten sammeln und ist kein Neuling mehr in der Szene. SmittyJ ist bekannt für sein Selbstvertrauen, denn laut ihm ist er der beste Top-Laner den es gibt. Im ist keine Herausforderung zu groß, und die nächste Aufgabe ist es, die Giants wieder ins Spiel zu bringen. Mit seinen Lieblingschampions Maokai und Fiora hat SmittyJ eine Killbeteiligung von über 75% und ist oftmals die tragende Kraft in den Teamkämpfen. Er bezeichnet sich selber als guten Shotcaller und erweitert stets seine Auswahl an Champions – ihm sind keine Grenzen gesetzt. </p>\n\n<p>“Was ich für das Team mitbringe? Ich kann ziemlich gut shotcallen, außerdem bin ich einfach gut, also..das bringe ich mit.” - Lennart \"SmittyJ\" Warkus</p>\n"},"foreignIds":{"drupalId":"2902","TRLH1":"1001220074","TRLH2":"1001160124","TRLH3":"200000230","TRLH4":"200000082","FRA1TMNT2":"25044","ESPORTSTMNT02":"200001004"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":240,"slug":"vardags","name":"Vardags","firstName":"Pontus","lastName":"Dahlblom","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/vardags-f8ye0tj4.png","hometown":"Sweden","region":"EU CS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2016-01-26T19:34:59.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1525","TRLH3":"1001000143","TRLH4":"1001000143","FRA1TMNT1":"375404"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":490,"slug":"steve","name":"Steve","firstName":"Etienne","lastName":"Michels","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/steve-homsdwkp.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-05-20T14:49:17.000Z","updatedAt":"2017-03-26T09:35:58.000Z","bios":{"en_US":"<p>\nEtienne “Steve” Michels launched his career with ROCCAT during the 2015 EU LCS Summer Preseason, replacing Overpow as their starting top laner. Steve brought several years of amateur experience, but he was still an EU LCS rookie and had the inconsistent play to prove it. In 2016, Steve and Schalke were huge underdogs heading into the Spring Split. Their play was enough to hang onto 7th place and re-qualify for the Summer Split.\n</p>\n<p>\nSteve has always been a crowd favorite though, making a name for himself as a great split pusher and all-around team player. This split will be a test to find out just where Steve lies in Europe’s sea of talent. Schalke has remained largely the same, paving the way for Steve to make this Split a proving grounds for himself. Let there be no doubt, the chants of “Steeeeeeeeeeeeve!” will still be heard around the world, let’s just hope he answers the call.\n</p>","fr_FR":"<p>La France est particulièrement bien fournie en toplaners. Après le vétéran Paul « sOAZ » Boyer et Lucas « Cabochard » Simon-Meslet, le public a pu découvrir Etienne « Steve » Michels. Ayant débuté sur League of Legends dès ses prémices, Steve n’a pas tout de suite été tenté par la compétition, mettant ses études au premier plan. En 2015, il rejoint le projet Sparta, dans le but de tenter la qualification aux LCS via le tournoi d’expansion. L’équipe ayant échoué dans son entreprise, Steve rejoint l’équipe LDLC pour continuer à jouer au niveau français. C’est à ce moment-là que sa carrière décolle. Steve est repéré par l’équipe ROCCAT lors de la pré-saison estivale des LCS EU 2015, qui lui propose de remplacer Overpow au poste de toplaner titulaire. Il avait dans ses bagages quelques légères années d'expérience sur la scène amateur, mais il restait néanmoins un débutant propulsé aux LCS EU. Son inexpérience au niveau professionnel lui a coûté cher dès les premières semaines du segment d'été et les équipes adverses en abusaient.</p>\n<p>Mais très vite, le Français a redressé la tête durant la seconde moitié de la saison et son KDA moyen est passé de 1,9 (semaines 1 à 5) à 4,4 (semaines 6 à 10). Sa confiance en ses capacités et, plus important encore, la confiance que ses équipiers plaçaient en lui étaient bien plus grandes. Les spectateurs berlinois ont également soutenu le toplaner dès ses premières apparitions, visiblement séduits par son sourire permanent. Les progrès de Steve ont hissé permis à ROCCAT d’atteindre la 5e place du segment d'été des LCS EU 2015 et de participer aux play-offs. </p>\n<p>Début 2016, Steve rejoint l’équipe Elements in-extremis. Aux côtés de son compatriote Jérémy « Eika » Valdenaire, il donne le meilleur de lui-même dans un championnat très disputé mais le milieu de saison est très difficile. L’équipe parvient tout de même à sécuriser la 7e place, qui n’offre pas de ticket pour les play-offs mais qui dispense de tournoi de relégation. À l’intersaison, le spot Elements est racheté par l’équipe sportive FC Schalke 04. Fort d’un encadrement très sérieux et expérimenté, Steve pourra peut-être enfin s’épanouir cette saison !\n</p>","es_ES":"<p>Etienne 'Steve' Michaels comenzó su carrera profesional durante la pretemporada del Split de verano de la LCS EU 2015, reemplazando a Overpow como el top titular. Steve traía bajo el brazo varios años de experiencia en la competición amateur, pero no dejaba de ser un novato, cosa que pagó en las primeras semanas del Split de verano de la LCS EU 2015 con una actuación lejos del nivel esperado.</p>\n<p>Pero Steve no cejó en su empeño y mejoró sensiblemente su rendimiento en la segunda mitad de la temporada, pasando de un KDA de 1.9 (jornadas 1 a 5) a 4.4 (jornadas 6 a 10). Con un aumento significativo no sólo en su confianza sino en la del resto del equipo. La mejora de Steve llevó a ROCCAT a la tercera posición en el Split de verano de la LCS EU 2015, y eventualmente aseguró una plaza en un nuevo equipo de cara al Split de primavera de la LCS EU 2016, Elements. No podemos esperar a ver a los aficionados aclamarlo con su grito preferido: \"¡¡Steeeeevveeeeeeee!!\".</p>","pl_PL":"<p>Etienne rozpoczął swoją przygodę z League of Legends bardzo wcześnie, gdyż zdominował amerykański serwer przed powstaniem europejskiego. Zanim się przeniósł na ten drugi, udało mu się znaleźć wśród 30 najlepszych graczy w regionie. Na amatorskiej scenie pojawił się w 2013 roku, grając w wielu drużynach konkurujących w Kręgu Pretendenta. Przed zaangażowaniem się w rozgrywki 5v5, w pierwszym i drugim sezonie „Steve” uznawał za swoją główną rolę AD Carry. Dopiero udział w drużynowych konkurencjach sprawił, że przeniósł się na top-lane. Posunął się nawet do tego, że po liceum wziął rok wolnego żeby się skupić na swojej karierze profesjonalnego gracza. Jednak ani przenosiny na inną linię ani rezygnacja z pójścia na studia nie przyniosły mu upragnionych osiągnięć. Dopiero kiedy wrócił na studia fizyki w inżynierii dostał szansę na wykazanie się od drużyny Sparta. W październiku 2014 roku przeniósł się do domu graczy w Paryżu należącego do tej organizacji. Wraz z nią wziął udział w Europejskim turnieju rozszerzającym ilość drużyn w rozgrywkach LCS. Niestety znowu bez sukcesu. </p>\n<p>\n„Steve” miał okazję pokazać się społeczeństwu dopiero kiedy zastąpił Remigiusza \"Overpow\" Puscha w zespole Roccat. Od maja 2015 roku przejął górną aleję w tej ekipie i wreszcie miał okazję zaprezentować co potrafi szerszej publice. W szeregach „niebieskiego kota” osiągnął największy sukces – zajął piąte miejsce w letnim sezonie EU LCS 2015. Jak na debiutanta to naprawdę imponujący wyczyn. Jednak nie pozostawił widzom wątpliwości, że w pełni zasłużył na podziw. Wielokrotnie broniony przez Etienna top-lane stawał się ostoją całej drużyny, pomimo tego, że nie grał swoimi ulubionymi bohaterami – Ryzem i Irelią. Stał się znany z niesamowitych zagrań Maokaiem, którego najczęściej można było podziwiać właśnie w jego wydaniu. Wielu fanów utrzymuje, że największe wrażenie na nich zrobiła jego gra Ekko – w lecie wygrał wszystkie mecze, w których wybrał Chłopca, Który Ujarzmił Czas.</p>\n<p>\n„Steve”, pomimo tego, że urodził się we Francji, miał okazję mieszkać w Belgii i Arabii Saudyjskiej – co bardzo wyróżnia go wśród innych graczy. Kolejnym znaczącym kontrastem była jego zdolność do połączenia pasji gry na komputerze z klasycznym sportem. W swoim regionie osiągnął wiele w lidze badmintona.\n</p>","de_DE":"<p> „Er ist sehr bescheiden.“ Worte, mit denen Jakob \"YamatoCannon\" Mebdi seinen damaligen Top-Laner beschrieb. Ein Attribut, was nicht vielen Spielern der oberen Liga zugutekommt, da mit guten Spielern oftmals ein großes Ego einhergeht. Mit Nettigkeit kommt man nicht voran? Steve beweist das Gegenteil, denn hinter dem sanften Gemüt steckt viel Ehrgeiz und die feste Entscheidung im eSports etwas zu erreichen. </p>\n<h2><p>Ein steiniger Weg</p></h2>\n<p>Doch der Weg war kein leichter. Sein Eintritt in League war gleich zu Beginn des Spiels im Jahre 2009. Ohne weitere Hintergedanken kam er schnell unter die Top 200 und erste Gedanken an eine Karriere kamen auf. Mit Beginn der dritten Saison kam der erste große Schritt zur Umsetzung des Plans. Er wählte die Top-Lane zu seiner Bestimmung, da er Jarvan IV. sehr gerne spielte und hielt erstmals nach Amateurteams Ausschau. </p>\n<p>Wie bei so Vielen folgte ein langer Weg vom einen Challenger Team zum nächsten, da sich die Teams schon nach den ersten Misserfolgen wieder schnell auflösten. Unter anderem auch die Eigenkreationen des Hobbykeksbäckers mit seinem Team „Steve Bakes Cookies“. So richtig los ging es erst, als YamatoCannon auf ihn aufmerksam wurde, nachdem er durch seine Art immer wieder von ehemaligen Kollegen empfohlen wurde. </p>\n<p>Wohlgleich noch der Franzose noch sehr unvertraut mit dem von da an immer größer werdenden Publikum war, lieferte er einen sehr starken Split ab. Er war maßgeblich an dem zufriedenstellenden fünften Platz seitens ROCCAT beteiligt. Vor allem durch sein starkes Erscheinen auf Maokai und Ekko verhalf er dem Team vermehrt zu Siegen. Nicht ohne Grund waren die „Steeeeve“ Rufe im LCS Stream nicht zu überhören. </p>\n<p>Die Reise geht nun weiter. Das ruhige Gemüt wird zukünftig eines der fünf Elemente in Elements sein. Nicht als Feuer und Flamme, sondern als standfestes Rückgrat des Teams. Während des Spiels, aber auch danach im persönlichen Zusammenleben mit seinen wieder einmal neuen Kollegen. </p>\n"},"foreignIds":{"drupalId":"1940","TRLH3":"200000255","TRLH4":"200000307","TRLH2":"1001250001","FRA1TMNT2":"25416","ESPORTSTMNT02":"200001025"},"socialNetworks":{"twitch":"http://www.twitch.tv/rocsteve","facebook":"https://www.facebook.com/LolIAmSteve?_rdr=p"},"champions":[],"liveGameTeam":55},{"id":802,"slug":"morsu","name":"Morsu","firstName":"Bram","lastName":"Knol","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/morsu-821bg1bo.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2015-06-22T23:05:53.000Z","updatedAt":"2016-01-26T19:33:33.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1909","FRA1TMNT1":"375403"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1116,"slug":"dokgo","name":"Dokgo","firstName":"Kyeong-tak","lastName":"Kim","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/dokgo-fgk7ebyz.png","hometown":"","region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:40:35.000Z","updatedAt":"2016-01-26T19:33:57.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375399"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":1117,"slug":"kellogz","name":"Kellogz","firstName":"Ismar","lastName":"Klokic","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/kellogz-a6haf1db.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:41:11.000Z","updatedAt":"2016-01-28T13:54:41.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":1118,"slug":"suno","name":"SuNo","firstName":"Ahn","lastName":"Sunho","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/suno-780m0ryi.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:42:05.000Z","updatedAt":"2016-01-26T21:40:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375400"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":1119,"slug":"sleeping","name":"Sleeping","firstName":"Christian","lastName":"Tiensuu","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/sleeping-frnzjb7.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:42:46.000Z","updatedAt":"2016-01-28T13:14:32.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375402"},"socialNetworks":{},"champions":[],"liveGameTeam":26},{"id":1337,"slug":"memento","name":"Memento","firstName":"Jonas","lastName":"Elmarghichi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/memento-2s3o4ejq.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:46:29.000Z","updatedAt":"2017-06-18T19:39:23.000Z","bios":{"en_US":"<p>Jonas \"Memento\" Elmarghichi was originally a solo queue star before kickstarting his professional career in 2015. He then joined Team ROCCAT as their starting jungler in mid 2016. He, along with the entire team, struggled in the LCS and eventually had to play in the EU LCS Promotion Tournament in order to re-enter the league. After struggling with ROCCAT, Memento looked for other opportunities to showcase his abilities and landed with Giants Gaming in early 2017. While his play hasn’t been astounding by any stretch, he’ll have another shot to prove that he belongs with the best in Europe when spring rolls around.</p>","de_DE":"<p>Jonas „Memento“ Elmarghichi war ursprünglich ein Star der Solo-Warteschlange, bevor er seine Profikarriere 2015 gestartet hat. Er ist Mitte 2016 Team ROCCAT als Jungler beigetreten. Allerdings hatten er und der Rest des Teams große Schwierigkeiten in der LCS und schließlich mussten sie sich im „EU LCS“-Aufstiegsturnier den Weg zurück in die Liga erkämpfen. Nach den Problemen mit ROCCAT hat sich Memento nach anderen Möglichkeiten umgesehen, um seine Fähigkeiten zu zeigen. Anfang 2017 ist er dann bei Giants Gaming gelandet. Obwohl seine Leistung nicht außergewöhnlich war, kann er im Frühjahr erneut beweisen, dass er zu den Besten Europas gehört.</p>"},"foreignIds":{"TRLH4":"200000199","TRLH3":"200000096","ESPORTSTMNT02":"200002451"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1376,"slug":"norskeren","name":"Norskeren","firstName":"Tore","lastName":"Hoel Eilertsen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/norskeren-f5d7bkuf.png","hometown":null,"region":"Challenge France","birthdate":null,"createdAt":"2016-06-17T20:14:37.000Z","updatedAt":"2017-08-17T15:27:52.000Z","bios":{"en_US":"","fr_FR":"Dans son pays d'origine, le joueur norvégien a joué dans plusieurs équipes, participant à des tournois nationaux et des LANs. C'est en avril 2016 qu'il rejoint la structure professionnelle allemande mousesport. Finalement, il préférera retourner en Norvège pour jouer dans l'équipe Riddle eSports, la meilleure équipe du pays. \n<br />\nRéperé par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires."},"foreignIds":{"TRLH1":"1001360009","esportstmnt05":"200000939","ESPORTSTMNT02":"200002448","TRLH4":"200000354","TRLH3":"200000354"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1377,"slug":"upset","name":"Upset","firstName":"Elias","lastName":"Lipp","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/upset-f4z7h6wr.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-20T17:58:58.000Z","updatedAt":"2017-05-09T22:41:05.000Z","bios":{},"foreignIds":{"TREU1":"1000585051","TREU":"1000585051","ESPORTSTMNT02":"200001007","TRLH3":"200000233","TRLH4":"200000085","TRLH1":"200000423"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1752,"slug":"rexxx","name":"1 Rexxx","firstName":"Erik","lastName":"Reisswig","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rexxx-5uhnncsw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-30T20:08:17.000Z","updatedAt":"2017-07-07T18:06:26.000Z","bios":{},"foreignIds":{"TRLH3":"200000235","TRLH4":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":2013,"slug":"nikola-senpai","name":"Nikola Senpai","firstName":"Nikola","lastName":"Djordjevic","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nikola-senpai-3z4qiutz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:23:59.000Z","updatedAt":"2017-08-06T14:35:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002453","TRLH4":"200000454"},"socialNetworks":{},"champions":[],"liveGameTeam":55}],"scheduleItems":[{"id":"AU3UKWb4OPWArxM1l4Sm","content":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:match:2dbceebf-2879-49cc-b46d-0b956b4dba59","scheduledTime":"2015-06-25T20:00:00.000+0000","tags":{"subBlockLabel":"EU LCS Summer - Week 5 - Day 1","blockLabel":"5","leagueLabel":"urn:rg:lolesports:global:league:league:3","blockPrefix":"week","subBlockPrefix":"day","yearLabel":"2015","stageLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:bracket:051ebefd-5274-445e-ae69-bf52861028a1","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1"},"match":"2dbceebf-2879-49cc-b46d-0b956b4dba59","tournament":"6fee33c6-bf3e-46f3-82b3-d21934202ee1","bracket":"051ebefd-5274-445e-ae69-bf52861028a1","league":"3"}],"gameIdMappings":[{"id":"46583ffb-8156-40c4-b453-4dda9aa069fa","gameHash":"0fa2c4f29fca01c6"}],"videos":[],"htmlBlocks":[],"match":{"id":"2dbceebf-2879-49cc-b46d-0b956b4dba59","name":"R1M19","position":18,"state":"resolved","groupPosition":0,"input":[{"roster":"7ff8f23c-5360-45ff-94f7-d4a2278e2e29"},{"roster":"22498474-bad6-4cd6-a3c1-fa5c55224567"}],"games":{"46583ffb-8156-40c4-b453-4dda9aa069fa":{"id":"46583ffb-8156-40c4-b453-4dda9aa069fa","name":"G1","generatedName":"EL|SK|G1|2dbceebf287949ccb46d0","input":[{"roster":"7ff8f23c-5360-45ff-94f7-d4a2278e2e29"},{"roster":"22498474-bad6-4cd6-a3c1-fa5c55224567"}],"standings":{"result":[[{"roster":"7ff8f23c-5360-45ff-94f7-d4a2278e2e29"}],[{"roster":"22498474-bad6-4cd6-a3c1-fa5c55224567"}]],"timestamp":1438718818163,"source":"manual","note":"Clone results from Match Service","closed":true},"scores":{},"gameId":"1001200197","gameRealm":"TRLH3","platformId":"TRLH3:1001200197","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"7ff8f23c-5360-45ff-94f7-d4a2278e2e29"}],[{"roster":"22498474-bad6-4cd6-a3c1-fa5c55224567"}]],"timestamp":1438718818163,"source":"manual","note":"Clone results from Match Service","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7ff8f23c-5360-45ff-94f7-d4a2278e2e29":1,"22498474-bad6-4cd6-a3c1-fa5c55224567":0}}}