{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":169,"slug":"echo-fox","name":"Echo Fox","guid":"be70e203-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/echo-fox-ejngzoa3.png","acronym":"FOX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-04T23:27:05.000Z","updatedAt":"2017-08-06T19:57:02.000Z","bios":{"fr_FR":"<p>Que se passe-t-il quand une figure médiatique du basketball nord-américain s'intéresse aux LCS ? Ça donne Echo Fox. </p>\n\n<p>L'idée pourrait sembler saugrenue et l'aurait sans aucun doute été il y a deux ans. Oui mais voilà, l'e-sport continue de se développer, notamment grâce à League of Legends, et Echo Fox en est une preuve éclatante. Cette nouvelle équipe qui vient remplacer Gravity Gaming dans les LCS NA est en effet la propriété de Rick Fox, ancien joueur de la NBA notamment pour les Los Angeles Lakers, et acteur à ses heures perdues. Rien que ça ! </p>\n\n<p>Acheter une place en LCS c'est bien, mais ça ne suffit pas. Encore faut-il aligner une équipe compétitive et donc attirer des joueurs de haut niveau. C'est ce qu'a tenté de faire Echo Fox, avec un résultat qui soulève sans doute autant de questions que d'espoirs circonspects chez les fans d'e-sport en général et de League of Legends en particulier. Echo Fox est charpentée autour de son mid laner Henrik « Froggen » Hansen, légende du jeu et un nom qui attirera sans aucun doute le public. Mais le joueur européen a-t-il encore le niveau pour porter son équipe ? Et ses coéquipiers ont-ils les reins assez solides pour l'épauler efficacement ? Que ce soit le joueur coréen de file solo Jeong-hun « kfo » Park en voie du haut ou les trois nord-américains qui complètent l'effectif, les nouveaux compagnons de Froggen manquent pour le moment d'expérience. </p>\n\n<p>Cela peut signifier l'arrivée d'une nouvelle vague de jeunes joueurs bien décidés à faire des étincelles. Cela peut aussi être une saison d'apprentissage difficile qui aboutira à un nouveau passage dans les tréfonds du classement des LCS pour Froggen. Quoiqu'il en soit, les dés sont jetés et Rick Fox va pouvoir regarder ses joueurs depuis le banc tout au long des LCS NA. </p>","en_US":"<p>You'd have trouble finding an easier team to root for than Echo Fox. Given the team's many struggles since joining the league in 2016, including narrowly avoiding relegation in the 2017 NA LCS Spring Promotion tournament, another owner might have jumped ship. But former NBA star Rick Fox isn't just any other owner. His belief in his players is unwavering.</p>\n\n<p>In 2017, Fox is supplementing that belief with some new talent. Former RNG top laner Looper headlines the new additions, along with ex-P1 support Gate. Former Challenger scene jungler Akaadian also joins the team. Nobody has more faith in Echo Fox than its owner; now it's time for the players to prove that faith isn't misplaced.</p>\n\n<p>Coach: Nick \"Inero\" Smith</p>","pl_PL":"<p>Pojawienie się Echo Fox w wiosennym sezonie NA LCS 2016 to powiew świeżości wśród organizacji. Nowo powstała drużyna zastąpiła Gravity w elitarnych rozgrywkach NA LCS, więc śmiało można stwierdził, że od razu skoczyła na głęboką wodę. Ogłoszenie istnienia Echo Fox, a następnie jego składu, wzbudziło wiele emocji wśród społeczeństwa League of Legends. Wynikało to z bardzo małej ilości przecieków na temat powstającego zespołu i ujawnienia atrakcyjnych faktów tuż przed rozpoczynającym się sezonem 6. Dlatego wszyscy zainteresowani dosłownie wychodzili z siebie próbując zaspokoić swoją ciekawość.</p>\n<p>Jednak najbardziej zaskakującymi informacjami dotyczącymi zespołu Echo Fox, były wiadomości o jego właścicielu. Nabywcą miejsca Gravity w NA LCS była powszechnie znana w Ameryce Północnej gwiazda NBA – Rick Fox. Wielu graczy od razu zadało sobie pytanie: jak to się stało, że znana w skali światowej osobistość, tak się zainteresowała grą komputerową. Wyjaśnienia można się doszukać w wielkim uczuciu jego syna, Kyle’a Foxa, do drużyny Counter Logic Gaming. Wkrótce młodemu fanowi udało się zarazić pasją swojego sławnego ojca. W ten sposób trzykrotny mistrz NBA dowiedział się o League of Legends i bardzo szybko również pokochał tą rozrywkę. Można było spotkać Ricka Foxa wśród widzów na wielu wydarzeniach związanych z League of Legends, jak na przykład rozgrywki NA LCS. Rozmawiał z zawodnikami, w szczególności dużo z graczami Counter Logic Gaming, dodając im otuchy przed meczami. Te czynniki doprowadziły sławę do kroku, którego nikt się nie spodziewał – wykupił drużynę Gravity i przemianował ją na Echo Fox. W wywiadzie dla Breitbart powiedział: „Pragnienie, skupienie, poświęcenie i etyka, które widziałem u esportowych atletów przypominają mi presję rywalizacji kiedy ja goniłem za swoją karierą w koszykówkę. Moja pasja została wsparta przez społeczeństwo, jako właściciel drużyny Echo Fox zamierzam popierać jej zawodników w taki sam sposób.”</p>\n<p>Rick Fox zadbał żeby jego drużyna nie została na wstępie zdominowana przez zahartowanych weteranów. Oprócz młodych i obiecujących talentów znalazł w składzie miejsce dla poważanego weterana - Henrika \"Froggen\" Hansena. W wizji właściciela Echo Fox połączenie świeżych pomysłów w wydaniu debiutantów i doświadczenia starych wyjadaczy to przepis na sukces. Uwagę przyciąga także nazwa organizacji – wiadomo, że lisia część pochodzi od nazwiska założyciela, lecz pojawiło się wiele teorii na temat dodatku w postaci słowa „Echo”. Wiele osób doszukało się w tej chwytliwej nazwie nawiązania do międzynarodowego alfabetu lotniczego. Według tej teorii „Echo Fox” to skrócona nazwa fonetyczna dwóch następujących po sobie liter – E i F, czyli w rozwinięciu „Echo Foxtrot”.</p>\n","de_DE":"Es gibt kaum ein Team, das man lieber anfeuert als Echo Fox. Das Team hat seit dem Ligabeitritt 2016 schwer zu kämpfen. Der knapp verhinderte Abstieg im Aufstiegsturnier für die NA LCS 2017 ist nur ein Beispiel dafür, und ein anderer Besitzer hätte das sinkende Schiff sicher verlassen. Aber der ehemalige NBA-Star Rick Fox ist kein Besitzer wie jeder andere. Der Glaube an seine Spieler ist unerschütterlich.\n</p>\n2017 untermauert er diese Einstellung mit einigen neuen Talenten. Looper, der ehemalige Top-Laner von RNG, führt die Neuzugänge an, gemeinsam mit Gate, dem Ex-Supporter von P1. Akaadian, der früher in der Challenger Series als Jungler tätig war, schließt sich ebenfalls dem Team an. Niemand glaubt mehr an Echo Fox als ihr Besitzer, und jetzt liegt es an den Spielern, zu beweisen, dass sein Vertrauen nicht ungerechtfertigt ist.\n</p>\nCoach: Tim „Timkiro“ Cho\n"},"foreignIds":{},"players":[70,191,246,363,607,774,820,1096,1359],"starters":[191,363,774,820,1359],"subs":[70,246,607,1096]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":70,"slug":"looper","name":"Looper","firstName":"Hyeongseok","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/looper-agve6x52.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-01-19T22:02:44.000Z","bios":{"en_US":"<p>Hyeongseok \"Looper\" Jang is the latest Korean top laner to make his LCS debut. The ex-Royal Never Give Up starter is a veteran of the scene, with a career that began back in 2013. Originally known for an aggressive playstyle, Looper has evolved into a multi-faceted laner. The former LPL champion is just as capable of tanking on Maokai as he is carrying on Irelia.</p>\n\n<p>Looper brings his many talents to Echo Fox in 2017. The team hopes to have more success with a Korean import this time around after another one, KFO, struggled as their top laner. Looper has the track record of success that Echo Fox sorely needed. At 23, he's one of the older players in the LCS -- but don't let his age fool you. He's still got plenty in the tank, and just one destination in mind: victory.</p>","es_AR":"<p>Hyeong-seok \"Looper\" Jang se posiciona en la cima como el carrilero superior de RNG y, mientras que otros carrileros superiores son alabados por su estabilidad y consistencia, Looper tiene una historia de ser un poco más agresivo. Fue originalmente conocido por su Singed en el 2013, pero Looper ha evolucionado y ahora es un carrilero multifacético. Eligió a Trundle y Rumble durante la temporada de verano de la LPL, pero es más que capaz de ramificarse, como fue demostrado con su habilidad para resistir con Moakai o acarrear con Irelia cuando es necesario. Con 23 años y con una carrera que data desde el 2013, Looper es uno de los jugadores más veteranos en el Mundial, pero no permitas que su vasta carrera te engañe. Es un maestro al que hace ya tiempo se le quitaron los nervios. Su objetivo está en la victoria.</p>","fr_FR":"<p>Hyeong-seok « Looper » Jang est un vétéran d'élite de la voie du haut. Ayant affronté la crème des joueurs d'Asie et remporté des championnats en Corée et en Chine, il est tout à fait capable d'écraser ses adversaires avec des champions tankys comme Poppy et Nautilus.</p>\n\n<p>Looper est bien souvent en première ligne pour RNG : il possède un réel talent pour utiliser la Téléportation et créer des situations favorables à son équipe, qui peut alors écraser ses adversaires lors d'un combat d'équipes ou contrer une rotation adverse en prenant les bonnes décisions.</p>\n\n<p>Alors qu'il jouait à l'origine un rôle de soutien avec Samsung White, il a su s'adapter au fil des différents patchs et constitue désormais un pilier central du line-up de RNG. C'est lui qui porte la lourde charge d'être un carry et une menace majeure au sein de l'équipe, et il est parfaitement synchronisé avec Mata. Vu le danger permanent qu'il incarne grâce à sa maîtrise de la Téléportation, ses adversaires réfléchiront toujours à deux fois avant de s'élancer hors de leur base.</p>\n\n<p>Ses performances ne sont d'ailleurs pas passées inaperçues : il a été nommé huit fois pour le titre de MVP lors du segment de printemps des LPL.\n</p>","es_ES":"<p>Hyeong-seok \"Looper\" Jang va con la cabeza bien alta como el jugador de la calle superior de RNG y, aunque otros de sus análogos son elogiados por la estabilidad y la regularidad, Looper tiene fama de ser un poco más agresivo. Era conocido inicialmente por su Singed, allá por 2013, pero desde entonces se ha transformado en un jugador polifacético. Añadió a Trundle y Rumble a su plantel durante la temporada de verano de la LPL, pero es más que capaz de expandirse, ya que ha demostrado su capacidad de hacer de tanque con Maokai o de ganar la partida con Irelia cuando haga falta.</p>\n\n<p>Con 23 años y una carrera que data de 2013, Looper es uno de los jugadores más adultos del Mundial, pero no dejéis que su larga trayectoria os engañe. Es un maestro que se deshizo de los nervios hace tiempo. Y ahora se concentra en la victoria.</p>","de_DE":"Hyeongseok „Looper“ Jang ist der neueste koreanische Top-Laner, der sein LCS-Debüt gibt. Das ehemalige Mitglied von Royal Never Give Up ist ein Veteran der Szene, der seine Karriere 2013 startete. Er wurde für seinen aggressiven Spielstil bekannt, aber seither hat sich Looper zu einem facettenreichen Top-Laner entwickelt. Der ehemalige Champion der LPL beherrscht es genauso gut, mit Maokai Schaden aufzusaugen wie mit Irelia Spiele im Alleingang zu entscheiden.\n</p>\nLooper unterstützt 2017 Echo Fox mit seinen vielen Talenten. Das Team hofft, dass sie mit diesem koreanischen Import mehr Erfolg haben, nachdem sich der letzte Koreaner, KFO, als Top-Laner nicht durchsetzen konnte. Loopers Erfolgsbilanz ist genau das, was Echo Fox so dringend braucht. Mit 23 Jahren ist er einer der älteren Spieler der LCS – aber man sollte sich nicht von seinem Alter täuschen lassen. Er hat noch immer genug Reserven und nur ein Ziel vor Augen: den Sieg.\n","pl_PL":"<p>Hyeong-seok „Looper” Jang jest doświadczonym weteranem górnej alei. Mając na koncie walki z najlepszymi zawodnikami z Azji, wygrywając mistrzostwa w Korei i Chinach, doskonale odnajduje się w tłuczeniu swoich przeciwników wytrzymałymi bohaterami, takimi jak Poppy czy Nautilus.</p>\n\n<p>Looper z reguły przewodzi RNG, ponieważ jest jednym z najlepszych graczy pod względem używania Teleportacji, aby tworzyć korzystne sytuacje dla swojej drużyny podczas walk drużynowych, lub przechytrzyć przeciwników w grach skupiających się na macro.</p>\n\n<p>Z początku miał bardziej wspierającą rolę podczas gry w Samsung White, ale przyzwyczajał się do zmian w różnych patchach i teraz jest głównym filarem składu RNG. Jego zadaniem w drużynie jest stanowienie zagrożenia dla wrogich prowadzących. Doskonale zgrywa się z Matą, a jego mistrzowskie stosowanie Teleportacji sprawia, że jego przeciwnicy muszą poważnie się zastanowić, zanim opuszczą swoją bazę.</p>\n\n<p>Jego wyniki nie zostały niezauważone, ponieważ był ośmiokrotnie nominowany na najlepszego gracza podczas wiosennego splitu LPL.</p>\n","pt_BR":"<p>Hyeong-seok \"Looper\" Jang marca presença como jogador do topo da RNG e enquanto outros topos são elogiados pela consistência e estabilidade, Looper tem um histórico de ser um pouco mais agressivo. Ele ficou conhecido inicialmente por seu Singed em 2013, mas Looper evoluiu muito desde então e agora é um jogador muito versátil. Ele escolheu Trundle e Rumble na etapa de verão da LPL, mas pode perfeitamente ampliar seu leque, pois já mostrou suas habilidades de tanque com Maokai e de carregador com Irelia quando foi preciso. Com 23 anos e uma carreira que remonta a 2013, Looper é um dos jogadores mais velhos do Mundial, mas não deixe que sua longa carreira o engane. Ele é um mestre que não se abala facilmente. Seu foco está apenas na vitória.</p>"},"foreignIds":{"drupalId":"683","TRLH1":"200000207","TRLH2":"200000111"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":191,"slug":"froggen","name":"Froggen","firstName":"Henrik","lastName":"Hansen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/froggen-ecvbey01.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-01-19T22:02:25.000Z","bios":{"en_US":"<p>One of the strongest control mage players in the world, Henrik “Froggen” Hansen is legendary in the mid lane on his favorite bird, Anivia. After rising to fame with CLG.eu utilizing a slow and methodical playstyle, Froggen and his squad went through a flurry of team and roster changes. From Evil Geniuses to Alliance, and then from Alliance to Elements, Froggen has had a tumultuous few years.</p>\n\n<p>After keeping Echo Fox from relegation by sheer force of will, Froggen has a new opportunity with 2017's retooled roster. With a former LPL champion in the top lane and a new jungler to gank his lane, the LCS icon is in a great spot to succeed. Now he just has to prove he's still got it after all these years. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">전장 장악형 마법사를 세계에서 가장 잘하는 선수 중 하나인 Henrik “Froggen” Hansen은, 애니비아 플레이로 오래 전부터 전설이 된 선수입니다. CLG.eu 시절 느리지만 정교한 플레이 스타일로 명성을 얻은 Froggen 선수는, 동료들과 함께 여러 번 팀을 바꾸었습니다. Evil Geniuses에서 Alliance로, 그리고 다시 Elements로, 지난 몇 년 간 평탄치 않은 시간을 보냈죠. </p>\n<p style=”font-family:”나눔고딕”;\">2015 유럽 LCS 스프링, 서머 스플릿에서 연속해서 7위를 기록한 Froggen 선수와 Elements가 세계 최고 수준의 팀들과 경쟁하려면 뭔가 근본적인 문제를 해결해야 한다는 사실은 자명해 보입니다. 하지만 Froggen 선수의 과거 활약을 생각해보면 아직 그에 대한 기대를 내려놓을 때는 아닙니다. 이번 올스타 대회가 부활의 신호탄을 올릴 수 있는 절호의 기회일지도 모르죠. </p>\n","fr_FR":"<p>Anivia le pigeon bleu. Est-il vraiment besoin de présenter Henrik « Froggen » Hansen ? Le Danois fait partie des quelques légendes de League of Legends encore en activité. Membre de la trilogie originale des dieux européens de la voie du milieu en saison 2, il déchaîne les foules depuis près de 4 ans. Considéré aujourd'hui encore comme le meilleur joueur d'Anivia au monde, Froggen porte avec lui le mythe de CLG.EU et des affrontements mythiques qu'il a menés contre Moscow 5 tout au long de la saison 2.</p>\n\n<p>Mais depuis, l'eau a coulé sous les ponts et le sort n'a pas été favorable au joueur. Dès la saison 3 et l'apparition des LCS, les anciens de CLG.EU ont souffert et laissé d'autres joueurs remporter titres et participation aux championnats du monde. Sentant que des changements étaient nécessaires, le joueur a alors construit autour de lui une équipe annoncée avant le début des LCS EU 2014 comme la première « superteam » de League of Legends. Malheureusement cette équipe construite pour tout gagner a enchaîné l'excellent et le bien moins bon, aussi bien capable de remporter un titre de champion des LCS EU lors du segment d'été que d'être la première équipe européenne à perdre contre des brésiliens lors du Championnat du monde 2014.</p>\n\n<p>La situation du Danois ne s'est pas arrangée en 2015 : il s'est retrouvé bien malgré lui à lutter non pas pour les titres mais pour éviter de se retrouver en tournoi de relégation des LCS EU. Pour la première fois de sa carrière, les critiques d'une partie du public ont été aussi sonores que l'enthousiasme de ses fans. L'ancien recordman du nombre de minions tués en un minimum de temps en compétitif s'est retrouvé considéré par certains comme un joueur trop passif et incapable de prises de décisions. Pire, l'arrivée en fanfare d'une nouvelle génération de joueurs professionnels a bousculé un peu plus chaque jour son statut de mid laner de classe mondiale.</p>\n\n<p>Alors Froggen a fait le grand saut, il est parti en NA, découvrir encore une nouvelle équipe et un nouvel environnement. Un nouveau défi, même s'il ne sera pas dépaysé de retrouver son vieil adversaire Alexey « Alex Ich » Ichetovkin dans les LCS NA. Un dernier défi peut-être aussi, pour celui qui doit plus que jamais prouver qu'il est toujours un monstre du jeu et pas seulement une ancienne gloire dépassée par la concurrence.</p>\n","pl_PL":"<p>Mało kto z europejskich graczy nie słyszał o Henriku \"Froggen\" Hansenie. Duńska ostoja doskonałości na mid-lanie imponuje fanom od pierwszego sezonu. Do grudnia 2011 próbował swojego szczęścia w różnych drużynach, z czego najcieplej wspomina poznanie przyjaciela – Mike’a \"Wickd\" Petersena. Wraz z nim pod koniec 2011 roku trafił do zespołu, gdzie spełniło się wiele z jego marzeń. W Counter Logic Gaming Europe Henrik spędził swój najbardziej owocny okres, konkurując na arenie światowej z najlepszymi ówczesnymi drużynami. W 2012 roku wygrał szereg poważnych i mniejszych międzynarodowych turniejów, lecz największym osiągnięciem było dostanie się na Mistrzostwa Świata drugiego sezonu. W związku z wejściem na arenę azjatyckich zespołów, drużyna CLG EU nie była faworytem, lecz udało im się wszystkich zaskoczyć. Nie tylko podołała wyjściu z grupy, ale również rozgromiła najstarszy chiński zespół Team WE w ćwierćfinale. W półfinale ekipie Henrika nie powiodło się tak dobrze, chociaż wygrali jeden mecz z trzech. Trzecia pozycja ex aequo na takim wydarzeniu była bardzo nobilitująca dla całego CLG EU. </p>\n<p>Wkrótce po tej imprezie drużyna została przemianowana na Evil Geniouses, lecz skład pozostał ten sam. Jednak w międzyczasie na profesjonalnej scenie pojawiło się wiele nowych talentów i konkurencja radykalnie urosła w siłę. W związku z czym „Froggen” nie odniósł tak oszałamiających sukcesów jak w poprzednim sezonie, nawet wiele osób nazwało wyniki EG w tym okresie przeciętnymi. Dlatego Henrik w grudniu 2013 roku opuścił wraz z przyjacielem Mike’iem bezpieczną przystań i w poszukiwaniu sukcesu stał się częścią nowej organizacji – Alliance. W niej osiągnął zdecydowanie więcej niż w poprzedniej drużynie, ponieważ po poznaniu własnych możliwości, w wiosennym sezonie EU LCS 2014, Alliance sięgnęło po złoto. W okresie letnim 2014 roku zajęła pierwsze miejsce w regularnych rozgrywkach, a następnie potwierdziła swoją dominację wygrywając również baraże. W ten sposób „Froggen” zagwarantował sobie udział w kolejnych Mistrzostwach Świata, tym razem sezonu 4. Niestety Alliance nie udało się wyjść z grupy, więc wyczyn z 2012 roku nie został powtórzony. Po tym wydarzeniu organizacja została przemianowana na Elements i zmieniła skład personalny zespołu. Jednak zmiany tylko pogorszyły sytuację Henrika, ponieważ jego drużyna w całym piątym sezonie wypadła przeciętnie, dwukrotnie zajmując 7 miejsce. Jak większość profesjonalnych graczy marzy o pokazaniu się na Mistrzostwach Świata, więc doszedł do wniosku, że musi podjąć radykalne kroki. Pod koniec roku 2015 przeniósł się do Ameryki Północnej żeby dołączyć do nowo powstałego zespołu Echo Fox – biorącego udział w wiosennym sezonie NA LCS 2016.</p>\n<p>„Froggen” osiągnął absolutne mistrzostwo w grze Anivią. W ciągu paru lat na scenie esportowej zyskał reputację najlepszego gracza tą postacią. Dlatego został wybrany do uczestnictwa w imprezie All-Stars Paris przez fanów po to, żeby zagrał Kriofeniksem. Osobistym wyczynem Henrika potwierdzającym jego masterię jest zwycięstwo z powszechnie znanym Lee’iem \"Faker\" Sang-hyeokiem. Zwyciężył z nim w pojedynku 1 vs 1 na wydarzeniu All-Stars Los Angeles 2015. Na tym nie kończą się prywatne sukcesy duńskiego mid-lanera – przez długi okres czasu był rekordzistą w zdobytej farmie w regularnych rozgrywkach. Pobił go Karthusem, zabijając 300 stworów w 23 minuty i 10 sekund.</p>","de_DE":"Mit seinem Lieblingsvögelchen Anivia hat sich Henrik „Froggen“ Hansen zu einem legendären Mid-Laner gemausert, der zu den stärksten Spielern der Welt gehört, die Magier mit Massenkontrolleffekten spielen. Nachdem er mit CLG.eu durch seinen langsamen und methodischen Spielstil zu Ruhm gekommen war, haben Froggen und seine Truppe eine Reihe an Mannschafts- und Aufstellungsänderungen durchgemacht. Froggen hat zwischen den Evil Geniuses, Alliance und Elements ein paar turbulente Jahre erlebt.\n</p>\nNachdem er Echo Fox durch reine Willenskraft vor dem Abstieg bewahren konnte, bietet sich 2017 mit der neuen Aufstellung eine neue Chance für ihn. Mit einem ehemaligen Champion der LPL auf der oberen Lane und einem neuen Jungler, der ihn auf der Lane unterstützt, befindet sich die LCS-Legende in einer guten Ausgangsposition. Jetzt muss er nur noch zeigen, dass er es nach all den Jahren immer noch drauf hat. \n","es_ES":"<p>\nHenrik “Froggen” Hansen es uno de los mejores jugadores del mundo con magos de control, y su Anivia mid es legendaria. Froggen dio el salto a la fama en CLG.eu gracias a su estilo de juego lento y metódico, y después de aquello tanto él como sus compañeros sufrieron una gran cantidad de cambios de equipo y plantilla. De Evil Geniuses a Alliance, y después a Elements. Froggen ha tenido unos años ajetreados. \n</p>\n<p>\nTras quedar en séptimo puesto en los splits de la LCS de 2015 de primavera y verano, está claro que Froggen y el resto de EL tienen que solucionar ciertos aspectos fundamentales antes de estar preparados para vencer a los mejores oponentes. Sin embargo, visto el rendimiento de Froggen, pensamos que no todo está perdido. El evento All-Star 2015 puede ser la ocasión perfecta para el resurgimiento de Froggen. \n</p>"},"foreignIds":{"drupalId":"80","TRLH1":"200000209","TRLH2":"200000113"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":363,"slug":"keith","name":"Keith","firstName":"Yuri","lastName":"Jew","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keith-gmei2hih.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-05-24T21:45:13.000Z","bios":{"en_US":"Yuri \"Keith\" Jew has called himself \"the motivator.\" He was the player Liquid and TSM brought in to nip at the heels of an underperforming starter. He finally earned a starting role with Echo Fox in the 2016 NA LCS Summer Split, but he struggled to find his footing. Fortunately, he showed up when it counted, helping Echo Fox avoid relegation against NRG Esports.\n</p>\n<p>After a rough spring split in the bot lane with his new support Gate, Keith will look to bounce back this summer. While his positioning has been suspect, he's proven willing to play a more supportive role as ADC. With playmakers like Akaadian and Froggen on your team, sometimes all it takes is one Enchanted Crystal Arrow for Echo Fox to take a victory. </p>\n","fr_FR":"<p>Yuri « KEITH » Jew est le roi des « memes » et des réactions humoristiques sur internet. C'est aussi un carry AD nord-américain dont tout le monde reconnaît le talent et le titulaire d'Echo Fox sur ce rôle. Mais malgré quelques apparitions dans les LCS NA au cours de la saison 2015, KEITH est pour le moment connu du grand public avant tout pour sa personnalité, particulièrement aux États-Unis et sur Reddit.</p>\n\n<p>Pourtant, ce joueur d'à peine 18 ans n'est pas passé inaperçu lors de son bref passage en LCS NA, bien au contraire. Souvenez-vous, c'était au début du segment de printemps 2015 et tous les yeux étaient tournés vers Team Liquid après que l'organisation eut réussi à faire venir l'ancien champion du monde Chae « Piglet » Gwang-jin en Amérique du Nord. Mais hélas, impossible d'obtenir un visa pour le Coréen avant le début de la saison. C'est là qu'est entré en scène celui qui s'appelait alors KEITHMCBRIEF (oui, tout en majuscules!), engagé comme remplaçant pour les premiers matchs de la saison. Une pression énorme ? Pas pour le jeune carry AD, auteur de performances éclatantes lors de ses premiers matchs en tant que professionnel, avec deux victoires à la clé. Mieux encore, en raison des performances décevantes de Piglet lors des semaines suivant son arrivée, KEITH a eu le plaisir d'être rappelé deux semaines en cours de saison par Team Liquid. Pour prendre, un temps, la place d'un ancien champion du monde. Une sacrée carte de visite, d'autant plus quand on sait qu'il a réalisé à cette occasion des matchs plus qu'honorables, avec notamment une fiche de 9/1/12 sur Caitlyn. Après un retour infructueux en Challenger series, le joueur a de nouveau fait office de joker de luxe des LCS NA en remplaçant cette fois Jason « WildTurtle » Tran pour un match.</p>\n\n<p>Cette saison, c'est en tant que titulaire d'une toute nouvelle équipe que le jeune joueur va retrouver et affronter ceux qu'il remplaçait hier. Toujours sans pression, mais sans nul doute avec l'envie de bien faire.</p>\n","pl_PL":"<p>\"KEITH\" zainteresował się profesjonalną sceną w połowie 4 sezonu. Wcześniej grał w inne tytuły typu MOBA, lecz ostatecznie najbardziej spodobało mu się League of Legends, dlatego w maju 2014 roku dołączył do Team Gyrations. Tam miał okazję nabrać doświadczenia i poznać przyszłe sławy, takie jak: „NintendudeX” I “Adrian”. Dopiero w kolejnym zespole zaczął odnosić widoczne sukcesy, gdyż będąc w Team LoLPro zagrał w turnieju rozszerzającym skład NA LCS. Szansę Yuriego na coś więcej zostały przekreślone przez Team Coast, który pokonał jego drużynę we wczesnym stadium wydarzenia. Mogło to wynikać z tego, że \"KEITH\" w Team LoLPro zajmował pozycję supporta, a jego główną rolą jest AD Carry. </p>\n<p>W styczniu 2015 roku został zrekrutowany do Team Liquid Academy, co dało mu niesamowite możliwości rozwoju. Pierwszą okazję dostał kiedy na początku wiosennego sezonu 2015 główny AD Carry Team Liquid, „Piglet”, miał problemy z wizą. W związku z tym Yuri został poproszony o wystąpienie jako substytut w regularnym sezonie NA LCS. To był milowy krok w jego karierze profesjonalnego zawodnika, gdyż okazało się, że doskonale sobie radzi wśród najlepszych graczy. Już w pierwszym tygodniu wygrał z takimi potęgami jak Team Impulse i Counter Logic Gaming. Po powrocie brakującego AD, \"KEITH\" grał w szeregach Team Liquid Academy w Challenger Series, niestety bez większych sukcesów. Została mu również dana szansa na miejsce w głównym składzie Team SoloMid, jednak zagrał tylko w jednym tygodniu, po czym organizacja zdecydowała się wrócić do poprzedniego AD Carry. </p>\n<p>Ulubionym bohaterem Yuriego bez wątpienia jest Lucian. Grając głównie Klerykiem Broni siał zniszczenie wśród nieprzyjaciół, dzięki czemu szybko znalazł się w Kręgu Pretendenta. W profesjonalnych rozgrywkach nie dane mu było zagrać ukochaną postacią, lecz mimo tego poradził sobie śpiewająco. Reprezentując Team Liquid podczas NA LCS zaskoczył widzów swoimi zdolnościami w grze między innymi Corkim, Caitlyn i Kog’Mawem. Ciekawostką jest to, że pseudonim Yuriego jest pisany dużymi literami, ponieważ pragnął większej uwagi.</p>\n","de_DE":"Yuri „Keith“ Jew nannte sich selbst „der Motivator“. Er war der Spieler, den Liquid und TSM einwechselten, wenn einer der Stammspieler eine schwache Leistung ablieferte. Im Sommer-Split der NA LCS 2016 konnte er sich schließlich einen Startplatz bei Echo Fox sichern, aber er hatte Schwierigkeiten, seinen Rhythmus zu finden. Zum Glück konnte er gegen NRG Esports seine ganze Leistung abrufen und damit den Abstieg von Echo Fox verhindern.\n</p>\nIn seinem zweiten Split hat Keith erneut die Chance, als AD-Carry von Echo Fox zu glänzen. Wenn er gut mit seinem neuen Supporter Gate harmoniert, könnte die untere Lane von Echo Fox für eine Überraschung in der NA LCS sorgen. Dieses Jahr wird er nicht strauchelnde AD-Carrys ersetzen, sondern versuchen, mit seiner Mannschaft die Top-Teams der NA LCS ins Schwitzen zu bringen.\n"},"foreignIds":{"drupalId":"2999","TRLH1":"200000210","TRLH2":"200000114"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":607,"slug":"grigne","name":"Grig","firstName":"Jonathan","lastName":"Armao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/grigne-1oxeggm8.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-10T18:09:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3803","ESPORTSTMNT02":"200000546","TRLH1":"200000213","TRLH2":"200000117"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1359,"slug":"brandini","name":"Brandini","firstName":"Brandon","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brandini-3s9xhgwg.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-06-12T20:15:57.000Z","updatedAt":"2017-07-16T22:42:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000670","TRLH1":"200000616"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11}],"scheduleItems":[{"id":"AVIUuGegOPWArxM1l4ZY","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:2eb2690b-90a0-4263-8079-4a073041c9e3","scheduledTime":"2016-02-27T21:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"7","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"2eb2690b-90a0-4263-8079-4a073041c9e3","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"3166e06a-355f-49a4-8f15-c4dbb13a09f8","gameHash":"9cdc7bcc37934449"}],"videos":[{"id":1100,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:3166e06a-355f-49a4-8f15-c4dbb13a09f8","source":"https://www.youtube.com/embed/sSJxhJIP5pE?wmode=transparent","createdAt":"2016-02-28T00:21:51.000Z","updatedAt":"2016-02-28T00:21:51.000Z","game":"3166e06a-355f-49a4-8f15-c4dbb13a09f8"}],"htmlBlocks":[],"match":{"id":"2eb2690b-90a0-4263-8079-4a073041c9e3","name":"FOX-vs-TSM","position":44,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"},{"roster":"8bf752fc-f5da-404c-bc07-e4760bc6c887"}],"games":{"3166e06a-355f-49a4-8f15-c4dbb13a09f8":{"id":"3166e06a-355f-49a4-8f15-c4dbb13a09f8","name":"G1","generatedName":"FOX|TSM|G1|2eb2690b90a04263807","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"},{"roster":"8bf752fc-f5da-404c-bc07-e4760bc6c887"}],"standings":{"result":[[{"roster":"8bf752fc-f5da-404c-bc07-e4760bc6c887"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1456609469660,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001570121","gameRealm":"TRLH1","platformId":"TRLH1:1001570121","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"8bf752fc-f5da-404c-bc07-e4760bc6c887"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1456609469660,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}