{"teams":[{"id":93,"slug":"cj-entus","name":"CJ Entus","guid":"be6e1556-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cj-entus-5qsksw8y.png","acronym":"CJE","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-04-21T18:51:09.000Z","bios":{"en_US":"","fr_FR":"CJ Entus est une équipe pérenne de la scène coréenne de League of Legends. CJ a aidé au développement de quelques-uns des meilleurs joueurs des LCK au fil des ans, y compris des joueurs de réputation mondiale comme MadLife, Shy et inSec. Bien qu'une partie de l'état de grâce de CJ ait paru disparaître au cours des Saisons 3 et 4 dominées par SKT T1 et Samsung White, l'équipe est restée l'une des meilleures des LCK.","pl_PL":"CJ Entus to drużyna z wieloletnim doświadczeniem na koreańskiej scenie League of Legends. CJ odpowiada za stworzenie kilku najbardziej utalentowanych graczy w LCK, w tym znanych na całym świecie graczy takich jak MadLife, Shy i inSec. Mimo że CJ podupadło trochę na formie podczas Sezonu Trzeciego i Czwartego podczas rządów SKT T1 i Samsung White, pozostało jedną z najlepszych drużyn w LCK.","ko_KR":"<p>CJ Entus는 한국의 리그 오브 레전드와 역사를 같이 해 온 팀입니다. MadLife 선수, Shy 선수, CoCo 선수, inSec 선수 등 LCK를 주름잡았던 선수들을 배출해낸 팀이기도 하죠. SKT T1과 Samsung White가 리그를 호령했던 3, 4 시즌에는 위상이 좀 떨어지기도 했지만 스타 플레이어들의 힘으로 LCK 상위권을 유지해오고 있습니다.</p>"},"foreignIds":{"drupalId":"640"},"players":[315,733,761,797,1266,1894],"starters":[315,733,761,797,1266],"subs":[1894]},{"id":108,"slug":"koo-tigers","name":"ROX Tigers","guid":"be6e3e07-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/koo-tigers-5xgsd4td.png","acronym":"ROX","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:04.000Z","bios":{"en_US":"<p>The ROX Tigers are ferocious in their pursuit of victory. The team formerly known as the KOO Tigers formed in 2014 and quickly evolved into one of the LCK’s elite predators. While they maintained a spot among the best, SK Telecom T1 seemed to have their number. Their fortunes turned in Champions Summer 2016, when they finally claimed their first title and stepped out of the shadow of Faker and company.</p>\n\n<p>Their triumph was short lived. When ROX met SKT again in the semifinals at the 2016 World Championship, ROX lost a close series to their rivals. After a huge roster shakeup that saw many fan favorites depart, ROX heads into 2017 looking to forge a new path to the top of the food chain.</p>","fr_FR":"KOO Tigers (précédemment GE Tigers) s'est formée en 2014, récupérant des joueurs chez NaJin Sword, NaJin Shield et Incredible Miracle. KOO, malgré cette composition éclectique, a vite su trouver l'unité requise pour combattre. Koo a obtenu la 2e place lors du Segment de printemps des LCK 2015 et a grimpé jusqu'aux demi-finales du Championnat du monde IEM Saison IX dans l'année qui a suivi sa formation.","pl_PL":"KOO Tigers (wcześniej znane jako GE Tigers) zostało utworzone w 2014 roku, zbierając graczy z NaJin Sword, NaJin Shield i Incredible Miracle. KOO szybko stało się zgraną drużyną, mimo że dla obserwatorów z zewnątrz mogło wyglądać nieco jak stwór Frankensteina. KOO zajęło 2. miejsce podczas wiosennego split LCK 2015 i dotarło do półfinałów mistrzostw świata sezonu dziewiątego IEM w ciągu roku od utworzenia.","de_DE":"<p>Dir ROX Tigers (ehemals KOO Tigers) wurden 2014 mit Spielern von NaJin Sword, NaJin Shield und Incredible Miracle gegründet. ROX verschmolz schnell zu einer eingeschworenen Einheit, obwohl die Mannschaft für Außenstehende wie eine von Frankensteins Kreationen aussah. Obwohl ROX eine der stärksten Mannschaften in der LCK war, schnappte SK Telecom T1 ihnen jeden Erfolg vor der Nase weg. Doch 2016 wendete sich das Blatt zugunsten der Tigers, als sie ihren ersten Split in der LCK gewannen und endlich aus dem Schatten von Faker und dessen Kameraden treten konnten. ROX hat zwar gerade erst den ersten Titel in der LCK gewonnen, aber jetzt richten sie ihre Augen auf das ultimative Ziel: Die Trophäe der Weltmeisterschaft 2016.</p>","es_ES":"<p>ROX Tigers (anteriormente llamado KOO Tigers) es un equipo formado en 2014 a partir de los jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se convirtió enseguida en una unidad de batalla, aunque pareciese un equipo Frankenstein para quien lo viese desde fuera. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapársele de las manos, pues SK Telecom T1 se la arrebataba una y otra vez. La suerte de los Tigers cambió en 2016 cuando finalmente consiguieron ganar su primer split de la LCK, lo que les hizo salir de la sombra de Faker y compañía. Puede que ROX haya conseguido su primer título de la LCK, pero ahora tiene la mirada puesta en su objetivo definitivo: el trofeo del Campeonato Mundial 2016.</p>","pt_BR":"A ROX Tigers (antiga KOO Tigers) foi formada em 2014, trazendo jogadores da NaJin Sword, NaJin Shield e Incredible Miracle. Mas a ROX rapidamente se integrou formando uma única unidade de combate, mesmo com muitos dizendo que essa equipe seria um frankenstein.  Apesar de ser uma das equipes mais fortes da LCK, a vitória parecia evitá-los constantemente toda vez que se encontravam com a SK Telecom T1. Mas a sorte da Tiger mudou em 2016 quando finalmente conseguiram ganhar sua primeira Etapa da LCK, saindo assim das sombras de Faker e companhia. A ROX pode ter conseguido levar para a casa seu primeiro título da LCK, mas agora eles estão de olho em um prêmio muito maior: o troféu do Campeonato Mundial 2016.","ko_KR":"<p>ROX Tigers(전 KOO/GE Tigers)는 2014년에 NaJin Sword, NaJin Shield, Incredible Miracle 출신 선수들을 모아 창단한 팀입니다. 언뜻 보기에는 마구잡이로 선수들을 한 팀에 모아놓은 듯했지만 창단 후 얼마 되지 않아 가공할 만한 모습을 보이기 시작했죠. </p>\n<p>창단 후 채 1년도 지나지 않은 시점에서 2015 LCK 스프링에서 2위에 올랐고 IEM 시즌 IX 월드 챔피언십에서는 준결승까지 진출했을 정도니까요. 뒤이어 2015 월드 챔피언십에서는 당당히 2위에 오르며 세계 최강팀 중 하나로 자리매김했습니다. 2016 스프링 정규 시즌에서는 16승 2패로 1위를 했지만, 플레이오프 결승에서 SKT T1에 3대1로 패하면서 아쉽게 2016 스프링 시즌에 우승하지는 못하였습니다.</p>\n","es_AR":"<p>ROX Tigers (anteriormente conocidos como KOO Tigers) se formó en el 2014 con jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se armó como una unidad de lucha, aún cuando los ojos ajenos miraban al equipo como apenas un rejunte de miembros. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapárseles siempre, ya que SK Telecom T1 les bloqueaba el paso en todas las oportunidades. La suerte de los Tigers cambió en el 2016, cuando finalmente ganaron su primer torneo de la LCK, lo que les permitió salir de la sombra de Faker y compañía. ROX se adjudicó su primer título de LCK, pero ahora su foco está en el objetivo principal: el trofeo del Campeonato Mundial 2016.</p>\n\n<p><strong>Entrenador: Kim \"Ssong\" Sang-su</strong></p>"},"foreignIds":{"drupalId":"3641"},"players":[572,742,1044,1045,1231,1270,2049],"starters":[572,1044,1045,1231,2049],"subs":[742,1270]}],"players":[{"id":315,"slug":"pure","name":"Pure","firstName":"Jin-sun","lastName":"Kim","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pure-c0fcg2ah.png","hometown":null,"region":"LCK","birthdate":null,"createdAt":"2014-09-16T21:53:46.000Z","updatedAt":"2017-04-21T18:46:06.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2167","ESPORTSTMNT06":"200000399"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":572,"slug":"sangyoon","name":"Sangyoon","firstName":"Sangyun","lastName":"Kwon","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sangyoon-7zedseul.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:53:57.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4334","ESPORTSTMNT06":"200000376"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":733,"slug":"soul","name":"Soul","firstName":"Hyun-seok","lastName":"Seo","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/soul-4edhtacv.png","hometown":null,"region":"LCK","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-04-21T18:43:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4341","ESPORTSTMNT06":"200000395"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":742,"slug":"shy","name":"Shy","firstName":"Sangmyeon","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shy-flf80pma.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-31T00:47:21.000Z","bios":{"en_US":"<p>CJ Entus top lane player Sang-myeon \"Shy\" Park is one of the longest tenured professional League of Legends players in Korea. The 24 year old has been competing at the highest level since 2012 when he joined MiG Frost. Shy was at the forefront of CJ Entus’ golden age as an organization, when both CJ Entus Frost and sister team CJ Entus Blaze made the OGN Champions Finals with regularity. \n</p>\n<p>\nWhile sometimes timid off the Rift, Shy is quick with a smile, and quicker with a carry. Shy will need to lend all of his veteran experience to his teammates if they are going to succeed on the new ROX Tigers roster. But don’t count him out yet. Sometimes it’s the old dogs that have the biggest bite.\n</p>","fr_FR":"<p>Sur la voie du haut, CJ Entus dispose de Sang-myeon « Shy », l'un des vétérans les plus aguerris de la scène professionnelle coréenne. À 24 ans, il joue au plus haut niveau depuis 2012, époque à laquelle il a rejoint MiG Frost. Shy était aux avant-postes pendant l'âge d'or de CJ Entus en tant qu'organisation, c'est-à-dire lorsque les équipes sœurs CJ Entus Frost et CJ Entus Blaze terminaient régulièrement en finale d'OGN Champions. \n</p>\n<p>\nQuoiqu'il soit parfois timide en dehors de la Faille, Shy se rattrape avec un carry. Shy devra apporter toute son expérience de vétéran à ses coéquipiers s'ils entendent reprendre le flambeau de CJ lorsque le groupe était à son sommet. Ne l'oubliez pas trop vite. Le vieux lion a toujours un mot à dire face aux jeunes loups.\n</p>","pl_PL":"<p>Górny gracz CJ Entus, Sang-myeon „Shy” Park jest jednym z najbardziej doświadczonych profesjonalnych graczy w LoLa w Korei. Ten 24-latek grał na najwyższym poziomie od 2012 roku, kiedy dołączył do MiG Frost. Shy był kluczowym elementem złotej ery CJ Entus, kiedy zarówno CJ Entus Frost i siostrzana drużyna, CJ Entus Blaze regularnie docierały do finałów OGN Champions. \n</p>\n<p>\nChociaż niektórzy są nieśmiali poza Rift, Shy jest zawsze skory do uśmiechu i grania prowadzącym. Jeśli jego drużyna chce doprowadzić do kolejnej złotej ery CJ, musi podzielić się z nią całym swoim doświadczeniem. Nie należy go jednak ignorować. Czasem nawet skamieliny potrafią być groźne.\n</p>"},"foreignIds":{"drupalId":"371","ESPORTSTMNT06":"200000373"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":761,"slug":"winged","name":"Winged","firstName":"Tae-jin","lastName":"Park","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/winged-a4ook8lv.png","hometown":"South Korea","region":"LCK","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-04-21T18:43:16.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4161","ESPORTSTMNT06":"200000396"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":797,"slug":"candy","name":"Candy","firstName":"Seung-ju","lastName":"Kim","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/candy-aduwerg5.png","hometown":null,"region":"LMS","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-04-21T18:45:42.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4352","ESPORTSTMNT06":"200000397"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":1044,"slug":"lindarang","name":"Lindarang","firstName":"Manheung","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lindarang-8tddakt4.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:16:03.000Z","updatedAt":"2017-05-31T00:51:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000374"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1045,"slug":"seonghwan","name":"SeongHwan","firstName":"Seonghwan","lastName":"Yun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seonghwan-g8jv42cj.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:14:35.000Z","updatedAt":"2017-05-31T00:52:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000440"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1231,"slug":"key","name":"Key","firstName":"Hangi","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/key-9cxe5iyu.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-04-28T19:01:05.000Z","updatedAt":"2017-05-31T00:53:08.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000959"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1266,"slug":"veritas","name":"Veritas","firstName":"Kyoung-min","lastName":"Kim","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/veritas-5qeu5n3c.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:54.000Z","updatedAt":"2017-04-21T18:48:10.000Z","bios":{"en_US":"","de_DE":"<p>Kyoung-Min „Veritas“ Kim ist von koreanischer Herkunft, zog aber schon vor langer Zeit nach Australien und spielte 2014 dort in der OPL für Avant Garde. Im Folgejahr hatte er eine abwechslungsreiche Zeit in der nordamerikanischen Challenger Series, in welcher er für Final Five und Vortex die Rolle des Schützen annahm. Jedoch wurden ihm bisher jegliche Erfolge verwehrt und hofft im Sommer 2016 in seiner jungen Karriere bei Unicorns of Love Boden zu fassen. </p>\n\n<p>Der talentierte Koreaner ist jemand, der sich nicht von Meta-Picks beeinflussen lässt, sondern vertraut er auf seine Pocket-Picks Tristana und Jinx. </p>\n\n<p>Es bleibt abzuwarten, ob er mit den eher (für die LCS) unkonventionellen Champions mit den Größen Europas mithalten kann oder ob er vielleicht mal seine sekundäre Rolle, den Jungle, spielt, so wie er es in seinem letzten Spiel für Vortex tat. </p>","fr_FR":"<p>Kyoungmin « Veritas » Kim a rejoint les rangs de Unicorns of Love en tant que carry AD titulaire au début du segment d’été 2016. D’origine coréenne, il a joué pour l’équipe de Challengers Series américaine Vortex, anciennement connue sous le nom de Final Five. Il jouera jusqu’à la fin du segment d’été 2015 où son équipe terminera sur un score de 2-8. Veritas sera le seul joueur de son équipe à avoir joué toutes les parties du segment d’été et terminera la saison avec un KDA de 2. Il aura fort à faire chez Unicorns of Love afin de prouver qu’il a le niveau pour jouer en LCS.</p>","pl_PL":"<p>Kima śmiało można posądzić o posiadanie podróżniczego ducha, co potwierdza jego historia. Zainteresował się League of Legends stosunkowo późno w porównaniu do innych zawodników, ponieważ dopiero w trakcie trwania trzeciego sezonu. W ojczystej Korei Południowej rozpoczął karierę esportowca w półzawodowym zespole Virtual Throne Gaming. Spodobało mu się to, co oferuje życie profesjonalnego gracza, więc w sierpniu 2014 roku skorzystał z możliwości gry na scenie australijskiej w szeregach Avant Garde. Przeprowadzka pozwoliła mu rozwinąć skrzydła. Dlatego nie wahał się przed kolejnymi przenosinami. W grudniu 2015 roku „Veritas” dostał szansę pokazania się w Ameryce, a po przejściu etapu próbnego, zagrania w prestiżowych rozgrywkach NA Challenger Series. Reprezentował drużynę Final Five, która w międzyczasie dokonała fuzji z organizacją Coast. Niestety dla młodego Koreańczyka to wpłynęło bardzo negatywnie na wyniki całego zespołu – przegrał wszystkie pozostałe mecze w Challenger Series. Jednak pomimo załamania formy, Final Five miał okazję zagrać w rozgrywkach barażowych. Tam miała miejsce kolejna dotkliwa porażka, ponieważ gracze połączonych organizacji nie wygrali ani jednej gry. W związku z tym wynikiem drużyna pozostała w NA Challenger Series, a wkrótce potem została przemianowana na Vortex. </p>\n<p>Miało to symbolizować nowy rozdział w historii zespołu i kolejne podejście do kwalifikacji do NA LCS w letnim sezonie. „Veritas” był jednym zawodnikiem, który brał udział we wszystkich meczach zespołu. Jednak ten okres również nie był szczęśliwy dla Kima, ponieważ skończyli gorzej niż za poprzednim razem – z wynikiem dwóch wygranych i ośmiu porażek. Pomimo licznych niepowodzeń nie zraził się w swojej walce o karierę profesjonalnego gracza. Jak czas pokazał słusznie. W maju 2016 roku dołączył do młodego europejskiego zespołu Unicorns Of Love. Wiązało się to z kolejną przeprowadzką, na czwarty z kolei kontynent, lecz „Veritas” poradził sobie z tymi niedogodnościami – w pościgu za sukcesem okazał się naprawdę wytrzymały. Sam fakt wystąpienia w EU LCS w letnim sezonie 2016 to dla niego osiągnięcie, ponieważ nigdy nie miał okazji zagrać w tak renomowanej lidze.</p>\n<p>Utalentowany Koreański prowadzący to jeden z graczy, którzy ponad wszystko kochają jednego bohatera. Dla Kima to Vayne. Jednak to wcale nie wyklucza jego umiejętności w posługiwaniu się innymi strzelcami jak na przykład: Ezreal, Kalista czy Twitch. Zresztą wśród graczy wyróżnia się swoimi osiągnięciami na różnych kontynentach – udało mu się dostać do Kręgu Pretendenta w Korei Południowej, Australii i Ameryce Północnej. Aktualnie przygotowuje się do powtórzenia tego wyczynu w Europie. Kolejny kontrast to niechęć prowadzącego UOL do serwisów społecznościowych. Nie szuka tam kontaktu z potencjalnymi fanami, chociaż czasem zdarza się mu streamować swoje gry. Tylko z nich można się dowiedzieć ciekawostek o jego zainteresowaniach. Dotyczących gry – tego, że oprócz pozycji prowadzącego lubi czasem znaleźć się w dżungli, jak i tych poza League of Legends – w wolnych chwilach lubi oddać się grze w bilard. Jego usposobienie najlepiej oddaje jego pseudonim, „Veritas” po łacinie oznacza „prawdę”, co zostało mu zasugerowane przez jego przyjaciela.</p>\n"},"foreignIds":{"TRLH3":"1001310011","TRLH4":"1001270011","TRLH2":"1001250057","FRA1TMNT2":"45030","ESPORTSTMNT06":"200000398"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":1270,"slug":"mightybear","name":"Mightybear","firstName":"Min-soo","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mightybear-dx94b7va.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:33:03.000Z","updatedAt":"2017-05-31T00:46:49.000Z","bios":{"en_US":"<p>\nMin-soo “Mightybear” Kim launched his professional career in late 2014 while playing for team Positive Energy in China. He then moved on to powerhouse Chinese esports organization Newbee (best known for their Dota 2 teams), where he stayed until early 2016. \n</p>\n<p>\nIn mid-2016 Mightybear decided to make the move to Europe in order to play with Team Vitality. After a brief stay, he made his way to Korea for 2017.\n</p>","de_DE":"<p>Min-Soo „Mightybear“ Kim ist praktisch der Neue in der Klasse. Er fing mit der Schule direkt im Ausland an, wo er sich allerdings nicht wohl fühlte, weil er nie zu Wort kam. Der Suchdrang nach einem neuen Zuhause wuchs schnell und Worten folgten die Taten. </p>\n\n<p>Im Klartext heißt dies, dass der koreanische Amateur, der vorher unter „Moon“ und „PandaBears“ bekannt war, sein professionelles Debüt in der Zweitliga Chinas, der LSPL, feierte. Bei Positive Energy konnte er kein Spiel für seine erste Mannschaft absolvieren, doch gab es für ihn einen Hauch an Hoffnung, als Newbee (heute in der LPL) den Club aufkaufte. Tatsächlich kam er im Demacia Cup 2015 Summer gegen Team WE Future und während der LPL 2016 Spring Promotion zum Einsatz. Allerdings konnte er mit den einhergehenden sechs Niederlagen (beide 0:3-Spielstände) bisher noch nichts unter Beweis stellen und hofft wieder einmal von seinen Fans und Kollegen respektiert geachtet zu werden. </p>\n\n<p>Mit Vitality könnte dies sein Durchbruch sein, eine Mannschaft aus alten Veteranen und hungrigen Amateuren. Die Mischung hat sich in League of Legends stets als Formel für Erfolg bestätigt und mit dem frisch entzündetem Feuer in Mightybear, könnte er vielleicht der neue Kang-Yun „Trick“ Kim der EU LCS sein.\n</p>","fr_FR":"<p>La vague de jeunes junglers talentueux venus de Corée du Sud ne s’arrête pas ! Après Cho « H0R0 » Jae-hwan chez Millenium, Kim « Reignover » Yeu-jin puis Lee « Spirit » Da-yoon chez Fnatic et Kim « Trick » Gang-yun chez G2 Esports, voici que Kim « Mightybear » Min-su débarque à son tour sur le Vieux Continent. Sa destination n’est autre que la structure française Team Vitality. </p>\n\n<p>Mightybear a fait ses premiers pas en Chine, notamment dans l’équipe Newbee, qui évoluait en LSPL, la deuxième division chinoise. En 2016, il n’a disputé aucun match compétitif car il était le remplaçant de Baek « Swift » Da-hoon. </p>\n\n<p>Son intégration au sein de sa nouvelle équipe a été facilitée par sa maîtrise déjà très bonne de l’anglais, ce qui a facilité le choix de Vitality. Sa vision de jeu et son agressivité devraient permettre à Vitality de trouver un second souffle. Sa mission reste périlleuse car il doit faire oublier Ilyas « Shook » Hartsema en se montrant plus régulier et en montrant plus d’initiative. </p>","pl_PL":"<p>Min-su „Mightybear” Kim, pomimo koreańskiego pochodzenia, karierę profesjonalnego gracza rozpoczął w Chinach. W grudniu 2014 roku dołączył do pierwszej esportowej organizacji w Krainie Smoków – do Positive Energy. W szeregach chińskiego zespołu udało mu się wziąć udział w wielu pomniejszych turniejach, a nawet zagrać przeciwko krajowym potęgom, takim jak LGD Gaming czy Team WE. Do swoich sukcesów z tego okresu może zaliczyć utrzymanie się w drugorzędnej lidze w Chinach. Jednak już w maju 2015 roku grał pod nową banderą, gdyż został wykupiony z całym zespołem przez inną organizację. Dołączył do drużyny Newbee, gdzie miał największe osiągnięcia podczas pobytu w Chinach. Wraz z zespołem miał okazję zawalczyć w kwalifikacjach do najbardziej prestiżowej ligi w Państwie Środka, czyli LPL. Jednak na jego drodze kolejny raz stanął zespół WE, przeciwko któremu nie pomogły nadzwyczajne umiejętności Min-su w grze Gragasem. </p>\n<p>W maju 2016 roku został zapytany przez swojego agenta czy chciałby profesjonalnie grać w Europie. Odpowiedź Min-su była zdecydowanie pozytywna. Już wtedy potrafił mówić po angielsku, więc nie widział żadnych przeszkód w dołączeniu do Team Vitality. „Mightybear” od początku zaskakiwał swoim pogodnym usposobieniem. W wywiadzie przed letnim splitem EU LCS 2016 stwierdził, że nie odczuwa presji i jest bardzo optymistycznie nastawiony do gry w Europie. Po przyjeździe na nowy kontynent był zachwycony wyglądem miast i stylem życia Europejczyków. Jak tylko stał się członkiem Team Vitality, to założył konta na portalach społecznościowych. Od razu rozpoczął bardzo aktywne życie na tych stronach, przepełnione elementami humorystycznymi związanymi z jego pseudonimem „Mightybear”.</p>\n<p>W piątym sezonie zauważalnie gustował w niezwykle twardych dżunglerach, chociaż za swoich ulubionych bohaterów uważa Nidalee i Gravesa. Najlepiej sobie radził Gragasem i Rek’sai, lecz zdarzało się również, że wybierał bohaterów innego typu, jak na przykład ukochaną Nidalee. Od maja 2016 roku, czyli przeprowadzki do Europy, coraz częściej można było zobaczyć go w akcji Gravesem i Kindred. Jego największym osobistym osiągnięciem było wejście do Kręgu Pretendenta w Korei, który to wyczyn udało mu się powtórzyć na serwerze EU West w czasie krótszym niż miesiąc. Imponującym osiągnięciem oczywiście pochwalił się na portalach społecznościowych.</p>\n\n"},"foreignIds":{"TRLH3":"1001310014","TRLH4":"1001270014","TRLH2":"1001250062","FRA1TMNT2":"45034","ESPORTSTMNT06":"200001028"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1894,"slug":"racoon","name":"Racoon","firstName":"Sung-ho","lastName":"Park","roleSlug":"support","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-21T18:45:15.000Z","updatedAt":"2017-04-21T18:46:02.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000501"},"socialNetworks":{},"champions":[],"liveGameTeam":93},{"id":2049,"slug":"lava","name":"Lava","firstName":"Taehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:26:19.000Z","updatedAt":"2017-07-01T23:40:36.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001525"},"socialNetworks":{},"champions":[],"liveGameTeam":108}],"scheduleItems":[{"id":"AVMfgDXfJTrHluSI14Nl","content":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:match:303997cd-02ec-43df-a0d2-35b377022d22","scheduledTime":"2016-03-23T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda","blockLabel":"11","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:bracket:9342e2fe-50d2-41dd-bb72-bb12c42fb5c6"},"match":"303997cd-02ec-43df-a0d2-35b377022d22","tournament":"0a5fb908-70c8-411b-81e0-27a83c167eda","bracket":"9342e2fe-50d2-41dd-bb72-bb12c42fb5c6","league":"6"}],"gameIdMappings":[{"id":"66222dd8-27d9-4d3c-ab4d-e7404576a168","gameHash":"1c156538b1b99af0"},{"id":"5a00129b-e75f-4625-ad0e-fcb09155d2f7","gameHash":"b06b6f9234cccbef"}],"videos":[{"id":2290,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:5a00129b-e75f-4625-ad0e-fcb09155d2f7","source":"https://www.youtube.com/embed/jl3Lm0HGNNU?wmode=transparent&start=9214","createdAt":"2016-03-24T23:26:19.000Z","updatedAt":"2016-03-24T23:26:19.000Z","game":"5a00129b-e75f-4625-ad0e-fcb09155d2f7"},{"id":2291,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:66222dd8-27d9-4d3c-ab4d-e7404576a168","source":"https://www.youtube.com/embed/jl3Lm0HGNNU?wmode=transparent&start=13139","createdAt":"2016-03-24T23:28:18.000Z","updatedAt":"2016-03-24T23:28:18.000Z","game":"66222dd8-27d9-4d3c-ab4d-e7404576a168"}],"htmlBlocks":[],"match":{"id":"303997cd-02ec-43df-a0d2-35b377022d22","name":"CJE-vs-ROX","position":16,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"},{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],"games":{"66222dd8-27d9-4d3c-ab4d-e7404576a168":{"id":"66222dd8-27d9-4d3c-ab4d-e7404576a168","name":"G2","generatedName":"CJE|ROX|G2|303997cd02ec43dfa0d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"},{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],"standings":{"result":[[{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"}]],"timestamp":1458738240969,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1010341","gameRealm":"TRKR1","platformId":"TRKR1:1010341","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5a00129b-e75f-4625-ad0e-fcb09155d2f7":{"id":"5a00129b-e75f-4625-ad0e-fcb09155d2f7","name":"G1","generatedName":"CJE|ROX|G1|303997cd02ec43dfa0d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"},{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],"standings":{"result":[[{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"}]],"timestamp":1458738183582,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1010327","gameRealm":"TRKR1","platformId":"TRKR1:1010327","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d1bd0fba-4519-4bb9-b4f5-155fd4aea6a2":{"id":"d1bd0fba-4519-4bb9-b4f5-155fd4aea6a2","name":"G3","generatedName":"CJE|ROX|G3|303997cd02ec43dfa0d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"},{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"72fc1603-b4aa-4713-a666-bb5403e593ae"}],[{"roster":"9bbb7a83-0d84-454f-a39a-7697452c8770"}]],"timestamp":1458738240969,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}