{"teams":[{"id":215,"slug":"team-envy","name":"Team Envy","guid":"be713b5f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-1tyrikdl.png","acronym":"NV","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-i4es8cq5.png","createdAt":"2016-05-18T22:11:40.000Z","updatedAt":"2017-07-19T23:33:05.000Z","bios":{"en_US":"<p>Team Envy burst into the NA LCS in 2016 after acquiring the slot of Renegades. Their team fared well, gaining a playoff berth in their first split as an organization. The honeymoon period quickly ended though, and the team switched up their roster ahead of the 2017 Spring Split, adding veterans Lira and Apollo into the mix. After narrowly avoiding relegation, Envy will build around their breakout jungler Lira as they head into the summer split.</p>\n<p>Coach: Dong Hwan \"Violet\" Kim</p>","de_DE":"Team Envy stürmte 2016 in die NA LCS, nachdem sie den Platz der Renegades ergattert hatten. Die Mannschaft präsentierte sich gut und schaffte es gleich in ihrem ersten Split, in die Entscheidungsspiele einzuziehen. Kurz darauf endete die Hochphase jedoch und die Mannschaft ergänzte ihre Aufstellung für den Frühjahrs-Split 2017 um die Veteranen Lira und Apollo. Die beiden stoßen gerade noch rechtzeitig zum Rest der Mannschaft, um vor dem Beginn des Frühjahrs-Splits, in dem sie wieder die Entscheidungsspiele erreichen wollen, trainieren zu können."},"foreignIds":{},"players":[149,160,247,347,545,680,1449],"starters":[160,247,545,680,1449],"subs":[149,347]},{"id":271,"slug":"gold-coin-united","name":"Gold Coin United","guid":"be724e56-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/gold-coin-united-iwq6t55n.png","acronym":"GCU","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:13:17.000Z","updatedAt":"2017-08-12T21:17:46.000Z","bios":{"en_US":"<p>Coach: Yoonsup \"Locodoco\" Choi</p>"},"foreignIds":{},"players":[185,366,529,747,1035,1172,1317,1666],"starters":[185,529,747,1035,1317],"subs":[366,1172,1666]}],"players":[{"id":149,"slug":"nien8","name":"Nientonsoh","firstName":"Zach","lastName":"Malhas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nien8-cf8vutwb.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-19T22:31:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"176","TRLH1":"200000231","TRLH2":"200000135"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":271},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":366,"slug":"fenix","name":"Fenix","firstName":"Jaehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fenix-38i6egfj.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-07T21:31:21.000Z","bios":{"en_US":"<p>\nYou've probably seen Fenix's <a href=”https://youtu.be/Z9D9o4GJv0w?t=36m06s” target=”_blank”>1v4 Azir Quadra</a> highlight more times than you can count, but that's only one of the dozens of memorable moments Jae-hun “Fenix” Kim put up in his debut year in the LCS. An ex-Jin Air Falcon from Korea, the player formerly known as Miso burst onto the scene and into our hearts when he joined Liquid at the start of the 2015 season. With a variety of stylish, colourful hairdos and clips that can ignite promo reels, Fenix is a player who demands attention.\n</p>","fr_FR":"<p>Vous avez sans doute vu son grand moment, le quadruplé à 1 contre 4 avec Azir, plus souvent que vous \n\nn'êtes capable de le dire, mais ce n'était là que l'un des nombreux grands moments de Jae-hun « Fenix » \n\nKim depuis ses débuts aux LCS. Ancien Jin Air Falcon en Corée, ce joueur autrefois connu sous le nom de \n\nMiso a débarqué en force sur la scène et s'est fait une popularité en rejoignant Liquid au début de la \n\nsaison 2015. Confrontés à des combats aussi bouillants que le rouge de sa chevelure, les adversaires de \n\nFenix passent beaucoup de temps à méditer sur Shurima.</p>\n\n<p>Et si l'Empereur est devenu son champion attitré, il lui a fallu bien plus qu'un coup flamboyant pour être \n\nnommé meilleur mid laner des LCS NA 2015. Capable de mettre en permanence la pression, qu'il joue \n\nassassin, tireur ou mage de contrôle, Fenix a enfin trouvé l'occasion de briller en Amérique du Nord. \n\nQuand Fenix arpente la Faille, laissez passer. Ou il vous en coûtera.</p>","pl_PL":"<p>To jeden z najbardziej doświadczonych graczy na świecie, gdyż gra w League of Legends profesjonalnie od 2010 roku. Zaczynał w drużynach Haters i compLexity Gaming. Później, jak stał się bardziej rozpoznawalny na scenie esportowej, został zaproszony do współpracy z Team Dignitas. W tej organizacji zyskał sławę grając Renektonem na top-lanie, zanim, wraz z kolejną zmianą drużyny, przeniósł się do jungli. Ponadto było to jego pierwsze spotkanie z NA LCS. W Team Dignitas spędził prawie okrągły rok, opuszczając go w grudniu 2012 roku. </p>\n<p>\nPoczątkowo miał duże problemy z opanowaniem emocji, w szczególności tych negatywnych. Na przykład, pomijając kwestie słownictwa, zniszczył swoje słuchawki z radości po wygranej grze na 2012 MLG Pro Circuit. Ostatecznie, 4 grudnia 2012 roku, to doprowadziło do wykluczenia jego wszystkich kont z rozgrywki na prawie cały rok. \"IWillDominate\" zrozumiał swoje błędne zachowanie i rozpoczął proces rehabilitacji w oczach środowiska League of Legends. Przede wszystkim dołączył do organizacji Curse Gaming w styczniu 2013 roku. Dalej udzielał się w życiu zawodników - grał w Curse Academy i występował w formie trenera. Jednocześnie zawzięcie pracował nad swoimi reakcjami w obliczu wielkich emocji. Cała historia miała szczęśliwe zakończenie, gdyż Christian nareszcie w październiku 2013 roku mógł wrócić na scenę esportową. Dołączył wtedy oficjalnie do Team Curse jako jungler i spędził tam kolejne dwa niecałe lata. </p>\n<p>\nFuzja i przejście pod opiekuńcze skrzydła Team Liquid wyszła Christianowi na dobre. W pierwszym tygodniu wiosennego sezonu NA LCS 2015 \"IWillDominate\" wygrał nagrodę najbardziej wartościowego gracza. Osiągnął to fenomenalnymi grami Nunu i Jarvanem IV, w których jego łączne KDA wyniosło ponad 13. Później meczom jego drużyny często brakowało komunikacji, która ze względu na dwóch nowych graczy z Korei, była bardzo utrudniona. Jednak z czasem robili postępy, ostatecznie kończąc z wynikiem 9:9 w tym okresie. Największy sukces w karierze Christiana Rivera to letni sezon NA LCS 2015. Wraz z Team Liquid wszedł na wyżyny swoich możliwości. Po zaciętej walce z CLG, TiP i Gravity udało mu się skończyć ten okres na pierwszym miejscu w Ameryce. Niestety wkrótce potem miała miejsce jego największa porażka, a ostatnie osiągnięcia tylko spotęgowały odczucie upadku. Pomimo takich wyników pod koniec sezonu Christianowi nie udało się zakwalifikować do Mistrzostw Świata 2015. Jego marzeniem jest zagranie w MŚ swoimi ulubionymi bohaterami – Shaco i Xin’zhao.\n</p>"},"foreignIds":{"drupalId":"3663","ESPORTSTMNT02":"200000754","TRLH1":"200000301"},"socialNetworks":{"twitch":"http://www.twitch.tv/fenixl0l","facebook":"https://www.facebook.com/fenixl0l","twitter":"https://twitter.com/LiquidFeniX"},"champions":[],"liveGameTeam":271},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":545,"slug":"lira","name":"LirA","firstName":"Taeyou","lastName":"Nam","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lira-8wdoxm79.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-25T23:33:32.000Z","bios":{"en_US":"<p>Tae-yoo \"LirA\" Nam has been on his jungle game ever since 2013. A veteran of Korea’s LCK, he’s played for teams like CJ Entus, KT Rolster, and the Afreeca Freecs. LirA has impressed while on the Rift, and he’s only gotten better with age. Even though his play improved over time, he began sharing his role with SeongHwan while on the Afreeca Freecs.</p>\n\n<p>The uncertainty with his role going forward lead LirA to look for opportunities elsewhere and soon enough he was on a flight headed to Los Angeles. He joined up with Team Envy as their new starting jungler and looks like a star. Despite a disappointing record, Lira's play in the jungle earned his team leads early in many games. If he can help convert just some of those early leads to late-game ones, LirA and Team Envy can run with the best of them.</p>","de_DE":"Tae-yoo „Lira“ Nam dominiert schon seit 2013 im Dschungel. Als Veteran der koreanischen LCK hat er schon bei CJ Entus, KT Rolster und Afreeca Freecs gespielt. Lira hat in der Kluft beeindruckende Leistungen abgeliefert und er wurde mit dem Alter nur besser. Obwohl er mit der Zeit immer besser wurde, teilte er sich seinen Platz bei den Afreeca Freecs mit SeongHwan.\n</p>\nDa er sich seines Arbeitsplatzes nicht mehr sicher sein konnte, schaute er sich nach anderen Möglichkeiten um, und nur kurze Zeit später saß er in einem Flugzeug Richtung Los Angeles. Er hat sich Team Envy angeschlossen und wie es scheint, ist er eine unmittelbare Verbesserung im Dschungel. Er beherrscht jeden Champion von Lee Sin bis Kindred, es geht nur darum, was sein Team gerade braucht. Liras Reichtum an Wissen und Erfahrung wird es dem neuen Team Envy ermöglichen, im Frühjahrs-Split 2017 wieder um den Einzug in die Entscheidungsspiele zu kämpfen.\n"},"foreignIds":{"drupalId":"4332","TRLH1":"200000225","TRLH2":"200000129"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":747,"slug":"madlife","name":"Madlife","firstName":"Mingi","lastName":"Hong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/madlife-4tps9t22.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T23:24:25.000Z","bios":{"en_US":"<p>Mingi \"Madlife\" Hong, also referred to as \"god\", is one of the most popular League of Legends players in global esports. He earned the \"god\" moniker due to his ability to see into the future and manipulate his opponents on the Rift in such a way that they always walk into his traps. How else can we explain his Blitzcrank grabs landing successfully when an opponent is Flashing away? And don’t get us started on Thresh. Once the Chain Warden was introduced, Madlife's legend only grew. His uncanny hooks and flays drive the crowd into a joyous frenzy, and leave his opponent’s befuddled and staring at grey screens.</p>","fr_FR":"<p>Min-gi « MadLife » Hong, aussi appelé « god », est l'un des joueurs les plus populaires de l'e-sport international de League of Legends. Son surnom de « god » (« dieu » en français) est dû à sa capacité à prédire l'avenir et à manipuler ses adversaires sur la Faille pour qu'ils tombent dans ses pièges. Sinon, comment expliquer ses Grappins de Blitzcrank réussis lorsque son adversaire fait un Saut éclair ? Et ne parlons même pas de Thresh. Avec l'arrivée du Garde aux chaînes, la légende de MadLife n'a fait que s'amplifier. Ses coups de crochet et son adresse au jeu du Fauchage mettent la foule en délire et ses adversaires se retrouvent à fixer leur écran gris sans même comprendre ce qui leur est arrivé.</p>\n\n<p>Les compétences mécaniques de MadLife font de lui un excellent support et lui valent d'être reconnu comme l'un des meilleurs joueurs au monde dans sa catégorie. CJ Entus ayant été reléguée des LCK, c'est uniquement grâce à son talent que MadLife a été invité à Barcelone. Indépendamment de ce qui s'est passé pendant le segment d'été, MadLife a une chance se mesurer avec brio aux meilleurs joueurs du monde à l'événement All-Stars 2016. Qu'il assène un crochet aveugle dans le brouillard de guerre ou qu'il pulvérise l'ADC adverse, on peut compter sur MadLife pour semer le chaos.</p>","pl_PL":"Min-gi „MadLife” Hong, zwany także „bogiem”, jest jednym z najpopularniejszych zawodników League of Legends w światowym e-sporcie. Zasłużył sobie na przezwisko „boga” swoją zdolnością przewidywania przyszłości i manipulowania rywalami na Summoner’s Rift w taki sposób, że zawsze wpadają w jego pułapki. Bo jak inaczej można wyjaśnić to, że jego Blitzcrank zawsze trafia, gdy przeciwnik odskakuje Błyskiem? I nawet nie wspominajcie o Threshu. Po wprowadzeniu Strażnika Łańcuchów legenda MadLife’a jeszcze się umocniła. Jego niesamowite haki i młynki wprowadzają widownię w szał radości, a przeciwników pozostawiają zdezorientowanych i gapiących się w szary ekran.</p>\n\nUmiejętności mechaniczne MadLife’a przekładają się na oszałamiającą grę w roli wsparcia, co zapewnia mu pozycję jednego z najlepszych wspierających na świecie. To właśnie ta umiejętność przyniosła MadLifowi zaproszenie do Barcelony, szczególnie biorąc pod uwagę odejście CJ Entus z LCK. Bez względu na to, co stało się podczas letniego splitu, MadLife ma szansę zaprezentować na All-Star 2016 swój styl na tle kilku z najlepszych zawodników świata. Obojętnie, czy trafi wyrzuconym na ślepo hakiem przez mgłę wojny, czy zdemoluje prowadzącego rywali, można liczyć na to, że MadLife narobi sporo zamieszania.\n","es_ES":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\" (dios), es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo de \"god\" gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de apoyo deslumbrante y en el reconocimiento como uno de los mejores apoyos del mundo. No es ni más ni menos que por esta habilidad que MadLife ha sido invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus ha quedado relegado en la LCK. Al margen de lo que ocurriese en el split de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al ADC enemigo, podéis contar con que MadLife sembrará el caos.</p>","de_DE":"<p>Min-gi „MadLife“ Hong, auch bekannt als „Gott“, ist einer der bekanntesten „League of Legends“-Spieler der gesamten E-Sport-Szene. Er trägt den Spitznamen „Gott“, weil er in die Zukunft schauen und seine Gegner in der Kluft so manipulieren kann, dass sie immer in seine Fallen tappen. Wir sonst könnte man erklären, dass er mit Blitzcrank auch dann trifft, wenn der Gegner gerade Blitz benutzt? Und mit Thresh wollen wir erst gar nicht anfangen. Als der Kettenwächter vorgestellt wurde, wurde die Legende um MadLife nur noch größer. Seine verblüffenden Haken- und Peitschenangriffe verzücken das Publikum und lassen seine Gegner mit verdutzten Gesichtern vor den Bildschirmen zurück.</p>\n\n<p>MadLife nutzt seine mechanischen Fähigkeiten für überwältigende Unterstützungsspielzüge, die ihn zu einem der besten Supporter der Welt machen. Diese Fähigkeiten allein haben ausgereicht, dass MadLife nach Barcelona eingeladen wurde, vor allem wenn man CJ Entus’ Abstieg aus der LCK bedenkt. Unabhängig davon, was beim Sommer-Split passiert ist, hat MadLife beim All-Stars-Event 2016 die Chance, sich gegen die besten Spieler der Welt zu behaupten. Egal, ob er gerade einen Gegner im Nebel des Krieges mit seinem Haken trifft oder den gegnerischen AD-Carry in Stücke reißt, MadLife wird ordentlich Chaos stiften.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"MadLife\" 홍민기 선수는 전세계 리그 오브 레전드 선수 중 최고의 인기를 누리는 선수 중 하나이며, ‘신’으로 불리까지 합니다. 전장에서 미래를 내다보고 상대의 움직임을 조종해 함정에 빠져들게 하는 능력이 있기 때문이죠. 그런 능력이 아니고서는 점멸로 도망치는 적을 블리츠크랭크 그랩으로 붙잡아오는 이 선수의 플레이를 설명할 수가 없습니다. 쓰레쉬는 말할 것도 없죠. 쓰레쉬가 출시되자마자 MadLife 선수의 전설은 더욱 확고해졌습니다. 이해할 수 없을 만큼 절묘한 사형 선고와 사슬 채찍 활용으로 관객들을 열광시키고, 상대 선수들은 멍하니 회색 화면을 쳐다보게 만들었죠. </p>\n<p style=”font-family:”나눔고딕”;\">Madlife 선수의 뛰어난 피지컬은 서포터로서 빛나는 명장면들을 만들어내며 세계 최고의 서포터 중 하나로 인정받을 수 있었던 밑바탕입니다. 이 선수는 CJ Entus를 승리로 이끌기 위해 집념을 불태우고 있습니다. 어떤 난관을 통과해야 하더라도 말이죠. </p>\n","cs_CZ":"<p>Min-gi „MadLife“ Hong, taktéž známý jako „bůh“, patří mezi nejoblíbenější profesionální hráče League of Legends na světě. Svou přezdívku „bůh“ si vysloužil schopností nahlížet do budoucnosti a manipulovat svými soupeři ve Žlebu tak, aby vždy nakráčeli do jeho pastí. Jak jinak vysvětlit, že se svým Blitzcrankem dokáže pokaždé zachytit protivníka, který se právě stahuje pomocí Skoku? A to ani nemluvíme o Threshovi. Poté, co se hra rozrostla o Řetězového strážce, se MadLife stal doslova legendou. Jeho zákeřné zachytávání a odhazování nepřátel nutí davy diváků řičet nadšením a zmatené soupeře sledovat šedou obrazovku.</p>\n\n<p>Své úžasné mechanické dovednosti využívá MadLife k provádění skvěle načasovaných akcí, pro které je označován za jednoho z nejnadanějších podpůrných hráčů světa. A vzhledem k tomu, že tým CJ Entus sestoupil z LCK, to jsou právě jen a jen jeho schopnosti, jimž MadLife vděčí za pozvánku do Barcelony. Bez ohledu na výsledek letního splitu bude mít MadLife na turnaji All-Star 2016 šanci zařádit si ve Žlebu s těmi nejlepšími z nejlepších. A ať už zrovna bude naslepo střílet hák skrz opar neznáma nebo drtit soupeřova ADC, můžete vzít jed na to, že MadLife ve hře rozpoutá pořádný masakr.</p>","el_GR":"<p>Ο Min-gi \"MadLife\" Hong, γνωστός επίσης απλά ως «θεός», είναι ένας από τους πιο δημοφιλείς παίκτες του League of Legends στη διεθνή σκηνή των esports. Του έδωσαν το ψευδώνυμο «θεός», επειδή μπορεί να προβλέπει τις επόμενες κινήσεις των αντιπάλων και να τις εκμεταλλεύεται με τέτοιο τρόπο, ώστε να πέφτουν στις παγίδες του. Πώς αλλιώς μπορεί να εξηγήσει κανείς ότι καταφέρνει να αρπάξει τον αντίπαλό του με τον Μπλίτζκρανκ, ακόμα και όταν αυτός κάνει Φλας για να ξεφύγει; Για να μην πούμε και για τον Θρες. Όταν ο Δεσμοφύλακας των Ψυχών μπήκε στο παιχνίδι, ο θρύλος του MadLife ενισχύθηκε ακόμη περισσότερο. Η τρομερή ακρίβεια με την οποία χρησιμοποιεί το φανάρι και το μαστίγωμα προκαλεί αμόκ στο ακροατήριο, ενώ οι αντίπαλοί του δεν μπορούν να κάνουν κάτι άλλο από το να κοιτάνε απορημένοι τη γκρίζα οθόνη.</p>\n\n<p>Ο Madlife ξέρει να χειρίζεται τους μηχανισμούς του παιχνιδιού με καταπληκτική μαεστρία. Δεν είναι καθόλου περίεργο που θεωρείται ένας από τους καλύτερους υποστηρικτές στον κόσμο. Το εκπληκτικό του παιχνίδι είναι ο λόγος που ο MadLife κέρδισε αυτήν την πρόσκληση για τη Βαρκελώνη, παρά τον υποβιβασμό των CJ Entus από το LCK. Πέρα από τα όσα συνέβησαν στο Summer Split, ο MadLife θα έχει μια ευκαιρία να μαγέψει το κοινό ενάντια στους καλύτερους παίκτες του κόσμου στο Τουρνουά All-Star 2016. Μπορεί να τον δείτε να πετάει στα τυφλά ένα φανάρι μέσα στην ομίχλη πολέμου ή να κάνει σκόνη τον ADC της άλλης ομάδας. Σε κάθε περίπτωση, ο MadLife θα σπείρει τον τρόμο στους αντιπάλους του.</p>","hu_HU":"Min-gi „MadLife” Hong (aki az „isten” névre is hallgat) az egyik legnépszerűbb League of Legends-játékos a nemzetközi e-sport színterén. Azért kezdték „istennek” hívni, mert valahogy mindig a jövőbe lát, és úgy manipulálja az ellenfeleit a Szurdokban, hogy belesétáljanak a csapdáiba. Hogy máshogy magyarázhatnánk, hogy Blitzcrankkel elkapja az Átvillanással menekülő ellenfeleket? És akkor a Thresh-féle mutatványairól ne is beszéljünk. A Láncok őrének megjelenése óta MadLife még veszélyesebbé vált. Az elképesztő elkapások és nyúzások őrjöngő éljenzést váltanak ki a nézők körében, az ellenfeleknél meg általában szürke képernyőket.</p>\n\nMadlife játékbeli képességei lenyűgöző támogatói teljesítményt eredményeznek, és egyértelműen ő az egyik legjobb támogató a világon. MadLife a saját képességei jogán került a barcelonai fellépők közé, különösen, hogy a CJ Entus kibukott az LCK-ből. A nyári szakaszban történtek ellenére MadLife a 2016-os All-Star gálán a világ néhány legjobbjával játszhat. A háború ködébe kilőtt horgok, porrá zúzott lövészek: MadLife elemében lesz.\n","it_IT":"<p>Min-gi \"MadLife\" Hong, anche conosciuto come \"dio\", è uno dei giocatori di LoL più popolari nel mondo degli eSport. Si è guadagnato il nomignolo di \"dio\" per la sua abilità di prevedere il futuro e manovrare i suoi avversari in Landa in modo da farli sempre finire nelle sue trappole. Come altro spiegare il fatto che riesca a mettere a segno le sue prese con Blitzcrank mentre l'avversario usa Flash? Per non parlare di Thresh. Dopo l'arrivo del carceriere, la leggenda di MadLife è diventata ancora più... leggendaria. I suoi ganci e le sue sferzate impossibili fanno impazzire il pubblico e lasciano i suoi avversari impotenti davanti a una schermata grigia.</p>\n\nLe abilità meccaniche di MadLife si traducono in un'incredibile capacità di supporto e gli sono valse l'ingresso nell'élite dei supporti. È solo grazie a questa abilità che MadLife è riuscito a ottenere un biglietto per Barcellona, soprattutto alla luce della retrocessione dei CJ Entus in LCK. A prescindere da quanto accaduto al Summer Split, MadLife ha ora una nuova opportunità per scontrarsi con alcuni dei più grandi giocatori del mondo all'All-Star 2016. Sia che si prepari a lanciare i suoi uncini alla cieca nella nebbia di guerra o a polverizzare gli ADC avversari, MadLife porterà sicuramente altro caos nella Landa.\n","ro_RO":"Min-gi \"MadLife\" Hong, cunoscut și ca ''zeul'', este unul dintre cei mai populari jucători de League of Legends din lumea eSports. Porecla ''zeul'' a primit-o datorită abilității de a prezice viitorul și de a-și manipula adversarii din Rift în așa fel încât să-i cadă mereu în capcane. Cum altfel se poate explica faptul că-și trage cu succes adversarii cu Blitzcrank, fix când aceștia folosesc ''Flash''? Asta ca să nu vorbim de jocul lui cu Thresh. Când l-am lansat pe temnicerul blestemat, legenda lui MadLife a luat proporții. Mulțimea e în delir când își folosește lanțul și ''Tortura'' în mod creativ, iar adversarul rămâne cu ecranul gri și tot nu se prinde ce-a pățit.</p>\n\nAbilitățile mecanice ale lui Madlife se transpun în momente impresionante de suport și i-au adus un renume mondial. Pe baza îndemânării sale, MadLife a obținut invitația la Barcelona în ciuda faptului că CJ Entus a fost retrogradată din LCK. Indiferent de ceea ce s-a întâmplat în etapa de vară, MadLife are acum ocazia de a-i copleși pe unii dintre cei mai buni jucători din lume la All-Star Event 2016. Fie că nimerește prin negura războiului cu un cârlig sau că pulverizează ADC-ul advers, puteți conta pe MadLife să creeze haos.\n","es_AR":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","es_MX":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","pt_BR":"<p>Min-gi \"MadLife\" Hong, também conhecido por alguns como “god” (deus), é um dos jogadores mais populares de League of Legends do mundo. Ele recebeu o título de “deus” devido à sua habilidade de prever o futuro e manipular seus oponentes em Summoner’s Rift, de modo que eles sempre caíam em suas armadilhas. De que outra forma podemos explicar os puxões de Blitzcrank acertando, mesmo quando um oponente deu Flash? E nem vamos entrar no mérito do Thresh. Quando o Guardião das Correntes entrou no jogo, a lenda do MadLife só cresceu mais. Seus ganchos e Esfolar “mentirosos” deixaram o público maluco e os oponentes boquiabertos enquanto olhavam para suas telas cinzas.</p>\n\n<p>A habilidade mecânica de MadLife se transforma em jogadas incríveis de suporte e o reconhecimento como um dos melhores do mundo. É contando com essa habilidade que MadLife conseguiu garantir sua ida para Barcelona, especialmente considerando que a CJ Entus foi rebaixada na LCK. Apesar do que aconteceu na Etapa de Verão, MadLife tem uma chance de mostrar novamente as melhores jogadas do mundo no Evento All-Star 2016. Seja acertando um gancho na névoa de guerra ou acabando com os atiradores adversários, você pode contar com MadLife para trazer o caos.</p>"},"foreignIds":{"drupalId":"370","TRLH1":"200000303","TRLH2":"1001140041","TRKR1":"225038","TRLH3":"1001360055","TRLH4":"1001310055","ESPORTSTMNT02":"200000756"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1035,"slug":"fly","name":"Fly","firstName":"Yongjun","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fly-f96z2al7.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:08:52.000Z","updatedAt":"2017-07-20T21:11:42.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT06":"200000439","ESPORTSTMNT02":"200000767","TRLH1":"200000709"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1172,"slug":"qwerm","name":"BonQuish","firstName":"Alec","lastName":"Warren","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/qwerm-9fij28rx.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-03-08T01:37:03.000Z","updatedAt":"2017-06-14T23:25:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000766"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1317,"slug":"rikara","name":"Rikara","firstName":"Richard","lastName":"Oh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rikara-eu8jm8ll.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-06-03T00:18:15.000Z","updatedAt":"2017-06-14T23:10:26.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000755","TRLH1":"200000302"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":215},{"id":1666,"slug":"whyin","name":"Whyin","firstName":"Ryan","lastName":"Karaszkiewicz","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whyin-3fapjeh2.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-11T00:17:14.000Z","updatedAt":"2017-06-14T23:04:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000757","TRLH1":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":271}],"scheduleItems":[{"id":"AVsXrCayQMQFcjhwbQxL","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:315f7afd-076e-4ef5-8392-a010e15e0a3a","scheduledTime":"2017-04-02T19:00:00.588+0000","tags":{"blockLabel":"Summer Promotion","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:64f713cc-5953-4810-bf36-927bcf33f12f","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4"},"match":"315f7afd-076e-4ef5-8392-a010e15e0a3a","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"64f713cc-5953-4810-bf36-927bcf33f12f","league":"2"}],"gameIdMappings":[{"id":"b9f87d3e-31e6-4b2b-ba9f-4f420a5497d6","gameHash":"bcb2abc8d7e546e1"},{"id":"fdad1f0b-e928-4655-bb2d-85d5a25b412b","gameHash":"fb78e619cb704574"},{"id":"30319428-89da-436a-bb97-2b69b83e03a5","gameHash":"75dbd8a61e3a3fea"},{"id":"740beb00-4b41-415e-9f8d-c577d1956775","gameHash":"c941f53802c5418d"},{"id":"16dba721-bafe-4f6a-add0-75f8558d7d53","gameHash":"b3423da93099ca1b"}],"videos":[{"id":6459,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:30319428-89da-436a-bb97-2b69b83e03a5","source":"https://www.youtube.com/embed/7Nf3DTqHOUs?wmode=transparent","createdAt":"2017-04-02T20:41:55.000Z","updatedAt":"2017-04-02T20:41:55.000Z","game":"30319428-89da-436a-bb97-2b69b83e03a5"},{"id":6460,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:16dba721-bafe-4f6a-add0-75f8558d7d53","source":"https://www.youtube.com/embed/yAgjhWCrVcY?wmode=transparent","createdAt":"2017-04-02T21:31:56.000Z","updatedAt":"2017-04-02T21:31:56.000Z","game":"16dba721-bafe-4f6a-add0-75f8558d7d53"},{"id":6461,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:fdad1f0b-e928-4655-bb2d-85d5a25b412b","source":"https://www.youtube.com/embed/hEHkfHO_72o?wmode=transparent","createdAt":"2017-04-02T22:44:07.000Z","updatedAt":"2017-04-02T22:44:07.000Z","game":"fdad1f0b-e928-4655-bb2d-85d5a25b412b"},{"id":6462,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:b9f87d3e-31e6-4b2b-ba9f-4f420a5497d6","source":"https://www.youtube.com/embed/u-bKrk0_nqc?wmode=transparent","createdAt":"2017-04-02T23:48:18.000Z","updatedAt":"2017-04-02T23:48:18.000Z","game":"b9f87d3e-31e6-4b2b-ba9f-4f420a5497d6"}],"htmlBlocks":[],"match":{"id":"315f7afd-076e-4ef5-8392-a010e15e0a3a","name":"match-e","position":1,"state":"resolved","groupPosition":1,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0},{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],"games":{"b9f87d3e-31e6-4b2b-ba9f-4f420a5497d6":{"id":"b9f87d3e-31e6-4b2b-ba9f-4f420a5497d6","name":"G4","generatedName":"GCU|NV|G4|315f7afd076e4ef58392","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0},{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],"standings":{"result":[[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}]],"timestamp":1491177072605,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}]],"timestamp":1491173628822,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120458","gameRealm":"TRLH1","platformId":"TRLH1:1002120458","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"fdad1f0b-e928-4655-bb2d-85d5a25b412b":{"id":"fdad1f0b-e928-4655-bb2d-85d5a25b412b","name":"G3","generatedName":"GCU|NV|G3|315f7afd076e4ef58392","input":[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0},{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}]],"timestamp":1491173200959,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}]],"timestamp":1491169939197,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120457","gameRealm":"TRLH1","platformId":"TRLH1:1002120457","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"30319428-89da-436a-bb97-2b69b83e03a5":{"id":"30319428-89da-436a-bb97-2b69b83e03a5","name":"G1","generatedName":"GCU|NV|G1|315f7afd076e4ef58392","input":[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0},{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],"standings":{"result":[[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}]],"timestamp":1491165446817,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}]],"timestamp":1491163156788,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120446","gameRealm":"TRLH1","platformId":"TRLH1:1002120446","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"740beb00-4b41-415e-9f8d-c577d1956775":{"id":"740beb00-4b41-415e-9f8d-c577d1956775","name":"G5","generatedName":"GCU|NV|G5|315f7afd076e4ef58392","input":[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0},{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}]],"timestamp":1491176707436,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"1002120459","gameRealm":"TRLH1","platformId":"TRLH1:1002120459","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"16dba721-bafe-4f6a-add0-75f8558d7d53":{"id":"16dba721-bafe-4f6a-add0-75f8558d7d53","name":"G2","generatedName":"GCU|NV|G2|315f7afd076e4ef58392","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0},{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}]],"timestamp":1491168901341,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","match":"de80a32c-97d7-4640-a02d-84ab703805fb","standing":0}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24","breakpoint":"39dd879e-78ad-4287-997d-e7371d7d0a11","standing":0}]],"timestamp":1491166286145,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120456","gameRealm":"TRLH1","platformId":"TRLH1:1002120456","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912"}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24"}]],"timestamp":1491177072606,"source":"bestOf","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912"}],[{"roster":"46b7c54e-0b96-4460-b171-64f7b08b8c24"}]],"timestamp":1491176707436,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}