{"teams":[{"id":35,"slug":"copenhagen-wolves","name":"Copenhagen Wolves","guid":"be6c9a0d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/copenhagen-wolves-ak8vgfwr.png","acronym":"CW","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2014-09-09T05:30:02.000Z","updatedAt":"2017-02-11T08:59:42.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1100"},"players":[227,676,824,1107,1108,1109],"starters":[824,1108],"subs":[227,676,1107,1109]},{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]}],"players":[{"id":227,"slug":"soren","name":"Soren","firstName":"Søren","lastName":"Frederiksen","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/soren-btw8b9sn.png","hometown":"Denmark","region":"EU CS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-03-07T16:31:50.000Z","bios":{"en_US":"<p>Soren “Soren” Frederiksen has been around the professional scene for a few years now, having joined the Copenhagen Wolves in 2014. Soren prefers assassins in the mid lane, earning a 3.6 KDA with Ahri and a 4.9 KDA with Kassadin in the 2015 EU LCS Spring Split. He helped CW reach 6th Place in his first split with the team.</p>"},"foreignIds":{"drupalId":"3021","TRLH3":"1001000064","TRLH4":"1001240008","FRA1TMNT1":"375377"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":676,"slug":"trowen","name":"Trowen","firstName":"Admir","lastName":"Spahic","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/trowen-hl9i29vc.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2016-03-07T16:32:25.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3887","FRA1TMNT1":"375376","TRLH4":"1001240009"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":1108,"slug":"sirnukesalot","name":"SirNukesAlot","firstName":"Risto","lastName":"Luuri","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/sirnukesalot-3yrw4oza.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:22:39.000Z","updatedAt":"2016-06-22T00:28:03.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375375","TRLH4":"1001240007","TREU1":"1000585053","TREU":"1000585053"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":1109,"slug":"ritix","name":"Ritix","firstName":"Rytis","lastName":"Lekstutis","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ritix-ampf8q1d.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:24:08.000Z","updatedAt":"2016-03-07T16:31:29.000Z","bios":{},"foreignIds":{"TRLH4":"1001240006"},"socialNetworks":{},"champions":[],"liveGameTeam":35},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AU3UKWYaOPWArxM1l4QT","content":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:match:33a045f4-93a7-46c7-8c6a-57ad26c64eb3","scheduledTime":"2015-06-26T18:00:00.000+0000","tags":{"subBlockLabel":"EU LCS Summer - Week 5 - Day 2","blockLabel":"5","leagueLabel":"urn:rg:lolesports:global:league:league:3","blockPrefix":"week","subBlockPrefix":"day","yearLabel":"2015","stageLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:bracket:051ebefd-5274-445e-ae69-bf52861028a1","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1"},"match":"33a045f4-93a7-46c7-8c6a-57ad26c64eb3","tournament":"6fee33c6-bf3e-46f3-82b3-d21934202ee1","bracket":"051ebefd-5274-445e-ae69-bf52861028a1","league":"3"}],"gameIdMappings":[{"id":"c404cc68-8f56-47d3-8a30-2ede0f7c1e47","gameHash":"bf9e99964f6d7f3c"}],"videos":[],"htmlBlocks":[],"match":{"id":"33a045f4-93a7-46c7-8c6a-57ad26c64eb3","name":"R1M36","position":35,"state":"resolved","groupPosition":0,"input":[{"roster":"8287dc88-149e-4a14-82d1-1ca5cad093b0"},{"roster":"7853726e-9a7b-43a9-b76d-4ac88a731e9b"}],"games":{"c404cc68-8f56-47d3-8a30-2ede0f7c1e47":{"id":"c404cc68-8f56-47d3-8a30-2ede0f7c1e47","name":"G1","generatedName":"CW|OG|G1|33a045f493a746c78c6a5","input":[{"roster":"8287dc88-149e-4a14-82d1-1ca5cad093b0"},{"roster":"7853726e-9a7b-43a9-b76d-4ac88a731e9b"}],"standings":{"result":[[{"roster":"7853726e-9a7b-43a9-b76d-4ac88a731e9b"}],[{"roster":"8287dc88-149e-4a14-82d1-1ca5cad093b0"}]],"timestamp":1438718820967,"source":"manual","note":"Clone results from Match Service","closed":true},"scores":{},"gameId":"1001210217","gameRealm":"TRLH3","platformId":"TRLH3:1001210217","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"7853726e-9a7b-43a9-b76d-4ac88a731e9b"}],[{"roster":"8287dc88-149e-4a14-82d1-1ca5cad093b0"}]],"timestamp":1438718820967,"source":"manual","note":"Clone results from Match Service","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7853726e-9a7b-43a9-b76d-4ac88a731e9b":1,"8287dc88-149e-4a14-82d1-1ca5cad093b0":0}}}