{"teams":[{"id":53,"slug":"team-liquid","name":"Team Liquid","guid":"be6cab43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-liquid-3g983dra.png","acronym":"TL","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-08-05T20:07:01.000Z","bios":{"en_US":"<p>Formed in the wake of the Team Liquid and Team Curse organizations merging, Liquid debuted in the NA LCS 2015 Spring Split. After a tumultuous Spring Split, where they lost three of their tested talents and replaced them with rookies Lourlo, Dardoch, and Matt, many players thought that they’d struggle to avoid the bottom of the rankings. Instead, the team stepped up huge and outperformed expectations.</p>\n\n<p>Unfortunately, all good things must come to an end and Liquid released some of their top talent at the end of 2016. The team acquired a couple of new players (including world class jungler Reignover) and a returning world champion in Piglet. With a new outlook and the air successfully cleared after a rough split, Liquid is ready to make a run at playoffs.</p>\n\n<p>Coach: Nu-ri \"Cain\" Jang</p>","fr_FR":"<p>Née de la fusion entre Team Liquid et Team Curse, Liquid a fait ses débuts dans le segment de printemps des LCS NA 2015. Malgré un départ un peu poussif, avec un score de 9 victoires pour 9 défaites lors de la saison, TL est remontée à un score final de 11 victoires après s'être battue bec et ongles pour arracher la 3e place. Le roster de Liquid est resté quasi-intact au fil des péripéties connues par l'équipe depuis ses débuts, et les fans espèrent que les quelques nouveaux éléments intégrés au roster sauront s'adapter rapidement, en particulier leur nouveau top laner, Lourlo, qui doit encore faire ses preuves.</p>","pl_PL":"<p>Ta organizacja założona w 2010 roku w Holandii zrzesza graczy z całego świata. Posiada swoje oddziały w większości gier gdzie istnieje scena esportowa, więc naturalną koleją rzeczy jej pragnieniem było dołączenie do nich League of Legends. Taka okazja nadarzyła się 6 stycznia 2015 roku – drużyna Team Curse dokonała fuzji z organizacją Liquid. W ten sposób zespół sięgający swoimi korzeniami do pierwszego sezonu zmienił nazwę na Team Liquid. Ze względu na integrację kadra pozostała bez zmian, tylko nadzór nad nią i jej wsparcie uległy modyfikacji.</p>\n<p>\nJej właścicielami są Victor \"Nazgul\" Goossens i Steve \"LiQuiD112\" Arhancet, którzy aktywnie biorą udział w życiu drużyny. Victor to założyciel Team Liquid i były profesjonalny gracz strategicznych produkcji. 1 maja 2001 roku powstała strona dotycząca gier tej kategorii. W kolejnych latach jego organizacja rozwijała się o kolejne gry różnych typów. W momencie fuzji była poważaną instytucją zrzeszającą graczy z całego świata. Steve był częścią sceny esportowej League of Legends w pierwszym i drugim sezonie. Uwielbiał grać jako support, w szczególności Soraką. Posiada wykształcenie z zakresu finansów, co po 12 latach pracy w biznesie, zdecydował się połączyć ze swoją pasją. W sierpniu 2011 roku, po tym jak jego drużyna dostała się pod skrzydła Curse Gaming, został Dyrektorem do spraw esportu w Curse Inc. Po fuzji automatycznie stał się współwłaścicielem Team Liquid. Często można go zobaczyć na filmach przedstawiających życie zawodników, jak i również w spotach reklamowych organizacji. Razem z Victorem dbają o wizerunek i potrzeby swojej wspólnej drużyny.</p>\n<p>                                             \nDebiut Team Liquid, jako marki, w NA LCS miał miejsce w piątym sezonie. W okresie wiosennym poradzili sobie przyzwoicie, kończąc na szóstym miejscu z wynikiem 9:9. Biało-niebiescy zawodnicy zdobyli tytuł najbardziej wartościowego gracza aż dwukrotnie w tym okresie. Swoją prawdziwą siłę pokazali dopiero w letnim sezonie NA LCS 2015. Zadziwiające jest to, że udało im się tego dokonać bez żadnych zmian w składzie osobowym.Drużyna Team Liquid skończyła z najlepszym wynikiem – 13:5, zajęła pierwsze miejsce w tabeli ex aequo z Counter Logic Gaming. Jednak w dogrywce nie pozostawiła złudzeń, że to właśnie jej należy się pierwsze miejsce i pokonała CLG. W tym okresie, oprócz kolejnych dwóch laurów MVP, nagrodzony został trener Team Liquid - Peter Zhang. Na zdobyciu szczytu w letnim sezonie NA LCS 2015 skończyła się dobra passa biało-niebieskich. Po rozegraniu meczy kwalifikacyjnych do Mistrzostw Świata, niestety nie udało im się przejść dalej. Jednak Team Liquid pomyślnie wykreował swój wizerunek na scenie esportowej, gdyż po sezonie piątym jej popularność wśród społeczeństwa League of Legends zdecydowanie wzrosła. Przez fanów postrzegana jest jako nowoczesna i prężna organizacja, po której zawsze można się spodziewać czegoś dobrego.</p>\n","de_DE":"Liquid entstand aus der Fusion von Team Liquid und Team Curse, und sie traten zum ersten Mal im Frühjahrs-Split der nordamerikanischen LCS 2015 auf den Plan. Nach einem turbulenten Frühjahrs-Split, in dem sie drei ihrer erfahrenen Talente verloren hatten und sie mit den Nachwuchsspielern Lourlo, Dardoch und Matt ersetzen mussten, dachten viele Spieler, sie würden am Ende der Tabelle landen. Stattdessen machte die Mannschaft einen großen Sprung und übertraf alle Erwartungen.</p>\n<p>\nLeider hat alles Gute einmal ein Ende und Team Liquid musste Ende 2016 ein paar seiner besten Spieler ziehen lassen. Die Mannschaft verpflichtete ein paar neue Spieler (dazu gehört auch der Weltklasse-Jungler Reignover) sowie den Weltmeister Piglet. Dank der neuen Aufstellung und einem sauberen Schnitt nach dem Sommer-Split 2016 ist Team Liquid bereit, um die Krone der LCS mitzuspielen.\n<p>\nCoach: David „Varsix“ Lim\n"},"foreignIds":{"drupalId":"3654"},"players":[44,250,326,372,395,558,626,777,969,2081],"starters":[44,558,626,777,969],"subs":[250,326,372,395,2081]},{"id":187,"slug":"apex","name":"Apex","guid":"be7107c4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/apex-9sdy9cc9.png","acronym":"APX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-20T22:26:46.000Z","updatedAt":"2016-09-17T20:23:58.000Z","bios":{"en_US":"<p>\nWe are Apex - hear us roar. Say hello to the newest team to enter the LCS. Even though this is a fresh team, there are some experienced players on the roster, and they’ve been working hard to make it from the Challenger circuit into the LCS. Apex has been playing together since the beginning of 2016, and they actually have an advantage in some of the older LCS teams in that aspect - new recruits aside, they know each other and have built up their synergy. The team even took an intensive boot camp in Korea before preparing for the Summer Split. With a veteran coach in their corner, and former LCS players looking to take another shot at the big leagues, Apex Gaming are bound to be an exciting team to watch.\n</p>\n<p>\nCoach: Brandon “Saintvicious” DiMarcio\n</p>"},"foreignIds":{},"players":[78,148,166,168,247,275,395,399,508,746],"starters":[166,168,247,399,508],"subs":[78,148,275,395,746]}],"players":[{"id":44,"slug":"piglet","name":"Piglet","firstName":"Gwang-jin","lastName":"Chae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/piglet-4smmppa.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-05-25T17:21:49.000Z","bios":{"en_US":"<p>Gwang-jin “Piglet” Chae experienced the highest highs a League of Legends pro player can experience when he took home the Summoner’s Cup at the 2014 World Championship. But he has since had to endure some of the lowest lows to get another shot at glory. He struck out into the unknown and joined Liquid. It’s been a rocky road which eventually led to Piglet stepping down to play with Team Liquid Academy.</p>\n\n<p>After opting to play largely with Team Liquid Academy in 2016, Piglet is finally making his return to Team Liquid and the NA LCS. Piglet’s mechanical skill is the stuff of legends, and he’s renown for his ability to make even the most skillful plays look deceptively easy. Quite simply: Piglet is a playmaker that Team Liquid has gone far too long without. The kind of firepower that Piglet is capable of unleashing has the potential to make Team Liquid an instant contender for the NA LCS throne. Bot lane beware -- Piglet is back.</p>","fr_FR":"<p>Gwang-jin « Piglet » Chae a vécu ce qu'un joueur pro de League of Legends peut vivre de plus\n\nfantastique ; il a rapporté chez lui la Coupe de l'invocateur du mondial 2014. Mais depuis, il a dû \n\nsupporter le pire du pire dans l'espoir de revivre cette heure de gloire. Après s'être lancé dans l'inconnu \n\nen rejoignant Team Liquid de l'autre côté de l'océan, Piglet s'est pris un mur. Les choses ne se passaient \n\npas comme prévu. Au lieu de mener son équipe au sommet des LCS, il s'est retrouvé sur le banc de \n\ntouche pendant qu'un jeune n'ayant pratiquement aucune expérience pro jouait son rôle.</p>\n\n<p>Mais Piglet n'a pas été champion du monde par hasard et il a su relever ce nouveau défi. S'entraînant \n\nencore plus qu'avant, donnant tout pour établir une vraie synergie avec ses coéquipiers, Piglet et Liquid \n\nsont finalement parvenus à se fondre dans une entité efficace. Malgré quelques difficultés persistantes, \n\nPiglet retrouve peu à peu sa forme d'antan. Profitant pleinement des compétences techniques qui lui \n\navaient permis de remporter le championnat du monde, Piglet ne vise plus qu'un seul objectif : revenir \n\nune fois encore sur la plus grande scène que l'e-sport de LoL puisse offrir.</p>","pl_PL":"<p>Ten utalentowany AD Carry pojawił się na scenie esportowej League of Legends w lutym 2013 roku. Jako debiutant, doświadczony tylko w solo que, dołączył do SK Telecom T1 2. Ten skład został utworzony wokoło  Lee’a \"Faker\" Sang-hyeoka, jako siostrzana drużyna SK Telecom T1 1. \"Piglet\" wraz z ekipą osiągnęli powodzenie już na pierwszym turnieju, pomimo tego, że w większości byli nowicjuszami. Co prawda zajęli tylko trzecie miejsce, ale dzięki temu zaistnieli wśród najlepszych w Korei, pokonując m.in. CJ Entus Frost. Zaledwie parę miesięcy później pokazali na co naprawdę ich stać, wygrywając HOT6iX Champions Summer 2013. Dzięki zdobytym punktom na tym wydarzeniu, zdecydowane zwycięstwozagwarantowało Chae’owi \" Gwang-jinowi wejście do Mistrzostw Świata 2013 z trzeciego miejsca w Korei. Tam, na arenie międczynarodowej, \"Piglet\" pokazał jak bardzo wybitnym jest AD Carrym. Z grupy SKT T1 wyszło z wynikiem 7:1, tracąc tylko jedną grę przeciwko OMG. W fazie eliminacji tylko Najin Black Swordz powodzeniem stawiło czoła ich potędze, przegrywając z SKT T1 2:3. Tytuł mistrza świata to zdecydowanie największy sukces Chae’a Gwang-jina.</p>\n<p>\nCzwarty sezon w Korei rozpoczął kolejnymi triumfami, lecz wraz z upływem czasu SKT T1 coraz gorzej sobie radziło. Ostatecznie, we wrześniu 2014 roku, \"Piglet\" i jego partner \"PoohManDu\"  pożegnali się z tą organizacją. Wspomnieniem po tej współpracy pozostały skarpetki Chae’a Gwang-jina z Kubusiem Puchatkiem, które nosił podczas meczów ze swoim supportem, ponieważ przynosiły mu szczęście. Taki talent nie mógł zostać wolnym strzelcem zbyt długo, już październiku 2014 roku dostał ofertę od Team Curse. Po przeprowadzce do Stanów Zjednoczonych czekało go dużo pracy – pokonanie bariery językowej, problemy z wizą i zyskanie komunikacji z nowym kolegami. Jednak znany z zaangażowania \"Piglet\" dał z siebie wszystko. W końcu, w letnim sezonie 2015, już pod marką Team Liquid, udało mu się znaleźć na szczycie NA LCS.</p>\n<p> \nDo jego osobistych osiągnięć przede wszystkim należy nagroda za najlepszego AD Carry podczas 2013 Korea e-Sports Awards. Dokonał tego głównie grając swoją ulubioną postacią – Vayne. Poza nią, częściej od innych bohaterów, wybiera Ezreala, Corkiego i Caitlyn.Wspominając swoje najszczęśliwsze momenty w życiu, jako pierwszy przytacza dostanie się do SKT T1, a jako drugi z kolei wygranie OGN Summer 2013. Słynie ze swojego niezmiennego, defensywnego stylu gry i godnej podziwu pozycji w walkach drużynowych. To bardzo dumny zawodnik, poważnie traktujący rywalizację z AD Carry z innych zespołów, w szczególności z Gu’em \"Imp\" Seung-binem. Wśród innych graczy wyróżnia go sumienność i pracowitość. Przez to, że sypiał po 4 do 5 godzin i ćwiczył swoje umiejętności w League of Legends przez kolejne 15 do 16, zyskał przydomek „Practice Worm”. Można również o nim powiedzieć, że jest emocjonalny. Wielokrotnie reagował na krytykę lub porażkę bardzo silnie, w szczególności w kontaktach ze swoimi trenerami i menadżerami.\n</p>","de_DE":"Gwang-jin „Piglet“ Chae hat alle Höhen eines professionellen „League of Legends“-Spieler erlebt, als er die Weltmeisterschaft 2014 gewann und den Beschwörerpokal mit nach Hause nahm. Seither musste er jedoch auch einige Tiefen verkraften, um wieder eine Chance auf Ruhm und Ehre zu bekommen. Er machte sich auf ins Unbekannte und wechselte zu Liquid. Es war ein steiniger Weg, der schließlich dazu führte, dass sich Piglet zurückzog und für Team Liquid Academy spielte. \n</p>\nNachdem Piglet sich entschieden hatte, 2016 hauptsächlich für Team Liquid Academy zu spielen, kehrt er schließlich wieder zu Team Liquid in die NA LCS zurück. Piglets mechanisches Können ist legendär, und er ist bekannt dafür, selbst die schwierigsten Spielzüge ganz einfach aussehen zu lassen. Es ist ganz einfach: Piglet ist der Spielmacher, auf den Team Liquid zu lange verzichten musste. Die Feuerkraft, die in Piglet steckt, kann Team Liquid sofort zu einem Anwärter auf den Thron der NA LCS machen. Die untere Lane sei gewarnt – Piglet ist zurück.\n"},"foreignIds":{"drupalId":"690","TRLH1":"200000244","TRLH2":"200000148"},"socialNetworks":{"twitch":"","twitter":"https://twitter.com/LiquidPiglett"},"champions":[],"liveGameTeam":53},{"id":78,"slug":"diamondprox","name":"Diamondprox","firstName":"Danil","lastName":"Reshetnikov","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/diamondprox-gx80qbxc.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-06-15T22:40:21.000Z","bios":{"en_US":"<p>Danil “Diamondprox” Reshetnikov was one of the most innovative junglers in the world during Season 2. Diamondprox’s overwhelming map control kickstarted an aggressive counter-jungling strategy that continues to influence the League of Legends meta even now. </p>\n\n<p>Despite struggling to make an impact in the 2014 and 2015 EU LCS, Diamondprox was still regarded as one of the best junglers in Europe. The Unicorns of Love took Diamondprox in during the 2015 offseason, betting that his prior experience would be a boon for their revamped squad. Now, Apex Pride are hoping he can help them earn a spot in the NA LCS.</p>","fr_FR":"<p>Comme dans tout sport, il y a dans League of Legends des joueurs qui ont marqué leur époque, et le Russe Danil « Diamondprox » Reshetnikov est de ceux-là. Il se fait repérer alors qu’il n’est que platine, rejoint l’équipe Empire (qui deviendra Moscow Five) et domine très vite la scène européenne, allant jusqu’à impressionner à l’international. Diamondprox se démarque par sa capacité d’adaptation et son inventivité. Nombre d’observateurs estiment que c’est lui qui a inventé la tactique du counter-jungle, pratique à laquelle il s’adonne particulièrement bien avec Shyvana. Moscow Five est alors connue pour ses excellents résultats lors des compétitions majeurs et principalement lors des différentes éditions des Intel Extreme Masters.</p>\n\n<p>M5 et Diamondprox confirment leur supériorité sur la scène européenne en remportant les finales régionales, ce qui les qualifie d’office pour le mondial 2012. Considérés comme favoris, les M5 surprennent en s’inclinant en demi-finale face aux futurs champions du monde, les Taipei Assassins. Après quelques autres contre-performances, Diamondprox et ses coéquipiers (qui jouent désormais pour Gambit Gaming) réussissent à vaincre les équipes coréennes Azubu Frost et Azubu Blaze aux IEM Katowice 2013, avec un Diamondprox sur Xin Zhao pendant la majorité du temps.</p>\n\n<p>Dès la première occurrence, les M5 prennent part aux League of Legends Championship Series. Diamondprox participe énormément au succès de l’équipe et dicte la méta. Il est le pionnier du Nasus jungle, se démarque par son utilisation de Volibear, marque les esprits avec ses variantes d’Evelynn et va même jusqu’à invoquer Karma. Son équipe n’est plus maîtresse de la région mais obtient la 2e place de la saison de printemps et la 3e de la saison d’été, guidée par son agressivité réfléchie.</p>\n\n<p>Avec le temps, les départs successifs de ses coéquipiers et les problèmes logistiques inhérents à la structure pour laquelle il joue, les résultats de Diamondprox se sont dégradés. Celui qui a été plébiscité par la communauté lors des deux premières éditions des All-Stars n’arrive plus à mener son équipe vers la victoire, bien qu’il reste l’un des meilleurs junglers européens. Après être passé à deux doigts de la relégation en 2015 et alors que Gambit a vendu sa place en LCS, Diamondprox cherche à donner un second souffle à sa carrière en rejoignant Unicorns of Love et compte bien prouver qu’une légende ne meurt jamais.</p>\n","pl_PL":"<p>Gwiazda League of Legends od wczesnego drugiego sezonu. Złośliwi wytykają, że czerwona, bo pochodzi z Rosji. Nie zmienia to faktu, że to jeden z graczy, którzy wywarli największy wpływ na zmianę mety w grze. Danil Reshetnikov zaistniał w drużynie Team Empire, która zaskoczyła inne popularne zespoły absolutnie nietypowymi zagraniami. Później ten sam skład zawodników był znany jako Moscow Five, a następnie Gambit Gaming. Cała rosyjska ekipa była znana z innowacyjnych wyborów i zagrań, jednak król nowości wśród nich to właśnie \"Diamondprox\". Można śmiało powiedzieć, że zrewolucjonizował grę w jungli wielokrotnie podczas istnienia sceny esportowej. Brakiem obaw przed porażką i ośmieszeniem otworzył drzwi dla wielu nowych postaci na tej pozycji, zainicjował między innymi wybór Karmy, Mundo i Nasusa. Oprócz zaskakującej selekcji bohaterów, zdumiewał również swoim stylem gry – na przykład sztuką kontrowania przeciwników w ich własnej jungli. Jednak wielbiciele i społeczeństwo najlepiej znają Danila z niezwykłych zagrań Lee Sinem i Evelynn.</p>\n<p>\n\"Diamondprox\" od wczesnego drugiego sezonu uczestniczył w życiu esportowym League of Legends. Można by długo wymieniać turnieje, które wygrał i te, w których znalazł się na podium, lecz najważniejszymi dokonaniami były jego występy na Mistrzostwach Świata i turniejach IEM. W wydarzeniu o najwyższej randze na scenie League of Legends wziął udział dwukrotnie – w drugim i trzecim sezonie. Za pierwszym razem zespół Moscow Five było jednym z faworytów – uległ w półfinale w walce z Taipei Assasins. Miarę tego osiągnięcia, można mierzyć w powszechnej opinii po tej imprezie, że z zachodnich drużyn tylko ta rosyjska może się mierzyć z Azjatami. Na Mistrzostwach Świata 2013 poszło jej gorzej, ponieważ Danil wraz z kolegami dotarli tylko to ćwierćfinałów. Co i tak było niesamowitym osiągnięciem jak na europejską ekipę. Zdecydowanie lepszy owoc zebrali na wydarzeniach IEM - \"Diamondprox\" dwukrotnie był półfinalistą i raz zwycięzcą podczas Mistrzostw Świata IEM. Ponadto czterokrotnie wygrali etapy kwalifikacyjne, podczas których dominowali tak doświadczonych przeciwników jak: Team SoloMid, Fnatic i Counter Logic Gaming. Przed wiosennym sezonem EU LCS 2016 pożegnał się z pozostałościami po legendarnej rosyjskiej drużynie i w poszukiwaniu swojego miejsca dołączył do Unicorns of Love.\nDanil to jeden z bardzo małego grona graczy, które znalazło swoją drugą połówkę i się ożeniło. Podobnie jak jego kolega z drużyny, „Alex Ich”, trafił na swoją sympatię, kiedy profesjonalnie grał w League of Legends. \"Diamondprox\" spotkał „Rogue” w solo que po przeciwnej stronie barykady i w tym starciu Darina została upokorzona przez jego grę Skarnerem. W związku z czym padło parę ostrych słów między nimi. Dlatego „Rogue” zauważyła, że w kolejnej grze jej rywalem znowu jest Danil. Tym razem pogratulował swojej konkurentce dobrej gry, a po meczu zaczęli ze sobą rozmawiać. Od słów do czynów, wkrótce potem zaczęli się ze sobą spotykać – jak widać miłość potrafi znaleźć ujście w najbardziej nieoczekiwanych momentach i miejscach. \n</p>","es_ES":"<p>La eterna leyenda rusa toma un nuevo rumbo. Por primera vez en su carrera profesional desde Octubre de 2011, Danil ‘Diamondprox’ Reshetnikov opta por cambiar de aires. El jugador proveniente de World of Warcraft que enamoró a todo el mundo en Team Empire, Moscow Five y Gambit Gaming decide por primera vez dejar la infraestructura que tantos éxitos le ha otorgado en el pasado para intentar solucionar un final de carrera con un declive pasivo.</p>\n\n<p>Diamondprox empezó en 2011 a jugar para Team Empire gracias a la invitación de su amigo y apoyo del equipo Edward ‘Gosu Pepper’ Abgaryan. Tan sólo dos meses durarían ambos bajo el nombre de Team Empire, puesto que en Diciembre de ese mismo año la plantilla sería fichada por Moscow Five y un mes más tarde ya estarían dando la sorpresa en la IEM Season VI – Global Challenge Kiev que ganarían ante los grandes equipos de Europa y Norteamérica. Con campeones como Shyvana y Lee Sin el joven ruso sacaba a la palestra un estilo agresivo de invasión hacia la jungla enemiga que chocó mucho a los jungla de apoyo de aquella época. Grandes jugadores de la historia de League of Legends han elogiado al jungla por su innovación y agresividad.</p>\n\n<p>En Marzo de 2012, Diamondprox volvería a la senda de la innovación adaptada a su estilo de juego en la IEM Season VI – World Championship disputada en Hannover. La aparición estelar de Nocturne con presencia global en el mapa permitió sorprender a sus rivales. Aunque la mayor alegría llegaría a los amantes de Udyr a causa de la aparición en el último partido de la final ante Dignitas como respuesta a la propia Shyvana que él mismo había popularizado.</p>\n\n<p>En ese mismo año llegaron los mejores momentos de Diamond como en la Dreamhack Summer 2012 o las finales regionales de la segunda temporada en Colonia. Aquel Moscow Five que estuvo a punto de llegar a la final del Campeonato Mundial 2012 en el que sólo perdió ante el vencedor Taipei Assasins. Este momento supuso la cúspide en la carrera del jugador que a partir de entonces no ha conseguido éxitos del mismo calibre. Todavía se recuerda esa arrasadora primera partida que disputó con Xin Zhao.</p>\n\n<p>Después del último gran torneo jugado como Moscow Five en la IPL5 debido al arresto del CEO del equipo, Diamondprox sólo consiguió mantener su estatus debido a grandes actuaciones las Intel Extreme Masters como la victoria en 2013 en Katowice ante Azubu Frost. El formato de liga regular de la League Championship Series no favoreció al jugador debido al distanciamiento de la organización de la sede en Colonia con problemas de visado, y poco a poco su nivel fue bajando hasta la actualidad. En el año 2013 fue votado para representar a Europa en el All Stars y en el Campeonato Mundial de 2013 se clasificaría para cuartos de final.</p>\n\n<p>Tanto 2014 como 2015 fueron años aciagos para el jungla. El primer año todavía mantuvo su caché a pesar de los malos resultados del equipo con buenas actuaciones mediante el uso de junglas agresivos, pero ya no volverían a clasificarse a un Campeonato Mundial y en los últimos tiempos el jugador sólo conserva detalles de calidad.</p>\n\n<p>En Unicorns of Love podría renacer. Su carácter innovador encaja perfectamente con el equipo, y supone un reto motivacional nuevo para el ruso. A pesar de ser introvertido, su privilegiada mente podría otorgar una mejora en la toma de decisiones, faceta de la que siempre ha carecido el equipo.</p>","de_DE":"<p>Wenn man eSports-Fans nach dem einen Jungler fragt, wird sicherlich aus vieler Munde der Name „Diamond“ ertönen. Nicht viele Europäer haben sich einen solchen, vor allem auch international anerkannten Ruf erspielen können. Er ist anpassungsfähig, erfahren, Shotcaller und einer der größten Innovatoren seiner Position. Während er mit Lee Sin noch einen recht vertrauten Pick schon sehr früh an den Tag gebracht hat, wurde es schnell außergewöhnlicher. So hat er vor allem in der dritten Saison viele Trends im Jungle geschaffen. Evelynn, Nasus und nicht zu vergessen seine Karma waren noch nicht einmal alle Champions, die er allein in dieser Zeit erfolgreich in die Kluft brachte. </p>\n<h2><p>Der große Aufstieg</p></h2>\n<p>Bekannt wurde Danil \"Diamondprox\" Reshetnikov, nachdem sein damaliger Kader von Team Empire Ende 2011 von Moscow Five aufgekauft wurde. Während die Russen anfangs noch nicht sonderlich bekannt waren, änderte sich dies schon zwei Monate später schlagartig. Bei der IEM Season VI in Kiew setzte sich das Team gegen eine Armee von großen Namen durch, unter ihnen auch Zweitplatzierter der vorigen Weltmeisterschaft against All authority und TSM, den schon damaligen Favoriten der Amerikaner. Mit nur einem verlorenen Spiel während des gesamten Turniers war sehr schnell klar, dass es diese Spieler drauf haben. </p>\n<p>Die gesamte zweite Saison sollte sich ein Trend fortsetzen, der aus einem emporkommenden Team mit guten Spielern schon fast so etwas wie Legenden machte. Zusammen mit seinem Teamkollegen Alexey \"Alex Ich\" Ichetovkin hat er die gegnerischen Lanes in ein regelrechtes Chaos versetzt, um sichere Siege einzuholen. Das hat M5 nicht nur weitere Turniersiege eingebracht, sondern letztendlich zu einem Top 4 Erfolg auf der zweiten Weltmeisterschaft geführt. </p>\n<h2><p>Sein Weg mit Gambit</p></h2>\n<p>Nachdem der CEO von Moscow Five Anfang 2013 verhaftet wurde, stand das erfolgreiche Team zum Verkauf bereit. Der glückliche Käufer: Gambit Gaming. Unter neuem Namen ging es gleich da weiter, wo man zuvor aufhörte: Wer sich an die IEM Season VII in Katowice erinnert, hat sicherlich noch Gambits dortige Erfolgsgeschichte vor Augen. Nach einem knappen Sprung aus der Gruppenphase gelang es dem Team nicht nur eins, sondern gleich zwei Aufeinandertreffen gegen die damals stärksten koreanischen Teams ohne Niederlage zu gewinnen. Spätestens ab diesem Zeitpunkt wurde Diamondprox auch von vielen Koreanern als einer der besten Jungler anerkannt. Er wurde Vorbild für viele später auch erfolgreiche professionelle Jungler. </p>\n<p>Die LCS veränderte dann so einiges, während die Konkurrenz anfangs noch vergleichsweise schwach war, wurde diese über die Jahre immer stärker. Das einst so undenkbar trennbare Team verlor nach und nach seine Spieler, bis zum Schluss nur noch Diamondprox und Edward „Edward“ Abgaryan übrig blieben. Das Ende vom ursprünglichen Gambit war gekommen. </p>\n<p> „Es waren vier teuflische Jahre, Jungs“, Worte, die sich Diamond am Anfang seiner Karriere in League of Legends wohl kaum zu träumen gewagt hätte. Und doch – nach vier Jahren Achterbahnfahrt der Gefühle, kann er stolz von seinen Jahren mit den vier russischen Kumpanen reden. Ein Kapitel seines Lebens, das mit dem Austritt aus Gambit Gaming nun geschlossen wurde. </p>\n<h2><p>Das diamantene Einhorn</p></h2>\n<p>Wenn sich ein Kapitel schließt, öffnet sich ein anderes. Das richtige Team ist jedenfalls gefunden. Die Unicorns Of Love sind dafür bekannt, ungewöhnliche Champions auszupacken, da passt der neue Jungler perfekt hinein, um die Gegner noch weiter in die Irre zu führen. Er selbst erhofft sich nicht nur als Person, sondern sich auch als Anführer weiter zu verbessern, wie er in einem Interview bekannt gab. In jedem Fall wird er sein Bestes geben, um nicht nur sein Team, sondern auch den vielen treuen Fans zu zeigen, was ein Diamondprox alles so drauf hat. </p>\n"},"foreignIds":{"drupalId":"88","TRLH3":"1001220067","TRLH4":"1001190117","TRLH1":"1001300002","FRA1TMNT1":"445028"},"socialNetworks":{"twitch":"http://www.twitch.tv/tehdiamondz","facebook":"www.facebook.com/GambitDiamondprox","twitter":"http://twitter.com/tehDiamondz"},"champions":[],"liveGameTeam":187},{"id":148,"slug":"shiphtur","name":"Shiphtur","firstName":"Danny","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/shiphtur-3a942emw.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-06-22T22:23:47.000Z","bios":{"en_US":"<p>\nDanny “Shiphtur” Le has been competing professionally since 2012. Known for a deep champion pool, Shiphtur is most effective on mid lane assassins like Ahri and Kassadin, but he can also hold his own with control mages, as evidenced by his fantastic 10.75 KDA on Ziggs in the 2014 NA LCS Summer Split. \n</p>\n<p>\nShiphtur got his first taste of the NA LCS while playing for Team Coast, then wreaked havoc from the mid lane with Team Dignitas. As one of the more experienced players in the LCS, Shiphtur has seen the focus of professional play transition from individual mechanics to coordinated team play. \"It's all about getting down the macro,\" Shiphtur says. \"Honestly in League of Legends right now, you can win a game purely on macro, rotations and such. Individual play really doesn't mean anything right now.\" Now, Shiphtur takes up his place on Delta Fox's new lineup.\n</p>","fr_FR":"<p>Cette saison encore, Danny « Shiphtur » Le tiendra la voie du milieu pour Dignitas. À 22 ans, le Canadien est déjà un vétéran de League of Legends.</p>\n\n<p>Il a débuté sa carrière peu avant la saison 3 et le lancement des LCS. Des LCS qu'il a immédiatement rejoints au sein de Good Game University, aux côtés notamment de Darshan « ZionSpartan » Upadhyaya (aujourd'hui connu sous le pseudonyme de Darshan). Malheureusement pour lui, des problèmes de visa l'ont empêché de jouer avant le début du segment d'été. Ses malheurs ont continué tout au long de la saison puisque l'équipe, rebaptisée Team Coast, a enchaîné les défaites pour finir à la 7e place du classement, synonyme de passage en tournoi de relégation. Une victoire 3 à 2 contre The Walking Zed leur a permis de se maintenir au plus haut niveau pour la saison 4, mais le répit ne fut que de courte durée. Lors du segment de printemps des LCS de la saison 4, Shiphtur et ses comparses n'ont su faire mieux qu'une 6e place puis un retour en tournoi de relégation après deux défaites en play-offs contre Counter Logic Gaming puis Dignitas. Cette fois le couperet est tombé sous la forme d'une défaite face à compLexity.Black, 3 victoires à 1, et le mid laner s'est retrouvé bouté hors des LCS.</p>\n\n<p>C'est le moment qu'a choisi Dignitas pour le recruter, toujours aux côtés de ZionSpartan. Avec sa nouvelle équipe, le joueur canadien s'est retrouvé une fois de plus très proche des relégations, évitées de justesse en fin de saison. L’histoire se répète lors du segment de printemps de la saison 5 des LCS, où l’équipe termine à la 9ème place et doit de nouveau passer par le tournoi de relégation. Malgré une légère amélioration lors du segment d'été, Shiphtur aborde la saison 6 sans aucune certitude. À lui de prouver enfin qu'il mérite véritablement sa place sur le terrain des LCS, face à une compétition chaque année plus relevée.</p>","pl_PL":"<p>Z pochodzenia Kanadyjczyk, z krwi Wietnamczyk, z urodzenia mid-laner. Danny Le sam wybrał tą linię, gdyż uważał, że jest najbliżej centrum wydarzeń i ma największy potencjał. Podczas swojej przygody z League of Legends wielokrotnie udowadniał, że zasługuje na tą pozycję. Pojawił się na scenie esportowej pod koniec drugiego sezonu i do stycznia 2013 roku grał na różnych pozycjach w paru pomniejszych drużynach. Wtedy nastąpił przełom w jego życiu, ponieważ trafił do Good Game University, później znanego jako Team Coast. Aż do kwietnia 2014 roku zespół walczył o przetrwanie w NA LCS, ponieważ wśród innych bardziej doświadczonych drużyn był przysłowiowym chłopcem do bicia. Nie przeszkodziło to Danniemu w pokazaniu się z najlepszej strony na scenie esportowej. Zrobił pentakilla Anivią na wiosennych rozgrywkach kwalifikacyjnych w Challenger Series w styczniu 2013 roku. Niestety w kwietniu 2014 roku porażka z compLexity.Black przesądziła o relegacji Team Coast z powrotem do Challenger Series. Miesiąc później \"Shiphtur\" opuścił tą drużynę, gdyż od razu dostał propozycje od swoich niedawnych konkurentów z NA LCS. W maju 2014 roku dołączył do Team Dignitas, gdzie w swojej pierwszej grze wiosennego sezonu 2014 zrobił kolejnego pentakilla, tym razem LeBlanc. </p>\n<p>\nDanny przysłużył się wszystkim innym graczom, przecierając drogę w oddziałach imigracyjnych Stanów Zjednoczonych. Jako pierwszy zawodnik esportowy otrzymał wizę P-1A, która przysługuje tylko profesjonalnym atletom. Kolejną jego zasługą dla społeczeństwa League of Legends było wprowadzenie Ziggsa do profesjonalnej gry. Wyborem Hextechowego Sapera sprowokował wiele banów w turniejach, lecz mimo tego jest jeszcze parę innych bohaterów, które \"Shiphtur\" uwielbia. Doskonale gra Anivią, co wielokrotnie udowadniał na różnej maści meczach, podobnie traktuje Ahri i Dianę. Szczytem jego możliwości jest Krąg Pretendenta z ponad tysiącem punktów LP. W wywiadzie po Mistrzostwach Świata 2015 Danny oświadczył, że według niego najmocniejszy zespół w NA LCS 2016 będzie miał Team SoloMid. Dodał też, że nie bez powodu pojechał na długi trening do Korei i że ma zamiar godnie stawić im czoła. Całość podsumował, że kocha League of Legends i jest bardzo wdzięczny fanom, którzy przy nim wytrwali. </p>\n"},"foreignIds":{"drupalId":"38","TRLH1":"1001220076","TRLH2":"1001160126","FRA1TMNT1":"375096","ESPORTSTMNT02":"200002373"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":187},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":326,"slug":"reignover","name":"Reignover","firstName":"Yeu-Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reignover-cswdikvi.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-29T02:29:09.000Z","bios":{"en_US":"<p>Yeu-jin “Reignover” Kim has left his mark on both the EU and NA LCS. After guiding Fnatic to an INSANE (incredible, amazing, eye-popping) 18-0 record in 2015, Reignover took a flight across the pond to play for the newly-formed Immortals squad. That team was wildly successful during regular seasons, where Reignover earned himself MVP honors in the 2016 NA LCS Spring Split. Their inability to win in the postseason led to most players, including Reignover, to seek opportunities elsewhere.</p>\n\n<p>Reignover became Team Liquid’s biggest acquisition of the offseason after they parted ways with troubled jungler, Dardoch. He’ll look to continue his dominant ways in 2017 as part of the revamped Team Liquid squad. His arrival coupled with the return of powerhouse AD Carry, Piglet, has given Team Liquid fans more than enough reason to get pumped for the upcoming split. Whether he’s cleaving enemies to death as Olaf, or tunneling his way to victory with Rek’Sai, rest assured that Reignover is going to put on one hell of a show.</p>","pl_PL":"Yeu-jin „Reignover” Kim w tym roku odcisnął swoje piętno na NA LCS. Chociaż Immortals nie udało się zakwalifikować do Mistrzostw, występy Reignovera podczas splitów wiosennego i letniego zapadły w pamięci głosujących, którzy przyznali mu 36 procent głosów na dżunglera. Najwyraźniej fani wierzą, że chociaż Reignover nie pojawił się na Mistrzostwach, bez problemów dorówna reszcie najlepszych dżunglerów świata. </p>\n\nPo odejściu z legendarnej europejskiej drużyny, Fnatic, Reignover podbił Amerykę Północną szturmem, gdy poprowadził dopiero co utworzonych Immortals przez zakończony wynikiem 17-1 sezon zasadniczy i zdobył tytuł najlepszego zawodnika wiosennego splitu NA LCS 2016. Utrzymywał dominację podczas letniego splitu, a Immortals przez cały sezon siedzieli na ogonie zdobywców pierwszego miejsca, TSM. Jednak pomimo stałej dominacji w sezonie zasadniczym, Reignover oraz Immortals zawiedli w fazie pucharowej i kwalifikacjach regionalnych. Podczas wydarzenia All-Star 2016 będzie mógł raz jeszcze pokazać, na co go stać i przypomnieć fanom, dlaczego jest uważany za jednego z najlepszych dżunglerów na świecie.\n","fr_FR":"<p>Yeu-jin \"Reignover\" Kim a marqué les LCS NA cette année. Même si Immortals n'a pas réussi à se qualifier pour le Mondial, les performances de Reignover durant les segments de printemps et d'été sont restés gravées dans les esprits, ce qui lui a valu de remporter 36 pour cent du vote jungler. Les fans pensent clairement que même si Reignover n'a pas participé au Mondial, il aurait été à la hauteur des autres meilleurs junglers du monde.</p>\n\n<p>Après avoir quitté Fnatic, l'équipe européenne historique, Reignover a pris d'assaut l'Amérique du Nord lorsqu'il a permis à l'équipe nouvellement créée des Immortals d'établir un record de 17-1 pendant la saison régulière, ce qui lui a valu le titre de MVP du segment de printemps des LCS NA 2016. Il a continué de dominer le segment d'été, permettant aux Immortals d'être toujours dans la course derrière l'équipe TSM, premiers durant toute la saison. Malgré leur domination dans la saison régulière, Reignover et les Immortals ont échoué lors des play-offs et des qualifications régionales. Au cours de l'événement All-Stars 2016, il va devoir de nouveau faire ses preuves et rappeler aux fans pourquoi il est l'un des meilleurs junglers du monde.</p>","de_DE":"Yeu-jin „Reignover“ Kim hat sowohl der EU LCS als auch der NA LCS seinen Stempel aufgedrückt. Nachdem er Fnatic 2015 zu einem Rekord von 18–0 geführt hatte, zog es Reignover über den großen Teich, um für die neu formierten Immortals zu spielen. Die Mannschaft war in der regulären Saison außerordentlich erfolgreich und Reignover wurde zum MVP des Frühjahrs-Split der NA LCS 2016 gewählt. Doch da die Immortals in der Nachsaison kein Spiel mehr gewinnen konnten, suchten die meisten Spieler, inklusive Reignover, ihr Glück bei anderen Mannschaften.\n<p>\nReignover wurde Team Liquids größte Neuverpflichtung in der Nebensaison, nachdem sie sich von ihrem Jungler, Dardoch, aufgrund von Problemen verabschiedet hatten. Als Teil der neuen Aufstellung von Team Liquid wird Reignover 2017 versuchen, seine Dominanz fortzusetzen. Zusammen mit der Rückkehr des AD-Carrys Piglet hat er dafür gesorgt, dass es die Fans von Team Liquid kaum noch erwarten können, bis der Frühjahrs-Split endlich beginnt. Egal, ob er seine Gegner mit Olaf in Stücke hackt oder sich mit Rek’Sai zum Sieg gräbt, Reignover wird eine verdammt gute Vorstellung abliefern.\n","es_ES":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los split de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores junglas del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviese un récord de 17-1 durante la temporada regular. Además, el jungla ganó el premio al mejor jugador del split de primavera de la LCS NA 2016. Durante el split de verano siguió dominando e hizo que Immortals le pisase los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en los playoffs y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores junglas del mundo.</p>","pt_BR":"<p>Yeu-jin “Reignover” Kim deixou sua marca na LCS NA deste ano. Apesar da Immortals não conseguir a vaga no Mundial, o desempenho de Reignover durante as duas etapas da temporada ficou na cabeça dos jogadores, deixando-o com 36% dos votos da Selva. Fãs claramente acreditam que, apesar de não ter aparecido no Mundial, o rapaz teria se saído tão bem quanto o restante dos melhores caçadores do mundo. </p>\n\n<p>Após sair da europeia Fnatic, Reignover tomou a América do Norte de assalto, liderando a recém-formada Immortals a uma temporada regular com um placar de 17 a 1 e recebendo o prêmio de Jogador Mais Valioso da Etapa de Primavera da LCS NA 2016. Ele continuou a dominar na Etapa de Verão, mantendo a Immortals na cola da líder, TSM, por toda a temporada. Apesar de dominar a fase regular, Reignover e a Immortals não conseguiram se dar bem nas Eliminatórias e classificatórias regionais. No Evento All-Star 2016, ele poderá nos mostrar do que é capaz novamente e lembrar seus fãs do porque ele é um dos melhores caçadores do mundo.</p>","cs_CZ":"<p>Yeu-jin „Reignover“ Kim během letošních bojů v severoamerickém LCS rozhodně nestál v koutě. Immortals se sice na MS nekvalifikovali, Reignoverovy výkony z jarního a letního splitu se ovšem do paměti účastníků hlasování vryly natolik, že získal v kategorii džunglerů 36 % hlasů. Fanoušci očividně věří, že i když se nezúčastnil MS, dokáže se bez obav poprat se světovou džunglerskou špičkou.</p>\n\n<p>Po svém odchodu z věhlasného evropského týmu Fnatic vzal Reignover Severní Ameriku útokem. Nově vytvořené Immortals dovedl k bilanci ze základní sezóny 17:1 a sám získal ocenění pro nejužitečnějšího hráče jarního splitu severoamerického LCS 2016. Jeho dominance pokračovala i v letní části soutěže, během níž Immortals neustále šlapali na paty prvním TSM. Navzdory úspěchům ze základní sezóny však Reignover a Immortals při play-off a regionálních kvalifikacích vypadli z formy. Na turnaji All-Star 2016 tak bude moci opět předvést, co umí, a připomenout fanouškům, proč je označován za jednoho z nejlepších džunglerů na světě.</p>","el_GR":"<p>Ο Yeu-jin “Reignover” Kim άφησε το σημάδι του στο φετινό LCS Βόρειας Αμερικής. Παρόλο που οι Immortals δεν κατάφεραν να προκριθούν στο Παγκόσμιο Πρωτάθλημα, η απόδοση του Reignover στο Spring Split και στο Summer Split έμεινε χαραγμένη στη μνήμη των ψηφοφόρων, με αποτέλεσμα να πάρει το 36% των ψήφων για το ρόλο του παίκτη ζούγκλας. Προφανώς, το κοινό πιστεύει ότι, αν τα κατάφερνε να εμφανιστεί στο Παγκόσμιο Πρωτάθλημα, ο Reignover θα τα πήγαινα μια χαρά σε μια αναμέτρηση με τους καλύτερους παίκτες ζούγκλας του κόσμου.</p> \n\n<p>Μετά την αποχώρησή του από τους Fnatic, μιας από τις ποιο ιστορικές ομάδες της Ευρώπης, ο Reignover γνώρισε τεράστια επιτυχία στη Βόρεια Αμερική όταν οδήγησε τους νεοφώτιστους Immortals σε ένα εκπληκτικό σερί 17-1 στην κανονική σεζόν, κατακτώντας στην πορεία και το βραβείο του MVP για το Spring Split 2016 του LCS Βόρειας Αμερικής. Η ασταμάτητη πορεία του συνεχίστηκε και στο Summer Split, με αποτέλεσμα να κρατήσει τους Immortals σε μικρή διαφορά από τους πρώτους TSM σε όλη τη διάρκεια της σεζόν. Παρά την καταπληκτική τους πορεία στην κανονική σεζόν, ο Reignover και οι Immortals δεν κατάφεραν να προχωρήσουν στα πλέι οφ και στους περιφερειακούς προκριματικούς. Στο Τουρνουά All-Star 2016, θα έχει την ευκαιρία να δείξει και πάλι τι αξίζει και να υπενθυμίσει στους φίλους του παιχνιδιού γιατί είναι ένας από τους καλύτερους παίκτες ζούγκλας στον κόσμο.</p>","hu_HU":"Yeu-jin „Reignover” Kim idén fontos szereplője volt az NA LCS-nek. Bár az Immortals nem jutott ki a vb-re, Reignover tavaszi és nyári teljesítménye olyan mély nyomott hagyott a szavazókban, hogy a dzsungelharcosokra leadott szavazatok 36%-a landolt nála. A rajongók szilárdan hisznek abban, hogy bár Reignover nem játszott a vb-n, állta volna a sarat a világ legjobb dzsungelharcosai ellen. \n</p>\nA legendás európai csapat, a Fnatic elhagyása után Reignover bevette Észak-Amerikát, az újonnan alakult Immortals élén 17-1-es eredményt ért el az alapszakaszban, és ő lett az NA LCS 2016-os tavaszi szakaszának legértékesebb játékosa (MVP). A nyári szakaszban is remekül folytatta, az Immortals végig az első helyen álló TSM nyakában loholt. Az alapszakaszbeli kiváló játékuk ellenére Reignover és az Immortals a rájátszásban és a regionális selejtezőkben is rosszul szerepelt. A 2016-os All-Star gálán ismét bizonyíthat, és megmutathatja, hogy ő a világ legjobb dzsungelharcosa.\n","it_IT":"Quest'anno Yeu-jin \"Reignover\" Kim ha davvero lasciato il segno nella LCS NA. Anche se gli Immortals non sono riusciti a qualificarsi per i Mondiali, le sue prestazioni durante lo Spring e il Summer Split hanno fatto decisamente colpo sui votanti, che lo hanno premiato con il 36% dei voti per la categoria Giungla. È evidente per i fan che, nonostante la sua assenza ai Mondiali, Reignover abbia le carte in regola per duellare con i giocatori da giungla più abili al mondo. </p>\n\nDopo aver lasciato lo storico team europeo di Fnatic, Reignover ha fatto furore in Nord America guidando i neonati Immortals a un record stagionale di ben 17-1, guadagnandosi il riconoscimento di MVP nello Spring Split LCS NA 2016. Il suo predominio è proseguito durante il Summer Split, in cui è riuscito a tenere la sua squadra sempre alle calcagna della capolista TSM per l'intera stagione. Nonostante le loro eccellenti prestazioni nella stagione regolare, Reignover e gli Immortals hanno ceduto durante i playoff e le qualificazioni regionali. Nell'All-Star 2016 Reignover potrà mostrare nuovamente le sue abilità e ricordare ai suoi ammiratori che rimane sempre uno dei migliori giocatori di giungla del mondo.\n\n","ro_RO":"Yeu-jin ''Reignover'' Kim și-a pus amprenta anul acesta pe LCS NA. Cu toate că cei din Immortals n-au reușit să se califice la Mondiale, reușitele lui Reignover din etapele de primăvară și de vară au rămas întipărite în mintea celor care l-au votat, obținându-i 36 la sută din voturile pentru junglă. E clar că fanii sunt de părere că, deși nu a participat la Mondiale, s-ar fi descurcat foarte bine împotriva celorlalți jungleri de top ai lumii. </p>\n\nDupă ce a părăsit Fnatic, echipa europeană care a făcut istorie, Reignover a luat cu asalt America de Nord și a reușit să conducă echipa nou-formată Immortals către un record de 17-1 în sezonul normal, obținând titlul de cel mai valoros jucător (MVP) în etapa de primăvară LCS NA 2016. A continuat să domine și în etapa de vară, Immortals rămânând foarte aproape de TSM, echipa de pe primul loc, de-a lungul întregului sezon. Însă chiar dacă și-au distrus adversarii în sezonul normal, cei din Immortals au dat greș în playoff-uri și la calificările regionale. La All-Star 2016, Reignover va avea șansa să demonstreze de ce e în stare și să le reamintească fanilor de ce e unul dintre cei mai buni jungleri din lume.\n","es_AR":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>","es_MX":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>"},"foreignIds":{"drupalId":"885","TRLH1":"200000242","TRLH2":"200000146"},"socialNetworks":{"twitch":"","facebook":"www.facebook.com/pages/Yeujin-Reignover-Kim/1572697482942877","twitter":"https://twitter.com/FnaticReignover"},"champions":[],"liveGameTeam":53},{"id":372,"slug":"inori","name":"Inori","firstName":"Rami","lastName":"Charagh","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inori-1sztspha.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:11.000Z","updatedAt":"2017-08-04T00:04:15.000Z","bios":{"en_US":"<p>Rami \"Inori\" Charagh is Phoenix1's fearless jungler. Phoenix1's 2016 NA LCS Summer Split looked like it was played by two entirely different teams. Before Inori joined, the team looked lost. After he arrived, they found a leader. While it wasn't enough to avoid the 2017 NA LCS Promotion tournament, Inori helped the team easily escape relegation.</p>","de_DE":"Rami „Inori“ Charagh ist der furchtlose Jungler von Phoenix1. Beim Sommer-Split der NA LCS 2016 von Phoenix1 hatte man das Gefühl, dass zwei komplett verschiedene Mannschaften an den Start gingen. Vor Inoris Beitritt wirkte das Team verloren. Aber mit ihm haben sie einen neuen Anführer gefunden. Auch wenn es nicht ganz gereicht hatte, das Aufstiegsturnier der NA LCS 2017 zu verhindern, konnten sie mit Inoris Hilfe dem Abstieg mit Leichtigkeit entgehen.\n<p>\nDamit können Inori und Phoenix1 den gesamten Split 2017 ohne Rückstand in Angriff nehmen. Wenn es die neue Mannschaft schafft, seinen aggressiven Spielstil im Dschungel mit Champions wie Rengar und Hecarim zu unterstützen, werden sie ein harter Gegner für jedes Team der NA LCS. Inori ist für seinen Raubtierinstinkt bekannt, und wenn er sich erst einmal einen Vorteil erarbeitet hat, wird er nicht zögern, seinem Gegner den Todesstoß zu versetzen.\n"},"foreignIds":{"drupalId":"2580","TRLH1":"200000233","TRLH2":"200000137"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":558,"slug":"mickey","name":"Mickey","firstName":"Youngmin","lastName":"Son","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mickey-emcoa162.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-05T21:03:01.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3190","ESPORTSTMNT06":"200000962","TRLH1":"200000719"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":626,"slug":"lourlo","name":"Lourlo","firstName":"Samson","lastName":"Jackson","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lourlo-fmal547y.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-29T02:26:38.000Z","bios":{"en_US":"<p>Samson \"Lourlo\" Jackson made his LCS debut in the 2016 NA LCS Spring Split when he was known as Lourlo. His previous experience with CLG Black prepared him for the jump from semi-pro to pro, and while he didn’t stand out, it’s hard to blame him - with Dardoch and Piglet on your team, it’s hard to get attention.</p>\n\n<p>Yet analysts and fans noticed Lourlo’s rock solid dedication. Even when Liquid had a rough game, Lourlo was playing his heart out. His commitment to constantly bettering himself led to him netting more consistent performances. He may not be the flashiest player on the Rift, but you’d be hard pressed to find anyone that works harder. Team Liquid kept him on board during their roster shuffle, cementing that they believe Lourlo still has heaps of potential that they’re keen to unlock.</p>","fr_FR":"<p>Sam « Lourlo » Jackson fait ses débuts dans les LCS NA en participant à ce segment de printemps 2016. Son expérience passée auprès de CLG Black l'a préparé pour son passage du statut de semi-pro à pro véritable, mais rien ne vaut un premier segment pour réellement faire la distinction entre le bon et la brute (ou le truand). Étant donné que Lourlo est actuellement en 26e place du serveur NA, il devrait à tout le moins être capable de s'affirmer au niveau des mécaniques de jeu.</p>\n<p>Nous n'avons pas vu Lourlo participer à un événement majeur de League of Legends depuis les Challenger Series du printemps 2015. Impossible de prévoir quel genre de nouveauté il pourrait apporter à la méta aujourd'hui ! D'après ses performances en file solo, il maîtrise une multitude de champions, parmi lesquels figurent Riven, Irelia, Nidalee et Rumble.</p>","pl_PL":"<p>\"Lourlo\" zaczął grać w League of Legends w pierwszym sezonie, lecz na grę w profesjonalnym zespole zdecydował się dopiero we wrześniu 2014 roku. Był jednym z założycieli drużyny Storm, wraz z takimi znanymi zawodnikami jak: Zachary \"mancloud\" Allan Hoschar i Terry \"BIG\" Chuong. Planowali zakwalifikować się do wiosennego sezonu NA LCS 2015, lecz Samson jeszcze nie miał wtedy skończonych 17 lat. Dlatego ostatecznie cała drużyna pozostała na scenie Kręgu Pretendenta. Jednak już w lutym 2015 roku zdecydował się grać w Challenger Series dla innej organizacji – Counter Logic Gaming Black. Nie osiągnął za wiele w ich szeregach, gdyż skończył wiosenny okres na 6 pozycji, co było dosyć przeciętnym wynikiem. Jednak \"Lourlo\" dokonał najważniejszej rzeczy dla niego samego – pokazał się wśród profesjonalistów. Swoimi wynikami w Challenger Series zachęcił poważną organizację, Team Liquid, do zaproszenia go do pierwszego składu. Sam powiedział, że gra w CLG Black pozwoliła mu zdobyć doświadczenie na profesjonalnej scenie i rozwinąć swój zasób bohaterów, co było niezbędne dla przejścia do wyższej ligi.</p>\n<p>W wywiadzie dla theScore eSports Samson opowiedział o swoich uczuciach związanych z objęciem tak odpowiedzialnej pozycji. Przyznał, że w tak wczesnym etapie jego kariery, taki „awans” to dla niego olbrzymia nobilitacja. Uważa, że dla debiutanta zastąpienie takiego weterana jak Diego \"Quas\" Ruiz to zaszczyt i jednocześnie wyzwanie. \"Lourlo\" przyznał, że „ma nadzieję, że sprosta tej próbie sił i dowiedzie swoich umiejętności wśród najlepszych zawodników”. Wiele osób opisuje Samsona jako niezwykle agresywnego top-lanera, który zawsze podejmuje próbę carrowania swojej drużyny. Jednak zaraz po dołączeniu do Team Liquid, on sam zaznaczył, że dostosuje się do nowego zespołu i jeśli zajdzie potrzeba zmieni swój styl gry. Wywiad podsumował stwierdzeniem, że w wiosennym sezonie NA LCS 2016 da z siebie wszystko. </p>\n<p>Pseudonim Samsona pochodzi z czasów kiedy grał w inne gry. Spędzał tak czas ze swoim bratem, który jest profesjonalnym zawodnikiem innych komputerowych tytułów. Na swoją pozycję najbardziej lubi wybierać Nidalee i Irelię, ponieważ docenia ich możliwości w agresywnych zagraniach. Wojowniczym postaciom na top-lanie zawdzięcza wejście do Kręgu Pretendenta w Ameryce Północnej. Jednak, gdy pojawia się konieczność, świetnie sobie radzi takimi bohaterami jak Sion czy Maokai. </p>\n","de_DE":"Sam „Lourlo“ Jackson gab sein LCS-Debüt im Frühjahrs-Split der nordamerikanischen LCS 2016. Seine Erfahrungen mit CLG Black haben ihn auf den Sprung vom Halbprofi zum Profi vorbereitet und obwohl er keine überragende Leistung ablieferte, kann man ihm nichts vorwerfen – wenn Dardoch und Piglet in deiner Mannschaft sind, ist es schwer, Aufmerksamkeit zu erregen.\n</p>\nDennoch fiel den Analysten und Fans Lourlos unglaubliches Engagement auf. Selbst in schwierigen Spielen gab Lourlo alles. Seine Hingabe, sich ständig selbst zu verbessern, führte dazu, dass er immer beständigere Leistungen ablieferte. Er ist vielleicht nicht der auffälligste Spieler in der Kluft, aber man muss schon ziemlich lange suchen, um jemanden zu finden, der härter arbeitet als er. Team Liquid hat an Lourlo festgehalten und die Entscheidung damit gerechtfertigt, dass er ihrer Meinung nach noch unglaublich viel Potenzial hat, das sie gerne entfesseln würden.\n"},"foreignIds":{"drupalId":"3814","TRLH1":"200000241","TRLH2":"200000145"},"socialNetworks":{"twitch":"http://www.twitch.tv/lourlo","twitter":"https://twitter.com/LiquidLourlo"},"champions":[],"liveGameTeam":53},{"id":746,"slug":"roar","name":"Roar","firstName":"Jang-won","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/roar-3sgsb7kb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-06-15T22:40:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"874","TRLH1":"1001300003","FRA1TMNT1":"445029"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":777,"slug":"dardoch","name":"Dardoch","firstName":"Joshua","lastName":"Hartnett","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dardoch-h91p55co.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:26:47.000Z","updatedAt":"2017-08-04T00:04:43.000Z","bios":{"en_US":"Joshua “Dardoch” Hartnett is a true competitor. He demonstrated that in his impressive rookie season that saw him carry and trash talk with the best of them. But his obsession with winning over all else caused problems during a tumultuous Summer Split for Liquid, and he was forced off the team.\n</p>\n<p>Talent has never been a question for Dardoch. If he can work his team, his competitive drive could carry them to new heights.</p>\n\n","de_DE":"Joshua „Dardoch“ Hartnett ist ein echter Wettkämpfer. In seiner beeindruckenden ersten Saison hat er gezeigt, dass er Spiele im Alleingang entscheiden und auch die Besten der Besten gegen die Wand reden kann. Aber seine Versessenheit darauf, um jeden Preis zu gewinnen, hat während des turbulenten Sommer-Splits für Probleme bei Liquid gesorgt, weshalb er auch aus dem Team geworfen wurde.\n</p>\nDie Immortals bieten Dardoch im Jahr 2017 die Chance auf einen Neuanfang. Nach den Umbrüchen in der gesamten NA LCS ist der Titel des Frühjahrs-Splits 2017 reif für die Ernte. Dardochs Talent steht außer Frage. Wenn er mit seinem neuen Team harmoniert, könnte er den Immortals mit seiner wettkampforientierten Einstellung zu neuen Höchstleistungen verhelfen.\n"},"foreignIds":{"drupalId":"3835","TRLH1":"200000216","TRLH2":"200000120"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":969,"slug":"matt","name":"Matt","firstName":"Matt","lastName":"Elento","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/matt-g07k92st.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:10:14.000Z","updatedAt":"2017-01-29T02:27:14.000Z","bios":{"en_US":"<p>Matt \"Matt\" Elento is a Hawaiian who often wears a huge smile and a relaxed attitude. If you saw him out of game, you might not realize that you’re looking at one of the best Bard players around. Stand near a wall? Matt’s going to get you. Group up in a bad location? Ult incoming. Playing a mechanically intensive and unorthodox champion is rough at the best of times -- now imagine you’re doing it in your rookie season, and oh yeah, you’re playing with a World Champion in your lane. Welcome to Matt’s life.</p>\n\n<p>Matt has proven that he has big play potential on the LCS stage, but he has admittedly questioned his own decision making in game which lead to fluctuating performances in the 2016 NA LCS Summer Split. If the first step to fixing yourself is admitting your faults, Matt is well on his way to improving his play. He comes into 2017 with his explosive laning buddy Piglet back by his side and has the chance to make good on his promises to improve. He has the ability to make electric plays -- now it’s time to hit the Rift and prove it.</p>\n\n<p>Learn more about Matt in his <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">Drive documentary.</a></p>","de_DE":"Matt „Matt“ Elento ist ein Hawaiianer, der meistens mit einem breiten Grinsen und einer entspannten Grundhaltung zu sehen ist. Wenn man ihm außerhalb des Spiels begegnet, merkt man nicht, dass man gerade vor einem der besten Bard-Spieler der Welt steht. Du stehst neben einer Mauer? Matt wird dich schnappen. Du hast dich mit deinem Team an einem schlechten Ort versammelt? Schon kommt der Ult. Es ist meistens schwierig, einen mechanisch anspruchsvollen, unkonventionellen Champion zu spielen – und jetzt stell dir vor, du machst das in deiner ersten Saison und dein Partner auf der Lane ist ein Weltmeister. Willkommen in Matts Leben.\n</p>\nMatt hat auf der Bühne der LCS bewiesen, dass er großes Potenzial hat, aber er hat auch seine eigenen Entscheidungen im Spiel hinterfragt, die zu durchwachsenen Leistungen im Sommer-Split der NA LCS 2016 geführt haben. Wenn der erste Schritt zur Besserung die Selbsterkenntnis ist, dann ist Matt auf dem besten Weg, sich als Spieler zu verbessern. 2017 hat er mit Piglet einen explosiven Partner auf der Lane und die Chance, sein Versprechen, sich zu verbessern, in die Tat umzusetzen. Er ist imstande, elektrisierende Spielzüge auszuführen – und jetzt wird es Zeit, sein Können in der Kluft unter Beweis zu stellen.</p>\n<p>Erfahre mehr über Matt in seiner  <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">DRIVE-Geschichte.</a></p>"},"foreignIds":{"TRLH1":"200000245","TRLH2":"200000149"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":2081,"slug":"insanity","name":"Insanity","firstName":"David","lastName":"Challe","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/insanity-5ba0sw13.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-07-28T01:25:57.000Z","updatedAt":"2017-07-28T01:42:26.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":53}],"scheduleItems":[{"id":"AVTfrUWnoUG4HPFjOJ_8","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:3474b279-47e2-418f-a9fe-741203696b56","scheduledTime":"2016-06-25T03:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"4","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"3474b279-47e2-418f-a9fe-741203696b56","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"80ce1904-3ddc-43e1-821c-b86e1b811726","gameHash":"44c996900d35483c"},{"id":"415daa39-8e2f-4b84-ab63-0d723ae1a7bb","gameHash":"3f52a287ef18a0c4"}],"videos":[{"id":3399,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:415daa39-8e2f-4b84-ab63-0d723ae1a7bb","source":"https://www.youtube.com/embed/DUpYNpZMsK0?wmode=transparent","createdAt":"2016-06-25T05:47:44.000Z","updatedAt":"2016-06-25T05:47:44.000Z","game":"415daa39-8e2f-4b84-ab63-0d723ae1a7bb"},{"id":3400,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:80ce1904-3ddc-43e1-821c-b86e1b811726","source":"https://www.youtube.com/embed/YzbMUbPqQuo?wmode=transparent","createdAt":"2016-06-25T06:50:36.000Z","updatedAt":"2016-06-25T06:50:36.000Z","game":"80ce1904-3ddc-43e1-821c-b86e1b811726"}],"htmlBlocks":[],"match":{"id":"3474b279-47e2-418f-a9fe-741203696b56","name":"TL-vs-APX","position":16,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"},{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],"games":{"80ce1904-3ddc-43e1-821c-b86e1b811726":{"id":"80ce1904-3ddc-43e1-821c-b86e1b811726","name":"G2","generatedName":"APX|TL|G2|3474b27947e2418fa9fe","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"},{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],"standings":{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466836971067,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466830677885,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001750030","gameRealm":"TRLH1","platformId":"TRLH1:1001750030","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"13dcc273-83a8-44e0-a0f6-830bc31e4e15":{"id":"13dcc273-83a8-44e0-a0f6-830bc31e4e15","name":"G3","generatedName":"APX|TL|G3|3474b27947e2418fa9fe","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"},{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"415daa39-8e2f-4b84-ab63-0d723ae1a7bb":{"id":"415daa39-8e2f-4b84-ab63-0d723ae1a7bb","name":"G1","generatedName":"APX|TL|G1|3474b27947e2418fa9fe","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"},{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],"standings":{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466833029564,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466827550374,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001750023","gameRealm":"TRLH1","platformId":"TRLH1:1001750023","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466836971068,"source":"bestOf","history":[{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466833029564,"source":"bestOf","closed":true},{"result":[[{"roster":"6ca239d8-786d-4e22-bb1b-e233c80f192d"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1466830677885,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"6ca239d8-786d-4e22-bb1b-e233c80f192d":1,"6f394509-2d2b-48d4-a987-3d849b01b644":0}}}