{"teams":[{"id":15,"slug":"fnatic","name":"Fnatic","guid":"be6c86ea-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bjbf9nf7.jpg","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-i09wrkpf.png","acronym":"FNC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bkk3xam5.png","createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-07-27T00:51:46.000Z","bios":{"en_US":"<p>As the original League of Legends World Champion, Fnatic was the team to beat in LoL’s infancy. These days, the squad is completely unrecognizable from its original form. With a new roster mixing veteran playmakers like sOAZ and Rekkles plus Caps, their lone rookie, Fnatic is remaking itself. Putting their underwhelming 2016 behind them, Fnatic believe they are building a roster that could make a serious run at the EU LCS trophy.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>\n","fr_FR":"<p>Première détentrice du titre mondial de League of Legends, Fnatic était l'équipe à battre dans la prime enfance de LoL. Mais l'équipe d'aujourd'hui n'a plus rien à voir avec sa forme d'origine. Sa nouvelle formation accueillant à présent des talents coréens, des joueurs européens prometteurs et Rekkles, la star carry AD, Fnatic est en pleine reconstruction. Avec une série de 18 victoires sans défaite durant le segment d'été des LCS EU 2015 et une qualification pour les demi-finales du mondial 2015, l'équipe a prouvé qu'elle pouvait encore obtenir des résultats.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>","pl_PL":"<p>Legendarni obrońcy honoru Europy. Fnatic to jedna z najstarszych drużyn konkurujących w League of Legends. 14 marca 2011 roku ta organizacja, dobrze znana z udziału w innych grach, zaistniała w świecie Runeterry. Świeżo po założeniu, od razu zabrała się za największy kaliber osiągnięć. Żółto-czarni byli jedną z 8 ekip, które zakwalifikowały się do Mistrzostw Riot Games pierwszego sezonu. Dokonali tego zaledwie trzy miesiące po założeniu drużyny, co jak na początkujących, stanowiło imponujący wyczyn. Przez cały turniej przegrali tylko dwa mecze na swojej drodze do zwycięstwa. Dzięki temu osiągnięciu Europa zawdzięcza im swój jedyny dotąd mistrzowski tytuł, a codzienni gracze mogą cieszyć się skinami europejskiego zespołu. Ten historyczny triumf to był dopiero początek wielkich sukcesów tej drużyny.</p>\n\n<p>Doskonałą kondycją Fnatic mógł się pochwalić również w trzecim, czwartym i piątym sezonie, podczas których reprezentował Europę na Mistrzostwach Świata. W 2014 roku nie udało im się wejść do fazy eliminacji, lecz w pozostałych latach pokazali prawdziwą klasę. Podczas MŚ w Stanach Zjednoczonych, w 2013 roku, wyszli ze swojej grupy na pierwszym miejscu, z zawrotnym wynikiem 7:1. W ćwierćfinałach podołali ówcześnie najmocniejszej drużynie Ameryki, Cloud9, na ich własnym terenie. Ulegli dopiero w półfinale z Royal Club, lecz nawet wtedy czarno-żółtym udało się zatriumfować w jednej grze przed ostateczną porażką. Podobnym powodzeniem Fnatic mógł się pochwalić podczas MŚ 2015. Kolejny raz zdominowali fazę grupową, jeszcze raz znajdując się na pierwszym miejscu, tym razem z wynikiem 4:2. W ćwierćfinale stoczyli walkę z pierwszorzędnym chińskim zespołem – Edward Gaming. Warto zauważyć, że był to jeden ze zdecydowanych faworytów tego wydarzenia. Zdominowali ich 3 do 0, nie pozostawiając cienia złudzeń co do tego, kto zasłużył na laur. Odpadli dopiero w półfinale w starciu z koreańską potęga. Patrząc na dorobek Fnatic z Mistrzostw Świata, śmiało można stwierdzić, że mało która organizacja na świecie może pochwalić się tak niezmiennie dobrymi wynikami.\n</p>\n<p>\nO osiągnięciach tej drużyny na pomniejszych turniejach można by napisać książkę. Jednak trzeba zwrócić uwagę na bezsprzecznie niepowtarzalne triumfy zespołu Fnatic. To przede wszystkim stała i niezachwiana dominacja w lidze EU LCS. Ekipa czarno-żółtych zawsze była na pierwszym lub drugim miejscu w rozgrywkach League Championship Series. Niezłomność i permanentna obecność Fnatic na szczycie zasługuje na najwyższe uznanie. Oprócz członkostwa graczy najwyższych lotów, ten sukces wynika także z zapewnionego im troskliwego patronatu przez samą organizację. Na początku piątego sezonu do kadry dołączył Luis „Deilor” Sevilla, który wcześniej był profesjonalnym trenerem pokera. Wiele osób uważa, że w dużej mierze to właśnie on stoi za sukcesem czarno-żółtych na MŚ 2015. Pod jego opiekuńczymi skrzydłami Fnatic rozkwitło. W wiosennym sezonie EU LCS 2015 skończyli z wynikiem 13:5, a w letnim pobili światowy rekord i pozostali niepokonani aż do końca.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Responsable d’équipe: Finlay \"Quaye\" Stewart</p>","de_DE":"<p>Als LoL noch in den Kinderschuhen steckte, war Fnatic, der erste Weltmeister in der Geschichte von League of Legends, die Mannschaft, die es zu schlagen galt. Die heutige Mannschaft hat mit der damaligen nichts mehr gemein. Mit einer Mischung aus erfahrenen Spielern wie sOAZ und Rekkles sowie dem Nachwuchsspieler Caps versucht Fnatic, sich neu zu erfinden. Fnatic hat die Rückschläge des vergangenen Jahrs hinter sich gelassen und glaubt, mit der neuen Aufstellung Chancen auf den Titel in der EU LCS zu haben. Die Spieler sind entschlossen und haben das Zeug dazu, als beste Mannschaft in die langjährige Geschichte Fnatics einzugehen.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Mannschaftsleiter: Finlay \"Quaye\" Stewart</p>\n","es_ES":"<p>Hablar sobre Fnatic es hacerlo sobre éxito, dedicación y superación. El conjunto europeo más laureado de la escena tendrá otro año más que empezar de cero y saber renovarse para intentar emular los resultados del año pasado. Algo que se plantea casi imposible por su inmaculada temporada se tendrá que realizar con nuevos jugadores que a pesar de no ser tan desconocidos como los que comenzaron el año pasado presentan mayores dudas.</p>\n\n<p>El palmarés de Fnatic es impresionante. Desde ganar el primer Campeonato Mundial de League of Legends hasta sólo perder una vez los playoffs de la LCS europea en verano de 2014 contra Alliance. La única mancha de la organización es la no presencia en el Campeonato Mundial 2012, así cómo podría considerarse un pequeño bache no pasar de la fase de grupos en el Campeonato Mundial de 2014. Pero, en el resto de ocasiones, la actuación ha sido espectacular.</p>\n\n<p>Hasta el año pasado, Fnatic mantuvo un núcleo que siempre otorgaba las mismas impresiones. Durante la fase regular, probaban cambios y los resultados les dejaron un poquito al margen, pero lo suficiente como para clasificarse y luego arrasar en los playoffs. Un equipo calculador que en todo momento ha sabido aprovechar sus recursos para poder superar las expectativas de los aficionados.</p>\n\n<p>El año pasado la renovación no sólo fue fructífera, sino inesperada. Los chicos de Luis ‘Deilor’ Sevilla fueron capaces de ganar en primavera después de una fase regular con sensaciones encontradas. La actuación en el Mid Season Invitational motivó a pensar que Fnatic podía plantar cara a los mejores equipos del mundo. Verano no dio lugar a dudas, puesto que ganaron todos los partidos disputados en la fase regular y estuvieron a punto de hacerlo también en los playoffs si no fuera porque Origen les plantó cara en la final y les pudo sacar dos partidos. Pero no fue suficiente, y Fnatic de nuevo se llevó el preciado trofeo.</p>\n\n<p>Muchos críticos tenían curiosidad por ver si este, probablemente el mejor equipo europeo desde Moscow 5, conseguiría plantar cara a equipos internacionales. Y a pesar de un mal inicio en la fase de grupos, remontaron con un gran nivel y se clasificaron a cuartos de final. Allí derrotaron a la potencia china con una facilidad pasmosa, pero los coreanos juegan en otra división y KOO Tigers acabó con sus esperanzas en las semifinales.</p>\n\n<p>Después de los mundiales tanto su top, Heo ‘Huni’ Seung-hoon, como su mid, Kim ‘Reignover’ Yeu-jin, anunciaron su intención de marcharse a américa en busca de un reto nuevo. Pero la esencia real se perdía con la marcha de Bora ‘YellOwStaR’ Kim, líder del grupo que también decidió irse con el mismo objetivo. El equipo quedó huérfano después de casi tres años enteros del francés con la organización.</p>\n\n<p>Hay que mirar hacia adelante. Al igual que el año pasado las exigencias sólo eran de clasificarse al mundial y al final el buen trabajo recompensó, esta temporada hay que ser lo suficientemente humildes para poder aspirar a gestas heroicas. El equipo ha demostrado que es capaz de sacar provecho de plantillas como la actual, pero todavía es muy pronto para saber cómo funcionarán internamente y sólo queda disfrutar del progreso del conjunto.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Jefe de equipo: Finlay \"Quaye\" Stewart</p>","pt_BR":"O primeiro campeão mundial da história de League era o time a ser batido nos primeiros anos do cenário competitivo. Hoje, porém, a escalação é totalmente diferente daquela formação original. A nova Fnatic combina talentos coreanos com promessas do cenário europeu e uma base sólida com o suporte YellOwStaR. Eles podem estar se reconstruindo ainda, mas os resultados já são inquestionáveis: recorde de 18V-0D na etapa de verão da LCS EU, e primeiro lugar nas eliminatórias.  ","en_GB":""},"foreignIds":{"drupalId":"68"},"players":[94,98,172,344,1107,1111,1264],"starters":[94,98,172,1107,1111],"subs":[344,1264]},{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]}],"players":[{"id":94,"slug":"soaz","name":"sOAZ","firstName":"Paul","lastName":"Boyer","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/soaz-a3dmvmfk.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:38.000Z","updatedAt":"2017-06-09T10:03:16.000Z","bios":{"en_US":"<p>Paul \"sOAZ\" Boyer is a true esports veteran, with a career going back to 2010. Before signing with Origen he had been a rock in the top lane for Fnatic for over two years, joining the squad in two World Championship runs. After the 2014 Season concluded, Fnatic entered a rebuilding process which saw nearly the entire roster head their separate ways. Following his departure from Fnatic, Origen founder and mid laner Enrique \"xPeke\" Cedeño Martínez courted sOAZ to be the final addition to his new Challenger Series venture. sOAZ jumped at the chance, where he was instrumental in Origen's runs through the Challenger circuit, multiple EU LCS Splits, and even a World Championship appearance.</p>\n\n<p>sOAZ decided to return to Fnatic in 2017 as their starting top laner, after another frustrating split for Origen led to many players searching for greener pastures. He brings tons of experience (and his trusty baguette) back to Fnatic where he’s aiming to add to his long list of professional accolades. sOAZ would tell you that he’s got plenty left in the tank for another shot at Worlds, but he’ll have to fight his way through the regular season first. You shouldn’t worry though, it seems like this is something he’s done before.</p>","fr_FR":"<p>Paul « SoaZ » Boyer est un véritable vétéran de l'e-sport, avec une carrière remontant à 2010. Avant de rejoindre Origen, il s'est démarqué comme top laner chez Fnatic pendant plus de deux ans, participant ainsi à deux Championnats du monde. Après la fin de la saison 2014, Fnatic est entrée dans un processus de reconstruction et presque toute la formation a été démantelée. Après son départ de chez Fnatic, le fondateur d'Origen et mid laner Enrique « xPeke » Cedeño Martínez a courtisé Soaz pour qu'il rejoigne sa nouvelle équipe dans les Challenger Series. Soaz a sauté sur l'occasion et a ainsi joué un rôle important dans le succès d'Origen sur le circuit Challenger, dans plusieurs segments des LCS EU et même lors d'une apparition dans le Championnat du monde.</p>\n\n<p>Soaz a été le seul point positif d'un segment d'été catastrophique pour Origen en 2016. Il a décroché des victoires pour Origen à lui seul et a maintenu la compétitivité de l'équipe quand tout espoir semblait perdu. Ses excellentes performances (et ses fans dévoués) lui ont valu un ticket pour Barcelone pour participer à l'événement All-Stars 2016. Ses années d'expérience compensent ses compétences mécaniques limitées. Si l'Europe espère éviter une élimination anticipée, elle devra compter sur le vétéran robuste (et sur sa baguette) pour la guider à travers l'une des compétitions les plus difficiles de la Faille.</p>","pl_PL":"<p>Paul „SoaZ” Boyer to prawdziwy weteran e-sportu, którego kariera sięga 2010 roku. Przed przejściem do Origen był nie do ruszenia na górnej alei Fnatic przez ponad dwa lata, dołączając do składu w dwóch podejściach do Mistrzostw Świata. Po zakończeniu sezonu 2014 Fnatic rozpoczęli proces przebudowy, w wyniku którego rozeszli się niemal wszyscy gracze z początkowego składu. Po odejściu z Fnatic założyciel i środkowy Origen, Enrique „xPeke” Cedeño Martínez, zabiegał o to, by Soaz stał się ostatnim uzupełnieniem jego nowej drużyny w Challenger Series. Soaz chętnie skorzystał z tej okazji i odegrał kluczową rolę w drodze po zwyciestwo Origen podczas Challenger Circuit, kilku splitach EU LCS, a nawet występie na Mistrzostwach Świata.</p>\n\nSoaz był zapewne jedynym jasnym punktem letniego splitu 2016, o którym Origen woleliby zapomnieć. Samodzielnie prowadził Origen do zwycięstw i utrzymywał ich w konkurencyjnej formie, nawet gdy wydawało się, że wszystko już stracone. Jego świetne występy (oraz oddani fani) zapewniły mu bilet do Barcelony i udział w wydarzeniu All-Star 2016. Niedoskonałości umiejętności mechanicznych nadrabia latami doświadczeń. Jeśli Europa chce uniknąć kolejnej pożałowania godnej porażki, będzie musiała polegać na tym niezłomnym weteranie (i jego bagietce), który poprowadzi drużynę do boju przeciwko kilku z najtwardszych rywali na Summoner’s Rift.\n","de_DE":"<p>Paul „sOAZ“ Boyer ist ein wahrer E-Sport-Veteran, dessen Karriere 2010 begann. Vor seinem Wechsel zu Origen war er über zwei Jahre Fnatics Fels auf der oberen Lane, mit denen er auch an zwei Weltmeisterschaften teilgenommen hat. Nach dem Ende der Saison 2014 wurde Fnatic umstrukturiert und die ehemaligen Mitglieder gingen getrennte Wege. sOAZ wurde von Mid-Laner Enrique „xPeke“ Cedeño Martínez, der nach seinem Abgang von Fnatic Origen gegründet hatte, als letztes Mitglied für sein Abenteuer in der Challenger Series angeworben. Er ergriff die Gelegenheit und wurde zu einem wichtigen Bestandteil von Origens Durchmarsch in der Challenger Series, mehreren Splits in der EU LCS und sogar einer Teilnahme an der Weltmeisterschaft.</p>\n\n<p>Nachdem ein weiterer frustrierender Split dazu geführt hatte, dass viele Spieler Origen verließen, kehrte sOAZ zu Fnatic zurück, um für sie auf der oberen Lane zu spielen. Er kommt mit einer Menge Erfahrung (und seinem treuen Baguette) zu Fnatic zurück und wird versuchen, seine Liste mit Auszeichnungen zu erweitern. sOAZ würde sicher sagen, er habe noch genug Reserven, um bei einer weiteren Weltmeisterschaft mitzuspielen, aber dazu muss er sich erst einmal durch den Frühjahrs-Split kämpfen. Aber keine Angst, das ist nichts, was er nicht schon einmal getan hätte.</p>","es_ES":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella de la calle superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomase caminos separados. Tras abandonar Fnatic, el fundador y mid de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito aspirante, en numerosos split de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un split de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","pt_BR":"<p>Paul \"sOAZ\" Boyer é um verdadeiro veterano dos eSports, com uma carreira que começou em 2010. Antes de entrar para a Origen, ele foi o jogador de topo da Fnatic por mais de dois anos, entrando no esquadrão com duas participações do Mundial nas costas. Após o fim da Temporada 2014, a Fnatic entrou em um processo de reconstrução onde viu quase todos os membros da equipe seguirem caminhos distintos. Após a saída da Fnatic, o fundador da Origen, o jogador Enrique “xPeke” Cedeño Martínez considerou sOAZ para ser a peça final em sua aventura pela Challenger Series. Ele entrou e foi essencial na campanha da Origen pelo torneio, nas várias Etapas da LCS EU e até mesmo em uma aparição no Mundial.</p>\n\n<p>sOAZ foi a única salvação de do que foi uma Etapa de Verão triste para a Origen em 2016. Ele conseguiu praticamente sozinho algumas vitórias para a Origen e os manteve no competitivo, mesmo quando tudo parecia estar perdido. Seu desempenho incrível (e seus fãs) lhe conquistou uma vaga no Evento All-Star 2016 em Barcelona. Quando ele não tem domínio mecânico, sua experiência ajuda. Se a Europa quiser evitar perder rapidamente como no Mundial, eles precisam confiar no veterano para guiá-los na competição implacável de Summoner’s Rift.</p>","cs_CZ":"<p>Paul „SoaZ“ Boyer je skutečným veteránem esportů, jeho kariéra se totiž datuje od roku 2010. Ještě než nastoupil do Origenu, byl přes dva roky v horní lajně oporou Fnaticu, se kterým se zúčastnil dvou mistrovství světa. Po skončení sezóny 2014 však Fnatic prošel restrukturalizací, při které se cesty téměř všech jeho bývalých hráčů rozdělily. Po odchodu z Fnaticu oslovil SoaZe zakladatel a středový lajnař Origenu Enrique „xPeke“ Cedeño Martínez, který jej chtěl jako svůj poslední trumf do týmu, který měl vzít šturmem Challenger Series. SoaZ po této šanci s chutí sáhl a velkou měrou přispěl k úspěchům Origenu v seriálu Challenger, několika splitech evropského LCS a dokonce i na mistrovství světa.</p>\n\n<p>SoaZ byl nejspíš tím jediným, co drželo Origen nad vodou během jinak úděsného letního splitu 2016. Sám se snažil dotáhnout tým k výhrám a udržoval jej při životě, i když už vše vypadalo naprosto beznadějně. Jeho špičkové výkony (a zástupy milujících fanoušků) mu zajistily lístek do Barcelony, kde se zúčastní turnaje All-Star 2016. To, co mu schází v čisté herní mechanice, dohání roky zkušeností. Pokud chce Evropa tentokrát držet krok s ostatními týmy, bude se muset při bojích s těmi nejdrsnějšími soupeři opřít o tohoto veterána (a jeho bagetu).</p>","el_GR":"<p>Ο Paul \"SoaZ\" Boyer είναι ένας πραγματικός βετεράνος των esports που ξεκίνησε την καριέρα του ήδη από το 2010. Πριν υπογράψει στους Origen ήταν η άγκυρα των Fnatic στην επάνω λωρίδα για πάνω από δύο χρόνια και μάλιστα είχε λάβει μέλος με την ομάδα σε δύο Παγκόσμια Πρωταθλήματα. Μετά τη λήξη της Σεζόν 2014, έγιναν μεγάλες ανακατατάξεις στους Fnatic, καθώς όλοι σχεδόν οι παλιοί παίκτες της ομάδας τράβηξαν το δικό τους δρόμο. Όταν αποχώρησε από τους Fnatic, ο ιδρυτής και παίκτης μεσαίας λωρίδας των Origen Enrique \"xPeke\" Cedeño Martínez προσέγγισε τον Soaz για να συμπληρώσει το ρόστερ της νέας του προσπάθειας στο Challenger Series. Ο Soaz δέχτηκε με μεγάλη προθυμία και η παρουσία του ήταν καταλυτική στην πορεία των Origen στο Challenger Circuit, αλλά και σε πολλά Split του LCS Ευρώπης, ακόμα και σε μια μοναδική εμφάνιση στο Παγκόσμιο Πρωτάθλημα.</p>\n\n<p>Ο Soaz ήταν ίσως η μοναδική θετική νότα στην καταστροφική πορεία των Origen στο Summer Split 2016. Οδήγησε μόνος του στην ομάδα σε μια σειρά από νίκες και τους κράτησε σε υψηλό επίπεδο, όταν όλα έδειχναν ότι είχαν χαθεί. Αυτές οι εμφανίσεις του κόντρα στο ρεύμα (αλλά και οι θαυμαστές του που τον λατρεύουν) σφράγισαν το εισιτήριό του για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Μπορεί να μην είναι ο κορυφαίος παίκτης του κόσμου στον χειρισμό, αλλά αναπληρώνει αυτό το κενό με την πολυετή του πείρα. Αν η Ευρώπη θέλει να αποφύγει άλλη μια αποκαρδιωτική εμφάνιση, θα πρέπει να βασιστεί στην αυτοπεποίθηση (αλλά και στις οργανωτικές ικανότητες) αυτού του αξιόπιστου βετεράνου για να βρει τον τρόπο να επιβληθεί στους ισχυρότερους παίκτες του κόσμου.</p>","hu_HU":"Paul „SoaZ” Boyer valódi esport-veterán, akinek karrierje 2010-ben kezdődött. Mielőtt az Origenhez szerződött, a Fnatic megbízható felső ösvényese volt két évig, és kétszer is velük tartott a világbajnokságra. A 2014-es szezon után a Fnatic elkezdte újjáépíteni magát, és szinte az összes játékos szétszéledt. A Fnatic elhagyása után az Origen alapítója és középső ösvényese, Enrique „xPeke” Cedeño Martínez próbálta meggyőzni Soazt, hogy csatlakozzon ötödikként a Kihívók Sorozatát megcélzó csapatával. Soaz azonnal ugrott a lehetőségre, és fontos szerepe volt abban, hogy az Origen jól teljesített a Kihívók Sorozatában, az EU LCS szakaszaiban, valamint hogy kijussanak a világbajnokságra.</p>\n\nSoaz volt az egyetlen, aki víz fölött tartotta az Origent a nagyon rosszul alakuló 2016-os nyári szakasz alatt. A legreménytelenebb helyzetekben szinte egymaga harcolt ki győzelmeket az Origennek. Ezek a teljesítmények és a rajongók odaadó szeretete váltotta meg neki a jegyet Barcelonába, a 2016-os All-Star gálára. A nyers képességek helyett a hosszú évek tapasztalata teszi igazán erőssé. Ha Európa nem szeretne ismét halványan szerepelni, akkor a megbízható veteránra (és az elmaradhatatlan bagettjére) fog támaszkodni, amikor a Szurdok legkeményebb arcaival kell szembenézni.\n","it_IT":"Paul \"Soaz\" Boyer è un vero veterano degli eSport la cui carriera è iniziata nel lontano 2010. Prima di unirsi agli Origen è stato una presenza fissa in corsia superiore con i Fnatic per oltre due anni, durante i quali ha partecipato anche a due Mondiali. Al termine della stagione 2014, i Fnatic hanno subito un processo di ristrutturazione che ha separato quasi tutti i loro membri. Dopo la sua partenza dai Fnatic, il fondatore e centrale degli Origen, Enrique \"xPeke\" Cedeño Martínez, lo ha invitato nella sua squadra come ultimo elemento per prendere d'assalto le Challenger Series. Soaz colse l'occasione al volo e divenne un elemento insostituibile degli Origen nel circuito Challenger, in vari split e persino in un Mondiale.</p>\n\nNel 2016, Soaz è stato probabilmente l'unica nota positiva degli Origen in un Summer Split da dimenticare. Ha guidato da solo gli Origen in ogni vittoria e li ha tenuti a galla anche quando tutto sembrava perduto. Le sue giocate eccellenti (e i suoi devoti fan) gli hanno fatto guadagnare il biglietto per Barcellona e la partecipazione all'All-Star. Le sue lacune nella meccanica sono più che compensate dalla sua grande esperienza. Se l'Europa vuole evitare un'altra brutta sconfitta, farà meglio ad affidarsi a questo robusto veterano (e alla sua baguette) per uscire vincitrice contro gli avversari più temibili della Landa.\n","ro_RO":"Paul ''SoaZ'' Boyer este un adevărat veteran eSports, a cărui carieră începe în 2010. Înainte să semneze cu Origen, a fost un jucător de neclintit pe culoarul de sus al celor de la Fnatic mai bine de doi ani, susținându-i în două parcursuri la Campionatul Mondial. După încheierea sezonului 2014, Fnatic a intrat într-un proces de reconstrucție, în urma căruia aproape întreaga echipă a luat-o pe drumuri separate. După plecarea sa de la Fnatic, fondatorul și jucătorul de pe culoarul din mijloc al Origen, Enrique ''xPeke'' Cedeño Martínez, l-a invitat pe Soaz să se alăture echipei sale în noua ei aventură din Seria Challenger. Soaz a profitat de ocazie și a fost un jucător-cheie în parcursul celor de la Origen în competiția Challenger, în multiplele etape din LCS și chiar într-o apariție la Campionatul Mondial.</p>\n\nSoaz a fost, probabil, sigura parte bună a etapei de vară din 2016, pe care Origen își dorește s-o uite. Prin forțele proprii, i-a condus pe cei din Origen către victorii și i-a menținut în competiție chiar și atunci când toate speranțele lor păreau să se fi năruit. Reușitele sale (și fanii loiali) i-au adus un bilet către Barcelona pentru a participa la evenimentul All-Star 2016. Lipsurile mecanice îi sunt compensate de ani și ani de experiență. Dacă Europa își dorește să evite o altă eliminare dezamăgitoare, va avea nevoie de îndrumarea acestui veteran puternic (și a baghetei sale) împotriva celei mai dificile concurențe din Rift.\n","es_AR":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","es_MX":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>"},"foreignIds":{"drupalId":"76","TRLH3":"200000055","TRLH4":"200000158"},"socialNetworks":{"azubu":"azubu.tv/soaz","facebook":"https://www.facebook.com/fnaticSOAZ?fref=ts","twitter":"https://twitter.com/sOAZIZGOOD"},"champions":[],"liveGameTeam":15},{"id":98,"slug":"rekkles","name":"Rekkles","firstName":"Martin","lastName":"Larsson","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rekkles-gflgilh4.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:40.000Z","updatedAt":"2017-06-09T10:10:40.000Z","bios":{"en_US":"<p>Martin “Rekkles” Larsson is one of the most feared AD carries in the world. Rekkles debuted for Fnatic in late 2012 and immediately garnered attention with his performances at several major tournaments. He also played a key role in unlocking the door to the halls of the immortals for Fnatic, ushering in an unprecedented 18W-0L record in the 2015 EU LCS Summer Split. But after key departures following the 2015 World Championship, Rekkles and Fnatic failed to defend their EU LCS crown in the 2016 Spring Split, falling to the eventual champions G2 Esports en route to a 3rd place finish.Even though the reunion of Rekkles and Yellowstar didn’t produce the results that Fnatic hoped for, Rekkles still performed admirably throughout the 2016 EU LCS Summer Split, accounting for more than a third of his team’s overall damage.</p>\n\n<p>After an exodus of players near the end of 2016, Rekkles stayed on board with Fnatic and helped assemble a new roster filled with crafty veterans and an eager rookie. Rekkles admitted to not performing up to his own standards last year, and the 2017 season is the perfect place to reassert himself as a dominant AD Carry. He’s truly at the helm of the new-look Fnatic and will look to not only guide them, but carry them as well.</p>","fr_FR":"<p>Martin « Rekkles » Larsson compte parmi les carrys AD les plus redoutés du monde. Rekkles a commencé sa carrière chez Fnatic fin 2012 et s'est immédiatement fait remarquer avec d'excellentes performances dans plusieurs tournois majeurs. Il a également aidé Fnatic à entrer dans la légende avec un record inédit de 18 victoires contre 0 défaite lors du segment d'été des LCS EU 2015. Mais après des départs de joueurs déterminants suite au Championnat du monde 2015, Rekkles et Fnatic n'ont pas su défendre leur titre des LCS EU lors du segment de printemps 2016, s'inclinant contre les futurs champions de G2 Esports et finissant ainsi en 3e place.</p>\n\n<p>Même si la réunion entre Rekkles et Yellowstar n'a pas eu l'effet escompté par Fnatic, Rekkles a tout de même joué de façon admirable pendant tout le segment d'été des LCS EU 2016, enregistrant plus d'un tiers des dégâts totaux de l'équipe. Ces chiffres impressionnants ont suffi à lui offrir une place à l'événement All-Stars 2016 de Barcelone, où il affrontera d'autres carrys AD légendaires pour tenter d'arracher l'Europe des ténèbres et de la ramener dans la lumière de l'opinion internationale.</p>","pl_PL":"<p>Jeden z najmłodszych i z tego powodu najbardziej oczekiwanych graczy na scenie esportowej League of Legends. Martin Larsson zaczął grać profesjonalnie w maju 2012 roku, lecz już parę miesięcy później dołączył do jednej z najsławniejszych organizacji – Fnatic. Niestety, ze względu na swój wiek, nie mógł wziąć udziału w EU LCS 2013. Do czasu możliwości pełnoprawnego uczestnictwa w tych rozgrywkach \"Rekkles\" realizował się w innych zespołach. 22 listopada 2013 roku oficjalnie powrócił do szeregów Fnatic i przejął swoje stanowisko AD Carry. Już od swoich wczesnych początków był uważany za jednego z najzdolniejszych mechanicznie graczy.</p>\n<p>Wraz z drużyną Fnatic udało mu się zabłysnąć. Pomijając efektowne występy na pomniejszych turniejach jak IEM, All-Stars czy Dreamhack, to jego największym sukcesem był sezon piąty. Bezpośrednio po jego kolejnym powrocie do czarno-żółtych, razem z nimi pobił światowy rekord – nie przegrał ani jednej gry w letnim sezonie EU LCS 2015. Następnie, podczas kwalifikacji do Mistrzostw Świata 2015 \"Rekkles\" zachwycił widzów swoim pentakillem Tristaną. Po części dzięki jego solidnej grze przeciwko Origenowi, Martin wygrał te rozgrywki. Na MŚ 2015 najbardziej rzucało się w oczy to, że był w stanie konkurować z chińskimi i amerykańskimi oponentami. </p>\n<p>Do osobistych osiągnięć Martina przede wszystkim trzeba zaliczyć wejście do Kręgu Pretendenta w trzech różnych regionach: Europie, Ameryce Północnej i Korei. Udało mu się dotrzeć tak wysoko na pozycji AD Carry, dzięki swoim ulubionym postaciom: Lucianowi, Ezrealowi i Vayne. Wiele osób zastanawiało się, jak uzdolniony sportowiec trafił do świata Runeterry. \"Rekkles\" był utalentowanym piłkarzem, lecz doznał kontuzji nogi. Wtedy po raz pierwszy spróbował gry w League of Legends, w której bardzo szybko świetnie się odnalazł. Podczas zmagań na turniejach inspiracją dla niego był jego ulubiony cytat – „Pudłujesz 100% swoich strzałów, których nigdy nie dokonałeś”. W 2015 roku, w społeczeństwie było bardzo głośno o jego przywiązaniu do innego sławnego AD Carry - Hyuk-kyu’a \"Deft\" Kima. Ich unikatowa znajomość to przykład, że rywalizacja nie zawsze przekreśla przyjaźń.</p>\n","de_DE":"<p>Martin „Rekkles“ Larsson ist einer der gefürchtetsten AD-Carrys der Welt. Rekkles gab sein Debüt für Fnatic Ende 2012 und sorgte mit seinen Leistungen bei mehreren großen Turnieren sofort für Aufsehen. Außerdem spielte er bei Fnatics Einzug in die Halle der Unsterblichen eine entscheidende Rolle, als die Mannschaft den Sommer-Split der EU LCS 2015 mit 18 Siegen ungeschlagen beendete. Als jedoch einige Schlüsselspieler nach der Weltmeisterschaft 2015 die Mannschaft verließen, scheiterten Rekkles und Fnatic im Frühjahrs-Split 2016 am zukünftigen Champion G2 Esports und schafften es nicht, ihre Krone zu verteidigen. Obwohl die Wiedervereinigung von Rekkles und Yellowstar nicht so verlief, wie Fnatic gehofft hatte, lieferte Rekkles im Sommer-Split der EU LCS 2016 eine ansprechende Leistung ab und war für mehr als ein Drittel des gesamten Schadens seiner Mannschaft verantwortlich.</p>\n\n<p>Trotz der Abgänge einiger Spieler Ende 2016 blieb Rekkles Fnatic treu und half mit, aus gewitzten Veteranen und einem eifrigen Nachwuchsspieler eine neue Mannschaft zu formen. Rekkles hat zugegeben, letztes Jahr nicht zu seiner Form gefunden zu haben. Der Frühjahrs-Split der EU LCS 2017 ist für ihn die perfekte Gelegenheit, sich wieder als dominanter AD-Carry zu etablieren. Er ist die Speerspitze des neuen Fnatics und wird nicht nur versuchen, seine Mannschaft zu leiten, sondern auch, sie von einem Sieg zum nächsten zu führen.</p>","es_ES":"<p>Martin \"Rekkles\" Larsson es uno de los AD carry más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el split de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el split de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del split de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros AD carry legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","pt_BR":"<p>Martin “Rekkles” Larsson é um dos atiradores mais temidos do mundo. Rekkles estreou na Fnatic no fim de 2012 e logo ganhou atenção com seu desempenho em vários grandes torneios. Ele também teve um papel fundamental para imortalizar a Fnatic, ajudando no recorde de 18 vitórias e nenhuma derrota na Etapa de Verão 2015 da LCS EU. Porém, após alguns desfalques depois do Campeonato Mundial 2015, Rekkles e a Fnatic falharam em defender a coroa da LCS EU na Etapa de Primavera 2016, perdendo para a campeã G2 Esports e terminando em terceiro lugar.</p>\n\n<p>Apesar da reunião de Rekkles e YellOwStaR não produzir os resultados que a Fnatic esperava, Rekkles ainda teve um desempenho admirável durante toda a Etapa de Verão 2016 da LCS EU, sendo o responsável por mais de um terço do dano de sua equipe. Os números impressionantes foram suficientes para levá-lo a ser o Atirador mais votado da Europa no Evento All-Star 2016, onde ele batalhará contra outros atiradores lendários e vai tentar tirar a Europa do escuro para colocá-la de volta no cenário internacional.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Martin “Rekkles” Larsson는 세계에서 가장 두려운 원거리 딜러 중 하나입니다. Fnatic 소속으로 2012년 후반에 데뷔하자마자 IPL5에서 준우승하는 등 여러 주요 대회에서 엄청난 활약을 하며 주목을 받았습니다. 하지만 e스포츠에서 성공하려면 단순한 개인 기량뿐 아니라 인간 관계가 중요하다는 것 또한 잘 알고 있는 것이 Rekkles 선수입니다. 모델처럼 매력적인 외모와 무서운 파밍 능력을 함께 갖춘 Rekkles는 그런 면에서 완벽한 선수라고 할 수 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Fnatic이 유례없는 18승 무패로 2015 유럽 LCS 서머 스플릿을 마치는 대기록을 세우는 데에도 Rekkles의 역할이 핵심적이었습니다. 어떻게 그게 가능했을까요? 항상 노력하는 Rekkles 선수와, YellOwStaR 선수의 적절한 서포팅, 어느 한쪽으로 치우치지 않는 킬과 어시스트, 그리고 나서 엄청난 CS 수급력이 합쳐졌기 때문이죠. 실제로 2015 유럽 LCS 서머 스플릿에서 KDA 순위 1, 2위를 Fnatic의 봇 라인 선수 두 명이 합계 27을 기록하며 독점해 버렸습니다. </p>\n<p style=”font-family:”나눔고딕”;\">물론 그렇게 킬을 올렸어도 Isaac \"PePiiNeRo\" Flores 선수의 분노를 피해갈 순 없었죠. 유감입니다. </p>\n","cs_CZ":"<p>Martin „Rekkles“ Larsson je jedním z nejobávanějších ADC na světě. Debutoval koncem roku 2012 v řadách Fnaticu a okamžitě vzbudil pozornost svými výkony na několika významných turnajích. Sehrál také klíčovou roli při uvedení Fnaticu do historie, když jeho tým během letního splitu evropského LCS 2015 dosáhl do té doby nevídané bilance výher 18:0. Ovšem poté, co po mistrovství světa 2015 z celku odešlo několik důležitých členů, Rekkles a Fnatic v jarním splitu EU LCS 2016 už titul neobhájili, podlehli budoucím šampionům z G2 Esports a skončili na 3. místě.</p>\n\n<p>Ačkoliv opětovné shledání Rekklese a Yellowstara nemělo takové výsledky, v jaké Fnatic doufali, podával Rekkles po celou dobu letního splitu EU LCS 2016 působivé výkony a připsal si na konto více než třetinu celkového poškození, jež jeho tým uštědřil. Tato ohromující čísla stačila, aby vyhrál hlasování k turnaji All-Star 2016 v Barceloně, kde se střetne s ostatními legendárními ADC a pokusí se vyvést Evropu z temnoty zpět na světlo mezinárodní slávy.</p>","el_GR":"<p>Ο Martin “Rekkles” Larsson είναι ένας από τους πιο επικίνδυνους AD Carry στον κόσμο. Ο Rekkles έκανε την πρώτη του εμφάνιση με τους Fnatic στα τέλη του 2012 και έστρεψε αμέσως επάνω του τα φώτα της δημοσιότητας με τις εκπληκτικές του εμφανίσεις σε πολλά σημαντικά τουρνουά. Επίσης, έπαιξε σημαντικό ρόλο σε ορισμένα από τα μεγαλύτερα ρεκόρ που έχουν πετύχει οι Fnatic, όπως το ανεπανάληπτο σερί 18 νικών και 0 ηττών Summer Split 2015 του LCS Ευρώπης. Όμως, μετά το Παγκόσμιο Πρωτάθλημα 2015 υπήρξαν ορισμένες πολύ σημαντικές αποχωρήσεις από την ομάδα, με αποτέλεσμα ο Rekkles και οι Fnatic να μην μπορέσουν να υπερασπιστούν τον τίτλο τους στο Spring Split 2016 του LCS Ευρώπης. Γνώρισαν την ήττα από τους G2 Esports, οι οποίοι θα έπαιρναν στη συνέχεια τον τίτλο, και περιορίστηκαν στην 3η θέση.</p>\n\n<p>Παρόλο που η επανένωση του Rekkles και του Yellowstar δεν είχε τα αποτελέσματα που έλπιζαν οι Fnatic, ο Rekkles είχε μια πολύ καλή παρουσία στο Summer Split 2016 του LCS Ευρώπης, καθώς έκανε μόνος του τουλάχιστον το ένα τρίτο της συνολικής ζημιάς της ομάδας. Χάρη στα εντυπωσιακά του στατιστικά, συγκέντρωσε αρκετές ψήφους για να βρεθεί κι αυτός στο Τουρνουά All-Star 2016 στη Βαρκελώνη, όπου θα αναμετρηθεί με άλλους θρυλικούς AD Carry στην προσπάθειά του να φέρει και πάλι την Ευρώπη στο διεθνές προσκήνιο.</p>","hu_HU":"<p>Martin „Rekkles” Larsson a világ egyik legrettegettebb lövésze. Rekkles a Fnaticben kezdte a karrierjét 2012 végén, és hamar felhívta magára a figyelmet a nagy versenyeken nyújtott teljesítményével. Fontos szerepe volt abban is, hogy a Fnatic bekerüljön a halhatatlanok csarnokába, akikkel addig példátlan 18 meccses, veretlen győzelmi sorozatot értek el az EU LCS 2015-ös nyári szakaszában. A csapat fontos embereket veszített el a 2015-ös világbajnokság után, ezért Rekkles és a Fnatic nem tudta megvédeni címét az EU LCS 2016-os tavaszi szakaszában, és végül 3. helyen végzett, valamint kikapott a szakaszt megnyerő G2 Esportstól.</p>\n\nRekkles és Yellowstar jelenléte nem hozta az eredményeket, amelyeket a Fnatic várt, de Rekkles remekül játszott az EU LCS 2016-os nyári szakasza során, a csapat összesített sebzésének több mint harmadát ő okozta. Már csak emiatt is ott a helye a 2016-os All-Star gálán Barcelonában, ahol legendás lövészekkel kell megküzdenie, hogy kiássa Európát a gödörből.\n","it_IT":"<p>Martin \"Rekkles\" Larsson è uno degli ADC più temuti al mondo. Ha debuttato nel tardo 2012 con i Fnatic e ha subito attirato l'attenzione con le sue eccellenti giocate in molti tornei internazionali. È stato anche fondamentale per far entrare i Fnatic nell'olimpo degli immortali con un record mai visto di 18 vittorie e nessuna sconfitta nel Summer Split 2015 della LCS EU. Tuttavia, dopo i grandi abbandoni a seguito dei Mondiali 2015, Rekkles e i Fnatic non sono riusciti a difendere la corona nello Spring Split 2016, inchinandosi davanti ai nuovi campioni, i G2 Esports, e concludendo la stagione al terzo posto.</p>\n\nNonostante la reunion di Rekkles e Yellowstar non abbia prodotto i risultati che i Fnatic speravano, Rekkles si è comunque comportato egregiamente durante il Summer Split 2016 della LCS EU, infliggendo più di un terzo dei danni totali della sua squadra. Queste cifre impressionanti sono state sufficienti a fargli guadagnare i voti necessari a partecipare all'All-Star 2016 di Barcellona, dove si scontrerà con altri ADC leggendari cercando di traghettare l'Europa fuori dalla sua striscia negativa e donarle un nuovo successo internazionale.\n","ro_RO":"<p>Martin ''Rekkles'' Larsson este unul dintre cei mai de temut AD carry din lume. Rekkles a debutat alături de Fnatic la finalul anului 2012 și a atras imediat atenția publicului cu reușitele sale în cadrul câtorva turnee importante. În plus, a jucat un rol important în echipă, ajutându-i pe cei de la Fnatic să intre în istoria LoL și obținând un record fără precedent de 18 victorii și 0 înfrângeri în etapa de vară a LCS EU 2015. Dar în urma plecării unor jucători cheie imediat după Campionatul Mondial 2015, Rekkles și Fnatic nu au reușit să-și apere titlul din LCS EU în etapa de primăvară din 2016, terminând pe locul al treilea ca urmare a unei înfrângeri în fața viitorilor campioni, G2 Esports.</p>\n\nChiar dacă reuniunea lui Rekkles cu Yellowstar nu a adus rezultatele pe care și le-au dorit cei de la Fnatic, Rekkles s-a descurcat admirabil pe parcursul etapei de vară a LCS EU 2016, însumând mai bine de o treime din daunele totale ale echipei sale. Statisticile impresionante i-au adus voturile fanilor și calificarea la evenimentul All-Star 2016 din Barcelona, unde se va înfrunta cu alți AD Carry legendari. Acolo va lupta pentru a pune capăt seriei de nereușite ale Europei la turneele internaționale.\n","en_PL":"<p>Martin „Rekkles” Larsson jest jednym z budzących największy lęk prowadzących na świecie. Rekkles zadebiutował we Fnatic pod koniec 2012 roku i natychmiast zwrócił na siebie uwagę występami na kilku większych turniejach. Odegrał także kluczową rolę w zdobyciu miejsca pośród nieśmiertelnych sław dla Fnatic, osiągając bezprecedensowy wynik 18 zwycięstw przy 0 przegranych podczas letniego splitu EU LCS 2015. Ale gdy po Mistrzostwach Świata 2015 odeszło kilku ważnych zawodników, Rekkles i Fnatic nie zdołali obronić tytułu EU LCS podczas wiosennego splitu 2016, ulegając późniejszym mistrzom, G2 Esports i kończąc na trzecim miejscu.</p>\n\nChociaż ponowne zejście się Rekklesa i Yellowstara nie zapewniło rezultatów, których oczekiwali Fnatic, Rekkles wciąż znakomicie prezentował się w toku letniego splitu EU LCS 2016, zaliczając na swoje konto ponad jedną trzecią ogółu obrażeń zadanych przez drużynę. Te imponujące statystyki wystarczyły, by został wybrany w głosowaniu do uczestnictwa w wydarzeniu All-Star 2016 w Barcelonie, dokąd pojedzie zmierzyć się z innymi legendarnymi prowadzącymi i będzie toczył pojedynki, których stawką jest wyciągnięcie Europy z mroku zapomnienia w światło międzynarodowego uznania.\n","es_AR":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","es_MX":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>"},"foreignIds":{"drupalId":"1140","TRLH3":"200000058","TRLH4":"200000161"},"socialNetworks":{"twitch":"www.twitch.tv/Rekkles","facebook":"www.facebook.com/Rekkles1?fref=ts","twitter":"https://twitter.com/RekklesLoL"},"champions":[],"liveGameTeam":15},{"id":172,"slug":"jesiz","name":"Jesiz","firstName":"Jesse","lastName":"Le","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jesiz-dsbaxff3.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-06-09T10:12:41.000Z","bios":{"en_US":"<p>Jessie “Jesiz” Le has been on the professional scene since 2013, playing for teams like Coast, Gamers2, and Dignitas. He took a break from professional play in order to become the assistant coach for Immortals in 2016. He ended up trying out for Fnatic at the end of the year and they invited him to become their starting support.</p>\n\n<p>Jesiz is a flexible player that is now playing the third different role of his professional career. After playing as both a mid laner and AD Carry, he made yet another role swap in order to fill Fnatic’s support vacancy. More than anything Fnatic is searching for some continuity at the support position after recent times have been filled with ups and downs. Jesiz certainly brings a wealth of experience with him, but will it turn into wins? Only time will tell.</p>","de_DE":"<p>Jessie „Jesiz“ Le ist bereits seit 2013 fixer Bestandteil der professionellen E-Sport-Szene und hat schon für Mannschaften wie Coast, Gamers2 oder Dignitas gespielt. 2016 nahm er sich jedoch eine Auszeit, um der Co-Trainer der Immortals zu werden. Am Ende des Jahres bewarb er sich dann bei Fnatic und wurde zum Supporter der Mannschaft.\n\nJesiz ist ein flexibler Spieler, der im Verlauf seiner Karriere bereits auf zwei anderen Positionen gespielt hat. Nachdem er bereits als Mid-Laner und AD-Carry gespielt hatte, wechselte er erneut die Rolle, um Fnatics Suche nach einem Supporter zu beenden. Nach den Höhen und Tiefen der letzten beiden Splits braucht Fnatic nichts dringender, als eine gewisse Kontinuität auf der Supporter-Position. Jesiz kann auf einiges an Erfahrung zurückgreifen, aber wird sich das auch in Siegen widerspiegeln? Wir werden es sehen …</p>"},"foreignIds":{"drupalId":"1126","TRLH3":"200000059","TRLH4":"200000162"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":344,"slug":"xyraz","name":"Xyraz","firstName":"Gustav","lastName":"Blomkvist","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xyraz-24ixeasw.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-05-31T21:08:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3684","TRLH3":"200000300","TRLH4":"200000400"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1264,"slug":"special","name":"Special","firstName":"Joran","lastName":"Scheffer","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/special-69mtzco4.png","hometown":"EU","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:15:34.000Z","updatedAt":"2016-07-30T04:57:42.000Z","bios":{},"foreignIds":{"TRLH3":"1001310008","TRLH4":"1001270008","TRLH2":"1001250047","FRA1TMNT2":"25217"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28}],"scheduleItems":[{"id":"AVIUibCmOPWArxM1l4Yl","content":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:match:3547016f-eedc-4392-9271-99633d16ea09","scheduledTime":"2016-02-05T21:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989","blockLabel":"4","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:bracket:47deb68d-7d32-49b5-9f6a-490ccf9dfee6"},"match":"3547016f-eedc-4392-9271-99633d16ea09","tournament":"33651c33-83f7-48f1-8e2f-9f5a5f641989","bracket":"47deb68d-7d32-49b5-9f6a-490ccf9dfee6","league":"3"}],"gameIdMappings":[{"id":"372203ab-7bca-4d38-94e1-be3e107db23c","gameHash":"2b301bbba3166c91"}],"videos":[{"id":790,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:game:372203ab-7bca-4d38-94e1-be3e107db23c","source":"https://www.youtube.com/embed/BXAzJSJ3FwA?wmode=transparent","createdAt":"2016-02-06T00:07:17.000Z","updatedAt":"2016-02-06T00:07:17.000Z","game":"372203ab-7bca-4d38-94e1-be3e107db23c"},{"id":844,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:game:372203ab-7bca-4d38-94e1-be3e107db23c","source":"https://www.youtube.com/embed/YeqIYp_c-Z0","createdAt":"2016-02-12T15:15:42.000Z","updatedAt":"2016-02-12T15:15:42.000Z","game":"372203ab-7bca-4d38-94e1-be3e107db23c"},{"id":845,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:game:372203ab-7bca-4d38-94e1-be3e107db23c","source":"https://www.youtube.com/embed/4KHpUYO3k14","createdAt":"2016-02-12T15:17:14.000Z","updatedAt":"2016-02-12T15:17:14.000Z","game":"372203ab-7bca-4d38-94e1-be3e107db23c"}],"htmlBlocks":[],"match":{"id":"3547016f-eedc-4392-9271-99633d16ea09","name":"ROC-vs-FNC","position":19,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5563b46b-7eed-46c9-86ab-2b9b29f5f730"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"games":{"372203ab-7bca-4d38-94e1-be3e107db23c":{"id":"372203ab-7bca-4d38-94e1-be3e107db23c","name":"G1","generatedName":"FNC|ROC|G1|3547016feedc4392927","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5563b46b-7eed-46c9-86ab-2b9b29f5f730"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"standings":{"result":[[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],[{"roster":"5563b46b-7eed-46c9-86ab-2b9b29f5f730"}]],"timestamp":1454710306102,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001520106","gameRealm":"TRLH3","platformId":"TRLH3:1001520106","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],[{"roster":"5563b46b-7eed-46c9-86ab-2b9b29f5f730"}]],"timestamp":1454710306102,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}