{"teams":[{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]},{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]}],"players":[{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163}],"scheduleItems":[{"id":"AVZIDD8aoUG4HPFjOKB1","content":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:match:377aec35-48ef-4b5f-a055-dea6a971974a","scheduledTime":"2016-08-21T15:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb","blockLabel":"Semifinals","subBlockLabel":"2","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:bracket:bbd79dc3-a130-43c7-97ae-e0915b818672"},"match":"377aec35-48ef-4b5f-a055-dea6a971974a","tournament":"f7afa181-4580-48c0-af26-4b3d70fe21eb","bracket":"bbd79dc3-a130-43c7-97ae-e0915b818672","league":"3"}],"gameIdMappings":[{"id":"6745050a-9ad0-42ba-b9ff-5aa7e520cdb4","gameHash":"02acb71d99b67bd7"},{"id":"a68c9ab5-6718-401f-b8ab-587131b1f597","gameHash":"519959de8599138d"},{"id":"6c48cf10-e497-4888-bc22-dac70037524e","gameHash":"f37086ea7ea18c9b"},{"id":"b6d5a949-3963-403b-af8c-6c7f4896515f","gameHash":"2e037d17d6c71bd3"}],"videos":[{"id":4254,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:6c48cf10-e497-4888-bc22-dac70037524e","source":"https://www.youtube.com/embed/ypgDR0IpTKk?wmode=transparent","createdAt":"2016-08-22T04:07:20.000Z","updatedAt":"2016-08-22T04:07:20.000Z","game":"6c48cf10-e497-4888-bc22-dac70037524e"},{"id":4255,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:b6d5a949-3963-403b-af8c-6c7f4896515f","source":"https://www.youtube.com/embed/Hla0MqRtw78?wmode=transparent","createdAt":"2016-08-22T04:06:20.000Z","updatedAt":"2016-08-22T04:06:20.000Z","game":"b6d5a949-3963-403b-af8c-6c7f4896515f"},{"id":4256,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:a68c9ab5-6718-401f-b8ab-587131b1f597","source":"https://www.youtube.com/embed/teMFHJEs0KA?wmode=transparent","createdAt":"2016-08-22T04:07:59.000Z","updatedAt":"2016-08-22T04:07:59.000Z","game":"a68c9ab5-6718-401f-b8ab-587131b1f597"},{"id":4257,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:6745050a-9ad0-42ba-b9ff-5aa7e520cdb4","source":"https://www.youtube.com/embed/t02ksXfFSlc?wmode=transparent","createdAt":"2016-08-22T04:11:37.000Z","updatedAt":"2016-08-22T04:11:37.000Z","game":"6745050a-9ad0-42ba-b9ff-5aa7e520cdb4"}],"htmlBlocks":[],"match":{"id":"377aec35-48ef-4b5f-a055-dea6a971974a","name":"semi-final-1","position":0,"state":"resolved","groupPosition":1,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0},{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],"games":{"6745050a-9ad0-42ba-b9ff-5aa7e520cdb4":{"id":"6745050a-9ad0-42ba-b9ff-5aa7e520cdb4","name":"G4","generatedName":"G2|UOL|G4|377aec3548ef4b5fa055","input":[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0},{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],"standings":{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471839078293,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471839058097,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471804864445,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001770088","gameRealm":"TRLH3","platformId":"TRLH3:1001770088","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"a68c9ab5-6718-401f-b8ab-587131b1f597":{"id":"a68c9ab5-6718-401f-b8ab-587131b1f597","name":"G3","generatedName":"G2|UOL|G3|377aec3548ef4b5fa055","input":[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0},{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],"standings":{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471838849631,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471802494657,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001780119","gameRealm":"TRLH3","platformId":"TRLH3:1001780119","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6c48cf10-e497-4888-bc22-dac70037524e":{"id":"6c48cf10-e497-4888-bc22-dac70037524e","name":"G1","generatedName":"G2|UOL|G1|377aec3548ef4b5fa055","input":[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0},{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],"standings":{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471838805365,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}]],"timestamp":1471795671279,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001780104","gameRealm":"TRLH3","platformId":"TRLH3:1001780104","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b6d5a949-3963-403b-af8c-6c7f4896515f":{"id":"b6d5a949-3963-403b-af8c-6c7f4896515f","name":"G2","generatedName":"G2|UOL|G2|377aec3548ef4b5fa055","input":[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0},{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}],"standings":{"result":[[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}]],"timestamp":1471838821957,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0}]],"timestamp":1471799387827,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001770086","gameRealm":"TRLH3","platformId":"TRLH3:1001770086","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"e6c31723-528b-4ba1-a5ac-afa526fadb6c":{"id":"e6c31723-528b-4ba1-a5ac-afa526fadb6c","name":"G5","generatedName":"G2|UOL|G5|377aec3548ef4b5fa055","input":[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302","breakpoint":"9e743864-2595-4751-be41-67f2039ade9e","standing":0},{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a","breakpoint":"8078edf6-1537-46c0-8082-31f0f1994a06","standing":0}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471839078294,"source":"bestOf","history":[{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471839058097,"source":"bestOf","closed":true},{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471838849631,"source":"bestOf","closed":true},{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471838821957,"source":"bestOf","closed":true},{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471838805365,"source":"bestOf","closed":true},{"result":[[{"roster":"4228c732-63d6-4bfd-bb3c-3e136284f302"}],[{"roster":"01fe3040-960d-4b29-ac5e-b435e6df5e1a"}]],"timestamp":1471804864446,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}