{"teams":[{"id":118,"slug":"cloud9-tempest","name":"Cloud9 Challenger","guid":"be6efb43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/cloud9-tempest-8ft3guds.png","acronym":"C9C","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-08-03T19:22:39.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1134"},"players":[112,114,116,256,266,1120],"starters":[112,114,116,266,1120],"subs":[256]},{"id":221,"slug":"apex-pride","name":"Apex Pride","guid":"be7142e6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/apex-pride-5t4zz3qg.png","acronym":"APP","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-06-02T23:57:05.000Z","updatedAt":"2016-07-01T21:18:17.000Z","bios":{},"foreignIds":{},"players":[78,144,148,275,395,746,1100],"starters":[78,148,275,395,746],"subs":[144,1100]}],"players":[{"id":78,"slug":"diamondprox","name":"Diamondprox","firstName":"Danil","lastName":"Reshetnikov","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/diamondprox-gx80qbxc.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-06-15T22:40:21.000Z","bios":{"en_US":"<p>Danil “Diamondprox” Reshetnikov was one of the most innovative junglers in the world during Season 2. Diamondprox’s overwhelming map control kickstarted an aggressive counter-jungling strategy that continues to influence the League of Legends meta even now. </p>\n\n<p>Despite struggling to make an impact in the 2014 and 2015 EU LCS, Diamondprox was still regarded as one of the best junglers in Europe. The Unicorns of Love took Diamondprox in during the 2015 offseason, betting that his prior experience would be a boon for their revamped squad. Now, Apex Pride are hoping he can help them earn a spot in the NA LCS.</p>","fr_FR":"<p>Comme dans tout sport, il y a dans League of Legends des joueurs qui ont marqué leur époque, et le Russe Danil « Diamondprox » Reshetnikov est de ceux-là. Il se fait repérer alors qu’il n’est que platine, rejoint l’équipe Empire (qui deviendra Moscow Five) et domine très vite la scène européenne, allant jusqu’à impressionner à l’international. Diamondprox se démarque par sa capacité d’adaptation et son inventivité. Nombre d’observateurs estiment que c’est lui qui a inventé la tactique du counter-jungle, pratique à laquelle il s’adonne particulièrement bien avec Shyvana. Moscow Five est alors connue pour ses excellents résultats lors des compétitions majeurs et principalement lors des différentes éditions des Intel Extreme Masters.</p>\n\n<p>M5 et Diamondprox confirment leur supériorité sur la scène européenne en remportant les finales régionales, ce qui les qualifie d’office pour le mondial 2012. Considérés comme favoris, les M5 surprennent en s’inclinant en demi-finale face aux futurs champions du monde, les Taipei Assassins. Après quelques autres contre-performances, Diamondprox et ses coéquipiers (qui jouent désormais pour Gambit Gaming) réussissent à vaincre les équipes coréennes Azubu Frost et Azubu Blaze aux IEM Katowice 2013, avec un Diamondprox sur Xin Zhao pendant la majorité du temps.</p>\n\n<p>Dès la première occurrence, les M5 prennent part aux League of Legends Championship Series. Diamondprox participe énormément au succès de l’équipe et dicte la méta. Il est le pionnier du Nasus jungle, se démarque par son utilisation de Volibear, marque les esprits avec ses variantes d’Evelynn et va même jusqu’à invoquer Karma. Son équipe n’est plus maîtresse de la région mais obtient la 2e place de la saison de printemps et la 3e de la saison d’été, guidée par son agressivité réfléchie.</p>\n\n<p>Avec le temps, les départs successifs de ses coéquipiers et les problèmes logistiques inhérents à la structure pour laquelle il joue, les résultats de Diamondprox se sont dégradés. Celui qui a été plébiscité par la communauté lors des deux premières éditions des All-Stars n’arrive plus à mener son équipe vers la victoire, bien qu’il reste l’un des meilleurs junglers européens. Après être passé à deux doigts de la relégation en 2015 et alors que Gambit a vendu sa place en LCS, Diamondprox cherche à donner un second souffle à sa carrière en rejoignant Unicorns of Love et compte bien prouver qu’une légende ne meurt jamais.</p>\n","pl_PL":"<p>Gwiazda League of Legends od wczesnego drugiego sezonu. Złośliwi wytykają, że czerwona, bo pochodzi z Rosji. Nie zmienia to faktu, że to jeden z graczy, którzy wywarli największy wpływ na zmianę mety w grze. Danil Reshetnikov zaistniał w drużynie Team Empire, która zaskoczyła inne popularne zespoły absolutnie nietypowymi zagraniami. Później ten sam skład zawodników był znany jako Moscow Five, a następnie Gambit Gaming. Cała rosyjska ekipa była znana z innowacyjnych wyborów i zagrań, jednak król nowości wśród nich to właśnie \"Diamondprox\". Można śmiało powiedzieć, że zrewolucjonizował grę w jungli wielokrotnie podczas istnienia sceny esportowej. Brakiem obaw przed porażką i ośmieszeniem otworzył drzwi dla wielu nowych postaci na tej pozycji, zainicjował między innymi wybór Karmy, Mundo i Nasusa. Oprócz zaskakującej selekcji bohaterów, zdumiewał również swoim stylem gry – na przykład sztuką kontrowania przeciwników w ich własnej jungli. Jednak wielbiciele i społeczeństwo najlepiej znają Danila z niezwykłych zagrań Lee Sinem i Evelynn.</p>\n<p>\n\"Diamondprox\" od wczesnego drugiego sezonu uczestniczył w życiu esportowym League of Legends. Można by długo wymieniać turnieje, które wygrał i te, w których znalazł się na podium, lecz najważniejszymi dokonaniami były jego występy na Mistrzostwach Świata i turniejach IEM. W wydarzeniu o najwyższej randze na scenie League of Legends wziął udział dwukrotnie – w drugim i trzecim sezonie. Za pierwszym razem zespół Moscow Five było jednym z faworytów – uległ w półfinale w walce z Taipei Assasins. Miarę tego osiągnięcia, można mierzyć w powszechnej opinii po tej imprezie, że z zachodnich drużyn tylko ta rosyjska może się mierzyć z Azjatami. Na Mistrzostwach Świata 2013 poszło jej gorzej, ponieważ Danil wraz z kolegami dotarli tylko to ćwierćfinałów. Co i tak było niesamowitym osiągnięciem jak na europejską ekipę. Zdecydowanie lepszy owoc zebrali na wydarzeniach IEM - \"Diamondprox\" dwukrotnie był półfinalistą i raz zwycięzcą podczas Mistrzostw Świata IEM. Ponadto czterokrotnie wygrali etapy kwalifikacyjne, podczas których dominowali tak doświadczonych przeciwników jak: Team SoloMid, Fnatic i Counter Logic Gaming. Przed wiosennym sezonem EU LCS 2016 pożegnał się z pozostałościami po legendarnej rosyjskiej drużynie i w poszukiwaniu swojego miejsca dołączył do Unicorns of Love.\nDanil to jeden z bardzo małego grona graczy, które znalazło swoją drugą połówkę i się ożeniło. Podobnie jak jego kolega z drużyny, „Alex Ich”, trafił na swoją sympatię, kiedy profesjonalnie grał w League of Legends. \"Diamondprox\" spotkał „Rogue” w solo que po przeciwnej stronie barykady i w tym starciu Darina została upokorzona przez jego grę Skarnerem. W związku z czym padło parę ostrych słów między nimi. Dlatego „Rogue” zauważyła, że w kolejnej grze jej rywalem znowu jest Danil. Tym razem pogratulował swojej konkurentce dobrej gry, a po meczu zaczęli ze sobą rozmawiać. Od słów do czynów, wkrótce potem zaczęli się ze sobą spotykać – jak widać miłość potrafi znaleźć ujście w najbardziej nieoczekiwanych momentach i miejscach. \n</p>","es_ES":"<p>La eterna leyenda rusa toma un nuevo rumbo. Por primera vez en su carrera profesional desde Octubre de 2011, Danil ‘Diamondprox’ Reshetnikov opta por cambiar de aires. El jugador proveniente de World of Warcraft que enamoró a todo el mundo en Team Empire, Moscow Five y Gambit Gaming decide por primera vez dejar la infraestructura que tantos éxitos le ha otorgado en el pasado para intentar solucionar un final de carrera con un declive pasivo.</p>\n\n<p>Diamondprox empezó en 2011 a jugar para Team Empire gracias a la invitación de su amigo y apoyo del equipo Edward ‘Gosu Pepper’ Abgaryan. Tan sólo dos meses durarían ambos bajo el nombre de Team Empire, puesto que en Diciembre de ese mismo año la plantilla sería fichada por Moscow Five y un mes más tarde ya estarían dando la sorpresa en la IEM Season VI – Global Challenge Kiev que ganarían ante los grandes equipos de Europa y Norteamérica. Con campeones como Shyvana y Lee Sin el joven ruso sacaba a la palestra un estilo agresivo de invasión hacia la jungla enemiga que chocó mucho a los jungla de apoyo de aquella época. Grandes jugadores de la historia de League of Legends han elogiado al jungla por su innovación y agresividad.</p>\n\n<p>En Marzo de 2012, Diamondprox volvería a la senda de la innovación adaptada a su estilo de juego en la IEM Season VI – World Championship disputada en Hannover. La aparición estelar de Nocturne con presencia global en el mapa permitió sorprender a sus rivales. Aunque la mayor alegría llegaría a los amantes de Udyr a causa de la aparición en el último partido de la final ante Dignitas como respuesta a la propia Shyvana que él mismo había popularizado.</p>\n\n<p>En ese mismo año llegaron los mejores momentos de Diamond como en la Dreamhack Summer 2012 o las finales regionales de la segunda temporada en Colonia. Aquel Moscow Five que estuvo a punto de llegar a la final del Campeonato Mundial 2012 en el que sólo perdió ante el vencedor Taipei Assasins. Este momento supuso la cúspide en la carrera del jugador que a partir de entonces no ha conseguido éxitos del mismo calibre. Todavía se recuerda esa arrasadora primera partida que disputó con Xin Zhao.</p>\n\n<p>Después del último gran torneo jugado como Moscow Five en la IPL5 debido al arresto del CEO del equipo, Diamondprox sólo consiguió mantener su estatus debido a grandes actuaciones las Intel Extreme Masters como la victoria en 2013 en Katowice ante Azubu Frost. El formato de liga regular de la League Championship Series no favoreció al jugador debido al distanciamiento de la organización de la sede en Colonia con problemas de visado, y poco a poco su nivel fue bajando hasta la actualidad. En el año 2013 fue votado para representar a Europa en el All Stars y en el Campeonato Mundial de 2013 se clasificaría para cuartos de final.</p>\n\n<p>Tanto 2014 como 2015 fueron años aciagos para el jungla. El primer año todavía mantuvo su caché a pesar de los malos resultados del equipo con buenas actuaciones mediante el uso de junglas agresivos, pero ya no volverían a clasificarse a un Campeonato Mundial y en los últimos tiempos el jugador sólo conserva detalles de calidad.</p>\n\n<p>En Unicorns of Love podría renacer. Su carácter innovador encaja perfectamente con el equipo, y supone un reto motivacional nuevo para el ruso. A pesar de ser introvertido, su privilegiada mente podría otorgar una mejora en la toma de decisiones, faceta de la que siempre ha carecido el equipo.</p>","de_DE":"<p>Wenn man eSports-Fans nach dem einen Jungler fragt, wird sicherlich aus vieler Munde der Name „Diamond“ ertönen. Nicht viele Europäer haben sich einen solchen, vor allem auch international anerkannten Ruf erspielen können. Er ist anpassungsfähig, erfahren, Shotcaller und einer der größten Innovatoren seiner Position. Während er mit Lee Sin noch einen recht vertrauten Pick schon sehr früh an den Tag gebracht hat, wurde es schnell außergewöhnlicher. So hat er vor allem in der dritten Saison viele Trends im Jungle geschaffen. Evelynn, Nasus und nicht zu vergessen seine Karma waren noch nicht einmal alle Champions, die er allein in dieser Zeit erfolgreich in die Kluft brachte. </p>\n<h2><p>Der große Aufstieg</p></h2>\n<p>Bekannt wurde Danil \"Diamondprox\" Reshetnikov, nachdem sein damaliger Kader von Team Empire Ende 2011 von Moscow Five aufgekauft wurde. Während die Russen anfangs noch nicht sonderlich bekannt waren, änderte sich dies schon zwei Monate später schlagartig. Bei der IEM Season VI in Kiew setzte sich das Team gegen eine Armee von großen Namen durch, unter ihnen auch Zweitplatzierter der vorigen Weltmeisterschaft against All authority und TSM, den schon damaligen Favoriten der Amerikaner. Mit nur einem verlorenen Spiel während des gesamten Turniers war sehr schnell klar, dass es diese Spieler drauf haben. </p>\n<p>Die gesamte zweite Saison sollte sich ein Trend fortsetzen, der aus einem emporkommenden Team mit guten Spielern schon fast so etwas wie Legenden machte. Zusammen mit seinem Teamkollegen Alexey \"Alex Ich\" Ichetovkin hat er die gegnerischen Lanes in ein regelrechtes Chaos versetzt, um sichere Siege einzuholen. Das hat M5 nicht nur weitere Turniersiege eingebracht, sondern letztendlich zu einem Top 4 Erfolg auf der zweiten Weltmeisterschaft geführt. </p>\n<h2><p>Sein Weg mit Gambit</p></h2>\n<p>Nachdem der CEO von Moscow Five Anfang 2013 verhaftet wurde, stand das erfolgreiche Team zum Verkauf bereit. Der glückliche Käufer: Gambit Gaming. Unter neuem Namen ging es gleich da weiter, wo man zuvor aufhörte: Wer sich an die IEM Season VII in Katowice erinnert, hat sicherlich noch Gambits dortige Erfolgsgeschichte vor Augen. Nach einem knappen Sprung aus der Gruppenphase gelang es dem Team nicht nur eins, sondern gleich zwei Aufeinandertreffen gegen die damals stärksten koreanischen Teams ohne Niederlage zu gewinnen. Spätestens ab diesem Zeitpunkt wurde Diamondprox auch von vielen Koreanern als einer der besten Jungler anerkannt. Er wurde Vorbild für viele später auch erfolgreiche professionelle Jungler. </p>\n<p>Die LCS veränderte dann so einiges, während die Konkurrenz anfangs noch vergleichsweise schwach war, wurde diese über die Jahre immer stärker. Das einst so undenkbar trennbare Team verlor nach und nach seine Spieler, bis zum Schluss nur noch Diamondprox und Edward „Edward“ Abgaryan übrig blieben. Das Ende vom ursprünglichen Gambit war gekommen. </p>\n<p> „Es waren vier teuflische Jahre, Jungs“, Worte, die sich Diamond am Anfang seiner Karriere in League of Legends wohl kaum zu träumen gewagt hätte. Und doch – nach vier Jahren Achterbahnfahrt der Gefühle, kann er stolz von seinen Jahren mit den vier russischen Kumpanen reden. Ein Kapitel seines Lebens, das mit dem Austritt aus Gambit Gaming nun geschlossen wurde. </p>\n<h2><p>Das diamantene Einhorn</p></h2>\n<p>Wenn sich ein Kapitel schließt, öffnet sich ein anderes. Das richtige Team ist jedenfalls gefunden. Die Unicorns Of Love sind dafür bekannt, ungewöhnliche Champions auszupacken, da passt der neue Jungler perfekt hinein, um die Gegner noch weiter in die Irre zu führen. Er selbst erhofft sich nicht nur als Person, sondern sich auch als Anführer weiter zu verbessern, wie er in einem Interview bekannt gab. In jedem Fall wird er sein Bestes geben, um nicht nur sein Team, sondern auch den vielen treuen Fans zu zeigen, was ein Diamondprox alles so drauf hat. </p>\n"},"foreignIds":{"drupalId":"88","TRLH3":"1001220067","TRLH4":"1001190117","TRLH1":"1001300002","FRA1TMNT1":"445028"},"socialNetworks":{"twitch":"http://www.twitch.tv/tehdiamondz","facebook":"www.facebook.com/GambitDiamondprox","twitter":"http://twitter.com/tehDiamondz"},"champions":[],"liveGameTeam":221},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":118},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":118},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":118},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":148,"slug":"shiphtur","name":"Shiphtur","firstName":"Danny","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/shiphtur-3a942emw.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-06-22T22:23:47.000Z","bios":{"en_US":"<p>\nDanny “Shiphtur” Le has been competing professionally since 2012. Known for a deep champion pool, Shiphtur is most effective on mid lane assassins like Ahri and Kassadin, but he can also hold his own with control mages, as evidenced by his fantastic 10.75 KDA on Ziggs in the 2014 NA LCS Summer Split. \n</p>\n<p>\nShiphtur got his first taste of the NA LCS while playing for Team Coast, then wreaked havoc from the mid lane with Team Dignitas. As one of the more experienced players in the LCS, Shiphtur has seen the focus of professional play transition from individual mechanics to coordinated team play. \"It's all about getting down the macro,\" Shiphtur says. \"Honestly in League of Legends right now, you can win a game purely on macro, rotations and such. Individual play really doesn't mean anything right now.\" Now, Shiphtur takes up his place on Delta Fox's new lineup.\n</p>","fr_FR":"<p>Cette saison encore, Danny « Shiphtur » Le tiendra la voie du milieu pour Dignitas. À 22 ans, le Canadien est déjà un vétéran de League of Legends.</p>\n\n<p>Il a débuté sa carrière peu avant la saison 3 et le lancement des LCS. Des LCS qu'il a immédiatement rejoints au sein de Good Game University, aux côtés notamment de Darshan « ZionSpartan » Upadhyaya (aujourd'hui connu sous le pseudonyme de Darshan). Malheureusement pour lui, des problèmes de visa l'ont empêché de jouer avant le début du segment d'été. Ses malheurs ont continué tout au long de la saison puisque l'équipe, rebaptisée Team Coast, a enchaîné les défaites pour finir à la 7e place du classement, synonyme de passage en tournoi de relégation. Une victoire 3 à 2 contre The Walking Zed leur a permis de se maintenir au plus haut niveau pour la saison 4, mais le répit ne fut que de courte durée. Lors du segment de printemps des LCS de la saison 4, Shiphtur et ses comparses n'ont su faire mieux qu'une 6e place puis un retour en tournoi de relégation après deux défaites en play-offs contre Counter Logic Gaming puis Dignitas. Cette fois le couperet est tombé sous la forme d'une défaite face à compLexity.Black, 3 victoires à 1, et le mid laner s'est retrouvé bouté hors des LCS.</p>\n\n<p>C'est le moment qu'a choisi Dignitas pour le recruter, toujours aux côtés de ZionSpartan. Avec sa nouvelle équipe, le joueur canadien s'est retrouvé une fois de plus très proche des relégations, évitées de justesse en fin de saison. L’histoire se répète lors du segment de printemps de la saison 5 des LCS, où l’équipe termine à la 9ème place et doit de nouveau passer par le tournoi de relégation. Malgré une légère amélioration lors du segment d'été, Shiphtur aborde la saison 6 sans aucune certitude. À lui de prouver enfin qu'il mérite véritablement sa place sur le terrain des LCS, face à une compétition chaque année plus relevée.</p>","pl_PL":"<p>Z pochodzenia Kanadyjczyk, z krwi Wietnamczyk, z urodzenia mid-laner. Danny Le sam wybrał tą linię, gdyż uważał, że jest najbliżej centrum wydarzeń i ma największy potencjał. Podczas swojej przygody z League of Legends wielokrotnie udowadniał, że zasługuje na tą pozycję. Pojawił się na scenie esportowej pod koniec drugiego sezonu i do stycznia 2013 roku grał na różnych pozycjach w paru pomniejszych drużynach. Wtedy nastąpił przełom w jego życiu, ponieważ trafił do Good Game University, później znanego jako Team Coast. Aż do kwietnia 2014 roku zespół walczył o przetrwanie w NA LCS, ponieważ wśród innych bardziej doświadczonych drużyn był przysłowiowym chłopcem do bicia. Nie przeszkodziło to Danniemu w pokazaniu się z najlepszej strony na scenie esportowej. Zrobił pentakilla Anivią na wiosennych rozgrywkach kwalifikacyjnych w Challenger Series w styczniu 2013 roku. Niestety w kwietniu 2014 roku porażka z compLexity.Black przesądziła o relegacji Team Coast z powrotem do Challenger Series. Miesiąc później \"Shiphtur\" opuścił tą drużynę, gdyż od razu dostał propozycje od swoich niedawnych konkurentów z NA LCS. W maju 2014 roku dołączył do Team Dignitas, gdzie w swojej pierwszej grze wiosennego sezonu 2014 zrobił kolejnego pentakilla, tym razem LeBlanc. </p>\n<p>\nDanny przysłużył się wszystkim innym graczom, przecierając drogę w oddziałach imigracyjnych Stanów Zjednoczonych. Jako pierwszy zawodnik esportowy otrzymał wizę P-1A, która przysługuje tylko profesjonalnym atletom. Kolejną jego zasługą dla społeczeństwa League of Legends było wprowadzenie Ziggsa do profesjonalnej gry. Wyborem Hextechowego Sapera sprowokował wiele banów w turniejach, lecz mimo tego jest jeszcze parę innych bohaterów, które \"Shiphtur\" uwielbia. Doskonale gra Anivią, co wielokrotnie udowadniał na różnej maści meczach, podobnie traktuje Ahri i Dianę. Szczytem jego możliwości jest Krąg Pretendenta z ponad tysiącem punktów LP. W wywiadzie po Mistrzostwach Świata 2015 Danny oświadczył, że według niego najmocniejszy zespół w NA LCS 2016 będzie miał Team SoloMid. Dodał też, że nie bez powodu pojechał na długi trening do Korei i że ma zamiar godnie stawić im czoła. Całość podsumował, że kocha League of Legends i jest bardzo wdzięczny fanom, którzy przy nim wytrwali. </p>\n"},"foreignIds":{"drupalId":"38","TRLH1":"1001220076","TRLH2":"1001160126","FRA1TMNT1":"375096","ESPORTSTMNT02":"200002373"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":256,"slug":"bubbadub","name":"Bubbadub","firstName":"Royce","lastName":"Newcomb","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/bubbadub_profile.jpg","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-07-12T20:07:14.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1147","TRLH1":"1001220061","TRLH3":"1001160071","TRLH4":"1001160071","TRLH2":"1001160111"},"socialNetworks":{},"champions":[],"liveGameTeam":118},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":118},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":746,"slug":"roar","name":"Roar","firstName":"Jang-won","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/roar-3sgsb7kb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-06-15T22:40:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"874","TRLH1":"1001300003","FRA1TMNT1":"445029"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":1100,"slug":"shernfire","name":"Shernfire","firstName":"Shern","lastName":"Tai","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shernfire-1ogbrwxw.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2016-01-21T22:09:01.000Z","updatedAt":"2017-05-31T02:44:03.000Z","bios":{"en_US":"<p>Shern “Shernfire” Tai is the playmaking jungler for the Dire Wolves. The 18-year-old already has over two years of professional experience, first joining the Dire Wolves as a substitute in 2014. After spending two years in the NA Challenger series to little success, Shernfire returned to his first team for the start of 2017. He’s one of the most gold-hungry junglers in the OPL. When the gold is rolling in, his Rengar and Kha’Zix look unstoppable. He’ll have to fight tooth and nail for every jungle camp at the 2017 Mid-Season Invitational, though, where he will face off against some of the world’s best junglers.</p>","es_AR":"<p><strong>Shern \"Shernfire\" Tai</strong> es el junglero que arma jugadas para los Dire Wolves. El chico de 18 años, que se unió a los Dire Wolves como sustituto en 2014, ya tiene más de dos años de experiencia en el juego profesional. Después de pasar dos años en la serie Retador NA con pocos resultados, <strong>Shernfire</strong> regresó a su primer equipo para el comienzo de la temporada 2017. Es uno de los jungleros con más sed de oro en la OPL. Cuando el oro comienza a circular, su Rengar y su Kha'Zix parecen ser imparables. Sin embargo, <strong>Shernfire</strong> tendrá que luchar con garras y dientes por cada campamento de jungla en el Mid-Season Invitational 2017, en donde se enfrentará a algunos de los mejores jungleros del mundo.</p>","de_DE":"Shern „Shernfire“ Tai ist der Spielmacher und Jungler der Dire Wolves. Der 18-jährige, der 2014 als Ersatzspieler zu den Dire Wolves kam, kann bereits auf eine zweijährige Profi-Karriere zurückblicken. Nachdem er zwei erfolglose Jahre in der nordamerikanischen Challenger Series verbracht hatte, kehrte er Anfang 2017 wieder zu seiner alten Mannschaft zurück. Er ist einer der goldgierigsten Jungler in der OPL. Und wenn er genug Gold bekommt, ist er mit Rengar und Kha’Zix nicht zu stoppen. Beim Mid-Season Invitational 2017 wird er sich jedoch mit Händen und Füßen gegen die besten Jungler der Welt zur Wehr setzen müssen.","es_ES":"Shern ''Shernfire'' Tai es el jungla estratega de Dire Wolves. Con solo 18 años, y tras unirse a Dire Wolves en 2014 como suplente, ya cuenta con dos años de experiencia profesional. Tras pasar dos años en la Challenger Series de NA sin mucho éxito, Shernfire volvió a su primer equipo a comienzos de 2017. Es uno de los junglas más hambrientos de oro de la OPL. Cuando abunda el oro, su Rengar y su Kha'Zix son imparables. No obstante, tendrá que luchar con uñas y dientes para hacerse con todos los campamentos de la jungla en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores junglas del mundo.","fr_FR":"Shern « Shernfire » Tai est un jungler qui crée du jeu pour les Dire Wolves. Ce joueur de 18 ans a déjà deux ans d'expérience professionnelle à son actif, ayant rejoint les Dire Wolves pour la première fois en tant que remplaçant en 2014. Après avoir passé deux années dans les Challenger Series NA sans succès ou presque, Shernfire est de retour dans sa première équipe pour le début de l'année 2017. Il est l'un des junglers les plus assoiffés d'or de l'OPL. Et lorsque les PO coulent à flot, ses Rengar et Kha'Zix semblent imbattables. Dans la jungle, il devra lutter pour chaque camp bec et ongles lors du Mid-Season Invitational 2017 face à certains des meilleurs junglers du monde.","pl_PL":"Shern „Shernfire” Tai to rozgrywający dżungler Dire Wolves. Osiemnastolatek ma już za sobą ponad dwa lata profesjonalnego doświadczenia. Po raz pierwszy dołączył do Dire Wolves jako rezerwowy w 2014 roku. Po spędzeniu z niewielkim powodzeniem dwóch lat w NA Challenger Series Shernfire na początku 2017 roku wrócił do swojej pierwszej drużyny. Jest jednym z najbardziej żądnych złota dżunglerów w OPL. Gdy złoto napływa, jego Rengar i Kha’Zix stają się niepowstrzymani. Jednak na Mid-Season Invitational 2017 będzie musiał walczyć na śmierć i życie o każdy obóz w dżungli, stając przeciwko najlepszym dżunglerom na świecie.","pt_BR":"<p>Shern \"Shernfire” Tai é o criador de jogadas dos Dire Wolves. O jovem de 18 anos já tem dois anos de experiência profissional, tendo entrado para os Dire Wolves como substituto em 2014. Após passar dois anos no circuito Desafiante da NA sem muito sucesso, Shernfire voltou à sua primeira equipe para o início de 2017. Ele é um dos melhores caçadores na OPL. Quando o ouro entra, seu Rengar e Kha’Zix parecem invencíveis. Mas ele terá de lutar com unhas e dentes por cada acampamento na selva do Mid-Season Invitational 2017, quando enfrentará alguns dos melhores caçadores do mundo.</p>"},"foreignIds":{"FRA1TMNT1":"375269","ESPORTSTMNT03":"200001275","TRLT3":"200000042"},"socialNetworks":{"twitter":"https://twitter.com/shernfire"},"champions":[],"liveGameTeam":221},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":118}],"scheduleItems":[{"id":"AVUYKJcSQMQFcjhwbQj_","content":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:match:387bbae7-fd2d-4d35-ad03-1804aa286f19","scheduledTime":"2016-06-30T04:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f","blockLabel":"4","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:bracket:3f47a875-88ff-4040-90d1-fc7980d318d2"},"match":"387bbae7-fd2d-4d35-ad03-1804aa286f19","tournament":"9e8ae990-aa5a-4ae5-865c-3a31ae39b30f","bracket":"3f47a875-88ff-4040-90d1-fc7980d318d2","league":"4"}],"gameIdMappings":[{"id":"5fae5261-fbc7-4772-9e27-e1667dd9c946","gameHash":"1d9beb5fb7a68dfe"},{"id":"653136aa-c057-4f9b-90e9-282eef9ca787","gameHash":"e74922a2546989d0"}],"videos":[{"id":3500,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:game:5fae5261-fbc7-4772-9e27-e1667dd9c946","source":"https://www.youtube.com/embed/9geaAcw49jo?wmode=transparent","createdAt":"2016-06-30T06:07:02.000Z","updatedAt":"2016-06-30T06:07:02.000Z","game":"5fae5261-fbc7-4772-9e27-e1667dd9c946"},{"id":3526,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:game:653136aa-c057-4f9b-90e9-282eef9ca787","source":"https://www.youtube.com/embed/mdbSvfkZ1rw?wmode=transparent","createdAt":"2016-07-01T20:01:39.000Z","updatedAt":"2016-07-01T20:01:39.000Z","game":"653136aa-c057-4f9b-90e9-282eef9ca787"}],"htmlBlocks":[],"match":{"id":"387bbae7-fd2d-4d35-ad03-1804aa286f19","name":"C9C-vs-APP","position":14,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],"games":{"5fae5261-fbc7-4772-9e27-e1667dd9c946":{"id":"5fae5261-fbc7-4772-9e27-e1667dd9c946","name":"G2","generatedName":"APP|C9C|G2|387bbae7fd2d4d35ad0","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],"standings":{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}],[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467266517764,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}],[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467266344619,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}],[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467262269411,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1060218","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:1060218","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"653136aa-c057-4f9b-90e9-282eef9ca787":{"id":"653136aa-c057-4f9b-90e9-282eef9ca787","name":"G1","generatedName":"APP|C9C|G1|387bbae7fd2d4d35ad0","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a5127554-f058-4151-b043-2b67beb299df"},{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}],"standings":{"result":[[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}]],"timestamp":1467402644405,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"}]],"timestamp":1467259001290,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1060217","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:1060217","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467402644405,"source":"bestOf","history":[{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467266517764,"source":"bestOf","closed":true},{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467266344620,"source":"bestOf","closed":true},{"result":[[{"roster":"3ee5de24-c37e-469f-bc13-59ddc3bea031"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1467262269411,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"3ee5de24-c37e-469f-bc13-59ddc3bea031":1,"a5127554-f058-4151-b043-2b67beb299df":1}}}