{"teams":[{"id":76,"slug":"lgd-gaming","name":"LGD Gaming","guid":"be6df3df-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-5n0d69lg.png","acronym":"LGD","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-if86jc4q.png","createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:34:16.000Z","bios":{"en_US":"","fr_FR":"Pendant des années, LGD est restée coincée au milieu du classement des LPL. En dépit de quelques succès dans des tournois mineurs, ces joueurs n'ont pas menacé la domination d'EDG et de SHRC dans l'e-sport chinois. Puis LGD a décidé que ça suffisait comme ça. Elle a reconstruit l'équipe avec des joueurs coréens aguerris (imp, Flame et Acorn) à la fin de 2014. Les résultats parlent d'eux-mêmes : 1re place lors des play-offs d'été au LPL 2015.","pl_PL":"Od lat LGD znajduje się pośrodku tabeli LPL. Pomimo sukcesów w mniejszych turniejach nawet nie zbliżyło się do sukcesów EDG i SHRC w chińskim E-sporcie. I wtedy właśnie LGD stwierdziło, że starczy tego dobrego. Do swojego składu wcielili niezwykle utalentowanych Koreańczyków – impa, Flame'a i Acorna – pod koniec 2014 roku. Wyniki mówią same za siebie – 1. miejsce w letnich playoffach LPL 2015.","de_DE":"Seit Jahren steckte LGD in der Mitte der LPL-Tabelle fest. Trotz einigen Erfolgen bei kleineren Turnieren, schafften sie es nicht, die Dominanz von EDG oder SHRC zu beenden. Doch damit sollte nun ein für alle Mal Schluss sein. Sie verbesserten ihr Team mit den bekannten koreanischen Talenten imp, Flame und Acorn im Sommer 2014. Die Ergebnisse sprechen für sich - erster Platz der LPL Sommersaison in diesem Jahr.","es_ES":"LGD se pasó varios años estancado en centro de la tabla de la LPL. A pesar de obtener algunos éxitos en torneos menores, apenas alcanzó a mellar el férreo dominio que ejercían EDG o SHRC sobre los deportes electrónicos en China. Hasta que decidieron que ya estaba bien. A finales de 2014 reconstruyeron la plantilla con talentos coreanos de primera categoría, como Imp, Flame o Acorn. Los resultados hablan por sí mismos: Primer puesto de las eliminatorias de verano de la LPL 2015.","pt_BR":"A LGD passou anos vivendo na parte do meio da tabela LPL. Apesar de vitórias em alguns torneios menores, eles estavam longe de ameaçar a EDG ou a Royal Club no cenário chinês. Mas então eles deram um basta. Reconstruíram o time no final de 2014 com grandes astros coreanos: imp, Flame e Acorn. Os resultados falam por sisó -- campeões das eliminatórias de verão da LPL 2015.\n"},"foreignIds":{"drupalId":"1850"},"players":[56,67,541,589,605,998,1431],"starters":[67,541,589,605,998],"subs":[56,1431]},{"id":77,"slug":"qiao-gu","name":"NewBee","guid":"be6df6f7-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/qiao-gu-4kmc55n8.png","acronym":"NB","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:03:29.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4380"},"players":[131,139,573,577,582,707,1283,1648,1651,1986],"starters":[131,573,577,582,1283],"subs":[139,707,1648,1651,1986]}],"players":[{"id":56,"slug":"cool","name":"Cool","firstName":"Jia-Jun","lastName":"Yu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/cool-esrj8abc.png","hometown":"Yiyang, China","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:14.000Z","updatedAt":"2017-06-06T23:29:21.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"698","TRLH1":"1000185041","TRLH3":"1000105048"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":67,"slug":"imp","name":"imp","firstName":"Seung-bin","lastName":"Gu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/imp-5lcuchzd.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:27.000Z","updatedAt":"2016-02-01T22:57:45.000Z","bios":{"en_US":"<p>Seung-bin “imp” Gu is notorious for his former rivalry with Gwang-jin “Piglet” Chae and his unabashed trash talk. But imp is more than just talk, and his recent results speak for themselves. Imp started his career on Samsung White (formerly MVP Ozone), a team that would eventually be one of the greatest of all time. Imp played a key role in their dominant performance -- and 1st place finish -- at the 2014 World Championship.</p>\n\n<p>In the wake of his move to LGD, imp matured. When naysayers said he would fail without his world-class support partner Mata, he proved them wrong. When his interviewers expected trash talk and arrogance, imp displayed humility and courteous manners. But there’s still a monster hiding beneath imp’s newfound modesty. The fact is, imp is very good at League of Legends, and he knows it.</p>","fr_FR":"<p>Seung-bin « imp » Gu est célèbre pour son ancienne rivalité avec Gwang-jin « Piglet » Chae et pour sa gouaille insolente. Mais imp n'est pas celui qui parle le plus : ses récents résultats sont plus éloquents encore que lui. Imp a commencé sa carrière chez Samsung White (anciennement MVP Ozone), une équipe qui allait compter parmi les meilleures de tous les temps. Imp a joué un rôle clé dans ses performances spectaculaires (et sa première place) aux Championnats du monde 2014.</p>\n\n<p>À la suite de son arrivée chez LGD, imp est devenu plus mûr. Quand les mauvaises langues ont prédit qu'il allait forcément échouer sans l'aide de son exceptionnel support, Mata, il leur a prouvé le contraire. Alors que ses interlocuteurs s'attendaient à le voir arrogant et désagréable, imp s'est montré humble et courtois. Mais cela ne veut pas dire qu'il n'y a pas un monstre qui dort derrière la nouvelle modestie dont fait preuve imp. De fait, imp est un excellent joueur de League of Legends et il le sait. Après tout, il est le premier des cinq anciens membres de Samsung White à s'être assuré une place aux Championnats du monde 2015. </p>","pl_PL":"<p>Seung-bin „imp” Gu okrył się złą sławą przez swą niegdysiejszą rywalizację z Gwang-jinem „Pigletem” Chae, a także bezwstydną krytykę innych zawodników. Imp nie jest jednak mocny wyłącznie w gębie, a jego niedawne rezultaty mówią same za siebie. Imp rozpoczął karierę jako zawodnik Samsung White (dawniej MVP Ozone) – drużyna ta przeszła do historii jako jedna z najlepszych. Rola impa w zajęciu przez drużynę pierwszego miejsca podczas mistrzostw świata 2014 była kluczowa.</p>\n\n<p>Po dołączeniu do LGD imp bardzo dojrzał jako gracz. Udowodnił malkontentom mówiącym, że nie poradzi sobie bez światowej klasy zawodnika wsparcia, Maty, jak bardzo się mylą. Ilekroć prowadzący wywiad oczekiwali przechwałek i arogancji, imp wykazywał się grzecznością i pokorą. Pod przykrywką skromności wciąż jednak drzemie w nim bestia. Prawda jest taka, że imp jest świetnym graczem w League of Legends i doskonale zdaje sobie z tego sprawę. Bądź co bądź jako pierwszy spośród pięciu zawodników Samsung White zdołał zająć pierwsze miejsce w mistrzostwach świata 2015. </p>","de_DE":"<p>Seung-bin “imp” Gu ist berühmt berüchtigt wegen seiner früheren Rivalität mit Gwang-jin “Piglet” Chae und ihren unerreichten Provokationen. Aber imp ist mittlerweile mehr als nur heiße Luft, was seine letzten Erfolge unter Beweis stellen. Imp begann seine Karriere bei Samsung White (früher MVP Ozone), einem Team das eventuell eines der besten der Welt für alle Zeit werden kann. Imp spielte eine Schlüsselrolle bei ihren dominanten Auftritten- und beendete die Weltmeisterschaft mit dem Titel. </p>\n\n<p>Durch seinen Wechsel zu LGD reifte imp. Die Pessimisten, die Imp´s Zukunft ohne seinen früheren Supporter Mata zum Scheitern verurteilten, überzeugte er deutlich. Wenn Reporter auf Provokation und Arroganz warteten, zeigte er Menschlichkeit und gutes Benehmen. Aber hinter seinem neugefundenen Anstand ist immer noch der frühere imp versteckt. Denn imp ist verdammt gut in League of Legends und genau das weiß er auch. Nach all dem war er der Erste von seinen früheren Mitspielern von Samsung White, der sich seinen Platz bei Worlds 2015 sicherte. </p>\n","es_ES":"Seung-bin ''Imp'' Gu es famoso tanto por su feroz rivalidad con Gwang-jin ''Piglet'' Chae como por una extraordinaria capacidad de meter la pata al hablar. Pero al margen de comentarios desafortunados, sus actuaciones de los últimos tiempos son aún más elocuentes. Comenzó su carrera en Samsung White (el antiguo MVP Ozone), un equipo que terminaría por convertirse en el mejor de la historia. De hecho, Imp desempeñó un papel fundamental en la exhibición realizada en el Campeonato Mundial de 2014 (y en la victoria que le puso la guinda).\n\nTras su paso a LGD, Imp ha madurado. Cuando algunos agoreros aseguraron que se vendría abajo sin su compañero, el fabuloso apoyo Mata, Imp demostró que se equivocaban. Y cuando toda la prensa esperaba que exhibiera su habitual arrogancia, respondió con una humildad y una educación impropias de él. Pero debajo de esta nueva prudencia se esconde todavía una bestia. El hecho es que Imp es un grandísimo jugador de League of Legends y lo sabe. A fin de cuentas, ha sido el primero de los cinco antiguos integrantes de Samsung White en asegurarse una plaza en el Campeonato Mundial de 2015. \n","pt_BR":"<p>Seung-bin “imp” Gu é famoso por sua antiga rivalidade com Gwang-jin “Piglet” Chae e todas as provovações que a seguiram. Mas imp é mais do que apenas conversa fiada, e seu histórico recente prova isso. Ele começou sua carreira na Samsung White (antes conhecida como MVP Ozone), uma equipe que eventualmente entraria na história como uma das melhores de todos os tempos. Imp foi uma peça chave na atuação dominante - e o primeiro lugar - no Campeonato Mundial de 2014.</p>\n\n<p>Entre todas as conversas durante sua mudança para a LGD, Imp amadureceu. Quando críticos disseram que sem Mata como suporte ele iria falhar, ele provou o contrário. Quando seus entrevistadores esperavam arrogância e provocações, Imp foi cordial e humilde. Mas ainda há um monstro por trás de sua nova modéstia. O fato é: Imp é muito bom em League of Legends. E ele sabe. Afinal, ele foi o primeiro dos cinco ex-integrantes da Samsung White a assegurar sua vaga no Campeonato Mundial 2015.</p>"},"foreignIds":{"drupalId":"681","TRLH3":"1001160026","TRLH1":"1001180006","TRLH4":"1001160026","TRLH2":"1001140006"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":131,"slug":"corn","name":"Corn","firstName":"Wen","lastName":"Lei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/corn-a770ewam.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:58.000Z","updatedAt":"2017-06-06T23:59:26.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"3171","TRLH1":"1000185034","TRLH3":"1000205037"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":139,"slug":"vasilii","name":"Vasilii","firstName":"Wei-jun","lastName":"Li","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/vasilii-33axmst.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-07T00:04:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1304","TRLH1":"1000045032","TRLH2":"2000045027"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":541,"slug":"eimy","name":"Eimy","firstName":"Dan","lastName":"Xie","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/eimy-fmyi9due.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:36:23.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4513"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":573,"slug":"swift","name":"Swift","firstName":"Da-hun","lastName":"Baek","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/swift-8ph5i88w.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:02:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nDa-hoon « Swift » Baek est l'un des jeunes talents les plus dynamiques de la LPL. Depuis qu'il a rejoint QiaoGu, Swift a démontré qu'il était effectivement plus vif que ses adversaires. Swift est un véritable maître quand il s'agit de deviner les coups de l'adversaire, et parfois on a même l'impression qu'il a deux coups d'avance sur eux.\n</p>\n<p>\nPour ses débuts lors du Segment d'été des LPL 2015, Swift a démontré qu'il pouvait non seulement profiter pleinement d'un avantage pour ses coéquipiers, mais aussi qu'il pouvait farmer et déjouer la plupart des autres junglers. Son parcours dans la jungle est toujours un peu plus efficace et il arrive toujours le premier sur les ganks. Son farming est également toujours quelques PO en avance, ce qui lui permet d'acheter les gros objets en premier. Son armure est aussi un peu plus brillante et lui permet d'absorber un peu plus des rayons gamma du soleil, et donc de balancer son super uppercut de l'aigle majestueux qui projette ses ennemis dans la stratosphère. \n</p>","pl_PL":"<p>\nDa-hoon „Swift” Baek jest jednym z najprężniej rozwijających się młodych talentów w LPL. Dołączywszy do Qiao Gu, Swift udowodnił, że – jak wskazuje jego ksywka – jest zdecydowanie szybszy od konkurentów (niezbyt wysoko ustawiona poprzeczka). Swift jest absolutnym mistrzem, jeśli chodzi o przewidywanie posunięć swoich przeciwników. Chwilami można by odnieść wrażenie, że wyprzedza ich o dwa kroki.\n</p>\n<p>\nDebiutując w letnim splicie 2015 LPL, Swift udowodnił, że nie tylko potrafi wykorzystać przewagę swojej drużyny, ale też zdobyć więcej złota i pokonać większość dżunglerów. W dżungli radzi sobie lepiej niż pozostali, w związku z tym zazwyczaj jako pierwszy zastawia zasadzki. Zawsze ma na koncie o kilka zabitych stworów więcej, dzięki czemu ma okazję kupować potężne przedmioty jako pierwszy. Jego pancerz jest nieco jaśniejszy od innych, dzięki czemu pochłania więcej promieniowania gamma, co sprawia, iż staje się supersilny i jest w stanie wybijać przeciwników na orbitę za pomocą potężnego ciosu wzlatującego orła. \n</p>"},"foreignIds":{"drupalId":"1014"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":577,"slug":"tct","name":"Mor","firstName":"Hong-Wei","lastName":"Zhang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/tct-9wpmbdee.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:51:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nLes fans des LCS NA reconnaîtront peut-être en Zhang « TcT » Hong Wei l'ancien support des LMQ, dont le pseudo était Mor. Lors de sa première année en ligue nord-américaine, il est passé avec le reste des LMQ des séries Challenger NA aux LCS NA, pour aller jusqu'au Championnat du monde de la Saison 4. À l'époque, on avait remarqué TcT pour son style de jeu désintéressé, toujours prêt à se sacrifier pour permettre à un de ses coéquipiers de survivre.\n</p>\n<p>\nMais quand LMQ a échoué à franchir les phases de groupe pour le Championnat du monde, TcT a décidé de retourner en Chine et de recommencer à jouer avec son ancien partenaire de duo, TcT, chez QiaoGu. Leur combo sur la voie du bas s'est épanouie, notamment grâce à leurs intenses sessions d'entraînement. Il n'est pas rare qu'ils se lèvent à 5 heures du matin pour jouer ensemble en file duo. Avec l'aide de TnT, TcT a perdu cette mentalité de chair à canon qu'il avait développée dans les ligues NA. Il choisit maintenant des champions qui offrent de vraies options de désengagement, comme Janna, qui lui permettent de protéger ses coéquipiers sans devoir mourir en boucle. Oh, et de parvenir au passage à un joli KDA.\n</p>","pl_PL":"<p>\nFani PA LCS znają zapewne Zhanga „TcT” Hong Weia, byłego zawodnika wsparcia LMQ, wówczas posługującego się ksywką Mor. W trakcie pierwszego roku rozgrywek północnoamerykańskich razem z resztą LMQ zdołał awansować z serii pretendentów do PA LCS, a potem do Mistrzostw Świata Sezonu Czwartego. TcT znany był wówczas z ofiarnego stylu gry – zawsze gotów był poświęcić swoje życie, by ratować kolegów z drużyny.\n</p>\n<p>\nGdy LMQ nie zdołało przejść przez grupowy etap mistrzostw świata, TcT postanowił wrócić do Chin i ponownie dołączyć do swojego dawnego partnera z drużyny Qiao Gu. Wspólnymi siłami zaczęli dominować w dolnej alei, co było zasługą przede wszystkim regularnych treningów. Zdarzało im się wstawać o piątej rano, by rozegrać mecz w duecie. Z pomocą TnT, TcT oduczył się odgrywania roli kozła ofiarnego, której nauczył się Ameryce Północnej. Obecnie wybiera bohaterów skutecznie wycofujących się z walki, takich jak Janna, co pozwala mu chronić kolegów z drużyny, unikając jednocześnie śmierci. Aha, jego stosunek zabić do zgonów znacznie na tym zyskał.\n</p>"},"foreignIds":{"drupalId":"4524"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":582,"slug":"v","name":"V","firstName":"Bo","lastName":"Bao","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/v-d6ylt7bf.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:01:54.000Z","bios":{"en_US":"","fr_FR":"<p>\nBao « V » Bo est un top discret mais particulièrement doué. Le top de QiaoGu a commencé le Segment d'été des LPL 2015 avec des champions de type carry, comme Irelia, mais il a depuis fait machine arrière. Il joue maintenant ce dont son équipe a besoin. Si les tanks sont dans la meta, il va jouer tank. Si les mages sont dans la meta, il va jouer mage. Ses choix ont fini par se rapprocher de sa tendance discrète à rentrer dans le rang.\n</p>\n<p>\nPour ce qui est de la cohésion de son équipe, QiaoGu a fait le choix, heu... classieux de leur faire tous se teindre les cheveux en même temps. V a suivi sa nature profonde et a choisi de se teindre les cheveux dans une teinte châtain, alors que ses coéquipiers ont choisi des violets vifs et des verts flashy. Il est sans doute le moins bruyant de son équipe, mais ça ne l'empêche pas de dominer sur sa voie. Même si lui, il n'a pas l'élément « GOD » dans son pseudo.\n</p>","pl_PL":"<p>\nBao „V” Bo jest cichym, ale utalentowanym zawodnikiem górnej alei. Zaczynał podczas letniego splitu 2015 LPL, korzystając z bohaterów prowadzących, takich jak Irelia, od tamtej pory zarzucił jednak podejście, jakiego nabrał w czasach kolejki solowej. Teraz gra tak, jak chce jego drużyna. Jeśli potrzebni są obrońcy, będzie grać obrońcami, jeśli magowie – wybierze magów. Swoje wybory zaczął dostosowywać do oczekiwań drużyny, co z uwagi na jego charakter nie było dla niego problemem.\n</p>\n<p>\nW kwestii budowania poczucia więzi w drużynie Qiao Gu zdecydowali się postawić na, ekhm, styl i solidarnie ufarbować włosy. V postąpił zgodnie ze swoją naturą, wybierając zachowawczy odcień brązu, gdy koledzy z zespołu zdecydowali się na krzykliwą purpurę i neonową zieleń. Choć w drużynie nieczęsto zabiera głos, nie przeszkadza mu to być jednym z najbardziej dominujących zawodników w alejach. Kto by pomyślał?\n</p>"},"foreignIds":{"drupalId":"4526"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":589,"slug":"pyl","name":"Pyl","firstName":"Bo","lastName":"Chen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pyl-ahtd159j.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:30:25.000Z","bios":{"en_US":"<p>\nBo “Pyl” Chen is one of the best supports in the LPL, with much of his strength coming from the diverse champion pool he brings to the bot lane and his dynamic shot-calling. He’s no slouch on his mechanics either; His Thresh is a must-ban, his Alistar tramples the competition, and his Janna always finds the right position to blow away the opposition. But as the captain of LGD, his ability to call out rotations and map objective prioritization truly set him apart. Pyl is the glue that holds LGD together.\n</p>","fr_FR":"<p>\nChen « Pyl » Bo est l'un des meilleurs supports des LPL, et l'une de ses principales forces, c'est la variété de champions qu'il peut faire intervenir sur la voie du bas et sa capacité à donner des ordres en s'adaptant à la situation. Il est également loin d'être manchot en ce qui concerne les compétences techniques : son Thresh est à bannir absolument, son Alistar écrabouille l'adversaire et sa Janna est toujours au bon endroit au bon moment pour souffler l'ennemi. Mais en tant que capitaine de LGD, c'est surtout sa capacité à donner des ordres et à définir les priorités pour les objectifs de la carte qui font la différence. Pyl est le ciment qui fait tenir LGD ensemble. Il devrait continuer dans cette optique lorsqu'il accueillera ses amis des LPL à l'événement All-Star 2015 avec son fameux sourire.\n</p>","pl_PL":"<p>\nChen „Pyl“ Bo gehört zu den besten Supportern in der LPL, und ein großer Teil seiner Stärke beruht auf seinem breitgefächerten Championpool, den er in die untere Lane mitbringt, und auf seinem dynamischen Shot-Calling. Doch auch seine Mechaniken können sich sehen lassen. Seinen Thresh zu bannen ist Pflicht, sein Alistar zertrampelt seine Rivalen und seine Janna findet immer die richtige Position, um den Gegner auszuschalten. Was ihn jedoch als Teamleiter wirklich ausmacht, ist seine Fähigkeit, Wechsel anzuordnen und bei den Kartenzielen Prioritäten zu setzen. Pyl ist der Leim, der LGD zusammenhält. Dies werden wir auch beim All-Star-Event 2015 erleben, wenn er die anderen Stars der LPL mit seinem berühmten Lächeln begrüßt.\n</p>","de_DE":"<p>Chen “Pyl” Bo ist einer der besten Supporter in der LPL, was vor allem von seinem großen Championpool für die Bot-Lane und seinem dynamischen Shotcalling herrührt. Aber auch seine Mechaniken sind nicht die schlechtesten; sein Thresh ist ein Must-Ban, sein Alistar trampelt die Spiele nieder und seine Janna findet immer die richtige Position, um die Gegner wegzuwehen. Zudem hebt ihn seine Fähigkeit als Kapitän das Team über die Karte zu navigieren und sein Fokus auf Objekte hervor. Pyl ist der Kleber, der LGD zusammenhält. </p>\n\n<p>Tatsächlich sind seine Fähigkeiten so begehrt, dass sich selbst Seung-bin “imp” Gu für LGD entschieden hat, nur um mit Pyl zusammenspielen zu können. Während er vorher seine Bot-Lane-Partner übertroffen hat, fand er mit Imp einen Partner, der jeden seiner Züge mitgehen kann. </p>\n","es_ES":"<p>\nChen ''Pyl'' Bo es uno de los mejores apoyos de la LPL, gracias a la diversidad del arsenal de campeones que puede usar en la calle inferior y a su dinamismo a la hora de marcar jugadas. Y por mecánicas tampoco es manco: Aunque los rivales bloqueen a su Thresh (como suelen hacer), es perfectamente capaz de pisotearlos con Alistar y siempre encuentra el modo de hacerlos volar por los aires con Janna. Como capitán de LGD, su habilidad para organizar las rotaciones y priorizar los objetivos lo convierte en único. Pyl es el pegamento que mantiene unido a LGD. Y seguirá siéndolo en el All-Star 2015, cuando luzca su ya famosa sonrisa para dar la bienvenida a otras estrellas de la LPL.\n</p>","pt_BR":"<p>Chen “Pyl” Bo é um dos melhores suportes na LPL, com muito de sua força vindo de um vasto leque de Campeões aliado à sua dinâmica de chamadas de equipe. Ele não é fraco em mecânicas também; seu Thresh é um banimento quase permanente, seu Alistar atropela as rotas, e sua Janna sempre sabe o lado certo para jogar os furacões. Mas como capitão da LGD, sua habilidade de chamar rotações, posicionar a equipe para objetivos e pressão pelo mapa é o que o diferencia. Pyl é a cola que segura a LGD junta.</p>\n\n<p>De fato, as habilidades de Pyl são tão aclamadas que Seung-bin “imp” Gu escolheu propositalmente a LGD somente para jogar com o suporte. Se antes ele brilhava mais do que seus parceiros de rota, quando Imp entrou na equipe, Pyl encontrou um companheiro de equipe que pudesse ser o seu par perfeito.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Chen “Pyl” Bo 선수는 LPL 최고의 서포터로 꼽힙니다. 넓은 챔피언 폭과 적극적인 지휘에서 그 저력이 나오는 선수입니다. 게다가 피지컬까지 뛰어납니다. 항상 쓰레쉬를 밴당하고 알리스타를 플레이할 땐 상대를 짓뭉개버리죠. 잔나를 잡으면 항상 정확한 위치 선정으로 상대를 날려버립니다. 그리고 LGD의 주장으로서 맵 상의 주요 목표물을 노릴 시기나 어떤 목표물을 먼저 노릴지 정하는 능력이 아주 뛰어납니다. Pyl 선수는 LGD를 하나로 묶는 구심점이기도 합니다. 이번 올스타 대회에서 다른 LPL 올스타를 만났을 때도 특유의 미소로 반기며 팀을 끈끈하게 만들어 주리라 기대해 봅니다. </p>"},"foreignIds":{"drupalId":"2069","TRLH3":"1001160027","TRLH4":"1001160027","TRLH1":"1001180005","TRLH2":"1001140005"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":605,"slug":"godv","name":"GodV","firstName":"Zhen","lastName":"Wei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/godv-awtbwftn.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:35:21.000Z","bios":{"en_US":"","fr_FR":"<p>Wei « We1less » Zhen, précédemment connu sous le nom de GODV, a placé la barre très haut lorsqu'il a choisi son premier surnom. Mais, sachant que We1less est devenu l'un des mid laners les plus réputés des LPL, il savait peut-être exactement ce qu'il faisait. Sa carrière n'a pas été de tout repos, mais on dirait que We1less est enfin sur le point d'arriver à ses fins.</p>\n\n<p>À l'origine, We1less était meneur de jeu chez Vici Gaming. Il jouait de façon égoïste et, s'il voyait une opportunité de plonger dans le combat, il n'hésitait pas une seule seconde. Évidemment, cette stratégie ne portait pas forcément ses fruits, que ce soit pour lui ou pour son équipe. Cependant, avec le temps, We1less est devenu plus réfléchi et a développé son esprit d'équipe. C'est un joueur dynamique qui réfléchit toujours à ce qu'il pourrait apporter à son équipe plutôt que le contraire.</p>\n\n<p>Même si We1less a eu du mal à rejoindre la Faille en 2016 à cause d'une blessure persistante, il a pu prouver son énorme potentiel de jeu à la toute fin du segment d'été. Enregistrant des scores hallucinants, We1less nous a montré à quel point son niveau était élevé. Ses éclairs de génie ont ébloui les fans, qui l'ont choisi pour participer à l'événement All-Stars 2016 de Barcelone. Il déborde de talent et, à en croire ses dernières performances, ses sorts risquent d'être précoces et nombreux. </p>","pl_PL":"Wei „We1less” Zhen, dawniej znany jako GODV, całkiem wysoko ustawił sobie poprzeczkę, wybierając swoje stare przezwisko. Jednak biorąc pod uwagę, że We1less został okrzyknięty jednym z najlepszych środkowych w LPL, może dokładnie wiedział, co robi. Jego podróż była trudna, ale wydaje się, że We1less nareszcie dociera do celu.</p>\n\nDawno, dawno temu We1less był rozgrywającym w Vici Gaming. Grał egoistycznie i gdy tylko dostrzegał okazję do ataku, zazwyczaj z niej korzystał. Oczywiście taka strategia nie zawsze kończyła się dobrze dla niego lub jego drużyny. Teraz jednak We1less jest rozważniejszy i bardziej zorientowany na drużynę. To dynamiczny zawodnik, który zawsze myśli o tym, jak może zapewnić korzyści swojej drużynie (a nie odwrotnie).</p>\n\nChociaż We1less miał problemy z grą na Summoner’s Rift w 2016 roku z powodu uporczywej kontuzji, pod sam koniec letniego splitu zaprezentował swój pełny potencjał jako zawodnik. Zdobywając naprawdę niesamowite wyniki punktowe, We1less pokazał nam, że ustawił sobie poprzeczkę naprawdę wysoko. Jego przebłyski geniuszu oszołomiły fanów, którzy zagłosowali na niego i wysłali na wydarzenie All-Star 2016 w Barcelonie. Ma ogromy potencjał i jeśli można robić założenia w oparciu o jego wcześniejsze występy, to czary We1lessa na turnieju będą latały szybko i często. \n","de_DE":"<p>Wei „We1less“ Zhen, ehemals bekannt als GODV, legte die Latte für sich selbst ziemlich hoch, als er sich für seinen alten Namen entschied. Aber wenn man bedenkt, dass We1less zu einem der am meisten gelobten Mid-Laner der LPL wurde, dann könnte man meinen, er wusste damals ganz genau, was er tat. Sein Weg war steinig, aber es scheint, als wäre We1less endlich angekommen.</p>\n\n<p>Vor langer Zeit war We1less der Spielmacher von Vici Gaming. Er war ein egoistischer Spieler, der so gut wie jede Gelegenheit nutzt, einen Gegner bis zum Schluss zu verfolgen. Natürlich endete diese Strategie nicht immer gut für ihn oder seine Mannschaft. Heute spielt We1less jedoch wesentlich berechnender und teamorientierter. Er ist ein dynamischer Spieler, der immer darüber nachdenkt, wie er seiner Mannschaft helfen kann.</p>\n\n<p>Und obwohl We1less 2016 mit einer hartnäckigen Verletzung zu kämpfen hatte, war sein Potenzial gegen Ende des Sommer-Splits klar zu erkennen. We1less lieferte ein paar unglaubliche Ergebnisse ab und zeigte uns, wie gut er wirklich sein kann. Er ließ immer wieder seine Klasse aufblitzen und begeisterte damit die Fans, die ihn beim All-Stars-Event 2016 in Barcelona sehen wollen. Er steckt voller Potenzial, und wenn man an seine vergangenen Leistungen denkt, ist davon auszugehen, dass er schnell mit viel Zaubern um sich schleudern wird.</p>","es_ES":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores de la calle central más codiciados de la LPL, puede que supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del split de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes.</p>","pt_BR":"<p>Wei “We1less” Zhen, antes conhecido como GODV, subiu bastante o patamar quando escolheu seu antigo apelido. Porém, considerando que We1less se tornou um dos jogadores de meio mais prolíficos da LPL, é provável que ele soubesse direitinho o que estava fazendo. Sua jornada foi difícil, mas parece que We1less finalmente está para chegar.\n\nUm dia, We1less foi um criador de jogadas na Vici Gaming. Ele jogava de forma egoísta e, se tivesse a oportunidade de mergulhar, ele normalmente o fazia. Obviamente, essa estratégia nem sempre dava certo, tanto para ele, quanto para sua equipe. Agora, We1less é mais calculado e pensa mais na equipe. Ele é um jogador dinâmico, sempre pensando em como ele pode beneficiar sua equipe, em vez do contrário.</p>\n\n<p>Apesar de We1less ter tido problemas entrando em Summoner’s Rift em 2016 com uma lesão, seu grande potencial de jogo estava à mostra no fim da Etapa de Verão. Ostentando alguns placares ridiculamente bons, We1less nos mostrou quão alto pode chegar. Seu desempenho incrível deixou uma boa impressão nos fãs que deixaram claro que o queriam no Evento All-Star 2016 em Barcelona. Ele está repleto de potencial para grandes jogadas e, se seus desempenhos anteriores são qualquer indicador, vai ter muito feitiço voando pelo mapa. </p>","cs_CZ":"<p>Wei „We1less“ Zhen, dříve známý jako GODV, si při výběru své předchozí přezdívky nasadil laťku pěkně vysoko. Ale jelikož se z něj stal jeden z nejsledovanějších středových lajnařů v LPL, možná věděl, co dělá. Jeho cesta na výsluní byla trnitá, ovšem zdá se, že konečně nese svoje ovoce.</p>\n\n<p>We1less býval kapitánem Vici Gaming. Hrával sobecky, a když se mu naskytla příležitost vrhnout se po hlavě do boje, jen málokdy jí odolal. Tato strategie samozřejmě pro něj i jeho tým nekončila pokaždé dobře. Nyní je We1less prozíravější a víc myslí na své spolubojovníky. Hraje dynamicky a neustále přemýšlí, čím by mohl svému týmu prospět on, ne naopak.</p>\n\n<p>A ačkoliv se kvůli nepříjemnému zranění podíval We1less do Žlebu v roce 2016 jen málokdy, na konci letního splitu bylo jeho řádění na bojišti hodně znát. Jeho statistiky poskočily do závratných výšin a ukázal nám, co můžeme očekávat od skutečně hvězdného hráče. Fanoušky tyto záblesky dokonalosti náležitě okouzlily, takže jej v hlasování vyslali na turnaj All-Star 2016. Dokáže provádět naprosto úchvatné akce a z jeho předchozích výkonů lze soudit, že i v Barceloně budou kouzla létat často a již krátce po zahájení utkání. </p>","el_GR":"<p>Ο Wei “We1less” Zhen, γνωστός στο παρελθόν ως GODV, ανέβασε μόνος του ψηλά τον πήχη με το όνομα που διάλεξε τότε. Από την άλλη πλευρά, ο We1less έχει γίνει ένας από τους πιο διάσημους παίκτες μεσαίας λωρίδας στο LPL, επομένως ίσως και να μην το έκανε κατά τύχη. Η διαδρομή του ήταν πολύ δύσκολη, αλλά όλα δείχνουν ότι ο We1less κοντεύει να φτάσει στον προορισμό του.</p>\n\n<p>Μια φορά κι έναν καιρό, ο We1less ήταν ο οργανωτής των Vici Gaming. Έπαιζε με πολύ εγωιστικό τρόπο και, όταν έβλεπε μια ευκαιρία να χωθεί στη δράση, ποτέ δεν την άφηνε να πάει χαμένη. Προφανώς, αυτή η στρατηγική δεν είχε πάντα καλή κατάληξη για αυτόν και για την ομάδα του. Τώρα, όμως, ο We1less παίζει πολύ πιο ομαδικά και στρατηγικά. Είναι ένας ευέλικτος παίκτης που σκέφτεται πάντα πώς μπορεί να βοηθήσει την ομάδα του και όχι πώς μπορεί να βοηθήσει αυτόν η ομάδα.</p>\n\n<p>Παρόλο που ο We1less δυσκολεύτηκε αρκετά να βρει το ρυθμό του στο 2016 λόγω ενός πολύ επίμονου τραυματισμού, έδειξε πολύ καλά τι μπορεί να κάνει στο τέλος του Summer Split. Σε μια σειρά αγώνων όπου πέτυχε εξωπραγματικές επιδόσεις, ο We1less έδειξε σε όλους πόσο ψηλά μπορεί να φτάσει. Αυτές οι θεαματικές του εκλάμψεις γοήτευσαν το κοινό που τον έστειλε στο Τουρνουά All-Star 2016. Είναι πάντα έτοιμος για μια μεγάλη κίνηση και, αν κρίνουμε από τις προηγούμενες εμφανίσεις του, θα δούμε πολλά ξόρκια στο παιχνίδι, συχνά και από νωρίς. </p>","hu_HU":"<p>Wei „We1less” Zhen, korábbi nevén GODV, elég magasra tette a lécet a korábbi neve megválasztásával. De mivel We1less lett az LPL egyik legfelkapottabb középső ösvényese, valószínűleg már akkor is tudta, hogy mi a dörgés. Nem volt egyszerű az út, de úgy tűnik, hogy We1less révbe érhet.</p>\n\n<p>We1less régebben a Vici Gaming irányítója volt. Önzően játszott, és ha meglátott egy lehetőséget, azonnal lecsapott rá. Ez a „stratégia” nyilván nem mindig volt előnyös a csapata számára. Mára We1less sokkal számítóbb és csapatközpontúbb lett. Dinamikus játékos, aki mindig azt nézi, hogyan segítheti a csapatát, és nem fordítva.</p>\n\nWe1less nehezen tudott belevágni a 2016-os évbe egy zavaró sérülés miatt, de a nyári szakasz végén ismét megcsillogtatta játéktudását. We1less elképesztő statisztikákat produkált, jelezve, hogy a határ számára a csillagos ég. Ezek a felvillanások is meggyőzték a rajongókat, hogy ott a helye a 2016-os All-Star gálán Barcelonában. Mindig ott van benne egy látványos akció esélye, és ha a korábbiak alapján kellene tippelni, akkor hamar el fog szabadulni a pokol a Szurdokban. \n","it_IT":"<p>Wei \"We1less\" Zhen, già noto come GODZ, ha scelto per se stesso un nome pieno di aspettative. E a quanto pare sapeva cosa stava facendo, visto che è riuscito a diventare uno dei centrali più apprezzati della LPL. Il suo viaggio non è stato dei più semplici, ma a quanto pare sta per arrivare alla sua meta.</p>\n\nIn passato We1less ha fatto il regista in Vici Gaming. Il suo stile era molto egoistico e sfruttava ogni occasione per tuffarsi all'attacco. Ovviamente, quella strategia non funzionava sempre. Ora però We1less è diventato più riflessivo e aperto al gioco di squadra. È un giocatore dinamico, sempre intento a pensare a come aiutare il proprio team, invece che usare il supporto della squadra a suo beneficio.</p>\n\nPur avendo avuto difficoltà ad affacciarsi sulla Landa nel 2016 a causa di un infortunio, il suo grande potenziale è stato sotto gli occhi di tutti verso la fine del Summer Split. Con le sue cifre da capogiro, We1less ci ha dimostrato di non avere limiti. Le sue brillanti giocate hanno abbagliato i fan, che hanno votato per la sua presenza all'All-Star 2016 di Barcellona. We1less ha un potenziale incredibile, e a giudicare dalle sue prestazioni passate vedremo qualcosa di straordinario. \n","ro_RO":"Wei ''We1less'' Zhen, cunoscut în trecut ca GODV, și-a stabilit un standard destul de înalt când și-a ales vechiul nume. Dar, având în vedere că a devenit unul dintre cei mai titrați jucători de pe culoarul din mijloc din LPL, poate că era conștient de ceea ce face. Drumul său a fost unul cu suișuri și coborâșuri, dar se pare că We1less e în sfârșit aproape de destinație.</p>\n\nDemult, We1less era playmaker la Vici Gaming. Era un jucător egoist; dacă vedea o oportunitate de a se arunca în luptă, de obicei profita de ea. Evident, acea strategie n-a fost întotdeauna strălucită, nici pentru el și nici pentru Vici. Acum, însă, We1less este mai calculat și mai atent la interesele echipei. E un jucător dinamic, care se gândește mereu cum își poate ajuta coechipierii, în loc să se gândească cum îl pot ajuta ei pe el.</p>\n\nChiar dacă We1less nu a putut intra în Rift în 2016 din cauza unei accidentări, potențialul său de a crea situații favorabile a ajuns în lumina reflectoarelor spre finalul etapei de vară. Reușind niște scoruri incredibile, We1less ne-a arătat cât de bun este cu adevărat. Reușitele sale impresionante i-au uimit pe fani, care l-au votat la All-Star Event 2016 din Barcelona. Are un potențial uriaș de a crea faze spectaculoase și, dacă e să ne luăm după reușitele sale din trecut, va lansa vrăji des, încă de la început. \n","es_AR":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>","es_MX":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>"},"foreignIds":{"drupalId":"4529","TRLH3":"1001360058","TRLH4":"1001310058"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":707,"slug":"skye","name":"Skye","firstName":"Qi-Fang","lastName":"Fan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/skye-8gfzbr83.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-06T23:57:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3771"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":998,"slug":"jinoo","name":"Jinoo","firstName":"Jin-woo","lastName":"Lim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jinoo-53memnp9.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:32:05.000Z","updatedAt":"2016-02-01T22:57:58.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1283,"slug":"happyy","name":"Happy","firstName":"Rui","lastName":"Yu","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:34:16.000Z","updatedAt":"2017-01-09T23:01:46.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1431,"slug":"intruder","name":"Intruder","firstName":"Sheng","lastName":"Tang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/intruder-3ffozme5.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:35:52.000Z","updatedAt":"2016-08-24T21:36:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1648,"slug":"lwx","name":"Lwx","firstName":"Weixiang","lastName":"Lin","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:53:31.000Z","updatedAt":"2017-01-09T22:53:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1651,"slug":"pinus","name":"Pinus","firstName":"Qingsong","lastName":"Liu","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:02:32.000Z","updatedAt":"2017-01-09T23:02:32.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1986,"slug":"hanxuan","name":"HanXuan","firstName":"Hao","lastName":"Hong","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:53:06.000Z","updatedAt":"2017-06-06T23:53:06.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77}],"scheduleItems":[{"id":"AVx_hVwyoUG4HPFjOKVu","content":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:match:3a901144-a90f-44eb-8df8-2e496e40a0e6","scheduledTime":"2017-06-23T09:00:00.968+0000","tags":{"blockLabel":"3","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:bracket:5d823363-727b-4535-ad6e-da59fefde9f6","leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06"},"match":"3a901144-a90f-44eb-8df8-2e496e40a0e6","tournament":"465a2d10-2a73-43cb-a627-f0c87b564f06","bracket":"5d823363-727b-4535-ad6e-da59fefde9f6","league":"7"}],"gameIdMappings":[],"videos":[{"id":7495,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:5476d26f-bd86-4397-b389-178cdb8676a2","source":"https://www.youtube.com/embed/lGpqoLjoL7g?wmode=transparent&start=4080&rel=0","createdAt":"2017-06-23T21:17:34.000Z","updatedAt":"2017-06-23T21:17:34.000Z","game":"5476d26f-bd86-4397-b389-178cdb8676a2"},{"id":7496,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:86ef3b94-5788-4f8f-a945-ecbbd2270a6e","source":"https://www.youtube.com/embed/lGpqoLjoL7g?wmode=transparent&start=7021&rel=0","createdAt":"2017-06-23T21:10:37.000Z","updatedAt":"2017-06-23T21:10:37.000Z","game":"86ef3b94-5788-4f8f-a945-ecbbd2270a6e"},{"id":7497,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:34ec136d-0184-4ef7-85b5-a1b0c4def968","source":"https://www.youtube.com/embed/lGpqoLjoL7g?wmode=transparent&start=9917&rel=0","createdAt":"2017-06-23T21:11:09.000Z","updatedAt":"2017-06-23T21:11:09.000Z","game":"34ec136d-0184-4ef7-85b5-a1b0c4def968"}],"htmlBlocks":[],"match":{"id":"3a901144-a90f-44eb-8df8-2e496e40a0e6","name":"LGD-vs-NB","position":14,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"games":{"34ec136d-0184-4ef7-85b5-a1b0c4def968":{"id":"34ec136d-0184-4ef7-85b5-a1b0c4def968","name":"G3","generatedName":"LGD|NB|G3|3a901144a90f44eb8df8","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498252582216,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498241856962,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"86ef3b94-5788-4f8f-a945-ecbbd2270a6e":{"id":"86ef3b94-5788-4f8f-a945-ecbbd2270a6e","name":"G2","generatedName":"LGD|NB|G2|3a901144a90f44eb8df8","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1498252550376,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1498241853953,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5476d26f-bd86-4397-b389-178cdb8676a2":{"id":"5476d26f-bd86-4397-b389-178cdb8676a2","name":"G1","generatedName":"LGD|NB|G1|3a901144a90f44eb8df8","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"},{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}],"standings":{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498252530847,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498241848795,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498252582227,"source":"bestOf","history":[{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498252550376,"source":"bestOf","closed":true},{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498252530847,"source":"bestOf","closed":true},{"result":[[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],[{"roster":"813380bd-73f8-430d-87ec-3df4ea74cef8"}]],"timestamp":1498241856964,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"2c2e0afa-c947-4225-8d4b-7100711447d7":1,"813380bd-73f8-430d-87ec-3df4ea74cef8":0}}}