{"teams":[{"id":97,"slug":"splyce","name":"Splyce","guid":"be6e1a6a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/splyce-gyo3tr9y.png","acronym":"SPY","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-08-08T09:39:46.000Z","bios":{"en_US":"<p>Splyce started from the bottom. Now they’re here, one of the best teams in Europe. Formerly Team Dignitas EU, Splyce made their debut in the 2016 EU LCS Spring Split and immediately struggled. The young team banded together in the Summer Promotion Tournament, and the very next split took second place in the regular season and earned a spot a Worlds though the Regional Qualifiers.</p>\n\n<p>Like their rivals G2, Splyce played poorly at Worlds. But with the same five members returning for 2017, they’re poised to once again dominate the EU LCS. If there’s any team in the league that knows how to deal with failure and come out on top, it’s Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","pl_PL":"<p>Splyce było na wiosnę 2016 drugą, obok G2 Esports, drużyną, dla której udział w tamtym Splicie był debiutem w LCS-owej stawce. W pełni duński skład awans do elitarnych rozgrywek wywalczył, zwyciężając w letnim splicie europejskiego Challenger Series (EU CS) 2015.</p>\n<p>Historia ekipy jest dość skromna i jej początki sięgają wiosennej edycji rywalizacji w EU CS w 2015 roku. Wtedy to drużynę SK Gaming Prime przejął Team Dignitas EU. W składzie doszło do trzech zmian, które w efekcie sprawiły, że DIG EU od tej pory stało się zespołem jednonarodowościowym – złożonym wyłącznie z Duńczyków. Obiecujący skład miał trudne początki i na wiosnę ledwo co zakwalifikował się do play-offów Challenger Series, w których, co ciekawe, ostatecznie nie wystąpił. Wszystkiemu winne były ograniczenia wiekowe w LCS, których nie spełniała wtedy dwójka zawodników formacji – Martin „Wunderwear” Hansen oraz Chres „Sencux”Laursen. Wobec tego ówczesne DIG EU zmuszone było do gry o uzyskanie ponownej kwalifikacji do EU CS na split letni.</p>\n<p>Od tej pory wszystko szło już jednak znacznie sprawniej i zespół bez problemu znów dostał się do Challenger Series, by następnie bez problemu zakwalifikować się do play-offów i tam pokonać wszystkich rywali, zapewniając sobie awans do LCS na wiosenną edycję w 2016 roku. Warto jednak zauważyć, że triumf ex-Dignitas EU nie należał do przekonujących. Niemniej ekipa ta jest ciekawą mieszanką talentu i młodości (Sencux, Wunderwear) z rutyną i doświadczeniem (Nicolai „Nisbeth” Nisbeth, Jonas „Trashy” Andersen). Ponadto atutem formacji jest oczywiście możliwość komunikacji w rodzimym języku.</p>\n<p>Ostatecznie beniaminek zmagań przystępuje do rywalizacji w zmienionych barwach. Zawodnicy zamienili trykoty Team Dignitas EU na koszulki nowej organizacji - Follow eSports, które ostatecznie przekształciło się w Splyce. W międzyczasie, przed startem wiosennego splitu EU LCS 2016, ekipa nie uniknęła również zmian w składzie, a konkretnie jednej. Dotychczasowego dżunglera, Dennisa \"Obviousa\" Sørensena, który opuścił formację 29 października 2015 roku, dwa tygodnie później zastąpił wracający z Ameryki Jonas \"Trashy\" Andersen. Warto dodać, że Splyce było wtedy dopiero siódmym zespołem w historii LCS złożonym wyłącznie z graczy jednej narodowości i drugim w pełni duńskim.</p>\n<p>Wiosenny split nie spełnił jednak oczekiwań kibiców Splyce ani samej formacji. Drużyna od samego początku zmagań utknęła na dole tabeli i ostatecznie zajęła niskie, ósme miejsce, które sprawiło, że Splyce zmuszone zostało do walki w turnieju barażowym o utrzymanie w stawce. Tam, chociaż nie bez problemów, zespół na szczęście pokonał jednak GIANTS Gaming wynikiem 3-2 i zagwarantował sobie miejsce w EU LCS na letnim split. W składzie drużyny doszło tylko do jednej zmiany – zawodzącego wspierającego Nicolaia „Nisbetha” Nisbetha zastąpił młody i utalentowany słoweński support Mihael „Mikyx” Mehle. Splyce przystąpiło do rywalizacji z nadziejami na awans do play-offów, chociaż eksperci po raz kolejni nie dawali bardzo młodej drużynie dużych szans na osiągnięcie takiego wyniku.</p>\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>\n","es_ES":"<p>Splyce (anteriormente llamado Team Dignitas EU) hicieron su debut en la LCS EU durante el split  de primavera de 2016, y tuvieron un duro comienzo para adaptarse al nivel de la LCS. Como resultado, el equipo tuvo que luchar en el Summer Promotion Tournament, en el que superaron a Giants Gaming en un apasionante enfrentamiento al mejor de cinco y se aseguraron llegar a la LCS EU. Splyce tuvo un exitoso split de verano que le posicionaría en segundo lugar, nada que ver con el de primavera, en el que casi quedaron eliminados. Ahora que han superado los baches de la competición europea, el joven equipo rebosa confianza de camino al Campeonato Mundial 2016. Es hora de demostrarle al mundo que el split de verano no fue suerte sino que Splyce ha llegado para quedarse.</p>\n<p>Entrenador: Hans Christian \"Liq\" Duerr</p>","de_DE":"<p>Splyce fing ganz unten an. Doch heute gehören sie zu den besten Mannschaften Europas. Splyce, ehemals Team Dignitas EU, gab sein Debüt beim Frühjahrs-Split der EU LCS 2016 und hatte sofort Probleme. Doch die junge Mannschaft fand im Sommer-Aufstiegsturnier zueinander, woraufhin sie bereits den nächsten Split auf Platz Zwei beendeten und sich in der regionalen Qualifikationsrunde für die Weltmeisterschaft qualifizieren konnten.</p>\n\n<p>Genau wie ihre Rivalen G2 spielte auch Splyce bei der Weltmeisterschaft schwach. Aber da sich ihre Aufstellung für die Saison 2017 nicht geändert hat, sind sie bereit, die EU LCS erneut zu dominieren. Wenn es in der Liga eine Mannschaft gibt, die weiß, wie man mit Fehlschlägen umgeht und sich wieder an die Spitze kämpft, dann ist das Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","fr_FR":"<p>Nouveaux arrivants en LCS EU, Splyce a racheté cette année la place et l'effectif de Dignitas EU après la qualification de ces derniers en LCS.</p>\n\n<p>L'équipe a d'abord été connue sous le nom de Follow Esports, un site qui se présente comme le « programme télé de l'esport », mais tant le site que l'équipe LCS ont rapidement changé de nom au profit de l'actuel. Peu après l'achat le cofondateur du site a déclaré être très satisfait de son investissement dans League of Legends puisque cela les plaçait dans une « ligue aussi excitante que professionnelle, que ce soit au niveau de l'organisation, des joueurs ou des fans ». Reste à voir quelle place Splyce va occuper dans ces LCS auxquels l'organisation est aussi heureuse d'être associée. Pour la jeune entreprise basée aux Etats-Unis, elle n'a été créée qu'en avril 2015, les LCS sont à coup sur la garantie d'une exposition médiatique plus importante mais qu'en est-il de leurs ambitions sportives ? </p>\n\n<p>L'équipe a un avantage certain, l'absence de la barrière de la langue. En effet l'équipe est entièrement composée de joueurs danois, ce qui facilitera forcément la communication en jeu. Malgré tout, avec un effectif jeune et prometteur mais qui manque cruellement d'expérience, Splyce a un besoin criant d'un encadrement de bonne qualité pour concurrencer des adversaires qui ne leur feront pas de cadeau. L'entreprise semble néanmoins avoir bien cerné ce besoin puisqu'ils ont recruté Jakob « YamatoCannon » Mebdi, ancien entraîneur de Roccat, comme entraîneur et Chris Ehrenreich, ancien entraîneur de CLG en LCS NA, pour l'assister dans la mise en place d'un environnement de travail performant. </p>\n\n<p>Pas sur que cela suffise pour tutoyer les sommets des LCS dès le printemps 2016, mais les joueurs, confrontés au plus haut niveau européen, devraient à tout le moins progresser rapidement tant au niveau individuel qu'en tant qu'équipe. C'est tout le mal qu'on leur souhaite !</p>\n\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>","es_AR":"<p>Splyce (antiguamente llamado Team Dignitas EU) hizo su debut en la LCS EU durante el torneo de clausura del 2016 y pudo experimentar la agresividad del alto nivel de juego que allí se presenta. De esta forma, el equipo tuvo que luchar para salir del torneo de promoción de verano, en el que vencieron a Giants Gaming en un emocionante combate al mejor de cinco para conseguir un pase a la LCS EU. Splyce tuvo un exitoso torneo de clausura en el que consiguieron un segundo lugar, algo totalmente inesperado luego del descenso que sufrieron en primavera. Luego de haber arrasado en la competencia del Guantelete europeo, el joven equipo rebosa de confianza para encarar el Campeonato Mundial 2016. Es hora de mostrarle al mundo que el torneo de clausura no fue una casualidad, y que Splyce ha llegado para quedarse.</p>\n\n<p><strong>Entrenador: Jakob \"YamatoCannon\" Mebdi</strong></p>","pt_BR":"A equipe da Splyce (antiga Team Dignitas EU) fez sua estreia na EU LCS durante a Etapa de Primavera 2016 e teve um choque de realidade com o calibre de jogo da LCS. Como resultado, a equipe teve que passar pelo Torneio de Promoção de Verão, onde conseguiram derrotar a Giants Gaming em uma emocionante melhor de 5, ganhando seus ingressos de volta para a EU LCS. A Splyce então teve uma explosão de sucesso na Etapa de Verão, conseguindo o segundo lugar - um sucesso e tanto depois de sua quase relegação na Etapa de Primavera. Agora que a equipe despachou a competição no cenário europeu, todos estão transbordando de confiança para o Campeonato Mundial 2016. Está na hora de mostrar para o mundo que a Etapa de Verão não foi mera sorte e que a Splyce chegou para ficar.","en_GB":""},"foreignIds":{"drupalId":"4032"},"players":[232,336,387,588,663,954,1771],"starters":[232,336,387,588,954],"subs":[663,1771]},{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]}],"players":[{"id":232,"slug":"trashy","name":"Trashy","firstName":"Jonas ","lastName":"Andersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trashy-epw5lsut.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:40:20.000Z","bios":{"en_US":"<p>Jonas “Trashy” Anderson spent years jumping between teams until everything finally clicked with Splyce. A jungler with a wealth of experience, Trashy even spent time in the NA LCS for Enemy eSports. When he found a home on Splyce, it wasn’t long before he became a top jungler in the EU LCS.</p>\n\n<p>It will take more than a disappointing performance at the 2016 World Championship to stop this jungler from improving. At the helm of what is still a young team, Trashy is poised to take big leaps forward with Splyce in 2017. And if he’s allowed to have his way in the jungler, he’ll be taking the rest of the EU LCS out with the rest of the garbage.</p>","de_DE":"<p>Jonas „Trashy“ Anderson hat immer wieder die Mannschaft gewechselt, bis er endlich bei Splyce landete. Trashy ist ein Jungler mit viel Erfahrung, der eine Zeit lang sogar bei Enemy eSports in der NA LCS spielte. Nachdem er bei Splyce ein neues Zuhause gefunden hatte, dauerte es nicht lange, bis er zu einem der besten Jungler der EU LCS wurde.\n\nEs braucht mehr als eine enttäuschende Vorstellung bei der Weltmeisterschaft 2016, um diesen Jungler daran zu hindern, immer besser zu werden. Trashy ist am Ruder dieser jungen Mannschaft und bereit, mit Splyce 2017 große Sprünge zu machen. Und wenn er im Dschungel ungestört tun und lassen kann, was er will, wird er die anderen Mannschaften in der EU LCS zusammen mit dem Müll entsorgen.</p>","fr_FR":"<p>Jonas « Trashy » Andersen est à la fois le petit nouveau de chez Splyce et l'un des deux seuls de son équipe à avoir déjà fait l'expérience des LCS avant cette année. </p>\n\n<p>Le jungler danois a en effet pris part au segment de printemps des LCS NA en 2015 au sein de l'équipe Enemy eSports. Comme son compatriote Lucas « Santorin » Tao Kilmer Larsen avant lui, Trashy a en effet pris le risque de traverser l'atlantique pour y rejoindre une équipe semi-professionnelle et tenter de devenir joueur professionnel en Amérique du Nord. Après une qualification relativement aisée pour les Challenger Series, son équipe et lui ont entrepris une domination sans partage sur l'antichambre des LCS. Ils n'ont perdu en tout et pour tout qu'un seul match de la saison régulière, face à Team Fusion, eux-même favoris pour la qualification en LCS ! C'est logiquement que Enemy a ensuite dominé les play-off pour empocher la qualification automatique pour le segment d'été des LCS NA. </p>\n\n<p>Malheureusement pour Trashy et les siens, la suite de l'histoire n'a pas été aussi rose, loin de là. Pas suffisamment préparée au niveau d'exigence et de jeu nécessaire au plus haut niveau nord-américain, l'équipe a enchaîné défaite sur défaite. Incapables de hausser leur niveau de jeu, les Enemy ont terminé leur saison à une piteuse 9ème place. Pire, ils ont bu le calice jusqu'à la lie en se faisant éliminer 3 victoires à rien par Team Coast lors du tounoi de relégation. </p>\n\n<p>Une expérience difficile à vivre pour un joueur qui a bien cru que sa carrière allait se terminer là, alors même qu'il était sans doute le meilleur joueur de son ancienne équipe. Il avoue lui même avoir été « surpris » quand Splyce a pris contact avec lui malgré sa récente élimination des LCS NA. Un contact bienheureux pour le joueur donc, un contact remotivant aussi. Trashy a repris espoir et pense aujourd'hui que « jouer avec quatre autres danois est la bonne décision » pour sa carrière et que Splyce « va surprendre beaucoup de monde » en 2016, comme il l'a affirmé au DailyDot. </p>\n\n<p>Quoiqu'il en soit, avec des joueurs prometteurs à ses côtés, Trashy a à présent toutes les armes en main pour réussir. </p>","es_ES":"<p>Jonas ''Trashy'' Andersen llega desde Dinamarca cargado de experiencia. Jugó en equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, además de participar en la LCS NA con Enemy eSports. Pero Trashy no tardaría en echar de menos su casa, así que volvió a la LCS EU al final de 2015 y se unió a Splyce.</p>\n\n<p>Tras probar por primera vez la alta esfera competitiva europea en el split de primavera de la LCS EU 2016, Trashy subió el listón del split y se convirtió en uno de los mejores junglas de Europa. Sus mejoras ayudaron a que Splyce obtuviese el segundo puesto en la temporada regular, y una gran clasificación en el Clasificatorio Regional de la LCS EU. Trashy lidera un equipo que está dispuesto a llegar al cielo. ¿Conseguirán los equipos de alto nivel del Campeonato Mundial 2016 traer a Trashy y a Splyce de vuelta a la tierra, o el joven equipo nos sorprenderá a todos? Pronto lo descubriremos.</p>","pl_PL":"<p>Trashy jest najnowszym nabytkiem formacji (dołączył do drużyny 16 listopada 2015 roku) I jednocześnie najbardziej doświadczonym graczem w zespole. Duński dżungler na profesjonalnej scenie znajduje się już od 2012 roku i w tym trakcie swojej kariery miał okazję występować w składach takich drużyn jak Tricked eSports, Reason Gaming, Cloud 9 Eclipse czy SK Gaming Prime. W tym czasie Trashy występował głównie w Challenger Series, ale próby dostania do EU LCS kończyły się porażką zarówno w przypadku Reason Gaming, jak i SK Gaming Prime. Duńczykowi udało się awansować do najwyższej klasy rozgrywkowej (letni split NA LCS 2015) dopiero z amerykańskim Enemy eSports, choć formacja długa wahała się czy zatrudnić duńskiego leśnika. Co ciekawe, ostatecznie zarząd przekonała deklaracja Trashy’ego, że.. zapłaci za lot z własnej kieszeni, tylko po to, by móc wziąć udział w testach, które organizował zespół. </p>\n<p>\nNiestety amerykańska przygoda Duńczyka zakończyła się na dwóch splitach występów, w tym zaledwie jednym spędzonym w NA LCS i jednym w NA Challenger Series. Jednak w tym czasie duński zawodnik dał się poznać jako jeden z najmocniejszych punktów NME – w większości klasyfikacji indywidualnych znalazł się w pierwszej piątce wśród dżunglerów tamtejszych rozgrywek, a jeśli chodzi o procentowy udział w zabójstwach oraz najmniejszą ilość śmierci udało mu się nawet wskoczyć na podium. Teraz powrócił do Europy skuszony ofertą Splyce i w sumie ciężko się dziwić, że wybór FE padł właśnie na niego. Zespół szukający duńskiego dżunglera nie mógł bowiem trafić lepiej (no może z wyjątkiem Dennisa \"Svenskerena\" Johnsena, który miał jednak inne plany, bowiem dołączył do Teamu SoloMid). </p>\n<p>\nTrashy w trakcie swojej kariery dał się poznać jako znakomity gracz Elise oraz Rengara, choć w letniej edycji NA LCS 2015 najczęściej wybierał Rek’sai oraz Gragasa ze względu na siłę tych postaci. Ciekawostką może być fakt, że Thrashy bardzo dobrze zna się z innym duńskim dżunglerem, który występował w Ameryce – Lucasem \"Santorinem\" Tao Kilmer Larsenem.</p>\n<p>\n„Jestem bardzo zadowolony z dołączenia do byłego DIG EU, teraz Follow eSports… Byłem nieco zaskoczony, kiedy drużyna ta skontaktowała się ze mną po fiasku meczów barażowych w barwach mojego byłego zespołu, NME. Jednak nie mam wątpliwości, że dołączenie do tych czterech duńskich facetów jest właściwą decyzją.” – powiedział Trashy w wywiadzie dla portalu Daily.dot.</p>\n<p>\nZadowolenie Trashy’ego nie może dziwić. Wszak przyznał wcześniej w żartach, że uważa Duńczyków za… Koreańczyków Europy. A tutaj ma ich pod dostatkiem!\n</p>","es_AR":"<p>Oriundo de Dinamarca, Jonas \"Trashy\" Anderson tiene una vasta experiencia. Ha jugado para equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, sin mencionar su paso por la LCS NA con Enemy eSports. Sin embargo, no pasó mucho para que Trashy comience a echar de menos su hogar. Regresó a la LCS EU a finales del 2015 para unirse a la nueva formación de Splyce.</p>\n\n<p>Después de tener su primera experiencia en la competencia europea de primer nivel en el torneo de apertura de la LCS EU 2016, Trashy se esforzó aún más en el torneo de clausura, hasta llegar a ser uno de los mejores jungleros de Europa. Su mejora sirvió para que Splyce llegara al segundo lugar en la temporada regular y tuviera una excelente actuación en la clasificatoria regional de la LCS EU. Trashy dirige el timón de un equipo que va derecho a las nubes. ¿Lograrán los equipos de primer nivel del Campeonato Mundial 2016 enviar a Trashy y Splyce de regreso a la tierra? ¿O acaso el joven equipo conseguirá sorprendernos a todos? Estamos a punto de descubrirlo.</p>"},"foreignIds":{"drupalId":"1409","TRLH4":"200000207","TRLH3":"200000104"},"socialNetworks":{"twitch":"twitch.tv/trashylol","facebook":"facebook.com/Trashylol","twitter":"twitter.com/SPY_Trashy"},"champions":[],"liveGameTeam":97},{"id":336,"slug":"sencux","name":"Sencux","firstName":"Chres","lastName":"Laursen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sencux-efit8ngk.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:50.000Z","updatedAt":"2017-06-09T10:40:39.000Z","bios":{"en_US":"<p>Chres “Sencux” Larsen has the makings of Europe’s next mid lane star. He made his way to Splyce after honing his skills in the Challenger scene. Sencux showed flashes of brilliance early in the 2016 EU LCS Spring Split, and in the Summer took the next step to rival the best mid laners in the league.</p>\n\n<p>At the 2016 World Championship, Sencux couldn’t quite keep up with the best mid laners in the world. But as he returns to the EU LCS with the rest of Splyce for 2017, his time on the international stage should prove to be an invaluable experience. If he can keep up his blazing pace of improvement, it won’t be long at all before he gets another shot at the world’s finest.</p>","de_DE":"<p>Chres „Sencux“ Larsen hat das Zeug zu Europas nächstem großen Star auf der mittleren Lane. Er kam zu Splyce, nachdem er sein Können in der Herausforderer-Szene perfektioniert hatte. Sencux ließ sein Können bereits zu Beginn des Frühjahrs-Splits der EU LCS 2016 aufblitzen und machte im Sommer den nächsten Schritt, um es mit den besten Mid-Lanern der Liga aufzunehmen.\n\nBei der Weltmeisterschaft 2016 konnte Sencux jedoch nicht ganz mit den besten Mid-Lanern der Welt mithalten. Aber wenn er mit dem Rest von Splyce 2017 in die EU LCS zurückkehrt, sollten sich seine Erfahrungen auf der internationalen Bühne bezahlt machen. Wenn er sich weiterhin steigern kann, wir es nicht lange dauern, bis er es wieder mit den Besten der Welt zu tun bekommt.</p>","fr_FR":"<p>Chres « Sencux » Laursen a tout juste 17 ans, joue à League of Legends depuis 4 ans et gravite dans le milieu compétitif depuis 2014. Après une première expérience chez Reason Gaming, il s'apprête à présent à découvrir les LCS accompagné d’une réputation flatteuse. </p>\n\n<p>La plupart des observateurs considèrent que le danois est, avec Luka « PerkZ » Perković de chez G2 Esports, le porte-drapeau d'une nouvelle génération de midlaners européens. Un héritage pas forcément facile à porter ! Sous les couleurs de Splyce, le joueur va en tout cas devoir le défendre face à ceux qui ont porté ce titre avant lui, à l'instar de Fabian « Febiven » Diepstraten. Y est-il prêt ? Pour être honnête et au vu de ce qu'il a montré en Challenger Series, Sencux est sans doute encore un peu tendre. Contrairement à Febiven l'an dernier, il est peu probable que le midlaner de Splyce gagne systématiquement la voie du milieu en 1v1 face à ses adversaires plus expérimentés. Sa prise de décision, particulièrement, est parfois douteuse. Malgré tout le jeune midlaner n'est pas en dessous du niveau attendu en LCS, bien au contraire. Son niveau individuel est même certainement déjà supérieur à celui de certains joueurs LCS. Il lui manque juste quelques ajustements à faire pour atteindre les sommets, mais il a à coup sur le talent nécessaire pour y parvenir. </p>\n\n<p>Il va pouvoir s'appuyer pour cela sur son style de jeu, tout en contrôle. Sur sa confiance en son jeu aussi, lui qui déclarait avant même le segment d'été des Challenger Series : « si Febiven peut passer de challenger à l'un des meilleurs midlaners, pourquoi est-ce que moi je ne pourrais pas faire de même ? » Comme dirait l'autre, y a plus qu'à !</p>","es_ES":"<p>Chres ''Sencux'' Laursen es uno de los jugadores titulares más jóvenes de la LCS EU. AspiranteTras jugar en varios equipos aspirantes diferentes, Sencux llegó a Splyce (anteriormente llamado Team Dignitas EU) y logró hacerse con un puesto en la LCS EU. Su rol en la calle central consiste fundamentalmente en debilitar constantemente a sus oponentes para controlar las batallas de equipo y los objetivos del mapa.</p>\n\n<p>Tras demostrar unas jugadas brillantes en el split de primavera de la LCS EU 2016 (como el asesinato cuádruple con LeBlanc), los espectadores y analistas se preguntaban si tiene lo que hace falta para convertirse la próxima estrella europea de la calle central. Sencux calló las voces de los escépticos y consiguió obtener con Splyce el segundo puesto en el split de verano de la LCS EU 2016 y, por consiguiente, superar la escena europea y asegurarse un puesto en el Mundial. Aunque Sencux sea capaz de lanzar hechizos a los mejores mid de Europa, la escena internacional es completamente diferente. La mayor prueba de Sencux está aún por llegar, y será una batalla a vida o muerte en la Grieta contra los mejores jugadores de League of Legends.</p>","pl_PL":"<p>Sencux to niekwestionowana gwiazda zespołu I jego najważniejszy zawodnik. To właśnie Chres dzięki swoim niesamowitym umiejętnościom i fantastycznym zagraniom najczęściej prowadzi zespół do zwycięstw. Warto jednak zauważyć, że w momencie startu wiosennego splitu EU LCS 2016 Sencux to będzie nadal bardzo młody, 17-letni zawodnik (jest ledwie pół miesiąca starszy od Wunderweara). Ogromnym problemem Duńczyka, niejako związanym z wiekiem, jest gra pod presją, której zawodnik nie zawsze potrafi sprostać. W tym aspekcie od razu nasuwa się porównanie z holenderskim mid-lanerem, Fabianem \"Febivenem\" Diepstratenem sprzed awansu do LCS z drużyną H2k. </p>\n<p>\nJednocześnie Duńczyk ma już całkiem spore doświadczenie, bowiem występuje na scenie od stycznia 2014 roku, co sprawia, że zaczynał jako zaledwie… piętnastolatek. Jego pierwszym przystankiem na drodze do wielkiej kariery był zespół Reason Gaming, gdzie spotkał Jonasa „Trashy’ego” Andersena. Później, wraz z Kasperem \"Kobbe’m\" Kobberupem oraz Martinem „Wunderwearem” Hansenem występował w 4everzenzyg oraz SK Gaming Prime-Dignitas EU, które w końcu przekształciło się w Follow eSports, a następnie w Splyce. Co ciekawe, Nicolai „Nisbeth” Nisbeth jest jedynym zawodnikiem, z którym Chres, grając w SK-DIG-FE, spotkał się po raz pierwszy. </p>\n<p>\nDuńczyk posiada bardzo szeroki champion pool, ale z pewnością największą uwagę należy zwrócić na jego Azira, Viktora oraz Twisted Fate’a, grę którymi opanował do perfekcji. Swego czasu znany był nawet jako tzw. one-trick-pony Viktora, ale gra w Challenger Series 2015 sprawiła, że obecnie większość rywali najbardziej obawia się jego Azira. Sencux powszechnie uważany jest za wielki talent i wielu znawców sceny zastanawia się nad tym jak młody zawodnik poradzi sobie w walce przeciwko najlepszym mid-lanerom na Starym Kontynencie. Jest to bardzo interesujący problem, bo niestety nawet w ostatnim, udanym dla ex-Dignitas EU splicie dało się zauważyć, że Sencuxowi obok znakomitych gier zdarzają się spotkania bardzo przeciętne i takie wahania formy mają ogromny wpływ na postawę całej drużyny, której duński mid-laner jest ważnym punktem.</p>\n<p>\n„Myślę, że Sencux jest bardzo utalentowany mechanicznie. Gra bardzo dobrze, ale ma tendencję do tiltowania dość szybko, jeśli coś nie idzie po jego myśli.” – powiedział o Sencuxie przed finałem letniego splitu EU CS 2015 jego przeciwnik, Julian \"Xioh\" Dumler (mid-laner drużyny mousesports).</p>\n<p>\nCiekawy jest fakt, że nick gracza początkowo miał brzmieć „Sencu”, ale ten pseudonim był już zajęty w momencie, w którym Duńczyk zakładał swoje konto. Wobec tego najprostszym rozwiązaniem było dodanie „x” do ksywki i właśnie tak powstał obecny nick Sencuxa.\n</p>","es_AR":"<p>Chres \"Sencux\" Laursen es uno de los jugadores más jóvenes de la LCS EU. Después de jugar en varios equipos retadores, Sencux logró llegar a Splyce (anteriormente llamado Team Dignitas EU) y se ganó un lugar en la LCS EU. Su papel en el carril central se basa mucho en realizar ataques rápidos contra los enemigos para controlar los combates en equipo y lograr los objetivos de mapa.</p>\n\n<p>Después de demostrar momentos de gran inspiración en el torneo de apertura de la LCS EU 2016 (como un asesinato cuádruple con LeBlanc), tanto espectadores como analistas se preguntaron si tendría lo que hace falta para convertirse en la próxima estrella europea del carril central. Sencux cerró la boca de todos los que dudaron de él cuando, junto a Splyce, logró el segundo lugar en el torneo de clausura de la LCS EU 2016, seguido de una victoria en el Guantelete europeo, que le garantizó un lugar en el Mundial. Aunque Sencux es capaz de lanzar hechizos con los mejores centrales de Europa, la historia es completamente diferente a nivel internacional. La prueba más difícil de Sencux está por venir, y necesitará de gran determinación al llegar a la Grieta para estar a la altura de lo mejor de lo mejor que League of Legends tiene para ofrecer.</p>"},"foreignIds":{"drupalId":"1425","TRLH3":"200000105","TRLH4":"200000208"},"socialNetworks":{"twitch":"http://www.twitch.tv/sencux","facebook":"facebook.com/Sencux","twitter":"twitter.com/\tSPY_Sencux"},"champions":[],"liveGameTeam":97},{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":387,"slug":"wunderwear","name":"Wunder","firstName":"Martin","lastName":"Hansen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wunderwear-fgro7nyg.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-23T01:17:13.000Z","updatedAt":"2017-06-09T10:41:34.000Z","bios":{"en_US":"<p>Martin “Wunder” Hansen  is a consistent top laner -- consistently aggressive. Even when playing tanks like Nautilus and Maokai, Wunder is more than happy to overextend for a kill. That aggressive playstyle got in him trouble in his rookie split, but he adjusted and became one of the best top laners in the EU LCS.</p>\n\n<p>Wunder struggled against the best top laners in the world at the 2016 World Championship. Back on Splyce in 2017, he’ll have the chance to put what he learned into practice during the regular season. It’s not the first time people have doubted Wunder or Splyce, and Wunder would love nothing more than to silence the haters.</p>","de_DE":"<p>Martin „Wunder“ Hansen ist ein verlässlicher Top-Laner – verlässlich aggressiv. Selbst mit Tanks wie Nautilus und Maokai geht Wunder für eine Tötung gerne mal etwas mehr Risiko ein. Dieser aggressive Spielstil bereitete ihm in seinem ersten Split große Probleme, doch er passte sich an und wurde einer der besten Top-Laner in der EU LCS.\n\nBei der Weltmeisterschaft 2016 hatte Wunder Probleme, mit den besten Top-Lanern der Welt mitzuhalten. 2017 hat er mit Splyce die Gelegenheit, sein neu erlangtes Wissen während der regulären Saison in die Praxis umzusetzen. Es ist nicht das erste Mal, dass die Leute an Wunder oder Splyce gezweifelt haben, und Wunder würde nichts lieber tun, als den Kritikern den Wind aus den Segeln zu nehmen.</p>","fr_FR":"<p>Martin « Wunderwear » Hansen a tout juste 17 ans et s'apprête à découvrir les LCS EU en tant que toplaner de Splyce. Il peut en être d'autant plus fier que, comme la majeure partie de son équipe, il y est parvenu à la seule force de son talent, par le biais de la qualification en Challenger Series, puis en LCS.</p>\n\n<p>Après une première expérience en Challenger Series à l'été 2014 au sein de l'équipe danoise 4everzenzyg, déjà en compagnie de Chres « Sencux » Laursen et Kasper « Kobbe » Kobberup, qui s'est soldée par une défaite en demi-finales des Challenger Series, Wunderwear s'est lancé début 2015 dans la conquête d'une place en LCS. Cela est passé par une qualification en Challenger Series avec sa nouvelle équipe, SK Prime, au détriment de l'équipe française Thunderbot Sparta. La qualification en poche l'équipe, rachetée et renommée Dignitas EU entre temps, a terminé à la 4ème place du segment de printemps et... n'a pas pris part aux play-off ! En effet ni Sencux ni Wunderwear n'avaient atteint leurs 17 ans à ce moment. Sure de la force de ses jeunes joueurs, l'équipe a alors préféré faire l'impasse sur les play-off et sur une possible participation au tournoi de promotion et attendre le segment d'été tranquillement. </p>\n\n<p>Wunderwear a bien rendu la confiance qui lui a été ainsi accordée et a été une part importante de la réussite de son équipe lors du segment d'été, terminé avec 8 victoires et seulement 2 défaites. Terminé surtout avec une qualification en LCS après deux victoires étriquées en play-off contre Denial Esports et Mousesports. </p>\n\n<p>A présent le jeune toplaner danois s'apprête à vivre sa première saison au plus haut niveau européen et à réaliser que son parcours de l'an dernier n'a été, in fine, qu'une longue introduction. De ce qu'il a montré l'an dernier, il est encore un peu tendre pour faire face à quelqu'un comme Paul « SoaZ » Boyer mais a largement le potentiel pour combler ses lacunes d'ici à la fin du segment de printemps. A condition, bien sur, de ne pas se relâcher !</p>\n","es_ES":"<p>Martin ''Wunder'' Hansen es constante en la calle superior. Constantemente agresivo. Incluso cuando juega con tanques como Nautilus o Maokai, Wunder está encantado de arriesgarse por un asesinato. Sus jugadas le hicieron conseguir una A/M/A de 5,2 puntos en el split de verano de la Challenger Series europea. Aun así, su estilo de juego agresivo tuvo resultados variados en el primer split de la LCS EU. Con demasiada frecuencia, traspasó el límite entre una agresividad calculada y una jugada demasiado arriesgada.</p>\n\n<p>Aprendió la lección, y en el split de verano de la LCS EU 2016, Wunder y Splyce eran de lo mejor que Europa tenía que ofrecer. El crecimiento era innegable, y Wunder se convirtió en una amenaza que había que aniquilar para evitar que llevase a su equipo directo a la victoria. Puede que Wunder destaque en Europa, pero enfrentarse a jugadores de la calle superior colosales como Smeb, Duke o Looper será un reto a superar. Nadie creía antes en Wunder ni en Splyce, y nada le gustaría más que volver a silenciar a los escépticos.</p>","pl_PL":"<p>Duński, zaledwie 17-letni top-laner jest najmłodszym zawodnikiem w LCS. Dość powiedzieć, że wymagane do udziału w tych rozgrywkach siedemnaście wiosen skończył dopiero w listopadzie 2015 roku. Na profesjonalnej scenie po raz pierwszy usłyszano o nim w czerwcu 2014 roku, kiedy dołączył do 4everzenzyg wraz z… Chresem „Sencuxem” Larsenem i Kasperem „Kobbe’m” Kobberuppem, obecnymi kolegami z drużyny. Jednak dopiero przeniesienie się do SK Gaming Prime (później Team Dignitas EU), gdzie dalej występował razem z Sencuxem, sprawiło, że kariera młodego Duńczyka nabrała rozpędu. Pierwszych występów w Challenger Series, już pod banderą organizacji Dignitas, Wunderwear nie może zaliczyć do udanych. Wielu ekspertów uważało, że był w tym czasie jednym z najsłabszych ogniw zespołu i nie do końca radził sobie z presją, która towarzyszyła zmaganiom na tym poziomie. Niemniej w ciągu dwóch splitów zmagań w EU CS zrobił duży postęp i wielki talent, który od dawna jest mu przypisywany wreszcie zaczął się w pełni ujawniać. A występy przeciwko najlepszym europejskim graczom górnej alei to coś, co z pewnością pomaga jeszcze podnieść już i tak niemałe umiejętności.</p>\n<p>\nJednocześnie Wunderwear był w letnim splicie EU Challenger Series 2015 jednym z najlepszych, o ile nie najlepszym graczem górnej alei w tych rozgrywkach, co udowadniają statystyki – najwięcej asyst, prawie najwięcej zabójstw, najwyższe KDA i prawie najwyższy udział w zabójstwach wśród top-lanerów. Duński gracz górnej alei zyskał pewność w grze i regularność.</p>\n<p>\nCo ciekawe, Wunderwear ma tendencję do grania niekiedy dość nietypowymi postaciami. To właśnie duński top-laner był pierwszym zawodnikiem, który na profesjonalnej, czy też pół-profesjonalnej, scenie zdecydował się na wybór Gankplanka po reworku tego bohatera. Dał się też poznać jako doskonały gracz Tahm Kencha na górnej alei - po rzecznego potwora sięgał kilkukrotnie, nie bojąc się wybrać tego bohatera nawet w najważniejszych spotkaniach. Widzieliśmy w rękach Duńczyka także chociażby Nautilusa czy Karmę. Można więc wnioskować, że Wunderwear jest w stanie porwać za sobą tłumy europejskich kibiców, którzy przecież uwielbiają zawodników grających niestandardowymi postaciami, o czym przekonaliśmy się poprzez ogromny wzrost popularności zespołu Unicorns of Love po barażach o grę w LCS 2015 i IEM-ie w San Jose w tym samym roku.\n</p>","es_AR":"<p>Martin \"Wunderwear\" Hansen es sólido en el carril superior... sólido y agresivo. Incluso jugando con Nautilus y Maokai, a Wunderwear le encanta lograr una cantidad exagerada de asesinatos. Sus locuras le merecieron un KDA de 5.2 puntos en el torneo de clausura de la Challenger Series EU 2015. Aún así, su estilo de juego agresivo tuvo resultados muy variados en su primer torneo de la LCS EU. Casi siempre ha combinado una agresión calculada con un accionar totalmente temerario.</p>\n\n<p>Aprendió su lección, y en el torneo de clausura de la LCS EU 2016, Wunder y Splyce se convirtieron en lo mejor que Europa tenía para ofrecer. Su crecimiento era indiscutible, y Wunder pasó a ser una amenaza que sus rivales debían neutralizar si querían evitar que llevara a su equipo directo hacia la victoria. Puede que Wunder se destaque en Europa, pero jugar contra colosales carriles centrales superiores como Smeb, Duke y Looper será un reto totalmente diferente. Nadie creyó en Wunder y Splyce antes, y este jugador muere por silenciar una vez más la boca de aquellos que dudaron de él.</p>"},"foreignIds":{"drupalId":"2895","TRLH3":"200000103","TRLH4":"200000206"},"socialNetworks":{"twitter":"twitter.com/SPY_WUNDERLOLXD","twitch":"twitch.tv/Wunderwearisfame","facebook":"http://facebook.com/Wunderwearlol"},"champions":[],"liveGameTeam":97},{"id":588,"slug":"kobbe","name":"Kobbe","firstName":"Kasper","lastName":"Kobberup","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kobbe-adbtha0l.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-09T10:31:56.000Z","bios":{"en_US":"<p>Kasper “Kobbe” Kobberup didn’t always want to be a professional gamer. He was dedicated to football before an injury sent him to the sideline and he had to rethink his options. Luckily for Splyce, Kobbe took up League of Legends. Before long, he became one of the best up-and-coming ADCs in Europe.</p>\n\n<p>Like the rest of Splyce, Kobbe was disappointed by his performance at the 2016 World Championship. But the international experience should make Kobbe and Splyce even better if they can learn from it. The next time elite opponents stare him down, Kobbe will be ready to blow right past them.</p>","de_DE":"<p>Kasper „Kobbe“ Kobberup wollte nicht immer ein professioneller Spieler werden. Er war ein leidenschaftlicher Fußballspieler, bevor ihn eine Verletzung auf die Ersatzbank zwang und er seine Optionen überdenken musste. Zum Glück für Splyce begann Koppe, League of Legends zu spielen. Es dauerte nicht lange, bis er zu einem der besten Nachwuchs-ADCs Europas wurde.\n\nWie der Rest von Splyce war auch Kobbe mit seiner Vorstellung bei der Weltmeisterschaft 2016 nicht zufrieden. Aber wenn Kobbe und Splyce aus der internationalen Erfahrung lernen konnten, sollten sie jetzt sogar noch besser sein. Wenn er das nächste Mal von Elite-Gegnern finster angestarrt wird, kann Kobbe einfach vorbeistürmen.</p>","fr_FR":"<p>Kasper « Kobbe » Kobberup sera-t-il le nouveau Jesper « Niels » Svenningsen ? C’est probablement la question qui sera posée dorénavant à chaque nouveau carry ad qui arrive en LCS EU. Sans lui imposer une trop forte pression sur les épaules, on peut déjà estimer que Kobbe a les moyens de se faire un nom pour lui-même. Le joueur danois, passé par Gamers 2 mais aussi brièvement par la structure française Millenium en 2015 a véritablement explosé sur la scène challenger au printemps de l’année écoulée quand il a rejoint son équipe actuelle. Ce qui était à l’époque Dignitas EU a eu le nez creux en recrutant deux semaines après le début des Challenger Series son nouveau carry AD. Celui-ci, alors en duo avec Erih « Voidle » Sommermann sur la voie du bas, n’a pourtant pas révélé tout de suite l’étendue de son talent. Il a fallu pour cela attendre le segment d’été des Challenger Series et l’arrivée à ses côtés d’un nouveau support, Nicolai « Nisbeth » Nisbeth. Les deux danois ont trouvé une synergie très efficace, qui leur a permis de surclasser la concurrence et d’être de l’avis général le meilleur binôme carry AD/Support de la scène challenger.   Une synergie qui va néanmoins être mise à rude épreuve face à celle de duos LCS plus expérimentés. Malgré tout, s’il est peu probable de retrouver dès cette année Splyce et Kobbe en demi –finale des championnats du monde, le joueur a largement les moyens d’imposer son style de jeu et son nom en bonne place aux côtés de ses glorieux ainés. </p>","es_ES":"<p>Antes de jugar a League of Legends, Kasper ''Kobbe'' Kobberup se dedicaba al fútbol. Cuando una lesión lo obligó a retirarse, reconsideró sus opciones, y por suerte para nosotros, el fin de un sueño es el momento perfecto para el inicio de otro. Kobbe dedicó su tiempo en el banquillo de fútbol a convertirse en jugador profesional de videojuegos.</p>\n\n<p>Tras una actuación dominante en la Challenger Series europea de 2015, Kobbe llegó a la LCS EU. Aunque estuvieron a punto de ser eliminados, Kobbe y Splyce sorprendieron a todo el mundo y obtuvieron un segundo puesto en el split de verano de la LCS EU 2016. Además de eso, ayudó a asegurarle un puesto a Splyce en el Mundial en su segundo split en acción en la LCS EU. Señalado como uno de los AD carries más prometedores de Europa, Kobbe tiene ahora la oportunidad de medir su entereza con la élite internacional. Es una lucha a vida o muerte para Kobbe, y si tomamos el pasado como referencia, llegado el momento de la partida, elegirá vivir.</p>","pl_PL":"<p>Gra urodzonego w 1996 roku Duńczyka nie jest może tak widowiskowa jak chociażby jego kolegi z drużyny Chresa „Sencuxa” Larsena, ale Kobbe jest niesamowicie regularnym graczem, a także bardzo istotnym elementem zespołu. Jego opanowanie i zdolność do utrzymania przez długi czas wysokiego poziomu doskonale równoważy wahania formy duńskiego i mid-lanera i sprawia, że ekipa Splyce ma na kim oprzeć swoją grę, podczas gdy Sencuxowi przydarzy się gorsza gra. Kobbe to na pierwszy rzut oka bardzo niepozorny strzelec, ale w letnim splicie Challenger Series 2015 nie było żadnego gracza na jego pozycji, który mógłby równać się z Duńczykiem. Najwięcej zabójstw i asyst, najmniej śmierci i niesamowite KDA na poziomie 10,5 sprawiają, że Kobbe wydaje się być najbardziej niedocenianym zawodnikiem w składzie beniaminka EU LCS. </p>\n<p>\nJednocześnie warto zauważyć, że Kobbe zwrócił uwagę czołowych drużyn w Europie już nieco wcześniej, gdy udało mu się dostać do pierwszej dziesiątki SoloQ zachodnio-europejskiego serwera. Miało to miejsce w trakcie letniego splitu 2015 i wtedy też pojawiały się pogłoski o tym, że miałby dołączyć do Teamu ROCCAT, który szukał strzelca w miejsce Pawła „Woolite’a” Pruskiego. Ostatecznie jednak Kobbe pozostał w Dignitas EU, a ROC sięgnął po Rasmusa „MrRalleza” Skinneholma. </p>\n<p>\nAle gdy my sięgniemy jeszcze dalej w przeszłość, zobaczymy, że Kobbe już od dłuższego czasu kręcił się najpierw w okolicach Challenger Series z Denial eSports i 4everzenzyg (od maja do listopada 2014), a później poczynał sobie coraz śmielej i występował w kilku ciekawych zespołach o LCS-owych aspiracjach. Wymienić tu można chociażby Gamers2, gdzie Kobbe przez krótki czas grał u boku m.in. obecnego wspierającego Teamu SoloMid – Raymonda „KaSinga” Tsanga czy późniejszego dżunglera Dignitas EU – Dennisa „Obviousa” Sørensena. Kolejnym przystankiem na drodze duńskiego strzelca było Millenium, ale także tutaj nie zabawił zbyt długo i wkrótce dołączył do Teamu Dignitas EU, z którym to po dwóch splitach zmagań w Challenger Series, w końcu udało mu się dostać do LCS-u na wiosenną edycję 2016. Konsekwencja, której nie brakuje Kobbe’mu także na Polach Sprawiedliwości w końcu zaowocowała.</p>\n<p>\n„Jest naprawdę dobrym strzelcem z solidną fazą linii i umiejętnością gry w zespole. Doskonale wie jak pozycjonować się w walkach drużynowych” – powiedział o swoim byłym koledze z drużyny francuski top-laner Julian „GoB” Treguer dla portalu Millenium.org.</p>\n<p>\nCiekawostką jest fakt, że Kobbe na wysokim poziomie gra nie tylko w League of Legends. Duński ADC, którego graniem w gry zaraził brat, był w przeszłości miłośnikiem Warcrafta 3, World of Warcraft oraz Diablo 2, a do tej pory zdarza mu się zagrać w CS:GO, gdzie udało mu się zdobyć najwyższą możliwą rangę – Global Elite.\n</p>","es_AR":"<p>Antes de jugar League of Legends, Kasper \"Kobbe\" Kobberup se dedicaba al fútbol. Luego de una lesión que lo dejó fuera del campo de juego, tuvo que reconsiderar sus opciones para el futuro. Por suerte para nosotros, el final de un sueño puede ser el comienzo de otro. Kobbe aprovechó el tiempo que pasó en el banco de suplentes para convertirse en video jugador profesional.</p>\n\n<p>Luego de una actuación dominante en la Challenger Series EU 2015, Kobbe pasó a formar parte de la LCS EU. Después de casi descender, Kobbe y Splyce sorprendieron a todos con un segundo lugar en el torneo de clausura de la LCS EU 2016. Además de esto, ayudó a Splyce a guardarse un lugar en el Mundial en su segundo torneo dentro de la escena de la LCS EU. Aclamado como uno de los mejores y prometedores ADC de Europa, Kobbe tiene la oportunidad de probar su valía contra enemigos internacionales de élite. Para Kobbe, las opciones son matar o morir, y su historia indica que escogerá la primera llegado el momento de jugar.</p>"},"foreignIds":{"drupalId":"2699","TRLH3":"200000106","TRLH4":"200000209"},"socialNetworks":{"twitch":"twitch.tv/kobbelol","facebook":"facebook.com/Kobbelol","twitter":"twitter.com/SPY_Kobbe"},"champions":[],"liveGameTeam":97},{"id":663,"slug":"gripex","name":"Gripex","firstName":"Jesper","lastName":"Terkildsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gripex-6b756abo.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-18T21:24:08.000Z","bios":{"en_US":"","es_AR":"<p>Jesper \"Gripex\" Terkildsen es el junglero suplente de Splyce.</p>"},"foreignIds":{"drupalId":"4545","TRLH4":"200000211","TRLH3":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":954,"slug":"mikyx","name":"Mikyx","firstName":"Mihael","lastName":"Mehle","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikyx-dbj14d9y.png","hometown":"","region":"EU LCS","birthdate":"","createdAt":"2016-01-05T19:47:13.000Z","updatedAt":"2017-06-09T11:10:17.000Z","bios":{"en_US":"<p>Mihael \"Mikyx\" Mehle is a support prodigy for Splyce. He's the only member of Splyce who wasn't on the team when they clawed their way out of the 2016 EU LCS Summer Promotion Tournament. As a rookie in the Summer Split, he brought a new level of playmaking to Splyce from the support position. Despite his inexperience, he helped Splyce go from rags to riches and earn a spot at the 2016 World Championship.</p>\n\n<p>At Worlds, Mikyx finally showed weakness. As he returns with the rest of Splyce for 2017, he'll get his first full season in the EU LCS to improve his talents. With his career still in its infancy, Mikyx has plans to attend Worlds for many years to come.</p>","de_DE":"<p>Mihael „Mikyx“ Mehle ist das Supporter-Wunderkind von Splyce. Er ist das einzige Mitglied, das beim erbitterten Kampf der Mannschaft im Sommer-Aufstiegsturnier der EU LCS 2016 nicht dabei war. Er ging als Nachwuchsspieler in den Sommer-Split und schaffte es dennoch, die Rolle des Spielmachers neu zu definieren. Trotz seiner geringen Erfahrung half er Splyce dabei, einen fulminanten Aufstieg hinzulegen und sich einen Platz bei der Weltmeisterschaft 2016 zu sichern.\n\nBei der Weltmeisterschaft zeigte Mikyx dann erstmals Schwäche. Wenn er 2017 mit dem Rest von Splyce zurückkehrt, kann er sein Können in seiner ersten kompletten Saison in der EU LCS verbessern. Da seine Karriere immer noch in den Kinderschuhen steckt, hat Mikyx vor, noch an vielen Weltmeisterschaften teilzunehmen.</p>","fr_FR":"<p>Mihael « Mikyx » Mehle a rejoint les rangs de Splyce en tant que support titulaire au début du segment d’été 2016. D’origine slovène il a été le support remplaçant de Fnatic durant le segment de printemps. Néanmoins, il n’a jamais été titularisé et ce sera donc avec Splyce qu’il fera ses premiers pas sur la scène compétitive des LCS durant ce segment d’été. </p>","pl_PL":"<p>Mihael „Mikyx” Mehle to zawodnik ze Słowenii, który swoje pierwsze kroki w profesjonalnym graniu stawiał w rodzimym zespole Bottled Water. Interesującym momentem w jego karierze okazało się dołączenie do legendarnego Fnatic w roli rezerwowego wspierającego. Wtedy 18-latek dał się poznać jako doskonały zawodnik soloQ, a jego talent chwalili tak znakomici zawodnicy jak Lee „Spirit” Da-yoon czy Jesper „Zven” Svenningsen, jednocześnie zwracając jednak uwagę na wąski champion pool młodego gracza. We Fnatic jednak Mikyx nie miał szans na grę, a dodatkowo jego sytuację skomplikował powrót do zespołu Bory „YellOwStaR’a” Kima.</p>\n<p>W tym czasie Mikyx otrzymał jednak ofertę ze Splyce, które dawało mu szansę sprawdzenia się na najwyższym europejskim poziomie rozgrywkowym – w EU LCS, z której to propozycji Słoweniec oczywiście skorzystał. W nowym zespole zastąpił Nicolaia „Nisbetha” Nisbetha i sprawił, że dotychczas jednonarodowościowy skład przestał być w pełni duński. Zarówno zawodnicy, jak i kibicie wierzą jednak, że Słoweniec będzie wzmocnieniem dla drużyny i że z w nim w składzie Splyce powalczy o coś więcej niż utrzymanie. Co ciekawe, Mikyx już wcześniej często grał w dynamicznej kolejce razem z Chresem „Sencuxem” Laursenem i Kasperem „Kobbe’em” Kobberupem, dzięki czemu zawodnicy ci zdążyli już zbudować podstawy synergii. Dotychczas Słoweniec dał się poznać przede wszystkim jako znakomity gracz Thresha i Morgany.</p>\n<p>„Mikyx ma wszelkie cechy, które w mojej opinii tworzą najlepszych zawodników w LCS. Posiada pasję i jest zmotywowany, by ciągle stawać się lepszym. Okazuje też wielki szacunek dla gry i samych graczy. Żeby nie wspomnieć o ogromnym talencie, który posiada.” – powiedział o swoim nowym zawodniku trener Splyce Jakob  „YamatoCannon” Mebdi.</p>\n","es_AR":"<p>Mihael \"Mikyx\" Mehle es la nueva edición del plantel inicial de Splyce. Al llegar a lo más alto del juego en solitario en nivel Aspirante, fue descubierto por Fnatic y escogido como soporte suplente para el torneo de apertura de la LCS EU 2016.</p>\n\n<p>En abril, Mikyx dejó Fnatic para convertirse en el nuevo soporte inicial de Splyce luego de que Nicolai \"Nisbeth\" Nisbeth se hiciera a un lado, y hay que decir que su presencia se hizo notar. La suerte se puso aún más del lado de Splyce durante el torneo de clausura, en el que la dupla de carriles inferiores formada por Kobbe y Mikyx estuvo asombrosamente afilada. Mikyx demostró una gran habilidad para crear jugadas con campeones como el Bardo, y lanzó habilidades definitivas determinantes por toda la Grieta con gran facilidad. Es muy poco común ver a un jugador principiante tan talentoso como Mikyx en los Mundiales. Su actuación le ha dado una oportunidad de jugar con las leyendas que el siempre ha querido ser.</p>","es_ES":"<p>Mihael ''Mikyx'' Mehle es el miembro más nuevo de la alineación principal de Splyce. Destacaba en el juego en solitario en el nivel Aspirante, así que Fnatic lo tuvo en cuenta y lo fichó como apoyo suplente durante el split de primavera de la LCS EU.</p>\n\n<p>En abril, Mikyx dejó Fnatic y pasó a ser el apoyo titular de Splyce, en sustitución de Nicolai ''Nisbeth'' Nisbeth, y lo dio todo en sus jugadas. La suerte de Splyce mejoró en el split de verano, ya que el dúo de la calle inferior, Kobbe y Mikyx, estuvo increíblemente avispado. Mikyx demostró una gran habilidad para facilitar jugadas con campeones como Bardo, con quien es capaz de lanzar fácilmente su definitiva desde la otra punta de la Grieta y propiciar así un giro en la partida. Es raro ver talentos como Mikyx en el escenario del Mundial tan pronto en su trayectoria profesional, pero se ha ganado esta oportunidad de jugar con las leyendas en las que se quiere convertir.</p>"},"foreignIds":{"TRLH3":"200000107","TRLH4":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1771,"slug":"annes","name":"Annes","firstName":"Annes","lastName":"Ravkic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/annes-47wl5dqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-02-10T15:25:24.000Z","updatedAt":"2017-05-31T21:46:49.000Z","bios":{},"foreignIds":{"TRLH3":"200000226","TRLH4":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":97}],"scheduleItems":[{"id":"AVcfjjkZoUG4HPFjOKCs","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:43480a99-1baa-4b8f-bc11-7873418daee8","scheduledTime":"2016-09-30T03:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"1","subBlockLabel":"Sub Block 9","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:4e593494-40f1-42de-8ffd-982c93cfe083"},"match":"43480a99-1baa-4b8f-bc11-7873418daee8","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"4e593494-40f1-42de-8ffd-982c93cfe083","league":"9"}],"gameIdMappings":[{"id":"316dde24-23a7-4a79-b1e0-2157de067de4","gameHash":"07bfc90bea44abdf"}],"videos":[{"id":4479,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:316dde24-23a7-4a79-b1e0-2157de067de4","source":"https://www.youtube.com/embed/ePC14aHuja4?wmode=transparent","createdAt":"2016-09-30T06:08:27.000Z","updatedAt":"2016-09-30T06:08:27.000Z","game":"316dde24-23a7-4a79-b1e0-2157de067de4"},{"id":4489,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:316dde24-23a7-4a79-b1e0-2157de067de4","source":"https://www.youtube.com/watch?v=mYRTl4FhQHw&wmode=transparent","createdAt":"2016-09-30T13:14:30.000Z","updatedAt":"2016-09-30T13:14:30.000Z","game":"316dde24-23a7-4a79-b1e0-2157de067de4"},{"id":4494,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:316dde24-23a7-4a79-b1e0-2157de067de4","source":"https://www.youtube.com/embed/thvGETeisrc?wmode=transparent","createdAt":"2016-09-30T13:54:35.000Z","updatedAt":"2016-09-30T13:54:35.000Z","game":"316dde24-23a7-4a79-b1e0-2157de067de4"},{"id":4501,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:316dde24-23a7-4a79-b1e0-2157de067de4","source":"https://www.youtube.com/embed/u-Ul2cNfBJU","createdAt":"2016-09-30T22:09:45.000Z","updatedAt":"2016-09-30T22:09:45.000Z","game":"316dde24-23a7-4a79-b1e0-2157de067de4"}],"htmlBlocks":[],"match":{"id":"43480a99-1baa-4b8f-bc11-7873418daee8","name":"SSG-vs-SPY","position":5,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"},{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}],"games":{"316dde24-23a7-4a79-b1e0-2157de067de4":{"id":"316dde24-23a7-4a79-b1e0-2157de067de4","name":"G1","generatedName":"SPY|SSG|G1|43480a991baa4b8fbc1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"},{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}],"standings":{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475273338305,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475243684209,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475241223607,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475215716198,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475210889957,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001890186","gameRealm":"TRLH1","platformId":"TRLH1:1001890186","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475273338305,"source":"bestOf","history":[{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475243684209,"source":"bestOf","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475241223608,"source":"bestOf","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475215716198,"source":"bestOf","closed":true},{"result":[[{"roster":"a5f0e4f9-6383-413a-a394-a289b78c9dc9"}],[{"roster":"fbaaf232-633c-4e29-96db-86a04c11a014"}]],"timestamp":1475210889958,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a5f0e4f9-6383-413a-a394-a289b78c9dc9":1,"fbaaf232-633c-4e29-96db-86a04c11a014":0}}}