{"teams":[{"id":94,"slug":"longzhu-incredible-miracle","name":"Longzhu Gaming","guid":"be6e1699-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/longzhu-incredible-miracle-2xpijv2d.png","acronym":"LZ","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-26T23:53:11.000Z","bios":{"en_US":"<p>Longzhu Gaming is looking to take the next step in 2017. Formerly Incredible Miracle, Longzhu Gaming failed to mesh in 2016 despite signing many high-profile free agents. While the team avoided relegations, Longzhu missed out on the playoffs in both the spring and summer. With a strong new bot lane duo, Longzhu hopes to earn a spot in the playoffs and more in 2017.</p>"},"foreignIds":{"drupalId":"889"},"players":[313,770,1027,1041,1905,1906,1907,1908,1909],"starters":[313,770,1027,1906,1907],"subs":[1041,1905,1908,1909]},{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]}],"players":[{"id":313,"slug":"gorilla","name":"Gorilla","firstName":"Beomhyun","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gorilla-44p51bn8.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-09-16T21:53:45.000Z","updatedAt":"2017-05-31T00:39:21.000Z","bios":{"en_US":"<p>\nBeomhyun \"Gorilla\" Kang rose over the years to become one of the best supports in Korea. Known for his Thresh and Janna plays, Gorilla is a master of manipulating the battlefield through vision and careful engagement. From saving Pray when he plays too aggressively to picking off opponents with hooks and stuns, Gorilla has played a key role in ROX's rise in the LCK standings.\n</p>\n<p>\nEven though Gorilla secured his first LCK trophy in the 2016 LCK Summer Split, he often found himself in the wrong places at the wrong times. For a player as storied as Gorilla, these types of mistakes were something nobody expected to see. After heartbreak at the 2016 World Championship, Gorilla will take his talents to Longzhu Gaming in 2017 and try another shot at a Worlds title.\n</p>","fr_FR":"<p>Beom-Hyeon « Gorilla » Kang est devenu au fil des ans un des meilleurs supports de Corée. Connu pour sa virtuosité avec Thresh et Janna, Gorilla sait comme personne manipuler le champ de bataille grâce a sa maîtrise de la vision et des engagements raisonnés. Sauvant PraY quand il joue trop agressivement ou s'abattant sur l'ennemi avec des grappins ou des étourdissements, Gorilla a joué un rôle clé dans l'ascension de KOO au sein des LCK.\n</p>\n<p>\nEn gros, si vous vous considérez comme le digne héritier des carrys AD enflammés façon WildTurtle, n'oubliez pas de recruter Gorilla pour vous sortir du pétrin. Aidez-nous, Beom-Hyeon Gorilla. Vous êtes notre seul espoir.\n</p>","pl_PL":"<p>Przez lata Beom-Hyeon „Gorilla” Kang zdobył pozycję jednego z najlepszych graczy w Korei. Znany z doskonałej gry Threshem i Janną, jest prawdziwym mistrzem manipulacji na polu walki za sprawą skutecznego wykorzystania wizji i niezwykłej ostrożności. Gorilla pomógł KOO zdobyć sukces w ramach LCK – a to ratował PraYa, gdy ten grał zbyt agresywnie, a to załatwiał przeciwników, posługując się hakami i ogłuszeniem.\n</p>\n<p>\nJeśli uznajesz się za duchowego spadkobiercę żywiołowego stylu gry WildTurtle'a, postaraj się mieć gdzieś pod ręką Gorillę, żeby w razie czego ocalił ci skórę. Pomóż nam, Beom-Hyeon Gorilla. Jesteś naszą jedyną nadzieją.\n</p>","de_DE":"<p>Beom-hyeon „GorillA“ Kang entwickelte sich über die Jahre zu einem der besten Supporter Koreas. GorillA, der vor allem für seine Spielzüge mit Thresh und Janna bekannt ist, ist ein Meister in Sachen Übersicht auf dem Schlachtfeld und wenn es um vorsichtiges Initiieren geht. GorillA rettete PraY, wenn dieser zu aggressiv spielte, oder schnappte sich Gegner mit gezielten Einsätzen seines Hakens oder Betäubungen und spielte somit eine Schlüsselrolle bei ROX’ Aufstieg in der LCK.</p>\n\n<p>Obwohl sich GorillA beim Sommer-Split der LCK 2016 seinen ersten Titel sichern konnte, war er oft zur falschen Zeit am falschen Ort. Niemand hatte erwartet, dass ein so guter Spieler wie GorillA solche Fehler machen würde. Während die Weltmeisterschaft 2016 näher rückt, muss GorillA wieder zu seiner alten Hochform zurückfinden, wenn er dieses Jahr mit einer letzten – und wichtigsten – Trophäe krönen will.</p>","es_ES":"<p>Beom-Hyeon ''GorillA'' Kang se ha convertido en uno de los mejores apoyos en Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro de la manipulación del campo de batalla gracias a la visión y a su cautela al iniciar combates. El papel de GorillA ha sido clave en el ascenso de ROX en la LCK, desde salvar a PraY cuando es demasiado agresivo hasta aislar oponentes con ganchos y aturdimientos.</p>\n\n<p>Aunque GorillA se aseguró su primer trofeo de la LCK en el split de verano de 2016, con demasiada frecuencia estaba en el lugar equivocado en el momento equivocado. Ese tipo de errores son algo que no se espera de jugadores con tanta experiencia como GorillA. Conforme se acerca el Campeonato Mundial 2016, GorillA tendrá que mejorar sus jugadas y volver a adaptarlas a sus habituales estándares astronómicamente altos si quiere llegar este año a la final y, lo que es más importante, llevarse el trofeo.</p>","pt_BR":"<p>Beom-hyeon \"Gorilla\" Kang cresceu bastante nesses últimos anos até se tornar um dos melhores suportes da Coreia. Conhecido por suas jogadas com Thresh e Janna, Gorilla é um mestre em manipular o campo de batalha através de visão e confrontos bem pensados. Desde salvar a PraY quando ele joga agressivo demais a apanhar seus adversários com correntes e atordoamentos, Gorilla teve um papel essencial na ascensão da ROX no cenário da LCK.</p>\n\n<p>Apesar de Gorilla ter conseguido garantir seu primeiro troféu da LCK na Etapa de Verão da LCK 2016, ele frequentemente se encontra nos lugares errados e nas horas erradas. Para um jogador tão experiente como Gorilla, esses tipos de erros são coisas que ninguém espera ver. Conforme o Campeonato Mundial 2016 se aproxima, Gorilla terá que calibrar suas jogadas de volta a seus padrões astronomicamente altos se quiser fechar este ano com o mais importante troféu de todos.</p>","es_AR":"<p>Beom-hyeon «GorillA\" Kang fue creciendo con los años hasta llegar a convertirse en uno de los mejores soportes de Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro a la hora de manipular el campo de batalla gracias a su visión y su cuidadoso estilo de combate. Pasa de salvar a PraY cuando se torna demasiado agresivo a aniquilar a sus rivales con ganchos y aturdimientos, por lo que su rol fue clave para el ascenso de posiciones de ROX en la clasificación de la LCK.</p>\n\n<p>Aunque GorillA se garantizó su primer trofeo de LCK en el torneo de clausura de la LCK 2016, varias veces se ha visto en el lugar equivocado en los momentos más inoportunos. Para un jugador con la historia de GorillA, estos tipos de errores fueron algo que nadie esperaba ver. Con el Campeonato Mundial 2016 aproximándose, GorillA deberá llevar su juego de vuelta a los niveles astronómicamente altos para poder coronar su año con el último (y más importante) trofeo.</p>"},"foreignIds":{"drupalId":"894","ESPORTSTMNT06":"200000372"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":770,"slug":"pray","name":"Pray","firstName":"Jong In","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pray-dqs5qv2u.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-06-08T17:30:10.000Z","bios":{"en_US":"<p>Jong In \"Pray\" Kim is considered one of the best AD carries in Korea. Pray initially signed with Najin Black Sword in 2012, and he led the team to 1st place in the 2012-2013 OGN Champions Winter competition. Known for his Ezreal and Twitch mechanics, Pray demonstrated just how effective an aggressive AD carry could be in the Korean meta (hint: it was really effective).</p>\n\n\n<p>After a short personal break in 2014, Pray returned to esports when he joined the newly created ROX Tigers (previously KOO Tigers). His impact was immediate as the team rocketed to the 2015 World Championship Finals in their first year of existence. PraY and ROX followed that effort up with a second place finish in the 2016 LCK Spring Split and soon after in the 2016 LCK Summer Split, PraY took home his first LCK trophy. After finally finding domestic success, Pray found himself facing off with SK Telecom T1 at Worlds, and based on history, you can guess how that went. He’ll attempt to put another bitter loss to SKT behind him with a new team in 2017.</p>","fr_FR":"<p>Jong-in « PraY » Kim est considéré comme l'un des meilleurs carrys AD de Corée. À l'origine, PraY a signé avec NaJin Black Sword en 2012 et a conduit son équipe à la première place lors du tournoi OGN Champions Winter 2012-2013. Connu pour sa maîtrise d'Ezreal et de Twitch, PraY a démontré à quel point un carry AD agressif pouvait être efficace dans la méta coréenne. (spoiler : à un très haut point)</p>\n\n<p>Après une courte pause personnelle en 2014, PraY est revenu sur la scène e-sport lorsqu'il a rejoint l'équipe toute jeune des ROX Tigers (anciennement KOO Tigers). Son impact a été immédiat : l'équipe s'est propulsée vers la finale du Championnat du monde 2015 l'année même où il a été créé. PraY et ROX ont poursuivi leurs efforts pour décrocher la seconde place dans le segment de printemps des LCK 2016 et juste après dans le segment d'été de la même année, PraY a remporté son premier trophée LCK. Après avoir enfin rencontré le succès à domicile, PraY s'est retrouvé face à SK Telecom T1 lors du Mondial et, au vu des antécédents, l'issue n'est pas difficile de deviner. Il essaiera de laisser derrière lui une autre défaite amère face à SKT en réalisant de bonnes performances lors de l'événement All-Stars 2016.</p>","pl_PL":"Jong In „PraY” Kim uważany jest za jednego z najlepszych prowadzących w Korei. PraY początkowo dołączył do Najin Black Sword w 2012 roku i doprowadził drużynę do pierwszego miejsca na zawodach OGN Champions Winter 2012-2013. Znany ze świetnej gry Ezrealem i Twitchem PraY zademonstrował, jak skuteczny może być agresywny prowadzący w koreańskiej rzeczywistości (podpowiedź: był bardzo skuteczny).</p>\n\nPo krótkiej przerwie w 2014, wymuszonej sytuacją osobistą, PraY wrócił do e-sportu, dołączając do właśnie utworzonych ROX Tigers (dawniej KOO Tigers). Jego wpływ stał się widoczny natychmiast i drużyna pomknęła do finału Mistrzostw Świata 2015 w pierwszym roku swojego istnienia. Po tym osiągnięciu PraY i ROX zajęli drugie miejsce podczas wiosennego splitu LCK 2016. Wkrótce później, po letnim splicie 2016, PraY zabrał do domu swoje pierwsze trofeum LCK. Gdy wreszcie odniósł sukces lokalny, PraY stanął twarzą w twarz z SK Telecom T1 na Mistrzostwach, a znając ich ostateczne wyniki, można się domyślić, jak to się skończyło. Z pewnością spróbuje zatrzeć wspomnienie kolejnej gorzkiej porażki z SKT słodkim smakiem sukcesu podczas wydarzenia All-Star 2016.\n","de_DE":"<p>Jong-in „PraY“ Kim gilt als einer der besten AD-Carrys Koreas. PraY unterschrieb 2012 bei Najin Black Sword und führte die Mannschaft in den Jahren 2012 und 2013 zum Titel des „OGN Champions Winter“-Turniers. PraY ist für seine Fähigkeiten mit Ezreal und Twitch bekannt und hat allen gezeigt, wie effektiv ein aggressiver AD-Carry im koreanischen Metaspiel sein kann (kleiner Tipp: Er war wirklich effektiv).</p>\n\n<p>Nach einer kurzen persönlichen Auszeit kehrte PraY 2014 in die E-Sport-Szene zurück und wechselte zu den neu gegründeten ROX Tigers (ehemals KOO Tigers). Sein Einfluss war sofort spürbar, als die Mannschaft gleich in ihrem ersten Jahr das Finale der Weltmeisterschaft 2015 erreichte. PraY und ROX legten mit einem zweiten Platz beim Frühjahrs-Split der LCK 2016 nach, bevor sie beim Sommer-Split der LCK 2016 ihre erste Trophäe in der LCK mit nach Hause nehmen konnten. Nach diesem heimischen Erfolg traf PraY bei der Weltmeisterschaft auf SK Telecom T1 und der Rest ist Geschichte. Er wird versuchen, auch diese knappe Niederlage gegen SKT wegzustecken und beim All-Stars-Event 2016 eine ansprechende Leistung abzuliefern.</p>","es_ES":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores AD carry de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un AD carry agresivo en el metajuego coreano (creednos, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el split de primavera de la LCK 2016 y, poco después, en el split de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","pt_BR":"<p>Jong-in \"PraY\" Kim é considerado um dos melhores atiradores da Coreia. PraY a princípio assinou um contrato com a NaJin Black Sword in 2012 e levou a equipe ao 1º lugar na competição de Inverno da OGN Champions 2012-2013. Conhecido por suas habilidades com Ezreal e Twitch, PraY demonstrou o quão eficiente um atirador agressivo pode ser no meta coreano (tipo, muito eficiente).</p>\n\n<p>Depois de um descanso por motivos pessoais em 2014, PraY fez sua volta ao e-Sports quando entrou para a recém-formada ROX Tigers (antiga KOO/GE Tigers). Seu impacto foi imediato e sua equipe foi parar direto nas Finais do Campeonato Mundial 2015 logo em seu primeiro ano de existência. PraY e ROX continuaram com seus esforços e alcançaram o segundo lugar na Etapa de Primavera da LCK 2016, fazendo também a mesma façanha na Etapa de Verão, onde PraY levou para casa seu primeiro troféu da LCK. Após finalmente encontrar sucesso em casa, PraY enfrentou a SK Telecom T1 no Mundial e, bem, vocês sabem o que aconteceu. Ele tentará colocar outra derrota contra a SKT no passado e desempenhar bem no Evento All-Star 2016.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"PraY\" 김종인은 한국 최고의 원거리 딜러 중 하나로 여겨집니다. PraY는 맨 처음 2012년 Najin Black Sword와 계약했고 2012-2013 OGN 챔피언스 윈터 시즌에서 팀을 1위로 이끌었습니다. 이즈리얼, 트위치로 유명한 PraY는 공격적인 원거리 딜러가 한국 메타에서 얼마나 효과적인지 보여줬죠. </p>\n<p style=”font-family:”나눔고딕”;\">2014년 잠시 개인적으로 휴식을 취한 PraY는 e스포츠로 돌아와 새롭게 만들어진 팀 KOO Tigers (구 GE Tigers)에 합류했습니다. 그의 영향력은 즉시 나타났습니다. KOO Tigers가 창단 첫해에 2015 월드 챔피언십 결승전까지 진출했거든요. PraY와 KOO Tigers는 비록 결승전에서 SKT를 물리치진 못했지만 월드 챔피언십에서 보여준 PraY의 놀라운 경기력은 유럽 관중들에게 깊은 인상을 남겼습니다. </p>\n","es_AR":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","cs_CZ":"<p>Jong In „PraY“ Kim je považován za jednoho z nejlepších korejských ADC. Nejprve roku 2012 nastoupil do týmu Najin Black Sword a dotáhl jej na 1. místo soutěže OGN Champions Winter 2012–2013. PraY, proslulý především svou úžasnou herní technikou za Ezreala a Twitche, názorně předvedl, jak efektivní může být agresivní ADC v korejské metě (tzn. nesmírně efektivní).</p>\n\n<p>Po krátké pauze, kterou si z osobních důvodů udělal v roce 2014, se PraY k esportům vrátil a podepsal smlouvu s nově vytvořeným celkem ROX Tigers (dříve KOO Tigers). Jeho vliv se projevil prakticky okamžitě a hned během prvního roku katapultoval tým až do finále mistrovství světa 2015. PraY a ROX na tento úspěch navázali druhým místem v jarním splitu LCK 2016 a krátce poté, v letním splitu LCK 2016, získal PraY svou první ligovou trofej. Když se mu konečně začalo dařit na domácí scéně, čekal jej na MS boj s SK Telecom T1, a všichni víme, jak to dopadlo. Nyní se pokusí vzpomínky na hořkou prohru s SKT zahnat špičkovým výkonem na turnaji All-Star 2016.</p>","el_GR":"<p>Ο Jong In \"PraY\" Kim θεωρείται ένας από τους καλύτερους AD Carry στην Κορέα. Η πρώτη ομάδα του PraY ήταν οι Najin Black Sword το 2012, οι οποίοι με τη βοήθειά του κατάφεραν να πάρουν την 1η θέση στη διοργάνωση OGN Champions Winter 2012-2013. Γνωστός για τον άριστο χειρισμό του Έζρεαλ και του Τουίτς, ο PraY έδειξε στην κορεατική σκηνή πόσο αποτελεσματικός μπορεί να γίνει ένας επιθετικός AD Carry (πάρα πολύ αποτελεσματικός, όπως αποδείχτηκε).</p>\n\n<p>Μετά από ένα μικρό διάλειμμα για προσωπικούς λόγους το 2014, ο PraY επέστρεψε στα esports με μια νέα τότε ομάδα, τους ROX Tigers (προηγουμένως KOO Tigers). Έκανε αμέσως αισθητή την παρουσία του, καθώς η ομάδα εκτοξεύτηκε στον Τελικό Παγκοσμίου Πρωταθλήματος 2015 τον πρώτο χρόνο της σταδιοδρομίας τους. Ο PraY και οι ROX συνέχισαν εξίσου καλά, παίρνοντας τη δεύτερη θέση στο Spring Split 2016 του LCK και λίγο μετά, στο Summer Split 2016 του LCK, ο PraY κέρδισε το πρώτο του τρόπαιο στο LCK. Αφού κατάφερε να φτάσει επιτέλους στην κορυφή εντός των συνόρων, ο PraY βρέθηκε λίγο μετά να μάχεται με τους SK Telecom T1 στο Παγκόσμιο Πρωτάθλημα και τα υπόλοιπα τα γνωρίζετε. Είναι βέβαιο ότι θα προσπαθήσει να ξεπεράσει άλλη μια πικρή ήττα από τους SKT με μια δυνατή εμφάνιση στο Τουρνουά All-Star 2016.</p>","hu_HU":"Jong In „PraY” Kim Korea egyik legjobb lövészének számít. PraY 2012-ben a Najin Black Swordhoz igazolt, és az OGN Champions 2012-2013-as téli szakaszában győzelemre is vezette csapatát. Ezreallal és Twitchcsel félelmetesen játszik, és bizonyította, hogy milyen hatékony lehet egy agresszív lövész a koreai metajátékban (nagyon).</p>\n\nPraY magánéleti okokból rövid pihenőt tartott 2014-ben, és az újonnan alakított ROX Tigers (akkoriban KOO Tigers) kötelékében tért vissza az e-sportba. Jelentős hatása volt a csapat eredményeire, és már az első teljes évükben a 2015-ös világbajnokság döntőjéig jutottak. PraY és a ROX a lendületüket megőrizve másodikok lettek az LCK 2016-os tavaszi szakaszában, a nyári szakaszban pedig PraY megnyerte első LCK-s bajnoki címét. A hazai sikerek után az SK Telecom T1 lett a vesztük a vb-n, csakúgy, mint az előző évben. Az SKT-től elszenvedett újabb kellemetlen vereséget a 2016-os All-Star gálán próbálja majd feledni.\n","it_IT":"Jong In \"PraY\" Kim è considerato uno dei migliori ADC di tutta la Corea. PraY ha iniziato la sua carriera nei NaJin Black Sword nel 2012, e ha condotto alla vittoria la sua squadra nel Champions Winter OGN 2012-2013. Famoso per le sue giocate con Ezreal e Twitch, PraY ha dimostrato quanto può essere efficace un AD carry aggressivo all'interno del meta coreano (spoiler: è MOLTO efficace).</p>\n\nDopo una breve pausa per motivi personali nel 2014, PraY è tornato nel mondo degli eSport unendosi ai novellini ROX Tigers (ex KOO Tigers). Il suo impatto fu immediato e il team raggiunse la finale dei Mondiali 2015 al suo primo anno d'età. PraY e i ROX proseguirono la striscia positiva con un secondo posto allo Spring Split LCK 2016 e poi al Summer Split, dove PraY ha portato a casa il suo primo trofeo LCK. Dopo aver agguantato il successo in casa, PraY ha dovuto affrontare gli SKT ai Mondiali, e il resto è storia. All'All-Star cercherà di lasciarsi alle spalle l'amara sconfitta deliziandoci con una prestazione degna del suo nome.\n","ro_RO":"Jong In ''PraY'' Kim este privit ca unul dintre cei mai buni jucători ADC din Coreea. PraY și-a început cariera în 2012, alături de Najin Black Sword, conducându-și echipa către primul loc în competiția OGN Champions Winter 2012-2013. Cunoscut în principal pentru mecanicile sale de joc cu Ezreal și Twitch, PraY a demonstrat cât de eficient poate fi un ADC agresiv în meta-ul coreean (mai exact: extrem de eficient).</p>\n\nDupă o scurtă pauză din motive personale în 2014, PraY s-a întors la eSports, alăturându-se echipei ROX Tigers (cunoscuți anterior drept KOO Tigers), care de-abia fusese creată. Impactul lui a fost vizibil instantaneu, iar echipa a ajuns în finala Campionatului Mondial 2015 în primul an după ce a fost fondată. PraY și ROX au mers înainte cu aceeași hotărâre și au terminat pe locul al doilea în etapa de primăvară a LCK 2016 și, la scurtă vreme după aceea, PraY a luat acasă primul trofeu LCK în etapa de vară din 2016 a competiției. După ce a obținut în sfârșit succesul pe plan local, PraY a întâlnit SK Telecom T1 la Mondiale. Istoria și-a spus cuvântul și puteți ghici ce s-a întâmplat. Va încerca să treacă iar peste înfrângerea amară împotriva celor de la SKT printr-o victorie dulce la All-Star Event 2016.\n","es_MX":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>"},"foreignIds":{"drupalId":"369","ESPORTSTMNT06":"200000371"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1027,"slug":"bdd","name":"BDD","firstName":"Bo-sung","lastName":"Kwak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bdd-gqyzlus1.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:55.000Z","updatedAt":"2017-05-31T00:45:54.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000370"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1041,"slug":"zzus","name":"Zzus","firstName":"Jun-su","lastName":"Jang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zzus-in7b4s5r.png","hometown":"South Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:08:13.000Z","updatedAt":"2017-05-31T00:45:11.000Z","bios":{},"foreignIds":{"TRKR1":"225061"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1905,"slug":"rascal","name":"Rascal","firstName":"Kwanghee","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rascal-8urxxqt3.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:02.000Z","updatedAt":"2017-05-31T00:47:11.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1906,"slug":"khan","name":"Khan","firstName":"Dongha","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/khan-9ek3s7ka.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:16.000Z","updatedAt":"2017-07-20T17:16:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001338"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1907,"slug":"cuzz","name":"Cuzz","firstName":"Uchan","lastName":"Mun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuzz-h4602gy8.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:11:11.000Z","updatedAt":"2017-05-31T00:39:07.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000369"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1908,"slug":"justice","name":"Justice","firstName":"Seokjun","lastName":"Yoon","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/justice-ciws9z5c.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:05:33.000Z","updatedAt":"2017-05-31T00:45:08.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1909,"slug":"jin","name":"Jin","firstName":"Woojin","lastName":"Lee","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:13:13.000Z","updatedAt":"2017-05-25T19:13:13.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94}],"scheduleItems":[{"id":"AVMfgDYlJTrHluSI14No","content":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:match:44fc2005-b2b7-4b33-b2ca-d67257d83998","scheduledTime":"2016-03-30T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda","blockLabel":"12","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:bracket:9342e2fe-50d2-41dd-bb72-bb12c42fb5c6"},"match":"44fc2005-b2b7-4b33-b2ca-d67257d83998","tournament":"0a5fb908-70c8-411b-81e0-27a83c167eda","bracket":"9342e2fe-50d2-41dd-bb72-bb12c42fb5c6","league":"6"}],"gameIdMappings":[{"id":"7cc7e7f2-71f3-4b15-ba1a-847d2e3e44d5","gameHash":"d8bc8fe4848a0771"},{"id":"22fc530c-1806-4551-9b5c-69d9e6b4c094","gameHash":"2311858eb33d6d12"}],"videos":[{"id":2356,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:7cc7e7f2-71f3-4b15-ba1a-847d2e3e44d5","source":"https://www.youtube.com/embed/054M-mW-PAA?wmode=transparent&start=13751","createdAt":"2016-03-31T19:26:09.000Z","updatedAt":"2016-03-31T19:26:09.000Z","game":"7cc7e7f2-71f3-4b15-ba1a-847d2e3e44d5"},{"id":2357,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:22fc530c-1806-4551-9b5c-69d9e6b4c094","source":"https://www.youtube.com/embed/054M-mW-PAA?wmode=transparent&start=16759","createdAt":"2016-03-31T19:27:00.000Z","updatedAt":"2016-03-31T19:27:00.000Z","game":"22fc530c-1806-4551-9b5c-69d9e6b4c094"}],"htmlBlocks":[],"match":{"id":"44fc2005-b2b7-4b33-b2ca-d67257d83998","name":"LZ-vs-SSG","position":33,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"},{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}],"games":{"7cc7e7f2-71f3-4b15-ba1a-847d2e3e44d5":{"id":"7cc7e7f2-71f3-4b15-ba1a-847d2e3e44d5","name":"G1","generatedName":"LZ|SSG|G1|44fc2005b2b74b33b2ca","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"},{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}],"standings":{"result":[[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1459366597916,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1040054","gameRealm":"TRKR1","platformId":"TRKR1:1040054","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"22fc530c-1806-4551-9b5c-69d9e6b4c094":{"id":"22fc530c-1806-4551-9b5c-69d9e6b4c094","name":"G2","generatedName":"LZ|SSG|G2|44fc2005b2b74b33b2ca","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"},{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}],"standings":{"result":[[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1459366614775,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1040059","gameRealm":"TRKR1","platformId":"TRKR1:1040059","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"75610adf-bb11-477d-a026-c65c37e98c0e":{"id":"75610adf-bb11-477d-a026-c65c37e98c0e","name":"G3","generatedName":"LZ|SSG|G3|44fc2005b2b74b33b2ca","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"},{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"985f6d74-6b6a-40c5-a3c8-6b647d5f7578"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1459366614778,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}