{"teams":[{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]},{"id":55,"slug":"fc-schalke-04","name":"FC Schalke 04","guid":"be6cad42-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fc-schalke-04-h992ofkj.png","acronym":"S04","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-07-06T22:27:08.000Z","bios":{"en_US":"<p>\nFC Schalke 04 bought Elements’  EU LCS seed just before the beginning of the 2016 EU LCS Summer Split. The team's remained largely the same, aside from a key addition in the mid lane with Hampus “Fox” Myhre. \n</p>\n<p>\nSchalke has a long history in organized sports, dating back to the early 1900s. This marks their first foray into the world of League of Legends esports. With a group that finished 7th last split, Schalke is looking to turn around the team’s fortunes and carve a name for themselves in the esports world.\n</p>\n<p>\nCoach: Michael \"Veteran\" Archer\n</p>","pl_PL":"<p>Organizacja, która istnieje dzięki zaangażowaniu graczy udzielających się w League of Legends od jej początków. Drużyna Elements powstała z Alliance, po której odziedziczyła miejsce w wiosennym sezonie EU LCS 2015. Przymusowa przemiana była spowodowana zmianami praw dotyczących zespołów, zbiegła się również ze zmianami w składzie osobowym drużyny. W sezonie piątym cała drużyna został zbudowana w około Henrika \"Froggen\" Hansena, jednego z najpopularniejszych graczy Europy. Stworzeniu organizacji towarzyszyła ciekawa i bardzo oryginalna kampania reklamująca jej członków. W sieci pojawiła się seria zdjęć przedstawiająca buty każdego z zawodników, dzięki czemu część z nich została rozpoznana przez fanów przed oficjalnym ogłoszeniem całej ekipy. Pojawił się również ich znak firmowy – logo przedstawiające pięć żywiołów. Dzięki znanym i lubianym graczom, którzy znaleźli się w szeregach organizacji, rzesza wielbicieli kibicowała kolejnym ujawnianym informacjom o powstającej drużynie.</p>\n<p>\nPo nowo utworzonej organizacji fani spodziewali się wyników, które zagwarantują Elements podium. Niestety rzeczywistość i poważna konkurencja zweryfikowały te oczekiwania. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 żywiołowej ekipie poszło przeciętnie. Dwukrotnie znaleźli się na siódmej pozycji mało imponującym wynikiem 7:11. Zwolennicy nie byli w pełni zawiedzeni, gdyż zespół Elements nie radził sobie najgorzej na tle innych drużyn. Jednak wszyscy, analitycy i fani, spodziewali się dużo więcej po tak hucznie ogłoszonym składzie graczy. Pozytywnym aspektem ich pozycji było znalezienie się poza trzema zespołami trafiającymi do rozgrywek relegacyjnych. Niestety będąc na siódmym miejscu nie mogli wziąć udziału w meczach barażowych.</p>\n<p>\nWłaściciel organizacji Elements, Jacob Toft-Andersen, w sezonie piątym starał się żeby polepszyć wyniki swojej drużyny. Wiele zmian osobowych wynikało z jego troski, lecz prawdopodobnie w tym okresie było ich zbyt dużo. Na przykład po wiosennym sezonie został wymieniony cały skład, oprócz mid-lanera.  Zawodnicy nie zdążyli się zgrać, w efekcie czego nie poprawiła się ani pozycja ani kondycja zespołu. Ostatecznie nie był zadowolony z osiągnięć Elements, w związku z czym podjął próbę sprzedania miejsca w wiosennym sezonie EU LCS 2016. Nieszczęśliwie dla Jacoba, nie znalazł się żaden chętny. Dlatego zdecydował się podjąć wyzwanie w czołowych europejskich rozgrywkach w 2016 roku. </p>\n","de_DE":"<p>Nachdem Alliance als erstes Team seit Entstehung der LCS Fnatic vom ersten Platz stieß, kam der Namenswechsel zum heutigen Elements. Mit lediglich einem Wechsel der Schützen Position von Erik \"Tabzz\" Van Helvert auf Martin \"Rekkles\" Larsson sollte ein Team entstehen, das fortan die europäische Liga dominieren sollte. Zu den erwünschten Resultaten kam es jedoch nie. Seit der Entstehung Anfang 2015 wurden nur mittelmäßige Erfolge erzielt. </p>\n<p><h2>Änderung sind nötig</p></h2>\n<p>Schon zum Spring Split 2015 nahm das Team um den damaligen Captain Henrik \"Froggen\" Hansen erste Änderungen vor, nachdem es das Team nicht schaffte, sich vom Mittelfeld im Ranking zu lösen. Ergebnis des Splits: Ein siebter Platz und damit verbunden erste große Spielerwechsel. Es wurden abgesehen von der Mitte und dem Support alle Positionen ausgetauscht, weiterhin mit Froggen als Kernspieler. Zu diesem Zeitpunkt stieß mit Hampus \"promisQ\" Abrahamsson, erstmals ein unbeschriebenes Blatt, zum Team. </p>\n<p>Die Resultate blieben weiterhin nicht zufriedenstellend. So hatte das Team nach einem erneuten siebten Platz im Summer Split keine Chance mehr, sich bei den Playoffs für die Weltmeisterschaft zu qualifizieren. Weitere Änderungen in der Teamaufstellung waren also schon zu erwarten. </p>\n<p><h2>Eine Legende verschwindet</p></h2>\n<p>Das Team hat nun seine bisher größte Änderung erfahren. Mit dem Wechsel von vier Spielern, darunter auch Froggen, ist die neue Stärke nur sehr schwer einzuschätzen. Bisher war eines der großen Probleme, dass das Team die Spiele möglichst in die Länge ziehen musste, um einen Sieg zu erreichen. Die neue Aufstellung sollte nun eine gute Gelegenheit bieten, mit neuen Taktiken in die Kluft der Beschwörer zu ziehen. Mit Patrick \"Nyph\" Funke steht in jedem Fall ein sehr erfahrener Spieler als Coach hinter den Spielern. </p>\n<p>Die sechste Saison wird in jedem Fall eine große Herausforderung werden. Elements wird als einer der Underdogs ins Rennen gehen und sich seinen Platz hart erkämpfen müssen. Die Priorität sollte darauf liegen, sich erst einmal aufeinander einzuspielen und mit gutem Teamwork zu überzeugen. Erst nachdem die Spieler gewisse Konsistenz unter Beweis gestellt haben, würde sich eine weitere Spezialisierung auf die Konkurrenz lohnen. </p>\n<p> Im Sommer wurde das Team nun von dem Bundesliga-Club Schalke 04 übernommen und dadurch größte Aufmerksamkeit erreicht. Wie sich das neue Team schlagen wird, muss man in den nächsten Wochen beobachten.</p>\n<p>Zu hoch gesteckte Ziele haben in der Vergangenheit eher einen gegenteiligen Effekt zum gewünschten Erfolg gebracht. Stattdessen haben die Spieler nun die Chance, bei niedrigen Erwartungen die Zuschauer zu überraschen. </p>\n","es_ES":"<p>Elements es uno de los equipos con más historia dentro de la LCS EU, historia que se remonta hasta CLG.EU en el año 2012. Como Alliance en 2014 consiguieron la victoria en los playoffs de verano de la LCS EU 2014, lo que los coronó como el mejor equipo de Europa por aquel entonces, y un equipo a tener en cuenta en el Campeonato Mundial de ese mismo año. Pero todo se vino abajo cuando fueron eliminados en la fase de grupos al perder con el equipo brasileño KaBuM! e-Sports, algo que todavía queda en la memoria de los aficionados.</p>\n\n<p>2015 no empezó mejor para el equipo europeo que después de ganar la LCS no pudo pasar del séptimo puesto en el Split de primavera de 2015, algo decepcionante que hizo retumbar los cimientos de la organización. El Split de verano iba a ser otro nuevo comienzo para Elements, pero no pudieron más que repetir la séptima posición. Para esta nueva temporada todo ha cambiado, en la LCS 2016 Elements busca una nueva dirección. ¿Conseguirán reconducir la dinámica negativa de la última temporada?</p>","fr_FR":"<p>Le FC Schalke 04 a une histoire très riche. Ce club sportif allemand a fêté son centenaire en 2004 et est le deuxième plus grand club d’Allemagne. Rien que ça. Plus de 100 000 membres y sont licenciés et le club possède des sections dans les plus grandes disciplines sportives comme le basket-ball, le handball, l’athlétisme, le tennis de Table et évidemment le football. Et depuis le mois de mai 2016, le FC Schalke 04 a mis un pied dans l’e-sport en choisissant d’investir dans une équipe League of Legends, rachetant l’équipe Elements et devenant le second club sportif à acheter une équipe League of Legends après l’équipe turque Beşiktaş au début de l’année 2015.</p> \n\n<p>Seul un joueur a été remplacé lors de la transition : le Français Jérémy « Eika » Valdenaire, au profit du Suédois Hampus « Fox » Myhre. Fox rejoint donc le cinq majeur dont les autres membres sont le Français Etienne « Steve » Michels au top, l’Allemand Berk « Gilius » Demir dans la jungle, le Danois Rasmus « MrRallez » Skinneholm en botlane et le Suédois Hampus « sprattel » Abrahamsson en support.</p>  \n\n<p>Ces joueurs vont pouvoir profiter d’un encadrement expérimenté qui devrait les mettre dans les meilleures conditions pour préparer leur saison. Le centre de formation de l’équipe de football a formé certains des meilleurs joueurs du monde, le club sait donc comment donner les armes à ses joueurs pour exprimer leur plein potentiel. L’avenir nous dira si le même destin attend la section League of Legends !</p> \n"},"foreignIds":{"drupalId":"3659"},"players":[233,490,824,1337,1376,1377,1752,2013],"starters":[233,824,1337,1376,1377],"subs":[490,1752,2013]}],"players":[{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":233,"slug":"smittyj","name":"Smittyj","firstName":"Lennart ","lastName":"Warkus","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smittyj-8owo56ml.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2017-03-28T15:13:21.000Z","bios":{"en_US":"<p>\nLennart \"SmittyJ\" Warkus isn't afraid to hop, jump, dive, or charge his way into the enemy team. SmittyJ's aggression often has a purpose though -- if he causes enough chaos in the enemy ranks, his teammates can cut through them like a knife through warm butter.\nUnfortunately for SmittyJ, his dives often leave him up the proverbial creek without a paddle. Or, maybe more accurately, stranded in the Baron pit without a dash to escape over the wall. \n</p>\n<p>\nAfter a short stint in North America with Team Dignitas, Smittyj headed home to Europe to compete with Giants Gaming. They hope to turn his aggression into something special, but his aggression may be punished heading into his first full EU LCS Split.\n</p>","fr_FR":"<p>Lennart « Smittyj » Warkus est le nouveau top laner de Dignitas, tout droit débarqué des Challenger series... européennes ! Comme de nombreux joueurs professionnels et semi-professionnels ces dernières années, Smittyj a traversé l'Atlantique pour rejoindre une équipe nord-américaine.</p>\n\n<p>Auparavant, ce joueur allemand de 19 ans a passé pas loin de deux ans à arpenter la deuxième division professionnelle dans l'espoir de percer au plus haut niveau. En saison 4, avec SK Prime, le jeune joueur est parvenu à se qualifier en deuxième position pour le tournoi de promotion/relégation, mais a dû s'avouer vaincu face à des Gambit Gaming largement supérieurs. Même scénario lors du segment de printemps de la saison 5, cette fois en tant que top laner de Gamers 2. Pire, lors de cette saison des Challenger series, Smittyj et ses camarades n'ont même pas réussi à se qualifier pour le tournoi de promotion/relégation, ratant la 3e place qualificative de peu, lors d'une défaite 2 victoires à 1 face à Reason Gaming.</p>\n\n<p>Qu'à cela ne tienne, l'Allemand ne s'est pas découragé et a eu de nouveau l'occasion de toucher le graal à l'issue de la saison estivale des Challenger series de la saison 5. Une fois de plus, son équipe et lui ont perdu en demi-finale des play-offs face à Dignitas, par la suite qualifiée aux LCS EU, mais ils ont cette fois su se reprendre à temps pour arracher la troisième place qualificative des mains de Denial Esports. Au niveau individuel, Smittyj en a profité pour remporter sa voie par deux fois face à Mike « Wickd » Petersen, ancienne gloire de League of Legends. Tout un symbole.\nAutre symbole, la victoire de Gamers 2 et SmittyJ en tournoi de relégation face à l'une des plus anciennes organisations européennes du jeu, SK Gaming, vaincus 3-2 et boutés hors des LCS par le jeune top laner et ses coéquipiers.</p>\n\n<p>Sa qualification au plus haut niveau enfin en poche, Smittyj aurait pu tranquillement se préparer à découvrir les LCS EU, mais il a préféré repartir à nouveau à l'aventure, cette fois sur le serveur nord-américain au sein de l'équipe Dignitas, ce qui implique forcément beaucoup plus de pression de la part des fans et du grand public. Changement de rythme assez brutal pour le joueur qui, avec son manque d'expérience en LCS, peine à obtenir des résultats suffisants dans l'écurie Dignitas. Peu à peu, son style de jeu se confirme et bientôt, SmittyJ devient un joueur agressif, n'ayant pas peur de s'engouffrer dans des situations hasardeuses sur la voie du haut.</p>\n\n<p>Après une année en dents de scie en Amérique, le joueur revient en Europe en tant que toplaner titulaire pour les Giants Gaming. SmittyJ est prêt à relever le défi une nouvelle fois, avec une place en LCS Europe qu'il a longuement attendu.</p>\n","pl_PL":"<p>Lennart \"Smittyj\" Warkus  jest członkiem profesjonalnych drużyn League of Legends od początku czwartego sezonu. Zaczynał w lutym 2014 roku, w mało znanej drużynie COREPLAY, lecz już po miesiącu trafił do SK Gaming Prime. Pod skrzydłami tej organizacji nabrał doświadczenia na esportowej scenie. Jednak po połowie roku stwierdził, że tam nie odniesie sukcesu, więc opuścił tą drużynę i szukał szczęścia gdzie indziej. Ostatecznie, w lutym 2015 roku, dołączył do Gamers2, później przemianowanych na G2 Esports. Dopiero w tym zespole \"Smittyj\" miał okazję się zrealizować, biorąc udział w Challenger Series. W tych rozgrywkach pokazał jak umiejętnym jest zawodnikiem, kończąc na szczycie tabeli z wynikiem 8:2. Równie dobrze poszło mu w meczach barażowych, aż w końcu stanął przeciwko weteranom EU LCS – SK Gaming.</p>\n<p>\nPrzed grą z SK Gaming o wejście do EU LCS \"Smittyj\" był bardzo pewny siebie i swoich umiejętności. W nagraniu internetowym G2 Esports „Road to LCS” oświadczył, że pokona junglera przeciwników z łatwością. Co prawda nie była to dziecinna igraszka, jak zapowiadał, ale i tak bardzo doświadczony \"fredy122\" został przez niego znokautowany. Dzięki wygranej 3:2 z SK Gaming zakwalifikował się wraz z drużyną do wiosennego sezonu 2016 EU LCS, co było jego największym osiągnięciem w karierze gracza.</p>\n<p>\nNie dane mu jednak było wystąpić w Europie, gdyż jego umiejętności zaimponowały również analitykom zza oceanu. \"Smittyj\" został przez nich nazwany „niedocenianym, młodym talentem, który może wkrótce rozkwitnąć”. W listopadzie 2015 roku dołączył do Team Dignitas, jednej z najstarszych i niezatapialnych drużyn w League of Legends. Wiązało się to oczywiście z przeprowadzką młodego Niemca do Stanów Zjednoczonych, co przyjął zaskakująco dobrze. Jego debiut w ich szeregach miał miejsce na top-lanie w wiosennym sezonie 2016 NA LCS. </p>\n<p>\nZ wszystkich bohaterów najbardziej przepada za Riven, aczkolwiek równie dobrze gra innym postaciami na top-lanie. Wszechstronność jest zaletą Lennarta - świetnie sobie radzi zarówno asasynami jak i obrońcami, bądź molochami. Opierając się na swoich umiejętnościach udało mu się dostać do Kręgu Pretendenta w Europie. Oprócz uniwersalności w League of Legends wyróżnia go wrażliwość na ludzką krzywdę. Aktywnie bierze udział w streamowaniu na rzecz dzieci współpracując z organizacjami charytatywnymi. </p>\n","de_DE":"<p>Der Deutsche Lennart \"SmittyJ\" Warkus startete ursprünglich mit G2 im Jahr 2015 durch, spielte im letzten Split für Team Dignitas und ist nun Top-Laner für Giants! Gaming. Er konnte viel Erfahrung in den letzten Monaten sammeln und ist kein Neuling mehr in der Szene. SmittyJ ist bekannt für sein Selbstvertrauen, denn laut ihm ist er der beste Top-Laner den es gibt. Im ist keine Herausforderung zu groß, und die nächste Aufgabe ist es, die Giants wieder ins Spiel zu bringen. Mit seinen Lieblingschampions Maokai und Fiora hat SmittyJ eine Killbeteiligung von über 75% und ist oftmals die tragende Kraft in den Teamkämpfen. Er bezeichnet sich selber als guten Shotcaller und erweitert stets seine Auswahl an Champions – ihm sind keine Grenzen gesetzt. </p>\n\n<p>“Was ich für das Team mitbringe? Ich kann ziemlich gut shotcallen, außerdem bin ich einfach gut, also..das bringe ich mit.” - Lennart \"SmittyJ\" Warkus</p>\n"},"foreignIds":{"drupalId":"2902","TRLH1":"1001220074","TRLH2":"1001160124","TRLH3":"200000230","TRLH4":"200000082","FRA1TMNT2":"25044","ESPORTSTMNT02":"200001004"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":490,"slug":"steve","name":"Steve","firstName":"Etienne","lastName":"Michels","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/steve-homsdwkp.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-05-20T14:49:17.000Z","updatedAt":"2017-03-26T09:35:58.000Z","bios":{"en_US":"<p>\nEtienne “Steve” Michels launched his career with ROCCAT during the 2015 EU LCS Summer Preseason, replacing Overpow as their starting top laner. Steve brought several years of amateur experience, but he was still an EU LCS rookie and had the inconsistent play to prove it. In 2016, Steve and Schalke were huge underdogs heading into the Spring Split. Their play was enough to hang onto 7th place and re-qualify for the Summer Split.\n</p>\n<p>\nSteve has always been a crowd favorite though, making a name for himself as a great split pusher and all-around team player. This split will be a test to find out just where Steve lies in Europe’s sea of talent. Schalke has remained largely the same, paving the way for Steve to make this Split a proving grounds for himself. Let there be no doubt, the chants of “Steeeeeeeeeeeeve!” will still be heard around the world, let’s just hope he answers the call.\n</p>","fr_FR":"<p>La France est particulièrement bien fournie en toplaners. Après le vétéran Paul « sOAZ » Boyer et Lucas « Cabochard » Simon-Meslet, le public a pu découvrir Etienne « Steve » Michels. Ayant débuté sur League of Legends dès ses prémices, Steve n’a pas tout de suite été tenté par la compétition, mettant ses études au premier plan. En 2015, il rejoint le projet Sparta, dans le but de tenter la qualification aux LCS via le tournoi d’expansion. L’équipe ayant échoué dans son entreprise, Steve rejoint l’équipe LDLC pour continuer à jouer au niveau français. C’est à ce moment-là que sa carrière décolle. Steve est repéré par l’équipe ROCCAT lors de la pré-saison estivale des LCS EU 2015, qui lui propose de remplacer Overpow au poste de toplaner titulaire. Il avait dans ses bagages quelques légères années d'expérience sur la scène amateur, mais il restait néanmoins un débutant propulsé aux LCS EU. Son inexpérience au niveau professionnel lui a coûté cher dès les premières semaines du segment d'été et les équipes adverses en abusaient.</p>\n<p>Mais très vite, le Français a redressé la tête durant la seconde moitié de la saison et son KDA moyen est passé de 1,9 (semaines 1 à 5) à 4,4 (semaines 6 à 10). Sa confiance en ses capacités et, plus important encore, la confiance que ses équipiers plaçaient en lui étaient bien plus grandes. Les spectateurs berlinois ont également soutenu le toplaner dès ses premières apparitions, visiblement séduits par son sourire permanent. Les progrès de Steve ont hissé permis à ROCCAT d’atteindre la 5e place du segment d'été des LCS EU 2015 et de participer aux play-offs. </p>\n<p>Début 2016, Steve rejoint l’équipe Elements in-extremis. Aux côtés de son compatriote Jérémy « Eika » Valdenaire, il donne le meilleur de lui-même dans un championnat très disputé mais le milieu de saison est très difficile. L’équipe parvient tout de même à sécuriser la 7e place, qui n’offre pas de ticket pour les play-offs mais qui dispense de tournoi de relégation. À l’intersaison, le spot Elements est racheté par l’équipe sportive FC Schalke 04. Fort d’un encadrement très sérieux et expérimenté, Steve pourra peut-être enfin s’épanouir cette saison !\n</p>","es_ES":"<p>Etienne 'Steve' Michaels comenzó su carrera profesional durante la pretemporada del Split de verano de la LCS EU 2015, reemplazando a Overpow como el top titular. Steve traía bajo el brazo varios años de experiencia en la competición amateur, pero no dejaba de ser un novato, cosa que pagó en las primeras semanas del Split de verano de la LCS EU 2015 con una actuación lejos del nivel esperado.</p>\n<p>Pero Steve no cejó en su empeño y mejoró sensiblemente su rendimiento en la segunda mitad de la temporada, pasando de un KDA de 1.9 (jornadas 1 a 5) a 4.4 (jornadas 6 a 10). Con un aumento significativo no sólo en su confianza sino en la del resto del equipo. La mejora de Steve llevó a ROCCAT a la tercera posición en el Split de verano de la LCS EU 2015, y eventualmente aseguró una plaza en un nuevo equipo de cara al Split de primavera de la LCS EU 2016, Elements. No podemos esperar a ver a los aficionados aclamarlo con su grito preferido: \"¡¡Steeeeevveeeeeeee!!\".</p>","pl_PL":"<p>Etienne rozpoczął swoją przygodę z League of Legends bardzo wcześnie, gdyż zdominował amerykański serwer przed powstaniem europejskiego. Zanim się przeniósł na ten drugi, udało mu się znaleźć wśród 30 najlepszych graczy w regionie. Na amatorskiej scenie pojawił się w 2013 roku, grając w wielu drużynach konkurujących w Kręgu Pretendenta. Przed zaangażowaniem się w rozgrywki 5v5, w pierwszym i drugim sezonie „Steve” uznawał za swoją główną rolę AD Carry. Dopiero udział w drużynowych konkurencjach sprawił, że przeniósł się na top-lane. Posunął się nawet do tego, że po liceum wziął rok wolnego żeby się skupić na swojej karierze profesjonalnego gracza. Jednak ani przenosiny na inną linię ani rezygnacja z pójścia na studia nie przyniosły mu upragnionych osiągnięć. Dopiero kiedy wrócił na studia fizyki w inżynierii dostał szansę na wykazanie się od drużyny Sparta. W październiku 2014 roku przeniósł się do domu graczy w Paryżu należącego do tej organizacji. Wraz z nią wziął udział w Europejskim turnieju rozszerzającym ilość drużyn w rozgrywkach LCS. Niestety znowu bez sukcesu. </p>\n<p>\n„Steve” miał okazję pokazać się społeczeństwu dopiero kiedy zastąpił Remigiusza \"Overpow\" Puscha w zespole Roccat. Od maja 2015 roku przejął górną aleję w tej ekipie i wreszcie miał okazję zaprezentować co potrafi szerszej publice. W szeregach „niebieskiego kota” osiągnął największy sukces – zajął piąte miejsce w letnim sezonie EU LCS 2015. Jak na debiutanta to naprawdę imponujący wyczyn. Jednak nie pozostawił widzom wątpliwości, że w pełni zasłużył na podziw. Wielokrotnie broniony przez Etienna top-lane stawał się ostoją całej drużyny, pomimo tego, że nie grał swoimi ulubionymi bohaterami – Ryzem i Irelią. Stał się znany z niesamowitych zagrań Maokaiem, którego najczęściej można było podziwiać właśnie w jego wydaniu. Wielu fanów utrzymuje, że największe wrażenie na nich zrobiła jego gra Ekko – w lecie wygrał wszystkie mecze, w których wybrał Chłopca, Który Ujarzmił Czas.</p>\n<p>\n„Steve”, pomimo tego, że urodził się we Francji, miał okazję mieszkać w Belgii i Arabii Saudyjskiej – co bardzo wyróżnia go wśród innych graczy. Kolejnym znaczącym kontrastem była jego zdolność do połączenia pasji gry na komputerze z klasycznym sportem. W swoim regionie osiągnął wiele w lidze badmintona.\n</p>","de_DE":"<p> „Er ist sehr bescheiden.“ Worte, mit denen Jakob \"YamatoCannon\" Mebdi seinen damaligen Top-Laner beschrieb. Ein Attribut, was nicht vielen Spielern der oberen Liga zugutekommt, da mit guten Spielern oftmals ein großes Ego einhergeht. Mit Nettigkeit kommt man nicht voran? Steve beweist das Gegenteil, denn hinter dem sanften Gemüt steckt viel Ehrgeiz und die feste Entscheidung im eSports etwas zu erreichen. </p>\n<h2><p>Ein steiniger Weg</p></h2>\n<p>Doch der Weg war kein leichter. Sein Eintritt in League war gleich zu Beginn des Spiels im Jahre 2009. Ohne weitere Hintergedanken kam er schnell unter die Top 200 und erste Gedanken an eine Karriere kamen auf. Mit Beginn der dritten Saison kam der erste große Schritt zur Umsetzung des Plans. Er wählte die Top-Lane zu seiner Bestimmung, da er Jarvan IV. sehr gerne spielte und hielt erstmals nach Amateurteams Ausschau. </p>\n<p>Wie bei so Vielen folgte ein langer Weg vom einen Challenger Team zum nächsten, da sich die Teams schon nach den ersten Misserfolgen wieder schnell auflösten. Unter anderem auch die Eigenkreationen des Hobbykeksbäckers mit seinem Team „Steve Bakes Cookies“. So richtig los ging es erst, als YamatoCannon auf ihn aufmerksam wurde, nachdem er durch seine Art immer wieder von ehemaligen Kollegen empfohlen wurde. </p>\n<p>Wohlgleich noch der Franzose noch sehr unvertraut mit dem von da an immer größer werdenden Publikum war, lieferte er einen sehr starken Split ab. Er war maßgeblich an dem zufriedenstellenden fünften Platz seitens ROCCAT beteiligt. Vor allem durch sein starkes Erscheinen auf Maokai und Ekko verhalf er dem Team vermehrt zu Siegen. Nicht ohne Grund waren die „Steeeeve“ Rufe im LCS Stream nicht zu überhören. </p>\n<p>Die Reise geht nun weiter. Das ruhige Gemüt wird zukünftig eines der fünf Elemente in Elements sein. Nicht als Feuer und Flamme, sondern als standfestes Rückgrat des Teams. Während des Spiels, aber auch danach im persönlichen Zusammenleben mit seinen wieder einmal neuen Kollegen. </p>\n"},"foreignIds":{"drupalId":"1940","TRLH3":"200000255","TRLH4":"200000307","TRLH2":"1001250001","FRA1TMNT2":"25416","ESPORTSTMNT02":"200001025"},"socialNetworks":{"twitch":"http://www.twitch.tv/rocsteve","facebook":"https://www.facebook.com/LolIAmSteve?_rdr=p"},"champions":[],"liveGameTeam":55},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1337,"slug":"memento","name":"Memento","firstName":"Jonas","lastName":"Elmarghichi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/memento-2s3o4ejq.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:46:29.000Z","updatedAt":"2017-06-18T19:39:23.000Z","bios":{"en_US":"<p>Jonas \"Memento\" Elmarghichi was originally a solo queue star before kickstarting his professional career in 2015. He then joined Team ROCCAT as their starting jungler in mid 2016. He, along with the entire team, struggled in the LCS and eventually had to play in the EU LCS Promotion Tournament in order to re-enter the league. After struggling with ROCCAT, Memento looked for other opportunities to showcase his abilities and landed with Giants Gaming in early 2017. While his play hasn’t been astounding by any stretch, he’ll have another shot to prove that he belongs with the best in Europe when spring rolls around.</p>","de_DE":"<p>Jonas „Memento“ Elmarghichi war ursprünglich ein Star der Solo-Warteschlange, bevor er seine Profikarriere 2015 gestartet hat. Er ist Mitte 2016 Team ROCCAT als Jungler beigetreten. Allerdings hatten er und der Rest des Teams große Schwierigkeiten in der LCS und schließlich mussten sie sich im „EU LCS“-Aufstiegsturnier den Weg zurück in die Liga erkämpfen. Nach den Problemen mit ROCCAT hat sich Memento nach anderen Möglichkeiten umgesehen, um seine Fähigkeiten zu zeigen. Anfang 2017 ist er dann bei Giants Gaming gelandet. Obwohl seine Leistung nicht außergewöhnlich war, kann er im Frühjahr erneut beweisen, dass er zu den Besten Europas gehört.</p>"},"foreignIds":{"TRLH4":"200000199","TRLH3":"200000096","ESPORTSTMNT02":"200002451"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1376,"slug":"norskeren","name":"Norskeren","firstName":"Tore","lastName":"Hoel Eilertsen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/norskeren-f5d7bkuf.png","hometown":null,"region":"Challenge France","birthdate":null,"createdAt":"2016-06-17T20:14:37.000Z","updatedAt":"2017-08-17T15:27:52.000Z","bios":{"en_US":"","fr_FR":"Dans son pays d'origine, le joueur norvégien a joué dans plusieurs équipes, participant à des tournois nationaux et des LANs. C'est en avril 2016 qu'il rejoint la structure professionnelle allemande mousesport. Finalement, il préférera retourner en Norvège pour jouer dans l'équipe Riddle eSports, la meilleure équipe du pays. \n<br />\nRéperé par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires."},"foreignIds":{"TRLH1":"1001360009","esportstmnt05":"200000939","ESPORTSTMNT02":"200002448","TRLH4":"200000354","TRLH3":"200000354"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1377,"slug":"upset","name":"Upset","firstName":"Elias","lastName":"Lipp","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/upset-f4z7h6wr.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-20T17:58:58.000Z","updatedAt":"2017-05-09T22:41:05.000Z","bios":{},"foreignIds":{"TREU1":"1000585051","TREU":"1000585051","ESPORTSTMNT02":"200001007","TRLH3":"200000233","TRLH4":"200000085","TRLH1":"200000423"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1752,"slug":"rexxx","name":"1 Rexxx","firstName":"Erik","lastName":"Reisswig","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rexxx-5uhnncsw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-30T20:08:17.000Z","updatedAt":"2017-07-07T18:06:26.000Z","bios":{},"foreignIds":{"TRLH3":"200000235","TRLH4":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":2013,"slug":"nikola-senpai","name":"Nikola Senpai","firstName":"Nikola","lastName":"Djordjevic","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nikola-senpai-3z4qiutz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:23:59.000Z","updatedAt":"2017-08-06T14:35:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002453","TRLH4":"200000454"},"socialNetworks":{},"champions":[],"liveGameTeam":55}],"scheduleItems":[{"id":"AVIUlUQkOPWArxM1l4ZG","content":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:match:45b62b47-4811-479e-9230-6c56392d9678","scheduledTime":"2016-03-18T17:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:bracket:47deb68d-7d32-49b5-9f6a-490ccf9dfee6"},"match":"45b62b47-4811-479e-9230-6c56392d9678","tournament":"33651c33-83f7-48f1-8e2f-9f5a5f641989","bracket":"47deb68d-7d32-49b5-9f6a-490ccf9dfee6","league":"3"}],"gameIdMappings":[{"id":"0e463dd3-dabe-4f73-8e2e-5c10a4ea922f","gameHash":"52364c379e70a863"}],"videos":[{"id":2209,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:game:0e463dd3-dabe-4f73-8e2e-5c10a4ea922f","source":"https://www.youtube.com/embed/Esz96P24Pj8?wmode=transparent","createdAt":"2016-03-18T19:01:37.000Z","updatedAt":"2016-03-18T19:01:37.000Z","game":"0e463dd3-dabe-4f73-8e2e-5c10a4ea922f"}],"htmlBlocks":[],"match":{"id":"45b62b47-4811-479e-9230-6c56392d9678","name":"H2K-vs-EL","position":28,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"},{"roster":"38c4e52a-a784-43f2-a98a-5b660ffb6903"}],"games":{"0e463dd3-dabe-4f73-8e2e-5c10a4ea922f":{"id":"0e463dd3-dabe-4f73-8e2e-5c10a4ea922f","name":"G1","generatedName":"EL|H2K|G1|45b62b474811479e9230","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"},{"roster":"38c4e52a-a784-43f2-a98a-5b660ffb6903"}],"standings":{"result":[[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"}],[{"roster":"38c4e52a-a784-43f2-a98a-5b660ffb6903"}]],"timestamp":1458323498131,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001580084","gameRealm":"TRLH3","platformId":"TRLH3:1001580084","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"}],[{"roster":"38c4e52a-a784-43f2-a98a-5b660ffb6903"}]],"timestamp":1458323498131,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}