{"teams":[{"id":18,"slug":"cloud9","name":"Cloud9 ","guid":"be6c8a00-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cloud9-gnd9b0gn.png","acronym":"C9","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-01T18:45:39.000Z","updatedAt":"2017-08-02T22:06:55.000Z","bios":{"en_US":"<p>The dream meme team is back for 2017 with some promising new additions. Although Cloud9 performed the best of any North American team at the 2016 World Championship, they weren’t satisfied with their quick exit in the quarterfinals. Former Challenger scene standout Contractz was handed the reigns to the jungle in his rookie season. The team also acquired Ray, Apex Gaming’s former playmaking top laner. \n\n<p>Despite a strong split, the team once again fell to TSM in the 2017 NA LCS Spring Split finals. Heading into summer, if Cloud9's young players can hone their raw talent, the team could rise to new heights this year.</p>\n\n<p>Coach: Han-gyu \"Reapered\" Bok<p>","fr_FR":"<p>Cloud9 a fait une entrée fracassante sur la scène compétitive de League of Legends pendant la saison 3, lors du segment d'été des LCS NA, avec un score astronomique de 25-3. Suite à ses débuts spectaculaires, l'équipe a fait plusieurs apparitions lors de championnats régionaux et internationaux, allant des play-offs régionaux des LCS NA au Championnat du monde. Toutefois, Cloud9 est tombée de son piédestal en 2015, retombant à la 7e place du segment d'été des LCS NA 2015. Malgré un parcours bien ficelé jusqu'en finale du tournoi régional NA 2015 qui a valu à C9 de se qualifier pour le Championnat du monde 2015, les performances de l'équipe ont soulevé de nombreuses questions. Reste à savoir si ses membres possèdent encore le talent nécessaire pour s'imposer comme ils ont su le faire par le passé.</p>","pl_PL":"<p>C9 to, obok Teamu SoloMid, najbardziej utytułowana amerykańska organizacja w historii. Cloud9 znane jest z utrzymywania nieustannie wysokiego poziomu oraz przywiązania do graczy. Podczas gdy inne drużyny dokonują co najmniej kilku zmian rocznie, w zespole, której symbolem jest niebieska chmurka, przez pierwsze dwa lata współpracy… nie było żadnych rotacji.</p>\n<p> \nZaczęło się zwyczajnie, od przygody z Quantic Gaming, gdzie w 2012 roku występował obiecujący skład złożony z Haia, LemonNationa, Nientosoha, Wild Turtle’a i Yazukiego. Pierwsze podejście drużyny do NA LCS było nieudane, ale na początku 2013 roku gracze i organizacja zdecydowali się dać sobie drugą szansę w nieco zmienionym składzie, a do zespołu dołączyli Balls, Meteos i Sneaky. Formacja bez trudu przeszła eliminacje i po zwycięstwie w meczu barażowym dostała się do letniego splitu NA LCS 2013. Miała to być dopiero druga edycja rozgrywek, a jednocześnie początek legendy Cloud9.</p>\n<p>\nByło powszechnie wiadomo, że nowy zespół w stawce jest naprawdę dobry, ale nie że aż tak dobry. Cloud9 całkowicie zdominowało rozgrywki, ustanawiając niewyobrażalny rekord 25-3, bo tyle wynosił bilans drużyny na koniec sezonu zasadniczego. C9 nie zamierzało jednak poprzestawać na wygraniu sezonu zasadniczego i w play-offach poszło za ciosem – 2:0 z Dignitas i 3:0 z TSM-em w finale zapewniły beniaminkowi triumf w debiutanckim splicie w NA LCS.</p>\n<p>\nTo z kolei pozwoliło Cloud9 na wyjazd na Mistrzostwa Świata. Oczekiwania kibiców były ogromne, ale zespół nie sprostał presji, odpadając z rywalizacji w swoim pierwszym meczu, w ćwierćfinale przeciwko Fnatic. Tę klęskę C9 powetowało sobie na krajowym podwórku – rok 2014 znów stał pod znakiem niebieskobarwnej dominacji, czego dowodzi kolejny fantastyczny split zakończony wynikiem 24-4 i triumf w wiosennych play-offach. Latem z formą zespołu było już nieco gorzej, a wygranie fazy zasadniczej przyszło C9 z dużym trudem. Ostatecznie w finale play-offów Cloud9 było zmuszone uznać wyższość Teamu SoloMid. Wystarczyło to, by po raz kolejny pojechać na światowy czempionat i niestety po raz kolejny zawodnicy C9 wracali ze spuszczonymi głowami po odpadnięciu w ćwierćfinale.</p>\n<p>\nWiosna 2015 była już łabędzim śpiewem formacji, której po raz kolejny udało się dostać do finału play-offów NA LCS. Tam jednak nie sprostali świetnie dysponowanemu Teamowi SoloMid, który po raz drugi z rzędu zwyciężył w rozgrywkach, jednocześnie po raz drugi spychając C9 na drugą pozycję.</p>\n<p>\nTo jednak był dopiero początek problemów zespołu, który coraz bardziej oddalał się od swoich najlepszych czasów. Narastające wewnętrzne problemy oraz uciążliwe kontuzje zmusiły Haia „Haia” Lama do rezygnacji z występów. Legendę zespołu zastąpił na środkowej alei ogromny duński talent, Nikolaj „Incarnati0n” Jensen, który został właśnie dopuszczony do grania na profesjonalnej scenie. Szybko okazało się jednak, że Incarnati0n potrzebuje trochę czasu na aklimatyzację, a cały zespół – Haia. Zastąpienie doświadczonego shot-callera okazało się niemożliwe i gra zespołu, który okupował dolne rejony tabeli, nie wyglądała najlepiej. Hai wrócił, zastępując Williama „Meteosa” Hartmana w roli dżunglera i doprowadził formację do utrzymania, a dzięki niezłej wiośnie, drużyna dostała się również do baraży o wyjazd na Mistrzostwa Świata. I znów – udało się. Co ciekawe, C9 było w tym splicie bliskie odpadnięcia z rywalizacji, a bezpieczne, siódme miejsce wywalczyło dopiero w dodatkowym meczu barażowym przeciwko Teamowi 8.</p>\n<p>\nNa MŚ, po pierwszej rundzie fazy grupowej, wydawało się, że sen C9 będzie trwał – drużyna wygrała wszystkie trzy mecze i mogło było odnieść wrażenie, że tylko kataklizm może pozbawić ją miejsca w ćwierćfinale. No cóż – trzy porażki i przegrana w barażach o drugie miejsce okazały się właśnie takim kataklizmem. Nie udało się. Zespół przygotowuje się do sezonu 2016 bogatszy o ostatnie doświadczenia i zamierza powrócić na pierwsze miejsce, a pomóc mają interesujące zmiany w składzie.</p>\n<p>\nW przerwie między rozgrywkami Hai przeniósł się na pozycję wspierającego, którą pełnić będzie wespół z utalentowanym Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity. Pozycję dżunglera zajął natomiast rozchwytywany po rozpadzie Teamu Impulse Koreańczyk Lee „Rush” Yoon-jae, który był objawieniem sezonu 2015 w NA LCS.</p>\n","de_DE":"Das Meme-Dream-Team kehrt 2017 mit einigen vielversprechenden Neuzugängen zurück. Obwohl Cloud9 das beste nordamerikanische Team bei der Weltmeisterschaft 2016 war, gaben sie sich mit dem schnellen Ausscheiden im Halbfinale nicht zufrieden. Contractz, der vor allem durch seine Leistungen in der Challenger Series bekannt wurde, übernimmt in seiner ersten Saison die Führung im Dschungel. Das Team hat außerdem Ray aufgenommen, der früher als Spielmacher bei Apex Gaming in der oberen Lane tätig war. Wenn sie es schaffen, ihr rohes Talent mit den Führungsqualitäten der Veteranen zu kombinieren, könnte Cloud9 dieses Jahr neue Höhen erklimmen.</p>\n<p>\nCoach: Trainer: Han-gyu „Reapered“ Bok</p>\n","es_ES":"<p>Nadie puede discutir que el camino para llegar al Mundial de Cloud9 ha sido más duro que el de ningún otro equipo. Tras una dolorosa derrota contra TSM en la final de la LCS NA, el equipo consiguió una vez más superar el clasificatorio regional y reservarse el último puesto para representar a Norteamérica en el Mundial. Ha sido un viaje agotador, pero la experiencia seguro que no tiene precio. Cloud9 ya ha jugado cinco enfrentamientos al mejor de 5 sin haber pisado aún siquiera el escenario del Mundial.</p> \n<p>Tras una temporada regular durante la que tuvieron problemas de coordinación en algunos momentos, han jugador de forma mucho más coherente durante los playoffs. Si pueden sacar provecho de su arduo camino hasta el Mundial, van a ser una fuerza a tener en cuenta en el escenario internacional.</p>","pt_BR":"É difícil negar que alguma outra equipe teve um caminho mais árduo para o Mundial do que a Cloud9. Depois de uma derrota arrasadora para a TSM nas Finais de Verão da NA LCS, a equipe se reergueu e lutou mais uma vez pelas Classificatórias Regionais para conseguir a última vaga da América do Norte para o Mundial. A jornada foi difícil, mas a experiência pode ter sido de grande valor. Cloud9 agora já jogou cinco partidas separadas de Melhor de 5 antes mesmo de ir para o Mundial. Depois de uma temporada regular que mostrou algumas dificuldades em sinergia, eles estavam muito mais coesos nas eliminatórias. Se eles puderem usar seu árduo caminho para o Mundial como uma vantagem, eles certamente serão uma força a ser reconhecida no palco internacional","es_AR":"<p>Es muy difícil encontrar un equipo que haya luchado más que Cloud9 para llegar al Mundial. Después de una desgarradora derrota ante TSM en la final del torneo de clausura de la LCS NA, el equipo se repuso y volvió a competir en las clasificatorias regionales para ganarse el último boleto de Norteamérica al Mundial. Fue una hazaña agotadora, pero la experiencia obtenida es una recompensa invaluable. Cloud9 ya ha jugado cinco combates al mejor de cinco antes de aparecer en el Mundial. Aunque tuvieron problemas para trabajar bien en grupo en la temporada regular, supieron complementarse mucho más en las eliminatorias. Si saben aprovechar la experiencia obtenida en el arduo camino que atravesaron para llegar al Mundial, serán una fuerza que dejará su huella en el escenario internacional.</p>\n\n<p><strong>Entrenador: Han-gyu \"Reapered\" Bok</strong></p>"},"foreignIds":{"drupalId":"304"},"players":[45,115,163,255,482,499,508,1120],"starters":[45,115,482,499,1120],"subs":[163,255,508]},{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]}],"players":[{"id":45,"slug":"impact","name":"Impact","firstName":"Eonyoung","lastName":"Jeong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/impact-8a44ib2j.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-07-04T19:26:43.000Z","bios":{"en_US":"<p>Former World Champion Eonyoung “Impact” Jeong isn’t quite ready to hang up the mouse and keyboard. The former SK Telecom T1 top laner put on a show in the 2016 NA LCS Playoffs, proving no other top laner in North America measured up. While his regular season was uninspiring, he almost singlehandedly earned Cloud9 a spot at the 2016 World Championship.</p>\n\n<p>Unfortunately, Impact struggled to find his groove on the world stage. Cloud9 was the only NA team to earn a quarterfinals berth, but they were quickly eliminated by Samsung Galaxy. As the shield to Ray's sword, the dynamic duo dominated the competition in the 2017 NA LCS Spring Split. With such talent in the top lane, Cloud9’s opponents’ nightmares will be just two words, repeating forever: “top die.”</p>","fr_FR":"<p>L'ancien champion du monde Eonyoung \"Impact\" Jeong n'est pas prêt à raccrocher souris et clavier. Après un segment d'été des LCS NA peu inspiré, l'ancien top laner de SK Telecom T1 a eu le vent en poupe durant les play-offs. Aucun autre top laner en Amérique du Nord n'est arrivé à la hauteur de ses performances lors des play-offs, et Cloud9 doit une grande partie de son succès post-saison à son jeu spectaculaire, ce qui a également permis de mettre un terme aux problèmes de communication qui affectaient Cloud9.</p>\n\n<p>En dépit de sa domination régionale, Impact a eu du mal à trouver ses marques dans le Championnat du monde cette année. Alors qu'il s'est montré inébranlable sur la voie du haut pour Cloud9 durant les play-offs, il a trouvé des adversaires à sa hauteur avec les top laners Duke de SK Telecom T1 et CuVee de Samsung Galaxy. Toutefois, Impact et les autres joueurs de Cloud9 ont le mérite d'être la seule équipe d'Amérique du Nord à avoir atteint les quarts de finale, et Impact les représentera lors de l'événement All-Stars. Avec 41,7 pour cent du vote top laner, il aura une chance supplémentaire cette année de \"déchirer la voie du haut\".</p>","pl_PL":"Były Mistrz Świata, Eonyoung „Impact” Jeong, nie zamierza jeszcze zawiesić na kołku mysz i klawiatury. Po niezbyt udanych występach w letnim splicie NA LCS dawny górny SKTelecom T1 szalał w fazie pucharowej. Żaden inny górny w Ameryce Północnej nie dorównywał formą Impactowi podczas playoffów, a Cloud9 zawdzięczają w dużej mierze swój sukces po sezonie jego znakomitej grze. Rozwiały się także wątpliwości dotyczące problemów z komunikacją wewnątrz Cloud9.\n</p>\nPomimo dominacji w regionie, Impact nie potrafił odnaleźć się w tym roku na Mistrzostwach Świata. Chociaż podczas fazy pucharowej na górnej alei Cloud9 był nie do ruszenia, znalazł równych sobie w postaci górnego SK Telecom T1, Duke’a i CuVee z Samsung Galaxy. Mimo to, Impact i reszta Cloud9 zasługują na uznanie jako jedyna drużyna z Ameryki Północnej, która dotarła do ćwierćfinałów. Wkrótce Impact będzie ją reprezentował na wydarzeniu All-Star. Mając 41,7 procenta głosów na górnego, dostanie w tym roku jeszcze jedną szansę, by pokazać jak „góra umiera”.\n","de_DE":"Der ehemalige Weltmeister Eonyoung „Impact“ Jeong ist noch nicht bereit, Maus und Tastatur an den Nagel zu hängen. Der ehemalige Top-Laner von SK Telecom T1 hat bei den Entscheidungsspielen der NA LCS 2016 eine Show abgeliefert und damit bewiesen, dass ihm kein Top-Laner in Nordamerika das Wasser reichen kann. Obwohl seine Leistungen in der regulären Saison uninspiriert waren, hat er Cloud9 fast im Alleingang zur Weltmeisterschaft 2016 geführt.</p>\n<p>\nLeider hatte Impact bei der Weltmeisterschaft Probleme damit, seinen Rhythmus zu finden. Cloud9 war das einzige nordamerikanische Team, das sich einen Platz im Viertelfinale sichern konnte, allerdings sind sie anschließend direkt an Samsung Galaxy gescheitert. In diesem Frühjahrs-Split wird Impact versuchen, auf einem noch höheren Level zu spielen. Darüber hinaus wird er Ray, seinen neuen Teamkollegen, unter seine Fittiche nehmen. Der talentierte Top-Laner wird den Gegnern von Cloud9 Albträume bescheren, in denen sich zwei Worte unendlich wiederholen: „top die“.\n","es_AR":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","es_ES":"<p>Aún no ha llegado el momento de que el que fuera campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del split de verano de la LCS NA poco inspirado, el exjugador de la calle superior de SK Telecom T1 lo dio todo en los playoffs. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallan las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en la calle superior para Cloud9 durante los playoffs, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su jugador de la calle superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para la calle superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","pt_BR":"<p>Ex-campeão do mundo, Eoyoung “Impact” Jeong ainda não está preparado para pendurar o mouse e o teclado. Após um começo nada inspirador na Etapa de Verão da NA LCS, o ex-topo da SK Telecom T1 arrasou nas eliminatórias. Nenhum outro jogador de topo da América do Norte chegou perto de seu desempenho, e a Cloud9 deve de seu sucesso de pós-temporada à sua mecânica incrível, que também acabou com as preocupações de comunicação interna da equipe.</p>\n\n<p>Apesar da dominância regional, Impact teve dificuldades em se manter constantemente bem no Campeonato Mundial deste ano. Apesar de ter sido imprescindível na rota do topo para a Cloud9 durante as eliminatórias, ele encontrou adversários à altura como Duke, da SK Telecom T1 e CuVee, da Samsung Galaxy. Impact e o restante da Cloud9 merecem o crédito de terem sido a única equipe da América do Norte a chegar nas quartas-de-final, fazendo dele o representante da equipe para o Evento All-Star. Com 41,7% dos votos da rota do topo, ele terá mais uma chance de acabar com o topo.</p>","cs_CZ":"<p>Bývalý mistr světa Eonyoung „Impact“ Jeong ještě není připraven pověsit klávesnici a myš na hřebík. Po neslaném nemastném letním splitu severoamerického LCS se v play-off tento dřívější horní lajnař z SK Telecom T1 doslova utrhl ze řetězu. Žádný jiný horní lajnař ze Severní Ameriky se s jeho formou ve vyřazovací části turnaje nemohl měřit a Cloud9 za svůj úspěch z velké části vděčili právě jeho hvězdným výkonům, čímž navíc vzaly zasvé obavy, že se Cloud9 potýká s komunikačními problémy.</p>\n\n<p>Ačkoliv ve svém regionu řádil Impact jako černá ruka, na letošním mistrovství světa se mu už tak skvěle nedařilo. Během vyřazovacích zápasů byl sice v horní lajně pro Cloud9 cennou oporou, našel však sobě rovné v Dukovi z SK Telecom T1 a v CuVeem ze Samsung Galaxy. Přesto si Impact a zbytek Cloud9 zaslouží uznání za to, že se stali jediným severoamerickým týmem, který se probojoval do čtvrtfinále, a Impact bude tento region reprezentovat i na turnaji All-Star. Z hráčů v horní lajně obdržel 41,7 % hlasů a bude tak mít letos ještě jednu šanci provést svůj klasický „top die“.</p>","el_GR":"<p>Ο πρώην Παγκόσμιος Πρωταθλητής Eonyoung “Impact” Jeong δεν είναι ακόμα έτοιμος να κρεμάσει το ποντίκι και το πληκτρολόγιό του. Μετά από ένα απογοητευτικό Summer Split στο LCS Βόρειας Αμερικής, ο πρώην παίκτης επάνω λωρίδας των SK Telecom T1 έκανε μια καταπληκτική εμφάνιση στα πλέι οφ. Κανένας άλλος παίκτης επάνω λωρίδας στη Βόρεια Αμερική δεν μπόρεσε να συγκριθεί μαζί του στα πλέι οφ και οι Cloud9 οφείλουν μεγάλο μέρος της επιτυχίας τους στους αγώνες μετά το τέλος της σεζόν στην εκπληκτική του φόρμα, αποστομώνοντας και όσους έλεγαν ότι οι Cloud9 είχαν προβλήματα επικοινωνίας.</p>\n\n<p>Παρά την κυριαρχία του σε τοπικό επίπεδο, ο Impact δυσκολεύτηκε πολύ να βρει το ρυθμό του στο φετινό Παγκόσμιο Πρωτάθλημα. Παρόλο που ήταν πραγματικός τοίχος στην επάνω λωρίδα των Cloud9 κατά τη διάρκεια των πλέι οφ, δυσκολεύτηκε πολύ ενάντια σε άλλους δυνατούς παίκτες επάνω λωρίδας, όπως τον Duke των SK Telecom T1 και τον CuVee των Samsung Galaxy. Ωστόσο, ο Impact και οι υπόλοιποι Cloud9 αξίζουν ένα μεγάλο «μπράβο» που ήταν η μοναδική ομάδα από τη Βόρεια Αμερική που κατάφερε να φτάσει στους προημιτελικούς. Μάλιστα, ο Impact θα εκπροσωπήσει την ομάδα του και στο Τουρνουά All-Star. Άλλωστε, ήταν ο παίκτης που συγκέντρωσε το 41,7% των ψήφων για την επάνω λωρίδα, άρα θα έχει την ευκαιρία να δείξει αν είναι όντως ο καλύτερος στη θέση του.</p>","hu_HU":"A korábbi világbajnok Eonyoung „Impact” Jeong még nem szeretné szögre akasztani az egeret és a billentyűzetet. Az NA LCS gyenge nyári szakasza után az SK Telecom T1 egykori felső ösvényese nagyon rákapcsolt a rájátszásban. Egyetlen másik észak-amerikai játékos sem tudott felérni hozzá, és a Cloud9 jórészt neki köszönheti a szezon utáni sikereit, amivel egyébként sikerült eloszlatni a Cloud9 kommunikációs problémáival kapcsolatos pletykákat is.\n</p>\nA regionális sikerek ellenére Impact nehezen talált magára az idei világbajnokságon. Bár a Cloud9 felső ösvényén nem akadt ellenfélre a rájátszás során, a vb-n olyanokkal kellett szembenéznie, mint Duke (SK Telecom T1) és CuVee (Samsung Galaxy). Impact és a Cloud9 többi tagja egyedüli észak-amerikai csapatként jutott a negyeddöntőig, és Impact képviselheti őket az All-Star gálán. A felső ösvényesekre leadott szavaztok 41,7%-át söpörte be, így idén kap még egy utolsó esélyt, hogy bizonyítson.\n","it_IT":"L'ex campione del mondo Eonyoung \"Impact\" Jeong sembra non avere ancora intenzione di appendere mouse e tastiera al chiodo. Dopo un Summer Split LCS NA poco ispirato, l'ex superiore di SK Telecom T1 si è fatto valere durante i playoff. Nessun altro giocatore top in Nord America è riuscito a tenergli testa durante questo periodo e Cloud9 deve gran parte del suo successo post-stagionale alle sue giocate stellari, che hanno messo anche a tacere le voci che parlavano di problemi di comunicazione interni alla squadra.\n</p>\nNonostante il predominio nella sua regione, Impact ha sofferto molto per trovare il giusto ritmo ai Mondiali di quest'anno. Pur essendo un elemento immancabile nella corsia superiore dei Cloud9 durante i playoff, ha avuto filo da torcere contro giocatori nel suo stesso ruolo del calibro di Duke degli SK Telecom T1 e CuVee dei Samsung Galaxy. In ogni caso, Impact e i suoi compagni dei Cloud9 meritano un encomio per essere stati l'unico team nordamericano a raggiungere i quarti di finale, e sarà proprio Impact a rappresentarli nell'evento All-Star. Forte del 41,7% dei voti per la categoria Superiore, ora avrà un'altra occasione per dominare la sua corsia.\n","ro_RO":"Fostul Campion Mondial Eonyoung ''Impact'' Jeong nu e încă pregătit să lase deoparte mouse-ul și tastatura. După o etapa de vară neinspirată în LCS NA, fostul jucător de pe culoarul de sus al SK Telecom T1 a avut parte de o serie de victorii în playoff-uri. Niciun alt jucător de pe culoarul de sus din America de Nord nu s-a ridicat la forma sa din playoff-uri. Cloud9 datorează o mare parte din succesul său de după sezon manevrelor excepționale ale lui Impact, care au pus capăt neliniștilor legate de problemele de comunicare ale echipei.\n</p>\nÎn ciuda dominației sale regionale, Impact nu a reușit să se facă remarcat la Campionatul Mondial din acest an. Cu toate că a fost o forță de neoprit pe culoarul de sus pentru Cloud9 în timpul playoff-urilor, și-a întâlnit nașii în Duke de la SK Telecom T1 și în CuVee de la Samsung Galaxy. Însă cei din Cloud9 merită apreciați pentru că au fost singura echipă din America de Nord care a ajuns în sferturile de finală, iar Impact își va reprezenta regiunea la All-Star Event. Cu 41,7 la sută din voturile pentru culoarul de sus, va mai avea o șansă anul acesta să-și omoare adversarii de unul singur, fără ajutorul nimănui.\n","ko_KR":"","es_MX":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>"},"foreignIds":{"drupalId":"691","TRLH1":"200000172","TRLH2":"200000076","TRLH3":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":115,"slug":"sneaky","name":"Sneaky","firstName":"Zachary ","lastName":"Scuderi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sneaky-3c359lbn.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:51.000Z","updatedAt":"2017-07-04T19:27:36.000Z","bios":{"en_US":"<p>The man, the meme, the legend. Zachary “Sneaky” Scuderi might be the class clown of the NA LCS, but his play is no joke. He’s consistently been a top ADC since he took the league by storm with Cloud9 in Season 3 with his meta-defying Ashe picks. During the 2016 NA LCS Summer Split, he led ADCs and was fourth overall in KDA with 6.3, and he also led ADCs with a 75.7% kill participation rate.</p>\n\n<p><i>“I’ve been getting a lot of memes, as of recent, about my laning phase. It doesn’t really mean anything. But there’s memes, and I could destroy them.” - Sneaky</i></p>\n\nSneaky put up a middling performance in lane and out of it at the 2016 World Championship before Cloud9 was eliminated. He brings a veteran presence to Cloud9’s retooled roster, looking to prove his detractors wrong. What memes will be destroyed or born in 2017? We’ll just have to wait and see.</p>","fr_FR":"<p>Zachary « Sneaky » Scuderi est l'un des carrys AD les plus mortels des LCS NA. Ne vous laissez\n\npar ses singeries, car Sneaky répond présent quand Cloud9 a besoin d'un exploit. Il est parvenu à obtenir \n\nun KDA de 7,2 lors du segment printanier des LCS NA 2015, le deuxième meilleur de la ligue, et il \n\ncontinue de voler de victoire en victoire depuis lors.</p>\n\n<p>L'ascension de Sneaky vers la célébrité a commencé pendant la Saison 3, quand sa décision de choisir \n\nAshe contre la logique de la metagame a propulsé Cloud9 au sommet du classement des LCS NA. Depuis, \n\nSneaky est devenu un fantastique carry AD polyvalent. Il joue désormais admirablement Corki, Tristana \n\net Lucian, et il empoche régulièrement les ratios KDA les plus élevés des LCS NA. Il est probablement le \n\njoueur professionnel de LoL qui propage le plus de memes usés jusqu'à la corde. « Same ».</p>","pl_PL":"<p>Gdyby zorganizować konkurs na najbardziej niedocenianego gracza w NA LCS Sneaky miałby bardzo dużą szansę, by zgarnąć trofeum. Na najwyższym poziomie gra już od ponad dwóch lat, ale nigdy nie dorównywał popularnością Doubleliftowi czy chociażby Wild Turtle’owi. Nie zmienia to faktu, że jest doskonałym strzelcem, być może najlepszym w Ameryce.</p>\n<p>\nSneaky jak niemal każdy zawodnik zaczynał w niewielkich organizacjach. Pierwszym przystankiem na jego drodze na szczyt był zespół Ordinance Gaming, w którym w 2012 roku pełnił rolę… mid-lanera i gdzie spotkał m.in. Roberta „RobertaXLee” Lee. Później przyszedł czas na zmianę pozycji – środkową aleję Sneaky zamienił na pozycję strzelca, w której to roli rozpoczął przygody z Absolute Legends NA oraz Pulse Esports. Dobra postawa Sneaky’ego nie umknęła większym organizacjom i lutym 2013 roku Zachary dołączył do Teamu Dignitas, ale spędził tam tylko pół roku. Pojawiła się oferta z Quantic Gaming, późniejszego Cloud9, którą zaakceptował.</p>\n<p>\nSzybko okazało się, że była to znakomita decyzja. Sneaky wraz z kolegami dwukrotnie sięgał po trofeum dla najlepszego zespołu w NA LCS i dwukrotnie zajmował w tych rozgrywkach drugie miejsce. Początkowo Zachary preferował strzelców, którzy posiadali efekty kontroli tłumu, bo tego wymagała od niego taktyka zespołu. Jego flagową bohaterką stała się w tym czasie Ashe. Co jednak oczywiste, grając tym typem czempionów nie mógł pokazać pełni swoich możliwość. Zmieniło się to wraz z modyfikacją strategii drużyny, która w 2014 roku postanowiła odciążyć nieco Haia „Haia” Lama na środkowej alei i bardziej skupić się na dolnej alei, gdzie potencjał do prowadzenia gier miał właśnie Sneaky. Kiedy po wielkich sukcesach, przyszedł mniej udany okres, Sneaky był tak naprawdę jedynym zawodnikiem C9, który nigdy nie zawodził i nierzadko to właśnie jego fenomenalna postawa i znakomite umiejętności mechaniczne pozwalały Cloud9 wygrywać gry. W wiosennym splicie 2015 Zachary miał najwyższe KDA (7,2), zadał najwięcej procentowych obrażeń (33,9%) i ginął najrzadziej spośród wszystkich zawodników NA LCS (25 śmierci). Co prawda amerykański strzelec miał nieznacznie gorszy letni split 2015, ale to nadal jest zawodnik, na którego C9 zawsze może liczyć.</p>\n<p>\nSneaky nigdy nie wygrał jednak głosowanie na najlepszego ADC w Ameryce, a w plebiscycie z listopada 2015 roku zajął drugie miejsce z wynikiem 20,3%, tracąc do zwycięzcy, Yilanga „Doublelifta” Penga, aż 32,5% głosów.</p>\n<p>\nW trakcie swojej kariery najbardziej wsławić się grą Ezrealem, Gravesem i Corkim. Ciężko też nie zauważyć sentymentu dla Ashe, bowiem Sneaky był jednym z dwóch ADC w Ameryce, który zdecydował się na kilkukrotny wybór tej bohaterki w meczach NA LCS po jej reworku. Co ciekawe, Sneaky jest… daltonistą, co sprawia, że nie potrafi odróżniać pewnych (nie wszystkich) kolorów. Na początku swojej kariery posługiwał się nickiem „SnEaKyCaStRoO”, ale zmienił go natychmiast, gdy dowiedział się, co znaczy to wyrażenie.\n</p>","de_DE":"Der Mann, das Meme, die Legende. Zachary „Sneaky“ Scuderi ist zwar der Klassenclown der NA LCS, aber wenn er spielt, ist Schluss mit lustig. Seit er durch seine Leistungen mit Ashe das Metaspiel veränderte und die Liga im Sturm eroberte, gehört Sneaky, der in Saison 3 bei Cloud9 unterschrieb, zu den besten ADCs. Beim Sommer-Split der NA LCS 2016 führte er die ADCs mit einer Tötungsbeteiligung von 75,7 % an und landete mit einer TTU (KDA) von 6,3 auf dem vierten Platz aller Spieler.</p>\n\n„Ich bekomme in letzter Zeit jede Menge Memes, die sich auf meine Anfangsphase beziehen. Das hat eigentlich nichts zu bedeuten. Aber es gibt sie und ich könnte sie zerstören.“ – Sneaky\n</p>\nSneaky hat bei der Weltmeisterschaft 2016 in der Lane und abseits davon nur eine mittelmäßige Leistung abgeliefert, bis Cloud9 ausgeschieden ist. Er wird seine Erfahrung in die Aufstellung von Cloud9 einbringen und versuchen, seine Kritiker Lügen zu strafen. Welche Memes werden 2017 wohl zerstört werden und welche neuen werden entstehen? Die Zeit wird es zeigen.\n","es_ES":"<p>El hombre, el meme, la leyenda. Zachary ''Sneaky'' Scuderi puede que sea el payaso de la clase de la LCS NA, pero sus jugadas no son un chiste. No ha dejado de ser un ADC de primera desde que llegó a la liga pisando fuerte con Cloud9 en la temporada 3, cuando seleccionaba a Ashe en contra de la lógica del metajuego. Durante el split de verano de la LCS NA 2016, destacó entre los ADC y quedó en cuarto lugar con una A/M/A de 6,3 puntos. También destacó entre ellos por su 75,7 % de participación en asesinatos.</p>\n\n<p>''Últimamente han hecho muchos memes de mí, por mi fase de calles. No significa nada para mí en realidad. Pero los memes están ahí, y yo podría destruirlos''.</p>\n\n<p>Sneaky ha tenido que soportar críticas por sus jugadas en la fase de calles, pero su tendencia a los pentakills a final de partida camufla cualquier fallo del principio. Destaca con campeones ADC de utilidad como Ashe y Sivir, y su Jhin es temido universalmente, lo que ha suscitado que lo bloqueen o que lo seleccionen el primero durante los playoffs. Intentará demostrar que sus detractores se equivocaban consiguiendo un pentakill en el escenario internacional, destruyendo algunos memes y, quizás, si tenemos suerte, creando otros nuevos.</p>","pt_BR":"<p>O homem, o meme, a lenda. Zachary “Sneaky” Scuderi pode ser o palhaço da turma na NA LCS, mas suas jogadas não são nenhuma piada. Ele tem sido consistentemente um dos melhores atiradores desde que saiu destruindo com a Cloud9 na 3º Temporada com suas escolhas de Ashe que desafiavam as leis do meta. Durante a Etapa de Verão da NA LCS 2016, ele esteve na liderança entre os atiradores e ficou em quarto lugar geral com um AMA de 6,3 e também ficou entre os primeiros em participação em abates com 75,7%.</p>\n\n<p>“Tenho ouvido muitas piadas sobre minha fase de rotas recentemente. Eu não as levo a sério e sei que posso destruí-las” - Sneaky</p>\n\n<p>Sneaky já recebeu muitas críticas por seu estilo de jogo na fase de rotas, mas sua propensão a Pentakills no fim de jogo compensa qualquer começo ruim. Ele se sobressai em atiradores de utilidade como Ashe e Sivir, e seu Jhin é universalmente temido, levando a ser banido ou escolhido em primeiro durante as eliminatórias. Ele fará de tudo para desmentir seus difamadores indo atrás do Pentakill no palco internacional, destruindo alguns memes e quem sabe (se tivermos sorte) criando alguns novos.</p>","es_AR":"<p>El hombre, el meme, la legenda. Zachary \"Sneaky\" Scuderi es quien hace reír a todos con sus bromas en la LCS NA, pero su juego no es ningún chiste. Ha sido uno de los mejores tiradores desde que sacudió la liga entera con Cloud9 en la temporada 3 jugando con su revolucionaria Ashe. Durante el torneo de clausura de la LCS NA 2016, jugó de tirador y quedó en cuarto lugar con 6.3 puntos de KDA. Además, logró un 75.7% de participación en asesinatos como tirador.</p>\n\n<p><i>\"Me han hecho muchos memes recientemente sobre mi etapa en los carriles. En realidad eso no quiere decir nada. Pero hay memes, y puedo destruirlos\".</i></p>\n\n<p>Sneaky ha soportado críticas por su juego en la fase de carriles, pero su tendencia a lograr pentakills en las últimas partes de los combates compensa los errores al comienzo. Se destaca con tiradores de utilidad como Ashe y Sivir, y su juego con Jhin es temido por todos, ya que logra bloqueos y primeras selecciones durante las eliminatorias. Buscará demostrar a sus detractores que estaban equivocados logrando un pentakill en el escenario internacional, destruyendo algunos memes y, quizás (si tenemos suerte), hasta creando algunos nuevos.</p>"},"foreignIds":{"drupalId":"331","TRLH1":"200000175","TRLH2":"200000079","TRLH3":"200000339"},"socialNetworks":{"twitch":"https://twitch.tv/c9sneaky","facebook":"https://facebook.com/c9sneaky","twitter":"https://twitter.com/c9sneaky"},"champions":[],"liveGameTeam":18},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":163,"slug":"bunny-fufuu","name":"Bunny FuFuu","firstName":"Michael","lastName":"Kurylo","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bunny-fufuu-b4cl3hl3.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-25T17:02:59.000Z","bios":{"en_US":"<p>\nKnown for his Thresh picks, Michael “Bunny Fufuu” Kurylo is a long time support player in the NA scene. Bunny Fufuu originally played support for Curse during the 2014 NA LCS Spring Split before moving to Curse Academy, which later rebranded as Gravity. The move served both him and Gravity well, with his skills in the bot lane steadily improving until he was regarded as one of the best supports in North America.\n</p>\n<p>\nBunny Fufuu's impact in the bot lane caught the attention of more than a few teams, and he was scooped up by Cloud9 in the 2015 offseason.\n</p>\n<p>\nLearn more about Bunny FuFuu's journey in the competitive scene in his <a href=\"https://www.youtube.com/watch?v=G0uDn46IUxE\" target=\"_blank\">Drive episode</a>.\n</p>","fr_FR":"<p>Support bien connu sur la scène nord-américaine, Michael « Bunny Fufuu » est réputé pour son Thresh. \n\nBunny Fufuu jouait à l'origine support pour Curse, lors du segment printanier des LCS NA 2014, avant de \n\npasser chez Curse Academy, qui a ensuite changé de nom pour devenir Gravity. Ce changement a été \n\nfructueux pour lui comme pour Gravity, et ses compétences sur la voie du bas se sont constamment \n\naméliorées jusqu'à ce qu'il soit considéré comme l'un des meilleurs supports d'Amérique du Nord.</p>\n\n<p>L'impact de Bunny Fufuu sur la voie du bas a attiré l'attention de plusieurs équipes et il a fini par être \n\nrecruté par Cloud9 durant l'intersaison 2015. Il travaille en étroite collaboration avec Hai, qui est sans \n\ndoute l'un des meilleurs meneurs nord-américains, avec qui il partage le poste de support chez C9. \n\nProfitant des conseils stratégiques de LemonNation et d'un puissant partenaire en la personne de \n\nSneaky, Bunny Fufuu continuera forcément de faire forte impression lors des LCS NA. </p>\n\n<p>Pour en savoir plus sur le parcours de Bunny Fufuu sur la scène compétitive, regardez l'épisode de Drive \n\nqui lui est consacré.</p>","pl_PL":"<p>Michael Kurylo przedstawił się szerszej publiczności w 2014 roku, kiedy to zasłynął w amerykańskim SoloQ nieprawdopodobną grą Threshem.</p>\n<p> \nVideo: https://www.youtube.com/watch?v=KVIj1t5duP8</p>\n<p>\nNa półprofesjonalnej scenie swoich sił próbował już wcześniej w mniej znanych formacjach, ale to właśnie sezon 2014 okazał się przełomowy. Co prawda w składzie Curse utalentowanemu wspierającemu nie udało się zaistnieć. Najpierw rywalizował z Georgem „Zekentem” Liu i Brandonem „Saintviciousem” DiMarco w szalonym wiosennym splicie 2014. Ciekawostką jest fakt, że Michael występował wtedy w LCS i jednocześnie… uczęszczał do szkoły. Później do zespołu dołączył wyrzucony z TSM-u Alex „Xpecial” Chu. Obydwaj zawodnicy rywalizowali o miejsce w składzie formacji, ale ostatecznie, pomimo pozytywnych recenzji, jakie BunnyFuFuu otrzymał za wiosenne występy, to były gracz TSM-u wygrał ten pojedynek. </p>\n<p>\nNiemniej kariera Michaela potoczyła się w myśl przysłowia „co się odwlecze, to nie uciecze”. BunnyFuFuu dołączył do występującego w NA Challenger Series Curse Academy i to właśnie wokół niego przebudowana została drużyna. </p>\n<p>\n- W ciągu roku BunnyFuFuu będzie lepszy od Xpeciala – powiedział jednak w sierpniu 2014 roku legendarny amerykański dżungler Saintvicious, który występował z Bunny’m w CA.</p>\n<p>\nCurse Academy udało się zebrać naprawdę silny skład i zespół był jednym z faworytów do awansu do LCS. Początki były trudne, ale ostatecznie cel udało się spełnić od razu w pierwszym splicie. Michael i jego koledzy z drużyny byli zmuszeni zmienić organizację i do wiosennej edycji rozgrywek 2015 przystąpili pod banderą Gravity.</p>\n<p>\nZespół zaskoczył znakomitym startem w wiosennym splicie 2015, a BunnyFuFuu, zgodnie z oczekiwaniami, był jednym z filarów zespołu. Ostatecznie drużyna zadomowiła się w środku tabeli i to był na tamten moment szczyt możliwości Michaela i jego kolegów. W przerwie między splitami zmienił się jednak partner Bunny’ego na dolnej alei – Davida „Copa” Robertsona zastąpił obiecujący Johny „Altec” Ru. W związku z tą rotacją uwaga drużyny skupiła się głównie na dolnej alei, gdzie duet młokosów radził sobie fenomenalnie, prowadząc zespół do walki o najwyższe lokaty. Gravity przez moment było nawet liderem rozgrywek, ale ostatecznie skończyło letnią edycję na czwartej pozycji i szybko odpadło w play-offach.</p>\n<p>\nBunnyFuFuu nadal słynie z nieprawdopodobnej gry Threshem, ale w ciągu ostatniego roku jego champion pool znacznie się rozszerzył – amerykański wspierający niemal równie chętnie sięgał po Shena, Alistara, Jannę czy Brauma. Ewidentnie ma jednak tendencję do gry wytrzymałymi wspierającymi. W letnim splicie 2015 BunnyFuFuu był czwartym najczęściej asystującym zawodnikiem w NA LCS. Tę samą lokatę zajął w klasyfikacji supportów obejmującej KDA. Był również drugim najczęściej wardującym graczem w amerykańskich rozgrywkach. Co ciekawe, nick Michaela początkowo miał brzmieć „BunnyFuFu”, ale był on zajęty, wobec czego gracz zdecydował się po prostu dodać drugie „u” i tak powstał obecny pseudonim.</p>\n<p>\nW przerwie przed sezonem 2016 wspierający dołączył do Cloud9, gdzie ma pełnić rolę supporta wymiennie z Haiem „Haiem” Lamem.\n</p>"},"foreignIds":{"drupalId":"1341","TRLH1":"1001220059","TRLH2":"1001160109"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":482,"slug":"incarnati0n","name":"Jensen","firstName":"Nicolaj","lastName":"Jensen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/incarnati0n-e5bzh5bb.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2015-05-15T18:24:28.000Z","updatedAt":"2017-07-04T19:27:23.000Z","bios":{"en_US":"<p>Nicolaj “Jensen” Jensen is out to prove there’s more than one great Danish mid laner in the NA LCS. After initially struggling when he joined Cloud9 in 2015 to replace departing Hai, he’s done more than just gain his footing: he’s become one of the most dangerous mid laners in the league. During the 2016 NA LCS Summer Split, he led the league in kills with 207 and set a new LCS record with 20 kills in a single game in the playoffs.</p>\n\n<p>Like the rest of Cloud9, Jensen was unsatisfied with the team’s performance at Worlds. Joining a retooled roster for 2017, he had to build synergy with his new jungler, Contractz. A strong season for Jensen and Cloud9 was unfortunately capped by a crushing defeat to TSM in the 2017 NA LCS Spring Split finals. With a clean slate for summer, Jensen will be looking to body fools on his way to the 2017 World Championship. </p>","fr_FR":"<p>Nicolaj « Jensen » Jensen est un mid laner danois de haut niveau, connu pour préférer des assassins \n\ncomme Zed et Fizz. Jensen a commencé sa carrière e-sportive avec Team Solo Mebdi en 2012, lors des \n\nqualifications pour les LCS EU de la Saison 3. Cependant, l'équipe a été disqualifiée du tournoi et s'est \n\nséparée au début de l'année 2013.</p>\n\n<p>Jensen est revenu à la compétition en 2015 quand Cloud9 l'a choisi pour remplacer son mid laner sur le \n\ndépart, Hai. Au début, Jensen a eu du mal dans le nouvel environnement des LCS NA, mais son KDA s'est \n\namélioré considérablement au fur et à mesure qu'il s'habituait au style de jeu de l'équipe et à la scène \n\ndes LCS NA. Jensen a terminé son premier segment professionnel en participant au mondial 2015, au \n\ncours duquel Cloud9 a été éliminée dès la phase de groupe.</p>","pl_PL":"<p>Nikolaj Jensen, bardziej znany jako Incarnati0n, to jedna z najbardziej kontrowersyjnych postaci na profesjonalnej scenie. Głośno o Duńczyku po raz pierwszy zrobiło się w 2012 roku, przed eliminacjami do pierwszego splitu EU LCS w historii. Incarnati0n całkowicie zdominował w tym czasie europejskie SoloQ i jego drużyna była jednym z faworytów do zdobycia miejsca w elitarnych rozgrywkach. Kilka dni przed zawodami sceną wstrząsnęła jednak zaskakująca wiadomość – Incarnati0n (znany wtedy pod pseudonimem Veigodx), a także jego kolega z zespołu Simon „Rayt3rch” Näslund zostali ukarani dożywotnią dyskwalifikacją, a ich formacja (Team Solo Mebdi) wykluczona z turnieju.</p>\n<p>\nSzybko na jaw wyszły na jaw powody tej decyzji. Nikolaj zbudował sobie rozległą kartotekę związaną z łamaniem Kodeksu Przywoływacza. Kara nie sprawiła jednak, że Incarnati0n porzucił League of Legends. Duńczyk tworzył kolejne konta, które były co jakiś czas eliminowane: Vizikodex, Quas0, Suq, Reversio, Apdo Dog2 czy najbardziej znane Wizikx. Mid-laner niejednokrotnie udowadniał ogromną skalę talentu, regularnie dostając się na najwyższe lokaty w europejskim SoloQ. W końcu, po niemal dwóch latach trwania tego procederu, w 2014 roku, Riot zobaczył znaczącą poprawę w postępowaniu gracza i pozwolił mu na pracę z SK Gaming w roli trenera. Niemniej, biorąc pod uwagę powody dyskwalifikacji Duńczyka, Riot pozostawał nieugięty, jeśli chodzi o występy Incarnati0na jako gracza. </p>\n<p>\nTymczasem SK Gaming, od czasu zatrudnienia Nikolaja, odnotowało niesamowity postęp i wygrało fazę zasadniczą wiosennego splitu 2014, zajmując też drugą pozycję w play-offach i trzecią na koniec letniej edycji. Formacji udało się też pojechać na Mistrzostwa Świata. Ogromny progres był widoczny w postawie mid-lanera drużyny Jesse’ego „Jesiza” Le. Wszystko wskazuje na to, że Duńczyk fantastycznie odnalazł się w nowej roli. Nie ulega jednak wątpliwości, że to rozwiązanie go nie satysfakcjonowało – chciał grać.</p>\n<p>\nIncarnati0n skupił się więc na swojej karierze jako zawodnika. Mid-laner potrzebował jeszcze dwóch podejść do aktualizacji jego sprawy. Dopiero w maju 2015 roku przekonał Riot co do swojej przemiany i został dopuszczony do gry na najwyższym poziomie. Ta sprawa podzieliła społeczność na zwolenników drugiej szansy dla utalentowanego zawodnika i przeciwników tej decyzji, wskazujących na skrajnie toksyczną przeszłość. Ostatecznie jednak nie miało to większego znaczenia, bo decyzja była wiążąca i po Duńczyka zgłosiła się chmara chętnych. Od początku faworytem w wyścigu po podpis Incarnati0na było jednak Cloud9 i to właśnie tam trafił obiecujący gracz.</p>\n<p>\n„W dziesięciostopniowej skali, przyjmując za 10 Fakera, myślę, żę Bjergsen i Incarnati0n są prawdopodobnie około ósemki. Pozostali mid-lanerzy z NA LCS oscylują w większości w przedziale 6-7.” – powiedział William „Scarra” Li przed startem splitu, stawiając Incarnati0na obok Bjergsena.</p>\n<p>\nPoczątki nie były jednak łatwe. Incarnati0n miał problemy z zaaklimatyzowaniem się na tak wysokim poziomie i ze spełnieniem wygórowanych oczekiwań kibiców. Kilka pierwszych kolejek było bardzo przeciętne w jego wykonaniu, co spowodowało falę krytyki ze strony fanów, ale później z każdym meczem radził sobie lepiej. Na pewno bardzo pomógł mu powrót do drużyny Haia „Haia” Lama, bowiem od zmiany dżunglera progres był jeszcze wyraźniejszy. Pod koniec splitu Incarnati0n był już mocnym punktem zespołu i miał spory udział w sensacyjnym wywalczeniu przez Cloud9 awansu na Mistrzostwa Świata. Trudy debiutu już więc za nim, a rok 2016 powinien być dla niego znacznie bardziej udany.</p>\n<p>\nW czasach dominacji SoloQ Incarnati0na zasłynął z niezwykle efektywnej gry zabójcami – przede wszystkim Fizzem i Zedem. Na profesjonalnej scenie jego styl gry znacznie się jednak zmienił w związku z wymogami dynamicznie ewoluującej mety. W lecie najczęściej grał Orianną, Azirem i Viktorem, co całkowicie zrozumiałem, gdyż te postaci były w tym czasie najmocniejsze. Jego pocket-pickiem był natomiast AP Kog’Maw. Co ciekawe, spośród graczy NA LCS, Duńczyk najlepiej dogaduje się z Johnym „Altec’iem” Ru i Christianem „IWillDominate” Riverą.\n </p>","de_DE":"Nicolaj „Jensen“ Jensen will allen beweisen, dass es nicht nur einen überragenden dänischen Mid-Laner gibt. Nachdem er anfangs Probleme hatte, als er 2015 als Ersatz für Hai zu Cloud9 gekommen war, konnte er mehr als nur Fuß fassen: Er wurde zu einem der gefährlichsten Mid-Laner der Liga. Beim Sommer-Split der NA LCS 2016 führte er die Liga mit 207 Tötungen an und stellte in den Entscheidungsspielen mit 20 Tötungen in einem einzigen Spiel einen neuen Rekord auf.</p>\n\nJensen war, wie der Rest von Cloud9, mit der Leistung bei der Weltmeisterschaft unzufrieden. In der neuen Aufstellung für den Frühjahrs-Split 2017 muss er an der Synergie zwischen ihm und seinem neuen Jungler, Contractz, arbeiten. Eine gute Harmonie zwischen Mid-Laner und Jungler ist das Erfolgsrezept vieler Top-Teams. Sollten sie es schaffen, gut zusammenzuarbeiten, ist kaum abzusehen, was Jensen 2017 alles erreichen kann.\n","es_ES":"<p>Nicolaj ''Jensen'' Jensen va a demostrar que no solo hay un jugador danés fantástico en la calle central de la LCS NA. Tras tener algunos problemas inicialmente cuando se unió a Cloud9 en 2015 para reemplazar a Hai, no solo se ha ganado su posición, sino que se ha convertido en uno de los mid más peligrosos de la liga. Durante el split de verano de la LCS NA 2016, despuntó en la liga con 207 asesinatos y ha establecido un nuevo récord en la LCS con 20 asesinatos en una sola partida durante los playoffs. También destacó por el número de súbditos asesinados por minuto, alcanzando una media de 9,5.</p>\n\n<p>Tras una dura derrota contra TSM en la final de verano de la LCS NA 2016, Jensen tomó las riendas de su equipo y derrotó a Immortals de nuevo en un enfrentamiento al mejor de 5, lo que significaría su clasificación para el Mundial. Aunque se hizo un nombre jugando asesinos como Zed y LeBlanc, también ha destacado con selecciones específicas como Vel'Koz y Syndra. Si Cloud9 quiere superar la fase de grupos este Mundial, a diferencia del año pasado, Jensen tendrá que deshacerse de los recuerdos de las derrotas del pasado. Puede que las emociones sean el rival más duro para Jensen en el escenario internacional; si consigue dominarlas, su límite serán las nubes.</p>","pt_BR":"<p>Nicolaj “Jensen” Jensen veio para provar que há mais do que só um grande jogador dinamarquês na rota do meio na NA LCS. Após um começo difícil quando entrou para a Cloud9 em 2015 para substituir Hai, ele fez muito mais do que só conquistar o seu lugar: ele se tornou um dos meios mais perigosos do League. Durante a Etapa de Verão da NA LCS 2016, ele ficou na liderança em número de abates marcando 207 e alcançou um novo recorde na LCS com 20 abates em um único jogo nas eliminatórias. Ele também ficou em primeiro em abates de tropa por minuto, marcando 9,5.</p>\n\n<p>Depois de uma derrota esmagadora para a TSM na Final da Etapa de Verão da NA LCS, Jensen reuniu sua equipe, que conseguiu derrotar mais uma vez a Immortals em uma melhor de 5, qualificando-se assim para o Mundial. Apesar de ter feito seu nome jogando com assassinos como Zed e LeBlanc, ele também se sobressai em escolhas mais específicas como Vel’Koz e Syndra. Se a Cloud9 espera superar sua saída na Fase de Grupos do Mundial do ano passado, Jensen vai ter que superar as derrotas do passado. As emoções talvez sejam um de seus piores inimigos no palco internacional. Se ele conseguir controlá-las, o céu é o limite.</p>","es_AR":"<p>Nicolaj \"Jensen\" Jensen ha venido para demostrar que hay más de un carrilero central danés habilidoso en la LCS NA. Después de un arduo inicio en Cloud9 como reemplazo de Hai en el 2015, ha logrado más que ganarse su lugar: se ha convertido en uno de los carrileros centrales más poderosos de la liga. Durante el torneo de clausura de la LCS NA 2016, encabezaba la liga con 207 asesinatos y registró una marca inédita de la LCS con 20 asesinatos en un solo combate durante las eliminatorias. También lideró la liga con 9.5 CS por minuto.</p>\n\n<p>Después de una aplastante derrota ante TSM en la final del torneo de clausura de la LCS NA 2016, Jensen reunió a su equipo para derrotar a Immortals una vez más en un combate al mejor de cinco y clasificar al Mundial. A pesar de que se hizo reconocido jugando con asesinos como Zed y Leblanc, también se destacó usando personajes especializados como Vel’Koz y Syndra. Si Cloud9 espera mejorar luego de su salida en la fase de grupos del Mundial del año pasado, Jensen deberá despejar los fantasmas de las derrotas anteriores. Quizás las emociones sean el rival más duro de Jensen en el escenario internacional. Si logra dominarlas, su límite será el cielo.</p>"},"foreignIds":{"drupalId":"4330","TRLH1":"200000174","TRLH2":"200000078","TRLH3":"200000338"},"socialNetworks":{"facebook":"https://www.facebook.com/c9incarnati0n","twitch":"https://twitch.tv/incarnati0n","twitter":"https://twitter.com/Incarnati0nLoL"},"champions":[],"liveGameTeam":18},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":499,"slug":"smoothie","name":"Smoothie","firstName":"Andy","lastName":"Ta","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smoothie-5yeikqg2.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:10.000Z","updatedAt":"2017-07-04T19:27:48.000Z","bios":{"en_US":"<p>Andy “Smoothie” Ta offers Cloud9 the perfect blend of support attributes -- control of the map, and protection of carries. After spending most of the 2016 Summer Split sharing time in the support role, Smoothie took over the job full time near the end of the split and never looked back. Despite limited playtime, Smoothie had the third best support KDA in the league for the Summer Split.</p>\n\n<p>In less than a year, Smoothie went from bouncing around the NA Challenger scene all the way to the 2016 World Championship. While the rookie was overshadowed by some of the world’s finest, he’s one of the best young supports in the scene. He’ll have his sophomore season to level up his skills and take another shot at greatness on the world stage.</p>","fr_FR":"<p>Andy « Smoothie » Ta a rejoint Team Liquid en 2015 après ses débuts aux LCS avec Team Dragon \n\nKnights, plus tôt dans l'année. Bien que ce support ait été plutôt discret dans sa première année aux LCS, \n\nSmoothie a impressionné les dirigeants de TL au point que ces derniers lui ont proposé une place dans \n\nl'équipe ; équipe qui a fini à la première place de la saison régulière du segment d'été des LCS NA 2015. \n\nIl ne tient qu'à lui de prouver qu'il est capable de conserver son poste.</p>","pl_PL":"<p>Pochodzący z Calgary, w Kanadzie, \"Smoothie\" zainteresował się profesjonalną sceną dopiero w sezonie piątym. Dołączył do Team Dragon Knights w lutym 2015 roku, zastępując poprzedniego supporta. Zamiana zbiegła się w czasie z początkiem wiosennego sezonu NA Challenger Series 2015. Andy, wraz z drużyną, skończył go na drugim miejscu z wynikiem 7:3. Po zajęciu też drugiego miejsca w rozgrywkach barażowych zakwalifikował się do Summer Promotion Tournament. TDK zostało wybrane przez Winterfox, lecz udało im się zwyciężyć, pomimo substytucji mid-lanera. Niestety „rycerze” nie poradzili sobie najlepiej w letnim sezonie NA LCS 2015, kończąc na ostatnim miejscu z wynikiem 3:15. Przez pozycję na samym dnie zostali automatycznie przeniesieni z powrotem do NA Challenger Series. Dlatego \"Smoothie\" opuścił szeregi Team Dragon Knights w październiku 2015 roku. Jednak umiejętności Kanadyjczyka zaprezentowane w tym okresie zrobiły wrażenie na wielu osobach – w efekcie dostał zaproszenie do Team Liquid.</p>\n<p>\nPrzyjęcie Andiego do drużyny zostało ogłoszone 16.10.2015 poprzez film w internecie pt. „Team Liquid Smoothie Challenge”. W nim czterech członków organizacji ściera się w konkursie na zrobienie najlepszego koktajlu, a o zwycięzcę ma wyłonić tajemniczy sędzia. Oczywiście sędzia to Andy, który oświadcza, że jest tylko jeden prawdziwy „Smoothie” i że będzie supportem w  Team Liquid. Fakt, że zastępuje doświadczonego Alexa \"Xpecial\" Chu’a, bardzo dobrze o nim świadczy.</p>\n<p>\nZa swojego ulubionego bohatera uważa Thresha, jednak cieszy go też gra Janną i Annie. W letnim sezonie NA LCS 2015 można także było zobaczyć jego imponującą grę Nautilusem. Pomimo krótkiego stażu na scenie esportowej posiada sporą ilość wielbicieli, co jest główną zasługą jego aktywności na portalach społecznościowych. Lubi umieszczać w internecie zdjęcia swojego autorstwa, np. swoich z innymi ludźmi lub potraw. Aż 1500 osób śledzi jego dzieła sztuki fotografii. Poza tym przepada za komentowaniem bieżących wydarzeń na świecie. Wszystko zapowiada, że będzie miał doskonały kontakt z fanami.\n</p>","de_DE":"Andy „Smoothie“ Ta bietet Cloud9 die perfekte Mischung an Supporter-Attributen: Er sorgt dafür, dass seine Mannschaft die Kontrolle über die Karte hat und beschützt die Carrys. Nachdem Smoothie die Supporter-Rolle für einen Großteil des Sommer-Splits 2016 teilen musste, ist er seit Ende der Saison alleine für das Wohl seiner Mitspieler verantwortlich. Trotz der beschränkten Spielzeit erreichte Smoothie die drittbeste Supporter-TTU (KDA) des Sommer-Splits.\n</p>\nIn weniger als einem Jahr hat es Smoothie von der nordamerikanischen Challenger-Szene bis zur Weltmeisterschaft 2016 geschafft. Auch wenn er von einigen der besten Spieler der Welt überschattet wurde, gehört er trotzdem zu den besten jungen Supportern der Szene. In seiner zweiten Saison hat er die Chance, weiter an seinen Fähigkeiten zu arbeiten und erneut zu versuchen, auf der WM-Bühne zu brillieren.\n","es_AR":"<p>Andy \"Smoothie\" Ta ofrece a Cloud9 la combinación perfecta de atributos de un soporte: control del mapa y protección de acarreadores. Después de pasar la mayor parte de la temporada regular del 2016 jugando parcialmente en ese rol con Bunny FuFuu, Smoothie comenzó a desempeñar esta tarea de tiempo completo para el final de la temporada y sin mirar atrás. A pesar de que su tiempo de juego fue limitado durante la mayor parte del torneo, Smoothie obtuvo el tercer mejor KDA de un soporte en la liga con 5.6 puntos. Se destacó con el Bardo durante la temporada regular, y su Tahm Kench ayudó a sellar la victoria del quinto combate contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha tenido un largo recorrido desde sus días en la escena de retadores de NA durante los últimos dos años. En el juego temprano, su fuerte carril protege a Sneaky y permite que el acarreador principal de C9 sobreviva intacto hasta el final del combate. Aunque Smoothie suele quedar opacado por Biofrost, otro gran soporte novato, tuvo un desempeño increíble para alguien con tan poca experiencia profesional. La falta de experiencia se pondrá a prueba en el Mundial. Allí se debilitará y perderá, o permanecerá firme y ganará bajo las brillantes luces del escenario internacional.</p>","es_ES":"<p>Andy ''Smoothie'' Ta ofrece a Cloud9 la mezcla perfecta de atributos de apoyo: control del mapa y protección para los carries. Tras pasar la mayor parte de la temporada regular de 2016 compartiendo el rol de apoyo con Bunny FuFuu, Smoothie acabó por ocupar el puesto a tiempo completo al final de la temporada, y no ha mirado atrás desde entonces. A pesar de haber contado con tiempo limitado de juego la mayor parte del split, Smoothie consiguió la tercera mejor A/M/A de apoyo de la liga, con una puntuación de 5,6. Durante la temporada regular destacó con Bardo, y su Tahm Kench ayudó a conseguir la victoria en la quinta partida contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha recorrido un largo camino desde que frecuentara la escena Aspirante de Norteamérica durante los últimos dos años. Al principio de la partida, su potente actividad en calle protege a Sneaky, lo que ayuda que el carry principal de C9 llegue a final de partida de una pieza. Aunque Biofrost, otro apoyo principiante, suele hacerle sombra, Smoothie lo hace increíblemente bien para tener tan poca experiencia profesional. Su escasa experiencia será puesta a prueba en el Mundial, donde podrá derrumbarse y perder, o mantenerse como un témpano de hielo y ganar bajo los ardientes focos del escenario internacional.</p>","pt_BR":"<p>Andy “Smoothie” Ta oferece à Cloud9 a mistura de atributos perfeita para um suporte: controle de mapa e proteção de carregadores. Após passar grande parte da temporada regular de 2016 dividindo a função de suporte com Bunny FuFuu, Smoothie passou a exercer a função em tempo integral próximo do final da temporada e nunca mais olhou para trás. Apesar de seu pouco tempo de jogo em grande parte da Etapa, Smoothie alcançou o terceiro melhor AMA entre os suportes da liga, marcando 5,6. Ele se sobressaiu de Bardo durante a temporada regular e seu Tahm Kench ajudou a fechar o último jogo contra a Immortals nas Semifinais.</p>\n\n<p>Smoothie trilhou um longo caminho desde a época em que se aventurava no cenário Desafiante na NA até esses últimos dois anos. No início do jogo, sua poderosa fase de rotas consegue proteger Sneaky e ajudar que o principal carregador da C9 chegue inteiro no fim de jogo. Apesar de Smoothie muitas vezes ser ofuscado por Biofrost, outro suporte novato incrível, ele ainda tem um desempenho excelente para alguém com tão pouca experiência no cenário profissional. Mas essa falta de experiência será posta à prova no Mundial, onde ele só terá duas opções: ser massacrado e perder ou manter a calma e vencer sob os enormes holofotes do palco internacional.</p>"},"foreignIds":{"drupalId":"3799","TRLH2":"200000080","TRLH1":"200000176","TRLH3":"200000340"},"socialNetworks":{"twitter":"https://twitter.com/LiquidSmoothiee"},"champions":[],"liveGameTeam":18},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23}],"scheduleItems":[{"id":"AVIUunHhOPWArxM1l4Zc","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:4a7bb6aa-5d40-44cb-8673-907aa34fd06c","scheduledTime":"2016-02-28T21:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"7","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"4a7bb6aa-5d40-44cb-8673-907aa34fd06c","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"0ea22d4c-94cb-47da-ab3f-b36bb80f0dcc","gameHash":"9ced30be404b8989"}],"videos":[{"id":1122,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:0ea22d4c-94cb-47da-ab3f-b36bb80f0dcc","source":"https://www.youtube.com/embed/cJIcNYdGsfY?wmode=transparent","createdAt":"2016-02-28T23:23:20.000Z","updatedAt":"2016-02-28T23:23:20.000Z","game":"0ea22d4c-94cb-47da-ab3f-b36bb80f0dcc"}],"htmlBlocks":[],"match":{"id":"4a7bb6aa-5d40-44cb-8673-907aa34fd06c","name":"C9-vs-CLG","position":5,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b92a4425-63aa-41fe-8915-e7ed9fe5d365"},{"roster":"727d9e37-69fc-4898-8b5a-cfbf9c001041"}],"games":{"0ea22d4c-94cb-47da-ab3f-b36bb80f0dcc":{"id":"0ea22d4c-94cb-47da-ab3f-b36bb80f0dcc","name":"G1","generatedName":"C9|CLG|G1|4a7bb6aa5d4044cb8673","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b92a4425-63aa-41fe-8915-e7ed9fe5d365"},{"roster":"727d9e37-69fc-4898-8b5a-cfbf9c001041"}],"standings":{"result":[[{"roster":"727d9e37-69fc-4898-8b5a-cfbf9c001041"}],[{"roster":"b92a4425-63aa-41fe-8915-e7ed9fe5d365"}]],"timestamp":1456697366231,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001580187","gameRealm":"TRLH1","platformId":"TRLH1:1001580187","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"727d9e37-69fc-4898-8b5a-cfbf9c001041"}],[{"roster":"b92a4425-63aa-41fe-8915-e7ed9fe5d365"}]],"timestamp":1456697366231,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}