{"teams":[{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]},{"id":335,"slug":"ninjas-in-pyjamas","name":"Ninjas in Pyjamas","guid":"c11ee870-91e2-475c-8c4d-8331bbcc0fef","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-588ue1or.png","acronym":"NIP","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-fmnft9me.png","createdAt":"2017-05-23T21:16:51.000Z","updatedAt":"2017-07-27T08:06:19.000Z","bios":{"en_US":"<p>After nearly four years away, Ninjas in Pyjamas have sneaked back into the EU LCS. After acquiring the spot of Fnatic Academy, the organization that gave players like Bjergsen and Svenskeren their start is looking to take the league by storm with a brand new roster. The players will have to be nimble if they want to build synergy and challenge the giants of Europe. Don't turn your back on the Ninjas. </p>\n\n<p>Coach: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Team Manager: Robin \"Jed\" Jedhammar</p>","pl_PL":"<p>Po niemal czterech latach nieobecności Ninja zakradli się z powrotem do EU LCS. Po zajęciu miejsca Fnatic Academy — organizacji, która wydała z siebie takich zawodników jak Bjergsen i Svenskeren — drużyna od samego początku zamierza podbić ligę szturmem w całkiem nowym składzie. Zawodnicy będą musieli być niezwykle skuteczni, jeśli chcą zgrać się ze sobą i rzucić wyzwanie gigantom Europy. Nie odwracajcie się plecami do Ninja. </p>\n\n<p>Główny trener: Nicholas „NicoThePico” Korsgaard</p>\n<p>Menedżer drużyny: Robin „Jed” Jedhammar</p>\n","fr_FR":"<p>Après presque quatre ans d'absence, les Ninjas in Pyjamas sont de retour dans les LCS EU. Suite à sa victoire contre Fnatic Academy, l'organisation dans laquelle Bjergsen et Svenskeren ont fait leurs débuts espère prendre la ligue d'assaut grâce à une toute nouvelle formation. Les joueurs devront faire preuve d'une grande agilité pour créer une synergie et mettre les géants européens au défi. Ne tournez pas le dos aux Ninjas. </p>\n\n<p>Entraîneur principal : Nicholas « NicoThePico » Korsgaard</p>\n<p>Responsable d'équipe : Robin « Jed » Jedhammar</p>\n","es_ES":"<p>Después de casi cuatro años, Ninjas in Pyjamas ha vuelto a la LCS EU. La organización que fue testigo de los primeros pasos de Bjergsen y Svenskeren llega para arrasar con una nueva plantilla después de quedarse con el puesto de Fnatic Academy. Los jugadores tendrán que ser astutos si quieren compenetrarse y suponer un desafío para los colosos de Europa. No perdáis de vista a los Ninjas. </p>\n\n<p>Entrenador principal: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Jefe de equipo: Robin \"Jed\" Jedhammar</p>\n","de_DE":"<p>Nach beinahe vier Jahren Abwesenheit haben sich die Ninjas in Pyjamas wieder in die EU LCS geschlichen. Die Organisation, bei der Spieler wie Bjergsen und Svenskeren ihre Profikarrieren gestartet haben, hat sich den Startplatz von Fnatic Academy gesichert und versucht jetzt, die Liga mit einer neuen Aufstellung im Sturm zu erobern. Doch die Spieler müssen sich geschickt anstellen, wenn sie die perfekte Harmonie finden und Europas Schwergewichte herausfordern wollen. Wende den Ninjas ja nicht den Rücken zu. </p>\n\n<p>Cheftrainer: Nicholas „NicoThePico“ Korsgaard</p>\n<p>Mannschaftsleiter: Robin „Jed“ Jedhammar</p>\n"},"foreignIds":{},"players":[197,484,713,750,1115,1684,1721,1913],"starters":[197,484,713,750,1684],"subs":[1115,1721,1913]}],"players":[{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":197,"slug":"shook","name":"Shook","firstName":"Ilyas","lastName":"Hartsema","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shook-43143fnj.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-06-09T11:04:02.000Z","bios":{"en_US":"<p>Ilyas “Shook” Hartsema  made his first LCS appearance in the 2014 EU LCS Spring Split, jumping onto his opponents with every jungle assassin he could find. From Lee Sin to Kha’Zix, and even Evelynn, Shook found true happiness by exploding enemy carries from 100 to 0. His skill and technique in the jungle were proven time and again with impressive displays to both save his allies and slay his foes.</p>\n\n<p>However, with the meta quickly shifting towards tanky champs in the jungle, Shook found himself out of sorts. Claiming 1st place in Europe and participating in the group stages at the 2014 World Championship with Alliance started to look like Shook's peak, and he slowly slid down the mountain in 2015 with Elements and then the Copenhagen Wolves. Now he finds himself back in the LCS with Ninjas in Pyjamas. Here's hoping we see the old Shook, the champion slayer.</p>","de_DE":"<p>Der niederländische Spieler Ilyas Hartsema hört auf den Namen Shook und hat in der Vergangenheit bereits in vielen Teams mitspielen dürfen. Die bekanntesten Besuche hatte er in diesem Fall bei Copenhagen Wolves, Elements oder mousesports. Nachdem er aber alle Teams bereits nach kurzer Zeit wieder verlassen hatte, hofft er jetzt bei Vitality auf eine lange und große Karriere. </p>\n\n<p>Ilyas Hartsema ist ein exzellenter Jungler, der vor allem für seine Spielweise mit Lee Sin bekannt ist. Shook hat 2014 für das Team Alliance gespielt und durfte hier im EU LCS Summer Split und beim EU LCS Spring Split mitwirken. Damals waren gerade Lee Sin und Nidalee auf ihm oft zu sehen. </p>\n\n<p><h2>Die Rolle von Shook </h2></p>\n\n<p>Shook begann seine Karriere in League of Legends als Top-Laner. Nachdem er es aber Leid war, immer wieder von gegnerischen Spielern aus dem Dschungel aufgemischt zu werden, entschloss er sich dazu ein Jungler zu werden. Er selbst beschreibt sich selbst als aggressiver Spieler, der gerne den Kampf beginnt und dafür ein hohes Risiko eingeht. </p>\n\n<p><i>„Ich muss mich manchmal zurückhalten, um nicht zu aggressiv ins Geschehen zu gehen. Manchmal endet es schlimm für mich.“  - Ilyas „Shook“ Hartsema </i></p>\n\n<p>Die aggressive Spielweise spiegelte sich lange Zeit aber nicht nur auf dem Spielfeld wider. Während der dritten Saison bekam er für all seine Accounts einen permanenten Bann, nachdem er lange Zeit eine sehr toxische Einstellung besaß. Erst mit dem Start der Saison im Jahr 2014 durfte Ilyas Hartsema wieder als Shook spielen und war hier als Jungler beim Team Alliance vertreten. Seitdem gibt er alles dafür, zu den besten Dschungel-Spielern aus Europa zu gehören. </p>\n\n<p><i>„Ich glaube ich kann der beste Jungler in Europa werden, sofern ich viel übe. Das Ziel ist die Weltmeisterschaft. Ich werde erst zufrieden sein, wenn ich das erreicht habe.“ - Ilyas „Shook“ Hartsema</i></p>\n\n\n<p><h2>Interessante Fakten </h2></p>\n<p>•\tBeliebte Champions: Lee Sin, Nidalee, Rek´Sai</p>\n<p>•\tNiederländischer Spieler </p>\n<p>•\tBekannt für seine aggressive Spielweise </p>\n","fr_FR":"<p>Ilyas « Shook » Hartsema a fait sa première apparition aux LCS lors du segment printanier des LCS EU 2014, bondissant inlassablement sur ses adversaires pour les assassiner. Que ce soit avec Lee Sin ou Kha'Zix, voire Evelynn, Shook s'est épanoui en supprimant les carrys ennemis. Ses compétences et sa technique dans la jungle ont prouvé à maintes reprises qu'il était aussi bien capable de sauver ses alliés que de tuer ses ennemis.</p>\n<p>Cependant, la meta ayant rapidement évolué en faveur des champions tanky dans la jungle, Shook s'est retrouvé diminué. En 2014, la première place obtenue aux LCS EU et la participation à la phase de groupe du mondial avec Alliance ont été le sommet de la carrière de Shook ; après cela, il a été sur une pente descendante en 2015, avec Elements puis avec Copenhagen Wolves. Team Vitality a toutefois décidé de compter sur lui et a recruté Shook durant l'intersaison 2015. Nouvelle formation, nouvelle organisation et nouveau départ ! Espérons que nous retrouverons l'ancien Shook, celui qui faisait des massacres.</p>","es_ES":"<p>Pocos recuerdan la época en la que Ilyas ‘Shook’ Hartsema decidió prescindir del apodo por el que ahora es conocido para llamarse ‘enVision’. En efecto, después de pasar por organizaciones con las que aspiraba a acceder a la primera edición de la LCS EU, como DragonBorns o mousesports, el holandés decidió modificar su alias con el deseo de iniciar una nueva etapa en su carrera.</p>\n\n<p>Pero, como algunos genios aconsejan, hay que tener cuidado con lo que se desea. El 21 de enero de 2013, cuatro días antes de disputar el clasificatorio para la máxima competición continental, el jungla recibió una sanción que le alejaba de la LCS durante un año. Con su sueño hecho añicos por culpa de su mal comportamiento en las partidas clasificatorias, Shook recuperó su sobrenombre original, quizá para recordarse a sí mismo que tenía que volver al punto de partida para alcanzar su meta.</p>\n\n<p>Lejos de venirse abajo, Shook no tardó en unirse a Pride FC para dominar el circuito amateur europeo junto a Martin ‘Rekkles’ Larsson, cedido por Fnatic debido a la restricción de edad que le impedía codearse con los mejores. La exitosa alineación captó con celeridad la atención de Copenhagen Wolves, que buscaba un hueco en la LCS. La organización danesa, conocida por pulir diamantes en bruto que se unen a proyectos más ambiciosos tras su periodo de formación, fue incapaz de retener a su principal activo cuando Riot Games levantó a Shook su castigo.</p>\n\n<p>Casi diez meses después de ver truncadas sus esperanzas, Alliance le ofreció al prometedor jungla un hueco en el proyecto forjado con la intención de derrocar a Fnatic. El equipo no dio con la tecla adecuada en el split de primavera de 2014, pero encontró la fórmula perfecta en la edición estival. La escuadra no abandonó el liderato durante toda la fase regular gracias en buena parte a las actuaciones de Shook con Lee Sin y Elise, sus dos personajes emblemáticos, que le llevaron a recibir el premio al jugador más valorado de la segunda jornada.</p>","pl_PL":"<p>Shook to dżungler o ogromnych możliwościach, który jednak w ciągu dwóch lat występów na najwyższym poziomie nie do końca potrafił zaprezentować skalę swojego talentu i wydaje się, że nadal ma coś do udowodnienia.</p>\n<p>\nHolenderski gracz zaczynał swoją przygodę z profesjonalną sceną we wrześniu 2012 roku od występów w IWantCookie, które później przekształciło się w Dragonborns, lecz Shook grał w tej drużynie jeszcze zanim zespół wywalczył awans do EU LCS. Później holenderski dżungler dołączył do formacji Pride FC, której potencjał szybko dostrzegły większe organizacje. Ostatecznie formacja została zakontraktowana przez Copenhagen Wolves i całkowicie zdominowała amatorską scenę, a ukoronowaniem dobrych występów był awans do wiosennego splitu EU LCS 2014. Shook jednak miał inne plany i zdecydował się zmienić zespół. Dołączył do Henrika „Froggena” Hansena budującego europejski super-team w Alliance.  Shook był w tym czasie uważany za czołowego leśnika na Starym Kontynencie, wobec czego nie może dziwić, że duński mid-laner do swojego wymarzonego składu wybrał właśnie jego. </p>\n<p>\nOczekiwania co do występów nowej potęgi były jednak ogromne, a zawodnicy mieli problemy by je udźwignąć. Ogromna fala krytyki spadła właśnie na Shooka, który nie prezentował się tak jak tego od niego oczekiwano i miał dość duży wpływ na beznadziejną passę drużyny, która z pierwszych 12 spotkań wygrała tylko cztery pojedynki. Już wieszczono rychły koniec nadziei na dominację w Europie, kiedy Shook i cały zespół przebudzili się i finiszowali na trzeciej pozycji, play-offy kończąc na czwartym miejscu. Już wtedy profesjonalni zawodnicy zachodzili w głowę, dlaczego holenderski dżungler tak znakomicie prezentuje się w grach treningowych, nierzadko niemal samodzielnie ciągnąć drużynę, a tak bardzo zawodzi w meczach o stawkę. Ten problem miał się ciągnąć za Shookiem jeszcze bardzo długo.</p>\n<p>\nPomimo to w letnim splicie 2014 Alliance spisało się już znacznie lepiej – zwyciężyło, przerywając dominację Fnatic, a Shook zrobił duży postęp, jeśli chodzi o występy na scenie. Zachwycał przede wszystkim swoim osławionym Lee Sinem, który do dziś jest jego najmocniejszą postacią. </p>\n<p>\n„Jeśli ktokolwiek miałby równać się z Inseciem, jeśli chodzi o opanowanie Lee Sina, to byłby to Shook” – powiedział nawet polski dżungler Marcin „Jankos” Jankowski.</p>\n<p>\nDrużynie Holendra udało się przerwać dominację Fnatic i wygrać letnią edycję zmagań, a w związku z tym także pojechać na Mistrzostwa Świata. Tam formacja przeżywała kryzys, a Shook ponownie zmagał się ze starymi problemami i do końca swojej kariery w Alliance, które później zmieniło nazwę na Elements, nie potrafił już pokazać pełni swoich możliwości. Wskutek tego zespół w końcu stracił cierpliwość i w letnim splicie zastąpił Holendra Marcelem „Dexterem” Feldkampem. Shook na krótko wylądował jeszcze w Copenhagen Wolves, gdzie zagrał dziesięć ostatnich spotkań splitu i, pozbawiony tak dużej presji, znów błyszczał, ale nie dał rady uratować znajdującej się w fatalnej sytuacji starej/nowej ekipy.\nPo zakończeniu letniej edycji rozgrywek 2015 słuch o holenderskim leśniku zaginął i pierwsze doniesienia wypłynęły dopiero w grudniu 2015 roku, kiedy okazało się, że Shook został dżunglerem w aspirującym do walki o czołowe lokaty Teamie Vitality.\n</p>"},"foreignIds":{"drupalId":"1119","TRLH3":"200000305","TRLH4":"200000405","TRLH2":"1001250065","FRA1TMNT2":"25479"},"socialNetworks":{"twitch":"www.twitch.tv/shooklol","facebook":"www.facebook.com/Shook.LoL","twitter":"https://twitter.com/ShookLoL"},"champions":[],"liveGameTeam":335},{"id":484,"slug":"promisq","name":"sprattel","firstName":"Hampus","lastName":"Abrahamsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/promisq-2wryxfa8.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-05-15T18:29:25.000Z","updatedAt":"2017-06-09T11:01:09.000Z","bios":{"en_US":"<p>\nHampus “sprattel” Abrahamsson (formerly PromisQ) is a relatively new player in the EU esports scene. He joined Elements in 2015 as their starting support, taking the place of Nyph. However, Sprattel's launch into the spotlight of professional esports didn't come without its missteps. He struggled in the 2015 EU LCS Summer Split and was swapped with substitute support Nyph after the fourth week of competition.\n</p>\n<p>\nThe 2016 EU LCS Spring Split didn’t go much better as he struggled to find rhythm with his bot lane partner, MrRallez. In May, Elements’ seed was acquired by FC Schalke 04, and sprattel was kept on as the team’s starting support. Sprattel will try to right the ship on Ninjas in Pyjamas' new roster this summer.\n</p>","fr_FR":"<p>Hampus « PromisQ » Abrahamsson est relativement nouveau sur la scène e-sport européenne. Il a rejoint Elements en 2015 pour y assumer le rôle de support titulaire à la place de Nyph. Les premiers pas de PromisQ sur la scène professionnelle ne se sont cependant pas très bien passés. Il a rencontré des difficultés lors du segment d'été des LCS EU 2015 et a dû se faire remplacer par Nyph dès la quatrième semaine de la compétition.</p>\n<p>PromisQ a de nouveau retrouvé son poste de support titulaire pour le segment printanier des LCS EU 2016, mais il lui reste encore à prouver qu'il a le talent nécessaire pour être un vrai titulaire aux LCS.</p>","es_ES":"<p>Hampus 'PromisQ' Abrahamsson es un jugador relativamente conocido en la escena europea de League of Legends. Se unió a Elements en 2015 como su apoyo titular, tomando el relevo de Nyph en lo que era su debut como profesional. Pero la cosa no resultó como esperaba y fue sustituido después de cuatro semanas de competición por el mismo Nyph, debido a su pobre rendimiento.</p>\n<p>Sin embargo PromisQ ha vuelto para ser el apoyo titular de Elements en el Spring de Primavera de la LCS EU 2016, ya no es un novato, pero tiene que demostrar que tiene lo que hay que tener para ser un jugador a tener en cuenta en la máxima competición europea.</p>","de_DE":"<p>Zuvor war Hampus \"sprattel\" Abrahamsson unter den Namen promisQ bekannt. Er entdeckte League of Legends erst in der dritten Saison für sich und erfuhr von dort an rasante Verbesserungen. Jeher als Support-Spieler kletterte er in die Top 100 und wurde nach einem kurzen Aufenthalt in einem Amateurteam von Elements unter Vertrag genommen. </p>\n<h2><p>Eine schwere Aufgabe</p></h2>\n<p>Als sprattel im Sommer 2015 in das Kader von Elements aufgenommen wurde, war die Überraschung groß. Genauso groß waren damals die Fußstapfen, in die der LCS-Neuling stapfen musste. Sowohl Patrick \"Nyph\" Funke, als auch Mitch \"Krepo\" Voorspoels sind nicht nur in der Community beliebt, sondern haben vielerorts ihr Können unter Beweis gestellt. Wo Krepo resignierte, sollte das neue Gesicht einen Aufschwung bringen, der kaum noch zu schaffen war. Nach gerade einmal acht Spielen war das Erlebnis LCS schon wieder beendet. In den wenigen Spielen war es vor allem Alistar, mit dem er spielerisch überzeugte und dem Team zu seinen zwei einzigen Siegen während seines Aufenthalts verhalf. </p>\n<p>Die negative Statistik soll aber in keinem Fall damit gleichzusetzen sein, dass der Schwede es nicht verdient hätte, in der LCS zu spielen. Die Organisation glaubt fest an den noch unerfahrenen Spieler. Warum denn auch nicht, viele Teams haben in der Vergangenheit bereits unter Beweis gestellt, was aus anfangs so unbekannten Namen werden kann. Mit Nyph, einem der erfahrensten Supportern Europas, als Coach an seiner Seite kann sich der noch ungeschliffene Diamant nun mit neuem Kader unter Beweis stellen. Dieses Mal nicht inmitten eines Splits, sondern vorbereitet und mit hoch motivierten Kollegen.</p>\n","pl_PL":"<p>Hampus jest wielkim odkryciem Elements. Przed dołączeniem do tej organizacji był członkiem tylko jednej drużyny, inFerno eSports, od marca do maja 2015 roku. Wtedy zmienił barwy na tęczowe i został głównym supportem „żywiołów”. O dołączenie do tego zespołu został poproszony przez głównego trenera - Patricka \"Nyph\" Funke’a. W wywiadzie dla Aftonbladet Esport przypomniał sobie, że kiedy dostał od niego zaproszenie do znajomych w grze, aż poczuł motyle w brzuchu. Powiedział, że uznał to za swoją życiową szansę i zgodził się na tą propozycję. </p>\n<p>Niestety projekt okazał się zdecydowanie mniejszym sukcesem niż się spodziewano. W efekcie czego największe zespołowe osiągnięcia \"Sprattel’a\" nie robią wrażenia. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 uplasował się dopiero na 7 miejscu z wynikiem 7:11. Biorąc pod uwagę ekskluzywność tych rozgrywek, trzeba to uznać za niemały wyczyn. Jednak bardziej imponujący jest efekt jego gry w solo que. W League of Legends gra od 2013 roku, ciągle supportem. Zajmując tą rolę w 3 sezonie udało mu się zdobyć diamentową rangę, a w kolejnych był już w Kręgu Pretendenta, gdzie zdobył aż 800 punktów LP.</p>\n<p>Z całej drużyny, po niezbyt udanym sezonie piątym, pozostał tylko \"Sprattel\". Podczas wywiadów cechowała go rozmowność, pewnie dlatego, że chciał przekazać swoim fanom jak najwięcej o sobie. Tuż przed pokazaniem się w rozgrywkach EU LCS wyraził swoją radość, z tego że będzie mógł się zmierzyć z najlepszymi graczami w Europie. Wielokrotnie wspominał, że konkurowanie z innymi jest dla niego najważniejsze w League of Legends. To właśnie chęć starcia się ze sławami doprowadziła Hampusa tak wysoko. O dziwo jako support jest dużo bardziej skoncentrowany na wspieraniu swojego AD Carry’ego - dlatego chętnie gra Janną, Nami i Morganą.</p>\n"},"foreignIds":{"drupalId":"4329","TRLH3":"200000259","TRLH4":"200000311","TRLH2":"1001250005","FRA1TMNT2":"25420","ESPORTSTMNT02":"200001029"},"socialNetworks":{"twitter":"https://twitter.com/SPRATTEL_lol"},"champions":[],"liveGameTeam":335},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":713,"slug":"heaq","name":"HeaQ","firstName":"Martin","lastName":"Kordmaa","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/heaq-5xfyf5io.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T13:56:18.000Z","bios":{"en_US":"<p>Martin \"HeaQ\" Kordmaa  bounced around Challenger-level teams for most of his career before landing the starting AD Carry position with Giants Gaming. The team had recruited their presumed starter, Upset, but he left the team shortly after. Giants’ search for a new carry intensified and they eventually decided that HeaQ was their number one option. After Giants was relegated, HeaQ now finds himself on the new roster for Ninjas in Pyjamas. He is beyond excited to prove that he has what it takes hang tough with the best in the business.</p>","de_DE":"<p>Martin „HeaQ“ Kormaa hat einen Großteil seiner Karriere damit verbracht, zwischen Mannschaften innerhalb der Challenger Series hin- und herzuwechseln, bis er schlussendlich als AD-Carry bei Giants Gaming landete. Das Team hatte ursprünglich Upset für diese Position rekrutiert, der das Team aber nach kurzer Zeit bereits verlassen hat. Sein Spielname schien damals Programm gewesen zu sein. Die Suche nach einem neuen Carry wurde immer intensiver und schließlich haben sie sich für HeaQ entschieden. Der Position des AD-Carrys auf LCS-Niveau gerecht zu werden, ist nie einfach, aber HeaQ möchte unbedingt beweisen, dass er das Zeug dazu hat, mit den Besten der Besten mitzuhalten.</p>","es_ES":"Martin \"HeaQ\" Kordmaa pululó por equipos de nivel Aspirante durante la mayor parte de su carrera hasta llegar a la posición de ADC en Giants Gaming. El equipo había fichado al que parecía que iba a ser su titular, Upset, pero este abandonó el equipo poco después. La búsqueda de un nuevo carry se intensificó y, al final, decidieron que HeaQ era su mejor opción. Tras el descenso de Giants, HeaQ ahora forma parte de la nueva alineación de Ninjas In Pyjamas. El estonio está más que ilusionado por demostrar que tiene lo que hace falta para enfrentarse a los mejores de la escena.","fr_FR":"Après être passé d'une équipe de niveau Challenger à une autre presque toute sa carrière, Martin « HeaQ » Kordmaa a fini par devenir carry AD titulaire chez Giants Gaming. L'équipe avait recruté son titulaire présumé, Upset, mais il les a quittés peu après. Les Giants ont intensifié leur recherche d'un nouveau carry et ils ont fini par décider que HeaQ était leur meilleure option. Suite à la relégation des Giants, HeaQ se retrouve à présent membre de la nouvelle formation des Ninjas In Pyjamas. Et il est surexcité à l'idée de prouver qu'il est à la hauteur de l'élite de la profession.","pl_PL":"Martin „HeaQ” Kordmaa przez większość swojej kariery przeskakiwał między drużynami na poziomie Pretendenta, po czym objął pozycję głównego prowadzącego w Giants Gaming. Drużyna zwerbowała do pierwszego składu Upseta, ale ten wkrótce ją opuścił. Giants zintensyfikowali swoje poszukiwania nowego prowadzącego i w końcu stwierdzili, że najlepszą opcją jest HeaQ. Gdy Giants zostali relegowani, HeaQ znalazł dla siebie miejsce w nowym składzie Ninjas In Pyjamas. Nie posiada się z radości, mogąc udowodnić, że stać go na dotrzymywanie kroku najlepszym w tej dyscyplinie."},"foreignIds":{"drupalId":"4472","TRLH3":"200000098","TRLH4":"200000201"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":750,"slug":"nagne","name":"Nagne","firstName":"Sang-moon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nagne-bnle5yoc.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T10:59:07.000Z","bios":{"en_US":"<p>Sang-moon \"Nagne\" Kim made his mark when he fought SK telecom's superstar mid laner Sang-hyeok \"Faker\" Lee to a standstill during an intense Best of 5 series at the Season 3 World Championship. Since then, Nagne has oscillated between being a force to be reckoned with and being a non-factor. Ninjas in Pyjamas is hoping he can return to form on their new roster. Because when he is on, Nagne is <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">a terror in the mid lane</a>.</p>","fr_FR":"<p>Sang-moon « Nagne » Kim a laissé sa marque en combattant le célèbre mid laner de SK Telecom, Sang-hyeok « Faker » Lee et en le paralysant au cours d'une intense partie en trois manches gagnantes lors du Mondial de la Saison 3. Depuis, Nagne oscille entre le redoutable et l'insipide. Mais récemment, Nagne s'est montré à son meilleur niveau de façon plus constante. Et quand il est en forme, Nagne est <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">une terreur sur la voie du milieu</a>.</p>","pl_PL":"<p>Sangmoon „Nagne” Kim dał się poznać, kiedy walczył z gwiazdą SK Telecom, środkowym Sang-hyeokiem „Fakerem” Lee w trakcie meczu do trzech zwycięstw w Sezonie 3 Mistrzostw Świata. Od tego czasu Nagne potrafił być zarówno kluczowym zawodnikiem, jak i tym prawie nieliczącym się w meczach. Ostatnio jednak dawał z siebie wszystko. A kiedy tak jest, <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">staje się prawdziwym postrachem środkowej alei</a>.</p>","de_DE":"<p>Jedes Team braucht seine Spielmacher und seine konsistenten Spieler. Ein System aus ausschließlich einem von beiden funktioniert nicht. Sangmoon \"Nagne\" Kim ist letzteres davon, er macht alle möglichen Metawandel zu einem gewissen Grad mit und ist einer der Stützen bei KT Rolster. Selten sieht man ihn seine Lane komplett verlieren, genauso hart gewinnen tut er sie allerdings genauso oft. Durch und durch ist der Mid-Lane-Veteran ein verlässlicher Spieler.</p>","es_ES":"<p>Sang-moon “Nagne” Kim dejó huella en la intensa batalla que libró contra SK Telecom y su estrella Faker en las semifinales del Campeonato Mundial de la Temporada 3. Aunque desde entonces, Nagne no ha conseguido encontrar la regularidad, depende del día puede ser o bien uno de los mejores mids de Corea del Sur o bien puede pasar desapercibido en la partida. Últimamente, no obstante, Nagne ha estado jugando a su mejor nivel al 100% del tiempo. Y cuando está a su mejor nivel, es un<a href=\" https://www.youtube.com/watch?v=Zrgae333efs&feature=youtu.be&t=3h34m10s\">  terror en la calle central.</a></p>","pt_BR":"<p>Sang-moon \"Nagne\" Kim deixou sua marca quando enfrentou a grande estrela da SK Telecom, Sang-hyeok \"Faker\" Lee, em uma melhor de cinco durante o Mundial da Terceira Temporada. Desde então, Nagne oscilou entre um dos melhores meios da Coreia e... nada. No entanto, recentemente Nagne tem (re)demonstrado seu potencial. E quando ele está assim, ele é um <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">terror na rota do meio</a>.</p>"},"foreignIds":{"drupalId":"686","TRLH3":"200000306","TRLH4":"200000406"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1115,"slug":"zhergoth","name":"Zhergoth","firstName":"Benjamin","lastName":"Sánchez","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/zhergoth-e48i3ns.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:40:03.000Z","updatedAt":"2017-05-31T21:39:43.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375397","TRLH2":"1001250089","FRA1TMNT2":"25362","TRLH3":"200000269","TRLH4":"200000321"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1684,"slug":"profit","name":"Profit","firstName":"Junhyung","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/profit-2siu86dd.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-12T18:21:45.000Z","updatedAt":"2017-07-06T13:44:20.000Z","bios":{"en_US":"<p>Junhyung \"Profit\" Kim joins the EU LCS after spending a year playing for the best team in the world: SK telecom T1. After splitting time with Huni in the top lane, Profit heads to Europe looking to use what he's learned to dominate the competition.</p>","de_DE":"Junhyung „Profit“ Kim nimmt an der EU LCS teil, nachdem er ein Jahr lang für die beste Mannschaft der Welt gespielt hat: SK Telecom T1. Nachdem er sich mit Huni die Position als Top-Laner geteilt, zieht es ihn jetzt nach Europa, wo er sich mit seinen Erfahrungen an die Spitze kämpfen will.","es_ES":"Junhyung \"Profit\" Kim se une a la LCS EU tras pasar un año jugando en el mejor equipo del mundo: SK telecom T1. Después de un tiempo compartiendo rol con Huni en la calle superior, Profit ha decidido trasladarse a Europa con intención de usar lo que ha aprendido para arrasar en la competición","fr_FR":"Junhyung « Profit » Kim a rejoint les LCS EU suite à une année passée avec la meilleure équipe du monde : SK Telecom T1. Après avoir partagé la voie du haut avec Huni, Profit arrive en Europe déterminé à utiliser ce qu'il a appris pour dominer la compétition","pl_PL":"Junhyung „Profit” Kim dołącza do EU LCS po roku gry dla najlepszej drużyny na świecie: SK Telecom T1. Po rozstaniu z Hunim na górnej alei Profit wybiera się do Europy, chcąc wykorzystać to, czego się nauczył, by zdominować konkurencję."},"foreignIds":{"ESPORTSTMNT06":"200000353","TRLH3":"200000304","TRLH4":"200000404"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1721,"slug":"whiteknight","name":"Whiteknight","firstName":"Matti","lastName":"Sormunen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whiteknight-584o692r.png","hometown":null,"region":"EU Challenger Series","birthdate":"1996-02-16","createdAt":"2017-01-19T13:21:22.000Z","updatedAt":"2017-06-18T19:15:07.000Z","bios":{},"foreignIds":{"esportstmnt05":"200000891","TRLH3":"200000285","TRLH4":"200000337","ESPORTSTMNT02":"200002380"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1913,"slug":"m1rage","name":"M1RAGE","firstName":"Noh Hoon","lastName":"Kwon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/m1rage-ij32gh00.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:48:55.000Z","updatedAt":"2017-05-31T21:33:31.000Z","bios":{},"foreignIds":{"TRLH3":"200000307","TRLH4":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AV3klGr4QMQFcjhwbQ-S","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:515468db-6a2a-4bc2-8fe1-6818b88520ad","scheduledTime":"2017-08-18T15:00:00.120+0000","tags":{"blockLabel":"Spring Promotion","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:74f0c1c5-22c7-4869-a3ac-9e35db8145c7","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"515468db-6a2a-4bc2-8fe1-6818b88520ad","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"74f0c1c5-22c7-4869-a3ac-9e35db8145c7","league":"3"}],"gameIdMappings":[{"id":"3ec0a8cd-5b77-4ed0-8572-2f92c3d31f61","gameHash":"97e1733cacbd4fcd"},{"id":"672f09dd-dc23-49c0-82b6-bda53f38eedf","gameHash":"723ce9838d5bcdbe"},{"id":"7c9c8a5d-d84f-4b0b-ac89-1d2aa8bf09c1","gameHash":"7b63e6f34465f4f9"},{"id":"34843ba7-95cc-40f6-b968-af3f886573cd","gameHash":"f8eea81637145926"}],"videos":[{"id":8553,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:34843ba7-95cc-40f6-b968-af3f886573cd","source":"https://www.youtube.com/embed/v8FRE24fJrg?wmode=transparent&rel=0","createdAt":"2017-08-19T08:20:43.000Z","updatedAt":"2017-08-19T08:20:43.000Z","game":"34843ba7-95cc-40f6-b968-af3f886573cd"},{"id":8554,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:3ec0a8cd-5b77-4ed0-8572-2f92c3d31f61","source":"https://www.youtube.com/embed/_V9_gwSf01c?wmode=transparent&rel=0","createdAt":"2017-08-19T08:21:01.000Z","updatedAt":"2017-08-19T08:21:01.000Z","game":"3ec0a8cd-5b77-4ed0-8572-2f92c3d31f61"},{"id":8555,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:672f09dd-dc23-49c0-82b6-bda53f38eedf","source":"https://www.youtube.com/embed/0QTaCQs6IGA?wmode=transparent&rel=0","createdAt":"2017-08-19T08:10:57.000Z","updatedAt":"2017-08-19T08:10:57.000Z","game":"672f09dd-dc23-49c0-82b6-bda53f38eedf"},{"id":8556,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:7c9c8a5d-d84f-4b0b-ac89-1d2aa8bf09c1","source":"https://www.youtube.com/embed/KHe-90dNUKI?wmode=transparent&rel=0","createdAt":"2017-08-19T08:22:24.000Z","updatedAt":"2017-08-19T08:22:24.000Z","game":"7c9c8a5d-d84f-4b0b-ac89-1d2aa8bf09c1"}],"htmlBlocks":[],"match":{"id":"515468db-6a2a-4bc2-8fe1-6818b88520ad","name":"match-b","position":1,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1},{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],"games":{"3ec0a8cd-5b77-4ed0-8572-2f92c3d31f61":{"id":"3ec0a8cd-5b77-4ed0-8572-2f92c3d31f61","name":"G2","generatedName":"GIA|NIP|G2|515468db6a2a4bc28fe","input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1},{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],"standings":{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503130561893,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503076233321,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002220036","gameRealm":"TRLH3","platformId":"TRLH3:1002220036","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"672f09dd-dc23-49c0-82b6-bda53f38eedf":{"id":"672f09dd-dc23-49c0-82b6-bda53f38eedf","name":"G4","generatedName":"GIA|NIP|G4|515468db6a2a4bc28fe","input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1},{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],"standings":{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503130725419,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503080761947,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002220038","gameRealm":"TRLH3","platformId":"TRLH3:1002220038","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"7c9c8a5d-d84f-4b0b-ac89-1d2aa8bf09c1":{"id":"7c9c8a5d-d84f-4b0b-ac89-1d2aa8bf09c1","name":"G3","generatedName":"GIA|NIP|G3|515468db6a2a4bc28fe","input":[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}],"standings":{"result":[[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}],[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}]],"timestamp":1503130785585,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}],[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}]],"timestamp":1503077697927,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002220037","gameRealm":"TRLH3","platformId":"TRLH3:1002220037","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"34843ba7-95cc-40f6-b968-af3f886573cd":{"id":"34843ba7-95cc-40f6-b968-af3f886573cd","name":"G1","generatedName":"GIA|NIP|G1|515468db6a2a4bc28fe","input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1},{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],"standings":{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503130612104,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1}]],"timestamp":1503072053557,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002220027","gameRealm":"TRLH3","platformId":"TRLH3:1002220027","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6cd1e7d4-60a6-4400-9375-c0cba5afcde5":{"id":"6cd1e7d4-60a6-4400-9375-c0cba5afcde5","name":"G5","generatedName":"GIA|NIP|G5|515468db6a2a4bc28fe","input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":1},{"roster":"1160065f-235e-4518-b6d8-20c43950fa35","breakpoint":"2ab4a731-0356-45aa-b33e-bb528a94b3e1","standing":2}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1503130785586,"source":"bestOf","history":[{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1503130725419,"source":"bestOf","closed":true},{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1503130561893,"source":"bestOf","closed":true},{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1503130612110,"source":"bestOf","closed":true},{"result":[[{"roster":"1160065f-235e-4518-b6d8-20c43950fa35"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1503080761947,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"1160065f-235e-4518-b6d8-20c43950fa35":1,"f55a8ea5-4393-4796-9cda-7e1de955c547":0}}}