{"teams":[{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]},{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]}],"players":[{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163}],"scheduleItems":[{"id":"AVRUIAKHoUG4HPFjOJ8Z","content":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:match:54cd54c9-4d8e-4bf7-85fc-b68ad3454afa","scheduledTime":"2016-05-05T08:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb","blockLabel":"2","subBlockLabel":"Live Broadcast","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:bracket:3d469dc6-3409-4b0c-a4d4-201b1aa99a7a"},"match":"54cd54c9-4d8e-4bf7-85fc-b68ad3454afa","tournament":"69298c0c-16ae-490a-8e9c-cfe4620a6bfb","bracket":"3d469dc6-3409-4b0c-a4d4-201b1aa99a7a","league":"10"}],"gameIdMappings":[{"id":"c35d3950-d609-429d-b1cc-f6982fced708","gameHash":"19f7c5a9fc35bb59"}],"videos":[{"id":2682,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c35d3950-d609-429d-b1cc-f6982fced708","source":"https://www.youtube.com/embed/zD4IfPLPlQc","createdAt":"2016-05-05T10:06:18.000Z","updatedAt":"2016-05-05T17:03:32.000Z","game":"c35d3950-d609-429d-b1cc-f6982fced708"},{"id":2683,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c35d3950-d609-429d-b1cc-f6982fced708","source":"https://www.youtube.com/watch?v=LFhgtGPCP9k","createdAt":"2016-05-05T10:55:13.000Z","updatedAt":"2016-05-05T10:55:13.000Z","game":"c35d3950-d609-429d-b1cc-f6982fced708"},{"id":2690,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:c35d3950-d609-429d-b1cc-f6982fced708","source":"https://www.youtube.com/embed/kh6kjOGmPN4?wmode=transparent","createdAt":"2016-05-05T18:23:46.000Z","updatedAt":"2016-05-05T18:23:46.000Z","game":"c35d3950-d609-429d-b1cc-f6982fced708"}],"htmlBlocks":[],"match":{"id":"54cd54c9-4d8e-4bf7-85fc-b68ad3454afa","name":"RNG-vs-G2","position":9,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"},{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}],"games":{"c35d3950-d609-429d-b1cc-f6982fced708":{"id":"c35d3950-d609-429d-b1cc-f6982fced708","name":"G1","generatedName":"G2|RNG|G1|54cd54c94d8e4bf785fc","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"},{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}],"standings":{"result":[[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],[{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}]],"timestamp":1462442585357,"source":"manual","note":"Set in esports HQ","history":[{"result":[[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],[{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}]],"timestamp":1462442575967,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"60198","gameRealm":"TRLT3","platformId":"TRLT3:60198","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],[{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}]],"timestamp":1462442585357,"source":"manual","note":"Set in esports HQ","history":[{"result":[[{"roster":"a81e5111-764c-40ea-8120-e690ba6289a5"}],[{"roster":"238a8f4e-881e-4e5a-98a9-6fd01f70d03e"}]],"timestamp":1462442575967,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"238a8f4e-881e-4e5a-98a9-6fd01f70d03e":0,"a81e5111-764c-40ea-8120-e690ba6289a5":1}}}