{"teams":[{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]},{"id":76,"slug":"lgd-gaming","name":"LGD Gaming","guid":"be6df3df-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-5n0d69lg.png","acronym":"LGD","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-if86jc4q.png","createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:34:16.000Z","bios":{"en_US":"","fr_FR":"Pendant des années, LGD est restée coincée au milieu du classement des LPL. En dépit de quelques succès dans des tournois mineurs, ces joueurs n'ont pas menacé la domination d'EDG et de SHRC dans l'e-sport chinois. Puis LGD a décidé que ça suffisait comme ça. Elle a reconstruit l'équipe avec des joueurs coréens aguerris (imp, Flame et Acorn) à la fin de 2014. Les résultats parlent d'eux-mêmes : 1re place lors des play-offs d'été au LPL 2015.","pl_PL":"Od lat LGD znajduje się pośrodku tabeli LPL. Pomimo sukcesów w mniejszych turniejach nawet nie zbliżyło się do sukcesów EDG i SHRC w chińskim E-sporcie. I wtedy właśnie LGD stwierdziło, że starczy tego dobrego. Do swojego składu wcielili niezwykle utalentowanych Koreańczyków – impa, Flame'a i Acorna – pod koniec 2014 roku. Wyniki mówią same za siebie – 1. miejsce w letnich playoffach LPL 2015.","de_DE":"Seit Jahren steckte LGD in der Mitte der LPL-Tabelle fest. Trotz einigen Erfolgen bei kleineren Turnieren, schafften sie es nicht, die Dominanz von EDG oder SHRC zu beenden. Doch damit sollte nun ein für alle Mal Schluss sein. Sie verbesserten ihr Team mit den bekannten koreanischen Talenten imp, Flame und Acorn im Sommer 2014. Die Ergebnisse sprechen für sich - erster Platz der LPL Sommersaison in diesem Jahr.","es_ES":"LGD se pasó varios años estancado en centro de la tabla de la LPL. A pesar de obtener algunos éxitos en torneos menores, apenas alcanzó a mellar el férreo dominio que ejercían EDG o SHRC sobre los deportes electrónicos en China. Hasta que decidieron que ya estaba bien. A finales de 2014 reconstruyeron la plantilla con talentos coreanos de primera categoría, como Imp, Flame o Acorn. Los resultados hablan por sí mismos: Primer puesto de las eliminatorias de verano de la LPL 2015.","pt_BR":"A LGD passou anos vivendo na parte do meio da tabela LPL. Apesar de vitórias em alguns torneios menores, eles estavam longe de ameaçar a EDG ou a Royal Club no cenário chinês. Mas então eles deram um basta. Reconstruíram o time no final de 2014 com grandes astros coreanos: imp, Flame e Acorn. Os resultados falam por sisó -- campeões das eliminatórias de verão da LPL 2015.\n"},"foreignIds":{"drupalId":"1850"},"players":[56,67,541,589,605,998,1431],"starters":[67,541,589,605,998],"subs":[56,1431]}],"players":[{"id":56,"slug":"cool","name":"Cool","firstName":"Jia-Jun","lastName":"Yu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/cool-esrj8abc.png","hometown":"Yiyang, China","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:14.000Z","updatedAt":"2017-06-06T23:29:21.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"698","TRLH1":"1000185041","TRLH3":"1000105048"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":67,"slug":"imp","name":"imp","firstName":"Seung-bin","lastName":"Gu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/imp-5lcuchzd.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:27.000Z","updatedAt":"2016-02-01T22:57:45.000Z","bios":{"en_US":"<p>Seung-bin “imp” Gu is notorious for his former rivalry with Gwang-jin “Piglet” Chae and his unabashed trash talk. But imp is more than just talk, and his recent results speak for themselves. Imp started his career on Samsung White (formerly MVP Ozone), a team that would eventually be one of the greatest of all time. Imp played a key role in their dominant performance -- and 1st place finish -- at the 2014 World Championship.</p>\n\n<p>In the wake of his move to LGD, imp matured. When naysayers said he would fail without his world-class support partner Mata, he proved them wrong. When his interviewers expected trash talk and arrogance, imp displayed humility and courteous manners. But there’s still a monster hiding beneath imp’s newfound modesty. The fact is, imp is very good at League of Legends, and he knows it.</p>","fr_FR":"<p>Seung-bin « imp » Gu est célèbre pour son ancienne rivalité avec Gwang-jin « Piglet » Chae et pour sa gouaille insolente. Mais imp n'est pas celui qui parle le plus : ses récents résultats sont plus éloquents encore que lui. Imp a commencé sa carrière chez Samsung White (anciennement MVP Ozone), une équipe qui allait compter parmi les meilleures de tous les temps. Imp a joué un rôle clé dans ses performances spectaculaires (et sa première place) aux Championnats du monde 2014.</p>\n\n<p>À la suite de son arrivée chez LGD, imp est devenu plus mûr. Quand les mauvaises langues ont prédit qu'il allait forcément échouer sans l'aide de son exceptionnel support, Mata, il leur a prouvé le contraire. Alors que ses interlocuteurs s'attendaient à le voir arrogant et désagréable, imp s'est montré humble et courtois. Mais cela ne veut pas dire qu'il n'y a pas un monstre qui dort derrière la nouvelle modestie dont fait preuve imp. De fait, imp est un excellent joueur de League of Legends et il le sait. Après tout, il est le premier des cinq anciens membres de Samsung White à s'être assuré une place aux Championnats du monde 2015. </p>","pl_PL":"<p>Seung-bin „imp” Gu okrył się złą sławą przez swą niegdysiejszą rywalizację z Gwang-jinem „Pigletem” Chae, a także bezwstydną krytykę innych zawodników. Imp nie jest jednak mocny wyłącznie w gębie, a jego niedawne rezultaty mówią same za siebie. Imp rozpoczął karierę jako zawodnik Samsung White (dawniej MVP Ozone) – drużyna ta przeszła do historii jako jedna z najlepszych. Rola impa w zajęciu przez drużynę pierwszego miejsca podczas mistrzostw świata 2014 była kluczowa.</p>\n\n<p>Po dołączeniu do LGD imp bardzo dojrzał jako gracz. Udowodnił malkontentom mówiącym, że nie poradzi sobie bez światowej klasy zawodnika wsparcia, Maty, jak bardzo się mylą. Ilekroć prowadzący wywiad oczekiwali przechwałek i arogancji, imp wykazywał się grzecznością i pokorą. Pod przykrywką skromności wciąż jednak drzemie w nim bestia. Prawda jest taka, że imp jest świetnym graczem w League of Legends i doskonale zdaje sobie z tego sprawę. Bądź co bądź jako pierwszy spośród pięciu zawodników Samsung White zdołał zająć pierwsze miejsce w mistrzostwach świata 2015. </p>","de_DE":"<p>Seung-bin “imp” Gu ist berühmt berüchtigt wegen seiner früheren Rivalität mit Gwang-jin “Piglet” Chae und ihren unerreichten Provokationen. Aber imp ist mittlerweile mehr als nur heiße Luft, was seine letzten Erfolge unter Beweis stellen. Imp begann seine Karriere bei Samsung White (früher MVP Ozone), einem Team das eventuell eines der besten der Welt für alle Zeit werden kann. Imp spielte eine Schlüsselrolle bei ihren dominanten Auftritten- und beendete die Weltmeisterschaft mit dem Titel. </p>\n\n<p>Durch seinen Wechsel zu LGD reifte imp. Die Pessimisten, die Imp´s Zukunft ohne seinen früheren Supporter Mata zum Scheitern verurteilten, überzeugte er deutlich. Wenn Reporter auf Provokation und Arroganz warteten, zeigte er Menschlichkeit und gutes Benehmen. Aber hinter seinem neugefundenen Anstand ist immer noch der frühere imp versteckt. Denn imp ist verdammt gut in League of Legends und genau das weiß er auch. Nach all dem war er der Erste von seinen früheren Mitspielern von Samsung White, der sich seinen Platz bei Worlds 2015 sicherte. </p>\n","es_ES":"Seung-bin ''Imp'' Gu es famoso tanto por su feroz rivalidad con Gwang-jin ''Piglet'' Chae como por una extraordinaria capacidad de meter la pata al hablar. Pero al margen de comentarios desafortunados, sus actuaciones de los últimos tiempos son aún más elocuentes. Comenzó su carrera en Samsung White (el antiguo MVP Ozone), un equipo que terminaría por convertirse en el mejor de la historia. De hecho, Imp desempeñó un papel fundamental en la exhibición realizada en el Campeonato Mundial de 2014 (y en la victoria que le puso la guinda).\n\nTras su paso a LGD, Imp ha madurado. Cuando algunos agoreros aseguraron que se vendría abajo sin su compañero, el fabuloso apoyo Mata, Imp demostró que se equivocaban. Y cuando toda la prensa esperaba que exhibiera su habitual arrogancia, respondió con una humildad y una educación impropias de él. Pero debajo de esta nueva prudencia se esconde todavía una bestia. El hecho es que Imp es un grandísimo jugador de League of Legends y lo sabe. A fin de cuentas, ha sido el primero de los cinco antiguos integrantes de Samsung White en asegurarse una plaza en el Campeonato Mundial de 2015. \n","pt_BR":"<p>Seung-bin “imp” Gu é famoso por sua antiga rivalidade com Gwang-jin “Piglet” Chae e todas as provovações que a seguiram. Mas imp é mais do que apenas conversa fiada, e seu histórico recente prova isso. Ele começou sua carreira na Samsung White (antes conhecida como MVP Ozone), uma equipe que eventualmente entraria na história como uma das melhores de todos os tempos. Imp foi uma peça chave na atuação dominante - e o primeiro lugar - no Campeonato Mundial de 2014.</p>\n\n<p>Entre todas as conversas durante sua mudança para a LGD, Imp amadureceu. Quando críticos disseram que sem Mata como suporte ele iria falhar, ele provou o contrário. Quando seus entrevistadores esperavam arrogância e provocações, Imp foi cordial e humilde. Mas ainda há um monstro por trás de sua nova modéstia. O fato é: Imp é muito bom em League of Legends. E ele sabe. Afinal, ele foi o primeiro dos cinco ex-integrantes da Samsung White a assegurar sua vaga no Campeonato Mundial 2015.</p>"},"foreignIds":{"drupalId":"681","TRLH3":"1001160026","TRLH1":"1001180006","TRLH4":"1001160026","TRLH2":"1001140006"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":541,"slug":"eimy","name":"Eimy","firstName":"Dan","lastName":"Xie","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/eimy-fmyi9due.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:36:23.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4513"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":589,"slug":"pyl","name":"Pyl","firstName":"Bo","lastName":"Chen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pyl-ahtd159j.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:30:25.000Z","bios":{"en_US":"<p>\nBo “Pyl” Chen is one of the best supports in the LPL, with much of his strength coming from the diverse champion pool he brings to the bot lane and his dynamic shot-calling. He’s no slouch on his mechanics either; His Thresh is a must-ban, his Alistar tramples the competition, and his Janna always finds the right position to blow away the opposition. But as the captain of LGD, his ability to call out rotations and map objective prioritization truly set him apart. Pyl is the glue that holds LGD together.\n</p>","fr_FR":"<p>\nChen « Pyl » Bo est l'un des meilleurs supports des LPL, et l'une de ses principales forces, c'est la variété de champions qu'il peut faire intervenir sur la voie du bas et sa capacité à donner des ordres en s'adaptant à la situation. Il est également loin d'être manchot en ce qui concerne les compétences techniques : son Thresh est à bannir absolument, son Alistar écrabouille l'adversaire et sa Janna est toujours au bon endroit au bon moment pour souffler l'ennemi. Mais en tant que capitaine de LGD, c'est surtout sa capacité à donner des ordres et à définir les priorités pour les objectifs de la carte qui font la différence. Pyl est le ciment qui fait tenir LGD ensemble. Il devrait continuer dans cette optique lorsqu'il accueillera ses amis des LPL à l'événement All-Star 2015 avec son fameux sourire.\n</p>","pl_PL":"<p>\nChen „Pyl“ Bo gehört zu den besten Supportern in der LPL, und ein großer Teil seiner Stärke beruht auf seinem breitgefächerten Championpool, den er in die untere Lane mitbringt, und auf seinem dynamischen Shot-Calling. Doch auch seine Mechaniken können sich sehen lassen. Seinen Thresh zu bannen ist Pflicht, sein Alistar zertrampelt seine Rivalen und seine Janna findet immer die richtige Position, um den Gegner auszuschalten. Was ihn jedoch als Teamleiter wirklich ausmacht, ist seine Fähigkeit, Wechsel anzuordnen und bei den Kartenzielen Prioritäten zu setzen. Pyl ist der Leim, der LGD zusammenhält. Dies werden wir auch beim All-Star-Event 2015 erleben, wenn er die anderen Stars der LPL mit seinem berühmten Lächeln begrüßt.\n</p>","de_DE":"<p>Chen “Pyl” Bo ist einer der besten Supporter in der LPL, was vor allem von seinem großen Championpool für die Bot-Lane und seinem dynamischen Shotcalling herrührt. Aber auch seine Mechaniken sind nicht die schlechtesten; sein Thresh ist ein Must-Ban, sein Alistar trampelt die Spiele nieder und seine Janna findet immer die richtige Position, um die Gegner wegzuwehen. Zudem hebt ihn seine Fähigkeit als Kapitän das Team über die Karte zu navigieren und sein Fokus auf Objekte hervor. Pyl ist der Kleber, der LGD zusammenhält. </p>\n\n<p>Tatsächlich sind seine Fähigkeiten so begehrt, dass sich selbst Seung-bin “imp” Gu für LGD entschieden hat, nur um mit Pyl zusammenspielen zu können. Während er vorher seine Bot-Lane-Partner übertroffen hat, fand er mit Imp einen Partner, der jeden seiner Züge mitgehen kann. </p>\n","es_ES":"<p>\nChen ''Pyl'' Bo es uno de los mejores apoyos de la LPL, gracias a la diversidad del arsenal de campeones que puede usar en la calle inferior y a su dinamismo a la hora de marcar jugadas. Y por mecánicas tampoco es manco: Aunque los rivales bloqueen a su Thresh (como suelen hacer), es perfectamente capaz de pisotearlos con Alistar y siempre encuentra el modo de hacerlos volar por los aires con Janna. Como capitán de LGD, su habilidad para organizar las rotaciones y priorizar los objetivos lo convierte en único. Pyl es el pegamento que mantiene unido a LGD. Y seguirá siéndolo en el All-Star 2015, cuando luzca su ya famosa sonrisa para dar la bienvenida a otras estrellas de la LPL.\n</p>","pt_BR":"<p>Chen “Pyl” Bo é um dos melhores suportes na LPL, com muito de sua força vindo de um vasto leque de Campeões aliado à sua dinâmica de chamadas de equipe. Ele não é fraco em mecânicas também; seu Thresh é um banimento quase permanente, seu Alistar atropela as rotas, e sua Janna sempre sabe o lado certo para jogar os furacões. Mas como capitão da LGD, sua habilidade de chamar rotações, posicionar a equipe para objetivos e pressão pelo mapa é o que o diferencia. Pyl é a cola que segura a LGD junta.</p>\n\n<p>De fato, as habilidades de Pyl são tão aclamadas que Seung-bin “imp” Gu escolheu propositalmente a LGD somente para jogar com o suporte. Se antes ele brilhava mais do que seus parceiros de rota, quando Imp entrou na equipe, Pyl encontrou um companheiro de equipe que pudesse ser o seu par perfeito.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Chen “Pyl” Bo 선수는 LPL 최고의 서포터로 꼽힙니다. 넓은 챔피언 폭과 적극적인 지휘에서 그 저력이 나오는 선수입니다. 게다가 피지컬까지 뛰어납니다. 항상 쓰레쉬를 밴당하고 알리스타를 플레이할 땐 상대를 짓뭉개버리죠. 잔나를 잡으면 항상 정확한 위치 선정으로 상대를 날려버립니다. 그리고 LGD의 주장으로서 맵 상의 주요 목표물을 노릴 시기나 어떤 목표물을 먼저 노릴지 정하는 능력이 아주 뛰어납니다. Pyl 선수는 LGD를 하나로 묶는 구심점이기도 합니다. 이번 올스타 대회에서 다른 LPL 올스타를 만났을 때도 특유의 미소로 반기며 팀을 끈끈하게 만들어 주리라 기대해 봅니다. </p>"},"foreignIds":{"drupalId":"2069","TRLH3":"1001160027","TRLH4":"1001160027","TRLH1":"1001180005","TRLH2":"1001140005"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":605,"slug":"godv","name":"GodV","firstName":"Zhen","lastName":"Wei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/godv-awtbwftn.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:35:21.000Z","bios":{"en_US":"","fr_FR":"<p>Wei « We1less » Zhen, précédemment connu sous le nom de GODV, a placé la barre très haut lorsqu'il a choisi son premier surnom. Mais, sachant que We1less est devenu l'un des mid laners les plus réputés des LPL, il savait peut-être exactement ce qu'il faisait. Sa carrière n'a pas été de tout repos, mais on dirait que We1less est enfin sur le point d'arriver à ses fins.</p>\n\n<p>À l'origine, We1less était meneur de jeu chez Vici Gaming. Il jouait de façon égoïste et, s'il voyait une opportunité de plonger dans le combat, il n'hésitait pas une seule seconde. Évidemment, cette stratégie ne portait pas forcément ses fruits, que ce soit pour lui ou pour son équipe. Cependant, avec le temps, We1less est devenu plus réfléchi et a développé son esprit d'équipe. C'est un joueur dynamique qui réfléchit toujours à ce qu'il pourrait apporter à son équipe plutôt que le contraire.</p>\n\n<p>Même si We1less a eu du mal à rejoindre la Faille en 2016 à cause d'une blessure persistante, il a pu prouver son énorme potentiel de jeu à la toute fin du segment d'été. Enregistrant des scores hallucinants, We1less nous a montré à quel point son niveau était élevé. Ses éclairs de génie ont ébloui les fans, qui l'ont choisi pour participer à l'événement All-Stars 2016 de Barcelone. Il déborde de talent et, à en croire ses dernières performances, ses sorts risquent d'être précoces et nombreux. </p>","pl_PL":"Wei „We1less” Zhen, dawniej znany jako GODV, całkiem wysoko ustawił sobie poprzeczkę, wybierając swoje stare przezwisko. Jednak biorąc pod uwagę, że We1less został okrzyknięty jednym z najlepszych środkowych w LPL, może dokładnie wiedział, co robi. Jego podróż była trudna, ale wydaje się, że We1less nareszcie dociera do celu.</p>\n\nDawno, dawno temu We1less był rozgrywającym w Vici Gaming. Grał egoistycznie i gdy tylko dostrzegał okazję do ataku, zazwyczaj z niej korzystał. Oczywiście taka strategia nie zawsze kończyła się dobrze dla niego lub jego drużyny. Teraz jednak We1less jest rozważniejszy i bardziej zorientowany na drużynę. To dynamiczny zawodnik, który zawsze myśli o tym, jak może zapewnić korzyści swojej drużynie (a nie odwrotnie).</p>\n\nChociaż We1less miał problemy z grą na Summoner’s Rift w 2016 roku z powodu uporczywej kontuzji, pod sam koniec letniego splitu zaprezentował swój pełny potencjał jako zawodnik. Zdobywając naprawdę niesamowite wyniki punktowe, We1less pokazał nam, że ustawił sobie poprzeczkę naprawdę wysoko. Jego przebłyski geniuszu oszołomiły fanów, którzy zagłosowali na niego i wysłali na wydarzenie All-Star 2016 w Barcelonie. Ma ogromy potencjał i jeśli można robić założenia w oparciu o jego wcześniejsze występy, to czary We1lessa na turnieju będą latały szybko i często. \n","de_DE":"<p>Wei „We1less“ Zhen, ehemals bekannt als GODV, legte die Latte für sich selbst ziemlich hoch, als er sich für seinen alten Namen entschied. Aber wenn man bedenkt, dass We1less zu einem der am meisten gelobten Mid-Laner der LPL wurde, dann könnte man meinen, er wusste damals ganz genau, was er tat. Sein Weg war steinig, aber es scheint, als wäre We1less endlich angekommen.</p>\n\n<p>Vor langer Zeit war We1less der Spielmacher von Vici Gaming. Er war ein egoistischer Spieler, der so gut wie jede Gelegenheit nutzt, einen Gegner bis zum Schluss zu verfolgen. Natürlich endete diese Strategie nicht immer gut für ihn oder seine Mannschaft. Heute spielt We1less jedoch wesentlich berechnender und teamorientierter. Er ist ein dynamischer Spieler, der immer darüber nachdenkt, wie er seiner Mannschaft helfen kann.</p>\n\n<p>Und obwohl We1less 2016 mit einer hartnäckigen Verletzung zu kämpfen hatte, war sein Potenzial gegen Ende des Sommer-Splits klar zu erkennen. We1less lieferte ein paar unglaubliche Ergebnisse ab und zeigte uns, wie gut er wirklich sein kann. Er ließ immer wieder seine Klasse aufblitzen und begeisterte damit die Fans, die ihn beim All-Stars-Event 2016 in Barcelona sehen wollen. Er steckt voller Potenzial, und wenn man an seine vergangenen Leistungen denkt, ist davon auszugehen, dass er schnell mit viel Zaubern um sich schleudern wird.</p>","es_ES":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores de la calle central más codiciados de la LPL, puede que supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del split de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes.</p>","pt_BR":"<p>Wei “We1less” Zhen, antes conhecido como GODV, subiu bastante o patamar quando escolheu seu antigo apelido. Porém, considerando que We1less se tornou um dos jogadores de meio mais prolíficos da LPL, é provável que ele soubesse direitinho o que estava fazendo. Sua jornada foi difícil, mas parece que We1less finalmente está para chegar.\n\nUm dia, We1less foi um criador de jogadas na Vici Gaming. Ele jogava de forma egoísta e, se tivesse a oportunidade de mergulhar, ele normalmente o fazia. Obviamente, essa estratégia nem sempre dava certo, tanto para ele, quanto para sua equipe. Agora, We1less é mais calculado e pensa mais na equipe. Ele é um jogador dinâmico, sempre pensando em como ele pode beneficiar sua equipe, em vez do contrário.</p>\n\n<p>Apesar de We1less ter tido problemas entrando em Summoner’s Rift em 2016 com uma lesão, seu grande potencial de jogo estava à mostra no fim da Etapa de Verão. Ostentando alguns placares ridiculamente bons, We1less nos mostrou quão alto pode chegar. Seu desempenho incrível deixou uma boa impressão nos fãs que deixaram claro que o queriam no Evento All-Star 2016 em Barcelona. Ele está repleto de potencial para grandes jogadas e, se seus desempenhos anteriores são qualquer indicador, vai ter muito feitiço voando pelo mapa. </p>","cs_CZ":"<p>Wei „We1less“ Zhen, dříve známý jako GODV, si při výběru své předchozí přezdívky nasadil laťku pěkně vysoko. Ale jelikož se z něj stal jeden z nejsledovanějších středových lajnařů v LPL, možná věděl, co dělá. Jeho cesta na výsluní byla trnitá, ovšem zdá se, že konečně nese svoje ovoce.</p>\n\n<p>We1less býval kapitánem Vici Gaming. Hrával sobecky, a když se mu naskytla příležitost vrhnout se po hlavě do boje, jen málokdy jí odolal. Tato strategie samozřejmě pro něj i jeho tým nekončila pokaždé dobře. Nyní je We1less prozíravější a víc myslí na své spolubojovníky. Hraje dynamicky a neustále přemýšlí, čím by mohl svému týmu prospět on, ne naopak.</p>\n\n<p>A ačkoliv se kvůli nepříjemnému zranění podíval We1less do Žlebu v roce 2016 jen málokdy, na konci letního splitu bylo jeho řádění na bojišti hodně znát. Jeho statistiky poskočily do závratných výšin a ukázal nám, co můžeme očekávat od skutečně hvězdného hráče. Fanoušky tyto záblesky dokonalosti náležitě okouzlily, takže jej v hlasování vyslali na turnaj All-Star 2016. Dokáže provádět naprosto úchvatné akce a z jeho předchozích výkonů lze soudit, že i v Barceloně budou kouzla létat často a již krátce po zahájení utkání. </p>","el_GR":"<p>Ο Wei “We1less” Zhen, γνωστός στο παρελθόν ως GODV, ανέβασε μόνος του ψηλά τον πήχη με το όνομα που διάλεξε τότε. Από την άλλη πλευρά, ο We1less έχει γίνει ένας από τους πιο διάσημους παίκτες μεσαίας λωρίδας στο LPL, επομένως ίσως και να μην το έκανε κατά τύχη. Η διαδρομή του ήταν πολύ δύσκολη, αλλά όλα δείχνουν ότι ο We1less κοντεύει να φτάσει στον προορισμό του.</p>\n\n<p>Μια φορά κι έναν καιρό, ο We1less ήταν ο οργανωτής των Vici Gaming. Έπαιζε με πολύ εγωιστικό τρόπο και, όταν έβλεπε μια ευκαιρία να χωθεί στη δράση, ποτέ δεν την άφηνε να πάει χαμένη. Προφανώς, αυτή η στρατηγική δεν είχε πάντα καλή κατάληξη για αυτόν και για την ομάδα του. Τώρα, όμως, ο We1less παίζει πολύ πιο ομαδικά και στρατηγικά. Είναι ένας ευέλικτος παίκτης που σκέφτεται πάντα πώς μπορεί να βοηθήσει την ομάδα του και όχι πώς μπορεί να βοηθήσει αυτόν η ομάδα.</p>\n\n<p>Παρόλο που ο We1less δυσκολεύτηκε αρκετά να βρει το ρυθμό του στο 2016 λόγω ενός πολύ επίμονου τραυματισμού, έδειξε πολύ καλά τι μπορεί να κάνει στο τέλος του Summer Split. Σε μια σειρά αγώνων όπου πέτυχε εξωπραγματικές επιδόσεις, ο We1less έδειξε σε όλους πόσο ψηλά μπορεί να φτάσει. Αυτές οι θεαματικές του εκλάμψεις γοήτευσαν το κοινό που τον έστειλε στο Τουρνουά All-Star 2016. Είναι πάντα έτοιμος για μια μεγάλη κίνηση και, αν κρίνουμε από τις προηγούμενες εμφανίσεις του, θα δούμε πολλά ξόρκια στο παιχνίδι, συχνά και από νωρίς. </p>","hu_HU":"<p>Wei „We1less” Zhen, korábbi nevén GODV, elég magasra tette a lécet a korábbi neve megválasztásával. De mivel We1less lett az LPL egyik legfelkapottabb középső ösvényese, valószínűleg már akkor is tudta, hogy mi a dörgés. Nem volt egyszerű az út, de úgy tűnik, hogy We1less révbe érhet.</p>\n\n<p>We1less régebben a Vici Gaming irányítója volt. Önzően játszott, és ha meglátott egy lehetőséget, azonnal lecsapott rá. Ez a „stratégia” nyilván nem mindig volt előnyös a csapata számára. Mára We1less sokkal számítóbb és csapatközpontúbb lett. Dinamikus játékos, aki mindig azt nézi, hogyan segítheti a csapatát, és nem fordítva.</p>\n\nWe1less nehezen tudott belevágni a 2016-os évbe egy zavaró sérülés miatt, de a nyári szakasz végén ismét megcsillogtatta játéktudását. We1less elképesztő statisztikákat produkált, jelezve, hogy a határ számára a csillagos ég. Ezek a felvillanások is meggyőzték a rajongókat, hogy ott a helye a 2016-os All-Star gálán Barcelonában. Mindig ott van benne egy látványos akció esélye, és ha a korábbiak alapján kellene tippelni, akkor hamar el fog szabadulni a pokol a Szurdokban. \n","it_IT":"<p>Wei \"We1less\" Zhen, già noto come GODZ, ha scelto per se stesso un nome pieno di aspettative. E a quanto pare sapeva cosa stava facendo, visto che è riuscito a diventare uno dei centrali più apprezzati della LPL. Il suo viaggio non è stato dei più semplici, ma a quanto pare sta per arrivare alla sua meta.</p>\n\nIn passato We1less ha fatto il regista in Vici Gaming. Il suo stile era molto egoistico e sfruttava ogni occasione per tuffarsi all'attacco. Ovviamente, quella strategia non funzionava sempre. Ora però We1less è diventato più riflessivo e aperto al gioco di squadra. È un giocatore dinamico, sempre intento a pensare a come aiutare il proprio team, invece che usare il supporto della squadra a suo beneficio.</p>\n\nPur avendo avuto difficoltà ad affacciarsi sulla Landa nel 2016 a causa di un infortunio, il suo grande potenziale è stato sotto gli occhi di tutti verso la fine del Summer Split. Con le sue cifre da capogiro, We1less ci ha dimostrato di non avere limiti. Le sue brillanti giocate hanno abbagliato i fan, che hanno votato per la sua presenza all'All-Star 2016 di Barcellona. We1less ha un potenziale incredibile, e a giudicare dalle sue prestazioni passate vedremo qualcosa di straordinario. \n","ro_RO":"Wei ''We1less'' Zhen, cunoscut în trecut ca GODV, și-a stabilit un standard destul de înalt când și-a ales vechiul nume. Dar, având în vedere că a devenit unul dintre cei mai titrați jucători de pe culoarul din mijloc din LPL, poate că era conștient de ceea ce face. Drumul său a fost unul cu suișuri și coborâșuri, dar se pare că We1less e în sfârșit aproape de destinație.</p>\n\nDemult, We1less era playmaker la Vici Gaming. Era un jucător egoist; dacă vedea o oportunitate de a se arunca în luptă, de obicei profita de ea. Evident, acea strategie n-a fost întotdeauna strălucită, nici pentru el și nici pentru Vici. Acum, însă, We1less este mai calculat și mai atent la interesele echipei. E un jucător dinamic, care se gândește mereu cum își poate ajuta coechipierii, în loc să se gândească cum îl pot ajuta ei pe el.</p>\n\nChiar dacă We1less nu a putut intra în Rift în 2016 din cauza unei accidentări, potențialul său de a crea situații favorabile a ajuns în lumina reflectoarelor spre finalul etapei de vară. Reușind niște scoruri incredibile, We1less ne-a arătat cât de bun este cu adevărat. Reușitele sale impresionante i-au uimit pe fani, care l-au votat la All-Star Event 2016 din Barcelona. Are un potențial uriaș de a crea faze spectaculoase și, dacă e să ne luăm după reușitele sale din trecut, va lansa vrăji des, încă de la început. \n","es_AR":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>","es_MX":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>"},"foreignIds":{"drupalId":"4529","TRLH3":"1001360058","TRLH4":"1001310058"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":998,"slug":"jinoo","name":"Jinoo","firstName":"Jin-woo","lastName":"Lim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jinoo-53memnp9.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:32:05.000Z","updatedAt":"2016-02-01T22:57:58.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1431,"slug":"intruder","name":"Intruder","firstName":"Sheng","lastName":"Tang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/intruder-3ffozme5.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:35:52.000Z","updatedAt":"2016-08-24T21:36:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41}],"scheduleItems":[{"id":"AVmFdoI4QMQFcjhwbQrx","content":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:match:57ae9a7d-7878-4b08-a05e-5636bee9e96b","scheduledTime":"2017-03-03T09:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696","blockLabel":"4","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:bracket:8aad9de4-4ef3-43e3-8562-55d87ce468e8"},"match":"57ae9a7d-7878-4b08-a05e-5636bee9e96b","tournament":"5ca2f3d5-3682-4635-bac2-87f5a7f41696","bracket":"8aad9de4-4ef3-43e3-8562-55d87ce468e8","league":"7"}],"gameIdMappings":[],"videos":[{"id":5840,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:4ebc0141-f42c-4047-a796-57365f512021","source":"https://www.youtube.com/embed/2qkBVYqbQFk?wmode=transparent&start=4204","createdAt":"2017-03-03T22:57:59.000Z","updatedAt":"2017-03-03T22:57:59.000Z","game":"4ebc0141-f42c-4047-a796-57365f512021"},{"id":5841,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:357ab223-e094-4ce1-960c-bd4d3ad753e6","source":"https://www.youtube.com/embed/2qkBVYqbQFk?wmode=transparent&start=7314","createdAt":"2017-03-03T22:59:04.000Z","updatedAt":"2017-03-03T22:59:04.000Z","game":"357ab223-e094-4ce1-960c-bd4d3ad753e6"},{"id":5842,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:58e1ab4e-5872-42ea-bb75-8bd48d354dca","source":"https://www.youtube.com/embed/2qkBVYqbQFk?wmode=transparent&start=10096","createdAt":"2017-03-03T23:05:12.000Z","updatedAt":"2017-03-03T23:05:12.000Z","game":"58e1ab4e-5872-42ea-bb75-8bd48d354dca"}],"htmlBlocks":[],"match":{"id":"57ae9a7d-7878-4b08-a05e-5636bee9e96b","name":"LGD-vs-EDG","position":9,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"games":{"58e1ab4e-5872-42ea-bb75-8bd48d354dca":{"id":"58e1ab4e-5872-42ea-bb75-8bd48d354dca","name":"G3","generatedName":"EDG|LGD|G3|57ae9a7d78784b08a05","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"standings":{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488582121056,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488576086270,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"357ab223-e094-4ce1-960c-bd4d3ad753e6":{"id":"357ab223-e094-4ce1-960c-bd4d3ad753e6","name":"G2","generatedName":"EDG|LGD|G2|57ae9a7d78784b08a05","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"standings":{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488582070076,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488576085299,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4ebc0141-f42c-4047-a796-57365f512021":{"id":"4ebc0141-f42c-4047-a796-57365f512021","name":"G1","generatedName":"EDG|LGD|G1|57ae9a7d78784b08a05","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"},{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],"standings":{"result":[[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1488582004674,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}],[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}]],"timestamp":1488576082792,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488582121062,"source":"bestOf","history":[{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488582070076,"source":"bestOf","closed":true},{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488582004675,"source":"bestOf","closed":true},{"result":[[{"roster":"7701ae49-64b4-4856-8bdb-3beed85331c2"}],[{"roster":"684c45e4-5825-4dc1-8f2c-9c19327aff64"}]],"timestamp":1488576086270,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"684c45e4-5825-4dc1-8f2c-9c19327aff64":0,"7701ae49-64b4-4856-8bdb-3beed85331c2":1}}}