{"teams":[{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]},{"id":165,"slug":"vitality","name":"Team Vitality","guid":"be6fe2a1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vitality-2eb9w6iv.png","acronym":"VIT","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:57:43.000Z","updatedAt":"2017-06-30T14:09:41.000Z","bios":{"de_DE":"<p>Für Team Vitality geht es 2017 vor allem um Beständigkeit. Die Mannschaft beendete den Sommer-Split der EU LCS 2016 mit neun Unentschieden, dem Höchstwert der Liga. Sie landeten auf dem siebten Platz, wodurch sie zwar dem Frühjahrs-Aufstiegsturnier entgingen, aber nicht in die Entscheidungsspiele einziehen konnten.\n\nVitality hat sich für das neue Jahr Verstärkung auf der unteren Lane geholt. Mit Steeelback und Hachani und einem neuen Liga-Format, durch das es keine Unentschieden mehr gibt, ist Vitality in dieser Saison dafür prädestiniert, mehr Siege einzufahren.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Mannschaftsleiter: Michael \"Garki\" Bolze</p>","pl_PL":"<p>Vitality to francuska organizacja znana do tej pory głównie na scenie gier FPS, która postanowiła jednak zainwestować także w dywizję League of Legends. 9 grudnia 2015 roku ogłosiła ona odkupienie miejsca od zasłużonego Gambit Gaming. Niemal od razu do organizacji dołączył Raymond „KaSing” Tsang, który ostatecznie nie doszedł do porozumienia z Team SoloMid. To właśnie wokół angielskiego wspierającego został zbudowany zespół i 14 grudnia 2015 roku formacja ogłosiła tożsamość pozostałych zawodników. Miejsce na górnej alei zajął uznawany za jednego z najlepszych, o ile nie najlepszego, górnych w Europie – Francuz Lucas „Cabochard” Simon-Meslet. Środkową linię wypełnił Erlend „Nukeduck” Holm, który opuścił Team ROCCAT. Nowym dżunglerem został znany z występów w Copenhagen Wolves i Elements Ilyas „Shook” Hartsema. Tymczasem partnerem KaSinga na dolnej alei został Petter „Hjärnan” Freyschuss, z którym Anglik występował już w H2k. Trenerem zespołu ogłoszono znanego ze współpracy z Gambitem w letnim splicie 2014 byłego dżunglera, Kévina „Shaunza” Ghanbarzadeha. Drużynie udało się zbudować mocny skład i cel formacji na wiosnę 2016 to z pewnością walka o najwyższe cele.</p>\n<p>W wiosennym splicie EU LCS 2016 drużyna Team Vitality zadziwiła wszystkich fanów. Przygotowanie graczy do rozgrywek było godne podziwu, patrząc na wiek organizacji. Ten świeży zespół rozpoczął ten okres od zajęcia czwartego miejsca w pierwszym tygodniu i do samego końca nie spadł niżej. Jego wyniki były o tyle imponujące, że udało mu się czterokrotnie skończyć tydzień, wygrywając oba mecze. Natomiast ani razu drużyna Team Vitality nie przegrała obydwóch spotkań, dzięki czemu skończyła wiosenny split EU LCS 2016 na podium. Zajęcie zaszczytnego trzeciego miejsca było efektem 13 zwycięstw i zaledwie 5 porażek. Jednak to nie koniec laurów zebranych przez zespół. Zawodnicy Team Vitality otrzymali nagrodę najbardziej wartościowych graczy w piątym i szóstym tygodniu. Ponadto górny i wspierający zostali wyróżnieni w zestawieniu najbardziej profesjonalnych graczy. Powyższe osiągnięcia najlepiej oddaje współczynnik ZZA członków Team Vitality – wszyscy znaleźli się w pierwszej czwórce graczy w kategorii swojej własnej roli.</p>\n<p>Po tak udanych występach fani spodziewali się fantastycznego występu na wiosennych rozgrywkach barażowych EU LCS 2016. Jednak zespół Team Vitality poległ już w pierwszym spotkaniu, ulegając najstarszemu w lidze – Fnatic. Przegrana była o tyle bolesna, że pomimo wcześniejszych wysiłków organizacja znalazła się na piątym miejscu ex aequo. W przerwie przed rozpoczęciem letniego splitu EU LCS 2016 zostały podjęte decyzje o zmianie składu drużyny. Biorąc przykład z innych organizacji, Team Vitality zdecydowała się na podpisanie kontraktu z dwoma zawodnikami wywodzącymi się z Korei Południowej. Jednak w odróżnieniu od wielu innych, potrafili się sprawnie komunikować w języku angielskim, więc od razu przeszli do treningów, aby w nadchodzącym splicie osiągnąć jeszcze lepszy wynik.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Menedżer drużyny: Michael \"Garki\" Bolze</p>","en_US":"<p>For Team Vitality, consistency will be the name of the game in 2017. The team finished with 9 match ties in the 2016 EU LCS Summer Split, the most in the league. That landed them in 7th place for the split, allowing them to avoid the Spring Promotion Tournament but leaving them out of the playoffs.</p>\n\n<p>With a new year upon them, Vitality has upgraded their bot lane. With Steeelback and Hachani lining up down south, and with a new league format that eliminates ties, Vitality is primed to pick up some more W’s this season.</p>\n<p>Head Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Team Manager: Michael \"Garki\" Bolze</p>\n","es_ES":"<p>Ni llegaron a tiempo a la cita del 5 de noviembre ni hacen uso de la letra V como llamada a la venganza, sino a la victoria, pero si algo comparte Team Vitality con la novela gráfica de de Alan Moore y David Lloyd es la intención de hacer saltar algo por los aires. En este caso, la LCS EU.</p>\n\n<p>La organización francesa, conocida sobre todo por sus escuadras de Call of Duty, ha aprovechado la inadaptación de Gambit Gaming con respecto al desarrollo de la industria de los deportes electrónicos para expandir sus horizontes mediante la adquisición de su plaza en la máxima competición continental.</p>\n\n<p>La falta de experiencia en la Grieta del Invocador no ha supuesto un problema para Team Vitality a la hora de confeccionar su alineación explosiva, que mezcla veteranía y potencial. El buen hacer de los galos en otras disciplinas se ha traducido en una gran reputación que, junto a una fuerte inversión deportiva, ha actuado como aval en el proceso de seducción de algunos de los mejores talentos de Europa con el objetivo de dinamitar la clasificación.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Jefe de equipo: Michael \"Garki\" Bolze</p>","fr_FR":"<p>Vitality rejoint Splyce et G2 Esports dans le trio des nouvelles équipes participant aux LCS EU. Le cœur de la formation de Vitality semble être composé d'anciens talents d'H2K et de Gambit Gaming, avec notamment le top-laner Lucas « Cabochard » Simon-Meslet et le support Raymond « KaSing » Tsang. Vitality a également recueilli le coach de GMB, Kévin Ghanbarzadeh, dans l'espoir que son expérience aide à souder les membres de l'équipe. Si Vitality est nouvelle, ses joueurs ne le sont pas, eux, et ils savent exactement à quoi s'attendre durant le segment printanier des LCS EU 2016.</p> \n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Responsable d’équipe: Michael \"Garki\" Bolze</p>"},"foreignIds":{},"players":[84,190,205,328,384,1089,1704],"starters":[84,190,328,384,1089],"subs":[205,1704]}],"players":[{"id":84,"slug":"cabochard","name":"Cabochard","firstName":"Lucas ","lastName":"Simon-Meslet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cabochard-iak53xzd.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T10:49:06.000Z","bios":{"en_US":"<p>Lucas “Cabochard” Simon-Meslet is looking to get back into form for 2017. After an impressive performance in the 2016 EU LCS Spring Split, Cabochard regressed last summer. He still put up some nice games on Irelia and Fiora, but like the rest of Vitality he failed to find consistency.</p>\n\n<p>Entering 2017 armed with a new botlane, Cabochard will aim to make an impact and return to his Spring Split self. Not usually one to perform as well on tanks, if Cabochard is allowed to focus on dealing damage, he should have no problem dispensing with his opponents in the top lane.</p>","de_DE":"<p>Lucas „Cabochard“ Simon-Meslet wird 2017 versuchen, seine alte Form wiederzufinden. Nach einer beeindruckenden Vorstellung im Frühjahrs-Split der EU LCS 2016 ging es für Cabochard im letzten Sommer bergab. Er lieferte zwar mit Irelia und Fiora ein paar ansprechende Leistungen ab, aber ihm fehlte wie dem Rest von Vitality die Beständigkeit. \n\n2017 beginnt mit einem neuen Duo auf der unteren Lane und Cabochard wird versuchen, wieder zu seiner Form aus dem Frühjahrs-Split 2016 zurückzufinden. Cabochard liefert mit Tanks zwar nicht die besten Leistungen ab, aber wenn er sich auf Schaden verursachende Champions konzentrieren kann, wird er mit seinen Gegner auf der oberen Lane Schlitten fahren.</p>","fr_FR":"<p>Durant l'intersaison 2015, Lucas « Cabochard » Simon-Meslet a rejoint Team Vitality, une nouvelle organisation qui a acquis la place de Gambit aux LCS. Lorsqu'il était chez Gambit, Cabochard préférait grandement les champions AP, tels que Kennen et Morgana. Il a également joué avec quelques champions tanky, mais il revenait souvent à ses incroyables Fizz et Ryze. Bien que les performances de Cabochard aient diminué quelque peu vers la fin de la saison et aux play-offs, son potentiel restait suffisant pour lui garantir une place chez VIT en 2016.</p>","es_ES":"<p>Si bien es cierto que Lucas ‘Cabochard’ Simon-Meslet es un jugador agresivo que disfruta bajo la luz de los focos que apuntan al principal artífice de la victoria, en realidad no hace honor a la terquedad que su apodo le presupone al ser capaz de anteponer los intereses del colectivo a los suyos.</p>\n\n<p>De hecho, uno de los desafíos que se ha autoimpuesto con tal de estar a la altura de las expectativas en torno a su potencial es demostrar su versatilidad en la calle superior. El francés pasó de competir ocasionalmente junto a leyendas de la talla de Danil ‘Diamondprox’ Reshetnikov a, en cuestión de meses, amasar una ingente cantidad de recursos para liderar a aquellos a los que otrora admiraba.</p>\n\n<p>El protagonismo de Cabochard en Gambit Gaming se saldó con un éxito moderado, aunque no impidió que el joven se quedara con una espinita clavada ante la oportunidad perdida de clasificarse para los Playoffs de verano tras la polémica sanción a Konstantinos ‘FORG1VEN’ Tzortziou. De nada le sirvieron al joven jugador los elogios que propios y extraños dedicaban a sus actuaciones con campeones como Morgana, Kennen o Hecarim. Cabochard apuntó alto, pero acabó luchando por la permanencia en la máxima competición europea.</p>\n\n<p>Una vez conocido el éxito gracias a la conquista de la novena edición de la Intel Extreme Masters Colonia, Cabochard se ha unido a Team Vitality con el objetivo de hacer desaparecer de su paladar el agridulce sabor que le dejó creer que podría haber incluso participado en el Campeonato Mundial 2015 de contar con el tirador griego para reencontrarse con la miel de la victoria.</p>","pl_PL":"<p>18-letni, francuski top-laner swoją profesjonalną karierę rozpoczynał stosunkowo niedawno, bo w sierpniu 2013 roku. Początkowo występował w mniej znanych formacjach takich jak COREPLAY, GSI Gaming czy Heavy Botlane. Z tą ostatnią drużyną z całkiem niezłej strony zaprezentował się jednak w kwalifikacjach EU Challenger Series, odpadając dopiero w ostatnim meczu przeciwko faworytom zmagań. Co ciekawe, w GSI Gaming oraz HB Cabochard grał razem ze swoim bratem, Ugo „Istarim” Simon-Mesletem.</p>\n<p>\nPierwszym ważnym momentem w karierze francuskiego gracz był występ w piątym tygodniu letniego splitu EU LCS 2014, kiedy to Cabochard zastąpił mającego problemy z wizą Evgeny’ego \"Dariena\" Mazaeva. Cabochard zaprezentował się z niezłej strony i z pewnością miało to wpływ na to, że w miesiąc później otrzymał ofertę od pragnącego powrócić do elitarnych rozgrywek Ninjas in Pyjamas, na którego czele stał były mid-laner Gambitu Alexey „Alex Ich” Ichetovkin. Aspiracje te pozostały niespełnione, ale talent Francuza po raz kolejny dostrzegł Gambit, który tym razem szukał stałego zastępstwa dla Dariena. Był to drugi ważny moment w karierze francuskiego top-lanera. </p>\n<p>\nLucas do tego czasu był niezłym zawodnikiem, ale nie wyróżniał się zanadto nawet na tle rywali z Challenger Series. Tymczasem kiedy zaczął występować w EU LCS zrobił ogromny postęp i zaskoczył wszystkich, szybko stając się jednym z najlepszych graczy górnej alei na Starym Kontynencie. Co prawda Gambit spisywał się poniżej oczekiwań, ale jedyną osobą, do której kibice nie mogli mieć najmniejszych zastrzeżeń był właśnie Cabochard, który prezentował równą, wysoką formę przez cały 2015 rok. </p>\n<p>\nW tym czasie Francuz dał się poznać jako niesamowicie utalentowany mechanicznie zawodnik o bardzo szerokim champion poolu i jednocześnie gracz, który nie boi się niestandardowych rozwiązań. To właśnie on był pionierem, jeśli chodzi o wykorzystanie Gankplanka na profesjonalnej scenie – można powiedzieć, że grał piratem zanim jeszcze to było modne, bowiem wybierał tą postać jeszcze przed zmianami, które dotknęły bohatera.</p>\n<p>\nW letnim splicie EU LCS 2015 Cabochard najczęściej grał Hecarimem (4 razy) i Fizzem (trzykrotnie). Francuz był w tej edycji rozgrywek drugim najczęściej zabijającym top-lanerem i najlepiej farmiącym graczej górnej alei. W większości statystyk znajdował się na podium na swojej pozycji. Interesujący, choć nie do końca chwalebny, jest fakt, że zabierał też najwięcej złota drużynowego wśród zawodników górnej linii. Zdawałoby się to potwierdzać mentalność Cabocharda, który zawsze dąży do tego, by mieć duży wpływ na poczynania zespołu. Z tego powodu często prosi swoich dżunglerów o ganki, na co narzekali niektórzy jego byli koledzy z drużyny jak na przykład Tri Tin „K0u” Lam, z który Cabochard występował w barwach NiP. </p>\n<p>\nCo ciekawe, nick francuskiego top-lanera po francusku znaczy „uparty”, a motywacją do przyjęcia takiego właśnie pseudonimu dostarczyła zawodnikowi piosenka Cabochards autorstwa 25G i Setha Gueko.</p>"},"foreignIds":{"drupalId":"1489","TRLH3":"200000119","TRLH4":"200000222"},"socialNetworks":{"twitch":"www.twitch.tv/cabochardlol","facebook":"www.facebook.com/CabochardLol/","twitter":"https://twitter.com/CabochardLoL"},"champions":[],"liveGameTeam":165},{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":190,"slug":"vander","name":"Vander","firstName":"Oskar","lastName":"Bogdan","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vander-edwzo382.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T10:57:12.000Z","bios":{"en_US":"<p>Oskar \"Vander\" Bogdan is one of the most veteran supports in the EU LCS. With a career that goes back to 2012, Vander has the experience any team would value in a support. After spending a split in the Challenger Series, he's making his return to the EU LCS as part of Team Vitality. He'll want to prove he's anything but past his prime as he leads Vitality in the 2017 EU LCS Summer Split.</p>","de_DE":"<p>Trotz seiner jungen 21 Jahre spielt Oskar „VandeR“ Bogdan seit 2011 kompetitiv League of Legends, also praktisch schon fast seit es das Spiel überhaupt gab. Erstes großes Aufsehen erregte er jedoch erst Ende 2013 mit der polnischen Mannschaft, bekannt als Kiedyś Miałem Team, kurz: KMT. Schon damals war sein heutiger Teamkamerad Marcin „Jankos“ Jankowski an seiner Seite und zusammen schafften sie es mit ihrer Mannschaft bis in die letzte Runde des Qualifikationsturniers für die EU LCS Spring 2014. Die fünf Polen spielten mit einem ruhigen Stil das Spiel und überzeugten vor allem in ihrer Zusammenarbeit und Synergie während Teamkämpfen. KMT schafften einen Davidsieg gegen Ninjas in Pyjamas und vollendeten ihre Reise in die EU LCS mit einem überzeugenden 3-0-Triumph.</p>\n\n<p>In zwei dieser drei Spiele, führte VandeR seine Künste auf Thresh vor, der Champion mit dem er sich bis heute einen Namen gemacht hat. Kurz darauf übernahm das allbekannte ROCCAT die Führung über das Supporttalent und seine Freunde. Ein großes Fragezeichen schwebte über dem Kopf des blonden Polens und nach der Begegnung gegen NIP wurden nicht allzu kleine Erwartungen gestellt. Tatsächlich bewies VandeR, dass es wirklich das Zeug zum LCS-Spieler hatte, als er in der vierten Woche der EU LCS Spring 2014 den wöchentlichen MVP-Titel gewann. Zudem bekamen seine Gegner einen weiteren Champion von ihm zu sehen, welcher ihnen zuvor noch nicht mit einer solchen Effektivität entgegengekommen ist: Morgana war der zweite Go-to-Pick VandeRs. </p>\n\n\n<p>Die Leistung in der ersten Saison wurde mit dem vierten Platz in der regulären Saison und dem dritten Platz in den Playoffs belohnt und ROCCAT hatte sich im europäischen oberen Mittelfeld eingelebt. </p>\n\n<p>Jedoch ging es seitdem bergab: ROCCAT schaffte es im darauffolgenden Sommer gerade so in die KO-Phase und schied letztendlich gegen den Turnierfinalisten Fnatic auszuscheiden. Ende 2014 wurde der schwach spielende  Paweł „Celaver“ Koprianiuk durch einen anderen Pawel ersetzt, nämlich Pawel “Woolite” Purski. Doch auch mit ihm gelang es VandeR im Frühling 2015 nicht die Top-Plätze der LCS zu erreichen, im Gegenteil: Er entging nur knapp der Relegation in die Challenger Series. Nach einer kurzen Pause drehte sein Mid-Laner Erlend “nukeduck” Holm auf und beschenkte dem nicht mehr ganz so polnischen Team Siege über Siege, bis sie es schließlich im Viertelfinale eine unerwartete Niederlage gegen Unicorns of Love erlitten. </p>\n\n<p>Ein letzter Pfad zur Weltmeisterschaft eröffnete sich durch das regionale Qualifikationsturnier, in welchem VandeR überragend spielte. Mit fünf verschiedenen Champions kämpfte er sich mit seinen Freunden bis in die zweite Runde des Turniers und ein fünftes Spiel gegen den Turniersieger Origen vor. Zwar verloren sie die Begegnung, doch es war ein klares Statement. 2016 könnte wieder ein Jahr sein, in dem VandeR zu VandeRLife mutiert und VandeRnoob hinter sich lässt.</p>\n\n<p>„Es gibt keinen offensiven oder defensiven Spielstil. Es gibt nur den richtigen“ – das ist sein Motto.</p>\n\n","pl_PL":"<p>Polski wspierający przeszedł długą drogę zanim udało mu się dostać do EU LCS I zostać jednym z najlepszych supportów na kontynencie. </p>\n\n<p>Początek jego kariery miał miejsce jeszcze w 2011 roku, w barwach organizacji Delta eSports, ale na dobre wszystko zaczęło się w rok później. Pomiędzy sierpniem 2012 roku a kwietniem 2013 Vander występował kolejno w polskim zespole EloHell, ale także w międzynarodowych formacjach, takich jak The Mighty Midgets, mousesports, Millenium czy Eternity Gaming. W międzyczasie wystartował też w kwalifikacjach do pierwszego splitu EU LCS w historii, ale jego zespół, Trudniej Już Nie Będzie, pożegnał się z rywalizacją już w fazie grupowej, po dwóch przegranych spotkaniach. Co ciekawe, aż do przygody z Eternity Gaming polski gracz pełnił rolę… strzelca i dopiero zmiany we wspomnianym zespole sprawiły, że zmienił pozycję i został wspierającym.</p>\n\n<p>Przełomowe dla Vandera było dołączenie do polskiego zespołu Kiedyś Miałem Team, choć drużynie nie od razu udało się zbudować stały skład. KMT istniało od września 2012 roku i przez formację przewinęło się wielu znanych na polskiej scenie zawodników. Vander dołączył do formacji już w okresie, kiedy zmian nie było tak wiele, choć nadal się zdarzały. Ostatecznie zespół znalazł sobie organizację, którą było… H2k. Początkowo dla Vandera nie było miejsca w nowej drużynie, ale po zaledwie pięciu dniach zastąpił w składzie drużyny Piotra „SuperAZE’a” Prokopa. Później zespół przeniósł się do GF Gaming, a w międzyczasie doszło jeszcze do kilku niewielkich rotacji. Ostatecznie pod szyldem Kiedyś Miałem Team ekipa spróbowała swoich sił w kwalifikacjach do EU LCS. Drużyna w składzie Xaxus-Jankos-Overpow-Celaver-Vander dostała się do baraży, w których zwyciężyła z faworyzowanym Ninjas in Pyjamas. Nowy zespół, występujący już pod banderą Teamu ROCCAT, zaskakująco dobrze radził sobie w swoich pierwszych splitach w stawce , notując trzecie i czwarte miejsce w play-offach w 2014 roku i niemalże uzyskując bilety na Mistrzostwa Świata. Jednocześnie Vander szybko wyrósł na jedną z gwiazd zespołu, zachwycając głównie niesamowitymi umiejętnościami mechanicznymi. Szczególnie było to widoczne, gdy dostawał w swoje ręce Thresha, który do dziś jest jego najbardziej znaną postacią. To on był też jednym z pierwszych graczy EU LCS, który dostrzegł potencjał Morgany w roli wspierającej. W 2015 roku przyszedł czas na zmiany w składzie zespołu i rozczarowujące występy, choć znów do wyjazdu na MŚ nie było daleko… Polski support był w tym czasie, obok Jankosa, najsilniejszym punktem zespołu. Powiększył też znacznie swój champion pool, który zaczął wykraczać poza dwie wspomniane wcześniej postaci: w letnim splicie 2015 Vander najczęściej decydował się na wybór Alistara (8 gier), Nautilusa (4 gry) i oczywiście Thresha (4 gry).</p>\n\n<p>Przed wiosennym splitem 2016, wspierający przeniósł się wraz z dżunglerem Marcinem „Jankosem” Jankowskim z Teamu ROCCAT do H2k-Gaming.</p>\n\n<p>Co ciekawe, polski zawodnik na początku swojej kariery posługiwał się pseudonimem Van Der Fckk, który później ewoluował w VandeRnoob, a następnie pozostał po prostu VandeR. Dodatkowo warto zauważyć, że wspierający był w letnim splicie 2015 najczęściej wardującym graczem w stawce, a także prawie najczęściej zabijającym supportem. Legitymował się również trzecim najwyższym KDA na swojej pozycji.</p>\n","fr_FR":"<p>Oskar « Vander » Bogdan a commencé la compétition dès la première saison, mais c’est en 2013 qu’il rencontre ses premiers succès, quand il réussit à se qualifier aux League of Legends Championship Series avec l’équipe polonaise Kiedyś Miałem Team après avoir tenu en échec les Ninjas in Pyjamas de Erlend « Nukeduck » Våtevik. Aussitôt, l’équipe signe avec ROCCAT et fait un départ en trombe aux LCS. Vander obtient le titre de meilleur joueur de la semaine 4 après avoir livré deux parties grandioses avec Thresh, son champion signature, et obtenu 22 de KDA. Son expérience et sa vision de jeu permettent au Polonais de prendre des décisions avisées et de guider ses coéquipiers vers la victoire.</p>\n\n<p>Alors à peine arrivé en LCS, le support permet à son équipe de truster la première place du classement provisoire de la saison printanière 2014 pendant trois semaines avant que cette dernière ne subisse une baisse de régime tandis que ses adversaires s’adaptent de mieux en mieux. Tout de même qualifiés aux play-offs, Vander et ses compatriotes obtiennent la 3e place après avoir tenu en échec l’équipe Alliance de Henrik « Froggen » Hansen.</p>\n\n<p>Après des résultats bien moins convaincants en saison estivale, l’équipe polonaise ne parvient qu’à obtenir la 6e place sur 8 pendant la saison régulière avant d’échouer au pied du podium des play-offs et se voit contrainte de jouer les matchs de relégation pour conserver sa place en LCS.</p>\n\n<p>Début 2015, Vander voit arriver un nouveau partenaire en voie du bas, Paweł « Woolite » Pruski, venu pour remplacer un Paweł « Celaver » Koprianiuk qui connaissait des difficultés contre les meilleurs carrys AD européens. Malheureusement, le résultat n’est pas celui escompté et ROCCAT peine toujours autant. C’est à la 4e semaine de la saison d’été et l’arrivée de Rasmus « MrRalleZ » Skinneholm, un carry AD plus autonome, que Vander peut enfin quitter sa voie afin d’accompagner son jungler Marcin « Jankos » Jankowski dans ses initiatives pour produire un jeu de meilleure qualité.</p>\n\n<p>L’équipe réussit à remonter à la 5e place du segment mais échoue dès le premier tour des play-offs face à Unicorns of Love. Dans la course à la qualification pour le mondial 2015, Vander et son équipe chutent de peu face à Origen. Il quitte ROCCAT en décembre et rejoint les rangs de H2K pour la saison 2016 en compagnie de son compatriote Jankos et a cette fois-ci à ses côtés un carry AD de première classe, Konstantinos « FORG1VEN » Tzortziou-Napoleon. Pendant la saison régulière, Vander excelle. Libéré par l’espace que lui procure un très bon partenaire de voie, il s’épanoui et devient une pièce maîtresse de son équipe avec laquelle il se hisse à la 2e place du classement à l’aube des play-offs avec le 2e meilleur KDA de tous les supports de sa ligue (7,11). Directement qualifié en demi-finale des play-offs, Vander perd ses espoirs de finale après la défaite 2 à 3 contre Origen. Cet été, en compagnie de la même équipe mais cette fois aux cotés de Aleš « Freeze » Kněžínek en carry AD, le Polonais aura à cœur de passer à l’étape supérieure pour enfin s’imposer en Europe, avec comme objectif le Mondial 2016 !</p>","es_ES":"<p>Como uno de los líderes de su anterior equipo, ROCCAT, Oskar ''Vander'' Bogdan evalúa constantemente el estado del juego y los movimientos de sus enemigos en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC, y en su primer split con H2K en 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó los problemas de ROCCAT atrás cuando se pasó a una calle inferior con uno de los AD carries más exigentes del juego, FORG1VEN. Comenzó a acumular víctimas enseguida con su nuevo compañero de calle, valiéndose de apoyos pesados de iniciación que le permitían facilitar asesinatos y aturdir a los enemigos para controlar los combates de equipo. Poco después, tuvo que compartir calle con Freeze, pero el nuevo AD carry quedó en el banquillo por una lesión y Vander volvió a reunirse con FORG1VEN. Aunque H2K no logró superar los playoffs para llegar a la final de verano, el liderazgo de</p> <p>Vander ha vuelto a su forma tajante habitual. Dirigirá un equipo de perdedores este año, pero con su experiencia internacional, Vander puede ayudar a que H2K sorprenda al mundo y recupere el trofeo para Europa.</p>","es_AR":"<p>Como uno de los líderes de su antiguo equipo ROCCAT, Oskar \"Vander\" Bogdan evalúa constantemente el estado del juego y los movimientos del enemigo en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC y, en su primer torneo con H2K en el 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó las peleas del equipo ROCCAT atrás para pasar directamente al carril inferior junto a uno de los ADC más demandantes del juego, FORG1VEN. Rápidamente empezó a cosechar víctimas con su nuevo compañero de carril, lo que favoreció a los soportes fuertes de iniciación, que le permitieron lograr asesinatos y tener el control del combate en equipo. Pronto tuvo a un nuevo compañero de carril en Freeze, pero, luego de que una lesión dejara fuera a su nuevo tirador, no pasó mucho para que volviera a unirse a FORG1VEN. Aunque H2K cayó en las eliminatorias antes de llegar a la final de verano, Vander volvió a liderar de forma clara y medida, tal como siempre lo ha hecho. Este año dirigirá a un equipo de jugadores de bajo nivel, pero, con su experiencia internacional, Vander puede ayudar a H2K a hacer vibrar el mundo e intentar llevarse un trofeo a Europa.</p>","pt_BR":"<p>Como coordenador das tomadas de decisão em sua antiga equipe, ROCCAT, Oskar “Vander” Bogdan está constantemente avaliando o estado do jogo e os movimentos do inimigo no Rift. O conhecimento de jogo de Vander foi primordial para o sucesso da ROC e, em sua primeira Etapa com a H2K em 2016, ele se tornou um membro essencial para a equipe.</p>\n\n<p>Vander deixou suas dificuldades com a ROCCAT para trás e fez sua transição impecável para a rota inferior junto com um dos atiradores mais exigentes do jogo, FORG1VEN.  Ele rapidamente esmagou suas vítimas com seu novo parceiro de rota, favorecendo suportes com iniciação pesada que permitiam que ele organizasse momentos de abate e atordoasse tudo em seu caminho no controle de confrontos de equipe. O suporte logo se encontrou com um novo parceiro de rota em Freeze, mas depois que uma lesão deixou seu novo atirador no banco, ele logo se reuniu com FORG1VEN. Apesar da H2K ter sido nocauteada nas eliminatórias antes de chegar na Final de Verão, as tomadas de decisão de Vander voltaram à sua antiga forma firme. Ele irá comandar uma equipe de azarões este ano, mas com sua experiência internacional, Vander pode fazer com que a H2K surpreenda o mundo enquanto tentam trazer o troféu para a Europa.</p>"},"foreignIds":{"drupalId":"1117","TRLH3":"200000234","TRLH4":"200000086","TRLH2":"1001280061","FRA1TMNT2":"25440","TRLH1":"1001380091","ESPORTSTMNT02":"200001008"},"socialNetworks":{"twitch":"http://www.twitch.tv/lolvander","facebook":"https://www.facebook.com/Vander.lol","twitter":"https://twitter.com/VanderLCS"},"champions":[],"liveGameTeam":165},{"id":205,"slug":"shlaya","name":"Shlaya","firstName":"Tony","lastName":"Carmona","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/shlaya-1gibq14m.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2016-01-28T22:37:16.000Z","bios":{"en_US":"<p>Tony “Shlaya” Carmona is substitute mid laner for Team Vitality.\n</p>","de_DE":"<p>\nTony „Shlaya“ Carmona spielt schon seit der ersten Stunde League of Legends, an Wettbewerben nimmt er bereits seit 2011 teil. Er verbrachte mehrere Jahre in der EU LCS, sowohl als Starter, als auch als Ersatzspieler, und er hat als AD-Carry, Mid-Laner und Top-Laner an Wettbewerben teilgenommen. 2015 kam Shlaya als Ersatzspieler zu Team Vitality.\n</p>","fr_FR":"<p>\nTony « Shlaya » Carmona est un joueur de League of Legends de longue date, sa participation à la compétition remontant à 2011. Au sein des LCS EU, il a joué pendant des années comme titulaire et remplaçant, évoluant en compétition comme carry AD, sur la voie du haut et sur la voie du milieu. Shlaya a rejoint les rangs de Fnatic comme remplaçant en 2015.\n</p>","es_ES":"<p>\nTony ''Shlaya'' Carmona es un auténtico veterano de League of Legends, con un historial competitivo que se remonta a 2011. Pasó varios años en la LCS de EU como titular y como suplente y ha jugado en el circuito profesional como AD carry, calle central y calle superior. En 2015 se incorporó a Fnatic como suplente.\n</p>","pl_PL":"<p>\nTony „Shlaya” Carmona jest długoletnim graczem w League of Legends. Swoją przygodę z grą rozpoczął jeszcze w 2011 r. Przez wiele lat uczestniczył w rozgrywkach EU LCS, zarówno jako zawodnik początkowego składu, jak i rezerwowy. Pełnił funkcję prowadzącego, gracza w środkowej alei, a także w górnej.  Shlaya dołączył do Fnatic jako rezerwowy w 2015 r.\n</p>","pt_BR":"<p>\nO histórico de Shlaya vem desde 2011. Ele passou vários anos na LCS EU, tanto como titular quanto reserva, e jogou competitivamente nas rotas do meio, do topo, e como atirador. Ele entrou na Fnatic como reserva em 2015.</p>"},"foreignIds":{"drupalId":"1123","TRLH3":"1001220080","TRLH4":"1001190130"},"socialNetworks":{"facebook":"https://www.facebook.com/ShLaYa.Tony","twitter":"http://twitter.com/ShLaYa","twitch":"http://www.twitch.tv/shlaya"},"champions":[],"liveGameTeam":165},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":328,"slug":"steeelback","name":"Steeelback","firstName":"Pierre","lastName":"Medjaldi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/steeelback-6w0pq1lj.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-18T22:51:12.000Z","bios":{"en_US":"<p>Pierre \"Steeelback Medjaldi is still looking for a team he can call home. He rose to prominence with Fnatic in 2015 but was replaced by a returning Rekkles. He joined Gambit Gaming for a split. Then he migrated to the Unicorns of Love but departed after a playoff defeat. He spent the 2016 EU LCS Summer Split with ROCCAT before deciding to move on once again.</p>\n\n<p>Steeelback and Team Vitality both hope to have found the perfect match. Steeelback's talent has never been in question; he put up impressive numbers in the Summer Split despite ROCCAT nearly getting relegated. Alongside ex-KT Rolster support Hachani, Steeelback has the potential to rival the best bot lanes in the EU LCS -- if he's willing to stick around.</p>","de_DE":"<p>Pierre „Steeelback“ Medjaldi sucht immer noch nach einem Team, in dem er sich zu Hause fühlt. Er wurde 2015 mit Fnatic bekannt, wurde später allerdings durch Rekkles ersetzt. Daraufhin spielte er einen Split bei Gambit Gaming. Danach zog es ihn zu den Unicorns of Love, die er nach einer Niederlage in den Entscheidungsspielen jedoch wieder verließ. Während des Sommer-Splits der EU LCS 2016 spielte er dann bei ROCCAT, bevor er wieder weiterzog.\n\nJetzt hoffen sowohl Steeelback als auch Team Vitality, dass sie perfekt zusammenpassen. Steeelbacks Talent steht außer Frage. Er lieferte im Sommer-Split eine beeindruckende Leistung ab, obwohl ROCCAT beinahe absteigen musste. Neben dem ehemaligen Supporter von KT Rolster, Hachani, hat Steeelback das Potenzial, die besten Duos auf der unteren Lane herauszufordern – wenn er nicht wieder die Mannschaft wechselt.</p>","fr_FR":"<p>Pierre « Steeelback » Medjaldi a rejoint les rangs de SK Gaming Prime à la fin de l’année 2014, sans trouver le succès car éliminé prématurément du tournoi d'expansion qui permettait l’accès aux League of Legends Championship Series. </p>\n\n<p>Mais le Français accède tout de même aux LCS. Steeelback est en effet repéré par son compatriote Bora « YellOwStaR » Kim par pur hasard alors que ce dernier écumait les parties classées. Le vétéran de Fnatic qui cherchait un dernier joueur pour son équipe est agréablement surpris par le niveau de jeu du carry AD. Il décèle chez lui une soif d’apprendre très développée et décide de l’inviter à le rejoindre dans sa nouvelle aventure.</p>\n\n<p>En très peu de temps, le duo français et ses trois coéquipiers réussissent à créer un jeu qu’ils exposent aux yeux d’un public européen positivement surpris. Dès la première semaine, Steeelback et ses coéquipiers montrent une cohésion impressionnante et remportent leurs deux parties. Galvanisé et guidé par un des meilleurs support au monde, le jeune joueur tient la dragée haute à certains des meilleurs carrys AD d’Europe. S’il n’est que la 3e source de dégâts d’une équipe très centrée sur son toplaner Seung-hoon « Huni » Heo, Steeelback est régulier et sait être la tornade qui vient balayer les combats d’équipe avec Corki ou Graves, ne laissant aucune chance de fuite à ses adversaire. Il signe un très bon ratio KDA de 8,9.</p>\n\n<p>Steeelback et Fnatic sont sacrés champions d’Europe après avoir remporté les play-offs et sont conviés au tournoi sur invitation de mi-saison. Le carry AD montre ses limites face à certains des meilleurs joueurs du monde et est remercié par la suite. Le management de Fnatic a indiqué être conscient du potentiel du Français mais ne pas avoir le temps d’attendre que le joueur soit formé, les ambitions du club ayant fortement augmenté.</p>\n\n<p>À la recherche d’un nouveau toit, Steeelback se tourne vers l’Amérique du Nord et rejoint Odyssey Gaming. Malheureusement, l’équipe ne parvient pas à se qualifier aux Challenger series NA. Il rejoint par la suite une équipe qui, elle, est parvenue à accéder à la compétition : Team Imagine. Après des résultats mitigés, il parvient tout de même à accéder au tournoi de promotion, mais son équipe se fait éliminer par Team 8, l’escouade sortante des LCS.</p>\n\n<p>En 2016, Steeelback revient en Europe et compte bien réitérer une bonne performance en LCS, cette fois-ci avec Unicorns of Love. Au début du segment de printemps, il s’illustre notamment avec sa Kalista, terminant le segment avec un KDA de 33 sur ce personnage et un KDA général de 6.81. Malgré de bonnes statistiques personnelles, l’équipe ne suit pas et termine à la 5ème place de la saison régulière. Une performance décevante pour Steeelback qui décide de partir pour Roccat au début du segment d’été.</p>\n","pl_PL":"<p>Pierwszą próbę zaistnienia w League of Legends Pierre podjął w drużynie GSI Gaming w sierpniu 2014 roku. Skończyło się tylko na podejściu, gdyż w jego szeregach nie wystąpił na scenie esportowej. Udało mu się pokazać z kolejnym zespołem – SK Gaming Prime, do którego dołączył w listopadzie tego samego roku. Z tą organizacją miał okazję nabrać doświadczenia i wziąć udział w Challenger Series. Jednak nie odniósł tam sukcesów, na których mu zależało.</p>\n<p>\nPrzełomem w karierze francuza było dostanie się, w styczniu 2015 roku, do sztandarowego zespołu Europy - Fnatic. Poprzedni AD Carry, „Rekkles”, postawił mu poprzeczkę bardzo wysoko. Wielu fanów było bardzo zawiedzionych wyborem Pierra Medjaldi na tą pozycję. On sam skomentował to krótko: „Chciałbym się sprawdzić w rozgrywkach EU LCS i zasłużyć na miejsce pomiędzy najlepszymi graczami AD Carry w Europie.” Miał taką okazję w wiosennym sezonie 2015 i udowodnił, że nie był złym wyborem. Fnatic po tym okresie uplasowało się na 2gim miejscu, co w dużej mierze było jego zasługą. Później poprawił ten wynik wraz z drużyną w rozgrywkach barażowych. Czołowa pozycja w Europie po pierwszym semestrze to jedno z największych dokonań Pierra. Drugie największe osiągnięcie to występ na 2015 Mid-Season Invitational. \"Steeelback\" zmierzył się na tym wydarzeniu z najlepszymi zawodnikami z całego świata i wypadł całkiem dobrze. Fnatic został zatrzymany dopiero przez SKT T1, przyszłych Mistrzów Świata, w zaciętej walce z wynikiem 2:3. Niestety wkrótce po turnieju, w maju 2015 roku, organizacja Fnatic zdecydowała się na ponowne przyjęcie Martina „Rekkles” Larssona, więc Pierre poszedł w odstawkę. </p>\n<p>\nPo tym wydarzeniu wypowiedział się, że chciałby móc się wykazać po MSI, ale taka szansa nie została mu dana. \"Steeelback\" wrócił do prób dostania się do EU Challenger Series wraz z drużyną Odyssey Gaming, lecz bez pomyślności. Następnie zasilił skład Team Imagine, które walczyło o kwalifikację do NA LCS. W rozgrywkach kwalifikacyjnych skończyli na trzeciej pozycji, przez co później musieli się zmierzyć z doświadczonym Team8. Niestety przeciwnicy okazali się mocniejsi, więc nowa drużyna Pierra pozostała w NA Challenger Series. 2 miesiące później zrezygnował dalszej walki o wejście wyżej, na rzecz propozycji zespołu, który już znajdował się w wiosennym sezonie EU LCS 2016. W listopadzie stał się członkiem Unicorns Of Love, gotowy do kolejnego podejścia w profesjonalnych rozgrywkach.</p>\n<p>\nWypowiedzi Pierra z wywiadów to nieliczne źródła, z których można się dowiedzieć czegoś o nim. To bardzo skryty gracz, z reguły rzadko udzielający się na portalach społecznościowych. Po jego wyborach w meczach można się łatwo domyślić, że najbardziej lubi grać Corkim, Lucianem i Sivir. Tymi bohaterami miał najlepsze wyniki i nim zawdzięcza wejście do Kręgu Pretendenta w Europie i Ameryce Północnej.\n</p>","es_ES":"<p>Aunque Pierre ‘Steeelback’ Medjaldi se hizo popular gracias a su fichaje por Fnatic en el Split de primavera de la LCS 2015, el jugador ya ha pasado hasta por siete equipos en menos de un año. Sin miedo a nuevos retos y aventuras, el joven francés todavía tiene una larga carrera por delante para demostrar que no sólo fue una apuesta arriesgada, sino también una garantía de futuro que explotará en Unicorns of Love.</p>\n\n<p>No es del todo cierto asegurar que Steeelback era un completo desconocido antes de fichar por Fnatic pero sí que es cierto que sus apariciones son con cuentagotas. En Agosto ficharía por GSI Gaming, equipo francés en el que también participaron Lucas ‘Cabochard’ Simon-Meslet y Aleksi ‘Hiiva’ Kaikkonen. Quizás por el contacto con el segundo pudo competir con SK Gaming Prime en el intento en Noviembre de entrar a la LCS por el torneo de promoción de primavera, aunque serían derrotados en la primera ronda por Reason Gaming.</p>\n\n<p>Aquí es cuando la vida del tirador cambia totalmente de rumbo debido al fichaje por Fnatic. Aunque el voto de confianza de Bora ‘YellOwStaR’ Kim le permitió entrar al equipo, la toma de contacto con Fnatic fue curiosamente por Fabian ‘Febiven’ Diepstraten que realizó la sugerencia para que probase por la escuadra inglesa. Durante primavera se mostró sólido pero no espectacular aunque no sería tarea fácil enfrentarse a los mejores del mundo en su posición en el Mid Season Invitational 2015. Su dominio de Sivir les otorgó una posibilidad táctica que le permitió cumplir su rol secundario.</p>\n\n<p>Pero con la llegada de Martin ‘Rekkles’ Larsson, el joven francés decidió tomar rumbo a las américas. La suerte no le acompañó ni en Odyssey Gaming al no poder clasificarse para la Challenger Series norteamericana ni en Imagine, puesto que ya en Challenger Series no fueron rival de Team8 para ascender a la League Championship Series. El jugador mostró una faceta más agresiva con campeones como Lucian o Corki que le permitieron aportar el desgaste necesario, pero todavía se mantuvo en una posición de retaguardia más pasiva.</p>\n\n<p>Con Zdravets ‘Hylissang’ Galabov la fase de líneas será un factor fundamental a la hora de decidir las partidas debido a la agresividad del búlgaro. El tirador tendrá que dar un paso adelante en su agresividad en una metajuego que a priori podría beneficiar a su Lucian, pero en el que la duda es la principal amenaza.</p>\n\n<p>Después de Fnatic y la Challenger Series norteamericana, esta supone la tercera aventura de Steeelback. El jugador ya ha afirmado su número de la suerte es el tres, de ahí las tres es en su nombre, y además también posee a tres campeones favoritos fuera de la propia posición de tirador, como son Zed, Lee Sin y Thresh. ¿Será la tercera la vencida?</p>"},"foreignIds":{"drupalId":"2903","TRLH3":"200000122","TRLH4":"200000225"},"socialNetworks":{"twitch":"http://www.twitch.tv/steeelback","facebook":"www.facebook.com/Steeelback","twitter":"http://twitter.com/Steeelb4ck"},"champions":[],"liveGameTeam":165},{"id":384,"slug":"nukeduck","name":"Nukeduck","firstName":"Erlend","lastName":"Holm","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nukeduck-9lfeix3.png","hometown":"Norway","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T10:41:18.000Z","bios":{"en_US":"<p>Erlend “Nukeduck” Holm enters 2017 with an eye on the new mid lane meta. The Norwegian mid laner burst onto the scene in 2013 as part of the impressive Lemondogs lineup. Since then, he’s played for Ninjas in Pyjamas and ROCCAT, and he spent all of 2016 with Team Vitality.</p>\n\n<p>Previously known for his play on assassins, Nukeduck will get the chance to shape his own meta in the 2017 Season. He’ll also need to learn to work with Vitality’s new junglers, Djoko and GBM. With the whole season in front of him, Nukeduck to forge a new identity for Vitality in 2017 and earn a spot in the playoffs.</p>","de_DE":"<p>2017 wird Erlend „Nukeduck“ Holm das Metaspiel auf der mittleren Lane genau im Auge behalten. Der norwegische Mid-Laner betrat die Szene 2013 als Teil der beeindruckenden Aufstellung der Lemondogs. Seitdem hat er für die Ninjas in Pyjamas und ROCCAT gespielt, bevor er 2016 zu Team Vitality wechselte.\n\nNukeduck, der früher für seinen Spielstil mit Assassinen bekannt war, bekommt in der Saison 2017 die Gelegenheit, sein eigenes Metaspiel zu schaffen. Außerdem wird er lernen müssen, mit Vitalitys neuen Junglern, Djoko und GBM, zusammenzuarbeiten. Doch noch liegt die gesamte Saison vor ihm und Nukeduck wird versuchen, Vitality 2017 eine neue Identität zu verleihen und mit der Mannschaft in die Entscheidungsspiele einzuziehen.</p>","fr_FR":"<p>Erlend « nukeduck » Holm est devenu célèbre avec la surprenante équipe Lemondogs en 2013. À l'époque, il était considéré à raison comme l'un des meilleurs jeunes mid-laners d'Europe. Après la dissolution de Lemondogs, nukeduck a rejoint les rangs des Ninjas in Pyjamas, puis ceux de ROCCAT avant de poser ses valises chez Team Vitality durant l'intersaison des LCS EU 2015. Même si nukeduck a dû lutter pour se faire une place dans les récentes metas des LCS EU, ses talents d'assassin devraient se combiner à merveille avec ceux de son nouveau jungler, Shook.</p>","pl_PL":"<p>Karierę Nukeducka można podzielić na cztery etapy.</p>\n<p>\nPierwszym z nich była walka o dołączenie do czołówki. Ten okres rozpoczął się dla norweskiego mid-lanera w grudniu 2011 roku od przygód z 3DMAX, Tt Dragons i H2k-Gaming. Zawodnik zaliczył też na przełomie 2012 i 2013 roku epizod w Teamie Solo Mebdi, który był jednym z faworytów kwalifikacji do pierwszego w historii splitu EU LCS. Ostatecznie zespół został zdyskwalifikowany, a Nukeduck przeniósł się do Sinners Never Sleep, które po udanych eliminacjach do letniej edycji europejskich rozgrywek w 2013 roku, zmieniło nazwę na Lemondogs. </p>\n<p>\nI tu zaczął się drugi etap – okres triumfów. Nukeduck był jedną z gwiazd tego zespołu, który okazał się fenomenem. Norweg dzielił i rządził na środkowej alei, a formacja zajęła ostatecznie drugie miejsce w letnim splicie EU LCS i pojechała na Mistrzostwa Świata. Tam nie poszło już tak dobrze i LD zakończyło rywalizację już na fazie grupowej. Wtedy też na Nukeducka spadła spora fala krytyki ze strony kolegów z drużyny, którym nie podobało się zadufanie w sobie norweskiego zawodnika. Problem polegał na tym, że mid-laner był tak pewny siebie, że nierzadko świadomie wybierał niekorzystne match-upy, by słabszą postacią ograć przeciwnika i udowodnić swoją wyższość. Nietrudno przewidzieć, że na MŚ poziom był zbyt wysoki, by ta sztuka mu się udawała. Po nieudanych MŚ zespół zmienił organizację na Ninjas in Pyjamas i, w wyniku sporego chaosu i przeoczeń, był zmuszony walczyć w barażach o utrzymanie w EU LCS. </p>\n<p>\nTutaj rozpoczął się kolejny okres w karierze Nukeducka – etap spektakularnych porażek. Dużą rolę ponownie odegrał w tej kwestii egoizm Norwega, który miał duży udział w niespodziewanej porażce w meczu barażowym przeciwko Kiedyś Miałem Team. NiP został zmuszony do rywalizacji w EU Challenger Series, a Nukeduck nieprędko wrócił do LCS. Wiosenny split EU CS był dla drużyny i samego Norwega nieudany, a niedługo później Erlend został wraz z kolegą z drużyny , Alfonso „Mithy’m” Aguirre Rodriguezem, wykluczony z gry na profesjonalnym poziomie za toksyczne zachowanie w kolejce solowej. To właśnie ten moment był punktem kulminacyjnym tego bardzo nieudanego okresu w karierze Norwega, który został zmuszony do zrobienia sobie półrocznej przerwy w karierze.</p>\n<p>\nNukeduck został odbanowany w grudniu 2014 roku i niemal natychmiast znalazł nowego pracodawcę, którym okazał się Team ROCCAT. Był to już czwarty etap – powrót na szczyt. Początki nie były dla norweskiego mid-lanera łatwe i miał on problemy z odnalezieniem się zarówno w samej grze, jak i w drużynie, w której był jedynym obcokrajowcem. Skutkowało to wyjątkowo pasywnym stylem gry, jaki stał się udziałem Nukeducka. Sprawy nie ułatwiał także bardzo wąski champion pool gracza. W konsekwencji Team ROCCAT dopiero w barażach zapewnił sobie utrzymanie w rozgrywkach. Tymczasem letnia edycja zmagań była dla Norwega już znacznie bardziej udana – zawodnik odzyskał pewność w grze i stał się ważnym punktem zespołu, ponownie prezentując wysokie umiejętności mechaniczne. W lecie Nukeduck najczęściej grał Viktorem (5), Azirem (5) i Varusem (4) i trzeba przyznać, że wychodziło mu to znakomicie, bo okazał się drugim najczęściej asystującym mid-lanerem w stawce, a także drugim graczem środka alei z największym udziałem w zabójstwach drużyny.</p>\n<p>\nNick Norwega jest złożeniem dwóch słów – „Nuke”, co oznacza błyskawiczne zmiecenie przeciwnika z powierzchni ziemi, a także „Duck”, bo… dobrze brzmiało. Mid-laner w przeszłość dużo grał w koszykówkę, a także w piłkę wodną. Nukeduck nie ukrywa również fascynacji fantastyką, a szczególnym uwielbieniem darzy „Władcę Pierścieni” oraz „Hobbita”.\n</p>"},"foreignIds":{"drupalId":"280","TRLH3":"200000121","TRLH4":"200000224"},"socialNetworks":{"facebook":"www.facebook.com/nukeducklol","twitter":"https://twitter.com/nukeducklol","twitch":"http://www.twitch.tv/nukeducklol"},"champions":[],"liveGameTeam":165},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1089,"slug":"djoko","name":"Djoko","firstName":"Charly","lastName":"Guillard","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/djoko-eihpvx8d.png","hometown":null,"region":"EU LCS","birthdate":"1997-03-01","createdAt":"2016-01-21T21:12:44.000Z","updatedAt":"2017-06-09T10:57:44.000Z","bios":{"en_US":"<p>Charly “Djoko” Guillard is finally getting his shot in the EU LCS. The jungler has spent the past two years working his way up through the Challenger scene, most recently as a member of the Millenium roster that fell to ROCCAT in the 2017 Spring Promotion Tournament.</p>\n\n<p>On Team Vitality’s 2017 lineup, he’ll be competing with teammate GBM for the starting jungle position. His history in the jungle position may end up working in his favor; GBM is new to the role this season. Either way, the competition can only serve to improve Djoko’s skills and Vitality’s chances in 2017.</p>","fr_FR":"<p>Djoko est le jungler de l’équipe Millenium. Actuellement Challenger, il a prouvé sa valeur de nombreuses fois dans le passé notamment sous les couleurs \"Imaginary Gaming\" avec qui il a remporté la première édition du Challenge France. </p>\n<p> Il a pu goûter au plus haut niveau en remplaçant DiamondProx des « Unicorns of Love » durant les LCS EU 2016. Reconnu pour ses choix de champions exotiques, Djoko est l'un des piliers de l'équipe et compte bien la mener le plus loin possible. Sa synergie avec son coéquipier Kaze lui permet de dominer la scène française et de guider son équipe vers la victoire. Après l'échec de la qualification aux LCS à une marche de son rêve, il promet de revenir encore plus fort afin de conserver le titre avec ses coéquipiers et de retenter sa chance.</p>","de_DE":"<p>Charly „Djoko“ Guillard bekommt endlich die Gelegenheit, sich in der EU LCS zu beweisen. Der Jungler hat die letzten beiden Jahre damit verbracht, sich in der Challenger Series nach oben zu arbeiten. So war er vor Kurzem noch Mitglied von Millenium, die im Frühjahrs-Aufstiegsturnier 2017 gegen ROCCAT den Kürzeren zogen.\n\n2017 wird er bei Team Vitality mit Teammitglied GBM um die Startposition als Jungler wetteifern. Dabei könnte sich seine Vergangenheit im Dschungel als Vorteil erweisen, schließlich ist diese Position für GBM neu. So oder so wird die Konkurrenz dafür sorgen, dass sich sowohl Djokos Können als auch Vitalitys Chancen 2017 verbessern.\n</p>"},"foreignIds":{"TRLH3":"200000120","TRLH4":"200000223"},"socialNetworks":{"twitter":"https://twitter.com/Djoko_GG"},"champions":[],"liveGameTeam":165},{"id":1704,"slug":"alderiate","name":"Alderiate","firstName":"Adrien","lastName":"Wils","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alderiate-7q1wg8p0.png","hometown":null,"region":"EU LCS","birthdate":"1993-09-07","createdAt":"2017-01-13T19:44:16.000Z","updatedAt":"2017-01-18T22:06:05.000Z","bios":{},"foreignIds":{"TRLH3":"200000125","TRLH4":"200000228"},"socialNetworks":{"twitch":"https://twitter.com/Alderiate"},"champions":[],"liveGameTeam":165},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33}],"scheduleItems":[{"id":"AVxHGsteoUG4HPFjOKSu","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:58ff2258-872b-4d7c-a359-4df449a3a33d","scheduledTime":"2017-08-04T15:00:00.727+0000","tags":{"blockLabel":"9","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"58ff2258-872b-4d7c-a359-4df449a3a33d","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"5dc08461-2fa1-40ac-b1c7-47ab57b59bc3","gameHash":"8e38a0df755f0790"},{"id":"016220cf-acf8-40c5-8fbf-4e16024b544c","gameHash":"b41b69efb09d5aed"}],"videos":[{"id":8388,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:5dc08461-2fa1-40ac-b1c7-47ab57b59bc3","source":"https://www.youtube.com/embed/SmLg5YzGJFU?wmode=transparent&rel=0","createdAt":"2017-08-05T19:22:57.000Z","updatedAt":"2017-08-05T19:22:57.000Z","game":"5dc08461-2fa1-40ac-b1c7-47ab57b59bc3"},{"id":8389,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:016220cf-acf8-40c5-8fbf-4e16024b544c","source":"https://www.youtube.com/embed/TyXee2K1ZYU?wmode=transparent&rel=0","createdAt":"2017-08-05T19:23:26.000Z","updatedAt":"2017-08-05T19:23:26.000Z","game":"016220cf-acf8-40c5-8fbf-4e16024b544c"}],"htmlBlocks":[],"match":{"id":"58ff2258-872b-4d7c-a359-4df449a3a33d","name":"H2K-vs-VIT","position":38,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}],"games":{"5dc08461-2fa1-40ac-b1c7-47ab57b59bc3":{"id":"5dc08461-2fa1-40ac-b1c7-47ab57b59bc3","name":"G1","generatedName":"H2K|VIT|G1|58ff2258872b4d7ca35","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}],"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501961322740,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501862052651,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002190045","gameRealm":"TRLH3","platformId":"TRLH3:1002190045","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"9ed56dc2-ef90-49f6-8ec8-1e30d87fc5e8":{"id":"9ed56dc2-ef90-49f6-8ec8-1e30d87fc5e8","name":"G3","generatedName":"H2K|VIT|G3|58ff2258872b4d7ca35","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"016220cf-acf8-40c5-8fbf-4e16024b544c":{"id":"016220cf-acf8-40c5-8fbf-4e16024b544c","name":"G2","generatedName":"H2K|VIT|G2|58ff2258872b4d7ca35","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}],"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501961351354,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501864561169,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002200070","gameRealm":"TRLH3","platformId":"TRLH3:1002200070","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501961351354,"source":"bestOf","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501961322740,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"b6fe843d-0be5-417e-8f66-271acf709b1c"}]],"timestamp":1501864561169,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b6fe843d-0be5-417e-8f66-271acf709b1c":0,"e8121570-d909-4a38-9326-202e9a3c5c97":1}}}