{"teams":[{"id":122,"slug":"renegades","name":"Renegades","guid":"be6eff04-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/renegades-11rbdlso.png","acronym":"REN","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-05-31T12:19:31.000Z","bios":{"en_US":"<p>\nA band of former Misfits, Renegades stormed through the 2015 NA Challenger Series and into the NA LCS within a year of their founding. Their success in the NACS was largely attributed to superior map and objective control, not individual laning talent, but don't let that fool you. Former Moscow 5 star Alexey \"Alex Ich\" Ichetovkin and former Team Dignitas star (and prophet) Alberto \"Crumbz\" Rengifo bring their fair share of experience and mechanical skill to the REN lineup. Combined with the stellar bot lane duo of Aleš \"Freeze\" Kněžínek and support Maria \"Remi\" Creveling, the Renegades ongoing success seems almost inevitable.\n</p>\n<p>\nCoach: David Tu\n</p>","fr_FR":"<p>Anciennement connus sous le nom de Misfits, les Renegades ont balayé leurs adversaires lors des Challenger Series NA 2015 et se sont qualifiés pour les LCS NA seulement un an après leur fondation. Leur succès lors des CS NA a été largement attribué à leur meilleur contrôle de la carte et des objectifs, et non à leur talent individuel en phase de laning, mais ne vous laissez pas abuser. L'ancienne star de Moscow 5, Alexy « Alex Ich » Ichetovkin et l'ancienne star (et prophète) de Team Dignitas, Alberto « Crumbz » Rengifo, ont apporté leur lot d'expérience et de maîtrise des mécaniques de jeu à l'équipe. Si l'on combine ces atouts certains au talentueux duo formé par Aleš « Freeze » Kněžínek et son support Maria « Remi » Creveling en voie du bas, le succès des Renegades semble assuré.</p>","pl_PL":"<p>Renegaci z Los Angeles wywodzą się z zespołu Misfits, który został założony na początku marca 2015. Twórcą był Chris \"Doombang\" Badawi, były prawnik patentowy z Nowego Jorku. W wywiadzie dla the Score e-sports wyjawił co przekonało go do takiego kroku. Pewnego dnia miał wypadek samochodowy, tak poważny, że z trudem udało mu się pozostać przy życiu. To skłoniło go do weryfikacji swojego życia – „Doombang” stwierdził, że nie chce być prawnikiem, bo w głębi duszy zawsze był graczem. Pierwotnie chciał kupić Curse Academy, ale skończyło się to tylko zdobyciem wielu przydatnych kontaktów w społeczeństwie League of Legends. </p>\n<p>\nWkrótce potem Chris Badawi zaprosił do rozmów Alberta \"Crumbz\" Rengifa, przyszłego kapitana LA Renegades, żeby podyskutować o stworzeniu nowej organizacji. Okazało się, że doskonale się rozumieją w kategorii idei, jak ma taki zespół wyglądać. Według filozofii Chrisa LA Renegades ma być drużyną, którą nie jest odbierana jako firma, tylko rodzina. To ma być miejsce gdzie każdy członek kocha i jest dumny z tego co robi, zamiast czuć nieustającą presję. \"Crumbz\" zaproponował Alexeya \"Alex Ich\" Ichetovkina jako kolejnego uczestnika tego projektu, którego \"Doombang\" przyjął z olbrzymim entuzjazmem. Tych trzech pasjonatów, połączonych wspólnym celem, zaczęło współpracę żeby niebawem ogłosić utworzenie Misfits. <p/>\n<p>\nPierwsza połowa 2015 roku przyniosła zespołowi wiele zmian. Przede wszystkim udało mu się dostać do 2015 NA Challenger Series, po trzech zwycięskich spotkaniach o wyniku 2:0. Zbiegło się to  w czasie ze zmianami w samej organizacji. Drużyna została przemianowana z Misfits na LA Renegades. Powszechnie znany prezenter, Christopher \"MonteCristo\" Mykles, dołączył do drużyny jako współwłaściciel. Pojawienie się kolejnej bardzo dobrze znanej twarzy zasiliło powiększające się, olbrzymie już grono kibiców tej drużyny. W międzyczasie Chris \"Doombang\" Badawi wywołał aferę w społeczeństwie League of Legends, w efekcie czego został wykluczony z uczestnictwa w LCS do końca sezonu 2016. </p>\n<p>\nPomimo tego, że na pierwszy rzut oka gracze z LA Renegades wydawali się przypadkową zbieranią, osiągnęli już swoje pierwsze sukcesy. Skończyli 2015 NA Challenger Series na drugim miejscu, po przegraniu dogrywki z Team Coast, z wynikiem 8:2. Jednak najważniejszym triumfem dla nich były rozgrywki kwalifikacjyjne do NA LCS. Renegaci zmierzyli się z najpoważniejszymi konkurentami z Challenger series. Najpierw wygrali z Team Imagine 2 do 1, a następnie w żazartej walce z Team Coast 3 do 2. Dzięki temu udało im się zrealizować ich najważniejszy cel – dostać się do wiosennego sezonu NA LCS 2016.</p>\n"},"foreignIds":{"drupalId":"4429"},"players":[144,160,272,323,501,680,784],"starters":[144,160,501,680],"subs":[272,323,784]},{"id":167,"slug":"nrg-esports","name":"NRG Esports","guid":"be704c38-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/nrg-esports-2hxi3sw4.png","acronym":"NRG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:14:08.000Z","updatedAt":"2016-09-17T19:38:10.000Z","bios":{"de_DE":"<p>„NRG“ ist ein sogenanntes Gramogramm, eine Verkettung aus Buchstaben, die einzeln ausgesprochen zusammen wie ein Wort klingen – In diesem Fall ist dies das englische Wort Energy. Energiegeladen ist das Team allemal, wenn man sich dessen fünf Spieler anschaut. Ende 2015 wurde das Team unter der Führung von Gerard Kelly, Mark Mastrov, und Andy Miller gegründet, mit dem Ziel die Spitze der NA LCS zu erreichen und schließlich zur Weltmeisterschaft 2016 zu fahren. NRG ist keine Organisation, welche sich mithilfe von jungen Einzelranglistentalenten durch die NA Challenger Series gekämpft hat. Vielmehr besteht das Team aus altbackenen Veteranen, wilden Grünschnabel und etwas mittendrin. </p>\t\n\n<p>Eon-Young “Impact” Jeong und Changseok „GBM“ Lee sind zum einen die gebürtigen Koreaner und zum anderen die alten Herren unter den fünf Freunden. Sie haben viele Jahre Erfahrung auf dem Buckel und weisen den Schülern ihren Weg durch ihre eSports-Karriere. Johnny „Altec“ Ru spielte seit 2012 bereits unter vielen Bannern, doch einen internationalen Namen konnte er sich bisher noch nicht machen. An der Seite der zweieinhalb Veteranen stehen Galen „Moon“ Holgate und Kevin „KonKwon“ Kwon, welche noch im LCS-Rampenlicht zu stehen haben, zumindest mehr als vier Spiele. </p>\n\n<p>Auch das Team ist der Community nicht unbekannt. Tadayoshi \"Hermit\" Littleton war im Sommer 2015 noch der Analyst und Trainer Origens und ist nun der Strategiechef bei seinem neuen Zuhause. Charlie „Charlie“ Lipsie, ehemaliger Cloud9-Analyst besetzt die Cheftrainerstelle und Chad \"HISTORY TEACHER\" Smeltz hat seine Streaming-Persönlichkeit aufgegeben, um nun als NRGs Geschäftsführer zu fungieren. </p>\n\n<p>Die Frage ist wie bei vielen Mannschaften verschiedener Sprachen: Wie kommunizieren die Spieler eigentlich untereinander? Impact besitzt nach seinem einjährigen Aufenthalt in Nordamerika bereits über angemessene Englischkenntnisse, welche wiederum nur die nötigsten Wörter und Begriffe abdecken. GBMs Englisch lässt (noch) zu wünschen übrig und weder Altec noch Moon können koreanisch. Doch KonKwon macht das Team möglich. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat. Entweder sprachen alle Spieler eine gemeinsame oder die Kommunikation vereinfachte sich auf simple Ping-Signale. Da KonKwon als Kind in Seoul, Korea, aufgewachsen ist und mit acht Jahren in die USA zog, ist er bilingual und bildet so eine Brücke zwischen den zwei Sprachgruppen im Team. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat.  Wie der Knoten in der Mitte einer Fliege. </p>\n\n<p>Ganz im Ernst: Schaut doch mal auf die Uniformen NRGs. Die sind doch verdammt niedlich, oder? Wie kann man dieses Team und ihre bunten Fliegen nicht mögen? </p>\n","fr_FR":"<p>NRG fait son entrée dans les LCS avec une composition qui a de quoi faire peur. L'équipe a rassemblé certains des meilleurs vétérans et plusieurs des étoiles montantes les plus prometteuses de Corée et d'Amérique du Nord. D'anciens joueurs des LCK comme Chang-suk « GankedByMom » Lee et Eon-young « Impact » Jeong se retrouvent ainsi aux côtés de talents locaux comme Jonny « Altec » Ru. En fin de compte, leurs plus terribles adversaires pourraient bien être... eux-mêmes ! Composer une équipe qui mélange plusieurs cultures et langues différentes n'est pas un mince exploit. Toutefois, avec un tel niveau de maîtrise des mécaniques de jeu dans une seule équipe, on peut s'attendre à ce que RNG fasse sensation.</p>","pl_PL":"<p>Udział w wiosennym sezonie 2016 to debiut organizacji NRG Esports. Została założona, przez Andy’iego Millera i Marka Mastrova, dwóch współwłaścicieli Sacramento King’s – drużyny NBA. Ogłoszenie o powstaniu tej drużyny miało miejsce wkrótce po zakończeniu Mistrzostw Świata - 16 listopada 2015. Założyciele zdecydowali się przenieść swoje doświadczenie ze świata sportów klasycznych do profesjonalnych rozgrywek w League of Legends. Na swojej stronie NRG Esports zapowiedziało, że po debiucie będą dążyć do zdobycia podium NA LCS. Potem ich cel jest tylko jeden – Mistrzostwa Świata 2016.</p>\n<p>\nJak do tego doszło? W wywiadzie Andy Miller udzielił odpowiedzi na wiele nurtujących pytań dotyczących powstania NRG Esports. Opowiadał o tym jak dowiedział się o League of Legends: dwójka jego synów zainteresowała się League of Legends, a on, przysłuchując się im, stwierdził „Wow, to naprawdę interesujące i mainstreamowe!” Akurat wtedy skończył budowę nowego obiektu dla swojej drużyny NBA i zaczął się zastanawiać, dlaczego miałby się ograniczać tylko do klasycznych sportów. Od myśli do czynów, po 6 miesiącach poszukiwań Andy Miller zakupił drużynę Team Coast \ni założył organizację, która zajęła jej miejsce. Całość odbyła się dzięki pomocy Gerarda Kelliego, właściciela Team Imagine, który podzielił się z nim swoją wiedzą na temat gry, zespołów i organizacji. Współwłaściciel NRG Esports wyraził chęć zaangażowania się w marketing związany z League of Legends i zawodnikami, jako przykład podając swoje dotychczasowe sukcesy w świecie sportu. Zapowiedział również, że zamierza użyć doświadczenia zdobytego podczas zarządzania drużyną NBA, do promowania zawodników. Marzy o tym żeby zobaczyć tłumy fanów w koszulkach NRG Esports. Andy Miller już pokochał swoją drużynę. </p>\n<p>\nKolejna cecha charakterystyczna NRG Esports to jej załoga. Członkowie organizacji mają niesamowite zaplecze i wprawę w prowadzeniu profesjonalnej drużyny. Andy Miller i Mark Mastrov nie oszczędzali - wybrali najlepszych dostępnych specjalistów we wszystkich dziedzinach związanych z League of Legends. Dyrektorem generalnym jest Gerard Kelly, założyciel Team Imagine, który prawie dostał się do NA LCS. Jego doświadczenie będzie podstawą dla działań całej organizacji. Menadżerem został Chad “HISTORY TEACHER” Smeltz, dobrze wszystkim znany z opieki nad Team8. Dołączą do niego sławy takie jak: Tadayoshi “Hermit” Littleton, były instruktor Origen i Charlie “Charlie” Lipsie, były trener Cloud9. Wpływ wyżej wymienionych panów widać na występie ich byłych zespołów na Mistrzostwach Świata 2015. Drużyna Origen dostała się aż do półfinału, a Cloud9 pokazało klasę w pierwszym tygodniu meczy grupowych. Taka obsada personelu ma zapewnić graczom możliwie najlepszą kuratelę, żeby mieli pierwszorzędne warunki do rozwoju. Nic tylko pozazdrościć takiej kadry.</p>\n<p>\nNajważniejszym elementem nowej drużyny, z którym fani będą mieli najwięcej do czynienia, są oczywiście zawodnicy. Współzałożyciele NRG Esports wyszli z założenia, że ich perfekcjonizm musi również mieć odniesienie do graczy. Gerard Kelly odpowiada za wybór i zajmuje się rekrutacją najlepszych ze e-sportowców. Wraz z Andym Millerem rozważają nawet rozszerzenie organizacji o oddziały zajmujące się innymi grami. NRG Esports jako organizacja ma wszystko czego potrzeba do stania się potęgą w NA LCS – kochających właścicieli i troskliwą załogę. \n</p>","en_US":"<p>\nNRG entered the NA LCS 2016 Spring Split with a bang, going 3-0 in their first games. Unfortunately, while the roster they put together was jam packed with mechanical talent, they weren’t able to keep their success going. They’re taking a new approach for Summer: only Chang-suk “GankedByMom” Lee remains (along with his bowtie and shade wearing aesthetic), while the rest of the team has been replaced with some of the most dynamic personalities and fan favourites in North America. Quas? Check. Kiwikid? Check. Santorin? Check. Will they be able to translate the likability factor into results? Only time will tell. But at the very least they’ll be a blast to cheer for.\n</p>\n<p>\nCoach: Tadayoshi \"Hermit\" Littleton\n</p>"},"foreignIds":{},"players":[117,121,150,159,169,185,759],"starters":[121,150,159,185,759],"subs":[117,169]}],"players":[{"id":117,"slug":"otter","name":"Otter","firstName":"Brian","lastName":"Thomas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/otter-diqco9ek.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2016-05-23T19:16:51.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"341","TRLH2":"1001090004","TRLH1":"1001090008","FRA1TMNT1":"375280"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":150,"slug":"kiwikid","name":"Kiwikid","firstName":"Alan","lastName":"Nguyen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kiwikid-hrcovlc7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2016-06-09T21:08:33.000Z","bios":{"en_US":"<p>\nSome legends are remembered for their epic plays, some legends are remembered for their trophies, and others are remembered because well... they’re just so likable! Say hello to Alan “KiWiKiD’ Nguyen, but if you’ve watched nearly any NA LCS broadcast, you’ve already met him. He’s the support for Team Dignitas, or he was until they were knocked out of the NA LCS during the 2016 NA LCS Summer Promotion Tournament. For a sad while, it looked like we might be without our beloved KiWiKiD, but NRG brought him aboard. It wasn’t just because he’s a great chum, he’s also capable of great plays. He’s well known for locking down enemy teams with champions like Annie and Alistar. Sometimes he goes too aggressive or makes a misplay, but he’s always a delight to watch.\n</p>","fr_FR":"<p>Alan « KiWiKiD » Nguyen sera le support de Dignitas pour la saison 6 des LCS. Tout sauf une surprise tant le joueur est un pilier de l'équipe. Il y est en effet depuis 2012, d'abord comme top laner tout au long de la saison 3 puis au poste de support depuis.</p>\n\n<p>Très controversé comme top laner (il détient l'honneur douteux d'être le joueur le plus souvent mort en saison 3, tous postes confondus) le joueur américain a continué d'être sous le feu des critiques lors de sa transition vers son nouveau poste au début de la saison 4. Malgré tout, il a su faire le dos rond et continuer de se concentrer sur son jeu. Alors que d'autres joueurs ont été poussés à la retraite anticipée, incapables de gérer la pression du public, KiWiKiD a toujours semblé imperméable aux remarques et a continué de s'améliorer à son rythme. Bien lui en a pris puisque s'il n'est toujours pas considéré comme un joueur de classe mondiale, loin s'en faut, l'opinion générale s'accorde aujourd'hui sur le fait qu'il a largement le niveau pour jouer dans les LCS NA.</p>\n\n<p>Véritable roc de Dignitas du haut de ses 22 ans, il parvient bien souvent à imposer sa pression sur toute la carte depuis la voie du bas, notamment lorsqu’il peut incarner des supports ayant une forte capacité à engager le combat. Il aime particulièrement prendre l'initiative avec des personnages comme Nautilus ou Tresh qui peuvent se jeter au cœur de la bataille et résister aux assauts de la ligne de front adverse. Cette année encore et cette fois au côté de Apollo « Apollo » Price en voie du bas, ce sera à lui de porter son équipe par son expérience. Dans l'espoir de peut-être enfin côtoyer les sommets et donner à nouveau tort à toutes les critiques.</p>\n","pl_PL":"<p>Zawodnik powszechnie utożsamiany z Team Dignitas, dzięki jego długiemu stażowi w tej organizacji. Przed uzupełnieniem szeregów tej drużyny grał tylko przez ponad rok w UT Austin, uczelnianej drużynie z Texasu. Pochodzi z Austin, w Texasie, więc po prostu brał udział w lokalnych rozgrywkach. W tamtych czasach \"KiWiKiD\" był znany z agresywnego stylu gry. Został zwerbowany do Team Dignitas w grudniu 2012 roku, ze względu na ban ówczesnego junglera. „Crumbzz” przeniósł się do jungli, a Alan Nguyen zastąpił go na top-lanie. </p>\n<p>\nPo wejściu Alana w jego skład, Team Dignitas automatycznie zakwalifikował się do wiosennego sezonu NA LCS 2013. \"KiWiKiD\" brał udział w 3,4 i 5 sezonie NA LCS, co jest niezwykłym osiągnięciem. Na dodatek cały ten czas był w jednej drużynie, co świadczy o niezmienności i stabilności tego zawodnika. Jedyną poważną zmianą było przeniesienie się z pozycji na top-lanie na rolę supporta pod koniec sezonu trzeciego. Dobrze czuje się jako wspierający, aczkolwiek jego ulubionymi postaciami pozostał Renekton i Rumble, co przypomina o jego starej miłości do górnej linii. Na bot-lanie najchętniej gra bohaterami, którzy mają znaczne możliwości kontrolowania przeciwników, jak Thresh, Alistar i Annie. Zyskał znaczącą sławę, dokonując pięcioosobowego podbicia Minotaurem w grze przeciwko Team Fusion. Ponadto jego rozpoznawalność wzrosła kiedy był gościem wśród analityków.</p>\n<p>\nAlan pytany przez rodziców kim zostanie jak dorośnie odpowiadał: profesjonalnym graczem. Gdy wtedy żartował w ten sposób, nie wiedział jak dobrze trafił. Cały czas uważa to za zabawne, jak się potoczył jego los. Kiedy dostał smsa od Williama \"scarra\" Li’a ucieszył się, ale też bał się, że zostanie oszukany. Tym bardziej, że miał się przeprowadzić do Kaliforni. Od razu pochwalił się wszystkim swoim bliskim i okazało się, że rodzice Alana są bardzo zawiedzeni tą wiadomością. Na początku byli bardzo przeciwni, ale to się na szczęście zmieniło z czasem. Pomimo ich opinii na ten temat, \"KiWiKiD\" spakował się w ciągu 30 minut, wsiadł w auto i pojechał na spotkanie przygody z esportową sceną. Teraz uważa, że to co zrobił było trochę szalone, ale bez tego nie osiągnąłby sukcesu.</p>\n"},"foreignIds":{"drupalId":"21","TRLH1":"1001220077","TRLH2":"1001160127"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":169,"slug":"mancloud","name":"mancloud","firstName":"Zachary","lastName":"Hoschar","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/mancloud-6o5eeywa.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2016-08-04T18:26:08.000Z","bios":{"en_US":"Zachary \"mancloud\" Hoschar has showcased his skills as XDG's Mid Lane since the foundation of mTw.NA. Maintaining a varied champion pool, mancloud frequently breaks from convention. His style is a versatile one, playing aggressively, passively, pushing and roaming, all with the intent to counter his opponents’ tactics. When left to his own devices, he often defaults to his excellent Karthus play to carry his team to victory."},"foreignIds":{"drupalId":"36","TRLH1":"1001060001","TRLH2":"1001050002"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":167},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":501,"slug":"ninja","name":"Ninja","firstName":"Geon-woo","lastName":"Noh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ninja-4csesuls.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-30T02:20:51.000Z","bios":{"en_US":"<p>Geon-woo \"Ninja\" Noh was originally meant to be a loan from to the Dragon Knights, but North America seems to agree with him. These days Ninja is most often found with his partner in fun Seraph, and the two solo laners have built up a great dynamic. Team Envy snapped up the duo in 2016 with the hope that giving the old friends a fresh start would propel their new team to victory. Their gamble paid off in the form of Team Envy making the playoffs in their inaugural split together. The team will bank on Ninja and Seraph’s chemistry growing and landing them right back where they want to be -- the playoffs.</p>","de_DE":"Geon-woo „Ninja“ Noh war ursprünglich eine Leihgabe der Dragon Knights, aber Nordamerika scheint ihm zu liegen. Heutzutage trifft man Ninja meistens mit seinem Freund Seraph zusammen an und die beiden Solo-Laner harmonieren großartig. Team Envy verpflichtete das Duo 2016 in der Hoffnung, dass die beiden Freunde ihre neue Mannschaft zum Sieg führen würden. Und ihr Wagnis machte sich bezahlt, als Team Envy gleich im ersten Split die Entscheidungsspiele erreichte. Die Mannschaft hofft darauf, dass Ninjas und Seraphs Harmonie noch besser geworden ist und sie wieder dorthin führen wird, wo sie sein wollen: in die Entscheidungsspiele."},"foreignIds":{"drupalId":"2143","TRLH1":"200000226","TRLH2":"200000130"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":759,"slug":"gbm","name":"GBM","firstName":"Chang-suk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gbm-o8g887p.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-28T01:24:16.000Z","bios":{"en_US":"","fr_FR":"<p>Ne lui donnez surtout pas Orianna. S'il y a une leçon que tous ceux qui affrontent GBM finissent par \n\nretenir, c'est qu'il ne faut jamais, <em>au grand jamais</em> donner à Chang-seok « GBM » Lee son \n\nchampion préféré, la Demoiselle mécanique. Certaines équipes ont commis cette erreur lors du segment \n\nd'été des LCK 2015, et elles se sont retrouvées face à un monstre avec un KDA de 22. Si GBM parvient à \n\nmaîtriser quelques autres champions aussi bien qu'Orianna, il sera à n'en pas douter un joueur des plus \n\nredoutables sur la voie du milieu.</p>\n\n<p>GBM aura peut-être une nouvelle chance d'exceller avec son champion de prédilection maintenant qu'il \n\nest passé aux LCS NA pendant l'intersaison 2015. C'est un tout autre monde, rempli de mid laners qui ne \n\nsavent pas encore ce dont GBM est capable.</p>","pl_PL":"<p>Mid-laner NRG Esports nie był bardzo popularny poza Koreą – swoją legendę w Ameryce zaczął pisać 16.11.2015, w momencie dołączenia do drużyny Gerarda Kelliego. Jego debiut w NA LCS to wiosenny sezon 2016. W swojej ojczyźnie był uważany za jednego z najlepszych graczy na środkowej alei. Lee \"GBM\" Chang-seok był członkiem dobrze znanych zespołów: CJ Entus Frost i Jin Air Green Wings, więc nie można odmówić mu doświadczenia w grze na najwyższym poziomie. Olbrzymi wpływ na jego rozwój mieli Kang \"Ambition\" Chan-yong i Jung \"RapidStar\" Min-sung. Jungler CJ Entus zainspirował „GBM” do nauki gry Orianną, do wejścia na sam szczyt w pierwszym sezonie. Motywacja była tak silna, że do dzisiaj jest powszechnie uważany za jedną z najlepszych Mechanicznych Baletnic na świecie. Z tego też powodu często jest nazywany „mistrzem Orianny”. Z kolei, emerytowany już, legendarny \"RapidStar\" był jednym z bliższych przyjaciół Lee’a Chang-seoka. Wzajemnie się uczyli, razem ćwiczyli nowe zagrania i dzielili rolę mid-lanera w CJ Entus. Takiego kolegi pozazdrościłby każdy gracz.</p>\n<p>\nWiele osób może się zastanawiać co oznacza przydomek mid-lanera NRG Esports, który na pierwszy rzut oka przypomina przypadkowy zlepek liter. Tymczasem on ma długą i zabawną historię. „GBM” to pierwsze litery oryginalnego nicka Lee’a Chang-seoka – „Ganked By Mom”. Młody Koreańczyk zdecydował się na taki pseudonim, ze względu na to, że został wielokrotnie przyłapany w środku nocy przez swoją matkę na grze w League of Legends. Pierwotnie brzmiał on „mom critical”, ale ze względu liczną publikę z zachodu został zmieniony na „zgankowany przez matkę”. Jak widać troska kochających matek koliduje z planami również wielkich graczy.</p>\n<p>\nJego zasób bohaterów poraża swoim rozmiarem. W piątym sezonie grał ponad 10 różnymi postaciami, a tylko tyloma prawdopodobnie ze względu na ich siłę w obecnej mecie. Oprócz zjawiskowej gry Orianną, wyróżnił się niezwykle skuteczną grą Viktorem i Lulu. Można śmiało powiedzieć, że „GBM” był w lidze koreańskiej jednym z poważanych i uniwersalnych mid-lanerów. Wykształcił swój talent wśród najlepszych i z takim nastawieniem przyjechał do Ameryki. Organizacja NRG, zaraz po ogłoszeniu swojego istnienia, umieściła na stronie jego słowa: „Moim celem jest zawsze być numerem jeden”. W nastawieniu Lee’a \"GBM\" Chang-seoka nie ma niedopowiedzeń.\n</p>","de_DE":"<p>Chang-suk „GBM“ Lee geht 2017 neue Wege. Er hat eine neue Mannschaft, nennt eine neue Region sein Zuhause und spielt auf einer neuen Position. Als seine ehemalige Mannschaft, NRG Esports, aus der NA LCS abstieg, begab sich der langjährige Mid-Laner auf die Reise über den großen Teich, um sich Team Vitality anzuschließen und dort um die Junglerposition zu kämpfen.\n\nEr mutet sich viel zu, denn er will in kürzester Zeit eine neue Rolle lernen und sich auf die LCS vorbereiten, aber GBM sucht im neuen Jahr die Herausforderung. Aber egal, ob er oder Djoko schlussendlich als Jungler eingesetzt wird, der Gewinner ist in jedem Fall Team Vitality.</p>"},"foreignIds":{"drupalId":"2160","TRLH3":"200000129","TRLH4":"200000227","ESPORTSTMNT02":"200002218","TRLH1":"200000714"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":784,"slug":"leonyx","name":"Leonyx","firstName":"Rob","lastName":"Lee","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/leonyx-86twbq9h.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:47.000Z","updatedAt":"2017-01-19T22:25:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4563","TRLH1":"200000223","TRLH2":"200000127"},"socialNetworks":{},"champions":[],"liveGameTeam":122}],"scheduleItems":[{"id":"AVIUhnC4OPWArxM1l4YL","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:595576ab-268c-4654-9647-3c0a0e840469","scheduledTime":"2016-01-17T20:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"1","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"595576ab-268c-4654-9647-3c0a0e840469","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"c7d41c87-ff11-4f19-a27e-fdf59cafdc26","gameHash":"fdbda4f42ae325fa"}],"videos":[{"id":445,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:c7d41c87-ff11-4f19-a27e-fdf59cafdc26","source":"https://www.youtube.com/embed/TBvBkSWJRxg?wmode=transparent","createdAt":"2016-01-17T22:26:26.000Z","updatedAt":"2016-01-17T22:26:26.000Z","game":"c7d41c87-ff11-4f19-a27e-fdf59cafdc26"},{"id":485,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:c7d41c87-ff11-4f19-a27e-fdf59cafdc26","source":"https://www.youtube.com/embed/_TlycV_f4Os","createdAt":"2016-01-20T13:17:26.000Z","updatedAt":"2016-01-20T13:17:26.000Z","game":"c7d41c87-ff11-4f19-a27e-fdf59cafdc26"}],"htmlBlocks":[],"match":{"id":"595576ab-268c-4654-9647-3c0a0e840469","name":"REN-vs-NRG","position":17,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],"games":{"c7d41c87-ff11-4f19-a27e-fdf59cafdc26":{"id":"c7d41c87-ff11-4f19-a27e-fdf59cafdc26","name":"G1","generatedName":"NRG|REN|G1|595576ab268c4654964","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],"standings":{"result":[[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}]],"timestamp":1453064597237,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001510104","gameRealm":"TRLH1","platformId":"TRLH1:1001510104","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7b9b56fe-5423-4b5c-9613-b58537185323"}],[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}]],"timestamp":1453064597237,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}