{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":165,"slug":"vitality","name":"Team Vitality","guid":"be6fe2a1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vitality-2eb9w6iv.png","acronym":"VIT","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:57:43.000Z","updatedAt":"2017-06-30T14:09:41.000Z","bios":{"de_DE":"<p>Für Team Vitality geht es 2017 vor allem um Beständigkeit. Die Mannschaft beendete den Sommer-Split der EU LCS 2016 mit neun Unentschieden, dem Höchstwert der Liga. Sie landeten auf dem siebten Platz, wodurch sie zwar dem Frühjahrs-Aufstiegsturnier entgingen, aber nicht in die Entscheidungsspiele einziehen konnten.\n\nVitality hat sich für das neue Jahr Verstärkung auf der unteren Lane geholt. Mit Steeelback und Hachani und einem neuen Liga-Format, durch das es keine Unentschieden mehr gibt, ist Vitality in dieser Saison dafür prädestiniert, mehr Siege einzufahren.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Mannschaftsleiter: Michael \"Garki\" Bolze</p>","pl_PL":"<p>Vitality to francuska organizacja znana do tej pory głównie na scenie gier FPS, która postanowiła jednak zainwestować także w dywizję League of Legends. 9 grudnia 2015 roku ogłosiła ona odkupienie miejsca od zasłużonego Gambit Gaming. Niemal od razu do organizacji dołączył Raymond „KaSing” Tsang, który ostatecznie nie doszedł do porozumienia z Team SoloMid. To właśnie wokół angielskiego wspierającego został zbudowany zespół i 14 grudnia 2015 roku formacja ogłosiła tożsamość pozostałych zawodników. Miejsce na górnej alei zajął uznawany za jednego z najlepszych, o ile nie najlepszego, górnych w Europie – Francuz Lucas „Cabochard” Simon-Meslet. Środkową linię wypełnił Erlend „Nukeduck” Holm, który opuścił Team ROCCAT. Nowym dżunglerem został znany z występów w Copenhagen Wolves i Elements Ilyas „Shook” Hartsema. Tymczasem partnerem KaSinga na dolnej alei został Petter „Hjärnan” Freyschuss, z którym Anglik występował już w H2k. Trenerem zespołu ogłoszono znanego ze współpracy z Gambitem w letnim splicie 2014 byłego dżunglera, Kévina „Shaunza” Ghanbarzadeha. Drużynie udało się zbudować mocny skład i cel formacji na wiosnę 2016 to z pewnością walka o najwyższe cele.</p>\n<p>W wiosennym splicie EU LCS 2016 drużyna Team Vitality zadziwiła wszystkich fanów. Przygotowanie graczy do rozgrywek było godne podziwu, patrząc na wiek organizacji. Ten świeży zespół rozpoczął ten okres od zajęcia czwartego miejsca w pierwszym tygodniu i do samego końca nie spadł niżej. Jego wyniki były o tyle imponujące, że udało mu się czterokrotnie skończyć tydzień, wygrywając oba mecze. Natomiast ani razu drużyna Team Vitality nie przegrała obydwóch spotkań, dzięki czemu skończyła wiosenny split EU LCS 2016 na podium. Zajęcie zaszczytnego trzeciego miejsca było efektem 13 zwycięstw i zaledwie 5 porażek. Jednak to nie koniec laurów zebranych przez zespół. Zawodnicy Team Vitality otrzymali nagrodę najbardziej wartościowych graczy w piątym i szóstym tygodniu. Ponadto górny i wspierający zostali wyróżnieni w zestawieniu najbardziej profesjonalnych graczy. Powyższe osiągnięcia najlepiej oddaje współczynnik ZZA członków Team Vitality – wszyscy znaleźli się w pierwszej czwórce graczy w kategorii swojej własnej roli.</p>\n<p>Po tak udanych występach fani spodziewali się fantastycznego występu na wiosennych rozgrywkach barażowych EU LCS 2016. Jednak zespół Team Vitality poległ już w pierwszym spotkaniu, ulegając najstarszemu w lidze – Fnatic. Przegrana była o tyle bolesna, że pomimo wcześniejszych wysiłków organizacja znalazła się na piątym miejscu ex aequo. W przerwie przed rozpoczęciem letniego splitu EU LCS 2016 zostały podjęte decyzje o zmianie składu drużyny. Biorąc przykład z innych organizacji, Team Vitality zdecydowała się na podpisanie kontraktu z dwoma zawodnikami wywodzącymi się z Korei Południowej. Jednak w odróżnieniu od wielu innych, potrafili się sprawnie komunikować w języku angielskim, więc od razu przeszli do treningów, aby w nadchodzącym splicie osiągnąć jeszcze lepszy wynik.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Menedżer drużyny: Michael \"Garki\" Bolze</p>","en_US":"<p>For Team Vitality, consistency will be the name of the game in 2017. The team finished with 9 match ties in the 2016 EU LCS Summer Split, the most in the league. That landed them in 7th place for the split, allowing them to avoid the Spring Promotion Tournament but leaving them out of the playoffs.</p>\n\n<p>With a new year upon them, Vitality has upgraded their bot lane. With Steeelback and Hachani lining up down south, and with a new league format that eliminates ties, Vitality is primed to pick up some more W’s this season.</p>\n<p>Head Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Team Manager: Michael \"Garki\" Bolze</p>\n","es_ES":"<p>Ni llegaron a tiempo a la cita del 5 de noviembre ni hacen uso de la letra V como llamada a la venganza, sino a la victoria, pero si algo comparte Team Vitality con la novela gráfica de de Alan Moore y David Lloyd es la intención de hacer saltar algo por los aires. En este caso, la LCS EU.</p>\n\n<p>La organización francesa, conocida sobre todo por sus escuadras de Call of Duty, ha aprovechado la inadaptación de Gambit Gaming con respecto al desarrollo de la industria de los deportes electrónicos para expandir sus horizontes mediante la adquisición de su plaza en la máxima competición continental.</p>\n\n<p>La falta de experiencia en la Grieta del Invocador no ha supuesto un problema para Team Vitality a la hora de confeccionar su alineación explosiva, que mezcla veteranía y potencial. El buen hacer de los galos en otras disciplinas se ha traducido en una gran reputación que, junto a una fuerte inversión deportiva, ha actuado como aval en el proceso de seducción de algunos de los mejores talentos de Europa con el objetivo de dinamitar la clasificación.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Jefe de equipo: Michael \"Garki\" Bolze</p>","fr_FR":"<p>Vitality rejoint Splyce et G2 Esports dans le trio des nouvelles équipes participant aux LCS EU. Le cœur de la formation de Vitality semble être composé d'anciens talents d'H2K et de Gambit Gaming, avec notamment le top-laner Lucas « Cabochard » Simon-Meslet et le support Raymond « KaSing » Tsang. Vitality a également recueilli le coach de GMB, Kévin Ghanbarzadeh, dans l'espoir que son expérience aide à souder les membres de l'équipe. Si Vitality est nouvelle, ses joueurs ne le sont pas, eux, et ils savent exactement à quoi s'attendre durant le segment printanier des LCS EU 2016.</p> \n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Responsable d’équipe: Michael \"Garki\" Bolze</p>"},"foreignIds":{},"players":[84,190,205,328,384,1089,1704],"starters":[84,190,328,384,1089],"subs":[205,1704]}],"players":[{"id":84,"slug":"cabochard","name":"Cabochard","firstName":"Lucas ","lastName":"Simon-Meslet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cabochard-iak53xzd.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T10:49:06.000Z","bios":{"en_US":"<p>Lucas “Cabochard” Simon-Meslet is looking to get back into form for 2017. After an impressive performance in the 2016 EU LCS Spring Split, Cabochard regressed last summer. He still put up some nice games on Irelia and Fiora, but like the rest of Vitality he failed to find consistency.</p>\n\n<p>Entering 2017 armed with a new botlane, Cabochard will aim to make an impact and return to his Spring Split self. Not usually one to perform as well on tanks, if Cabochard is allowed to focus on dealing damage, he should have no problem dispensing with his opponents in the top lane.</p>","de_DE":"<p>Lucas „Cabochard“ Simon-Meslet wird 2017 versuchen, seine alte Form wiederzufinden. Nach einer beeindruckenden Vorstellung im Frühjahrs-Split der EU LCS 2016 ging es für Cabochard im letzten Sommer bergab. Er lieferte zwar mit Irelia und Fiora ein paar ansprechende Leistungen ab, aber ihm fehlte wie dem Rest von Vitality die Beständigkeit. \n\n2017 beginnt mit einem neuen Duo auf der unteren Lane und Cabochard wird versuchen, wieder zu seiner Form aus dem Frühjahrs-Split 2016 zurückzufinden. Cabochard liefert mit Tanks zwar nicht die besten Leistungen ab, aber wenn er sich auf Schaden verursachende Champions konzentrieren kann, wird er mit seinen Gegner auf der oberen Lane Schlitten fahren.</p>","fr_FR":"<p>Durant l'intersaison 2015, Lucas « Cabochard » Simon-Meslet a rejoint Team Vitality, une nouvelle organisation qui a acquis la place de Gambit aux LCS. Lorsqu'il était chez Gambit, Cabochard préférait grandement les champions AP, tels que Kennen et Morgana. Il a également joué avec quelques champions tanky, mais il revenait souvent à ses incroyables Fizz et Ryze. Bien que les performances de Cabochard aient diminué quelque peu vers la fin de la saison et aux play-offs, son potentiel restait suffisant pour lui garantir une place chez VIT en 2016.</p>","es_ES":"<p>Si bien es cierto que Lucas ‘Cabochard’ Simon-Meslet es un jugador agresivo que disfruta bajo la luz de los focos que apuntan al principal artífice de la victoria, en realidad no hace honor a la terquedad que su apodo le presupone al ser capaz de anteponer los intereses del colectivo a los suyos.</p>\n\n<p>De hecho, uno de los desafíos que se ha autoimpuesto con tal de estar a la altura de las expectativas en torno a su potencial es demostrar su versatilidad en la calle superior. El francés pasó de competir ocasionalmente junto a leyendas de la talla de Danil ‘Diamondprox’ Reshetnikov a, en cuestión de meses, amasar una ingente cantidad de recursos para liderar a aquellos a los que otrora admiraba.</p>\n\n<p>El protagonismo de Cabochard en Gambit Gaming se saldó con un éxito moderado, aunque no impidió que el joven se quedara con una espinita clavada ante la oportunidad perdida de clasificarse para los Playoffs de verano tras la polémica sanción a Konstantinos ‘FORG1VEN’ Tzortziou. De nada le sirvieron al joven jugador los elogios que propios y extraños dedicaban a sus actuaciones con campeones como Morgana, Kennen o Hecarim. Cabochard apuntó alto, pero acabó luchando por la permanencia en la máxima competición europea.</p>\n\n<p>Una vez conocido el éxito gracias a la conquista de la novena edición de la Intel Extreme Masters Colonia, Cabochard se ha unido a Team Vitality con el objetivo de hacer desaparecer de su paladar el agridulce sabor que le dejó creer que podría haber incluso participado en el Campeonato Mundial 2015 de contar con el tirador griego para reencontrarse con la miel de la victoria.</p>","pl_PL":"<p>18-letni, francuski top-laner swoją profesjonalną karierę rozpoczynał stosunkowo niedawno, bo w sierpniu 2013 roku. Początkowo występował w mniej znanych formacjach takich jak COREPLAY, GSI Gaming czy Heavy Botlane. Z tą ostatnią drużyną z całkiem niezłej strony zaprezentował się jednak w kwalifikacjach EU Challenger Series, odpadając dopiero w ostatnim meczu przeciwko faworytom zmagań. Co ciekawe, w GSI Gaming oraz HB Cabochard grał razem ze swoim bratem, Ugo „Istarim” Simon-Mesletem.</p>\n<p>\nPierwszym ważnym momentem w karierze francuskiego gracz był występ w piątym tygodniu letniego splitu EU LCS 2014, kiedy to Cabochard zastąpił mającego problemy z wizą Evgeny’ego \"Dariena\" Mazaeva. Cabochard zaprezentował się z niezłej strony i z pewnością miało to wpływ na to, że w miesiąc później otrzymał ofertę od pragnącego powrócić do elitarnych rozgrywek Ninjas in Pyjamas, na którego czele stał były mid-laner Gambitu Alexey „Alex Ich” Ichetovkin. Aspiracje te pozostały niespełnione, ale talent Francuza po raz kolejny dostrzegł Gambit, który tym razem szukał stałego zastępstwa dla Dariena. Był to drugi ważny moment w karierze francuskiego top-lanera. </p>\n<p>\nLucas do tego czasu był niezłym zawodnikiem, ale nie wyróżniał się zanadto nawet na tle rywali z Challenger Series. Tymczasem kiedy zaczął występować w EU LCS zrobił ogromny postęp i zaskoczył wszystkich, szybko stając się jednym z najlepszych graczy górnej alei na Starym Kontynencie. Co prawda Gambit spisywał się poniżej oczekiwań, ale jedyną osobą, do której kibice nie mogli mieć najmniejszych zastrzeżeń był właśnie Cabochard, który prezentował równą, wysoką formę przez cały 2015 rok. </p>\n<p>\nW tym czasie Francuz dał się poznać jako niesamowicie utalentowany mechanicznie zawodnik o bardzo szerokim champion poolu i jednocześnie gracz, który nie boi się niestandardowych rozwiązań. To właśnie on był pionierem, jeśli chodzi o wykorzystanie Gankplanka na profesjonalnej scenie – można powiedzieć, że grał piratem zanim jeszcze to było modne, bowiem wybierał tą postać jeszcze przed zmianami, które dotknęły bohatera.</p>\n<p>\nW letnim splicie EU LCS 2015 Cabochard najczęściej grał Hecarimem (4 razy) i Fizzem (trzykrotnie). Francuz był w tej edycji rozgrywek drugim najczęściej zabijającym top-lanerem i najlepiej farmiącym graczej górnej alei. W większości statystyk znajdował się na podium na swojej pozycji. Interesujący, choć nie do końca chwalebny, jest fakt, że zabierał też najwięcej złota drużynowego wśród zawodników górnej linii. Zdawałoby się to potwierdzać mentalność Cabocharda, który zawsze dąży do tego, by mieć duży wpływ na poczynania zespołu. Z tego powodu często prosi swoich dżunglerów o ganki, na co narzekali niektórzy jego byli koledzy z drużyny jak na przykład Tri Tin „K0u” Lam, z który Cabochard występował w barwach NiP. </p>\n<p>\nCo ciekawe, nick francuskiego top-lanera po francusku znaczy „uparty”, a motywacją do przyjęcia takiego właśnie pseudonimu dostarczyła zawodnikowi piosenka Cabochards autorstwa 25G i Setha Gueko.</p>"},"foreignIds":{"drupalId":"1489","TRLH3":"200000119","TRLH4":"200000222"},"socialNetworks":{"twitch":"www.twitch.tv/cabochardlol","facebook":"www.facebook.com/CabochardLol/","twitter":"https://twitter.com/CabochardLoL"},"champions":[],"liveGameTeam":165},{"id":190,"slug":"vander","name":"Vander","firstName":"Oskar","lastName":"Bogdan","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vander-edwzo382.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T10:57:12.000Z","bios":{"en_US":"<p>Oskar \"Vander\" Bogdan is one of the most veteran supports in the EU LCS. With a career that goes back to 2012, Vander has the experience any team would value in a support. After spending a split in the Challenger Series, he's making his return to the EU LCS as part of Team Vitality. He'll want to prove he's anything but past his prime as he leads Vitality in the 2017 EU LCS Summer Split.</p>","de_DE":"<p>Trotz seiner jungen 21 Jahre spielt Oskar „VandeR“ Bogdan seit 2011 kompetitiv League of Legends, also praktisch schon fast seit es das Spiel überhaupt gab. Erstes großes Aufsehen erregte er jedoch erst Ende 2013 mit der polnischen Mannschaft, bekannt als Kiedyś Miałem Team, kurz: KMT. Schon damals war sein heutiger Teamkamerad Marcin „Jankos“ Jankowski an seiner Seite und zusammen schafften sie es mit ihrer Mannschaft bis in die letzte Runde des Qualifikationsturniers für die EU LCS Spring 2014. Die fünf Polen spielten mit einem ruhigen Stil das Spiel und überzeugten vor allem in ihrer Zusammenarbeit und Synergie während Teamkämpfen. KMT schafften einen Davidsieg gegen Ninjas in Pyjamas und vollendeten ihre Reise in die EU LCS mit einem überzeugenden 3-0-Triumph.</p>\n\n<p>In zwei dieser drei Spiele, führte VandeR seine Künste auf Thresh vor, der Champion mit dem er sich bis heute einen Namen gemacht hat. Kurz darauf übernahm das allbekannte ROCCAT die Führung über das Supporttalent und seine Freunde. Ein großes Fragezeichen schwebte über dem Kopf des blonden Polens und nach der Begegnung gegen NIP wurden nicht allzu kleine Erwartungen gestellt. Tatsächlich bewies VandeR, dass es wirklich das Zeug zum LCS-Spieler hatte, als er in der vierten Woche der EU LCS Spring 2014 den wöchentlichen MVP-Titel gewann. Zudem bekamen seine Gegner einen weiteren Champion von ihm zu sehen, welcher ihnen zuvor noch nicht mit einer solchen Effektivität entgegengekommen ist: Morgana war der zweite Go-to-Pick VandeRs. </p>\n\n\n<p>Die Leistung in der ersten Saison wurde mit dem vierten Platz in der regulären Saison und dem dritten Platz in den Playoffs belohnt und ROCCAT hatte sich im europäischen oberen Mittelfeld eingelebt. </p>\n\n<p>Jedoch ging es seitdem bergab: ROCCAT schaffte es im darauffolgenden Sommer gerade so in die KO-Phase und schied letztendlich gegen den Turnierfinalisten Fnatic auszuscheiden. Ende 2014 wurde der schwach spielende  Paweł „Celaver“ Koprianiuk durch einen anderen Pawel ersetzt, nämlich Pawel “Woolite” Purski. Doch auch mit ihm gelang es VandeR im Frühling 2015 nicht die Top-Plätze der LCS zu erreichen, im Gegenteil: Er entging nur knapp der Relegation in die Challenger Series. Nach einer kurzen Pause drehte sein Mid-Laner Erlend “nukeduck” Holm auf und beschenkte dem nicht mehr ganz so polnischen Team Siege über Siege, bis sie es schließlich im Viertelfinale eine unerwartete Niederlage gegen Unicorns of Love erlitten. </p>\n\n<p>Ein letzter Pfad zur Weltmeisterschaft eröffnete sich durch das regionale Qualifikationsturnier, in welchem VandeR überragend spielte. Mit fünf verschiedenen Champions kämpfte er sich mit seinen Freunden bis in die zweite Runde des Turniers und ein fünftes Spiel gegen den Turniersieger Origen vor. Zwar verloren sie die Begegnung, doch es war ein klares Statement. 2016 könnte wieder ein Jahr sein, in dem VandeR zu VandeRLife mutiert und VandeRnoob hinter sich lässt.</p>\n\n<p>„Es gibt keinen offensiven oder defensiven Spielstil. Es gibt nur den richtigen“ – das ist sein Motto.</p>\n\n","pl_PL":"<p>Polski wspierający przeszedł długą drogę zanim udało mu się dostać do EU LCS I zostać jednym z najlepszych supportów na kontynencie. </p>\n\n<p>Początek jego kariery miał miejsce jeszcze w 2011 roku, w barwach organizacji Delta eSports, ale na dobre wszystko zaczęło się w rok później. Pomiędzy sierpniem 2012 roku a kwietniem 2013 Vander występował kolejno w polskim zespole EloHell, ale także w międzynarodowych formacjach, takich jak The Mighty Midgets, mousesports, Millenium czy Eternity Gaming. W międzyczasie wystartował też w kwalifikacjach do pierwszego splitu EU LCS w historii, ale jego zespół, Trudniej Już Nie Będzie, pożegnał się z rywalizacją już w fazie grupowej, po dwóch przegranych spotkaniach. Co ciekawe, aż do przygody z Eternity Gaming polski gracz pełnił rolę… strzelca i dopiero zmiany we wspomnianym zespole sprawiły, że zmienił pozycję i został wspierającym.</p>\n\n<p>Przełomowe dla Vandera było dołączenie do polskiego zespołu Kiedyś Miałem Team, choć drużynie nie od razu udało się zbudować stały skład. KMT istniało od września 2012 roku i przez formację przewinęło się wielu znanych na polskiej scenie zawodników. Vander dołączył do formacji już w okresie, kiedy zmian nie było tak wiele, choć nadal się zdarzały. Ostatecznie zespół znalazł sobie organizację, którą było… H2k. Początkowo dla Vandera nie było miejsca w nowej drużynie, ale po zaledwie pięciu dniach zastąpił w składzie drużyny Piotra „SuperAZE’a” Prokopa. Później zespół przeniósł się do GF Gaming, a w międzyczasie doszło jeszcze do kilku niewielkich rotacji. Ostatecznie pod szyldem Kiedyś Miałem Team ekipa spróbowała swoich sił w kwalifikacjach do EU LCS. Drużyna w składzie Xaxus-Jankos-Overpow-Celaver-Vander dostała się do baraży, w których zwyciężyła z faworyzowanym Ninjas in Pyjamas. Nowy zespół, występujący już pod banderą Teamu ROCCAT, zaskakująco dobrze radził sobie w swoich pierwszych splitach w stawce , notując trzecie i czwarte miejsce w play-offach w 2014 roku i niemalże uzyskując bilety na Mistrzostwa Świata. Jednocześnie Vander szybko wyrósł na jedną z gwiazd zespołu, zachwycając głównie niesamowitymi umiejętnościami mechanicznymi. Szczególnie było to widoczne, gdy dostawał w swoje ręce Thresha, który do dziś jest jego najbardziej znaną postacią. To on był też jednym z pierwszych graczy EU LCS, który dostrzegł potencjał Morgany w roli wspierającej. W 2015 roku przyszedł czas na zmiany w składzie zespołu i rozczarowujące występy, choć znów do wyjazdu na MŚ nie było daleko… Polski support był w tym czasie, obok Jankosa, najsilniejszym punktem zespołu. Powiększył też znacznie swój champion pool, który zaczął wykraczać poza dwie wspomniane wcześniej postaci: w letnim splicie 2015 Vander najczęściej decydował się na wybór Alistara (8 gier), Nautilusa (4 gry) i oczywiście Thresha (4 gry).</p>\n\n<p>Przed wiosennym splitem 2016, wspierający przeniósł się wraz z dżunglerem Marcinem „Jankosem” Jankowskim z Teamu ROCCAT do H2k-Gaming.</p>\n\n<p>Co ciekawe, polski zawodnik na początku swojej kariery posługiwał się pseudonimem Van Der Fckk, który później ewoluował w VandeRnoob, a następnie pozostał po prostu VandeR. Dodatkowo warto zauważyć, że wspierający był w letnim splicie 2015 najczęściej wardującym graczem w stawce, a także prawie najczęściej zabijającym supportem. Legitymował się również trzecim najwyższym KDA na swojej pozycji.</p>\n","fr_FR":"<p>Oskar « Vander » Bogdan a commencé la compétition dès la première saison, mais c’est en 2013 qu’il rencontre ses premiers succès, quand il réussit à se qualifier aux League of Legends Championship Series avec l’équipe polonaise Kiedyś Miałem Team après avoir tenu en échec les Ninjas in Pyjamas de Erlend « Nukeduck » Våtevik. Aussitôt, l’équipe signe avec ROCCAT et fait un départ en trombe aux LCS. Vander obtient le titre de meilleur joueur de la semaine 4 après avoir livré deux parties grandioses avec Thresh, son champion signature, et obtenu 22 de KDA. Son expérience et sa vision de jeu permettent au Polonais de prendre des décisions avisées et de guider ses coéquipiers vers la victoire.</p>\n\n<p>Alors à peine arrivé en LCS, le support permet à son équipe de truster la première place du classement provisoire de la saison printanière 2014 pendant trois semaines avant que cette dernière ne subisse une baisse de régime tandis que ses adversaires s’adaptent de mieux en mieux. Tout de même qualifiés aux play-offs, Vander et ses compatriotes obtiennent la 3e place après avoir tenu en échec l’équipe Alliance de Henrik « Froggen » Hansen.</p>\n\n<p>Après des résultats bien moins convaincants en saison estivale, l’équipe polonaise ne parvient qu’à obtenir la 6e place sur 8 pendant la saison régulière avant d’échouer au pied du podium des play-offs et se voit contrainte de jouer les matchs de relégation pour conserver sa place en LCS.</p>\n\n<p>Début 2015, Vander voit arriver un nouveau partenaire en voie du bas, Paweł « Woolite » Pruski, venu pour remplacer un Paweł « Celaver » Koprianiuk qui connaissait des difficultés contre les meilleurs carrys AD européens. Malheureusement, le résultat n’est pas celui escompté et ROCCAT peine toujours autant. C’est à la 4e semaine de la saison d’été et l’arrivée de Rasmus « MrRalleZ » Skinneholm, un carry AD plus autonome, que Vander peut enfin quitter sa voie afin d’accompagner son jungler Marcin « Jankos » Jankowski dans ses initiatives pour produire un jeu de meilleure qualité.</p>\n\n<p>L’équipe réussit à remonter à la 5e place du segment mais échoue dès le premier tour des play-offs face à Unicorns of Love. Dans la course à la qualification pour le mondial 2015, Vander et son équipe chutent de peu face à Origen. Il quitte ROCCAT en décembre et rejoint les rangs de H2K pour la saison 2016 en compagnie de son compatriote Jankos et a cette fois-ci à ses côtés un carry AD de première classe, Konstantinos « FORG1VEN » Tzortziou-Napoleon. Pendant la saison régulière, Vander excelle. Libéré par l’espace que lui procure un très bon partenaire de voie, il s’épanoui et devient une pièce maîtresse de son équipe avec laquelle il se hisse à la 2e place du classement à l’aube des play-offs avec le 2e meilleur KDA de tous les supports de sa ligue (7,11). Directement qualifié en demi-finale des play-offs, Vander perd ses espoirs de finale après la défaite 2 à 3 contre Origen. Cet été, en compagnie de la même équipe mais cette fois aux cotés de Aleš « Freeze » Kněžínek en carry AD, le Polonais aura à cœur de passer à l’étape supérieure pour enfin s’imposer en Europe, avec comme objectif le Mondial 2016 !</p>","es_ES":"<p>Como uno de los líderes de su anterior equipo, ROCCAT, Oskar ''Vander'' Bogdan evalúa constantemente el estado del juego y los movimientos de sus enemigos en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC, y en su primer split con H2K en 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó los problemas de ROCCAT atrás cuando se pasó a una calle inferior con uno de los AD carries más exigentes del juego, FORG1VEN. Comenzó a acumular víctimas enseguida con su nuevo compañero de calle, valiéndose de apoyos pesados de iniciación que le permitían facilitar asesinatos y aturdir a los enemigos para controlar los combates de equipo. Poco después, tuvo que compartir calle con Freeze, pero el nuevo AD carry quedó en el banquillo por una lesión y Vander volvió a reunirse con FORG1VEN. Aunque H2K no logró superar los playoffs para llegar a la final de verano, el liderazgo de</p> <p>Vander ha vuelto a su forma tajante habitual. Dirigirá un equipo de perdedores este año, pero con su experiencia internacional, Vander puede ayudar a que H2K sorprenda al mundo y recupere el trofeo para Europa.</p>","es_AR":"<p>Como uno de los líderes de su antiguo equipo ROCCAT, Oskar \"Vander\" Bogdan evalúa constantemente el estado del juego y los movimientos del enemigo en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC y, en su primer torneo con H2K en el 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó las peleas del equipo ROCCAT atrás para pasar directamente al carril inferior junto a uno de los ADC más demandantes del juego, FORG1VEN. Rápidamente empezó a cosechar víctimas con su nuevo compañero de carril, lo que favoreció a los soportes fuertes de iniciación, que le permitieron lograr asesinatos y tener el control del combate en equipo. Pronto tuvo a un nuevo compañero de carril en Freeze, pero, luego de que una lesión dejara fuera a su nuevo tirador, no pasó mucho para que volviera a unirse a FORG1VEN. Aunque H2K cayó en las eliminatorias antes de llegar a la final de verano, Vander volvió a liderar de forma clara y medida, tal como siempre lo ha hecho. Este año dirigirá a un equipo de jugadores de bajo nivel, pero, con su experiencia internacional, Vander puede ayudar a H2K a hacer vibrar el mundo e intentar llevarse un trofeo a Europa.</p>","pt_BR":"<p>Como coordenador das tomadas de decisão em sua antiga equipe, ROCCAT, Oskar “Vander” Bogdan está constantemente avaliando o estado do jogo e os movimentos do inimigo no Rift. O conhecimento de jogo de Vander foi primordial para o sucesso da ROC e, em sua primeira Etapa com a H2K em 2016, ele se tornou um membro essencial para a equipe.</p>\n\n<p>Vander deixou suas dificuldades com a ROCCAT para trás e fez sua transição impecável para a rota inferior junto com um dos atiradores mais exigentes do jogo, FORG1VEN.  Ele rapidamente esmagou suas vítimas com seu novo parceiro de rota, favorecendo suportes com iniciação pesada que permitiam que ele organizasse momentos de abate e atordoasse tudo em seu caminho no controle de confrontos de equipe. O suporte logo se encontrou com um novo parceiro de rota em Freeze, mas depois que uma lesão deixou seu novo atirador no banco, ele logo se reuniu com FORG1VEN. Apesar da H2K ter sido nocauteada nas eliminatórias antes de chegar na Final de Verão, as tomadas de decisão de Vander voltaram à sua antiga forma firme. Ele irá comandar uma equipe de azarões este ano, mas com sua experiência internacional, Vander pode fazer com que a H2K surpreenda o mundo enquanto tentam trazer o troféu para a Europa.</p>"},"foreignIds":{"drupalId":"1117","TRLH3":"200000234","TRLH4":"200000086","TRLH2":"1001280061","FRA1TMNT2":"25440","TRLH1":"1001380091","ESPORTSTMNT02":"200001008"},"socialNetworks":{"twitch":"http://www.twitch.tv/lolvander","facebook":"https://www.facebook.com/Vander.lol","twitter":"https://twitter.com/VanderLCS"},"champions":[],"liveGameTeam":165},{"id":205,"slug":"shlaya","name":"Shlaya","firstName":"Tony","lastName":"Carmona","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/shlaya-1gibq14m.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2016-01-28T22:37:16.000Z","bios":{"en_US":"<p>Tony “Shlaya” Carmona is substitute mid laner for Team Vitality.\n</p>","de_DE":"<p>\nTony „Shlaya“ Carmona spielt schon seit der ersten Stunde League of Legends, an Wettbewerben nimmt er bereits seit 2011 teil. Er verbrachte mehrere Jahre in der EU LCS, sowohl als Starter, als auch als Ersatzspieler, und er hat als AD-Carry, Mid-Laner und Top-Laner an Wettbewerben teilgenommen. 2015 kam Shlaya als Ersatzspieler zu Team Vitality.\n</p>","fr_FR":"<p>\nTony « Shlaya » Carmona est un joueur de League of Legends de longue date, sa participation à la compétition remontant à 2011. Au sein des LCS EU, il a joué pendant des années comme titulaire et remplaçant, évoluant en compétition comme carry AD, sur la voie du haut et sur la voie du milieu. Shlaya a rejoint les rangs de Fnatic comme remplaçant en 2015.\n</p>","es_ES":"<p>\nTony ''Shlaya'' Carmona es un auténtico veterano de League of Legends, con un historial competitivo que se remonta a 2011. Pasó varios años en la LCS de EU como titular y como suplente y ha jugado en el circuito profesional como AD carry, calle central y calle superior. En 2015 se incorporó a Fnatic como suplente.\n</p>","pl_PL":"<p>\nTony „Shlaya” Carmona jest długoletnim graczem w League of Legends. Swoją przygodę z grą rozpoczął jeszcze w 2011 r. Przez wiele lat uczestniczył w rozgrywkach EU LCS, zarówno jako zawodnik początkowego składu, jak i rezerwowy. Pełnił funkcję prowadzącego, gracza w środkowej alei, a także w górnej.  Shlaya dołączył do Fnatic jako rezerwowy w 2015 r.\n</p>","pt_BR":"<p>\nO histórico de Shlaya vem desde 2011. Ele passou vários anos na LCS EU, tanto como titular quanto reserva, e jogou competitivamente nas rotas do meio, do topo, e como atirador. Ele entrou na Fnatic como reserva em 2015.</p>"},"foreignIds":{"drupalId":"1123","TRLH3":"1001220080","TRLH4":"1001190130"},"socialNetworks":{"facebook":"https://www.facebook.com/ShLaYa.Tony","twitter":"http://twitter.com/ShLaYa","twitch":"http://www.twitch.tv/shlaya"},"champions":[],"liveGameTeam":165},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":328,"slug":"steeelback","name":"Steeelback","firstName":"Pierre","lastName":"Medjaldi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/steeelback-6w0pq1lj.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-18T22:51:12.000Z","bios":{"en_US":"<p>Pierre \"Steeelback Medjaldi is still looking for a team he can call home. He rose to prominence with Fnatic in 2015 but was replaced by a returning Rekkles. He joined Gambit Gaming for a split. Then he migrated to the Unicorns of Love but departed after a playoff defeat. He spent the 2016 EU LCS Summer Split with ROCCAT before deciding to move on once again.</p>\n\n<p>Steeelback and Team Vitality both hope to have found the perfect match. Steeelback's talent has never been in question; he put up impressive numbers in the Summer Split despite ROCCAT nearly getting relegated. Alongside ex-KT Rolster support Hachani, Steeelback has the potential to rival the best bot lanes in the EU LCS -- if he's willing to stick around.</p>","de_DE":"<p>Pierre „Steeelback“ Medjaldi sucht immer noch nach einem Team, in dem er sich zu Hause fühlt. Er wurde 2015 mit Fnatic bekannt, wurde später allerdings durch Rekkles ersetzt. Daraufhin spielte er einen Split bei Gambit Gaming. Danach zog es ihn zu den Unicorns of Love, die er nach einer Niederlage in den Entscheidungsspielen jedoch wieder verließ. Während des Sommer-Splits der EU LCS 2016 spielte er dann bei ROCCAT, bevor er wieder weiterzog.\n\nJetzt hoffen sowohl Steeelback als auch Team Vitality, dass sie perfekt zusammenpassen. Steeelbacks Talent steht außer Frage. Er lieferte im Sommer-Split eine beeindruckende Leistung ab, obwohl ROCCAT beinahe absteigen musste. Neben dem ehemaligen Supporter von KT Rolster, Hachani, hat Steeelback das Potenzial, die besten Duos auf der unteren Lane herauszufordern – wenn er nicht wieder die Mannschaft wechselt.</p>","fr_FR":"<p>Pierre « Steeelback » Medjaldi a rejoint les rangs de SK Gaming Prime à la fin de l’année 2014, sans trouver le succès car éliminé prématurément du tournoi d'expansion qui permettait l’accès aux League of Legends Championship Series. </p>\n\n<p>Mais le Français accède tout de même aux LCS. Steeelback est en effet repéré par son compatriote Bora « YellOwStaR » Kim par pur hasard alors que ce dernier écumait les parties classées. Le vétéran de Fnatic qui cherchait un dernier joueur pour son équipe est agréablement surpris par le niveau de jeu du carry AD. Il décèle chez lui une soif d’apprendre très développée et décide de l’inviter à le rejoindre dans sa nouvelle aventure.</p>\n\n<p>En très peu de temps, le duo français et ses trois coéquipiers réussissent à créer un jeu qu’ils exposent aux yeux d’un public européen positivement surpris. Dès la première semaine, Steeelback et ses coéquipiers montrent une cohésion impressionnante et remportent leurs deux parties. Galvanisé et guidé par un des meilleurs support au monde, le jeune joueur tient la dragée haute à certains des meilleurs carrys AD d’Europe. S’il n’est que la 3e source de dégâts d’une équipe très centrée sur son toplaner Seung-hoon « Huni » Heo, Steeelback est régulier et sait être la tornade qui vient balayer les combats d’équipe avec Corki ou Graves, ne laissant aucune chance de fuite à ses adversaire. Il signe un très bon ratio KDA de 8,9.</p>\n\n<p>Steeelback et Fnatic sont sacrés champions d’Europe après avoir remporté les play-offs et sont conviés au tournoi sur invitation de mi-saison. Le carry AD montre ses limites face à certains des meilleurs joueurs du monde et est remercié par la suite. Le management de Fnatic a indiqué être conscient du potentiel du Français mais ne pas avoir le temps d’attendre que le joueur soit formé, les ambitions du club ayant fortement augmenté.</p>\n\n<p>À la recherche d’un nouveau toit, Steeelback se tourne vers l’Amérique du Nord et rejoint Odyssey Gaming. Malheureusement, l’équipe ne parvient pas à se qualifier aux Challenger series NA. Il rejoint par la suite une équipe qui, elle, est parvenue à accéder à la compétition : Team Imagine. Après des résultats mitigés, il parvient tout de même à accéder au tournoi de promotion, mais son équipe se fait éliminer par Team 8, l’escouade sortante des LCS.</p>\n\n<p>En 2016, Steeelback revient en Europe et compte bien réitérer une bonne performance en LCS, cette fois-ci avec Unicorns of Love. Au début du segment de printemps, il s’illustre notamment avec sa Kalista, terminant le segment avec un KDA de 33 sur ce personnage et un KDA général de 6.81. Malgré de bonnes statistiques personnelles, l’équipe ne suit pas et termine à la 5ème place de la saison régulière. Une performance décevante pour Steeelback qui décide de partir pour Roccat au début du segment d’été.</p>\n","pl_PL":"<p>Pierwszą próbę zaistnienia w League of Legends Pierre podjął w drużynie GSI Gaming w sierpniu 2014 roku. Skończyło się tylko na podejściu, gdyż w jego szeregach nie wystąpił na scenie esportowej. Udało mu się pokazać z kolejnym zespołem – SK Gaming Prime, do którego dołączył w listopadzie tego samego roku. Z tą organizacją miał okazję nabrać doświadczenia i wziąć udział w Challenger Series. Jednak nie odniósł tam sukcesów, na których mu zależało.</p>\n<p>\nPrzełomem w karierze francuza było dostanie się, w styczniu 2015 roku, do sztandarowego zespołu Europy - Fnatic. Poprzedni AD Carry, „Rekkles”, postawił mu poprzeczkę bardzo wysoko. Wielu fanów było bardzo zawiedzionych wyborem Pierra Medjaldi na tą pozycję. On sam skomentował to krótko: „Chciałbym się sprawdzić w rozgrywkach EU LCS i zasłużyć na miejsce pomiędzy najlepszymi graczami AD Carry w Europie.” Miał taką okazję w wiosennym sezonie 2015 i udowodnił, że nie był złym wyborem. Fnatic po tym okresie uplasowało się na 2gim miejscu, co w dużej mierze było jego zasługą. Później poprawił ten wynik wraz z drużyną w rozgrywkach barażowych. Czołowa pozycja w Europie po pierwszym semestrze to jedno z największych dokonań Pierra. Drugie największe osiągnięcie to występ na 2015 Mid-Season Invitational. \"Steeelback\" zmierzył się na tym wydarzeniu z najlepszymi zawodnikami z całego świata i wypadł całkiem dobrze. Fnatic został zatrzymany dopiero przez SKT T1, przyszłych Mistrzów Świata, w zaciętej walce z wynikiem 2:3. Niestety wkrótce po turnieju, w maju 2015 roku, organizacja Fnatic zdecydowała się na ponowne przyjęcie Martina „Rekkles” Larssona, więc Pierre poszedł w odstawkę. </p>\n<p>\nPo tym wydarzeniu wypowiedział się, że chciałby móc się wykazać po MSI, ale taka szansa nie została mu dana. \"Steeelback\" wrócił do prób dostania się do EU Challenger Series wraz z drużyną Odyssey Gaming, lecz bez pomyślności. Następnie zasilił skład Team Imagine, które walczyło o kwalifikację do NA LCS. W rozgrywkach kwalifikacyjnych skończyli na trzeciej pozycji, przez co później musieli się zmierzyć z doświadczonym Team8. Niestety przeciwnicy okazali się mocniejsi, więc nowa drużyna Pierra pozostała w NA Challenger Series. 2 miesiące później zrezygnował dalszej walki o wejście wyżej, na rzecz propozycji zespołu, który już znajdował się w wiosennym sezonie EU LCS 2016. W listopadzie stał się członkiem Unicorns Of Love, gotowy do kolejnego podejścia w profesjonalnych rozgrywkach.</p>\n<p>\nWypowiedzi Pierra z wywiadów to nieliczne źródła, z których można się dowiedzieć czegoś o nim. To bardzo skryty gracz, z reguły rzadko udzielający się na portalach społecznościowych. Po jego wyborach w meczach można się łatwo domyślić, że najbardziej lubi grać Corkim, Lucianem i Sivir. Tymi bohaterami miał najlepsze wyniki i nim zawdzięcza wejście do Kręgu Pretendenta w Europie i Ameryce Północnej.\n</p>","es_ES":"<p>Aunque Pierre ‘Steeelback’ Medjaldi se hizo popular gracias a su fichaje por Fnatic en el Split de primavera de la LCS 2015, el jugador ya ha pasado hasta por siete equipos en menos de un año. Sin miedo a nuevos retos y aventuras, el joven francés todavía tiene una larga carrera por delante para demostrar que no sólo fue una apuesta arriesgada, sino también una garantía de futuro que explotará en Unicorns of Love.</p>\n\n<p>No es del todo cierto asegurar que Steeelback era un completo desconocido antes de fichar por Fnatic pero sí que es cierto que sus apariciones son con cuentagotas. En Agosto ficharía por GSI Gaming, equipo francés en el que también participaron Lucas ‘Cabochard’ Simon-Meslet y Aleksi ‘Hiiva’ Kaikkonen. Quizás por el contacto con el segundo pudo competir con SK Gaming Prime en el intento en Noviembre de entrar a la LCS por el torneo de promoción de primavera, aunque serían derrotados en la primera ronda por Reason Gaming.</p>\n\n<p>Aquí es cuando la vida del tirador cambia totalmente de rumbo debido al fichaje por Fnatic. Aunque el voto de confianza de Bora ‘YellOwStaR’ Kim le permitió entrar al equipo, la toma de contacto con Fnatic fue curiosamente por Fabian ‘Febiven’ Diepstraten que realizó la sugerencia para que probase por la escuadra inglesa. Durante primavera se mostró sólido pero no espectacular aunque no sería tarea fácil enfrentarse a los mejores del mundo en su posición en el Mid Season Invitational 2015. Su dominio de Sivir les otorgó una posibilidad táctica que le permitió cumplir su rol secundario.</p>\n\n<p>Pero con la llegada de Martin ‘Rekkles’ Larsson, el joven francés decidió tomar rumbo a las américas. La suerte no le acompañó ni en Odyssey Gaming al no poder clasificarse para la Challenger Series norteamericana ni en Imagine, puesto que ya en Challenger Series no fueron rival de Team8 para ascender a la League Championship Series. El jugador mostró una faceta más agresiva con campeones como Lucian o Corki que le permitieron aportar el desgaste necesario, pero todavía se mantuvo en una posición de retaguardia más pasiva.</p>\n\n<p>Con Zdravets ‘Hylissang’ Galabov la fase de líneas será un factor fundamental a la hora de decidir las partidas debido a la agresividad del búlgaro. El tirador tendrá que dar un paso adelante en su agresividad en una metajuego que a priori podría beneficiar a su Lucian, pero en el que la duda es la principal amenaza.</p>\n\n<p>Después de Fnatic y la Challenger Series norteamericana, esta supone la tercera aventura de Steeelback. El jugador ya ha afirmado su número de la suerte es el tres, de ahí las tres es en su nombre, y además también posee a tres campeones favoritos fuera de la propia posición de tirador, como son Zed, Lee Sin y Thresh. ¿Será la tercera la vencida?</p>"},"foreignIds":{"drupalId":"2903","TRLH3":"200000122","TRLH4":"200000225"},"socialNetworks":{"twitch":"http://www.twitch.tv/steeelback","facebook":"www.facebook.com/Steeelback","twitter":"http://twitter.com/Steeelb4ck"},"champions":[],"liveGameTeam":165},{"id":384,"slug":"nukeduck","name":"Nukeduck","firstName":"Erlend","lastName":"Holm","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nukeduck-9lfeix3.png","hometown":"Norway","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T10:41:18.000Z","bios":{"en_US":"<p>Erlend “Nukeduck” Holm enters 2017 with an eye on the new mid lane meta. The Norwegian mid laner burst onto the scene in 2013 as part of the impressive Lemondogs lineup. Since then, he’s played for Ninjas in Pyjamas and ROCCAT, and he spent all of 2016 with Team Vitality.</p>\n\n<p>Previously known for his play on assassins, Nukeduck will get the chance to shape his own meta in the 2017 Season. He’ll also need to learn to work with Vitality’s new junglers, Djoko and GBM. With the whole season in front of him, Nukeduck to forge a new identity for Vitality in 2017 and earn a spot in the playoffs.</p>","de_DE":"<p>2017 wird Erlend „Nukeduck“ Holm das Metaspiel auf der mittleren Lane genau im Auge behalten. Der norwegische Mid-Laner betrat die Szene 2013 als Teil der beeindruckenden Aufstellung der Lemondogs. Seitdem hat er für die Ninjas in Pyjamas und ROCCAT gespielt, bevor er 2016 zu Team Vitality wechselte.\n\nNukeduck, der früher für seinen Spielstil mit Assassinen bekannt war, bekommt in der Saison 2017 die Gelegenheit, sein eigenes Metaspiel zu schaffen. Außerdem wird er lernen müssen, mit Vitalitys neuen Junglern, Djoko und GBM, zusammenzuarbeiten. Doch noch liegt die gesamte Saison vor ihm und Nukeduck wird versuchen, Vitality 2017 eine neue Identität zu verleihen und mit der Mannschaft in die Entscheidungsspiele einzuziehen.</p>","fr_FR":"<p>Erlend « nukeduck » Holm est devenu célèbre avec la surprenante équipe Lemondogs en 2013. À l'époque, il était considéré à raison comme l'un des meilleurs jeunes mid-laners d'Europe. Après la dissolution de Lemondogs, nukeduck a rejoint les rangs des Ninjas in Pyjamas, puis ceux de ROCCAT avant de poser ses valises chez Team Vitality durant l'intersaison des LCS EU 2015. Même si nukeduck a dû lutter pour se faire une place dans les récentes metas des LCS EU, ses talents d'assassin devraient se combiner à merveille avec ceux de son nouveau jungler, Shook.</p>","pl_PL":"<p>Karierę Nukeducka można podzielić na cztery etapy.</p>\n<p>\nPierwszym z nich była walka o dołączenie do czołówki. Ten okres rozpoczął się dla norweskiego mid-lanera w grudniu 2011 roku od przygód z 3DMAX, Tt Dragons i H2k-Gaming. Zawodnik zaliczył też na przełomie 2012 i 2013 roku epizod w Teamie Solo Mebdi, który był jednym z faworytów kwalifikacji do pierwszego w historii splitu EU LCS. Ostatecznie zespół został zdyskwalifikowany, a Nukeduck przeniósł się do Sinners Never Sleep, które po udanych eliminacjach do letniej edycji europejskich rozgrywek w 2013 roku, zmieniło nazwę na Lemondogs. </p>\n<p>\nI tu zaczął się drugi etap – okres triumfów. Nukeduck był jedną z gwiazd tego zespołu, który okazał się fenomenem. Norweg dzielił i rządził na środkowej alei, a formacja zajęła ostatecznie drugie miejsce w letnim splicie EU LCS i pojechała na Mistrzostwa Świata. Tam nie poszło już tak dobrze i LD zakończyło rywalizację już na fazie grupowej. Wtedy też na Nukeducka spadła spora fala krytyki ze strony kolegów z drużyny, którym nie podobało się zadufanie w sobie norweskiego zawodnika. Problem polegał na tym, że mid-laner był tak pewny siebie, że nierzadko świadomie wybierał niekorzystne match-upy, by słabszą postacią ograć przeciwnika i udowodnić swoją wyższość. Nietrudno przewidzieć, że na MŚ poziom był zbyt wysoki, by ta sztuka mu się udawała. Po nieudanych MŚ zespół zmienił organizację na Ninjas in Pyjamas i, w wyniku sporego chaosu i przeoczeń, był zmuszony walczyć w barażach o utrzymanie w EU LCS. </p>\n<p>\nTutaj rozpoczął się kolejny okres w karierze Nukeducka – etap spektakularnych porażek. Dużą rolę ponownie odegrał w tej kwestii egoizm Norwega, który miał duży udział w niespodziewanej porażce w meczu barażowym przeciwko Kiedyś Miałem Team. NiP został zmuszony do rywalizacji w EU Challenger Series, a Nukeduck nieprędko wrócił do LCS. Wiosenny split EU CS był dla drużyny i samego Norwega nieudany, a niedługo później Erlend został wraz z kolegą z drużyny , Alfonso „Mithy’m” Aguirre Rodriguezem, wykluczony z gry na profesjonalnym poziomie za toksyczne zachowanie w kolejce solowej. To właśnie ten moment był punktem kulminacyjnym tego bardzo nieudanego okresu w karierze Norwega, który został zmuszony do zrobienia sobie półrocznej przerwy w karierze.</p>\n<p>\nNukeduck został odbanowany w grudniu 2014 roku i niemal natychmiast znalazł nowego pracodawcę, którym okazał się Team ROCCAT. Był to już czwarty etap – powrót na szczyt. Początki nie były dla norweskiego mid-lanera łatwe i miał on problemy z odnalezieniem się zarówno w samej grze, jak i w drużynie, w której był jedynym obcokrajowcem. Skutkowało to wyjątkowo pasywnym stylem gry, jaki stał się udziałem Nukeducka. Sprawy nie ułatwiał także bardzo wąski champion pool gracza. W konsekwencji Team ROCCAT dopiero w barażach zapewnił sobie utrzymanie w rozgrywkach. Tymczasem letnia edycja zmagań była dla Norwega już znacznie bardziej udana – zawodnik odzyskał pewność w grze i stał się ważnym punktem zespołu, ponownie prezentując wysokie umiejętności mechaniczne. W lecie Nukeduck najczęściej grał Viktorem (5), Azirem (5) i Varusem (4) i trzeba przyznać, że wychodziło mu to znakomicie, bo okazał się drugim najczęściej asystującym mid-lanerem w stawce, a także drugim graczem środka alei z największym udziałem w zabójstwach drużyny.</p>\n<p>\nNick Norwega jest złożeniem dwóch słów – „Nuke”, co oznacza błyskawiczne zmiecenie przeciwnika z powierzchni ziemi, a także „Duck”, bo… dobrze brzmiało. Mid-laner w przeszłość dużo grał w koszykówkę, a także w piłkę wodną. Nukeduck nie ukrywa również fascynacji fantastyką, a szczególnym uwielbieniem darzy „Władcę Pierścieni” oraz „Hobbita”.\n</p>"},"foreignIds":{"drupalId":"280","TRLH3":"200000121","TRLH4":"200000224"},"socialNetworks":{"facebook":"www.facebook.com/nukeducklol","twitter":"https://twitter.com/nukeducklol","twitch":"http://www.twitch.tv/nukeducklol"},"champions":[],"liveGameTeam":165},{"id":1089,"slug":"djoko","name":"Djoko","firstName":"Charly","lastName":"Guillard","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/djoko-eihpvx8d.png","hometown":null,"region":"EU LCS","birthdate":"1997-03-01","createdAt":"2016-01-21T21:12:44.000Z","updatedAt":"2017-06-09T10:57:44.000Z","bios":{"en_US":"<p>Charly “Djoko” Guillard is finally getting his shot in the EU LCS. The jungler has spent the past two years working his way up through the Challenger scene, most recently as a member of the Millenium roster that fell to ROCCAT in the 2017 Spring Promotion Tournament.</p>\n\n<p>On Team Vitality’s 2017 lineup, he’ll be competing with teammate GBM for the starting jungle position. His history in the jungle position may end up working in his favor; GBM is new to the role this season. Either way, the competition can only serve to improve Djoko’s skills and Vitality’s chances in 2017.</p>","fr_FR":"<p>Djoko est le jungler de l’équipe Millenium. Actuellement Challenger, il a prouvé sa valeur de nombreuses fois dans le passé notamment sous les couleurs \"Imaginary Gaming\" avec qui il a remporté la première édition du Challenge France. </p>\n<p> Il a pu goûter au plus haut niveau en remplaçant DiamondProx des « Unicorns of Love » durant les LCS EU 2016. Reconnu pour ses choix de champions exotiques, Djoko est l'un des piliers de l'équipe et compte bien la mener le plus loin possible. Sa synergie avec son coéquipier Kaze lui permet de dominer la scène française et de guider son équipe vers la victoire. Après l'échec de la qualification aux LCS à une marche de son rêve, il promet de revenir encore plus fort afin de conserver le titre avec ses coéquipiers et de retenter sa chance.</p>","de_DE":"<p>Charly „Djoko“ Guillard bekommt endlich die Gelegenheit, sich in der EU LCS zu beweisen. Der Jungler hat die letzten beiden Jahre damit verbracht, sich in der Challenger Series nach oben zu arbeiten. So war er vor Kurzem noch Mitglied von Millenium, die im Frühjahrs-Aufstiegsturnier 2017 gegen ROCCAT den Kürzeren zogen.\n\n2017 wird er bei Team Vitality mit Teammitglied GBM um die Startposition als Jungler wetteifern. Dabei könnte sich seine Vergangenheit im Dschungel als Vorteil erweisen, schließlich ist diese Position für GBM neu. So oder so wird die Konkurrenz dafür sorgen, dass sich sowohl Djokos Können als auch Vitalitys Chancen 2017 verbessern.\n</p>"},"foreignIds":{"TRLH3":"200000120","TRLH4":"200000223"},"socialNetworks":{"twitter":"https://twitter.com/Djoko_GG"},"champions":[],"liveGameTeam":165},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1704,"slug":"alderiate","name":"Alderiate","firstName":"Adrien","lastName":"Wils","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alderiate-7q1wg8p0.png","hometown":null,"region":"EU LCS","birthdate":"1993-09-07","createdAt":"2017-01-13T19:44:16.000Z","updatedAt":"2017-01-18T22:06:05.000Z","bios":{},"foreignIds":{"TRLH3":"200000125","TRLH4":"200000228"},"socialNetworks":{"twitch":"https://twitter.com/Alderiate"},"champions":[],"liveGameTeam":165},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28}],"scheduleItems":[{"id":"AVTGgk58oUG4HPFjOJ-f","content":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:match:5b1c889a-f568-49e4-aa62-fd9f94f0b100","scheduledTime":"2016-06-10T15:00:01.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb","blockLabel":"2","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:bracket:88a5aa52-4461-4a15-8fb5-83c8b5265f93"},"match":"5b1c889a-f568-49e4-aa62-fd9f94f0b100","tournament":"f7afa181-4580-48c0-af26-4b3d70fe21eb","bracket":"88a5aa52-4461-4a15-8fb5-83c8b5265f93","league":"3"}],"gameIdMappings":[{"id":"18f44a9e-5a16-4fe3-9d92-4ad3634328f3","gameHash":"35bd0a66d14e3880"},{"id":"fe734b03-4b84-4505-8d14-3bf44260590a","gameHash":"372086d9e951b6cf"}],"videos":[{"id":3043,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:fe734b03-4b84-4505-8d14-3bf44260590a","source":"https://www.youtube.com/embed/wfK_LlRgKHI?wmode=transparent","createdAt":"2016-06-10T17:54:15.000Z","updatedAt":"2016-06-10T17:54:15.000Z","game":"fe734b03-4b84-4505-8d14-3bf44260590a"},{"id":3047,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:18f44a9e-5a16-4fe3-9d92-4ad3634328f3","source":"https://www.youtube.com/embed/utiAU-6zLCI?wmode=transparent","createdAt":"2016-06-10T18:59:01.000Z","updatedAt":"2016-06-10T18:59:01.000Z","game":"18f44a9e-5a16-4fe3-9d92-4ad3634328f3"}],"htmlBlocks":[],"match":{"id":"5b1c889a-f568-49e4-aa62-fd9f94f0b100","name":"VIT-vs-ROC","position":24,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"},{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],"games":{"18f44a9e-5a16-4fe3-9d92-4ad3634328f3":{"id":"18f44a9e-5a16-4fe3-9d92-4ad3634328f3","name":"G2","generatedName":"ROC|VIT|G2|5b1c889af56849e4aa6","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}],"standings":{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465584711485,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465578113814,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001680101","gameRealm":"TRLH3","platformId":"TRLH3:1001680101","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"fe734b03-4b84-4505-8d14-3bf44260590a":{"id":"fe734b03-4b84-4505-8d14-3bf44260590a","name":"G1","generatedName":"ROC|VIT|G1|5b1c889af56849e4aa6","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"},{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],"standings":{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465575345656,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465574976937,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001680072","gameRealm":"TRLH3","platformId":"TRLH3:1001680072","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465584711485,"source":"bestOf","history":[{"result":[[{"roster":"0ba11a6a-99e3-41f1-b202-311e5e066fcb"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1465578113814,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"9c84662f-51ee-480b-94c3-dcfcd891ca89":0,"0ba11a6a-99e3-41f1-b202-311e5e066fcb":3}}}