{"teams":[{"id":97,"slug":"splyce","name":"Splyce","guid":"be6e1a6a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/splyce-gyo3tr9y.png","acronym":"SPY","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-08-08T09:39:46.000Z","bios":{"en_US":"<p>Splyce started from the bottom. Now they’re here, one of the best teams in Europe. Formerly Team Dignitas EU, Splyce made their debut in the 2016 EU LCS Spring Split and immediately struggled. The young team banded together in the Summer Promotion Tournament, and the very next split took second place in the regular season and earned a spot a Worlds though the Regional Qualifiers.</p>\n\n<p>Like their rivals G2, Splyce played poorly at Worlds. But with the same five members returning for 2017, they’re poised to once again dominate the EU LCS. If there’s any team in the league that knows how to deal with failure and come out on top, it’s Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","pl_PL":"<p>Splyce było na wiosnę 2016 drugą, obok G2 Esports, drużyną, dla której udział w tamtym Splicie był debiutem w LCS-owej stawce. W pełni duński skład awans do elitarnych rozgrywek wywalczył, zwyciężając w letnim splicie europejskiego Challenger Series (EU CS) 2015.</p>\n<p>Historia ekipy jest dość skromna i jej początki sięgają wiosennej edycji rywalizacji w EU CS w 2015 roku. Wtedy to drużynę SK Gaming Prime przejął Team Dignitas EU. W składzie doszło do trzech zmian, które w efekcie sprawiły, że DIG EU od tej pory stało się zespołem jednonarodowościowym – złożonym wyłącznie z Duńczyków. Obiecujący skład miał trudne początki i na wiosnę ledwo co zakwalifikował się do play-offów Challenger Series, w których, co ciekawe, ostatecznie nie wystąpił. Wszystkiemu winne były ograniczenia wiekowe w LCS, których nie spełniała wtedy dwójka zawodników formacji – Martin „Wunderwear” Hansen oraz Chres „Sencux”Laursen. Wobec tego ówczesne DIG EU zmuszone było do gry o uzyskanie ponownej kwalifikacji do EU CS na split letni.</p>\n<p>Od tej pory wszystko szło już jednak znacznie sprawniej i zespół bez problemu znów dostał się do Challenger Series, by następnie bez problemu zakwalifikować się do play-offów i tam pokonać wszystkich rywali, zapewniając sobie awans do LCS na wiosenną edycję w 2016 roku. Warto jednak zauważyć, że triumf ex-Dignitas EU nie należał do przekonujących. Niemniej ekipa ta jest ciekawą mieszanką talentu i młodości (Sencux, Wunderwear) z rutyną i doświadczeniem (Nicolai „Nisbeth” Nisbeth, Jonas „Trashy” Andersen). Ponadto atutem formacji jest oczywiście możliwość komunikacji w rodzimym języku.</p>\n<p>Ostatecznie beniaminek zmagań przystępuje do rywalizacji w zmienionych barwach. Zawodnicy zamienili trykoty Team Dignitas EU na koszulki nowej organizacji - Follow eSports, które ostatecznie przekształciło się w Splyce. W międzyczasie, przed startem wiosennego splitu EU LCS 2016, ekipa nie uniknęła również zmian w składzie, a konkretnie jednej. Dotychczasowego dżunglera, Dennisa \"Obviousa\" Sørensena, który opuścił formację 29 października 2015 roku, dwa tygodnie później zastąpił wracający z Ameryki Jonas \"Trashy\" Andersen. Warto dodać, że Splyce było wtedy dopiero siódmym zespołem w historii LCS złożonym wyłącznie z graczy jednej narodowości i drugim w pełni duńskim.</p>\n<p>Wiosenny split nie spełnił jednak oczekiwań kibiców Splyce ani samej formacji. Drużyna od samego początku zmagań utknęła na dole tabeli i ostatecznie zajęła niskie, ósme miejsce, które sprawiło, że Splyce zmuszone zostało do walki w turnieju barażowym o utrzymanie w stawce. Tam, chociaż nie bez problemów, zespół na szczęście pokonał jednak GIANTS Gaming wynikiem 3-2 i zagwarantował sobie miejsce w EU LCS na letnim split. W składzie drużyny doszło tylko do jednej zmiany – zawodzącego wspierającego Nicolaia „Nisbetha” Nisbetha zastąpił młody i utalentowany słoweński support Mihael „Mikyx” Mehle. Splyce przystąpiło do rywalizacji z nadziejami na awans do play-offów, chociaż eksperci po raz kolejni nie dawali bardzo młodej drużynie dużych szans na osiągnięcie takiego wyniku.</p>\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>\n","es_ES":"<p>Splyce (anteriormente llamado Team Dignitas EU) hicieron su debut en la LCS EU durante el split  de primavera de 2016, y tuvieron un duro comienzo para adaptarse al nivel de la LCS. Como resultado, el equipo tuvo que luchar en el Summer Promotion Tournament, en el que superaron a Giants Gaming en un apasionante enfrentamiento al mejor de cinco y se aseguraron llegar a la LCS EU. Splyce tuvo un exitoso split de verano que le posicionaría en segundo lugar, nada que ver con el de primavera, en el que casi quedaron eliminados. Ahora que han superado los baches de la competición europea, el joven equipo rebosa confianza de camino al Campeonato Mundial 2016. Es hora de demostrarle al mundo que el split de verano no fue suerte sino que Splyce ha llegado para quedarse.</p>\n<p>Entrenador: Hans Christian \"Liq\" Duerr</p>","de_DE":"<p>Splyce fing ganz unten an. Doch heute gehören sie zu den besten Mannschaften Europas. Splyce, ehemals Team Dignitas EU, gab sein Debüt beim Frühjahrs-Split der EU LCS 2016 und hatte sofort Probleme. Doch die junge Mannschaft fand im Sommer-Aufstiegsturnier zueinander, woraufhin sie bereits den nächsten Split auf Platz Zwei beendeten und sich in der regionalen Qualifikationsrunde für die Weltmeisterschaft qualifizieren konnten.</p>\n\n<p>Genau wie ihre Rivalen G2 spielte auch Splyce bei der Weltmeisterschaft schwach. Aber da sich ihre Aufstellung für die Saison 2017 nicht geändert hat, sind sie bereit, die EU LCS erneut zu dominieren. Wenn es in der Liga eine Mannschaft gibt, die weiß, wie man mit Fehlschlägen umgeht und sich wieder an die Spitze kämpft, dann ist das Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","fr_FR":"<p>Nouveaux arrivants en LCS EU, Splyce a racheté cette année la place et l'effectif de Dignitas EU après la qualification de ces derniers en LCS.</p>\n\n<p>L'équipe a d'abord été connue sous le nom de Follow Esports, un site qui se présente comme le « programme télé de l'esport », mais tant le site que l'équipe LCS ont rapidement changé de nom au profit de l'actuel. Peu après l'achat le cofondateur du site a déclaré être très satisfait de son investissement dans League of Legends puisque cela les plaçait dans une « ligue aussi excitante que professionnelle, que ce soit au niveau de l'organisation, des joueurs ou des fans ». Reste à voir quelle place Splyce va occuper dans ces LCS auxquels l'organisation est aussi heureuse d'être associée. Pour la jeune entreprise basée aux Etats-Unis, elle n'a été créée qu'en avril 2015, les LCS sont à coup sur la garantie d'une exposition médiatique plus importante mais qu'en est-il de leurs ambitions sportives ? </p>\n\n<p>L'équipe a un avantage certain, l'absence de la barrière de la langue. En effet l'équipe est entièrement composée de joueurs danois, ce qui facilitera forcément la communication en jeu. Malgré tout, avec un effectif jeune et prometteur mais qui manque cruellement d'expérience, Splyce a un besoin criant d'un encadrement de bonne qualité pour concurrencer des adversaires qui ne leur feront pas de cadeau. L'entreprise semble néanmoins avoir bien cerné ce besoin puisqu'ils ont recruté Jakob « YamatoCannon » Mebdi, ancien entraîneur de Roccat, comme entraîneur et Chris Ehrenreich, ancien entraîneur de CLG en LCS NA, pour l'assister dans la mise en place d'un environnement de travail performant. </p>\n\n<p>Pas sur que cela suffise pour tutoyer les sommets des LCS dès le printemps 2016, mais les joueurs, confrontés au plus haut niveau européen, devraient à tout le moins progresser rapidement tant au niveau individuel qu'en tant qu'équipe. C'est tout le mal qu'on leur souhaite !</p>\n\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>","es_AR":"<p>Splyce (antiguamente llamado Team Dignitas EU) hizo su debut en la LCS EU durante el torneo de clausura del 2016 y pudo experimentar la agresividad del alto nivel de juego que allí se presenta. De esta forma, el equipo tuvo que luchar para salir del torneo de promoción de verano, en el que vencieron a Giants Gaming en un emocionante combate al mejor de cinco para conseguir un pase a la LCS EU. Splyce tuvo un exitoso torneo de clausura en el que consiguieron un segundo lugar, algo totalmente inesperado luego del descenso que sufrieron en primavera. Luego de haber arrasado en la competencia del Guantelete europeo, el joven equipo rebosa de confianza para encarar el Campeonato Mundial 2016. Es hora de mostrarle al mundo que el torneo de clausura no fue una casualidad, y que Splyce ha llegado para quedarse.</p>\n\n<p><strong>Entrenador: Jakob \"YamatoCannon\" Mebdi</strong></p>","pt_BR":"A equipe da Splyce (antiga Team Dignitas EU) fez sua estreia na EU LCS durante a Etapa de Primavera 2016 e teve um choque de realidade com o calibre de jogo da LCS. Como resultado, a equipe teve que passar pelo Torneio de Promoção de Verão, onde conseguiram derrotar a Giants Gaming em uma emocionante melhor de 5, ganhando seus ingressos de volta para a EU LCS. A Splyce então teve uma explosão de sucesso na Etapa de Verão, conseguindo o segundo lugar - um sucesso e tanto depois de sua quase relegação na Etapa de Primavera. Agora que a equipe despachou a competição no cenário europeu, todos estão transbordando de confiança para o Campeonato Mundial 2016. Está na hora de mostrar para o mundo que a Etapa de Verão não foi mera sorte e que a Splyce chegou para ficar.","en_GB":""},"foreignIds":{"drupalId":"4032"},"players":[232,336,387,588,663,954,1771],"starters":[232,336,387,588,954],"subs":[663,1771]},{"id":165,"slug":"vitality","name":"Team Vitality","guid":"be6fe2a1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vitality-2eb9w6iv.png","acronym":"VIT","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:57:43.000Z","updatedAt":"2017-06-30T14:09:41.000Z","bios":{"de_DE":"<p>Für Team Vitality geht es 2017 vor allem um Beständigkeit. Die Mannschaft beendete den Sommer-Split der EU LCS 2016 mit neun Unentschieden, dem Höchstwert der Liga. Sie landeten auf dem siebten Platz, wodurch sie zwar dem Frühjahrs-Aufstiegsturnier entgingen, aber nicht in die Entscheidungsspiele einziehen konnten.\n\nVitality hat sich für das neue Jahr Verstärkung auf der unteren Lane geholt. Mit Steeelback und Hachani und einem neuen Liga-Format, durch das es keine Unentschieden mehr gibt, ist Vitality in dieser Saison dafür prädestiniert, mehr Siege einzufahren.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Mannschaftsleiter: Michael \"Garki\" Bolze</p>","pl_PL":"<p>Vitality to francuska organizacja znana do tej pory głównie na scenie gier FPS, która postanowiła jednak zainwestować także w dywizję League of Legends. 9 grudnia 2015 roku ogłosiła ona odkupienie miejsca od zasłużonego Gambit Gaming. Niemal od razu do organizacji dołączył Raymond „KaSing” Tsang, który ostatecznie nie doszedł do porozumienia z Team SoloMid. To właśnie wokół angielskiego wspierającego został zbudowany zespół i 14 grudnia 2015 roku formacja ogłosiła tożsamość pozostałych zawodników. Miejsce na górnej alei zajął uznawany za jednego z najlepszych, o ile nie najlepszego, górnych w Europie – Francuz Lucas „Cabochard” Simon-Meslet. Środkową linię wypełnił Erlend „Nukeduck” Holm, który opuścił Team ROCCAT. Nowym dżunglerem został znany z występów w Copenhagen Wolves i Elements Ilyas „Shook” Hartsema. Tymczasem partnerem KaSinga na dolnej alei został Petter „Hjärnan” Freyschuss, z którym Anglik występował już w H2k. Trenerem zespołu ogłoszono znanego ze współpracy z Gambitem w letnim splicie 2014 byłego dżunglera, Kévina „Shaunza” Ghanbarzadeha. Drużynie udało się zbudować mocny skład i cel formacji na wiosnę 2016 to z pewnością walka o najwyższe cele.</p>\n<p>W wiosennym splicie EU LCS 2016 drużyna Team Vitality zadziwiła wszystkich fanów. Przygotowanie graczy do rozgrywek było godne podziwu, patrząc na wiek organizacji. Ten świeży zespół rozpoczął ten okres od zajęcia czwartego miejsca w pierwszym tygodniu i do samego końca nie spadł niżej. Jego wyniki były o tyle imponujące, że udało mu się czterokrotnie skończyć tydzień, wygrywając oba mecze. Natomiast ani razu drużyna Team Vitality nie przegrała obydwóch spotkań, dzięki czemu skończyła wiosenny split EU LCS 2016 na podium. Zajęcie zaszczytnego trzeciego miejsca było efektem 13 zwycięstw i zaledwie 5 porażek. Jednak to nie koniec laurów zebranych przez zespół. Zawodnicy Team Vitality otrzymali nagrodę najbardziej wartościowych graczy w piątym i szóstym tygodniu. Ponadto górny i wspierający zostali wyróżnieni w zestawieniu najbardziej profesjonalnych graczy. Powyższe osiągnięcia najlepiej oddaje współczynnik ZZA członków Team Vitality – wszyscy znaleźli się w pierwszej czwórce graczy w kategorii swojej własnej roli.</p>\n<p>Po tak udanych występach fani spodziewali się fantastycznego występu na wiosennych rozgrywkach barażowych EU LCS 2016. Jednak zespół Team Vitality poległ już w pierwszym spotkaniu, ulegając najstarszemu w lidze – Fnatic. Przegrana była o tyle bolesna, że pomimo wcześniejszych wysiłków organizacja znalazła się na piątym miejscu ex aequo. W przerwie przed rozpoczęciem letniego splitu EU LCS 2016 zostały podjęte decyzje o zmianie składu drużyny. Biorąc przykład z innych organizacji, Team Vitality zdecydowała się na podpisanie kontraktu z dwoma zawodnikami wywodzącymi się z Korei Południowej. Jednak w odróżnieniu od wielu innych, potrafili się sprawnie komunikować w języku angielskim, więc od razu przeszli do treningów, aby w nadchodzącym splicie osiągnąć jeszcze lepszy wynik.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Menedżer drużyny: Michael \"Garki\" Bolze</p>","en_US":"<p>For Team Vitality, consistency will be the name of the game in 2017. The team finished with 9 match ties in the 2016 EU LCS Summer Split, the most in the league. That landed them in 7th place for the split, allowing them to avoid the Spring Promotion Tournament but leaving them out of the playoffs.</p>\n\n<p>With a new year upon them, Vitality has upgraded their bot lane. With Steeelback and Hachani lining up down south, and with a new league format that eliminates ties, Vitality is primed to pick up some more W’s this season.</p>\n<p>Head Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Team Manager: Michael \"Garki\" Bolze</p>\n","es_ES":"<p>Ni llegaron a tiempo a la cita del 5 de noviembre ni hacen uso de la letra V como llamada a la venganza, sino a la victoria, pero si algo comparte Team Vitality con la novela gráfica de de Alan Moore y David Lloyd es la intención de hacer saltar algo por los aires. En este caso, la LCS EU.</p>\n\n<p>La organización francesa, conocida sobre todo por sus escuadras de Call of Duty, ha aprovechado la inadaptación de Gambit Gaming con respecto al desarrollo de la industria de los deportes electrónicos para expandir sus horizontes mediante la adquisición de su plaza en la máxima competición continental.</p>\n\n<p>La falta de experiencia en la Grieta del Invocador no ha supuesto un problema para Team Vitality a la hora de confeccionar su alineación explosiva, que mezcla veteranía y potencial. El buen hacer de los galos en otras disciplinas se ha traducido en una gran reputación que, junto a una fuerte inversión deportiva, ha actuado como aval en el proceso de seducción de algunos de los mejores talentos de Europa con el objetivo de dinamitar la clasificación.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Jefe de equipo: Michael \"Garki\" Bolze</p>","fr_FR":"<p>Vitality rejoint Splyce et G2 Esports dans le trio des nouvelles équipes participant aux LCS EU. Le cœur de la formation de Vitality semble être composé d'anciens talents d'H2K et de Gambit Gaming, avec notamment le top-laner Lucas « Cabochard » Simon-Meslet et le support Raymond « KaSing » Tsang. Vitality a également recueilli le coach de GMB, Kévin Ghanbarzadeh, dans l'espoir que son expérience aide à souder les membres de l'équipe. Si Vitality est nouvelle, ses joueurs ne le sont pas, eux, et ils savent exactement à quoi s'attendre durant le segment printanier des LCS EU 2016.</p> \n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Responsable d’équipe: Michael \"Garki\" Bolze</p>"},"foreignIds":{},"players":[84,190,205,328,384,1089,1704],"starters":[84,190,328,384,1089],"subs":[205,1704]}],"players":[{"id":84,"slug":"cabochard","name":"Cabochard","firstName":"Lucas ","lastName":"Simon-Meslet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cabochard-iak53xzd.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T10:49:06.000Z","bios":{"en_US":"<p>Lucas “Cabochard” Simon-Meslet is looking to get back into form for 2017. After an impressive performance in the 2016 EU LCS Spring Split, Cabochard regressed last summer. He still put up some nice games on Irelia and Fiora, but like the rest of Vitality he failed to find consistency.</p>\n\n<p>Entering 2017 armed with a new botlane, Cabochard will aim to make an impact and return to his Spring Split self. Not usually one to perform as well on tanks, if Cabochard is allowed to focus on dealing damage, he should have no problem dispensing with his opponents in the top lane.</p>","de_DE":"<p>Lucas „Cabochard“ Simon-Meslet wird 2017 versuchen, seine alte Form wiederzufinden. Nach einer beeindruckenden Vorstellung im Frühjahrs-Split der EU LCS 2016 ging es für Cabochard im letzten Sommer bergab. Er lieferte zwar mit Irelia und Fiora ein paar ansprechende Leistungen ab, aber ihm fehlte wie dem Rest von Vitality die Beständigkeit. \n\n2017 beginnt mit einem neuen Duo auf der unteren Lane und Cabochard wird versuchen, wieder zu seiner Form aus dem Frühjahrs-Split 2016 zurückzufinden. Cabochard liefert mit Tanks zwar nicht die besten Leistungen ab, aber wenn er sich auf Schaden verursachende Champions konzentrieren kann, wird er mit seinen Gegner auf der oberen Lane Schlitten fahren.</p>","fr_FR":"<p>Durant l'intersaison 2015, Lucas « Cabochard » Simon-Meslet a rejoint Team Vitality, une nouvelle organisation qui a acquis la place de Gambit aux LCS. Lorsqu'il était chez Gambit, Cabochard préférait grandement les champions AP, tels que Kennen et Morgana. Il a également joué avec quelques champions tanky, mais il revenait souvent à ses incroyables Fizz et Ryze. Bien que les performances de Cabochard aient diminué quelque peu vers la fin de la saison et aux play-offs, son potentiel restait suffisant pour lui garantir une place chez VIT en 2016.</p>","es_ES":"<p>Si bien es cierto que Lucas ‘Cabochard’ Simon-Meslet es un jugador agresivo que disfruta bajo la luz de los focos que apuntan al principal artífice de la victoria, en realidad no hace honor a la terquedad que su apodo le presupone al ser capaz de anteponer los intereses del colectivo a los suyos.</p>\n\n<p>De hecho, uno de los desafíos que se ha autoimpuesto con tal de estar a la altura de las expectativas en torno a su potencial es demostrar su versatilidad en la calle superior. El francés pasó de competir ocasionalmente junto a leyendas de la talla de Danil ‘Diamondprox’ Reshetnikov a, en cuestión de meses, amasar una ingente cantidad de recursos para liderar a aquellos a los que otrora admiraba.</p>\n\n<p>El protagonismo de Cabochard en Gambit Gaming se saldó con un éxito moderado, aunque no impidió que el joven se quedara con una espinita clavada ante la oportunidad perdida de clasificarse para los Playoffs de verano tras la polémica sanción a Konstantinos ‘FORG1VEN’ Tzortziou. De nada le sirvieron al joven jugador los elogios que propios y extraños dedicaban a sus actuaciones con campeones como Morgana, Kennen o Hecarim. Cabochard apuntó alto, pero acabó luchando por la permanencia en la máxima competición europea.</p>\n\n<p>Una vez conocido el éxito gracias a la conquista de la novena edición de la Intel Extreme Masters Colonia, Cabochard se ha unido a Team Vitality con el objetivo de hacer desaparecer de su paladar el agridulce sabor que le dejó creer que podría haber incluso participado en el Campeonato Mundial 2015 de contar con el tirador griego para reencontrarse con la miel de la victoria.</p>","pl_PL":"<p>18-letni, francuski top-laner swoją profesjonalną karierę rozpoczynał stosunkowo niedawno, bo w sierpniu 2013 roku. Początkowo występował w mniej znanych formacjach takich jak COREPLAY, GSI Gaming czy Heavy Botlane. Z tą ostatnią drużyną z całkiem niezłej strony zaprezentował się jednak w kwalifikacjach EU Challenger Series, odpadając dopiero w ostatnim meczu przeciwko faworytom zmagań. Co ciekawe, w GSI Gaming oraz HB Cabochard grał razem ze swoim bratem, Ugo „Istarim” Simon-Mesletem.</p>\n<p>\nPierwszym ważnym momentem w karierze francuskiego gracz był występ w piątym tygodniu letniego splitu EU LCS 2014, kiedy to Cabochard zastąpił mającego problemy z wizą Evgeny’ego \"Dariena\" Mazaeva. Cabochard zaprezentował się z niezłej strony i z pewnością miało to wpływ na to, że w miesiąc później otrzymał ofertę od pragnącego powrócić do elitarnych rozgrywek Ninjas in Pyjamas, na którego czele stał były mid-laner Gambitu Alexey „Alex Ich” Ichetovkin. Aspiracje te pozostały niespełnione, ale talent Francuza po raz kolejny dostrzegł Gambit, który tym razem szukał stałego zastępstwa dla Dariena. Był to drugi ważny moment w karierze francuskiego top-lanera. </p>\n<p>\nLucas do tego czasu był niezłym zawodnikiem, ale nie wyróżniał się zanadto nawet na tle rywali z Challenger Series. Tymczasem kiedy zaczął występować w EU LCS zrobił ogromny postęp i zaskoczył wszystkich, szybko stając się jednym z najlepszych graczy górnej alei na Starym Kontynencie. Co prawda Gambit spisywał się poniżej oczekiwań, ale jedyną osobą, do której kibice nie mogli mieć najmniejszych zastrzeżeń był właśnie Cabochard, który prezentował równą, wysoką formę przez cały 2015 rok. </p>\n<p>\nW tym czasie Francuz dał się poznać jako niesamowicie utalentowany mechanicznie zawodnik o bardzo szerokim champion poolu i jednocześnie gracz, który nie boi się niestandardowych rozwiązań. To właśnie on był pionierem, jeśli chodzi o wykorzystanie Gankplanka na profesjonalnej scenie – można powiedzieć, że grał piratem zanim jeszcze to było modne, bowiem wybierał tą postać jeszcze przed zmianami, które dotknęły bohatera.</p>\n<p>\nW letnim splicie EU LCS 2015 Cabochard najczęściej grał Hecarimem (4 razy) i Fizzem (trzykrotnie). Francuz był w tej edycji rozgrywek drugim najczęściej zabijającym top-lanerem i najlepiej farmiącym graczej górnej alei. W większości statystyk znajdował się na podium na swojej pozycji. Interesujący, choć nie do końca chwalebny, jest fakt, że zabierał też najwięcej złota drużynowego wśród zawodników górnej linii. Zdawałoby się to potwierdzać mentalność Cabocharda, który zawsze dąży do tego, by mieć duży wpływ na poczynania zespołu. Z tego powodu często prosi swoich dżunglerów o ganki, na co narzekali niektórzy jego byli koledzy z drużyny jak na przykład Tri Tin „K0u” Lam, z który Cabochard występował w barwach NiP. </p>\n<p>\nCo ciekawe, nick francuskiego top-lanera po francusku znaczy „uparty”, a motywacją do przyjęcia takiego właśnie pseudonimu dostarczyła zawodnikowi piosenka Cabochards autorstwa 25G i Setha Gueko.</p>"},"foreignIds":{"drupalId":"1489","TRLH3":"200000119","TRLH4":"200000222"},"socialNetworks":{"twitch":"www.twitch.tv/cabochardlol","facebook":"www.facebook.com/CabochardLol/","twitter":"https://twitter.com/CabochardLoL"},"champions":[],"liveGameTeam":165},{"id":190,"slug":"vander","name":"Vander","firstName":"Oskar","lastName":"Bogdan","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vander-edwzo382.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T10:57:12.000Z","bios":{"en_US":"<p>Oskar \"Vander\" Bogdan is one of the most veteran supports in the EU LCS. With a career that goes back to 2012, Vander has the experience any team would value in a support. After spending a split in the Challenger Series, he's making his return to the EU LCS as part of Team Vitality. He'll want to prove he's anything but past his prime as he leads Vitality in the 2017 EU LCS Summer Split.</p>","de_DE":"<p>Trotz seiner jungen 21 Jahre spielt Oskar „VandeR“ Bogdan seit 2011 kompetitiv League of Legends, also praktisch schon fast seit es das Spiel überhaupt gab. Erstes großes Aufsehen erregte er jedoch erst Ende 2013 mit der polnischen Mannschaft, bekannt als Kiedyś Miałem Team, kurz: KMT. Schon damals war sein heutiger Teamkamerad Marcin „Jankos“ Jankowski an seiner Seite und zusammen schafften sie es mit ihrer Mannschaft bis in die letzte Runde des Qualifikationsturniers für die EU LCS Spring 2014. Die fünf Polen spielten mit einem ruhigen Stil das Spiel und überzeugten vor allem in ihrer Zusammenarbeit und Synergie während Teamkämpfen. KMT schafften einen Davidsieg gegen Ninjas in Pyjamas und vollendeten ihre Reise in die EU LCS mit einem überzeugenden 3-0-Triumph.</p>\n\n<p>In zwei dieser drei Spiele, führte VandeR seine Künste auf Thresh vor, der Champion mit dem er sich bis heute einen Namen gemacht hat. Kurz darauf übernahm das allbekannte ROCCAT die Führung über das Supporttalent und seine Freunde. Ein großes Fragezeichen schwebte über dem Kopf des blonden Polens und nach der Begegnung gegen NIP wurden nicht allzu kleine Erwartungen gestellt. Tatsächlich bewies VandeR, dass es wirklich das Zeug zum LCS-Spieler hatte, als er in der vierten Woche der EU LCS Spring 2014 den wöchentlichen MVP-Titel gewann. Zudem bekamen seine Gegner einen weiteren Champion von ihm zu sehen, welcher ihnen zuvor noch nicht mit einer solchen Effektivität entgegengekommen ist: Morgana war der zweite Go-to-Pick VandeRs. </p>\n\n\n<p>Die Leistung in der ersten Saison wurde mit dem vierten Platz in der regulären Saison und dem dritten Platz in den Playoffs belohnt und ROCCAT hatte sich im europäischen oberen Mittelfeld eingelebt. </p>\n\n<p>Jedoch ging es seitdem bergab: ROCCAT schaffte es im darauffolgenden Sommer gerade so in die KO-Phase und schied letztendlich gegen den Turnierfinalisten Fnatic auszuscheiden. Ende 2014 wurde der schwach spielende  Paweł „Celaver“ Koprianiuk durch einen anderen Pawel ersetzt, nämlich Pawel “Woolite” Purski. Doch auch mit ihm gelang es VandeR im Frühling 2015 nicht die Top-Plätze der LCS zu erreichen, im Gegenteil: Er entging nur knapp der Relegation in die Challenger Series. Nach einer kurzen Pause drehte sein Mid-Laner Erlend “nukeduck” Holm auf und beschenkte dem nicht mehr ganz so polnischen Team Siege über Siege, bis sie es schließlich im Viertelfinale eine unerwartete Niederlage gegen Unicorns of Love erlitten. </p>\n\n<p>Ein letzter Pfad zur Weltmeisterschaft eröffnete sich durch das regionale Qualifikationsturnier, in welchem VandeR überragend spielte. Mit fünf verschiedenen Champions kämpfte er sich mit seinen Freunden bis in die zweite Runde des Turniers und ein fünftes Spiel gegen den Turniersieger Origen vor. Zwar verloren sie die Begegnung, doch es war ein klares Statement. 2016 könnte wieder ein Jahr sein, in dem VandeR zu VandeRLife mutiert und VandeRnoob hinter sich lässt.</p>\n\n<p>„Es gibt keinen offensiven oder defensiven Spielstil. Es gibt nur den richtigen“ – das ist sein Motto.</p>\n\n","pl_PL":"<p>Polski wspierający przeszedł długą drogę zanim udało mu się dostać do EU LCS I zostać jednym z najlepszych supportów na kontynencie. </p>\n\n<p>Początek jego kariery miał miejsce jeszcze w 2011 roku, w barwach organizacji Delta eSports, ale na dobre wszystko zaczęło się w rok później. Pomiędzy sierpniem 2012 roku a kwietniem 2013 Vander występował kolejno w polskim zespole EloHell, ale także w międzynarodowych formacjach, takich jak The Mighty Midgets, mousesports, Millenium czy Eternity Gaming. W międzyczasie wystartował też w kwalifikacjach do pierwszego splitu EU LCS w historii, ale jego zespół, Trudniej Już Nie Będzie, pożegnał się z rywalizacją już w fazie grupowej, po dwóch przegranych spotkaniach. Co ciekawe, aż do przygody z Eternity Gaming polski gracz pełnił rolę… strzelca i dopiero zmiany we wspomnianym zespole sprawiły, że zmienił pozycję i został wspierającym.</p>\n\n<p>Przełomowe dla Vandera było dołączenie do polskiego zespołu Kiedyś Miałem Team, choć drużynie nie od razu udało się zbudować stały skład. KMT istniało od września 2012 roku i przez formację przewinęło się wielu znanych na polskiej scenie zawodników. Vander dołączył do formacji już w okresie, kiedy zmian nie było tak wiele, choć nadal się zdarzały. Ostatecznie zespół znalazł sobie organizację, którą było… H2k. Początkowo dla Vandera nie było miejsca w nowej drużynie, ale po zaledwie pięciu dniach zastąpił w składzie drużyny Piotra „SuperAZE’a” Prokopa. Później zespół przeniósł się do GF Gaming, a w międzyczasie doszło jeszcze do kilku niewielkich rotacji. Ostatecznie pod szyldem Kiedyś Miałem Team ekipa spróbowała swoich sił w kwalifikacjach do EU LCS. Drużyna w składzie Xaxus-Jankos-Overpow-Celaver-Vander dostała się do baraży, w których zwyciężyła z faworyzowanym Ninjas in Pyjamas. Nowy zespół, występujący już pod banderą Teamu ROCCAT, zaskakująco dobrze radził sobie w swoich pierwszych splitach w stawce , notując trzecie i czwarte miejsce w play-offach w 2014 roku i niemalże uzyskując bilety na Mistrzostwa Świata. Jednocześnie Vander szybko wyrósł na jedną z gwiazd zespołu, zachwycając głównie niesamowitymi umiejętnościami mechanicznymi. Szczególnie było to widoczne, gdy dostawał w swoje ręce Thresha, który do dziś jest jego najbardziej znaną postacią. To on był też jednym z pierwszych graczy EU LCS, który dostrzegł potencjał Morgany w roli wspierającej. W 2015 roku przyszedł czas na zmiany w składzie zespołu i rozczarowujące występy, choć znów do wyjazdu na MŚ nie było daleko… Polski support był w tym czasie, obok Jankosa, najsilniejszym punktem zespołu. Powiększył też znacznie swój champion pool, który zaczął wykraczać poza dwie wspomniane wcześniej postaci: w letnim splicie 2015 Vander najczęściej decydował się na wybór Alistara (8 gier), Nautilusa (4 gry) i oczywiście Thresha (4 gry).</p>\n\n<p>Przed wiosennym splitem 2016, wspierający przeniósł się wraz z dżunglerem Marcinem „Jankosem” Jankowskim z Teamu ROCCAT do H2k-Gaming.</p>\n\n<p>Co ciekawe, polski zawodnik na początku swojej kariery posługiwał się pseudonimem Van Der Fckk, który później ewoluował w VandeRnoob, a następnie pozostał po prostu VandeR. Dodatkowo warto zauważyć, że wspierający był w letnim splicie 2015 najczęściej wardującym graczem w stawce, a także prawie najczęściej zabijającym supportem. Legitymował się również trzecim najwyższym KDA na swojej pozycji.</p>\n","fr_FR":"<p>Oskar « Vander » Bogdan a commencé la compétition dès la première saison, mais c’est en 2013 qu’il rencontre ses premiers succès, quand il réussit à se qualifier aux League of Legends Championship Series avec l’équipe polonaise Kiedyś Miałem Team après avoir tenu en échec les Ninjas in Pyjamas de Erlend « Nukeduck » Våtevik. Aussitôt, l’équipe signe avec ROCCAT et fait un départ en trombe aux LCS. Vander obtient le titre de meilleur joueur de la semaine 4 après avoir livré deux parties grandioses avec Thresh, son champion signature, et obtenu 22 de KDA. Son expérience et sa vision de jeu permettent au Polonais de prendre des décisions avisées et de guider ses coéquipiers vers la victoire.</p>\n\n<p>Alors à peine arrivé en LCS, le support permet à son équipe de truster la première place du classement provisoire de la saison printanière 2014 pendant trois semaines avant que cette dernière ne subisse une baisse de régime tandis que ses adversaires s’adaptent de mieux en mieux. Tout de même qualifiés aux play-offs, Vander et ses compatriotes obtiennent la 3e place après avoir tenu en échec l’équipe Alliance de Henrik « Froggen » Hansen.</p>\n\n<p>Après des résultats bien moins convaincants en saison estivale, l’équipe polonaise ne parvient qu’à obtenir la 6e place sur 8 pendant la saison régulière avant d’échouer au pied du podium des play-offs et se voit contrainte de jouer les matchs de relégation pour conserver sa place en LCS.</p>\n\n<p>Début 2015, Vander voit arriver un nouveau partenaire en voie du bas, Paweł « Woolite » Pruski, venu pour remplacer un Paweł « Celaver » Koprianiuk qui connaissait des difficultés contre les meilleurs carrys AD européens. Malheureusement, le résultat n’est pas celui escompté et ROCCAT peine toujours autant. C’est à la 4e semaine de la saison d’été et l’arrivée de Rasmus « MrRalleZ » Skinneholm, un carry AD plus autonome, que Vander peut enfin quitter sa voie afin d’accompagner son jungler Marcin « Jankos » Jankowski dans ses initiatives pour produire un jeu de meilleure qualité.</p>\n\n<p>L’équipe réussit à remonter à la 5e place du segment mais échoue dès le premier tour des play-offs face à Unicorns of Love. Dans la course à la qualification pour le mondial 2015, Vander et son équipe chutent de peu face à Origen. Il quitte ROCCAT en décembre et rejoint les rangs de H2K pour la saison 2016 en compagnie de son compatriote Jankos et a cette fois-ci à ses côtés un carry AD de première classe, Konstantinos « FORG1VEN » Tzortziou-Napoleon. Pendant la saison régulière, Vander excelle. Libéré par l’espace que lui procure un très bon partenaire de voie, il s’épanoui et devient une pièce maîtresse de son équipe avec laquelle il se hisse à la 2e place du classement à l’aube des play-offs avec le 2e meilleur KDA de tous les supports de sa ligue (7,11). Directement qualifié en demi-finale des play-offs, Vander perd ses espoirs de finale après la défaite 2 à 3 contre Origen. Cet été, en compagnie de la même équipe mais cette fois aux cotés de Aleš « Freeze » Kněžínek en carry AD, le Polonais aura à cœur de passer à l’étape supérieure pour enfin s’imposer en Europe, avec comme objectif le Mondial 2016 !</p>","es_ES":"<p>Como uno de los líderes de su anterior equipo, ROCCAT, Oskar ''Vander'' Bogdan evalúa constantemente el estado del juego y los movimientos de sus enemigos en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC, y en su primer split con H2K en 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó los problemas de ROCCAT atrás cuando se pasó a una calle inferior con uno de los AD carries más exigentes del juego, FORG1VEN. Comenzó a acumular víctimas enseguida con su nuevo compañero de calle, valiéndose de apoyos pesados de iniciación que le permitían facilitar asesinatos y aturdir a los enemigos para controlar los combates de equipo. Poco después, tuvo que compartir calle con Freeze, pero el nuevo AD carry quedó en el banquillo por una lesión y Vander volvió a reunirse con FORG1VEN. Aunque H2K no logró superar los playoffs para llegar a la final de verano, el liderazgo de</p> <p>Vander ha vuelto a su forma tajante habitual. Dirigirá un equipo de perdedores este año, pero con su experiencia internacional, Vander puede ayudar a que H2K sorprenda al mundo y recupere el trofeo para Europa.</p>","es_AR":"<p>Como uno de los líderes de su antiguo equipo ROCCAT, Oskar \"Vander\" Bogdan evalúa constantemente el estado del juego y los movimientos del enemigo en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC y, en su primer torneo con H2K en el 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó las peleas del equipo ROCCAT atrás para pasar directamente al carril inferior junto a uno de los ADC más demandantes del juego, FORG1VEN. Rápidamente empezó a cosechar víctimas con su nuevo compañero de carril, lo que favoreció a los soportes fuertes de iniciación, que le permitieron lograr asesinatos y tener el control del combate en equipo. Pronto tuvo a un nuevo compañero de carril en Freeze, pero, luego de que una lesión dejara fuera a su nuevo tirador, no pasó mucho para que volviera a unirse a FORG1VEN. Aunque H2K cayó en las eliminatorias antes de llegar a la final de verano, Vander volvió a liderar de forma clara y medida, tal como siempre lo ha hecho. Este año dirigirá a un equipo de jugadores de bajo nivel, pero, con su experiencia internacional, Vander puede ayudar a H2K a hacer vibrar el mundo e intentar llevarse un trofeo a Europa.</p>","pt_BR":"<p>Como coordenador das tomadas de decisão em sua antiga equipe, ROCCAT, Oskar “Vander” Bogdan está constantemente avaliando o estado do jogo e os movimentos do inimigo no Rift. O conhecimento de jogo de Vander foi primordial para o sucesso da ROC e, em sua primeira Etapa com a H2K em 2016, ele se tornou um membro essencial para a equipe.</p>\n\n<p>Vander deixou suas dificuldades com a ROCCAT para trás e fez sua transição impecável para a rota inferior junto com um dos atiradores mais exigentes do jogo, FORG1VEN.  Ele rapidamente esmagou suas vítimas com seu novo parceiro de rota, favorecendo suportes com iniciação pesada que permitiam que ele organizasse momentos de abate e atordoasse tudo em seu caminho no controle de confrontos de equipe. O suporte logo se encontrou com um novo parceiro de rota em Freeze, mas depois que uma lesão deixou seu novo atirador no banco, ele logo se reuniu com FORG1VEN. Apesar da H2K ter sido nocauteada nas eliminatórias antes de chegar na Final de Verão, as tomadas de decisão de Vander voltaram à sua antiga forma firme. Ele irá comandar uma equipe de azarões este ano, mas com sua experiência internacional, Vander pode fazer com que a H2K surpreenda o mundo enquanto tentam trazer o troféu para a Europa.</p>"},"foreignIds":{"drupalId":"1117","TRLH3":"200000234","TRLH4":"200000086","TRLH2":"1001280061","FRA1TMNT2":"25440","TRLH1":"1001380091","ESPORTSTMNT02":"200001008"},"socialNetworks":{"twitch":"http://www.twitch.tv/lolvander","facebook":"https://www.facebook.com/Vander.lol","twitter":"https://twitter.com/VanderLCS"},"champions":[],"liveGameTeam":165},{"id":205,"slug":"shlaya","name":"Shlaya","firstName":"Tony","lastName":"Carmona","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/shlaya-1gibq14m.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2016-01-28T22:37:16.000Z","bios":{"en_US":"<p>Tony “Shlaya” Carmona is substitute mid laner for Team Vitality.\n</p>","de_DE":"<p>\nTony „Shlaya“ Carmona spielt schon seit der ersten Stunde League of Legends, an Wettbewerben nimmt er bereits seit 2011 teil. Er verbrachte mehrere Jahre in der EU LCS, sowohl als Starter, als auch als Ersatzspieler, und er hat als AD-Carry, Mid-Laner und Top-Laner an Wettbewerben teilgenommen. 2015 kam Shlaya als Ersatzspieler zu Team Vitality.\n</p>","fr_FR":"<p>\nTony « Shlaya » Carmona est un joueur de League of Legends de longue date, sa participation à la compétition remontant à 2011. Au sein des LCS EU, il a joué pendant des années comme titulaire et remplaçant, évoluant en compétition comme carry AD, sur la voie du haut et sur la voie du milieu. Shlaya a rejoint les rangs de Fnatic comme remplaçant en 2015.\n</p>","es_ES":"<p>\nTony ''Shlaya'' Carmona es un auténtico veterano de League of Legends, con un historial competitivo que se remonta a 2011. Pasó varios años en la LCS de EU como titular y como suplente y ha jugado en el circuito profesional como AD carry, calle central y calle superior. En 2015 se incorporó a Fnatic como suplente.\n</p>","pl_PL":"<p>\nTony „Shlaya” Carmona jest długoletnim graczem w League of Legends. Swoją przygodę z grą rozpoczął jeszcze w 2011 r. Przez wiele lat uczestniczył w rozgrywkach EU LCS, zarówno jako zawodnik początkowego składu, jak i rezerwowy. Pełnił funkcję prowadzącego, gracza w środkowej alei, a także w górnej.  Shlaya dołączył do Fnatic jako rezerwowy w 2015 r.\n</p>","pt_BR":"<p>\nO histórico de Shlaya vem desde 2011. Ele passou vários anos na LCS EU, tanto como titular quanto reserva, e jogou competitivamente nas rotas do meio, do topo, e como atirador. Ele entrou na Fnatic como reserva em 2015.</p>"},"foreignIds":{"drupalId":"1123","TRLH3":"1001220080","TRLH4":"1001190130"},"socialNetworks":{"facebook":"https://www.facebook.com/ShLaYa.Tony","twitter":"http://twitter.com/ShLaYa","twitch":"http://www.twitch.tv/shlaya"},"champions":[],"liveGameTeam":165},{"id":232,"slug":"trashy","name":"Trashy","firstName":"Jonas ","lastName":"Andersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trashy-epw5lsut.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:40:20.000Z","bios":{"en_US":"<p>Jonas “Trashy” Anderson spent years jumping between teams until everything finally clicked with Splyce. A jungler with a wealth of experience, Trashy even spent time in the NA LCS for Enemy eSports. When he found a home on Splyce, it wasn’t long before he became a top jungler in the EU LCS.</p>\n\n<p>It will take more than a disappointing performance at the 2016 World Championship to stop this jungler from improving. At the helm of what is still a young team, Trashy is poised to take big leaps forward with Splyce in 2017. And if he’s allowed to have his way in the jungler, he’ll be taking the rest of the EU LCS out with the rest of the garbage.</p>","de_DE":"<p>Jonas „Trashy“ Anderson hat immer wieder die Mannschaft gewechselt, bis er endlich bei Splyce landete. Trashy ist ein Jungler mit viel Erfahrung, der eine Zeit lang sogar bei Enemy eSports in der NA LCS spielte. Nachdem er bei Splyce ein neues Zuhause gefunden hatte, dauerte es nicht lange, bis er zu einem der besten Jungler der EU LCS wurde.\n\nEs braucht mehr als eine enttäuschende Vorstellung bei der Weltmeisterschaft 2016, um diesen Jungler daran zu hindern, immer besser zu werden. Trashy ist am Ruder dieser jungen Mannschaft und bereit, mit Splyce 2017 große Sprünge zu machen. Und wenn er im Dschungel ungestört tun und lassen kann, was er will, wird er die anderen Mannschaften in der EU LCS zusammen mit dem Müll entsorgen.</p>","fr_FR":"<p>Jonas « Trashy » Andersen est à la fois le petit nouveau de chez Splyce et l'un des deux seuls de son équipe à avoir déjà fait l'expérience des LCS avant cette année. </p>\n\n<p>Le jungler danois a en effet pris part au segment de printemps des LCS NA en 2015 au sein de l'équipe Enemy eSports. Comme son compatriote Lucas « Santorin » Tao Kilmer Larsen avant lui, Trashy a en effet pris le risque de traverser l'atlantique pour y rejoindre une équipe semi-professionnelle et tenter de devenir joueur professionnel en Amérique du Nord. Après une qualification relativement aisée pour les Challenger Series, son équipe et lui ont entrepris une domination sans partage sur l'antichambre des LCS. Ils n'ont perdu en tout et pour tout qu'un seul match de la saison régulière, face à Team Fusion, eux-même favoris pour la qualification en LCS ! C'est logiquement que Enemy a ensuite dominé les play-off pour empocher la qualification automatique pour le segment d'été des LCS NA. </p>\n\n<p>Malheureusement pour Trashy et les siens, la suite de l'histoire n'a pas été aussi rose, loin de là. Pas suffisamment préparée au niveau d'exigence et de jeu nécessaire au plus haut niveau nord-américain, l'équipe a enchaîné défaite sur défaite. Incapables de hausser leur niveau de jeu, les Enemy ont terminé leur saison à une piteuse 9ème place. Pire, ils ont bu le calice jusqu'à la lie en se faisant éliminer 3 victoires à rien par Team Coast lors du tounoi de relégation. </p>\n\n<p>Une expérience difficile à vivre pour un joueur qui a bien cru que sa carrière allait se terminer là, alors même qu'il était sans doute le meilleur joueur de son ancienne équipe. Il avoue lui même avoir été « surpris » quand Splyce a pris contact avec lui malgré sa récente élimination des LCS NA. Un contact bienheureux pour le joueur donc, un contact remotivant aussi. Trashy a repris espoir et pense aujourd'hui que « jouer avec quatre autres danois est la bonne décision » pour sa carrière et que Splyce « va surprendre beaucoup de monde » en 2016, comme il l'a affirmé au DailyDot. </p>\n\n<p>Quoiqu'il en soit, avec des joueurs prometteurs à ses côtés, Trashy a à présent toutes les armes en main pour réussir. </p>","es_ES":"<p>Jonas ''Trashy'' Andersen llega desde Dinamarca cargado de experiencia. Jugó en equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, además de participar en la LCS NA con Enemy eSports. Pero Trashy no tardaría en echar de menos su casa, así que volvió a la LCS EU al final de 2015 y se unió a Splyce.</p>\n\n<p>Tras probar por primera vez la alta esfera competitiva europea en el split de primavera de la LCS EU 2016, Trashy subió el listón del split y se convirtió en uno de los mejores junglas de Europa. Sus mejoras ayudaron a que Splyce obtuviese el segundo puesto en la temporada regular, y una gran clasificación en el Clasificatorio Regional de la LCS EU. Trashy lidera un equipo que está dispuesto a llegar al cielo. ¿Conseguirán los equipos de alto nivel del Campeonato Mundial 2016 traer a Trashy y a Splyce de vuelta a la tierra, o el joven equipo nos sorprenderá a todos? Pronto lo descubriremos.</p>","pl_PL":"<p>Trashy jest najnowszym nabytkiem formacji (dołączył do drużyny 16 listopada 2015 roku) I jednocześnie najbardziej doświadczonym graczem w zespole. Duński dżungler na profesjonalnej scenie znajduje się już od 2012 roku i w tym trakcie swojej kariery miał okazję występować w składach takich drużyn jak Tricked eSports, Reason Gaming, Cloud 9 Eclipse czy SK Gaming Prime. W tym czasie Trashy występował głównie w Challenger Series, ale próby dostania do EU LCS kończyły się porażką zarówno w przypadku Reason Gaming, jak i SK Gaming Prime. Duńczykowi udało się awansować do najwyższej klasy rozgrywkowej (letni split NA LCS 2015) dopiero z amerykańskim Enemy eSports, choć formacja długa wahała się czy zatrudnić duńskiego leśnika. Co ciekawe, ostatecznie zarząd przekonała deklaracja Trashy’ego, że.. zapłaci za lot z własnej kieszeni, tylko po to, by móc wziąć udział w testach, które organizował zespół. </p>\n<p>\nNiestety amerykańska przygoda Duńczyka zakończyła się na dwóch splitach występów, w tym zaledwie jednym spędzonym w NA LCS i jednym w NA Challenger Series. Jednak w tym czasie duński zawodnik dał się poznać jako jeden z najmocniejszych punktów NME – w większości klasyfikacji indywidualnych znalazł się w pierwszej piątce wśród dżunglerów tamtejszych rozgrywek, a jeśli chodzi o procentowy udział w zabójstwach oraz najmniejszą ilość śmierci udało mu się nawet wskoczyć na podium. Teraz powrócił do Europy skuszony ofertą Splyce i w sumie ciężko się dziwić, że wybór FE padł właśnie na niego. Zespół szukający duńskiego dżunglera nie mógł bowiem trafić lepiej (no może z wyjątkiem Dennisa \"Svenskerena\" Johnsena, który miał jednak inne plany, bowiem dołączył do Teamu SoloMid). </p>\n<p>\nTrashy w trakcie swojej kariery dał się poznać jako znakomity gracz Elise oraz Rengara, choć w letniej edycji NA LCS 2015 najczęściej wybierał Rek’sai oraz Gragasa ze względu na siłę tych postaci. Ciekawostką może być fakt, że Thrashy bardzo dobrze zna się z innym duńskim dżunglerem, który występował w Ameryce – Lucasem \"Santorinem\" Tao Kilmer Larsenem.</p>\n<p>\n„Jestem bardzo zadowolony z dołączenia do byłego DIG EU, teraz Follow eSports… Byłem nieco zaskoczony, kiedy drużyna ta skontaktowała się ze mną po fiasku meczów barażowych w barwach mojego byłego zespołu, NME. Jednak nie mam wątpliwości, że dołączenie do tych czterech duńskich facetów jest właściwą decyzją.” – powiedział Trashy w wywiadzie dla portalu Daily.dot.</p>\n<p>\nZadowolenie Trashy’ego nie może dziwić. Wszak przyznał wcześniej w żartach, że uważa Duńczyków za… Koreańczyków Europy. A tutaj ma ich pod dostatkiem!\n</p>","es_AR":"<p>Oriundo de Dinamarca, Jonas \"Trashy\" Anderson tiene una vasta experiencia. Ha jugado para equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, sin mencionar su paso por la LCS NA con Enemy eSports. Sin embargo, no pasó mucho para que Trashy comience a echar de menos su hogar. Regresó a la LCS EU a finales del 2015 para unirse a la nueva formación de Splyce.</p>\n\n<p>Después de tener su primera experiencia en la competencia europea de primer nivel en el torneo de apertura de la LCS EU 2016, Trashy se esforzó aún más en el torneo de clausura, hasta llegar a ser uno de los mejores jungleros de Europa. Su mejora sirvió para que Splyce llegara al segundo lugar en la temporada regular y tuviera una excelente actuación en la clasificatoria regional de la LCS EU. Trashy dirige el timón de un equipo que va derecho a las nubes. ¿Lograrán los equipos de primer nivel del Campeonato Mundial 2016 enviar a Trashy y Splyce de regreso a la tierra? ¿O acaso el joven equipo conseguirá sorprendernos a todos? Estamos a punto de descubrirlo.</p>"},"foreignIds":{"drupalId":"1409","TRLH4":"200000207","TRLH3":"200000104"},"socialNetworks":{"twitch":"twitch.tv/trashylol","facebook":"facebook.com/Trashylol","twitter":"twitter.com/SPY_Trashy"},"champions":[],"liveGameTeam":97},{"id":328,"slug":"steeelback","name":"Steeelback","firstName":"Pierre","lastName":"Medjaldi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/steeelback-6w0pq1lj.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-18T22:51:12.000Z","bios":{"en_US":"<p>Pierre \"Steeelback Medjaldi is still looking for a team he can call home. He rose to prominence with Fnatic in 2015 but was replaced by a returning Rekkles. He joined Gambit Gaming for a split. Then he migrated to the Unicorns of Love but departed after a playoff defeat. He spent the 2016 EU LCS Summer Split with ROCCAT before deciding to move on once again.</p>\n\n<p>Steeelback and Team Vitality both hope to have found the perfect match. Steeelback's talent has never been in question; he put up impressive numbers in the Summer Split despite ROCCAT nearly getting relegated. Alongside ex-KT Rolster support Hachani, Steeelback has the potential to rival the best bot lanes in the EU LCS -- if he's willing to stick around.</p>","de_DE":"<p>Pierre „Steeelback“ Medjaldi sucht immer noch nach einem Team, in dem er sich zu Hause fühlt. Er wurde 2015 mit Fnatic bekannt, wurde später allerdings durch Rekkles ersetzt. Daraufhin spielte er einen Split bei Gambit Gaming. Danach zog es ihn zu den Unicorns of Love, die er nach einer Niederlage in den Entscheidungsspielen jedoch wieder verließ. Während des Sommer-Splits der EU LCS 2016 spielte er dann bei ROCCAT, bevor er wieder weiterzog.\n\nJetzt hoffen sowohl Steeelback als auch Team Vitality, dass sie perfekt zusammenpassen. Steeelbacks Talent steht außer Frage. Er lieferte im Sommer-Split eine beeindruckende Leistung ab, obwohl ROCCAT beinahe absteigen musste. Neben dem ehemaligen Supporter von KT Rolster, Hachani, hat Steeelback das Potenzial, die besten Duos auf der unteren Lane herauszufordern – wenn er nicht wieder die Mannschaft wechselt.</p>","fr_FR":"<p>Pierre « Steeelback » Medjaldi a rejoint les rangs de SK Gaming Prime à la fin de l’année 2014, sans trouver le succès car éliminé prématurément du tournoi d'expansion qui permettait l’accès aux League of Legends Championship Series. </p>\n\n<p>Mais le Français accède tout de même aux LCS. Steeelback est en effet repéré par son compatriote Bora « YellOwStaR » Kim par pur hasard alors que ce dernier écumait les parties classées. Le vétéran de Fnatic qui cherchait un dernier joueur pour son équipe est agréablement surpris par le niveau de jeu du carry AD. Il décèle chez lui une soif d’apprendre très développée et décide de l’inviter à le rejoindre dans sa nouvelle aventure.</p>\n\n<p>En très peu de temps, le duo français et ses trois coéquipiers réussissent à créer un jeu qu’ils exposent aux yeux d’un public européen positivement surpris. Dès la première semaine, Steeelback et ses coéquipiers montrent une cohésion impressionnante et remportent leurs deux parties. Galvanisé et guidé par un des meilleurs support au monde, le jeune joueur tient la dragée haute à certains des meilleurs carrys AD d’Europe. S’il n’est que la 3e source de dégâts d’une équipe très centrée sur son toplaner Seung-hoon « Huni » Heo, Steeelback est régulier et sait être la tornade qui vient balayer les combats d’équipe avec Corki ou Graves, ne laissant aucune chance de fuite à ses adversaire. Il signe un très bon ratio KDA de 8,9.</p>\n\n<p>Steeelback et Fnatic sont sacrés champions d’Europe après avoir remporté les play-offs et sont conviés au tournoi sur invitation de mi-saison. Le carry AD montre ses limites face à certains des meilleurs joueurs du monde et est remercié par la suite. Le management de Fnatic a indiqué être conscient du potentiel du Français mais ne pas avoir le temps d’attendre que le joueur soit formé, les ambitions du club ayant fortement augmenté.</p>\n\n<p>À la recherche d’un nouveau toit, Steeelback se tourne vers l’Amérique du Nord et rejoint Odyssey Gaming. Malheureusement, l’équipe ne parvient pas à se qualifier aux Challenger series NA. Il rejoint par la suite une équipe qui, elle, est parvenue à accéder à la compétition : Team Imagine. Après des résultats mitigés, il parvient tout de même à accéder au tournoi de promotion, mais son équipe se fait éliminer par Team 8, l’escouade sortante des LCS.</p>\n\n<p>En 2016, Steeelback revient en Europe et compte bien réitérer une bonne performance en LCS, cette fois-ci avec Unicorns of Love. Au début du segment de printemps, il s’illustre notamment avec sa Kalista, terminant le segment avec un KDA de 33 sur ce personnage et un KDA général de 6.81. Malgré de bonnes statistiques personnelles, l’équipe ne suit pas et termine à la 5ème place de la saison régulière. Une performance décevante pour Steeelback qui décide de partir pour Roccat au début du segment d’été.</p>\n","pl_PL":"<p>Pierwszą próbę zaistnienia w League of Legends Pierre podjął w drużynie GSI Gaming w sierpniu 2014 roku. Skończyło się tylko na podejściu, gdyż w jego szeregach nie wystąpił na scenie esportowej. Udało mu się pokazać z kolejnym zespołem – SK Gaming Prime, do którego dołączył w listopadzie tego samego roku. Z tą organizacją miał okazję nabrać doświadczenia i wziąć udział w Challenger Series. Jednak nie odniósł tam sukcesów, na których mu zależało.</p>\n<p>\nPrzełomem w karierze francuza było dostanie się, w styczniu 2015 roku, do sztandarowego zespołu Europy - Fnatic. Poprzedni AD Carry, „Rekkles”, postawił mu poprzeczkę bardzo wysoko. Wielu fanów było bardzo zawiedzionych wyborem Pierra Medjaldi na tą pozycję. On sam skomentował to krótko: „Chciałbym się sprawdzić w rozgrywkach EU LCS i zasłużyć na miejsce pomiędzy najlepszymi graczami AD Carry w Europie.” Miał taką okazję w wiosennym sezonie 2015 i udowodnił, że nie był złym wyborem. Fnatic po tym okresie uplasowało się na 2gim miejscu, co w dużej mierze było jego zasługą. Później poprawił ten wynik wraz z drużyną w rozgrywkach barażowych. Czołowa pozycja w Europie po pierwszym semestrze to jedno z największych dokonań Pierra. Drugie największe osiągnięcie to występ na 2015 Mid-Season Invitational. \"Steeelback\" zmierzył się na tym wydarzeniu z najlepszymi zawodnikami z całego świata i wypadł całkiem dobrze. Fnatic został zatrzymany dopiero przez SKT T1, przyszłych Mistrzów Świata, w zaciętej walce z wynikiem 2:3. Niestety wkrótce po turnieju, w maju 2015 roku, organizacja Fnatic zdecydowała się na ponowne przyjęcie Martina „Rekkles” Larssona, więc Pierre poszedł w odstawkę. </p>\n<p>\nPo tym wydarzeniu wypowiedział się, że chciałby móc się wykazać po MSI, ale taka szansa nie została mu dana. \"Steeelback\" wrócił do prób dostania się do EU Challenger Series wraz z drużyną Odyssey Gaming, lecz bez pomyślności. Następnie zasilił skład Team Imagine, które walczyło o kwalifikację do NA LCS. W rozgrywkach kwalifikacyjnych skończyli na trzeciej pozycji, przez co później musieli się zmierzyć z doświadczonym Team8. Niestety przeciwnicy okazali się mocniejsi, więc nowa drużyna Pierra pozostała w NA Challenger Series. 2 miesiące później zrezygnował dalszej walki o wejście wyżej, na rzecz propozycji zespołu, który już znajdował się w wiosennym sezonie EU LCS 2016. W listopadzie stał się członkiem Unicorns Of Love, gotowy do kolejnego podejścia w profesjonalnych rozgrywkach.</p>\n<p>\nWypowiedzi Pierra z wywiadów to nieliczne źródła, z których można się dowiedzieć czegoś o nim. To bardzo skryty gracz, z reguły rzadko udzielający się na portalach społecznościowych. Po jego wyborach w meczach można się łatwo domyślić, że najbardziej lubi grać Corkim, Lucianem i Sivir. Tymi bohaterami miał najlepsze wyniki i nim zawdzięcza wejście do Kręgu Pretendenta w Europie i Ameryce Północnej.\n</p>","es_ES":"<p>Aunque Pierre ‘Steeelback’ Medjaldi se hizo popular gracias a su fichaje por Fnatic en el Split de primavera de la LCS 2015, el jugador ya ha pasado hasta por siete equipos en menos de un año. Sin miedo a nuevos retos y aventuras, el joven francés todavía tiene una larga carrera por delante para demostrar que no sólo fue una apuesta arriesgada, sino también una garantía de futuro que explotará en Unicorns of Love.</p>\n\n<p>No es del todo cierto asegurar que Steeelback era un completo desconocido antes de fichar por Fnatic pero sí que es cierto que sus apariciones son con cuentagotas. En Agosto ficharía por GSI Gaming, equipo francés en el que también participaron Lucas ‘Cabochard’ Simon-Meslet y Aleksi ‘Hiiva’ Kaikkonen. Quizás por el contacto con el segundo pudo competir con SK Gaming Prime en el intento en Noviembre de entrar a la LCS por el torneo de promoción de primavera, aunque serían derrotados en la primera ronda por Reason Gaming.</p>\n\n<p>Aquí es cuando la vida del tirador cambia totalmente de rumbo debido al fichaje por Fnatic. Aunque el voto de confianza de Bora ‘YellOwStaR’ Kim le permitió entrar al equipo, la toma de contacto con Fnatic fue curiosamente por Fabian ‘Febiven’ Diepstraten que realizó la sugerencia para que probase por la escuadra inglesa. Durante primavera se mostró sólido pero no espectacular aunque no sería tarea fácil enfrentarse a los mejores del mundo en su posición en el Mid Season Invitational 2015. Su dominio de Sivir les otorgó una posibilidad táctica que le permitió cumplir su rol secundario.</p>\n\n<p>Pero con la llegada de Martin ‘Rekkles’ Larsson, el joven francés decidió tomar rumbo a las américas. La suerte no le acompañó ni en Odyssey Gaming al no poder clasificarse para la Challenger Series norteamericana ni en Imagine, puesto que ya en Challenger Series no fueron rival de Team8 para ascender a la League Championship Series. El jugador mostró una faceta más agresiva con campeones como Lucian o Corki que le permitieron aportar el desgaste necesario, pero todavía se mantuvo en una posición de retaguardia más pasiva.</p>\n\n<p>Con Zdravets ‘Hylissang’ Galabov la fase de líneas será un factor fundamental a la hora de decidir las partidas debido a la agresividad del búlgaro. El tirador tendrá que dar un paso adelante en su agresividad en una metajuego que a priori podría beneficiar a su Lucian, pero en el que la duda es la principal amenaza.</p>\n\n<p>Después de Fnatic y la Challenger Series norteamericana, esta supone la tercera aventura de Steeelback. El jugador ya ha afirmado su número de la suerte es el tres, de ahí las tres es en su nombre, y además también posee a tres campeones favoritos fuera de la propia posición de tirador, como son Zed, Lee Sin y Thresh. ¿Será la tercera la vencida?</p>"},"foreignIds":{"drupalId":"2903","TRLH3":"200000122","TRLH4":"200000225"},"socialNetworks":{"twitch":"http://www.twitch.tv/steeelback","facebook":"www.facebook.com/Steeelback","twitter":"http://twitter.com/Steeelb4ck"},"champions":[],"liveGameTeam":165},{"id":336,"slug":"sencux","name":"Sencux","firstName":"Chres","lastName":"Laursen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sencux-efit8ngk.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:50.000Z","updatedAt":"2017-06-09T10:40:39.000Z","bios":{"en_US":"<p>Chres “Sencux” Larsen has the makings of Europe’s next mid lane star. He made his way to Splyce after honing his skills in the Challenger scene. Sencux showed flashes of brilliance early in the 2016 EU LCS Spring Split, and in the Summer took the next step to rival the best mid laners in the league.</p>\n\n<p>At the 2016 World Championship, Sencux couldn’t quite keep up with the best mid laners in the world. But as he returns to the EU LCS with the rest of Splyce for 2017, his time on the international stage should prove to be an invaluable experience. If he can keep up his blazing pace of improvement, it won’t be long at all before he gets another shot at the world’s finest.</p>","de_DE":"<p>Chres „Sencux“ Larsen hat das Zeug zu Europas nächstem großen Star auf der mittleren Lane. Er kam zu Splyce, nachdem er sein Können in der Herausforderer-Szene perfektioniert hatte. Sencux ließ sein Können bereits zu Beginn des Frühjahrs-Splits der EU LCS 2016 aufblitzen und machte im Sommer den nächsten Schritt, um es mit den besten Mid-Lanern der Liga aufzunehmen.\n\nBei der Weltmeisterschaft 2016 konnte Sencux jedoch nicht ganz mit den besten Mid-Lanern der Welt mithalten. Aber wenn er mit dem Rest von Splyce 2017 in die EU LCS zurückkehrt, sollten sich seine Erfahrungen auf der internationalen Bühne bezahlt machen. Wenn er sich weiterhin steigern kann, wir es nicht lange dauern, bis er es wieder mit den Besten der Welt zu tun bekommt.</p>","fr_FR":"<p>Chres « Sencux » Laursen a tout juste 17 ans, joue à League of Legends depuis 4 ans et gravite dans le milieu compétitif depuis 2014. Après une première expérience chez Reason Gaming, il s'apprête à présent à découvrir les LCS accompagné d’une réputation flatteuse. </p>\n\n<p>La plupart des observateurs considèrent que le danois est, avec Luka « PerkZ » Perković de chez G2 Esports, le porte-drapeau d'une nouvelle génération de midlaners européens. Un héritage pas forcément facile à porter ! Sous les couleurs de Splyce, le joueur va en tout cas devoir le défendre face à ceux qui ont porté ce titre avant lui, à l'instar de Fabian « Febiven » Diepstraten. Y est-il prêt ? Pour être honnête et au vu de ce qu'il a montré en Challenger Series, Sencux est sans doute encore un peu tendre. Contrairement à Febiven l'an dernier, il est peu probable que le midlaner de Splyce gagne systématiquement la voie du milieu en 1v1 face à ses adversaires plus expérimentés. Sa prise de décision, particulièrement, est parfois douteuse. Malgré tout le jeune midlaner n'est pas en dessous du niveau attendu en LCS, bien au contraire. Son niveau individuel est même certainement déjà supérieur à celui de certains joueurs LCS. Il lui manque juste quelques ajustements à faire pour atteindre les sommets, mais il a à coup sur le talent nécessaire pour y parvenir. </p>\n\n<p>Il va pouvoir s'appuyer pour cela sur son style de jeu, tout en contrôle. Sur sa confiance en son jeu aussi, lui qui déclarait avant même le segment d'été des Challenger Series : « si Febiven peut passer de challenger à l'un des meilleurs midlaners, pourquoi est-ce que moi je ne pourrais pas faire de même ? » Comme dirait l'autre, y a plus qu'à !</p>","es_ES":"<p>Chres ''Sencux'' Laursen es uno de los jugadores titulares más jóvenes de la LCS EU. AspiranteTras jugar en varios equipos aspirantes diferentes, Sencux llegó a Splyce (anteriormente llamado Team Dignitas EU) y logró hacerse con un puesto en la LCS EU. Su rol en la calle central consiste fundamentalmente en debilitar constantemente a sus oponentes para controlar las batallas de equipo y los objetivos del mapa.</p>\n\n<p>Tras demostrar unas jugadas brillantes en el split de primavera de la LCS EU 2016 (como el asesinato cuádruple con LeBlanc), los espectadores y analistas se preguntaban si tiene lo que hace falta para convertirse la próxima estrella europea de la calle central. Sencux calló las voces de los escépticos y consiguió obtener con Splyce el segundo puesto en el split de verano de la LCS EU 2016 y, por consiguiente, superar la escena europea y asegurarse un puesto en el Mundial. Aunque Sencux sea capaz de lanzar hechizos a los mejores mid de Europa, la escena internacional es completamente diferente. La mayor prueba de Sencux está aún por llegar, y será una batalla a vida o muerte en la Grieta contra los mejores jugadores de League of Legends.</p>","pl_PL":"<p>Sencux to niekwestionowana gwiazda zespołu I jego najważniejszy zawodnik. To właśnie Chres dzięki swoim niesamowitym umiejętnościom i fantastycznym zagraniom najczęściej prowadzi zespół do zwycięstw. Warto jednak zauważyć, że w momencie startu wiosennego splitu EU LCS 2016 Sencux to będzie nadal bardzo młody, 17-letni zawodnik (jest ledwie pół miesiąca starszy od Wunderweara). Ogromnym problemem Duńczyka, niejako związanym z wiekiem, jest gra pod presją, której zawodnik nie zawsze potrafi sprostać. W tym aspekcie od razu nasuwa się porównanie z holenderskim mid-lanerem, Fabianem \"Febivenem\" Diepstratenem sprzed awansu do LCS z drużyną H2k. </p>\n<p>\nJednocześnie Duńczyk ma już całkiem spore doświadczenie, bowiem występuje na scenie od stycznia 2014 roku, co sprawia, że zaczynał jako zaledwie… piętnastolatek. Jego pierwszym przystankiem na drodze do wielkiej kariery był zespół Reason Gaming, gdzie spotkał Jonasa „Trashy’ego” Andersena. Później, wraz z Kasperem \"Kobbe’m\" Kobberupem oraz Martinem „Wunderwearem” Hansenem występował w 4everzenzyg oraz SK Gaming Prime-Dignitas EU, które w końcu przekształciło się w Follow eSports, a następnie w Splyce. Co ciekawe, Nicolai „Nisbeth” Nisbeth jest jedynym zawodnikiem, z którym Chres, grając w SK-DIG-FE, spotkał się po raz pierwszy. </p>\n<p>\nDuńczyk posiada bardzo szeroki champion pool, ale z pewnością największą uwagę należy zwrócić na jego Azira, Viktora oraz Twisted Fate’a, grę którymi opanował do perfekcji. Swego czasu znany był nawet jako tzw. one-trick-pony Viktora, ale gra w Challenger Series 2015 sprawiła, że obecnie większość rywali najbardziej obawia się jego Azira. Sencux powszechnie uważany jest za wielki talent i wielu znawców sceny zastanawia się nad tym jak młody zawodnik poradzi sobie w walce przeciwko najlepszym mid-lanerom na Starym Kontynencie. Jest to bardzo interesujący problem, bo niestety nawet w ostatnim, udanym dla ex-Dignitas EU splicie dało się zauważyć, że Sencuxowi obok znakomitych gier zdarzają się spotkania bardzo przeciętne i takie wahania formy mają ogromny wpływ na postawę całej drużyny, której duński mid-laner jest ważnym punktem.</p>\n<p>\n„Myślę, że Sencux jest bardzo utalentowany mechanicznie. Gra bardzo dobrze, ale ma tendencję do tiltowania dość szybko, jeśli coś nie idzie po jego myśli.” – powiedział o Sencuxie przed finałem letniego splitu EU CS 2015 jego przeciwnik, Julian \"Xioh\" Dumler (mid-laner drużyny mousesports).</p>\n<p>\nCiekawy jest fakt, że nick gracza początkowo miał brzmieć „Sencu”, ale ten pseudonim był już zajęty w momencie, w którym Duńczyk zakładał swoje konto. Wobec tego najprostszym rozwiązaniem było dodanie „x” do ksywki i właśnie tak powstał obecny nick Sencuxa.\n</p>","es_AR":"<p>Chres \"Sencux\" Laursen es uno de los jugadores más jóvenes de la LCS EU. Después de jugar en varios equipos retadores, Sencux logró llegar a Splyce (anteriormente llamado Team Dignitas EU) y se ganó un lugar en la LCS EU. Su papel en el carril central se basa mucho en realizar ataques rápidos contra los enemigos para controlar los combates en equipo y lograr los objetivos de mapa.</p>\n\n<p>Después de demostrar momentos de gran inspiración en el torneo de apertura de la LCS EU 2016 (como un asesinato cuádruple con LeBlanc), tanto espectadores como analistas se preguntaron si tendría lo que hace falta para convertirse en la próxima estrella europea del carril central. Sencux cerró la boca de todos los que dudaron de él cuando, junto a Splyce, logró el segundo lugar en el torneo de clausura de la LCS EU 2016, seguido de una victoria en el Guantelete europeo, que le garantizó un lugar en el Mundial. Aunque Sencux es capaz de lanzar hechizos con los mejores centrales de Europa, la historia es completamente diferente a nivel internacional. La prueba más difícil de Sencux está por venir, y necesitará de gran determinación al llegar a la Grieta para estar a la altura de lo mejor de lo mejor que League of Legends tiene para ofrecer.</p>"},"foreignIds":{"drupalId":"1425","TRLH3":"200000105","TRLH4":"200000208"},"socialNetworks":{"twitch":"http://www.twitch.tv/sencux","facebook":"facebook.com/Sencux","twitter":"twitter.com/\tSPY_Sencux"},"champions":[],"liveGameTeam":97},{"id":384,"slug":"nukeduck","name":"Nukeduck","firstName":"Erlend","lastName":"Holm","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nukeduck-9lfeix3.png","hometown":"Norway","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T10:41:18.000Z","bios":{"en_US":"<p>Erlend “Nukeduck” Holm enters 2017 with an eye on the new mid lane meta. The Norwegian mid laner burst onto the scene in 2013 as part of the impressive Lemondogs lineup. Since then, he’s played for Ninjas in Pyjamas and ROCCAT, and he spent all of 2016 with Team Vitality.</p>\n\n<p>Previously known for his play on assassins, Nukeduck will get the chance to shape his own meta in the 2017 Season. He’ll also need to learn to work with Vitality’s new junglers, Djoko and GBM. With the whole season in front of him, Nukeduck to forge a new identity for Vitality in 2017 and earn a spot in the playoffs.</p>","de_DE":"<p>2017 wird Erlend „Nukeduck“ Holm das Metaspiel auf der mittleren Lane genau im Auge behalten. Der norwegische Mid-Laner betrat die Szene 2013 als Teil der beeindruckenden Aufstellung der Lemondogs. Seitdem hat er für die Ninjas in Pyjamas und ROCCAT gespielt, bevor er 2016 zu Team Vitality wechselte.\n\nNukeduck, der früher für seinen Spielstil mit Assassinen bekannt war, bekommt in der Saison 2017 die Gelegenheit, sein eigenes Metaspiel zu schaffen. Außerdem wird er lernen müssen, mit Vitalitys neuen Junglern, Djoko und GBM, zusammenzuarbeiten. Doch noch liegt die gesamte Saison vor ihm und Nukeduck wird versuchen, Vitality 2017 eine neue Identität zu verleihen und mit der Mannschaft in die Entscheidungsspiele einzuziehen.</p>","fr_FR":"<p>Erlend « nukeduck » Holm est devenu célèbre avec la surprenante équipe Lemondogs en 2013. À l'époque, il était considéré à raison comme l'un des meilleurs jeunes mid-laners d'Europe. Après la dissolution de Lemondogs, nukeduck a rejoint les rangs des Ninjas in Pyjamas, puis ceux de ROCCAT avant de poser ses valises chez Team Vitality durant l'intersaison des LCS EU 2015. Même si nukeduck a dû lutter pour se faire une place dans les récentes metas des LCS EU, ses talents d'assassin devraient se combiner à merveille avec ceux de son nouveau jungler, Shook.</p>","pl_PL":"<p>Karierę Nukeducka można podzielić na cztery etapy.</p>\n<p>\nPierwszym z nich była walka o dołączenie do czołówki. Ten okres rozpoczął się dla norweskiego mid-lanera w grudniu 2011 roku od przygód z 3DMAX, Tt Dragons i H2k-Gaming. Zawodnik zaliczył też na przełomie 2012 i 2013 roku epizod w Teamie Solo Mebdi, który był jednym z faworytów kwalifikacji do pierwszego w historii splitu EU LCS. Ostatecznie zespół został zdyskwalifikowany, a Nukeduck przeniósł się do Sinners Never Sleep, które po udanych eliminacjach do letniej edycji europejskich rozgrywek w 2013 roku, zmieniło nazwę na Lemondogs. </p>\n<p>\nI tu zaczął się drugi etap – okres triumfów. Nukeduck był jedną z gwiazd tego zespołu, który okazał się fenomenem. Norweg dzielił i rządził na środkowej alei, a formacja zajęła ostatecznie drugie miejsce w letnim splicie EU LCS i pojechała na Mistrzostwa Świata. Tam nie poszło już tak dobrze i LD zakończyło rywalizację już na fazie grupowej. Wtedy też na Nukeducka spadła spora fala krytyki ze strony kolegów z drużyny, którym nie podobało się zadufanie w sobie norweskiego zawodnika. Problem polegał na tym, że mid-laner był tak pewny siebie, że nierzadko świadomie wybierał niekorzystne match-upy, by słabszą postacią ograć przeciwnika i udowodnić swoją wyższość. Nietrudno przewidzieć, że na MŚ poziom był zbyt wysoki, by ta sztuka mu się udawała. Po nieudanych MŚ zespół zmienił organizację na Ninjas in Pyjamas i, w wyniku sporego chaosu i przeoczeń, był zmuszony walczyć w barażach o utrzymanie w EU LCS. </p>\n<p>\nTutaj rozpoczął się kolejny okres w karierze Nukeducka – etap spektakularnych porażek. Dużą rolę ponownie odegrał w tej kwestii egoizm Norwega, który miał duży udział w niespodziewanej porażce w meczu barażowym przeciwko Kiedyś Miałem Team. NiP został zmuszony do rywalizacji w EU Challenger Series, a Nukeduck nieprędko wrócił do LCS. Wiosenny split EU CS był dla drużyny i samego Norwega nieudany, a niedługo później Erlend został wraz z kolegą z drużyny , Alfonso „Mithy’m” Aguirre Rodriguezem, wykluczony z gry na profesjonalnym poziomie za toksyczne zachowanie w kolejce solowej. To właśnie ten moment był punktem kulminacyjnym tego bardzo nieudanego okresu w karierze Norwega, który został zmuszony do zrobienia sobie półrocznej przerwy w karierze.</p>\n<p>\nNukeduck został odbanowany w grudniu 2014 roku i niemal natychmiast znalazł nowego pracodawcę, którym okazał się Team ROCCAT. Był to już czwarty etap – powrót na szczyt. Początki nie były dla norweskiego mid-lanera łatwe i miał on problemy z odnalezieniem się zarówno w samej grze, jak i w drużynie, w której był jedynym obcokrajowcem. Skutkowało to wyjątkowo pasywnym stylem gry, jaki stał się udziałem Nukeducka. Sprawy nie ułatwiał także bardzo wąski champion pool gracza. W konsekwencji Team ROCCAT dopiero w barażach zapewnił sobie utrzymanie w rozgrywkach. Tymczasem letnia edycja zmagań była dla Norwega już znacznie bardziej udana – zawodnik odzyskał pewność w grze i stał się ważnym punktem zespołu, ponownie prezentując wysokie umiejętności mechaniczne. W lecie Nukeduck najczęściej grał Viktorem (5), Azirem (5) i Varusem (4) i trzeba przyznać, że wychodziło mu to znakomicie, bo okazał się drugim najczęściej asystującym mid-lanerem w stawce, a także drugim graczem środka alei z największym udziałem w zabójstwach drużyny.</p>\n<p>\nNick Norwega jest złożeniem dwóch słów – „Nuke”, co oznacza błyskawiczne zmiecenie przeciwnika z powierzchni ziemi, a także „Duck”, bo… dobrze brzmiało. Mid-laner w przeszłość dużo grał w koszykówkę, a także w piłkę wodną. Nukeduck nie ukrywa również fascynacji fantastyką, a szczególnym uwielbieniem darzy „Władcę Pierścieni” oraz „Hobbita”.\n</p>"},"foreignIds":{"drupalId":"280","TRLH3":"200000121","TRLH4":"200000224"},"socialNetworks":{"facebook":"www.facebook.com/nukeducklol","twitter":"https://twitter.com/nukeducklol","twitch":"http://www.twitch.tv/nukeducklol"},"champions":[],"liveGameTeam":165},{"id":387,"slug":"wunderwear","name":"Wunder","firstName":"Martin","lastName":"Hansen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wunderwear-fgro7nyg.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-23T01:17:13.000Z","updatedAt":"2017-06-09T10:41:34.000Z","bios":{"en_US":"<p>Martin “Wunder” Hansen  is a consistent top laner -- consistently aggressive. Even when playing tanks like Nautilus and Maokai, Wunder is more than happy to overextend for a kill. That aggressive playstyle got in him trouble in his rookie split, but he adjusted and became one of the best top laners in the EU LCS.</p>\n\n<p>Wunder struggled against the best top laners in the world at the 2016 World Championship. Back on Splyce in 2017, he’ll have the chance to put what he learned into practice during the regular season. It’s not the first time people have doubted Wunder or Splyce, and Wunder would love nothing more than to silence the haters.</p>","de_DE":"<p>Martin „Wunder“ Hansen ist ein verlässlicher Top-Laner – verlässlich aggressiv. Selbst mit Tanks wie Nautilus und Maokai geht Wunder für eine Tötung gerne mal etwas mehr Risiko ein. Dieser aggressive Spielstil bereitete ihm in seinem ersten Split große Probleme, doch er passte sich an und wurde einer der besten Top-Laner in der EU LCS.\n\nBei der Weltmeisterschaft 2016 hatte Wunder Probleme, mit den besten Top-Lanern der Welt mitzuhalten. 2017 hat er mit Splyce die Gelegenheit, sein neu erlangtes Wissen während der regulären Saison in die Praxis umzusetzen. Es ist nicht das erste Mal, dass die Leute an Wunder oder Splyce gezweifelt haben, und Wunder würde nichts lieber tun, als den Kritikern den Wind aus den Segeln zu nehmen.</p>","fr_FR":"<p>Martin « Wunderwear » Hansen a tout juste 17 ans et s'apprête à découvrir les LCS EU en tant que toplaner de Splyce. Il peut en être d'autant plus fier que, comme la majeure partie de son équipe, il y est parvenu à la seule force de son talent, par le biais de la qualification en Challenger Series, puis en LCS.</p>\n\n<p>Après une première expérience en Challenger Series à l'été 2014 au sein de l'équipe danoise 4everzenzyg, déjà en compagnie de Chres « Sencux » Laursen et Kasper « Kobbe » Kobberup, qui s'est soldée par une défaite en demi-finales des Challenger Series, Wunderwear s'est lancé début 2015 dans la conquête d'une place en LCS. Cela est passé par une qualification en Challenger Series avec sa nouvelle équipe, SK Prime, au détriment de l'équipe française Thunderbot Sparta. La qualification en poche l'équipe, rachetée et renommée Dignitas EU entre temps, a terminé à la 4ème place du segment de printemps et... n'a pas pris part aux play-off ! En effet ni Sencux ni Wunderwear n'avaient atteint leurs 17 ans à ce moment. Sure de la force de ses jeunes joueurs, l'équipe a alors préféré faire l'impasse sur les play-off et sur une possible participation au tournoi de promotion et attendre le segment d'été tranquillement. </p>\n\n<p>Wunderwear a bien rendu la confiance qui lui a été ainsi accordée et a été une part importante de la réussite de son équipe lors du segment d'été, terminé avec 8 victoires et seulement 2 défaites. Terminé surtout avec une qualification en LCS après deux victoires étriquées en play-off contre Denial Esports et Mousesports. </p>\n\n<p>A présent le jeune toplaner danois s'apprête à vivre sa première saison au plus haut niveau européen et à réaliser que son parcours de l'an dernier n'a été, in fine, qu'une longue introduction. De ce qu'il a montré l'an dernier, il est encore un peu tendre pour faire face à quelqu'un comme Paul « SoaZ » Boyer mais a largement le potentiel pour combler ses lacunes d'ici à la fin du segment de printemps. A condition, bien sur, de ne pas se relâcher !</p>\n","es_ES":"<p>Martin ''Wunder'' Hansen es constante en la calle superior. Constantemente agresivo. Incluso cuando juega con tanques como Nautilus o Maokai, Wunder está encantado de arriesgarse por un asesinato. Sus jugadas le hicieron conseguir una A/M/A de 5,2 puntos en el split de verano de la Challenger Series europea. Aun así, su estilo de juego agresivo tuvo resultados variados en el primer split de la LCS EU. Con demasiada frecuencia, traspasó el límite entre una agresividad calculada y una jugada demasiado arriesgada.</p>\n\n<p>Aprendió la lección, y en el split de verano de la LCS EU 2016, Wunder y Splyce eran de lo mejor que Europa tenía que ofrecer. El crecimiento era innegable, y Wunder se convirtió en una amenaza que había que aniquilar para evitar que llevase a su equipo directo a la victoria. Puede que Wunder destaque en Europa, pero enfrentarse a jugadores de la calle superior colosales como Smeb, Duke o Looper será un reto a superar. Nadie creía antes en Wunder ni en Splyce, y nada le gustaría más que volver a silenciar a los escépticos.</p>","pl_PL":"<p>Duński, zaledwie 17-letni top-laner jest najmłodszym zawodnikiem w LCS. Dość powiedzieć, że wymagane do udziału w tych rozgrywkach siedemnaście wiosen skończył dopiero w listopadzie 2015 roku. Na profesjonalnej scenie po raz pierwszy usłyszano o nim w czerwcu 2014 roku, kiedy dołączył do 4everzenzyg wraz z… Chresem „Sencuxem” Larsenem i Kasperem „Kobbe’m” Kobberuppem, obecnymi kolegami z drużyny. Jednak dopiero przeniesienie się do SK Gaming Prime (później Team Dignitas EU), gdzie dalej występował razem z Sencuxem, sprawiło, że kariera młodego Duńczyka nabrała rozpędu. Pierwszych występów w Challenger Series, już pod banderą organizacji Dignitas, Wunderwear nie może zaliczyć do udanych. Wielu ekspertów uważało, że był w tym czasie jednym z najsłabszych ogniw zespołu i nie do końca radził sobie z presją, która towarzyszyła zmaganiom na tym poziomie. Niemniej w ciągu dwóch splitów zmagań w EU CS zrobił duży postęp i wielki talent, który od dawna jest mu przypisywany wreszcie zaczął się w pełni ujawniać. A występy przeciwko najlepszym europejskim graczom górnej alei to coś, co z pewnością pomaga jeszcze podnieść już i tak niemałe umiejętności.</p>\n<p>\nJednocześnie Wunderwear był w letnim splicie EU Challenger Series 2015 jednym z najlepszych, o ile nie najlepszym graczem górnej alei w tych rozgrywkach, co udowadniają statystyki – najwięcej asyst, prawie najwięcej zabójstw, najwyższe KDA i prawie najwyższy udział w zabójstwach wśród top-lanerów. Duński gracz górnej alei zyskał pewność w grze i regularność.</p>\n<p>\nCo ciekawe, Wunderwear ma tendencję do grania niekiedy dość nietypowymi postaciami. To właśnie duński top-laner był pierwszym zawodnikiem, który na profesjonalnej, czy też pół-profesjonalnej, scenie zdecydował się na wybór Gankplanka po reworku tego bohatera. Dał się też poznać jako doskonały gracz Tahm Kencha na górnej alei - po rzecznego potwora sięgał kilkukrotnie, nie bojąc się wybrać tego bohatera nawet w najważniejszych spotkaniach. Widzieliśmy w rękach Duńczyka także chociażby Nautilusa czy Karmę. Można więc wnioskować, że Wunderwear jest w stanie porwać za sobą tłumy europejskich kibiców, którzy przecież uwielbiają zawodników grających niestandardowymi postaciami, o czym przekonaliśmy się poprzez ogromny wzrost popularności zespołu Unicorns of Love po barażach o grę w LCS 2015 i IEM-ie w San Jose w tym samym roku.\n</p>","es_AR":"<p>Martin \"Wunderwear\" Hansen es sólido en el carril superior... sólido y agresivo. Incluso jugando con Nautilus y Maokai, a Wunderwear le encanta lograr una cantidad exagerada de asesinatos. Sus locuras le merecieron un KDA de 5.2 puntos en el torneo de clausura de la Challenger Series EU 2015. Aún así, su estilo de juego agresivo tuvo resultados muy variados en su primer torneo de la LCS EU. Casi siempre ha combinado una agresión calculada con un accionar totalmente temerario.</p>\n\n<p>Aprendió su lección, y en el torneo de clausura de la LCS EU 2016, Wunder y Splyce se convirtieron en lo mejor que Europa tenía para ofrecer. Su crecimiento era indiscutible, y Wunder pasó a ser una amenaza que sus rivales debían neutralizar si querían evitar que llevara a su equipo directo hacia la victoria. Puede que Wunder se destaque en Europa, pero jugar contra colosales carriles centrales superiores como Smeb, Duke y Looper será un reto totalmente diferente. Nadie creyó en Wunder y Splyce antes, y este jugador muere por silenciar una vez más la boca de aquellos que dudaron de él.</p>"},"foreignIds":{"drupalId":"2895","TRLH3":"200000103","TRLH4":"200000206"},"socialNetworks":{"twitter":"twitter.com/SPY_WUNDERLOLXD","twitch":"twitch.tv/Wunderwearisfame","facebook":"http://facebook.com/Wunderwearlol"},"champions":[],"liveGameTeam":97},{"id":588,"slug":"kobbe","name":"Kobbe","firstName":"Kasper","lastName":"Kobberup","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kobbe-adbtha0l.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-09T10:31:56.000Z","bios":{"en_US":"<p>Kasper “Kobbe” Kobberup didn’t always want to be a professional gamer. He was dedicated to football before an injury sent him to the sideline and he had to rethink his options. Luckily for Splyce, Kobbe took up League of Legends. Before long, he became one of the best up-and-coming ADCs in Europe.</p>\n\n<p>Like the rest of Splyce, Kobbe was disappointed by his performance at the 2016 World Championship. But the international experience should make Kobbe and Splyce even better if they can learn from it. The next time elite opponents stare him down, Kobbe will be ready to blow right past them.</p>","de_DE":"<p>Kasper „Kobbe“ Kobberup wollte nicht immer ein professioneller Spieler werden. Er war ein leidenschaftlicher Fußballspieler, bevor ihn eine Verletzung auf die Ersatzbank zwang und er seine Optionen überdenken musste. Zum Glück für Splyce begann Koppe, League of Legends zu spielen. Es dauerte nicht lange, bis er zu einem der besten Nachwuchs-ADCs Europas wurde.\n\nWie der Rest von Splyce war auch Kobbe mit seiner Vorstellung bei der Weltmeisterschaft 2016 nicht zufrieden. Aber wenn Kobbe und Splyce aus der internationalen Erfahrung lernen konnten, sollten sie jetzt sogar noch besser sein. Wenn er das nächste Mal von Elite-Gegnern finster angestarrt wird, kann Kobbe einfach vorbeistürmen.</p>","fr_FR":"<p>Kasper « Kobbe » Kobberup sera-t-il le nouveau Jesper « Niels » Svenningsen ? C’est probablement la question qui sera posée dorénavant à chaque nouveau carry ad qui arrive en LCS EU. Sans lui imposer une trop forte pression sur les épaules, on peut déjà estimer que Kobbe a les moyens de se faire un nom pour lui-même. Le joueur danois, passé par Gamers 2 mais aussi brièvement par la structure française Millenium en 2015 a véritablement explosé sur la scène challenger au printemps de l’année écoulée quand il a rejoint son équipe actuelle. Ce qui était à l’époque Dignitas EU a eu le nez creux en recrutant deux semaines après le début des Challenger Series son nouveau carry AD. Celui-ci, alors en duo avec Erih « Voidle » Sommermann sur la voie du bas, n’a pourtant pas révélé tout de suite l’étendue de son talent. Il a fallu pour cela attendre le segment d’été des Challenger Series et l’arrivée à ses côtés d’un nouveau support, Nicolai « Nisbeth » Nisbeth. Les deux danois ont trouvé une synergie très efficace, qui leur a permis de surclasser la concurrence et d’être de l’avis général le meilleur binôme carry AD/Support de la scène challenger.   Une synergie qui va néanmoins être mise à rude épreuve face à celle de duos LCS plus expérimentés. Malgré tout, s’il est peu probable de retrouver dès cette année Splyce et Kobbe en demi –finale des championnats du monde, le joueur a largement les moyens d’imposer son style de jeu et son nom en bonne place aux côtés de ses glorieux ainés. </p>","es_ES":"<p>Antes de jugar a League of Legends, Kasper ''Kobbe'' Kobberup se dedicaba al fútbol. Cuando una lesión lo obligó a retirarse, reconsideró sus opciones, y por suerte para nosotros, el fin de un sueño es el momento perfecto para el inicio de otro. Kobbe dedicó su tiempo en el banquillo de fútbol a convertirse en jugador profesional de videojuegos.</p>\n\n<p>Tras una actuación dominante en la Challenger Series europea de 2015, Kobbe llegó a la LCS EU. Aunque estuvieron a punto de ser eliminados, Kobbe y Splyce sorprendieron a todo el mundo y obtuvieron un segundo puesto en el split de verano de la LCS EU 2016. Además de eso, ayudó a asegurarle un puesto a Splyce en el Mundial en su segundo split en acción en la LCS EU. Señalado como uno de los AD carries más prometedores de Europa, Kobbe tiene ahora la oportunidad de medir su entereza con la élite internacional. Es una lucha a vida o muerte para Kobbe, y si tomamos el pasado como referencia, llegado el momento de la partida, elegirá vivir.</p>","pl_PL":"<p>Gra urodzonego w 1996 roku Duńczyka nie jest może tak widowiskowa jak chociażby jego kolegi z drużyny Chresa „Sencuxa” Larsena, ale Kobbe jest niesamowicie regularnym graczem, a także bardzo istotnym elementem zespołu. Jego opanowanie i zdolność do utrzymania przez długi czas wysokiego poziomu doskonale równoważy wahania formy duńskiego i mid-lanera i sprawia, że ekipa Splyce ma na kim oprzeć swoją grę, podczas gdy Sencuxowi przydarzy się gorsza gra. Kobbe to na pierwszy rzut oka bardzo niepozorny strzelec, ale w letnim splicie Challenger Series 2015 nie było żadnego gracza na jego pozycji, który mógłby równać się z Duńczykiem. Najwięcej zabójstw i asyst, najmniej śmierci i niesamowite KDA na poziomie 10,5 sprawiają, że Kobbe wydaje się być najbardziej niedocenianym zawodnikiem w składzie beniaminka EU LCS. </p>\n<p>\nJednocześnie warto zauważyć, że Kobbe zwrócił uwagę czołowych drużyn w Europie już nieco wcześniej, gdy udało mu się dostać do pierwszej dziesiątki SoloQ zachodnio-europejskiego serwera. Miało to miejsce w trakcie letniego splitu 2015 i wtedy też pojawiały się pogłoski o tym, że miałby dołączyć do Teamu ROCCAT, który szukał strzelca w miejsce Pawła „Woolite’a” Pruskiego. Ostatecznie jednak Kobbe pozostał w Dignitas EU, a ROC sięgnął po Rasmusa „MrRalleza” Skinneholma. </p>\n<p>\nAle gdy my sięgniemy jeszcze dalej w przeszłość, zobaczymy, że Kobbe już od dłuższego czasu kręcił się najpierw w okolicach Challenger Series z Denial eSports i 4everzenzyg (od maja do listopada 2014), a później poczynał sobie coraz śmielej i występował w kilku ciekawych zespołach o LCS-owych aspiracjach. Wymienić tu można chociażby Gamers2, gdzie Kobbe przez krótki czas grał u boku m.in. obecnego wspierającego Teamu SoloMid – Raymonda „KaSinga” Tsanga czy późniejszego dżunglera Dignitas EU – Dennisa „Obviousa” Sørensena. Kolejnym przystankiem na drodze duńskiego strzelca było Millenium, ale także tutaj nie zabawił zbyt długo i wkrótce dołączył do Teamu Dignitas EU, z którym to po dwóch splitach zmagań w Challenger Series, w końcu udało mu się dostać do LCS-u na wiosenną edycję 2016. Konsekwencja, której nie brakuje Kobbe’mu także na Polach Sprawiedliwości w końcu zaowocowała.</p>\n<p>\n„Jest naprawdę dobrym strzelcem z solidną fazą linii i umiejętnością gry w zespole. Doskonale wie jak pozycjonować się w walkach drużynowych” – powiedział o swoim byłym koledze z drużyny francuski top-laner Julian „GoB” Treguer dla portalu Millenium.org.</p>\n<p>\nCiekawostką jest fakt, że Kobbe na wysokim poziomie gra nie tylko w League of Legends. Duński ADC, którego graniem w gry zaraził brat, był w przeszłości miłośnikiem Warcrafta 3, World of Warcraft oraz Diablo 2, a do tej pory zdarza mu się zagrać w CS:GO, gdzie udało mu się zdobyć najwyższą możliwą rangę – Global Elite.\n</p>","es_AR":"<p>Antes de jugar League of Legends, Kasper \"Kobbe\" Kobberup se dedicaba al fútbol. Luego de una lesión que lo dejó fuera del campo de juego, tuvo que reconsiderar sus opciones para el futuro. Por suerte para nosotros, el final de un sueño puede ser el comienzo de otro. Kobbe aprovechó el tiempo que pasó en el banco de suplentes para convertirse en video jugador profesional.</p>\n\n<p>Luego de una actuación dominante en la Challenger Series EU 2015, Kobbe pasó a formar parte de la LCS EU. Después de casi descender, Kobbe y Splyce sorprendieron a todos con un segundo lugar en el torneo de clausura de la LCS EU 2016. Además de esto, ayudó a Splyce a guardarse un lugar en el Mundial en su segundo torneo dentro de la escena de la LCS EU. Aclamado como uno de los mejores y prometedores ADC de Europa, Kobbe tiene la oportunidad de probar su valía contra enemigos internacionales de élite. Para Kobbe, las opciones son matar o morir, y su historia indica que escogerá la primera llegado el momento de jugar.</p>"},"foreignIds":{"drupalId":"2699","TRLH3":"200000106","TRLH4":"200000209"},"socialNetworks":{"twitch":"twitch.tv/kobbelol","facebook":"facebook.com/Kobbelol","twitter":"twitter.com/SPY_Kobbe"},"champions":[],"liveGameTeam":97},{"id":663,"slug":"gripex","name":"Gripex","firstName":"Jesper","lastName":"Terkildsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gripex-6b756abo.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-18T21:24:08.000Z","bios":{"en_US":"","es_AR":"<p>Jesper \"Gripex\" Terkildsen es el junglero suplente de Splyce.</p>"},"foreignIds":{"drupalId":"4545","TRLH4":"200000211","TRLH3":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":954,"slug":"mikyx","name":"Mikyx","firstName":"Mihael","lastName":"Mehle","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikyx-dbj14d9y.png","hometown":"","region":"EU LCS","birthdate":"","createdAt":"2016-01-05T19:47:13.000Z","updatedAt":"2017-06-09T11:10:17.000Z","bios":{"en_US":"<p>Mihael \"Mikyx\" Mehle is a support prodigy for Splyce. He's the only member of Splyce who wasn't on the team when they clawed their way out of the 2016 EU LCS Summer Promotion Tournament. As a rookie in the Summer Split, he brought a new level of playmaking to Splyce from the support position. Despite his inexperience, he helped Splyce go from rags to riches and earn a spot at the 2016 World Championship.</p>\n\n<p>At Worlds, Mikyx finally showed weakness. As he returns with the rest of Splyce for 2017, he'll get his first full season in the EU LCS to improve his talents. With his career still in its infancy, Mikyx has plans to attend Worlds for many years to come.</p>","de_DE":"<p>Mihael „Mikyx“ Mehle ist das Supporter-Wunderkind von Splyce. Er ist das einzige Mitglied, das beim erbitterten Kampf der Mannschaft im Sommer-Aufstiegsturnier der EU LCS 2016 nicht dabei war. Er ging als Nachwuchsspieler in den Sommer-Split und schaffte es dennoch, die Rolle des Spielmachers neu zu definieren. Trotz seiner geringen Erfahrung half er Splyce dabei, einen fulminanten Aufstieg hinzulegen und sich einen Platz bei der Weltmeisterschaft 2016 zu sichern.\n\nBei der Weltmeisterschaft zeigte Mikyx dann erstmals Schwäche. Wenn er 2017 mit dem Rest von Splyce zurückkehrt, kann er sein Können in seiner ersten kompletten Saison in der EU LCS verbessern. Da seine Karriere immer noch in den Kinderschuhen steckt, hat Mikyx vor, noch an vielen Weltmeisterschaften teilzunehmen.</p>","fr_FR":"<p>Mihael « Mikyx » Mehle a rejoint les rangs de Splyce en tant que support titulaire au début du segment d’été 2016. D’origine slovène il a été le support remplaçant de Fnatic durant le segment de printemps. Néanmoins, il n’a jamais été titularisé et ce sera donc avec Splyce qu’il fera ses premiers pas sur la scène compétitive des LCS durant ce segment d’été. </p>","pl_PL":"<p>Mihael „Mikyx” Mehle to zawodnik ze Słowenii, który swoje pierwsze kroki w profesjonalnym graniu stawiał w rodzimym zespole Bottled Water. Interesującym momentem w jego karierze okazało się dołączenie do legendarnego Fnatic w roli rezerwowego wspierającego. Wtedy 18-latek dał się poznać jako doskonały zawodnik soloQ, a jego talent chwalili tak znakomici zawodnicy jak Lee „Spirit” Da-yoon czy Jesper „Zven” Svenningsen, jednocześnie zwracając jednak uwagę na wąski champion pool młodego gracza. We Fnatic jednak Mikyx nie miał szans na grę, a dodatkowo jego sytuację skomplikował powrót do zespołu Bory „YellOwStaR’a” Kima.</p>\n<p>W tym czasie Mikyx otrzymał jednak ofertę ze Splyce, które dawało mu szansę sprawdzenia się na najwyższym europejskim poziomie rozgrywkowym – w EU LCS, z której to propozycji Słoweniec oczywiście skorzystał. W nowym zespole zastąpił Nicolaia „Nisbetha” Nisbetha i sprawił, że dotychczas jednonarodowościowy skład przestał być w pełni duński. Zarówno zawodnicy, jak i kibicie wierzą jednak, że Słoweniec będzie wzmocnieniem dla drużyny i że z w nim w składzie Splyce powalczy o coś więcej niż utrzymanie. Co ciekawe, Mikyx już wcześniej często grał w dynamicznej kolejce razem z Chresem „Sencuxem” Laursenem i Kasperem „Kobbe’em” Kobberupem, dzięki czemu zawodnicy ci zdążyli już zbudować podstawy synergii. Dotychczas Słoweniec dał się poznać przede wszystkim jako znakomity gracz Thresha i Morgany.</p>\n<p>„Mikyx ma wszelkie cechy, które w mojej opinii tworzą najlepszych zawodników w LCS. Posiada pasję i jest zmotywowany, by ciągle stawać się lepszym. Okazuje też wielki szacunek dla gry i samych graczy. Żeby nie wspomnieć o ogromnym talencie, który posiada.” – powiedział o swoim nowym zawodniku trener Splyce Jakob  „YamatoCannon” Mebdi.</p>\n","es_AR":"<p>Mihael \"Mikyx\" Mehle es la nueva edición del plantel inicial de Splyce. Al llegar a lo más alto del juego en solitario en nivel Aspirante, fue descubierto por Fnatic y escogido como soporte suplente para el torneo de apertura de la LCS EU 2016.</p>\n\n<p>En abril, Mikyx dejó Fnatic para convertirse en el nuevo soporte inicial de Splyce luego de que Nicolai \"Nisbeth\" Nisbeth se hiciera a un lado, y hay que decir que su presencia se hizo notar. La suerte se puso aún más del lado de Splyce durante el torneo de clausura, en el que la dupla de carriles inferiores formada por Kobbe y Mikyx estuvo asombrosamente afilada. Mikyx demostró una gran habilidad para crear jugadas con campeones como el Bardo, y lanzó habilidades definitivas determinantes por toda la Grieta con gran facilidad. Es muy poco común ver a un jugador principiante tan talentoso como Mikyx en los Mundiales. Su actuación le ha dado una oportunidad de jugar con las leyendas que el siempre ha querido ser.</p>","es_ES":"<p>Mihael ''Mikyx'' Mehle es el miembro más nuevo de la alineación principal de Splyce. Destacaba en el juego en solitario en el nivel Aspirante, así que Fnatic lo tuvo en cuenta y lo fichó como apoyo suplente durante el split de primavera de la LCS EU.</p>\n\n<p>En abril, Mikyx dejó Fnatic y pasó a ser el apoyo titular de Splyce, en sustitución de Nicolai ''Nisbeth'' Nisbeth, y lo dio todo en sus jugadas. La suerte de Splyce mejoró en el split de verano, ya que el dúo de la calle inferior, Kobbe y Mikyx, estuvo increíblemente avispado. Mikyx demostró una gran habilidad para facilitar jugadas con campeones como Bardo, con quien es capaz de lanzar fácilmente su definitiva desde la otra punta de la Grieta y propiciar así un giro en la partida. Es raro ver talentos como Mikyx en el escenario del Mundial tan pronto en su trayectoria profesional, pero se ha ganado esta oportunidad de jugar con las leyendas en las que se quiere convertir.</p>"},"foreignIds":{"TRLH3":"200000107","TRLH4":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1089,"slug":"djoko","name":"Djoko","firstName":"Charly","lastName":"Guillard","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/djoko-eihpvx8d.png","hometown":null,"region":"EU LCS","birthdate":"1997-03-01","createdAt":"2016-01-21T21:12:44.000Z","updatedAt":"2017-06-09T10:57:44.000Z","bios":{"en_US":"<p>Charly “Djoko” Guillard is finally getting his shot in the EU LCS. The jungler has spent the past two years working his way up through the Challenger scene, most recently as a member of the Millenium roster that fell to ROCCAT in the 2017 Spring Promotion Tournament.</p>\n\n<p>On Team Vitality’s 2017 lineup, he’ll be competing with teammate GBM for the starting jungle position. His history in the jungle position may end up working in his favor; GBM is new to the role this season. Either way, the competition can only serve to improve Djoko’s skills and Vitality’s chances in 2017.</p>","fr_FR":"<p>Djoko est le jungler de l’équipe Millenium. Actuellement Challenger, il a prouvé sa valeur de nombreuses fois dans le passé notamment sous les couleurs \"Imaginary Gaming\" avec qui il a remporté la première édition du Challenge France. </p>\n<p> Il a pu goûter au plus haut niveau en remplaçant DiamondProx des « Unicorns of Love » durant les LCS EU 2016. Reconnu pour ses choix de champions exotiques, Djoko est l'un des piliers de l'équipe et compte bien la mener le plus loin possible. Sa synergie avec son coéquipier Kaze lui permet de dominer la scène française et de guider son équipe vers la victoire. Après l'échec de la qualification aux LCS à une marche de son rêve, il promet de revenir encore plus fort afin de conserver le titre avec ses coéquipiers et de retenter sa chance.</p>","de_DE":"<p>Charly „Djoko“ Guillard bekommt endlich die Gelegenheit, sich in der EU LCS zu beweisen. Der Jungler hat die letzten beiden Jahre damit verbracht, sich in der Challenger Series nach oben zu arbeiten. So war er vor Kurzem noch Mitglied von Millenium, die im Frühjahrs-Aufstiegsturnier 2017 gegen ROCCAT den Kürzeren zogen.\n\n2017 wird er bei Team Vitality mit Teammitglied GBM um die Startposition als Jungler wetteifern. Dabei könnte sich seine Vergangenheit im Dschungel als Vorteil erweisen, schließlich ist diese Position für GBM neu. So oder so wird die Konkurrenz dafür sorgen, dass sich sowohl Djokos Können als auch Vitalitys Chancen 2017 verbessern.\n</p>"},"foreignIds":{"TRLH3":"200000120","TRLH4":"200000223"},"socialNetworks":{"twitter":"https://twitter.com/Djoko_GG"},"champions":[],"liveGameTeam":165},{"id":1704,"slug":"alderiate","name":"Alderiate","firstName":"Adrien","lastName":"Wils","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alderiate-7q1wg8p0.png","hometown":null,"region":"EU LCS","birthdate":"1993-09-07","createdAt":"2017-01-13T19:44:16.000Z","updatedAt":"2017-01-18T22:06:05.000Z","bios":{},"foreignIds":{"TRLH3":"200000125","TRLH4":"200000228"},"socialNetworks":{"twitch":"https://twitter.com/Alderiate"},"champions":[],"liveGameTeam":165},{"id":1771,"slug":"annes","name":"Annes","firstName":"Annes","lastName":"Ravkic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/annes-47wl5dqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-02-10T15:25:24.000Z","updatedAt":"2017-05-31T21:46:49.000Z","bios":{},"foreignIds":{"TRLH3":"200000226","TRLH4":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":97}],"scheduleItems":[{"id":"AVmJu7i9oUG4HPFjOKIq","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:5c86a430-d31b-4355-915c-533953976ce0","scheduledTime":"2017-03-23T16:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"9","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:612571e5-a5ba-4462-8221-9ed073eebeb5"},"match":"5c86a430-d31b-4355-915c-533953976ce0","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"612571e5-a5ba-4462-8221-9ed073eebeb5","league":"3"}],"gameIdMappings":[{"id":"2b32a98a-3a62-475d-9aec-ad33488335d3","gameHash":"1358d3ae04858e4e"},{"id":"4126f66d-0691-4c93-83a7-f63c8154a69f","gameHash":"072c2b0bc489d7e3"}],"videos":[{"id":6257,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:2b32a98a-3a62-475d-9aec-ad33488335d3","source":"https://www.youtube.com/embed/Qybc5Wdjc10?wmode=transparent","createdAt":"2017-03-23T21:53:17.000Z","updatedAt":"2017-03-23T21:53:17.000Z","game":"2b32a98a-3a62-475d-9aec-ad33488335d3"},{"id":6258,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:4126f66d-0691-4c93-83a7-f63c8154a69f","source":"https://www.youtube.com/embed/pyjfTDFJmWI?wmode=transparent","createdAt":"2017-03-23T21:47:05.000Z","updatedAt":"2017-03-23T21:47:05.000Z","game":"4126f66d-0691-4c93-83a7-f63c8154a69f"}],"htmlBlocks":[],"match":{"id":"5c86a430-d31b-4355-915c-533953976ce0","name":"VIT-vs-SPY","position":9,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"},{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],"games":{"4126f66d-0691-4c93-83a7-f63c8154a69f":{"id":"4126f66d-0691-4c93-83a7-f63c8154a69f","name":"G2","generatedName":"SPY|VIT|G2|5c86a430d31b4355915","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"},{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}],"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490305788253,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490290682380,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002010154","gameRealm":"TRLH3","platformId":"TRLH3:1002010154","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"2b32a98a-3a62-475d-9aec-ad33488335d3":{"id":"2b32a98a-3a62-475d-9aec-ad33488335d3","name":"G1","generatedName":"SPY|VIT|G1|5c86a430d31b4355915","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"},{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490305772018,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490287597362,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002000138","gameRealm":"TRLH3","platformId":"TRLH3:1002000138","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8d7b391f-2c87-4c04-893b-4714463f5e5b":{"id":"8d7b391f-2c87-4c04-893b-4714463f5e5b","name":"G3","generatedName":"SPY|VIT|G3|5c86a430d31b4355915","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"},{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490305788257,"source":"bestOf","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490305772018,"source":"bestOf","closed":true},{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"3d3b7d9c-76aa-45f8-a625-654a94d57f19"}]],"timestamp":1490290682380,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"3d3b7d9c-76aa-45f8-a625-654a94d57f19":0,"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf":1}}}