{"teams":[{"id":15,"slug":"fnatic","name":"Fnatic","guid":"be6c86ea-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bjbf9nf7.jpg","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-i09wrkpf.png","acronym":"FNC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bkk3xam5.png","createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-07-27T00:51:46.000Z","bios":{"en_US":"<p>As the original League of Legends World Champion, Fnatic was the team to beat in LoL’s infancy. These days, the squad is completely unrecognizable from its original form. With a new roster mixing veteran playmakers like sOAZ and Rekkles plus Caps, their lone rookie, Fnatic is remaking itself. Putting their underwhelming 2016 behind them, Fnatic believe they are building a roster that could make a serious run at the EU LCS trophy.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>\n","fr_FR":"<p>Première détentrice du titre mondial de League of Legends, Fnatic était l'équipe à battre dans la prime enfance de LoL. Mais l'équipe d'aujourd'hui n'a plus rien à voir avec sa forme d'origine. Sa nouvelle formation accueillant à présent des talents coréens, des joueurs européens prometteurs et Rekkles, la star carry AD, Fnatic est en pleine reconstruction. Avec une série de 18 victoires sans défaite durant le segment d'été des LCS EU 2015 et une qualification pour les demi-finales du mondial 2015, l'équipe a prouvé qu'elle pouvait encore obtenir des résultats.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>","pl_PL":"<p>Legendarni obrońcy honoru Europy. Fnatic to jedna z najstarszych drużyn konkurujących w League of Legends. 14 marca 2011 roku ta organizacja, dobrze znana z udziału w innych grach, zaistniała w świecie Runeterry. Świeżo po założeniu, od razu zabrała się za największy kaliber osiągnięć. Żółto-czarni byli jedną z 8 ekip, które zakwalifikowały się do Mistrzostw Riot Games pierwszego sezonu. Dokonali tego zaledwie trzy miesiące po założeniu drużyny, co jak na początkujących, stanowiło imponujący wyczyn. Przez cały turniej przegrali tylko dwa mecze na swojej drodze do zwycięstwa. Dzięki temu osiągnięciu Europa zawdzięcza im swój jedyny dotąd mistrzowski tytuł, a codzienni gracze mogą cieszyć się skinami europejskiego zespołu. Ten historyczny triumf to był dopiero początek wielkich sukcesów tej drużyny.</p>\n\n<p>Doskonałą kondycją Fnatic mógł się pochwalić również w trzecim, czwartym i piątym sezonie, podczas których reprezentował Europę na Mistrzostwach Świata. W 2014 roku nie udało im się wejść do fazy eliminacji, lecz w pozostałych latach pokazali prawdziwą klasę. Podczas MŚ w Stanach Zjednoczonych, w 2013 roku, wyszli ze swojej grupy na pierwszym miejscu, z zawrotnym wynikiem 7:1. W ćwierćfinałach podołali ówcześnie najmocniejszej drużynie Ameryki, Cloud9, na ich własnym terenie. Ulegli dopiero w półfinale z Royal Club, lecz nawet wtedy czarno-żółtym udało się zatriumfować w jednej grze przed ostateczną porażką. Podobnym powodzeniem Fnatic mógł się pochwalić podczas MŚ 2015. Kolejny raz zdominowali fazę grupową, jeszcze raz znajdując się na pierwszym miejscu, tym razem z wynikiem 4:2. W ćwierćfinale stoczyli walkę z pierwszorzędnym chińskim zespołem – Edward Gaming. Warto zauważyć, że był to jeden ze zdecydowanych faworytów tego wydarzenia. Zdominowali ich 3 do 0, nie pozostawiając cienia złudzeń co do tego, kto zasłużył na laur. Odpadli dopiero w półfinale w starciu z koreańską potęga. Patrząc na dorobek Fnatic z Mistrzostw Świata, śmiało można stwierdzić, że mało która organizacja na świecie może pochwalić się tak niezmiennie dobrymi wynikami.\n</p>\n<p>\nO osiągnięciach tej drużyny na pomniejszych turniejach można by napisać książkę. Jednak trzeba zwrócić uwagę na bezsprzecznie niepowtarzalne triumfy zespołu Fnatic. To przede wszystkim stała i niezachwiana dominacja w lidze EU LCS. Ekipa czarno-żółtych zawsze była na pierwszym lub drugim miejscu w rozgrywkach League Championship Series. Niezłomność i permanentna obecność Fnatic na szczycie zasługuje na najwyższe uznanie. Oprócz członkostwa graczy najwyższych lotów, ten sukces wynika także z zapewnionego im troskliwego patronatu przez samą organizację. Na początku piątego sezonu do kadry dołączył Luis „Deilor” Sevilla, który wcześniej był profesjonalnym trenerem pokera. Wiele osób uważa, że w dużej mierze to właśnie on stoi za sukcesem czarno-żółtych na MŚ 2015. Pod jego opiekuńczymi skrzydłami Fnatic rozkwitło. W wiosennym sezonie EU LCS 2015 skończyli z wynikiem 13:5, a w letnim pobili światowy rekord i pozostali niepokonani aż do końca.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Responsable d’équipe: Finlay \"Quaye\" Stewart</p>","de_DE":"<p>Als LoL noch in den Kinderschuhen steckte, war Fnatic, der erste Weltmeister in der Geschichte von League of Legends, die Mannschaft, die es zu schlagen galt. Die heutige Mannschaft hat mit der damaligen nichts mehr gemein. Mit einer Mischung aus erfahrenen Spielern wie sOAZ und Rekkles sowie dem Nachwuchsspieler Caps versucht Fnatic, sich neu zu erfinden. Fnatic hat die Rückschläge des vergangenen Jahrs hinter sich gelassen und glaubt, mit der neuen Aufstellung Chancen auf den Titel in der EU LCS zu haben. Die Spieler sind entschlossen und haben das Zeug dazu, als beste Mannschaft in die langjährige Geschichte Fnatics einzugehen.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Mannschaftsleiter: Finlay \"Quaye\" Stewart</p>\n","es_ES":"<p>Hablar sobre Fnatic es hacerlo sobre éxito, dedicación y superación. El conjunto europeo más laureado de la escena tendrá otro año más que empezar de cero y saber renovarse para intentar emular los resultados del año pasado. Algo que se plantea casi imposible por su inmaculada temporada se tendrá que realizar con nuevos jugadores que a pesar de no ser tan desconocidos como los que comenzaron el año pasado presentan mayores dudas.</p>\n\n<p>El palmarés de Fnatic es impresionante. Desde ganar el primer Campeonato Mundial de League of Legends hasta sólo perder una vez los playoffs de la LCS europea en verano de 2014 contra Alliance. La única mancha de la organización es la no presencia en el Campeonato Mundial 2012, así cómo podría considerarse un pequeño bache no pasar de la fase de grupos en el Campeonato Mundial de 2014. Pero, en el resto de ocasiones, la actuación ha sido espectacular.</p>\n\n<p>Hasta el año pasado, Fnatic mantuvo un núcleo que siempre otorgaba las mismas impresiones. Durante la fase regular, probaban cambios y los resultados les dejaron un poquito al margen, pero lo suficiente como para clasificarse y luego arrasar en los playoffs. Un equipo calculador que en todo momento ha sabido aprovechar sus recursos para poder superar las expectativas de los aficionados.</p>\n\n<p>El año pasado la renovación no sólo fue fructífera, sino inesperada. Los chicos de Luis ‘Deilor’ Sevilla fueron capaces de ganar en primavera después de una fase regular con sensaciones encontradas. La actuación en el Mid Season Invitational motivó a pensar que Fnatic podía plantar cara a los mejores equipos del mundo. Verano no dio lugar a dudas, puesto que ganaron todos los partidos disputados en la fase regular y estuvieron a punto de hacerlo también en los playoffs si no fuera porque Origen les plantó cara en la final y les pudo sacar dos partidos. Pero no fue suficiente, y Fnatic de nuevo se llevó el preciado trofeo.</p>\n\n<p>Muchos críticos tenían curiosidad por ver si este, probablemente el mejor equipo europeo desde Moscow 5, conseguiría plantar cara a equipos internacionales. Y a pesar de un mal inicio en la fase de grupos, remontaron con un gran nivel y se clasificaron a cuartos de final. Allí derrotaron a la potencia china con una facilidad pasmosa, pero los coreanos juegan en otra división y KOO Tigers acabó con sus esperanzas en las semifinales.</p>\n\n<p>Después de los mundiales tanto su top, Heo ‘Huni’ Seung-hoon, como su mid, Kim ‘Reignover’ Yeu-jin, anunciaron su intención de marcharse a américa en busca de un reto nuevo. Pero la esencia real se perdía con la marcha de Bora ‘YellOwStaR’ Kim, líder del grupo que también decidió irse con el mismo objetivo. El equipo quedó huérfano después de casi tres años enteros del francés con la organización.</p>\n\n<p>Hay que mirar hacia adelante. Al igual que el año pasado las exigencias sólo eran de clasificarse al mundial y al final el buen trabajo recompensó, esta temporada hay que ser lo suficientemente humildes para poder aspirar a gestas heroicas. El equipo ha demostrado que es capaz de sacar provecho de plantillas como la actual, pero todavía es muy pronto para saber cómo funcionarán internamente y sólo queda disfrutar del progreso del conjunto.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Jefe de equipo: Finlay \"Quaye\" Stewart</p>","pt_BR":"O primeiro campeão mundial da história de League era o time a ser batido nos primeiros anos do cenário competitivo. Hoje, porém, a escalação é totalmente diferente daquela formação original. A nova Fnatic combina talentos coreanos com promessas do cenário europeu e uma base sólida com o suporte YellOwStaR. Eles podem estar se reconstruindo ainda, mas os resultados já são inquestionáveis: recorde de 18V-0D na etapa de verão da LCS EU, e primeiro lugar nas eliminatórias.  ","en_GB":""},"foreignIds":{"drupalId":"68"},"players":[94,98,172,344,1107,1111,1264],"starters":[94,98,172,1107,1111],"subs":[344,1264]},{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]}],"players":[{"id":94,"slug":"soaz","name":"sOAZ","firstName":"Paul","lastName":"Boyer","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/soaz-a3dmvmfk.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:38.000Z","updatedAt":"2017-06-09T10:03:16.000Z","bios":{"en_US":"<p>Paul \"sOAZ\" Boyer is a true esports veteran, with a career going back to 2010. Before signing with Origen he had been a rock in the top lane for Fnatic for over two years, joining the squad in two World Championship runs. After the 2014 Season concluded, Fnatic entered a rebuilding process which saw nearly the entire roster head their separate ways. Following his departure from Fnatic, Origen founder and mid laner Enrique \"xPeke\" Cedeño Martínez courted sOAZ to be the final addition to his new Challenger Series venture. sOAZ jumped at the chance, where he was instrumental in Origen's runs through the Challenger circuit, multiple EU LCS Splits, and even a World Championship appearance.</p>\n\n<p>sOAZ decided to return to Fnatic in 2017 as their starting top laner, after another frustrating split for Origen led to many players searching for greener pastures. He brings tons of experience (and his trusty baguette) back to Fnatic where he’s aiming to add to his long list of professional accolades. sOAZ would tell you that he’s got plenty left in the tank for another shot at Worlds, but he’ll have to fight his way through the regular season first. You shouldn’t worry though, it seems like this is something he’s done before.</p>","fr_FR":"<p>Paul « SoaZ » Boyer est un véritable vétéran de l'e-sport, avec une carrière remontant à 2010. Avant de rejoindre Origen, il s'est démarqué comme top laner chez Fnatic pendant plus de deux ans, participant ainsi à deux Championnats du monde. Après la fin de la saison 2014, Fnatic est entrée dans un processus de reconstruction et presque toute la formation a été démantelée. Après son départ de chez Fnatic, le fondateur d'Origen et mid laner Enrique « xPeke » Cedeño Martínez a courtisé Soaz pour qu'il rejoigne sa nouvelle équipe dans les Challenger Series. Soaz a sauté sur l'occasion et a ainsi joué un rôle important dans le succès d'Origen sur le circuit Challenger, dans plusieurs segments des LCS EU et même lors d'une apparition dans le Championnat du monde.</p>\n\n<p>Soaz a été le seul point positif d'un segment d'été catastrophique pour Origen en 2016. Il a décroché des victoires pour Origen à lui seul et a maintenu la compétitivité de l'équipe quand tout espoir semblait perdu. Ses excellentes performances (et ses fans dévoués) lui ont valu un ticket pour Barcelone pour participer à l'événement All-Stars 2016. Ses années d'expérience compensent ses compétences mécaniques limitées. Si l'Europe espère éviter une élimination anticipée, elle devra compter sur le vétéran robuste (et sur sa baguette) pour la guider à travers l'une des compétitions les plus difficiles de la Faille.</p>","pl_PL":"<p>Paul „SoaZ” Boyer to prawdziwy weteran e-sportu, którego kariera sięga 2010 roku. Przed przejściem do Origen był nie do ruszenia na górnej alei Fnatic przez ponad dwa lata, dołączając do składu w dwóch podejściach do Mistrzostw Świata. Po zakończeniu sezonu 2014 Fnatic rozpoczęli proces przebudowy, w wyniku którego rozeszli się niemal wszyscy gracze z początkowego składu. Po odejściu z Fnatic założyciel i środkowy Origen, Enrique „xPeke” Cedeño Martínez, zabiegał o to, by Soaz stał się ostatnim uzupełnieniem jego nowej drużyny w Challenger Series. Soaz chętnie skorzystał z tej okazji i odegrał kluczową rolę w drodze po zwyciestwo Origen podczas Challenger Circuit, kilku splitach EU LCS, a nawet występie na Mistrzostwach Świata.</p>\n\nSoaz był zapewne jedynym jasnym punktem letniego splitu 2016, o którym Origen woleliby zapomnieć. Samodzielnie prowadził Origen do zwycięstw i utrzymywał ich w konkurencyjnej formie, nawet gdy wydawało się, że wszystko już stracone. Jego świetne występy (oraz oddani fani) zapewniły mu bilet do Barcelony i udział w wydarzeniu All-Star 2016. Niedoskonałości umiejętności mechanicznych nadrabia latami doświadczeń. Jeśli Europa chce uniknąć kolejnej pożałowania godnej porażki, będzie musiała polegać na tym niezłomnym weteranie (i jego bagietce), który poprowadzi drużynę do boju przeciwko kilku z najtwardszych rywali na Summoner’s Rift.\n","de_DE":"<p>Paul „sOAZ“ Boyer ist ein wahrer E-Sport-Veteran, dessen Karriere 2010 begann. Vor seinem Wechsel zu Origen war er über zwei Jahre Fnatics Fels auf der oberen Lane, mit denen er auch an zwei Weltmeisterschaften teilgenommen hat. Nach dem Ende der Saison 2014 wurde Fnatic umstrukturiert und die ehemaligen Mitglieder gingen getrennte Wege. sOAZ wurde von Mid-Laner Enrique „xPeke“ Cedeño Martínez, der nach seinem Abgang von Fnatic Origen gegründet hatte, als letztes Mitglied für sein Abenteuer in der Challenger Series angeworben. Er ergriff die Gelegenheit und wurde zu einem wichtigen Bestandteil von Origens Durchmarsch in der Challenger Series, mehreren Splits in der EU LCS und sogar einer Teilnahme an der Weltmeisterschaft.</p>\n\n<p>Nachdem ein weiterer frustrierender Split dazu geführt hatte, dass viele Spieler Origen verließen, kehrte sOAZ zu Fnatic zurück, um für sie auf der oberen Lane zu spielen. Er kommt mit einer Menge Erfahrung (und seinem treuen Baguette) zu Fnatic zurück und wird versuchen, seine Liste mit Auszeichnungen zu erweitern. sOAZ würde sicher sagen, er habe noch genug Reserven, um bei einer weiteren Weltmeisterschaft mitzuspielen, aber dazu muss er sich erst einmal durch den Frühjahrs-Split kämpfen. Aber keine Angst, das ist nichts, was er nicht schon einmal getan hätte.</p>","es_ES":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella de la calle superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomase caminos separados. Tras abandonar Fnatic, el fundador y mid de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito aspirante, en numerosos split de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un split de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","pt_BR":"<p>Paul \"sOAZ\" Boyer é um verdadeiro veterano dos eSports, com uma carreira que começou em 2010. Antes de entrar para a Origen, ele foi o jogador de topo da Fnatic por mais de dois anos, entrando no esquadrão com duas participações do Mundial nas costas. Após o fim da Temporada 2014, a Fnatic entrou em um processo de reconstrução onde viu quase todos os membros da equipe seguirem caminhos distintos. Após a saída da Fnatic, o fundador da Origen, o jogador Enrique “xPeke” Cedeño Martínez considerou sOAZ para ser a peça final em sua aventura pela Challenger Series. Ele entrou e foi essencial na campanha da Origen pelo torneio, nas várias Etapas da LCS EU e até mesmo em uma aparição no Mundial.</p>\n\n<p>sOAZ foi a única salvação de do que foi uma Etapa de Verão triste para a Origen em 2016. Ele conseguiu praticamente sozinho algumas vitórias para a Origen e os manteve no competitivo, mesmo quando tudo parecia estar perdido. Seu desempenho incrível (e seus fãs) lhe conquistou uma vaga no Evento All-Star 2016 em Barcelona. Quando ele não tem domínio mecânico, sua experiência ajuda. Se a Europa quiser evitar perder rapidamente como no Mundial, eles precisam confiar no veterano para guiá-los na competição implacável de Summoner’s Rift.</p>","cs_CZ":"<p>Paul „SoaZ“ Boyer je skutečným veteránem esportů, jeho kariéra se totiž datuje od roku 2010. Ještě než nastoupil do Origenu, byl přes dva roky v horní lajně oporou Fnaticu, se kterým se zúčastnil dvou mistrovství světa. Po skončení sezóny 2014 však Fnatic prošel restrukturalizací, při které se cesty téměř všech jeho bývalých hráčů rozdělily. Po odchodu z Fnaticu oslovil SoaZe zakladatel a středový lajnař Origenu Enrique „xPeke“ Cedeño Martínez, který jej chtěl jako svůj poslední trumf do týmu, který měl vzít šturmem Challenger Series. SoaZ po této šanci s chutí sáhl a velkou měrou přispěl k úspěchům Origenu v seriálu Challenger, několika splitech evropského LCS a dokonce i na mistrovství světa.</p>\n\n<p>SoaZ byl nejspíš tím jediným, co drželo Origen nad vodou během jinak úděsného letního splitu 2016. Sám se snažil dotáhnout tým k výhrám a udržoval jej při životě, i když už vše vypadalo naprosto beznadějně. Jeho špičkové výkony (a zástupy milujících fanoušků) mu zajistily lístek do Barcelony, kde se zúčastní turnaje All-Star 2016. To, co mu schází v čisté herní mechanice, dohání roky zkušeností. Pokud chce Evropa tentokrát držet krok s ostatními týmy, bude se muset při bojích s těmi nejdrsnějšími soupeři opřít o tohoto veterána (a jeho bagetu).</p>","el_GR":"<p>Ο Paul \"SoaZ\" Boyer είναι ένας πραγματικός βετεράνος των esports που ξεκίνησε την καριέρα του ήδη από το 2010. Πριν υπογράψει στους Origen ήταν η άγκυρα των Fnatic στην επάνω λωρίδα για πάνω από δύο χρόνια και μάλιστα είχε λάβει μέλος με την ομάδα σε δύο Παγκόσμια Πρωταθλήματα. Μετά τη λήξη της Σεζόν 2014, έγιναν μεγάλες ανακατατάξεις στους Fnatic, καθώς όλοι σχεδόν οι παλιοί παίκτες της ομάδας τράβηξαν το δικό τους δρόμο. Όταν αποχώρησε από τους Fnatic, ο ιδρυτής και παίκτης μεσαίας λωρίδας των Origen Enrique \"xPeke\" Cedeño Martínez προσέγγισε τον Soaz για να συμπληρώσει το ρόστερ της νέας του προσπάθειας στο Challenger Series. Ο Soaz δέχτηκε με μεγάλη προθυμία και η παρουσία του ήταν καταλυτική στην πορεία των Origen στο Challenger Circuit, αλλά και σε πολλά Split του LCS Ευρώπης, ακόμα και σε μια μοναδική εμφάνιση στο Παγκόσμιο Πρωτάθλημα.</p>\n\n<p>Ο Soaz ήταν ίσως η μοναδική θετική νότα στην καταστροφική πορεία των Origen στο Summer Split 2016. Οδήγησε μόνος του στην ομάδα σε μια σειρά από νίκες και τους κράτησε σε υψηλό επίπεδο, όταν όλα έδειχναν ότι είχαν χαθεί. Αυτές οι εμφανίσεις του κόντρα στο ρεύμα (αλλά και οι θαυμαστές του που τον λατρεύουν) σφράγισαν το εισιτήριό του για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Μπορεί να μην είναι ο κορυφαίος παίκτης του κόσμου στον χειρισμό, αλλά αναπληρώνει αυτό το κενό με την πολυετή του πείρα. Αν η Ευρώπη θέλει να αποφύγει άλλη μια αποκαρδιωτική εμφάνιση, θα πρέπει να βασιστεί στην αυτοπεποίθηση (αλλά και στις οργανωτικές ικανότητες) αυτού του αξιόπιστου βετεράνου για να βρει τον τρόπο να επιβληθεί στους ισχυρότερους παίκτες του κόσμου.</p>","hu_HU":"Paul „SoaZ” Boyer valódi esport-veterán, akinek karrierje 2010-ben kezdődött. Mielőtt az Origenhez szerződött, a Fnatic megbízható felső ösvényese volt két évig, és kétszer is velük tartott a világbajnokságra. A 2014-es szezon után a Fnatic elkezdte újjáépíteni magát, és szinte az összes játékos szétszéledt. A Fnatic elhagyása után az Origen alapítója és középső ösvényese, Enrique „xPeke” Cedeño Martínez próbálta meggyőzni Soazt, hogy csatlakozzon ötödikként a Kihívók Sorozatát megcélzó csapatával. Soaz azonnal ugrott a lehetőségre, és fontos szerepe volt abban, hogy az Origen jól teljesített a Kihívók Sorozatában, az EU LCS szakaszaiban, valamint hogy kijussanak a világbajnokságra.</p>\n\nSoaz volt az egyetlen, aki víz fölött tartotta az Origent a nagyon rosszul alakuló 2016-os nyári szakasz alatt. A legreménytelenebb helyzetekben szinte egymaga harcolt ki győzelmeket az Origennek. Ezek a teljesítmények és a rajongók odaadó szeretete váltotta meg neki a jegyet Barcelonába, a 2016-os All-Star gálára. A nyers képességek helyett a hosszú évek tapasztalata teszi igazán erőssé. Ha Európa nem szeretne ismét halványan szerepelni, akkor a megbízható veteránra (és az elmaradhatatlan bagettjére) fog támaszkodni, amikor a Szurdok legkeményebb arcaival kell szembenézni.\n","it_IT":"Paul \"Soaz\" Boyer è un vero veterano degli eSport la cui carriera è iniziata nel lontano 2010. Prima di unirsi agli Origen è stato una presenza fissa in corsia superiore con i Fnatic per oltre due anni, durante i quali ha partecipato anche a due Mondiali. Al termine della stagione 2014, i Fnatic hanno subito un processo di ristrutturazione che ha separato quasi tutti i loro membri. Dopo la sua partenza dai Fnatic, il fondatore e centrale degli Origen, Enrique \"xPeke\" Cedeño Martínez, lo ha invitato nella sua squadra come ultimo elemento per prendere d'assalto le Challenger Series. Soaz colse l'occasione al volo e divenne un elemento insostituibile degli Origen nel circuito Challenger, in vari split e persino in un Mondiale.</p>\n\nNel 2016, Soaz è stato probabilmente l'unica nota positiva degli Origen in un Summer Split da dimenticare. Ha guidato da solo gli Origen in ogni vittoria e li ha tenuti a galla anche quando tutto sembrava perduto. Le sue giocate eccellenti (e i suoi devoti fan) gli hanno fatto guadagnare il biglietto per Barcellona e la partecipazione all'All-Star. Le sue lacune nella meccanica sono più che compensate dalla sua grande esperienza. Se l'Europa vuole evitare un'altra brutta sconfitta, farà meglio ad affidarsi a questo robusto veterano (e alla sua baguette) per uscire vincitrice contro gli avversari più temibili della Landa.\n","ro_RO":"Paul ''SoaZ'' Boyer este un adevărat veteran eSports, a cărui carieră începe în 2010. Înainte să semneze cu Origen, a fost un jucător de neclintit pe culoarul de sus al celor de la Fnatic mai bine de doi ani, susținându-i în două parcursuri la Campionatul Mondial. După încheierea sezonului 2014, Fnatic a intrat într-un proces de reconstrucție, în urma căruia aproape întreaga echipă a luat-o pe drumuri separate. După plecarea sa de la Fnatic, fondatorul și jucătorul de pe culoarul din mijloc al Origen, Enrique ''xPeke'' Cedeño Martínez, l-a invitat pe Soaz să se alăture echipei sale în noua ei aventură din Seria Challenger. Soaz a profitat de ocazie și a fost un jucător-cheie în parcursul celor de la Origen în competiția Challenger, în multiplele etape din LCS și chiar într-o apariție la Campionatul Mondial.</p>\n\nSoaz a fost, probabil, sigura parte bună a etapei de vară din 2016, pe care Origen își dorește s-o uite. Prin forțele proprii, i-a condus pe cei din Origen către victorii și i-a menținut în competiție chiar și atunci când toate speranțele lor păreau să se fi năruit. Reușitele sale (și fanii loiali) i-au adus un bilet către Barcelona pentru a participa la evenimentul All-Star 2016. Lipsurile mecanice îi sunt compensate de ani și ani de experiență. Dacă Europa își dorește să evite o altă eliminare dezamăgitoare, va avea nevoie de îndrumarea acestui veteran puternic (și a baghetei sale) împotriva celei mai dificile concurențe din Rift.\n","es_AR":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","es_MX":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>"},"foreignIds":{"drupalId":"76","TRLH3":"200000055","TRLH4":"200000158"},"socialNetworks":{"azubu":"azubu.tv/soaz","facebook":"https://www.facebook.com/fnaticSOAZ?fref=ts","twitter":"https://twitter.com/sOAZIZGOOD"},"champions":[],"liveGameTeam":15},{"id":98,"slug":"rekkles","name":"Rekkles","firstName":"Martin","lastName":"Larsson","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rekkles-gflgilh4.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:40.000Z","updatedAt":"2017-06-09T10:10:40.000Z","bios":{"en_US":"<p>Martin “Rekkles” Larsson is one of the most feared AD carries in the world. Rekkles debuted for Fnatic in late 2012 and immediately garnered attention with his performances at several major tournaments. He also played a key role in unlocking the door to the halls of the immortals for Fnatic, ushering in an unprecedented 18W-0L record in the 2015 EU LCS Summer Split. But after key departures following the 2015 World Championship, Rekkles and Fnatic failed to defend their EU LCS crown in the 2016 Spring Split, falling to the eventual champions G2 Esports en route to a 3rd place finish.Even though the reunion of Rekkles and Yellowstar didn’t produce the results that Fnatic hoped for, Rekkles still performed admirably throughout the 2016 EU LCS Summer Split, accounting for more than a third of his team’s overall damage.</p>\n\n<p>After an exodus of players near the end of 2016, Rekkles stayed on board with Fnatic and helped assemble a new roster filled with crafty veterans and an eager rookie. Rekkles admitted to not performing up to his own standards last year, and the 2017 season is the perfect place to reassert himself as a dominant AD Carry. He’s truly at the helm of the new-look Fnatic and will look to not only guide them, but carry them as well.</p>","fr_FR":"<p>Martin « Rekkles » Larsson compte parmi les carrys AD les plus redoutés du monde. Rekkles a commencé sa carrière chez Fnatic fin 2012 et s'est immédiatement fait remarquer avec d'excellentes performances dans plusieurs tournois majeurs. Il a également aidé Fnatic à entrer dans la légende avec un record inédit de 18 victoires contre 0 défaite lors du segment d'été des LCS EU 2015. Mais après des départs de joueurs déterminants suite au Championnat du monde 2015, Rekkles et Fnatic n'ont pas su défendre leur titre des LCS EU lors du segment de printemps 2016, s'inclinant contre les futurs champions de G2 Esports et finissant ainsi en 3e place.</p>\n\n<p>Même si la réunion entre Rekkles et Yellowstar n'a pas eu l'effet escompté par Fnatic, Rekkles a tout de même joué de façon admirable pendant tout le segment d'été des LCS EU 2016, enregistrant plus d'un tiers des dégâts totaux de l'équipe. Ces chiffres impressionnants ont suffi à lui offrir une place à l'événement All-Stars 2016 de Barcelone, où il affrontera d'autres carrys AD légendaires pour tenter d'arracher l'Europe des ténèbres et de la ramener dans la lumière de l'opinion internationale.</p>","pl_PL":"<p>Jeden z najmłodszych i z tego powodu najbardziej oczekiwanych graczy na scenie esportowej League of Legends. Martin Larsson zaczął grać profesjonalnie w maju 2012 roku, lecz już parę miesięcy później dołączył do jednej z najsławniejszych organizacji – Fnatic. Niestety, ze względu na swój wiek, nie mógł wziąć udziału w EU LCS 2013. Do czasu możliwości pełnoprawnego uczestnictwa w tych rozgrywkach \"Rekkles\" realizował się w innych zespołach. 22 listopada 2013 roku oficjalnie powrócił do szeregów Fnatic i przejął swoje stanowisko AD Carry. Już od swoich wczesnych początków był uważany za jednego z najzdolniejszych mechanicznie graczy.</p>\n<p>Wraz z drużyną Fnatic udało mu się zabłysnąć. Pomijając efektowne występy na pomniejszych turniejach jak IEM, All-Stars czy Dreamhack, to jego największym sukcesem był sezon piąty. Bezpośrednio po jego kolejnym powrocie do czarno-żółtych, razem z nimi pobił światowy rekord – nie przegrał ani jednej gry w letnim sezonie EU LCS 2015. Następnie, podczas kwalifikacji do Mistrzostw Świata 2015 \"Rekkles\" zachwycił widzów swoim pentakillem Tristaną. Po części dzięki jego solidnej grze przeciwko Origenowi, Martin wygrał te rozgrywki. Na MŚ 2015 najbardziej rzucało się w oczy to, że był w stanie konkurować z chińskimi i amerykańskimi oponentami. </p>\n<p>Do osobistych osiągnięć Martina przede wszystkim trzeba zaliczyć wejście do Kręgu Pretendenta w trzech różnych regionach: Europie, Ameryce Północnej i Korei. Udało mu się dotrzeć tak wysoko na pozycji AD Carry, dzięki swoim ulubionym postaciom: Lucianowi, Ezrealowi i Vayne. Wiele osób zastanawiało się, jak uzdolniony sportowiec trafił do świata Runeterry. \"Rekkles\" był utalentowanym piłkarzem, lecz doznał kontuzji nogi. Wtedy po raz pierwszy spróbował gry w League of Legends, w której bardzo szybko świetnie się odnalazł. Podczas zmagań na turniejach inspiracją dla niego był jego ulubiony cytat – „Pudłujesz 100% swoich strzałów, których nigdy nie dokonałeś”. W 2015 roku, w społeczeństwie było bardzo głośno o jego przywiązaniu do innego sławnego AD Carry - Hyuk-kyu’a \"Deft\" Kima. Ich unikatowa znajomość to przykład, że rywalizacja nie zawsze przekreśla przyjaźń.</p>\n","de_DE":"<p>Martin „Rekkles“ Larsson ist einer der gefürchtetsten AD-Carrys der Welt. Rekkles gab sein Debüt für Fnatic Ende 2012 und sorgte mit seinen Leistungen bei mehreren großen Turnieren sofort für Aufsehen. Außerdem spielte er bei Fnatics Einzug in die Halle der Unsterblichen eine entscheidende Rolle, als die Mannschaft den Sommer-Split der EU LCS 2015 mit 18 Siegen ungeschlagen beendete. Als jedoch einige Schlüsselspieler nach der Weltmeisterschaft 2015 die Mannschaft verließen, scheiterten Rekkles und Fnatic im Frühjahrs-Split 2016 am zukünftigen Champion G2 Esports und schafften es nicht, ihre Krone zu verteidigen. Obwohl die Wiedervereinigung von Rekkles und Yellowstar nicht so verlief, wie Fnatic gehofft hatte, lieferte Rekkles im Sommer-Split der EU LCS 2016 eine ansprechende Leistung ab und war für mehr als ein Drittel des gesamten Schadens seiner Mannschaft verantwortlich.</p>\n\n<p>Trotz der Abgänge einiger Spieler Ende 2016 blieb Rekkles Fnatic treu und half mit, aus gewitzten Veteranen und einem eifrigen Nachwuchsspieler eine neue Mannschaft zu formen. Rekkles hat zugegeben, letztes Jahr nicht zu seiner Form gefunden zu haben. Der Frühjahrs-Split der EU LCS 2017 ist für ihn die perfekte Gelegenheit, sich wieder als dominanter AD-Carry zu etablieren. Er ist die Speerspitze des neuen Fnatics und wird nicht nur versuchen, seine Mannschaft zu leiten, sondern auch, sie von einem Sieg zum nächsten zu führen.</p>","es_ES":"<p>Martin \"Rekkles\" Larsson es uno de los AD carry más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el split de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el split de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del split de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros AD carry legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","pt_BR":"<p>Martin “Rekkles” Larsson é um dos atiradores mais temidos do mundo. Rekkles estreou na Fnatic no fim de 2012 e logo ganhou atenção com seu desempenho em vários grandes torneios. Ele também teve um papel fundamental para imortalizar a Fnatic, ajudando no recorde de 18 vitórias e nenhuma derrota na Etapa de Verão 2015 da LCS EU. Porém, após alguns desfalques depois do Campeonato Mundial 2015, Rekkles e a Fnatic falharam em defender a coroa da LCS EU na Etapa de Primavera 2016, perdendo para a campeã G2 Esports e terminando em terceiro lugar.</p>\n\n<p>Apesar da reunião de Rekkles e YellOwStaR não produzir os resultados que a Fnatic esperava, Rekkles ainda teve um desempenho admirável durante toda a Etapa de Verão 2016 da LCS EU, sendo o responsável por mais de um terço do dano de sua equipe. Os números impressionantes foram suficientes para levá-lo a ser o Atirador mais votado da Europa no Evento All-Star 2016, onde ele batalhará contra outros atiradores lendários e vai tentar tirar a Europa do escuro para colocá-la de volta no cenário internacional.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Martin “Rekkles” Larsson는 세계에서 가장 두려운 원거리 딜러 중 하나입니다. Fnatic 소속으로 2012년 후반에 데뷔하자마자 IPL5에서 준우승하는 등 여러 주요 대회에서 엄청난 활약을 하며 주목을 받았습니다. 하지만 e스포츠에서 성공하려면 단순한 개인 기량뿐 아니라 인간 관계가 중요하다는 것 또한 잘 알고 있는 것이 Rekkles 선수입니다. 모델처럼 매력적인 외모와 무서운 파밍 능력을 함께 갖춘 Rekkles는 그런 면에서 완벽한 선수라고 할 수 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Fnatic이 유례없는 18승 무패로 2015 유럽 LCS 서머 스플릿을 마치는 대기록을 세우는 데에도 Rekkles의 역할이 핵심적이었습니다. 어떻게 그게 가능했을까요? 항상 노력하는 Rekkles 선수와, YellOwStaR 선수의 적절한 서포팅, 어느 한쪽으로 치우치지 않는 킬과 어시스트, 그리고 나서 엄청난 CS 수급력이 합쳐졌기 때문이죠. 실제로 2015 유럽 LCS 서머 스플릿에서 KDA 순위 1, 2위를 Fnatic의 봇 라인 선수 두 명이 합계 27을 기록하며 독점해 버렸습니다. </p>\n<p style=”font-family:”나눔고딕”;\">물론 그렇게 킬을 올렸어도 Isaac \"PePiiNeRo\" Flores 선수의 분노를 피해갈 순 없었죠. 유감입니다. </p>\n","cs_CZ":"<p>Martin „Rekkles“ Larsson je jedním z nejobávanějších ADC na světě. Debutoval koncem roku 2012 v řadách Fnaticu a okamžitě vzbudil pozornost svými výkony na několika významných turnajích. Sehrál také klíčovou roli při uvedení Fnaticu do historie, když jeho tým během letního splitu evropského LCS 2015 dosáhl do té doby nevídané bilance výher 18:0. Ovšem poté, co po mistrovství světa 2015 z celku odešlo několik důležitých členů, Rekkles a Fnatic v jarním splitu EU LCS 2016 už titul neobhájili, podlehli budoucím šampionům z G2 Esports a skončili na 3. místě.</p>\n\n<p>Ačkoliv opětovné shledání Rekklese a Yellowstara nemělo takové výsledky, v jaké Fnatic doufali, podával Rekkles po celou dobu letního splitu EU LCS 2016 působivé výkony a připsal si na konto více než třetinu celkového poškození, jež jeho tým uštědřil. Tato ohromující čísla stačila, aby vyhrál hlasování k turnaji All-Star 2016 v Barceloně, kde se střetne s ostatními legendárními ADC a pokusí se vyvést Evropu z temnoty zpět na světlo mezinárodní slávy.</p>","el_GR":"<p>Ο Martin “Rekkles” Larsson είναι ένας από τους πιο επικίνδυνους AD Carry στον κόσμο. Ο Rekkles έκανε την πρώτη του εμφάνιση με τους Fnatic στα τέλη του 2012 και έστρεψε αμέσως επάνω του τα φώτα της δημοσιότητας με τις εκπληκτικές του εμφανίσεις σε πολλά σημαντικά τουρνουά. Επίσης, έπαιξε σημαντικό ρόλο σε ορισμένα από τα μεγαλύτερα ρεκόρ που έχουν πετύχει οι Fnatic, όπως το ανεπανάληπτο σερί 18 νικών και 0 ηττών Summer Split 2015 του LCS Ευρώπης. Όμως, μετά το Παγκόσμιο Πρωτάθλημα 2015 υπήρξαν ορισμένες πολύ σημαντικές αποχωρήσεις από την ομάδα, με αποτέλεσμα ο Rekkles και οι Fnatic να μην μπορέσουν να υπερασπιστούν τον τίτλο τους στο Spring Split 2016 του LCS Ευρώπης. Γνώρισαν την ήττα από τους G2 Esports, οι οποίοι θα έπαιρναν στη συνέχεια τον τίτλο, και περιορίστηκαν στην 3η θέση.</p>\n\n<p>Παρόλο που η επανένωση του Rekkles και του Yellowstar δεν είχε τα αποτελέσματα που έλπιζαν οι Fnatic, ο Rekkles είχε μια πολύ καλή παρουσία στο Summer Split 2016 του LCS Ευρώπης, καθώς έκανε μόνος του τουλάχιστον το ένα τρίτο της συνολικής ζημιάς της ομάδας. Χάρη στα εντυπωσιακά του στατιστικά, συγκέντρωσε αρκετές ψήφους για να βρεθεί κι αυτός στο Τουρνουά All-Star 2016 στη Βαρκελώνη, όπου θα αναμετρηθεί με άλλους θρυλικούς AD Carry στην προσπάθειά του να φέρει και πάλι την Ευρώπη στο διεθνές προσκήνιο.</p>","hu_HU":"<p>Martin „Rekkles” Larsson a világ egyik legrettegettebb lövésze. Rekkles a Fnaticben kezdte a karrierjét 2012 végén, és hamar felhívta magára a figyelmet a nagy versenyeken nyújtott teljesítményével. Fontos szerepe volt abban is, hogy a Fnatic bekerüljön a halhatatlanok csarnokába, akikkel addig példátlan 18 meccses, veretlen győzelmi sorozatot értek el az EU LCS 2015-ös nyári szakaszában. A csapat fontos embereket veszített el a 2015-ös világbajnokság után, ezért Rekkles és a Fnatic nem tudta megvédeni címét az EU LCS 2016-os tavaszi szakaszában, és végül 3. helyen végzett, valamint kikapott a szakaszt megnyerő G2 Esportstól.</p>\n\nRekkles és Yellowstar jelenléte nem hozta az eredményeket, amelyeket a Fnatic várt, de Rekkles remekül játszott az EU LCS 2016-os nyári szakasza során, a csapat összesített sebzésének több mint harmadát ő okozta. Már csak emiatt is ott a helye a 2016-os All-Star gálán Barcelonában, ahol legendás lövészekkel kell megküzdenie, hogy kiássa Európát a gödörből.\n","it_IT":"<p>Martin \"Rekkles\" Larsson è uno degli ADC più temuti al mondo. Ha debuttato nel tardo 2012 con i Fnatic e ha subito attirato l'attenzione con le sue eccellenti giocate in molti tornei internazionali. È stato anche fondamentale per far entrare i Fnatic nell'olimpo degli immortali con un record mai visto di 18 vittorie e nessuna sconfitta nel Summer Split 2015 della LCS EU. Tuttavia, dopo i grandi abbandoni a seguito dei Mondiali 2015, Rekkles e i Fnatic non sono riusciti a difendere la corona nello Spring Split 2016, inchinandosi davanti ai nuovi campioni, i G2 Esports, e concludendo la stagione al terzo posto.</p>\n\nNonostante la reunion di Rekkles e Yellowstar non abbia prodotto i risultati che i Fnatic speravano, Rekkles si è comunque comportato egregiamente durante il Summer Split 2016 della LCS EU, infliggendo più di un terzo dei danni totali della sua squadra. Queste cifre impressionanti sono state sufficienti a fargli guadagnare i voti necessari a partecipare all'All-Star 2016 di Barcellona, dove si scontrerà con altri ADC leggendari cercando di traghettare l'Europa fuori dalla sua striscia negativa e donarle un nuovo successo internazionale.\n","ro_RO":"<p>Martin ''Rekkles'' Larsson este unul dintre cei mai de temut AD carry din lume. Rekkles a debutat alături de Fnatic la finalul anului 2012 și a atras imediat atenția publicului cu reușitele sale în cadrul câtorva turnee importante. În plus, a jucat un rol important în echipă, ajutându-i pe cei de la Fnatic să intre în istoria LoL și obținând un record fără precedent de 18 victorii și 0 înfrângeri în etapa de vară a LCS EU 2015. Dar în urma plecării unor jucători cheie imediat după Campionatul Mondial 2015, Rekkles și Fnatic nu au reușit să-și apere titlul din LCS EU în etapa de primăvară din 2016, terminând pe locul al treilea ca urmare a unei înfrângeri în fața viitorilor campioni, G2 Esports.</p>\n\nChiar dacă reuniunea lui Rekkles cu Yellowstar nu a adus rezultatele pe care și le-au dorit cei de la Fnatic, Rekkles s-a descurcat admirabil pe parcursul etapei de vară a LCS EU 2016, însumând mai bine de o treime din daunele totale ale echipei sale. Statisticile impresionante i-au adus voturile fanilor și calificarea la evenimentul All-Star 2016 din Barcelona, unde se va înfrunta cu alți AD Carry legendari. Acolo va lupta pentru a pune capăt seriei de nereușite ale Europei la turneele internaționale.\n","en_PL":"<p>Martin „Rekkles” Larsson jest jednym z budzących największy lęk prowadzących na świecie. Rekkles zadebiutował we Fnatic pod koniec 2012 roku i natychmiast zwrócił na siebie uwagę występami na kilku większych turniejach. Odegrał także kluczową rolę w zdobyciu miejsca pośród nieśmiertelnych sław dla Fnatic, osiągając bezprecedensowy wynik 18 zwycięstw przy 0 przegranych podczas letniego splitu EU LCS 2015. Ale gdy po Mistrzostwach Świata 2015 odeszło kilku ważnych zawodników, Rekkles i Fnatic nie zdołali obronić tytułu EU LCS podczas wiosennego splitu 2016, ulegając późniejszym mistrzom, G2 Esports i kończąc na trzecim miejscu.</p>\n\nChociaż ponowne zejście się Rekklesa i Yellowstara nie zapewniło rezultatów, których oczekiwali Fnatic, Rekkles wciąż znakomicie prezentował się w toku letniego splitu EU LCS 2016, zaliczając na swoje konto ponad jedną trzecią ogółu obrażeń zadanych przez drużynę. Te imponujące statystyki wystarczyły, by został wybrany w głosowaniu do uczestnictwa w wydarzeniu All-Star 2016 w Barcelonie, dokąd pojedzie zmierzyć się z innymi legendarnymi prowadzącymi i będzie toczył pojedynki, których stawką jest wyciągnięcie Europy z mroku zapomnienia w światło międzynarodowego uznania.\n","es_AR":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","es_MX":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>"},"foreignIds":{"drupalId":"1140","TRLH3":"200000058","TRLH4":"200000161"},"socialNetworks":{"twitch":"www.twitch.tv/Rekkles","facebook":"www.facebook.com/Rekkles1?fref=ts","twitter":"https://twitter.com/RekklesLoL"},"champions":[],"liveGameTeam":15},{"id":172,"slug":"jesiz","name":"Jesiz","firstName":"Jesse","lastName":"Le","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jesiz-dsbaxff3.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-06-09T10:12:41.000Z","bios":{"en_US":"<p>Jessie “Jesiz” Le has been on the professional scene since 2013, playing for teams like Coast, Gamers2, and Dignitas. He took a break from professional play in order to become the assistant coach for Immortals in 2016. He ended up trying out for Fnatic at the end of the year and they invited him to become their starting support.</p>\n\n<p>Jesiz is a flexible player that is now playing the third different role of his professional career. After playing as both a mid laner and AD Carry, he made yet another role swap in order to fill Fnatic’s support vacancy. More than anything Fnatic is searching for some continuity at the support position after recent times have been filled with ups and downs. Jesiz certainly brings a wealth of experience with him, but will it turn into wins? Only time will tell.</p>","de_DE":"<p>Jessie „Jesiz“ Le ist bereits seit 2013 fixer Bestandteil der professionellen E-Sport-Szene und hat schon für Mannschaften wie Coast, Gamers2 oder Dignitas gespielt. 2016 nahm er sich jedoch eine Auszeit, um der Co-Trainer der Immortals zu werden. Am Ende des Jahres bewarb er sich dann bei Fnatic und wurde zum Supporter der Mannschaft.\n\nJesiz ist ein flexibler Spieler, der im Verlauf seiner Karriere bereits auf zwei anderen Positionen gespielt hat. Nachdem er bereits als Mid-Laner und AD-Carry gespielt hatte, wechselte er erneut die Rolle, um Fnatics Suche nach einem Supporter zu beenden. Nach den Höhen und Tiefen der letzten beiden Splits braucht Fnatic nichts dringender, als eine gewisse Kontinuität auf der Supporter-Position. Jesiz kann auf einiges an Erfahrung zurückgreifen, aber wird sich das auch in Siegen widerspiegeln? Wir werden es sehen …</p>"},"foreignIds":{"drupalId":"1126","TRLH3":"200000059","TRLH4":"200000162"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":344,"slug":"xyraz","name":"Xyraz","firstName":"Gustav","lastName":"Blomkvist","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xyraz-24ixeasw.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-05-31T21:08:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3684","TRLH3":"200000300","TRLH4":"200000400"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1264,"slug":"special","name":"Special","firstName":"Joran","lastName":"Scheffer","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/special-69mtzco4.png","hometown":"EU","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:15:34.000Z","updatedAt":"2016-07-30T04:57:42.000Z","bios":{},"foreignIds":{"TRLH3":"1001310008","TRLH4":"1001270008","TRLH2":"1001250047","FRA1TMNT2":"25217"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AVmJrRrZoUG4HPFjOKIf","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:6048d57b-3c72-4014-9cb8-5368cefcbf08","scheduledTime":"2017-01-27T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"2","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:2b9effad-fbbc-4d36-a3be-547588b3a143"},"match":"6048d57b-3c72-4014-9cb8-5368cefcbf08","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"2b9effad-fbbc-4d36-a3be-547588b3a143","league":"3"}],"gameIdMappings":[{"id":"7e314e4e-2e5c-4dba-abda-fd9be02a6072","gameHash":"6354b7d4f7095f16"},{"id":"11261dae-663d-4927-b538-f3818918ba09","gameHash":"4f8fd53c40119c58"},{"id":"43171cb6-283f-4325-9bd1-26e62851afba","gameHash":"30633196fec71c5d"}],"videos":[{"id":5212,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:11261dae-663d-4927-b538-f3818918ba09","source":"https://www.youtube.com/embed/Nx5pPnaFT4Q?wmode=transparent","createdAt":"2017-01-27T20:03:11.000Z","updatedAt":"2017-01-27T20:03:11.000Z","game":"11261dae-663d-4927-b538-f3818918ba09"},{"id":5213,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:43171cb6-283f-4325-9bd1-26e62851afba","source":"https://www.youtube.com/embed/1SFRzK9ZkvI?wmode=transparent","createdAt":"2017-01-27T21:08:39.000Z","updatedAt":"2017-01-27T21:08:39.000Z","game":"43171cb6-283f-4325-9bd1-26e62851afba"},{"id":5224,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:7e314e4e-2e5c-4dba-abda-fd9be02a6072","source":"https://www.youtube.com/embed/u-jo-XJzrRY?wmode=transparent","createdAt":"2017-01-28T04:37:17.000Z","updatedAt":"2017-01-28T04:37:17.000Z","game":"7e314e4e-2e5c-4dba-abda-fd9be02a6072"}],"htmlBlocks":[],"match":{"id":"6048d57b-3c72-4014-9cb8-5368cefcbf08","name":"GIA-vs-FNC","position":8,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"},{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],"games":{"11261dae-663d-4927-b538-f3818918ba09":{"id":"11261dae-663d-4927-b538-f3818918ba09","name":"G1","generatedName":"FNC|GIA|G1|6048d57b3c7240149cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"},{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],"standings":{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}]],"timestamp":1485547473066,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}]],"timestamp":1485543752524,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001930095","gameRealm":"TRLH3","platformId":"TRLH3:1001930095","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"7e314e4e-2e5c-4dba-abda-fd9be02a6072":{"id":"7e314e4e-2e5c-4dba-abda-fd9be02a6072","name":"G3","generatedName":"FNC|GIA|G3|6048d57b3c7240149cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"},{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],"standings":{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485578321372,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485550196762,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001930105","gameRealm":"TRLH3","platformId":"TRLH3:1001930105","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"43171cb6-283f-4325-9bd1-26e62851afba":{"id":"43171cb6-283f-4325-9bd1-26e62851afba","name":"G2","generatedName":"FNC|GIA|G2|6048d57b3c7240149cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"standings":{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485551212700,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485547448636,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001930103","gameRealm":"TRLH3","platformId":"TRLH3:1001930103","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485578321372,"source":"bestOf","history":[{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485551212700,"source":"bestOf","closed":true},{"result":[[{"roster":"6026b61b-494a-4339-b4b2-28e5a04c741d"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1485550196762,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"0dba28fa-f921-4b54-87f5-d68be03505ff":0,"6026b61b-494a-4339-b4b2-28e5a04c741d":1}}}