{"teams":[{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]},{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]}],"players":[{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AVTGt7f9oUG4HPFjOJ_I","content":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:match:61335341-1d80-4b27-8e11-a59c4ef878ae","scheduledTime":"2016-07-21T17:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb","blockLabel":"8","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:bracket:88a5aa52-4461-4a15-8fb5-83c8b5265f93"},"match":"61335341-1d80-4b27-8e11-a59c4ef878ae","tournament":"f7afa181-4580-48c0-af26-4b3d70fe21eb","bracket":"88a5aa52-4461-4a15-8fb5-83c8b5265f93","league":"3"}],"gameIdMappings":[{"id":"b6eacb0b-c538-436e-9586-4a5d95e99511","gameHash":"37b4744837255238"},{"id":"e362ac1a-6978-4df0-ac1d-564b726176da","gameHash":"9526651754957b4a"}],"videos":[{"id":3850,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:b6eacb0b-c538-436e-9586-4a5d95e99511","source":"https://www.youtube.com/embed/yxHdLqbivEc?wmode=transparent","createdAt":"2016-07-21T20:09:56.000Z","updatedAt":"2016-07-21T20:09:56.000Z","game":"b6eacb0b-c538-436e-9586-4a5d95e99511"},{"id":3851,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:e362ac1a-6978-4df0-ac1d-564b726176da","source":"https://www.youtube.com/embed/NWYNzkA7v8Y?wmode=transparent","createdAt":"2016-07-21T20:10:20.000Z","updatedAt":"2016-07-21T20:10:20.000Z","game":"e362ac1a-6978-4df0-ac1d-564b726176da"}],"htmlBlocks":[],"match":{"id":"61335341-1d80-4b27-8e11-a59c4ef878ae","name":"OG-vs-GIA","position":7,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"},{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],"games":{"e362ac1a-6978-4df0-ac1d-564b726176da":{"id":"e362ac1a-6978-4df0-ac1d-564b726176da","name":"G2","generatedName":"GIA|OG|G2|613353411d804b278e11","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"},{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}],"standings":{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469131105742,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469126918386,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001730049","gameRealm":"TRLH3","platformId":"TRLH3:1001730049","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b6eacb0b-c538-436e-9586-4a5d95e99511":{"id":"b6eacb0b-c538-436e-9586-4a5d95e99511","name":"G1","generatedName":"GIA|OG|G1|613353411d804b278e11","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"},{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],"standings":{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469131283081,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469124235855,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740027","gameRealm":"TRLH3","platformId":"TRLH3:1001740027","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469131105743,"source":"bestOf","history":[{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469131283081,"source":"bestOf","closed":true},{"result":[[{"roster":"c787a814-bae5-4156-9fbe-369fd464add3"}],[{"roster":"2c32f556-6cc3-497b-ad71-121817960654"}]],"timestamp":1469126918386,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"c787a814-bae5-4156-9fbe-369fd464add3":3,"2c32f556-6cc3-497b-ad71-121817960654":0}}}