{"teams":[{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]},{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]}],"players":[{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AVTfsPs7QMQFcjhwbQjv","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:63e106bc-a766-46ac-a2e2-484f16f58504","scheduledTime":"2016-06-26T22:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"4","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"63e106bc-a766-46ac-a2e2-484f16f58504","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"d7dc01e7-8fb1-4e62-99aa-7c2265982bf2","gameHash":"2988e030de889179"},{"id":"67498508-c3cd-419f-a24c-9ced80672de5","gameHash":"7b11b422397350c0"}],"videos":[{"id":3458,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:d7dc01e7-8fb1-4e62-99aa-7c2265982bf2","source":"https://www.youtube.com/embed/AFC0S1lY2sE?wmode=transparent","createdAt":"2016-06-26T22:54:57.000Z","updatedAt":"2016-06-26T22:54:57.000Z","game":"d7dc01e7-8fb1-4e62-99aa-7c2265982bf2"},{"id":3460,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:67498508-c3cd-419f-a24c-9ced80672de5","source":"https://www.youtube.com/embed/5qy08ujmwtw?wmode=transparent","createdAt":"2016-06-27T00:55:19.000Z","updatedAt":"2016-06-27T00:55:19.000Z","game":"67498508-c3cd-419f-a24c-9ced80672de5"}],"htmlBlocks":[],"match":{"id":"63e106bc-a766-46ac-a2e2-484f16f58504","name":"P1-vs-CLG","position":6,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"games":{"67498508-c3cd-419f-a24c-9ced80672de5":{"id":"67498508-c3cd-419f-a24c-9ced80672de5","name":"G2","generatedName":"CLG|P1|G2|63e106bca76646aca2e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"},{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}],"standings":{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466988449234,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466980847003,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001760117","gameRealm":"TRLH1","platformId":"TRLH1:1001760117","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d7dc01e7-8fb1-4e62-99aa-7c2265982bf2":{"id":"d7dc01e7-8fb1-4e62-99aa-7c2265982bf2","name":"G1","generatedName":"CLG|P1|G1|63e106bca76646aca2e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"standings":{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466981535791,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466978151357,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001760098","gameRealm":"TRLH1","platformId":"TRLH1:1001760098","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0aea2517-090f-4b6a-adf8-8b5e89bb5f31":{"id":"0aea2517-090f-4b6a-adf8-8b5e89bb5f31","name":"G3","generatedName":"CLG|P1|G3|63e106bca76646aca2e2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466988449235,"source":"bestOf","history":[{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466981535791,"source":"bestOf","closed":true},{"result":[[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1466980847003,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"0dd99862-70d4-49c3-b7cb-91f1a273cd7a":1,"b523655f-a1ad-461b-9c86-bcba2cb712f7":0}}}