{"teams":[{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]},{"id":91,"slug":"flash-wolves","name":"Flash Wolves","guid":"be6e12bc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-hksj5z2h.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-72ikguj5.png","acronym":"FW","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T17:45:02.000Z","bios":{"en_US":"<p>\nThe Flash Wolves are one of the most successful and storied teams in the LMS, and are hungry for another shot at the world stage. They’re no strangers to playing against global teams with the world watching; they've built a reputation as one of the only teams to consistently take games off world champions SK telecom T1. The players have spoken often and publicly about their drive to keep pushing LMS as a strong region that can compete with the best.\n</p>\n<p>\nOriginally founded in 2013, the Flash Wolves have consistently maintained their strength in the LMS. They've captured three straight LMS titles going back to last year. The team isn’t happy with running roughshod over the competition in their native region, though -- they’re gearing up to take the fight to the champions of each region.\n</p>\n\n<p>Coach: Chou “Steak” Frank</p>","fr_FR":"Les Flash Wolves sont l'une des équipes des LMS qui ont obtenu les plus grands succès et dont on a le plus parlé, et ils ont hâte de bénéficier d'une nouvelle chance sur la scène mondiale. Ils sont habitués à affronter des équipes internationales sous le regard du monde entier ; ils comptent même parmi les rares organisations à battre systématiquement les champions du monde de SK Telecom T1. Les joueurs ont souvent et publiquement parlé de leur désir de faire des LMS une puissante région capable d'affronter les meilleurs.\n\nFondée en 2013, l'équipe Flash Wolves a constamment maintenu son niveau aux LMS. Ils détiennent d'ailleurs le titre de champions LMS depuis trois années consécutives. Mais l'équipe ne veut pas se contenter de ces succès locaux : elle a bien l'intention d'affronter les champions de toutes les régions et de prouver qu'elle est de taille à attaquer n'importe quelle horde au Mid-Season Invitational 2017.\n\nEntraîneur : Chou « Steak » Frank\n","pl_PL":"Flash Wolves są jedną z najlepszych drużyn w LMS, a jej członkowie po raz kolejny spróbują sięgnąć po chwałę na światowej arenie. Gra przeciwko najwyższej klasy drużynom na oczach całego świata nie jest im obca; zdobyli sobie reputację jednej z niewielu drużyn, które konsekwentnie wygrywają mecze z mistrzami świata, SK Telecom T1. Zawodnicy drużyny często publicznie wspominają, że chcą zaprezentować LMS jako silny region, który może rywalizować z najlepszymi.\n\nZałożona w 2013 roku drużyna Flash Wolves stale osiąga dobre wyniki w LMS. Do zeszłego roku zdobyła trzy tytuły LMS z rzędu. Drużyna nie jest jednak usatysfakcjonowana poniewieraniem lokalnymi rywalami — przygotowuje się do walki z mistrzami  regionów, aby dowieść, że jest watahą, która potrafi pokonać najlepszych na Mid-Season Invitational 2017.\n\nTrener: Chou „Steak” Frank\n","de_DE":"Die Flash Wolves sind eine der erfolgreichsten und bekanntesten Mannschaften der LMS und wollen sich endlich einen internationalen Titel sichern. Sie sind es gewohnt, gegen Mannschaften aus anderen Regionen zu spielen, während die Welt zusieht, und gehören zu den wenigen Mannschaften, die gegen die Weltmeister von SK Telecom T1 gewinnen können. Die Spieler haben auch in der Öffentlichkeit immer wieder betont, dass sie die LMS zu einer Region machen wollen, die sich mit den besten der Welt messen kann.\n\nSeit ihrer Gründung 2013 haben die Flash Wolves stets ihre Stärke in der LMS unter Beweis gestellt. Seit dem letzten Jahr konnten sie sich in der LMS drei Titel sichern. Aber die Mannschaft will sich nicht damit begnügen, ihre Heimregion zu dominieren – sie bereiten sich darauf vor, den Kampf zu den Champions der anderen Region zu tragen und zu beweisen, dass es dieses Wolfsrudel beim Mid-Season Invitational 2017 mit den Größten aufnehmen kann.\n\nTrainer: Chou „Steak“ Frank\n","es_ES":"Flash Wolves es uno de los equipos más laureados y veteranos de la LMS, y está deseando tener una nueva oportunidad en el escenario mundial. No es la primera vez que compite contra equipos de todo el mundo con los espectadores internacionales como público; de hecho, se han forjado una reputación como uno de los pocos equipos capaces de ganar partidas contra los campeones mundiales SK telecom T1. Sus jugadores han hablado en más de una ocasión de forma pública sobre lo decididos que están a conseguir que la LMS se convierta en una región fuerte capaz de competir contra las mejores.\n\nFundado en 2013, Flash Wolves ha mostrado en todo momento su superioridad en la LMS: ha conseguido hacerse con tres títulos de la LMS seguidos. Pero el equipo no se conforma con triunfar en las competiciones de su región, sino que quiere enfrentarse a los campeones de todas las regiones y demostrar que su manada de lobos puede aplastar a los mejores en el Mid-Season Invitational 2017.\n\nEntrenador: Chou ''Steak'' Frank\n","pt_BR":"<p>A Flash Wolves é uma das equipes mais bem-sucedidas e celebradas na LMS e está ávida para outra chance no cenário mundial. Eles sabem bem como é jogar contra equipes globais com o mundo inteiro assistindo; construíram sua reputação como uma das únicas equipes a ganhar consistentemente dos campeões mundiais SK Telecom T1. Os jogadores têm falado frequente e publicamente sobre sua vontade de continuar tornando a LMS uma região forte e capaz de competir com os melhores.</p>\n\n<p>Fundada originalmente em 2013, a Flash Wolves tem mantido sua força na LMS. Eles capturaram três títulos seguidos na LMS desde o ano passado. Mas a equipe não está feliz com seu tratamento da oposição na sua região nativa. E eles estão se preparando para lutar contra os campeões de cada região e provar que esta matilha é capaz de derrotar os melhores no Mid-Season Invitational 2017.</p>\n\nTécnico: Chou \"Steak\" Frank</p>","es_AR":"<p>The Flash Wolves son uno de los equipos con más historia y éxito de la LMS, y se encuentran ansiosos de extender sus galardones al ámbito internacional. No son extraños a estos eventos globales; tienen una rivalidad con el equipo de Norteamérica Counter Logic Gaming, y han ganado partidas contra Cloud9 y Team SoloMid en la IEM Katowice 2015. Sus jugadores intentan llevar a la LMS al punto en que puedan competir con las mejores regiones mundiales, y trabajan para eso diariamente.</p>\n\n<p>Fundado en el 2013, los Flash Wolves se han mantenido a tope de la LMS consistentemente. Su trofeos incluyen el 1º lugar del Spring Split de la LMS en el 2015 y 2016. Pero el equipo no se conforma con liderar su región, se están preparando para pelear contra los campeones de cada rincón del mundo, y probar que esta jauría de lobos puede bajar a los más grandes.</p>\n\n<p><strong>Entrenador: Chen \"WarHorse\" Ju-Chih</strong></p>"},"foreignIds":{"drupalId":"1694"},"players":[110,617,631,633,1646,1849],"starters":[110,617,631,633,1646],"subs":[1849]}],"players":[{"id":110,"slug":"maple","name":"Maple","firstName":"Yi-Tang","lastName":"Huang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maple-g0kqxct3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":"","createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-07-06T14:27:55.000Z","bios":{"en_US":"<p>Yi-Tang “Maple” Huang is one of the most versatile mid laners around. He’s already proven to be practically unopposed in the LMS region, where he led all mid laners with a 6.9 KDA during the regular season. What’s even more impressive is that he’s still a teenager, with what looks to be a promising future ahead of him on the Flash Wolves.</p>\n\n<p>Maple demonstrated his wide champion pool when he played six different champions in six games at the 2016 World Championship. Unfortunately, he failed to find consistent success, and Flash Wolves failed to make it out of the Group Stage. Maple will no doubt jump at another chance to prove himself on the international stage.</p>","fr_FR":"Yi-Tang « Maple » Huang est l'un des midlaners les plus polyvalents. Il a déjà prouvé qu'il n'avait quasiment aucun adversaire dans la région LMS, où il a devancé tous les autres midlaners avec un KDA de 6,9 pendant la saison régulière. C'est d'autant plus impressionnant quand on sait qu'il est encore adolescent et qu'il a donc un avenir prometteur chez les Flash Wolves.\n\nMaple a montré son vaste pool de champions en jouant six champions différents dans six matchs lors du Championnat du monde 2016. Malheureusement, il a manqué de constance et les Flash Wolves n'ont pas réussi à sortir gagnants de la phase de groupe. Maple ne manquera pas de saisir cette nouvelle chance de montrer toute l'ampleur de son talent sur la scène internationale lors du Mid-Season Invitational 2017\n","pl_PL":"Yi-Tang „Maple” Huang jest aktualnie jednym z najwszechstronniejszych środkowych. Pokazał już, że jest praktycznie niepokonany w regionie LMS, w którym prowadził wśród środkowych z wynikiem 6,9 Z/Z/A w sezonie zasadniczym. Jeszcze większe wrażenie robi fakt, że wciąż jest nastolatkiem, którego czeka obiecująca przyszłość we Flash Wolves.\n\nMaple zademonstrował swoją szeroką pulę bohaterów, gdy zagrał sześcioma różnymi bohaterami w sześciu grach Mistrzostw Świata 2016. Niestety nie udało mu się powtórzyć wcześniejszych sukcesów i Flash Wolves nie zdołali wyjść z fazy grupowej. Maple bez wątpienia z radością skorzysta z kolejnej okazji, by dowieść swojej wartości na międzynarodowej arenie Mid-Season Invitational 2017.\n","de_DE":"Yi-Tang „Maple“ Huang ist einer der vielseitigsten Mid-Laner überhaupt. Mit einer TTU von 6,9 (der höchste Wert aller Mid-Laner) während der regulären Saison hat er bewiesen, dass es in der LMS-Region niemanden gibt, der es mit ihm aufnehmen kann. Noch beeindruckender ist, dass er noch ein Teenager ist, der zusammen mit den Flash Wolves eine große Zukunft vor sich hat.\n\nMaple hat mit sechs unterschiedlichen Champions in sechs Spielen der Weltmeisterschaft 2016 bewiesen, wie vielseitig er ist. Leider war er zu unbeständig und die Flash Wolves schieden in der Gruppenphase aus. Maple wird beim Mid-Season Invitational 2017 ohne Zweifel versuchen, sein Können unter Beweis zu stellen.\n","es_ES":"Yi-Tang ''Maple'' Huang es uno de los mid más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la región LMS, donde ha destacado entre los mid con un A/M/A de 6,9 puntos durante la temporada regular. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.\n\nMaple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió mantener la regularidad y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para ponerse a prueba en el escenario internacional del Mid-Season Invitational 2017.\n","pt_BR":"<p>Yi Tang “Maple” Huang é um dos jogadores de meio mais versáteis que existe. Ele já provou ser praticamente imbatível na região LMS, onde conseguiu 48,6% dos votos da rota. O que é ainda mais impressionante é que ainda é um adolescente, ostentando o que parece ser um futuro promissor na Flash Wolves.</p>\n\n<p>Maple demonstrou seu grande rol de Campeões quando jogou com seis personagens diferentes em seis partidas do Campeonato Mundial 2016. Infelizmente, ele não conseguiu manter o sucesso e a Flash Wolves falhou em sair da Fase de Grupos. Dada outra chance, Maple certamente vai agarrar a oportunidade de batalhar contra outros dos melhores jogadores de meio do mundo.</p>","es_AR":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>","cs_CZ":"<p>Yi Tang „Maple“ Huang je jedním z nejvšestrannějších středových lajnařů, na které jen můžete narazit. Jasně prokázal, že v celém LMS by jen těžko hledal nějakou konkurenci, o čemž svědčí i 48,6 % hlasů, které ve středové lajně získal. Tento fakt je o to působivější, že je dosud teenager. Vše nasvědčuje tomu, že jej v řadách Flash Wolves čeká slibná budoucnost.</p>\n\n<p>Maple na mistrovství světa 2016 demonstroval šíři své množiny šampionů, v šesti utkáních totiž hrál za šest různých postav. Bohužel se mu ne vždy dařilo a Flash Wolves nepostoupili ze skupiny. Maple tedy určitě využije druhou šanci rozpoutat masakr mezi těmi nejlepšími středovými lajnaři světa.</p>","el_GR":"<p>Ο Yi Tang “Maple” Huang είναι ένας από τους πιο ευέλικτους παίκτες μεσαίας λωρίδας. Έχει αποδείξει ήδη ότι δεν έχει αντίπαλο στο LMS, άρα δεν ήταν καθόλου περίεργο που συγκέντρωσε το 48,6% των ψήφων της περιοχής. Αυτό που είναι ακόμα πιο εντυπωσιακό είναι ότι ακόμα δεν έχει κλείσει καν τα είκοσι και, όπως όλα δείχνουν, έχει μπροστά του ένα λαμπρό μέλλον με τους Flash Wolves.</p>\n\n<p>Ο Maple έδειξε σε όλους πόσο καλά χειρίζεται μια τεράστια γκάμα ηρώων, όταν έπαιξε με έξι διαφορετικούς ήρωες σε έξι παιχνίδια του Παγκοσμίου Πρωταθλήματος 2016. Δυστυχώς, δεν κατάφερε να πιάσει σταθερή απόδοση, με αποτέλεσμα να μην καταφέρουν οι Flash Wolves να περάσουν τη Φάση Ομίλων. Είναι βέβαιο ότι ο Maple θα αδράξει τη δεύτερη ευκαιρία που του δίνεται για να αποδείξει ότι αξίζει μια θέση στους καλύτερους παίκτες μεσαίας λωρίδας στον κόσμο.</p>\n","hu_HU":"Yi Tang „Maple” Huang az egyik legsokoldalúbb középső ösvényes játékos. Az LMS régióban gyakorlatilag nincs kihívója, és a középső ösvényesekre leadott szavazatok 48,6%-át gyűjtötte be. Ez úgy érte el, hogy még tizenéves, és ígéretes karrier áll előtte a Flash Wolves tagjaként.</p>\n\nMaple a 2016-os világbajnokságon is megcsillogtatta nagy hősrepertoárját, és hat játékban hat különböző hőssel játszott. Sajnos nem sikerült következetesen nyerniük, és a Flash Wolves nem jutott tovább a csoportkörből. Ha esélyt kap rá, Maple örömmel veti bele magát a harcba a világ legjobb középső ösvényesei ellen.\n","it_IT":"Yi Tang \"Maple\" Huang è uno dei centrali più versatili attualmente in circolazione. Ha già dimostrato più volte di non avere rivali nella LMS, dove ha conquistato il 48,6% dei voti per la sua categoria. La cosa che più colpisce di lui è però la sua giovane età e il brillante futuro che lo attende assieme ai Flash Wolves.</p>\n\nMaple ha dato prova della sua grande abilità con numerosi campioni durante i Mondiali 2016 giocando 6 incontri con 6 personaggi diversi. Purtroppo non è riuscito a ottenere un successo costante, e i Flash Wolves hanno dovuto abbandonare il torneo durante la fase a gironi. Maple sfrutterà sicuramente questa seconda opportunità per portare scompiglio tra i migliori centrali del mondo.\n","ro_RO":"Yi Tang ''Maple'' Huang este unul dintre cei mai adaptabili jucători de pe culoarul din mijloc. A dovedit deja că practic nimeni nu se poate pune cu el în regiunea LMS, unde a obținut 48,6 la sută din voturile pentru culoarul din mijloc. Și mai impresionat, Maple e încă adolescent, așa că probabil că are un viitor promițător alături de Flash Wolves.\n</p>\nA demonstrat la Campionatul Mondial 2016 că poate juca cu un număr mare de campioni, făcând șase alegeri diferite în șase meciuri. Din păcate, nu a avut mereu succes, iar Flash Wolves nu a reușit să treacă de faza grupelor. Acum că a primit o nouă șansă, cu siguranță că va profita de ea și va dezlănțui haosul împotriva celor mai buni jucători din lume de pe culoarul din mijloc.\n","es_MX":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>"},"foreignIds":{"drupalId":"674","TRLH3":"1001360063","TRLH4":"1001310063","TRTW":"200000014","TRLT3":"200000254","TRLH1":"200000436","TRLH2":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":617,"slug":"swordart","name":"SwordArT","firstName":"Shou-Chieh","lastName":"Hu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swordart-23wa49d3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:28:19.000Z","bios":{"en_US":"<p>Behind every great marksman is a great support. Chieh “SwordArT” Hu a perfect example of that. The LMS veteran excels on champions that can peel, zone and protect for his rookie ADC in the bot lane. He’s played a key role in all of the Flash Wolves’ upset victories over SK telecom T1, providing the vision and crowd control his team needs to win.</p> <p>He’s already established himself as the best support in the LMS, leading his role during the regular season with a ridiculous 12.0 KDA. While Maple and Karsa get the acclaim for their big plays, SwordArT is the guy behind the scenes making it all happen. The calm, cool, and collected shotcaller of the team, SwordArT can be found where the action is hottest, directing his teammates and keeping them alive.</p>","fr_FR":"Derrière chaque grand tireur se cache un grand support. Chieh « SwordArT » Hu illustre parfaitement cette maxime. Ce vétéran des LMS excelle avec les champions qui lui permettent de contrôler l'espace et de protéger son jeune ADC sur la voie du bas. Il a joué un rôle clé dans les victoires surprises des Flash Wolves face à SK Telecom T1, apportant la vision du jeu et les capacités de contrôle de foule dont son équipe avait besoin pour gagner.\n\nIl s'est illustré en devenant le meilleur support des LMS lors de la saison régulière, grâce à un KDA effarant de 12,0. Maple et Karsa sont acclamés pour leurs actions spectaculaires, mais SwordArT est bel et bien l'homme de l'ombre qui rend tout ceci possible. Décideur calme et posé au sein de l'équipe, SwordArT se trouve là où l'action est la plus débridée, dirigeant ses équipiers et les gardant en vie.\n","pl_PL":"Za każdym świetnym strzelcem stoi świetny wspierający. Chieh „SwordArt” Hu jest tego idealnym przykładem. Ten weteran LMS najlepiej gra bohaterami, którzy potrafią eskortować, utrudniać dostęp wrogom i chronić jego debiutującego prowadzącego na dolnej alei. Odegrał kluczową rolę we wszystkich niesamowitych zwycięstwach Flash Wolves z SK Telecom T1, zapewniając wizję i kontrolę tłumu, których drużyna potrzebuje, by wygrywać.\n\nJuż pokazał, że jest najlepszym wsparciem w LMS, osiągając szczyt w swojej roli podczas sezonu zasadniczego z nieprawdopodobnym wynikiem 12,0 Z/Z/A. Podczas gdy Maple i Karsa zachwycają swoimi wspaniałymi zagrywkami, SwordArT to gość, który stoi za kulisami i sprawia, że kolegom udaje się osiągnąć wszystko, co zamierzyli. Spokojnego i opanowanego lidera drużyny, jakim jest SwordArT, można znaleźć wszędzie tam, gdzie toczy się najgorętsza akcja. Stamtąd kieruje kolegami i utrzymuje ich przy życiu.\n","de_DE":"Hinter jedem großen Schützen steht ein großer Supporter. Und Chieh „SwordArT“ Hu ist ein perfektes Beispiel dafür. Der Veteran der LMS zeichnet sich vor allem mit Champions aus, mit denen er die Gegner abdrängen und seinen AD-Carry beschützen kann. Er spielte bei den Siegen der Flash Wolves gegen SK Telecom T1 eine entscheidende Rolle, weil er für die notwendige Sicht sorgte und seine Gegner mit Effekten zur Massenkontrolle unschädlich machte.\n\nMit einer unglaublichen TTU von 12,0 in der regulären Saison hat er bereits bewiesen, dass er der beste Supporter der LMS ist. Während Maple und Karsa für ihre „Big Plays“ bejubelt werden, ist SwordArT der Mann im Hintergrund, der all das überhaupt erst möglich macht. SwordArT ist der ruhige, gelassene und gefasste Spielführer der Mannschaft, der immer dort ist, wo es am heißesten wird, um seinen Teamkameraden die Richtung vorzugeben und sie am Leben zu halten.\n","es_ES":"Detrás de todo buen tirador, hay un buen apoyo. Chieh ''SwordArt'' Hu es un perfecto ejemplo de eso. El veterano de la LMS destaca con campeones que pueden defender, aislar y proteger a su ADC novato en la calle inferior. Ha jugado un papel clave en todas las victorias inesperadas de Flash Wolves contra SK telecom T1, pues ha facilitado la visión y el control de adversario que su equipo necesitaba para ganar.\n\nSe ha consolidado como el mejor apoyo de la LMS, destacando durante la temporada regular con un apabullante A/M/A de 12 puntos. Maple y Karsa serán los que se lleven los vítores por las grandes jugadas, pero SwordArT será quien las haga posibles entre bambalinas. El calmado líder del equipo, SwordArT, siempre se encontrará donde esté la acción, dirigiendo a sus compañeros y manteniéndolos con vida.\n","pt_BR":"<p>Atrás de todo ótimo carregador há um ótimo suporte. Chieh \"SwordArT\" Hu é um exemplo perfeito disso. O veterano da LMS manda bem com Campeões que podem iniciar, zonear e proteger o seu carregador novato na rota inferior. Ele teve um papel essencial em todas as vitórias da Flash Wolves sobre a SK Telecom T1, dando a visão e o Controle de Grupo que sua equipe precisou para vencer.</p> <p>Ele já se estabeleceu como o melhor suporte da LMS, liderando sua função durante a temporada regular com uma AMA absurdo de 12,0. Apesar de Maple e Karsa levarem todo o crédito pelas grandes jogadas, SwordArT é o cara que torna tudo isso possível. O calmo e tranquilo tomador de decisões da equipe pode ser encontrado sempre onde a ação estiver bombando, guiando seus companheiros e mantendo-os vivos. </p>","es_AR":"<p>Tras cada tirador agresivo hay un hábil soporte, un dicho que se ha confirmado en la carrera de Hu \"SwordArT\" Shou-Chieh. A SwordArT se lo considera un soporte mecánico increíblemente fuerte que lucha usando un campeón que pueda impedir acciones del enemigo, cubrir zonas y proteger (habilidades útiles cuando se está en un carril con NL). Si bien sus compañeros de equipo le recriminan algún combo ocasional fallido o Pulverizar de Alistar que solo golpea el aire, siempre busca proteger y defender a su equipo, símbolo de una verdadera leyenda de soporte.</p>\n\n<p>Buscará ser considerado como uno de los mejores soportes del mundo en Shanghai. Mientras Maple y Karsa reciben la atención por sus grandes actuaciones, SwordArT es quien se queda en segundo plano y hace que todo funcione. SwordArT, el tranquilo, relajado y sereno tirador del equipo, puede encontrarse donde la acción es más intensa, dirigiendo a sus compañeros y manteniéndolos con vida.</p>"},"foreignIds":{"drupalId":"676","TRLH3":"1001160054","TRLH4":"1001160054","TWTW":"135240","TRTW":"200000109","TRLT3":"200000256","TRLH1":"200000438","TRLH2":"200000338"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":631,"slug":"karsa","name":"Karsa","firstName":"Hao-Xuan","lastName":"Hong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/karsa-4n8bncs5.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:35:08.000Z","bios":{"en_US":"<p>Hao-Xuan “Karsa” Hong is the epitome of a “carry” jungler. Nothing strikes fear in Flash Wolves’ opponents as much as when Karsa locks in a Lee Sin or Graves pick for an important match. His legion of fans wouldn’t have it any other way.</p>\n\n<p>Karsa and the Flash Wolves impressed at Worlds last year by taking a game off soon-to-be champs SK telecom T1 in the group stage. The victory continued a trend for the Flash Wolves, who have built a name for themselves by upsetting SKT at international events.</p>","fr_FR":"Hao-Xuan « Karsa » Hong est la quintessence même d'un jungler « carry ». Rien ne fait plus peur aux adversaires des Flash Wolves que de voir Karsa choisir Lee Sin ou Graves pour un match important. Et ce n'est pas sa légion de fans qui nous contredira.\n\nKarsa et les Flash Wolves ont fait grande impression au Mondial l'an dernier en infligeant une défaite aux futurs champions de SK Telecom T1 lors de la phase de groupe. La chance a continué de sourire aux Flash Wolves qui se sont faits un nom en triomphant de SKT lors d'événements internationaux. Karsa va maintenant apporter son style de jeu spectaculaire et riche en ganks au Brésil, où il tentera de répéter son exploit contre les champions du monde.\n","pl_PL":"Hao-Xuan „Karsa” Hong to uosobienie „prowadzącego” dżunglera. Nikt nie budzi takiego lęku u przeciwników Flash Wolves, jak Karsa wybierający Lee Sina lub Gravesa w ważnym meczu. Legiony jego fanów uważają, że dzieje się tak nie bez powodu.\n\nKarsa i Flash Wolves zaimponowali na zeszłorocznych Mistrzostwach, wygrywając grę z SK Telecom T1 (przyszłymi mistrzami) w fazie grupowej. Zwycięstwo stanowiło kontynuację tradycji Flash Wolves, którzy zasłynęli drażnieniem SKT na imprezach międzynarodowych. Teraz Karsa pokaże swój oparty na gankowaniu, błyskotliwy styl gry w Brazylii, gdzie zamierza kolejny raz dogryźć mistrzom świata.\n","de_DE":"Hao-Xuan „Karsa“ Hong ist der Inbegriff eines „Carry“-Junglers. Nichts jagt den Gegnern der Flash Wolves mehr Angst ein als Karsa, wenn er in einem wichtigen Spiel Lee Sin oder Graves auswählt. Und genau das wollen seine zahlreichen Fans sehen.\n\nKarsa und die Flash Wolves haben bei der WM im letzten Jahr beeindruckt, indem sie in der Gruppenphase ein Spiel gegen die zukünftigen Weltmeister SK Telecom T1 gewinnen konnten. Mit diesem Sieg konnten die Flash Wolves den Trend fortsetzen und SKT wieder bei einem internationalen Turnier überraschen. Jetzt reist Karsa mit seinem auf Ganks basierenden Spielstil nach Brasilien, wo er den Weltmeister erneut in die Knie zwingen will.\n","es_ES":"Hao-Xuan ''Karsa'' Hung es la personificación del jungla carry. Nada despierta más terror entre los oponentes de Flash Wolves que ver a Karsa seleccionar a Lee Sin o a Graves en una partida importante. Su legión de fans lo tiene claro.\n\nKarsa y Flash Wolves dejaron a la audiencia boquiabierta el año pasado tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK telecom T1. La victoria continuó la tradición de Flash Wolves, que se ha ganado la fama vencer inesperadamente a SKT en los eventos internacionales. Karsa ahora trasladará su llamativo estilo de juego basado en las emboscadas a Brasil, donde intentará vencer una vez más a los campeones del mundo.\n","pt_BR":"<p>Hao-Xuan \"Karsa\" Hong é um verdadeiro caçador \"carregador\". Nada causa tanto medo nos adversários da Flash Wolves como o Karsa de Lee Sin ou Graves em uma partida importante. Sua legião de fãs não aceitaria nada diferente.</p>\n\n<p>Karsa e a Flash Wolves impressionaram no Mundial do ano passado, conseguindo uma vitória contra a campeã SK Telecom T1 na Fase de Grupos. A vitória continuou um tema recorrente para a Flash Wolves, que fez seu nome vencendo a SKT em eventos internacionais. Karsa agora trará seu estilo de jogo exuberante e de fortes emboscadas para o Brasil, onde ele vai tentar dar outra mordida nos campeões mundiais.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hau-Hsuan \"Karsa\" Hung은 Flash Wolves 선수들 중에서 2013 월드 챔피언십에 Gamania Bears로 출전하지 않은 유일한 선수입니다. 하지만 팀에서 소외감을 느끼진 않죠. Karsa는 전 Gama Bears 정글러 Winds를 보며 정글 운영의 요령을 배웠습니다. 덕분에 정신적으로 그의 후임자가 된 동시에 팀에 자연스럽게 어울리게 됐죠. </p>\n<p style=”font-family:”나눔고딕”;\">Karsa는 현재 대만에서 가장 강력한 정글러 중 하나로 꼽힙니다. 2015 월드 챔피언십에서 킬 관여율 75%라는 엄청난 기록을 낸 걸 보면 알 수 있죠. Flash Wolves는 8강에서 멈춰야 했지만 여전히 LMS 지역의 자부심입니다. 믿겨지지 않는다면 그의 팬이 얼마나 많은지 확인해 보세요. Karsa는 Flash Wolves 선수들 중에서 팬클럽 규모가 가장 큽니다. Karsa에게 가면 다신 돌아올 수 없죠. 늑대 무리에 들어온 걸 환영합니다. </p>\n","es_AR":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>","cs_CZ":"<p>Hao Hsuan „Karsa“ Hung je učebnicovým příkladem „tahounského“ džunglera. Nic nenažene soupeřům Flash Wolves takový strach, jako když si Karsa při důležitém utkání vybere Lee Sina nebo Gravese. Zástupy jeho fanoušků jsou ovšem spokojeny – důkazem je, že obdržel 49 % hlasů pro džunglera z LMS.</p>\n\n<p>Karsa a Flash Wolves podali na MS velice slušný výkon, za zmínku stojí především fakt, že ve skupině porazili budoucí šampiony z SK Telecom T1. Tato výhra byla pokračováním zavedeného trendu, Flash Wolves se totiž proslavili tím, jak na mezinárodních turnajích s oblibou šlapou SKT na kuří oko. Karsův efektní herní styl plný přepadů bude na All-Star 2016 jistě vzbuzovat pozornost, tento turnaj je totiž jako stvořený pro mladé kreativní hráče typu tohoto hvězdného džunglera z Flash Wolves.</p>","el_GR":"<p>Ο Hao Hsuan “Karsa” Hung είναι η επιτομή του παίκτη ζούγκλας τύπου carry. Όταν ο Karsa καταφέρνει να πάρει τον Λι Σιν ή τον Γκρέιβς σε έναν σημαντικό αγώνα, προκαλεί τον τρόμο σε όλους τους αντιπάλους των Flash Wolves. Οι στρατιές των οπαδών του θέλουν να τον δουν να κάνει αυτό που ξέρει καλύτερα, για αυτό του έδωσαν το 49% των ψήφων του LMS για τη θέση της ζούγκλας.</p>\n\n<p>Ο Karsa και οι Flash Wolves έκαναν αίσθηση φέτος στο Παγκόσμιο Πρωτάθλημα όταν κατάφεραν να πάρουν ένα παιχνίδι από τους αδιαμφισβήτητους πρωταθλητές SK Telecom T1 στη φάση ομίλων. Η νίκη αυτή συνέχισε την παράδοση των Flash Wolves, οι οποίοι καταφέρνουν να νικούν τους SKT σχεδόν σε κάθε διεθνές τουρνουά. Ο Karsa έχει ένα θεαματικό στυλ παιχνιδιού με έμφαση στον αιφνιδιασμό, το οποίο σίγουρα θα προκαλέσει αίσθηση στο Τουρνουά All-Star 2016, μια διοργάνωση που συνήθως αναδεικνύει νεαρούς οργανωτές, όπως ο διάσημος παίκτης ζούγκλας των Flash Wolves.</p>\n","hu_HU":"Hao Hsuan „Karsa” Hung egy igazi „lövész” dzsungelharcos. A Flash Wolves ellenfelei joggal félhetnek, ha Karsa megszerzi Lee Sint vagy Gravest egy fontos meccsen. A rajongói is szeretnék újra látni őt, mivel az LMS dzsungelharcos-szavazásában 49%-nyi szavazatot söpört be.</p>\n\nKarsa és a Flash Wolves a vb-n játékot tudott nyerni a későbbi bajnok SK Telecom T1 ellen a csoportkörben. A győzelemmel a Flash Wolves tovább építette a hírnevét, és rendszeresen odaszúrnak az SKT-nek a nemzetközi versenyeken. Karsa szereti a rajtaütéseket és a látványos akciókat, amit a 2016-os All-Star gála közönsége is imádni fog, hiszen a versenyt gyakorlatilag a Flash Wolves dzsungelharcos sztárjához hasonló fiatal tehetségeknek találták ki.\n","it_IT":"Hao Hsuan \"Karsa\" Hung è l'incarnazione del perfetto \"carry\" da giungla. Nulla instilla più paura negli avversari dei Flash Wolves di quando Karsa sceglie Lee Sin o Graves durante un incontro importante. Le sue legioni di fan non hanno dubbi su di lui, come testimoniato dal 49% di voti ottenuti nella categoria Giungla della LMS.</p>\n\nKarsa e i Flash Wolves hanno mostrato grandi numeri ai Mondiali di quest'anno, vincendo una partita nei gironi contro coloro che poi si sarebbero confermati campioni del mondo, gli SK Telecom T1. Questa vittoria rappresenta quasi una consuetudine per i Flash Wolves, che sono ormai noti per essere una spina nel fianco degli SKT negli eventi internazionali. Lo stile vistoso e fortemente basato su assalti di Karsa terrà di sicuro molti occhi incollati agli schermi durante l'All-Star 2016, un evento che molti considerano fatto su misura per giovani registi come la star della giungla dei Flash Wolves.\n","ro_RO":"Hao Hsuan ''Karsa'' Hung este întruchiparea unui jungler ''carry''. Adversarii celor de la Flash Wolves au de ce să se teamă când Karsa îl alege pe Lee Sin sau pe Graves într-un meci important. Numeroșii săi fani n-au vrut nici ei să-l lase la greu și l-au onorat cu 49 la sută din voturile pentru junglerul LMS.\n</p>\nKarsa și Flash Wolves au impresionat la Mondialele din acest an, câștigând un meci în faza grupelor împotriva viitorilor campioni, SK Telecom T1. Victoria a continuat tendința deja renumită a echipei de a-i surprinde în mod neplăcut pe cei din SKT la evenimente internaționale. Stilul de joc bazat pe gank-uri al lui Karsa va atrage cu siguranță multe priviri la All-Star 2016, un eveniment care pare parcă făcut special pentru playmakeri tineri precum junglerul extraordinar din Flash Wolves.\n","es_MX":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>"},"foreignIds":{"drupalId":"3721","TRLH3":"1001360062","TRLH4":"1001310062","TRLH1":"200000435","TRLH2":"200000335","TRTW":"200000013","TRLT3":"200000253"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":633,"slug":"mmd","name":"MMD","firstName":"Li-Hong","lastName":"Yu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mmd-hhy6fhit.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:37:03.000Z","bios":{"en_US":"<p>\nA one-time sub who stood behind Steak, Li-Hong “MMD” Yu has now built a name for himself as the Flash Wolves' top laner. MMD is known for his aggression and carry style, and his mechanics are top tier. However, he’s perfectly happy to switch to supportive tank picks and funnel resources towards the rest of his team. His Equalizers were on point as Rumble in the LMS Finals, which helped his team pick up the 3-1 victory over ahq e-Sports Club.\n</p>","es_AR":"<p>Yu \"MMD\" Li-Hung, que alguna vez fue espectador de la escena competitiva, es ahora el carrilero superior inicial de FW, su miembro más reciente y una pieza esencial de su éxito. MMD fue famoso anteriormente por sus juegos como acarreador y por su agresividad, siendo aún una clara mejora mecánica sobre su predecesor. En el meta actual, está feliz de cambiar al enfoque de tanque de soporte que actualmente lucha como Ekko y canaliza recursos para los acarreadores de su equipo. A pesar de que desempeña un papel de soporte, tiene lo suyo: su Poppy 6/1/11 contra AHQ en la Final del LMS de primavera es prueba de que es capaz de ir al frente y hacer el trabajo en la primera línea. Con Steak aún en la mayoría de los simpatizantes, MMD buscará su lugar frente al mundo en el Campeonato Mundial 2016.</p>","fr_FR":"Suite à son expérience de remplaçant pour Steak, Li-Hong « MMD » Yu s'est fait un nom en tant que toplaner des Flash Wolves. MMD est connu pour son agressivité et son style de carry, ainsi que pour ses mécaniques de premier ordre. Cependant, il est heureux d'incarner des supports tankys et de canaliser les ressources vers le reste de son équipe. Les Éradications de son Rumble ont fait des miracles lors de la finale des LMS et ont permis à son équipe de remporter une victoire à 3-1 contre ahq e-Sports Club. Il s'apprête maintenant à participer au Mid-Season Invitational 2017 pour avoir une nouvelle chance de vaincre SK Telecom T1.","es_ES":"El que fuera suplente de Steak, Li-Hong ''MMD'' Yu, ahora se ha forjado una reputación como top de Flash Wolves. MMD es famoso por su agresividad y liderazgo, y sus mecánicas son del más alto nivel. No obstante, está encantado de pasar a usar tanques de apoyo y concentrar todos sus recursos en ayudar a su equipo. En la final de la LMS consiguió usar justo a tiempo los Equilibradores de Rumble, lo que ayudó a que su equipo consiguiese una victoria 3-1 contra ahq e-Sports Club. Ahora se dirige al Mid-Season Invitational 2017 para enfrentarse una vez más a SK telecom T1","de_DE":"Der ehemalige Ersatzspieler für Steak, Li-Hong “MMD” Yu, konnte sich im Laufe der Zeit als Top-Laner der Flash Wolves einen Namen machen. MMD ist für seinen aggressiven Carry-Stil und seine überragenden Spielmechaniken bekannt. Er hat jedoch auch kein Problem damit, unterstützende Tanks zu spielen und dem Rest seiner Mannschaft Ressourcen zukommen zu lassen. Beim 3–1 Sieg über ahq e-Sports Club im Finale der LMS brachte er seine Gegner mit Rumbles Einebner zur Verzweiflung. Jetzt ist er zum Mid-Season Invitational 2017 unterwegs, wo er wieder versuchen wird, SK Telecom T1 zu Fall zu bringen.","pl_PL":"Jednorazowy zastępca Steaka, Li-Hong „MMD” Yu zdobył sobie rozgłos jako górny Flash Wolves. MMD jest znany ze swojej agresji i stylu prowadzenia, a jego umiejętności mechaniczne są najwyższej klasy. Potrafi też bez żadnych problemów zmienić rolę na wspierającego obrońcę, aby uzupełniać zasoby pozostałych członków drużyny. Doskonale wykorzystał Wyrównywacze Rumble’a w finale LMS, co pomogło drużynie osiągnąć zwycięstwo 3−1 z ahq e-Sports Club. Teraz zmierza na Mid-Season Invitational 2017, by jeszcze raz spróbować pobić SK Telecom T1.","pt_BR":"<p>O antes reserva de Steak, Li-Hong \"MMD\" Yu, agora deixou seu nome famoso como jogador da rota superior da Flash Wolves. MMD é conhecido pelo seu estilo agressivo e carregador, e por suas mecânicas de primeira. No entanto, ele ficou feliz de trocar para escolhas de tanques suportes e canalizar recursos para o resto de sua equipe. Seus Equalizadores estavam perfeitos como Rumble na final da LMS, quando ele ajudou a equipe a conquistar uma vitória de 3-1 sobre a ahq e-Sports Club. Agora ele vai para o Mid-Season Invitational 2017 para conseguir revanche contra a SK Telecom T1.</p>"},"foreignIds":{"drupalId":"3720","TRTW":"200000150","TRLT3":"200000252","TRLH1":"200000434","TRLH2":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1646,"slug":"betty","name":"Betty","firstName":"Yu-Hung","lastName":"Lu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betty-i225lkpn.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-01-09T22:47:23.000Z","updatedAt":"2017-07-06T14:28:07.000Z","bios":{"en_US":"<p>Yu-Hung \"Betty\" Lu is the standout rookie AD carry for the Flash Wolves. He joined the squad late last year, replacing former starter NL. Formerly known as \"DoubleRed,\" he made his debut at IEM Oakland and later picked up his first trophy at the IEM World Championship in Katowice. He continued to impress in the 2017 LMS Spring Split, leading all AD carries with an 8.8 KDA. He excelled on Ashe and Varus, going 16-0 combined on those two champions.</p>","pl_PL":"Yu-Hung „Betty” Lu jest wyróżniającym się debiutantem w roli prowadzącego Flash Wolves. Dołączył do drużyny pod koniec zeszłego roku, zastępując wcześniejszego zawodnika pierwszego składu, NL-a. Znany dawniej jako „DoubleRed” debiutował na IEM Oakland, a później zdobył swoje pierwsze trofeum na Mistrzostwach Świata IEM w Katowicach. \n\nNie przestawał imponować podczas splitu wiosennegoLMS 2017, stając się liderem wszystkich prowadzących z 8,8 Z/Z/A. Błyszczał, grając Ashe i Varusem, i w efekcie zdobył z tą dwójką bohaterów łączny wynik 16−0. Teraz jego determinacja zostanie przetestowana podczas Mid-Season Invitational 2017, na którym zmierzy się z kilkoma najlepszymi dolnymi, jakich zna świat.\n","fr_FR":"Yu-Hung « Betty » Lu est le jeune carry AD prodige des Flash Wolves. Il a rejoint la formation l'année dernière, remplaçant NL. Anciennement connu sous le pseudo « DoubleRed » Betty a fait ses débuts aux IEM d'Oakland et a, par la suite, remporté son premier trophée lors des IEM World Championship de Katowice. \n\nIl a fait forte impression lors du segment de printemps 2017 de la région LMS, dominant tous les carrys AD avec un KDA de 8,8. Lors du championnat, il a fait des merveilles avec Ashe et Varus en réalisant une série de victoires combinées de 16-0 avec ces deux personnages. Sa résolution sera mise à l'épreuve lors du Mid-Season Invitational 2017, où il affrontera certains des meilleurs spécialistes au monde de la voie du bas.\n","es_ES":"Yu-Hung ''Betty'' Lu es el prodigioso novato ADC de Flash Wolves. Se unió al grupo al final del año pasado, para reemplazar al titular NL. Conocido anteriormente como ''DoubleRed'', hizo su debut en el IEM Oakland y no tardaría en conseguir su primer trofeo en el IEM World Championship de Katowice. \n\nSiguió sorprendiendo al público en el split de primavera de la LMS 2017, donde superó a todos los carries con un A/M/A de 8,8 puntos. Destacó con campeones como Ashe y Varus, con los que consiguió quedar 16-0. Ahora tendrá que demostrar su determinación en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores dúos de bot del mundo.\n","de_DE":"Yu-Hung „Betty“ Lu ist der AD-Carry der Flash Wolves und ein herausragender Nachwuchsspieler. Er stieß Ende des letzten Jahres als Ersatz für NL zur Mannschaft. Betty, früher bekannt als „DoubleRed“, gab sein Debüt beim IEM Oakland und gewann seinen ersten Titel bei der IEM-Weltmeisterschaft in Katowice. \n\nEr konnte auch im Frühjahrs-Split der LMS 2017 beeindrucken, wo er mit einer TTU von 8,8 der beste AD-Carry war. Dabei lieferte er vor allem mit Ashe und Varus überragende Leistungen ab, mit denen er zusammen 16 Spiele gewinnen konnte. Beim Mid-Season Invitational 2017 wird er seine Entschlossenheit unter Beweis stellen müssen, wenn er es auf der unteren Lane mit einigen der besten Duos der Welt zu tun bekommt.\n","pt_BR":"<p>Yu-Hung \"Betty\" Lu é o carregador novato de destaque da Flash Wolves. Ele entrou na equipe no final do ano passado, substituindo o antigo titular NL. Anteriormente era conhecido como \"DoubleRed\" e seu debut foi na IEM Oakland. Mais tarde, ele pegou seu primeiro troféu no Campeonato Mundial IEM, em Katowice. </p>\n\n<p>Ele continuou a impressionar na Etapa de Primavera LMS 2017, liderando todos os carregadores com uma AMA de 8,8. Ele foi excelente com a Ashe e o Varus, com 16-0 combinado na soma dos dois Campeões. Sua determinação será testada no Mid-Season Invitational 2017, onde ele enfrentará alguns dos melhores jogadores de rota inferior que o mundo tem a oferecer.</p>"},"foreignIds":{"TRTW":"200000015","TRLT3":"200000255","TRLH1":"200000437","TRLH2":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1849,"slug":"cyo","name":"Cyo","firstName":"Shi-Yo","lastName":"Lin","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-03-17T19:03:22.000Z","updatedAt":"2017-07-06T14:38:40.000Z","bios":{},"foreignIds":{"TRTW":"200000452","TRLT3":"200000204"},"socialNetworks":{},"champions":[],"liveGameTeam":91}],"scheduleItems":[{"id":"AVRUIAMPQMQFcjhwbQfG","content":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:match:640c038d-43c2-4a42-b945-7ba1f0d22121","scheduledTime":"2016-05-08T04:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb","blockLabel":"5","subBlockLabel":"Live Broadcast","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:bracket:3d469dc6-3409-4b0c-a4d4-201b1aa99a7a"},"match":"640c038d-43c2-4a42-b945-7ba1f0d22121","tournament":"69298c0c-16ae-490a-8e9c-cfe4620a6bfb","bracket":"3d469dc6-3409-4b0c-a4d4-201b1aa99a7a","league":"10"}],"gameIdMappings":[{"id":"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd","gameHash":"d2186ada50089391"}],"videos":[{"id":2723,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd","source":"https://www.youtube.com/embed/HdL6mZ8Xw3c","createdAt":"2016-05-08T05:42:21.000Z","updatedAt":"2016-05-08T05:42:21.000Z","game":"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd"},{"id":2726,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd","source":"https://www.youtube.com/embed/DImHo_-rPdw?wmode=transparent","createdAt":"2016-05-08T07:37:50.000Z","updatedAt":"2016-05-08T07:37:50.000Z","game":"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd"},{"id":2745,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd","source":"https://www.youtube.com/watch?v=kbsH7AIh6ZM","createdAt":"2016-05-09T21:27:30.000Z","updatedAt":"2016-05-09T21:27:30.000Z","game":"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd"}],"htmlBlocks":[],"match":{"id":"640c038d-43c2-4a42-b945-7ba1f0d22121","name":"FW-vs-CLG","position":14,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0d6a462a-7af1-41f1-9ad6-59151c35de6a"},{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],"games":{"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd":{"id":"d5dc2ea6-a2a6-4ffc-9d3a-289f82f6c7cd","name":"G1","generatedName":"CLG|FW|G1|640c038d43c24a42b945","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0d6a462a-7af1-41f1-9ad6-59151c35de6a"},{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"0d6a462a-7af1-41f1-9ad6-59151c35de6a"}]],"timestamp":1462685483699,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"50384","gameRealm":"TRLT3","platformId":"TRLT3:50384","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"0d6a462a-7af1-41f1-9ad6-59151c35de6a"}]],"timestamp":1462685483699,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"da4ffa8f-2beb-46e8-9a20-6c962685435c":1,"0d6a462a-7af1-41f1-9ad6-59151c35de6a":0}}}