{"teams":[{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]},{"id":228,"slug":"misfits","name":"Misfits","guid":"be7195b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/misfits-8fnvxt30.png","acronym":"MSF","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2016-06-03T15:47:57.000Z","updatedAt":"2017-06-07T08:47:16.000Z","bios":{"en_US":"<p>Misfits performed extremely well in the European Challenger circuit, amassing win after win on their way to punching their EU LCS tickets. After making it into the LCS, the team underwent some roster changes, adding PowerOfEvil, and the surprise signing of veteran KaKAO. The team spent time in Korea bootcamping in order to prepare themselves for the next level of competition. With a great mix of veteran leadership and fresh faces, Misfits has a chance to make an unexpected splash this season.</p>\n\n<p>Coach: Hussain Moosvi</p>\n<p> Team Manager: Andy \"CrazyCaps\" Walda</p>","de_DE":"<p>Die Misfits wurden aus der Asche der Renegade: Banditos geboren, nachdem deren Dachgesellschaft aus der LCS verbannt worden war. Die Einheit schlug sich in der europäischen Challenger Series extrem gut und gewann ein Spiel nach dem anderen, bevor sie endlich das Ticket für die EU LCS lösen konnte. Nachdem es die Mannschaft in die LCS geschafft hatte, veränderte sich ihre Aufstellung durch die Zugänge von PowerOfEvil und dem Veteranen KaKAO. Die Mannschaft verbrachte einige Zeit in Korea, um dort zu trainieren und sich auf die Konkurrenz vorzubereiten. Dank der großartigen Mischung aus erfahrenen Anführern und frischen Gesichtern könnten die Misfits diesen Frühling für die ein oder andere Überraschung sorgen.</p>\n<p>Coach: Hussain \"Hussain\" Moosvi</p>\n<p>Mannschaftsleiter: Andy \"CrazyCaps\" Walda</p>","es_ES":"<p>Misfits rindió extremadamente bien en el Challenger Series europeo al conseguir una victoria tras otra en su camino hasta la LCS EU. Después de llegar a la LCS, Misfits ha sufrido algunos cambios de plantel con la adquisición de PowerOfEvil y el sorprendente fichaje del veterano KaKAO. El equipo ha estado en Corea entrenando para prepararse para el siguiente nivel de la competición. Con una gran mezcla de liderazgo veterano y rostros nuevos, Misfits tiene la oportunidad de dejar huella de forma inesperada durante esta temporada.</p>\n\n<p>Entrenador principal: Hussain Moosvi</p>\n<p>Jefe de equipo: Andy \"CrazyCaps\" Walda</p>\n","fr_FR":"<p>Les Misfits ont enregistré d'excellentes performances dans le circuit Challenger européen, enchaînant les victoires et décrochant ainsi leur place aux LCS EU. Après sa sélection pour les LCS, l'équipe a procédé à quelques changements de formation, avec l'ajout de PowerOfEvil et l'arrivée surprise du vétéran KaKAO. L'équipe a passé du temps à s'entraîner en Corée afin de se préparer à un niveau de compétition supérieur. En mélangeant des leaders vétérans et de nouveaux visages, Misfits a une chance de faire un coup d'éclat inattendu cette saison.</p>\n\n<p>Entraîneur principal : Hussain Moosvi</p>\n<p>Responsable d'équipe : Andy « CrazyCaps » Walda</p>\n","pl_PL":"<p>Misfits spisali się naprawdę dobrze podczas europejskich rozgrywek serii Pretendenta, zdobywając jedno zwycięstwo po drugim i zapewniając sobie wstęp do EU LCS. Po dostaniu się do LCS drużyna przeszła kilka zmian składu, dodając PowerOfEvila i zaskakując wszystkich podpisaniem kontraktu z weteranem KaKAO. Drużyna spędziła nieco czasu na obozie treningowym w Korei, chcąc przygotować się do walki na nowym poziomie rywalizacji. Dzięki świetnemu połączeniu przywództwa weteranów i entuzjazmu świeżej krwi, Misfits mają szanse osiągnąć niespodziewany sukces podczas tego sezonu.</p>\n\n<p>Główny trener: Hussain Moosvi</p>\n<p>Menedżer drużyny: Andy „CrazyCaps” Walda</p>\n"},"foreignIds":{},"players":[87,243,357,392,628,1090,1334],"starters":[243,357,628,1090,1334],"subs":[87,392]}],"players":[{"id":87,"slug":"h1iva","name":"H1Iva","firstName":"Aleksi","lastName":"Kaikkonen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/h1iva-3d3cbqxm.png","hometown":null,"region":"Challenge France","birthdate":"1994-08-31","createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-05-27T01:11:02.000Z","bios":{"en_US":"","fr_FR":"<p> H1iva est un support de niveau Challenger. C'est un joueur qui connaît bien la scène professionnelle de League of Legends, après avoir joué dans les équipes Gamers 2 ou Renegades en Challenger Series. Pour cette saison 2016-2017, il rejoint l'équipe Millenium aux objectifs européens.\nSes exploits avec la Team Forge et Renegades ont permis au finlandais de se démarquer et d'acquérir une certaine renommée dans son pays d'origine. Très bon joueur de Tresh, il compte bien prouver à la communauté française qu'il saura être au niveau et mener ses coéquipiers vers la victoire. </p>","cs_CZ":""},"foreignIds":{"drupalId":"1496","TRLH3":"1000145041","TRLH4":"1000125041","FRA1TMNT1":"375321","TRNA1":"1000525385","TREU":"1000565129","FRA1TMNT2":"25245"},"socialNetworks":{"twitter":"https://twitter.com/HiivaLoL"},"champions":[],"liveGameTeam":228},{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":243,"slug":"powerofevil","name":"PowerOfEvil","firstName":"Tristan","lastName":"Schrage","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/powerofevil-dvzrzaxn.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T10:20:35.000Z","bios":{"en_US":"<p>Tristan “PowerOfEvil” Schrage has skill well beyond his years. PowerOfEvil is best known for his mechanical outplays, especially on Cassiopeia, Syndra, and Orianna. And if you don't know him for his mechanical ability, you probably know him for his bizarre champion picks in the mid lane -- we're looking at you, Smite Kayle... with Devourer. PowerOfEvil's success led him to a new team at the end of 2015 -- Origen.</p>\n\n<p>Even under the tutoring of 2016 All-Star mid laner xPeke, PowerOfEvil struggled to find his groove and eventually left Origen at the end of the year. He’s still brimming with untapped potential, and Misfits decided to pick him up in order to bolster their roster. A change of scenery may finally unlock all the talent that has only been seen in spurts since his move to Origen. The time has come for PowerOfEvil to show that his resilience has lead to growth. It’s now or never for the youngster and the stakes can’t get much higher.</p>","pl_PL":"<p>Tristan rozpoczął piąć się w górę w czwartym sezonie, kiedy zaczął być rozpoznawalny w społeczeństwie League of Legends jako naprawdę silny mid-laner. Co prawda grał w różnych drużynach, lecz skupiał się głównie na grze ESL Pro Series i Challenger Series. Jego celem było dostanie się do rozgrywek EU LCS. Ostatecznie dołączył do zespołu Unicorns Of Love, jednak po przegranej z Ninjas in Pyjamas opuścił go na miesiąc. Po tym meczu bardzo pozytywnie wypowiedział się o nim „Alex Ich”, weteran sceny esportowej, będący pod wrażeniem jego umiejętności na mid-lanie. Kiedy \"PowerOfEvil\" wrócił do różowej drużyny, ona w międzyczasie dostała się do turniej kwalifikacyjnego do wiosennego sezonu LCS 2015. To zmobilizowało go do poprawy swoich wyników. Pomimo przegranej z H2K, udało mu się dokonać zemsty na zespole NiP, wygrywając z nim. Dzięki temu zwycięstwu znalazł się w EU LCS 2015.</p>\n<p>\nKiedy \"PowerOfEvil\" znalazł się na profesjonalnej scenie, miał okazję zademonstrować publice swoje najsilniejsze strony. Poprowadził Unicorns Of Love do wielu zwycięstw w wiosennym sezonie 2015, bezlitośnie niszcząc przeciwników Syndrą i Cassiopeią – jednymi ze swoich ulubionych bohaterów. Jego zdolność do zdobywania przewagi samemu, bez dużej pomocy drużyny, sprawiła, że miał też dużą swobodę np. w wyborze postaci. Dzięki dominującej postawie Tristana UOL skończył ten okres na piątym miejscu, czyli naprawdę przyzwoicie. On sam dwukrotnie został wytypowany MVP tygodnia w tym semestrze LCS. Z kolei w letnim sezonie 2015 \"PowerOfEvil\" pokazał jak bardzo niebezpieczny jest grając Orianną i Kog’mawem. Tym razem udało mu się wnieść swoją różową drużynę aż na czwarte miejsce w tym okresie, co jak na gracza, który dopiero w tym roku znalazł się w EU LCS, było niezwykłym osiągnięciem.</p>\n<p>\nNa początku sezonu 6, 13 listopada 2015, Tristan dołączył do zespołu Origen jako szósty zawodnik. Został uznany za tak dobrego mid-lanera, że został z otwartym ramionami przyjęty do drużyny, która dotarła aż do półfinału na ostatnich Mistrzostwach Świata. Swoje członkostwo w nowej organizacji zaczął od sukcesów – wraz z nią wygrał trzecią część 10 sezonu IEM w San Jose. Pokonał tam doświadczone amerykańskie zespoły Team SoloMid i Counter Logic Gaming, nie przegrywając ani jednej gry. To jego pierwsze i prawdopodobnie nie ostatnie tak zdecydowanie zwycięstwo.</p>\n<p>\nPoza mid-lanem PowerOfEvil\" lubi też grać na top-lanie i jako support, lecz zapowiedział już, że na pewno nie zmieni swojej roli. Tak samo jak swojego pseudonimu, którego używał w innych grach przed swoją karierą świecie Runeterry. Jest dumny ze swojej odporności na porażki i panowania nad własnymi emocjami. Na co dzień \" Tristan jest chłopakiem z Bad Soden, w Niemczech, który niegdyś marzył o zostaniu pilotem i lataniu po całym świecie. Zamiast tego, starszy brat zachęcił go do gry w League of Legends, więc realizuje swoje marzenia latając na i wygrywając turnieje. Poza grą na komputerze lubi grać w tenisa i piłkę nożną z przyjaciółmi. Ma szczęście posiadając rodziców, którzy pomimo tego, że woleliby żeby skończył szkołę, wspierają go i pomagają osiągnąć jego cele. </p>\n","es_ES":"<p>Integrante de una familia de ávidos jugones, no es de extrañar que Tristan ‘PowerOfEvil’ Schrage tenga un instinto natural para los videojuegos. Su hermano siguió la estela de su padre, que desde pequeño le introdujo al mundillo ya que acudía a concentraciones de jugadores, y se convirtió en su mentor tras enseñarle el universo de Runaterra.</p>\n\n<p>El alumno, que ocupó la calle central al ser el único rol disponible entre sus amigos, no tardó mucho en superar al maestro. Aunque ambos escalaron posiciones en el ránking hasta alcanzar el rango Aspirante y se iniciaron juntos en el ámbito competitivo con Team Mistral, Gunnar Schrage decidió centrarse en sus estudios. Por contrapartida, PowerOfEvil persiguió la carrera del jugador profesional.</p>\n\n<p>El alemán se unió a EYES ON U, una modesta entidad cuya división europea compitió en la Challenger Series durante la primera mitad de la edición primaveral. Descontento con los mediocres resultados del equipo, que no alcanzó los Playoffs, PowerOfEvil pasó a jugar en dos escuadras al mismo tiempo: por un lado participaba en la ESL Pro Series con Planetkey Dynamics; por otro, ingresó en las filas de Unicorns of Love para volver a competir en la Challenger Series.</p>\n\n<p>Aunque esta vez sí alcanzó la fase eliminatoria, la derrota contra Ninjas in Pyjamas en los cuartos de final le hizo abandonar a los equinos. Para cuando decidió volver a Unicorns of Love, el equipo había logrado la clasificación para los Playoffs de verano. Esta vez galoparon por encima de los ninjas suecos, que les habían derrotado en dos ediciones consecutivas, y consiguieron el pase al Torneo de Promoción.</p>\n\n<p>Aquella eliminatoria contra Millenium supuso la eclosión de Unicorns of Love, que se metió al público en el bolsillo con una quinta partida épica en la que PowerOfEvil destruyó el nexo de los franceses con los últimos puntos de vida que le quedaban a su emblemática Cassiopeia. Sin embargo, fue la primera Intel Extreme Masters celebrada en San José la que catapultó definitivamente a PowerOfEvil al estrellato.</p>\n\n<p>Unicorns of Love acudió al evento gracias a la votación en masa de sus nuevos seguidores, pero aun así llegaba como tapado. Puede que por esta razón el cuerpo técnico de Team SoloMid pasara por alto a Syndra en la fase de selección de campeones, algo que el alemán aprovechó para destrozar a Søren ‘Bjergsen’ Bjerg. Los unicornios no se llevaron el trofeo a casa, pero el joven que quería ser piloto voló de vuelta a casa con una legión de aficionados a sus espaldas.</p>\n\n<p>Ya en la LCS, PowerOfEvil se consolidó como la mayor amenaza de Unicorns of Love, que hizo historia al ganar en los Playoffs al primer clasificado de la fase regular, SK Gaming, gracias a un crucial robo de Barón del mid con Orianna. En la final contra Fnatic sorprendió con Varus, una de sus innovadoras aportaciones al metajuego, pero no fue suficiente para llevarse la corona. Durante el split de verano de la LCS EU 2015, PowerOfEvil continuó siendo el motor de los suyos con campeones relevantes en fases tardías de la partida, como Kog’Maw u Orianna.</p>\n\n<p>Aunque los unicornios no emularon su exitoso paso por los Playoffs, el buen rendimiento del alemán captó la atención de Origen, el equipo que le privó de participar en el Campeonato Mundial 2015. Con sus nuevos compañeros regresó a San José para, esta vez sí, conquistar el campeonato como reemplazo de Enrique ‘xPeke’ Cedeño, uno de los jugadores a los que admira y con el que compartirá el puesto en 2016.</p>","fr_FR":"<p>Le jeune espoir Tristan « PowerOfEvil » Schrage est la première recrue d’Origen depuis la création de la structure. En 2014, le mid laner participe aux Challengers series mais son équipe ne signe pas une grande prestation. Plus tard, il rejoint la formation avec laquelle il se fera connaître : Unicorns of Love. Malgré des résultats discutables, UoL parvient à se qualifier sur le fil pour les play-offs des Challenger series. C’est à ce moment-là que le vent tourne. Plus motivé que jamais, UoL et celui qui se fait surnommer PoE réussissent à obtenir la 3e place en écrasant une équipe Ninjas in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et Aleš « Freeze » Kněžínek, ne cédant que face aux H2k de Fabian « Febiven » Diepstraten.\n\n<p>PowerOfEvil doit alors remporter un match en trois manches gagnantes s’il veut accéder aux League of Legends Championship Series. La victoire semble compromise puisque Millenium, l’équipe adverse, s’offre trois balles de match après avoir remporté les deux premières parties. Mais à ce moment-là, UoL décide de sortir sa botte secrète, Poppy top, et réussit l’impensable, se qualifiant de justesse au segment de printemps 2015.\n\n<p>Devant cette remontée fantastique, un style de jeu osé, des champions atypiques et un nom d’équipe attachant, les invocateurs décident de voter à 48% pour Unicorns of Love afin qu’ils participent aux Intel Extreme Masters San Jose. PowerOfEvil et ses coéquipiers font honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, PoE signe un tournoi exemplaire en se faisant particulièrement remarquer avec LeBlanc et Syndra.\n\n<p>En LCS, le mid laner impressionne encore et obtient le titre de meilleur joueur de la semaine à deux reprises. Il hisse son équipe à la très correcte 5e place de la saison régulière et arrive aux play-offs en tant qu’outsider, mais lui et son équipe démontrent très vite qu’ils sont déterminés en éliminant Gambit Gaming sans trembler. PowerOfEvil ne s’arrête pas en si bon chemin et s’impose face au premier de la saison régulière, SK Gaming, avant de donner du fil à retordre à Fnatic en finale.\n\n<p>Plus qu’un bon joueur, PowerOfEvil aime l’innovation et n’hésite pas à sortir des sentiers battus. Lors du segment de printemps, il joue Orianna avec Châtiment pour s’équiper de l’enchantement Glaive Runique et réussit un quintuplé. Cependant, ses expériences ne sont pas toujours un succès, en témoigne sa Kayle équipée d’un enchantement Dévoreur. Pendant le segment d’été, Unicorns of Love réitère une bonne performance mais échoue à obtenir la troisième place de play-offs. UoL se fait ensuite balayer par Origen et perd toute chance d’accéder au mondial 2015.\n\n<p>Fin novembre, lors des IEM San Jose, PowerOfEvil dispute ses premières rencontres au sein d’Origen, sa nouvelle équipe. Aux commandes de champions qu’il connaît bien, l’Allemand permet à sa nouvelle équipe d’éliminer TSM puis de remporter la finale face à Counter Logic Gaming, sans encaisser la moindre défaite et en montrant un niveau de jeu très convaincant. Ce début est de bonne augure et PoE devrait profiter de l’expérience de Enrique « xPeke » Cedeño-Martinez pour atteindre son plein potentiel cette année.\n","de_DE":"<p>Tristan „PowerOfEvil“ Schrage ist in seinen jungen Jahren bereits extrem talentiert. PowerOfEvil ist vor allem dafür bekannt, seine Gegner mit Cassiopeia, Syndra und Orianna in Sachen Spielmechanik zu übertreffen. Und wer ihn nicht deshalb kennt, kennt ihn wahrscheinlich aufgrund seiner seltsamen Championwahlen für die mittlere Lane – damit meinen wir vor allem Kayle mit Zerschmettern … und Verschlinger. Ende 2015 führte der Erfolg PowerOfEvil zu einer neuen Mannschaft – Origen.\n\nBei Origen hatte PowerOfEvil jedoch trotz der Hilfe des Mid-Laners des All-Stars-Events 2016, xPeke, Probleme, seinen Rhythmus zu finden, weshalb er die Mannschaft am Ende des Jahres wieder verließ. Er steckt immer noch voller Potenzial und die Misfits haben ihn aufgenommen, um ihre Aufstellung zu verstärken. Dieser Tapetenwechsel könnte sein Talent endgültig zum Vorschein bringen, das in seiner Zeit bei Origen nur selten zu sehen war. PowerOfEvil muss jetzt beweisen, dass er sich dank seiner Belastbarkeit verbessern konnte. Der Einsatz ist hoch und für ihn heißt es jetzt: „Alles oder nichts.“</p>"},"foreignIds":{"drupalId":"1455","TRLH3":"200000051","TRLH4":"200000154"},"socialNetworks":{"facebook":"www.facebook.com/thepowerofevil","twitter":"https://twitter.com/PowerOfEvilLoL"},"champions":[],"liveGameTeam":228},{"id":357,"slug":"ignar","name":"IgNar","firstName":"Dong-geun","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ignar-5rj4dfc4.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-09T11:01:30.000Z","bios":{"en_US":"Dong-geun \"IgNar\" Lee hails from South Korea but got his professional start in North America with Winterfox, although he didn’t appear in a single game for them. He eventually moved back to Korea and played with both Incredible Miracle and KT Rolster, gaining valuable top tier competitive experience.\n\nAfter proving that he could hang with the best in Korea, IgNar once again moved continents, except this time he made his way to Europe to play for the EUCS squad Misfits. He excelled as their support and helped them into the EU LCS. While assisting his team in cutting the Challenger competition down to size, IgNar played Braum, Bard and everything in-between. His wide champion pool should help give Misfits a fighting chance against the best teams Europe has to offer.</p>","de_DE":"<p>Dong-geun „IgNar“ Lee stammt aus Südkorea, hat seine professionelle Karriere aber bei Winterfox in Nordamerika begonnen (obwohl er für die Mannschaft kein einziges Spiel bestritten hat). Daraufhin ging er zurück nach Korea, wo er sowohl mit Incredible Miracle als auch mit KT Rolster Erfahrungen sammeln konnte.\n\nNachdem er bewiesen hatte, dass er es mit den besten Spielern Koreas aufnehmen konnte, zog IgNar nach Europa, um dort in der EU CS für die Misfits zu spielen. Dort lieferte er eine überragende Leistung als Supporter ab und half der Mannschaft, in die EU LCS einzuziehen. IgNar spielte sämtliche Champions von Braum bis Bard und half seiner Mannschaft, die Konkurrenz in der Challenger Series dem Erdboden gleich zu machen. Sein umfangreicher Champion-Pool sollte den Misfits helfen, gegen die besten Mannschaften Europas bestehen zu können.</p>"},"foreignIds":{"drupalId":"3777","TRLH4":"200000156","TRLH3":"200000053"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":392,"slug":"paragon","name":"Paragon","firstName":"Hyun-Il","lastName":"Choi","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/paragon-6qnhxpgh.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-03-07T19:18:45.000Z","updatedAt":"2017-05-31T21:00:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2126","TRLH1":"1001070001","ESPORTSTMNT02":"200000987","TRLH3":"200000252","TRLH4":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1090,"slug":"liv","name":"Hanssama","firstName":"Steven","lastName":"Liv","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/liv-a4dgwahi.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-21T21:14:43.000Z","updatedAt":"2017-06-09T10:54:49.000Z","bios":{"en_US":"<p>Steven \"Hans sama\" Liv got his competitive start in 2015, where he joined up with Milenium. Soon after Milenium lost in the EUCS playoffs, Hans sama made his way to Misfits in June of 2016. He helped propel them through Challenger and into the EU LCS for the 2017 Spring Split.</p>\n\n<p>Hans sama comes into the EU LCS at just 17 years old. Largely unproven and lacking the years of experience that many players have at this level, he will have to learn to adapt quickly and step his game up accordingly. Playing against tried and tested world class talent like Rekkles and Zven will prove to be one of the biggest hurdles of his career. He will need to stand up to the best or get swept aside like the rest. Game on.</p>","de_DE":"<p>Steven „Hans Sama“ Liv begann seine professionelle Karriere 2015, als er von Millenium aufgenommen wurde. Im Juni 2016 wechselte Hans Sama kurz nach der Niederlage von Millenium in den Entscheidungsspielen der EU CS zu den Misfits. Er half der Mannschaft, sich über die Challenger Series für den Frühjahrs-Split der EU LCS 2017 zu qualifizieren.\n\nHans Sama ist gerade einmal 17 Jahre alt, wenn er zum ersten Mal in der EU LCS spielen wird. Ihm fehlt die langjährige Erfahrung der meisten Spieler auf diesem Niveau und er wird lernen müssen, sich schnell anzupassen und zu verbessern. Dabei werden die Spiele gegen herausragende Talente wie Rekkles und Zven zu den größten Hürden seiner bisherigen Karriere. Er wird sich gegen die Besten behaupten müssen, sonst wird er wie der Rest aus der Kluft gefegt. Das Spiel kann beginnen.</p>"},"foreignIds":{"TRLH4":"200000155","TRLH3":"200000052"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1334,"slug":"alphari","name":"Alphari","firstName":"Barney","lastName":"Morris","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alphari-3ozuf4zl.png","hometown":"UK","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:04:28.000Z","updatedAt":"2017-06-09T10:15:34.000Z","bios":{"en_US":"<p>Barney \"Alphari\" Morris began his career in 2015 and his play attracted the attention of Misfits who picked him up for their Challenger squad in 2016. He helped them carve a path through Europe’s Challenger scene and straight into the 2017 EU LCS Spring Split.</p>\n\n<p>Alphari spent time in Korea with his teammates in order to prepare for the challenge of playing at the highest level in Europe. He’ll need to come out of the gate swinging in order to keep up with hardened veterans in the top lane. It’ll largely be a trial by fire for the young talent, but the team’s bootcamp, coupled with tutelage from their veteran players, will play a key role in his development as he steps into one of the greatest challenges of his young career.</p>","de_DE":"<p>Barney „Alphari“ Morris begann seine Karriere 2015 und erregte mit seiner Spielweise die Aufmerksamkeit der Misfits, die ihn 2016 in die Mannschaft aufnahmen. Daraufhin half er der Mannschaft, sich einen Weg durch die europäische Challenger Series zu bahnen und den Frühjahrs-Split der EU LCS 2017 zu erreichen. \n\nAlphari verbrachte mit seinen Teamkameraden einige Zeit in Korea, um sich dort auf die kommenden Herausforderungen in Europa vorzubereiten. Er wird sein Bestes geben müssen, wenn er mit den abgehärteten Veteranen auf der oberen Lane mithalten will. Das junge Talent muss gleich eine Feuerprobe bestehen, wenn die größte Herausforderung seiner bisherigen Karriere beginnt, aber das Training mit der Mannschaft und die Hilfe der Veteranen sollten seine Entwicklung vorangetrieben haben.</p>"},"foreignIds":{"TRLH4":"200000152","TRLH3":"200000049"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AVmJogrGoUG4HPFjOKIa","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:65baedf8-2436-4806-a2f7-bfce2ab358aa","scheduledTime":"2017-01-20T16:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"1","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:2b9effad-fbbc-4d36-a3be-547588b3a143"},"match":"65baedf8-2436-4806-a2f7-bfce2ab358aa","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"2b9effad-fbbc-4d36-a3be-547588b3a143","league":"3"}],"gameIdMappings":[{"id":"d06e6007-580b-45a7-85ce-05abfb3bf4ff","gameHash":"5b84eed34b794ad6"},{"id":"7c9dd942-51c2-4460-abef-d32d2c19b90b","gameHash":"b7eabec01dfcc9d7"},{"id":"2d6ec8bd-676c-42a7-afd2-73c79d8c0256","gameHash":"4cdfcc0ba4e0f71a"}],"videos":[{"id":5070,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:2d6ec8bd-676c-42a7-afd2-73c79d8c0256","source":"https://www.youtube.com/embed/GswcF0gnleE?wmode=transparent","createdAt":"2017-01-20T20:55:10.000Z","updatedAt":"2017-01-20T20:55:10.000Z","game":"2d6ec8bd-676c-42a7-afd2-73c79d8c0256"},{"id":5071,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:d06e6007-580b-45a7-85ce-05abfb3bf4ff","source":"https://www.youtube.com/embed/i7TKa4jwQVc?wmode=transparent","createdAt":"2017-01-20T20:58:13.000Z","updatedAt":"2017-01-20T20:58:13.000Z","game":"d06e6007-580b-45a7-85ce-05abfb3bf4ff"},{"id":5072,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:7c9dd942-51c2-4460-abef-d32d2c19b90b","source":"https://www.youtube.com/embed/nDsrYw0J1qU?wmode=transparent","createdAt":"2017-01-20T20:55:54.000Z","updatedAt":"2017-01-20T20:55:54.000Z","game":"7c9dd942-51c2-4460-abef-d32d2c19b90b"}],"htmlBlocks":[],"match":{"id":"65baedf8-2436-4806-a2f7-bfce2ab358aa","name":"MSF-vs-GIA","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"games":{"7c9dd942-51c2-4460-abef-d32d2c19b90b":{"id":"7c9dd942-51c2-4460-abef-d32d2c19b90b","name":"G3","generatedName":"GIA|MSF|G3|65baedf824364806a2f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484945838733,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484938481046,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001910125","gameRealm":"TRLH3","platformId":"TRLH3:1001910125","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d06e6007-580b-45a7-85ce-05abfb3bf4ff":{"id":"d06e6007-580b-45a7-85ce-05abfb3bf4ff","name":"G2","generatedName":"GIA|MSF|G2|65baedf824364806a2f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484935362327,"source":"manual","note":"Updated from HQ 2","closed":true},"scores":{},"gameId":"1001910119","gameRealm":"TRLH3","platformId":"TRLH3:1001910119","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"2d6ec8bd-676c-42a7-afd2-73c79d8c0256":{"id":"2d6ec8bd-676c-42a7-afd2-73c79d8c0256","name":"G1","generatedName":"GIA|MSF|G1|65baedf824364806a2f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"standings":{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}]],"timestamp":1484945794026,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}]],"timestamp":1484932427418,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001910097","gameRealm":"TRLH3","platformId":"TRLH3:1001910097","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484945838733,"source":"bestOf","history":[{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484945794027,"source":"bestOf","closed":true},{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1484938481046,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"79bb0bed-3873-4a6c-91a2-b1098c381512":1,"0dba28fa-f921-4b54-87f5-d68be03505ff":0}}}