{"teams":[{"id":6,"slug":"ahq-e-sports-club","name":"ahq e-Sports Club","guid":"be6c7c1d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ahq-e-sports-club-iozw902p.png","acronym":"AHQ","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-05-30T21:10:24.000Z","bios":{"en_US":"<p>ahq e-Sports Club is one of the top League of Legends teams in Taiwan, and they have consistently battled for the regional title. However, with multiple GPL Championship victories, ahq is now dead set on being the best in the world. Can they rise to new heights in 2017 and earn another spot at the World Championship?</p>\n<p>Coach: Shang-Ching \"Greentea\" Tsai</p>","fr_FR":"Ahq e-Sports Club est l'une des meilleures équipes de League of Legends à Taiwan. Elle a constamment été en lutte avec les champions du monde de la Saison 2, Taipei Assassins, pour le titre régional à Taiwan. Cependant, avec de nombreuses victoires en GPL, AHQ est sur les rails pour devenir la meilleure équipe du monde. Pourront-ils atteindre les sommets de leurs compatriotes de TPA et remporter le championnat du monde ?","pl_PL":"Ahq e-Sports Club jest jedną z najlepszych tajwańskich drużyn League of Legends. Regularnie mierzyli się w walce z mistrzami świata Sezonu Drugiego, Taipei Assassins, o tytuł mistrza regionalnego Tajwanu. Jednakże po kilku zwycięstwach w mistrzostwach GPL, AHQ pragnie zostać najlepszą drużyną na świecie. Czy uda im się osiągnąć taki sam sukces, jaki osiągnęli ich tajwańscy rywale TPA, i wygrać mistrzostwa świata?","de_DE":"<p>ahq e-Sports Club ist eine der besten „League of Legends“-Mannschaften in Taiwan. Sie haben immer wieder mit den Weltmeistern von Saison 2, den Taipei Assassins, um die Titel in Taiwan gekämpft. Mit mehreren Siegen bei der GPL Championship hat ahq jetzt jedoch nur noch ein Ziel: Sie wollen die besten der Welt werden. Können sie in die Fußstapfen ihrer taiwanesischen Landsleute treten und die Weltmeisterschaft gewinnen?</p>","es_ES":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends de Taiwán. No han dejado de luchar por el título regional de Taiwán contra los campeones mundiales de la segunda temporada, los Taipei Assassins. Sin embargo, con múltiples victorias en el campeonato GPL, ahq va camino de convertirse en el mejor equipo del mundo. ¿Podrán elevarse a las alturas de sus compañeros taiwaneses TPA y ganar el Campeonato Mundial?</p>","pt_BR":"A ahq e-Sports Club é uma das melhores equipes de League of Legends de Taiwan. Eles têm competido consistentemente com a Taipei Assassins, os Campeões Mundiais da 2º Temporada, pelo título regional taiwanês. Mas agora com diversas vitórias na GPL, a ahq está determinada a ser a melhor do mundo. Será que eles conseguirão alcançar as mesmas alturas que seus companheiros taiwaneses da TPA e vencer o Campeonato Mundial?","es_AR":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends en Taiwán. Ha luchado constantemente con los Campeones Mundiales de la 2da Temporada, los Taipei Assasins, por el título Regional de Taiwán. Sin embargo, con varias victorias de Campeonato GPL, ahq ahora está concentrado completamente en ser el mejor equipo del mundo. ¿Podrán escalar hasta la cima conseguida por su compatriota equipo taiwanés TPA y ganar el Campeonato Mundial?</p>\n\n<p><strong>Entrenador: Chen \"Backstairs\" Yan-Fu</strong></p>"},"foreignIds":{"drupalId":"949"},"players":[20,34,35,302,407,408,1019],"starters":[20,35,302,407,408],"subs":[34,1019]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":20,"slug":"an","name":"AN","firstName":"Chun-An","lastName":"Chou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/an-1zhs9hs7.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:17.000Z","updatedAt":"2017-07-06T14:32:41.000Z","bios":{"en_US":"<p>Chun-An \"AN\" Chou is a fan favorite in the LMS. His quirky personality and aggressive AD carry play style come together in an endearing package. But those same traits sometimes surprise his own teammates. Much like his teammate Mountain, AN maintains a stoic disregard for win/loss records in scrims, and will play at his own pace -- and in his own way.\n</p>\n<p>\nBut when AN finds he isn't playing well, he does what every pro player would do to get out of a slump -- blame it on a lack of exercise. The solution? Easy! Go for a run in the middle of the night. And then wake up at 9 AM and go swimming, just to be safe. Of course, all that exercise takes a toll, so he will likely end up faltering in the next day’s practice...because of too much exercise. It’s a vicious cycle.\n</p>","fr_FR":"<p>Chun-An « AN » Chou est l'un des joueurs préférés des fans des LMS. Sa personnalité excentrique et son style de jeu agressif de carry AD constituent une association attachante. Mais ces mêmes caractéristiques peuvent parfois surprendre ses propres coéquipiers. À l'instar de Mountain, AN semble ne pas du tout s'intéresser au ratio victoires/défaites lors des matchs d'entraînement et joue à son rythme... et à sa façon.\n</p>\n<p>\nMais quand AN trouve qu'il ne joue pas bien, il fait ce que tout joueur pro fait pour sortir de l'ornière : il dit qu'il manque d'exercice. La solution ? Facile ! Partir courir au milieu de la nuit. Et au réveil, à 9 heures du matin, aller nager, juste au cas où. Bien sûr, faire autant de sport, ça peut fatiguer, et il risque de ne pas briller lors des entraînements du lendemain... à cause de trop d'exercice. Un véritable cercle vicieux.\n</p>","pl_PL":"<p>Chun-An „AN” Chou to ulubieniec fanów w LMS. Jego ciekawa osobowość i agresywna gra tworzą razem wyjątkowy pakiet. Jednak potrafi on też zaskoczyć swoich towarzyszy. Tak jak Mountain, AN nie przejmuje się zwycięstwami i porażkami w meczach treningowych i gra na swój własny sposób.\n</p>\n<p>\nKiedy jednak przestaje mu iść, robi to, co każdy zawodowiec – zwala winę na brak ćwiczeń. Rozwiązanie? To proste! Wystarczy trochę się przebiec w środku nocy. A potem pobudka o 9 rano i jeszcze trochę pływania dla pewności. Oczywiście ćwiczenia fizyczne są męczące, przez co zdarza mu się słabsza dyspozycja następnego dnia... z powodu przećwiczenia. Zaklęty krąg.\n</p>","de_DE":"<p>Chun-An „AN“ Chou ist der Fan-Liebling der LMS. Seine schrullige Persönlichkeit und sein aggressiver Spielstil mit AD-Carrys ergeben ein liebenswertes Gesamtpaket. Aber mit genau diesen Eigenschaften überrascht er manchmal seine Teamkameraden. Ähnlich wie seinem Teamkameraden Mountain sind AN die Siege und Niederlagen in Übungsspielen egal, und er spielt immer in seinem eigenen Tempo – und auf seine eigene Art.</p>\n\n<p>Aber wenn AN das Gefühlt hat, nicht gut zu spielen, tut er, was jeder Profi-Spieler tun würde – er schiebt es auf mangelnde Bewegung. Und was tut er dann? Ganz einfach! Er geht mitten in der Nacht joggen. Und dann steht er um 09:00 Uhr morgens auf und geht schwimmen, nur zur Sicherheit. Natürlich muss er dann der ganzen Bewegung Tribut zollen und kommt in den Übungsspielen nicht richtig in die Gänge … weil er zu viel Bewegung gemacht hat. Ein wahrer Teufelskreis.</p>","es_ES":"<p>Chun-An ''AN'' Chou es el favorito de los fans en la LMS. Su extravagante personalidad y su estilo de juego agresivo como AD carry conforman un preciado pack, pero esas mismas virtudes sorprenden a su equipo en más de una ocasión. Como su compañero Mountain, AN no tiene en cuenta las victorias y derrotas de las partidas de práctica, así que juega a su ritmo y por su cuenta,</p>\n\n<p>pero cuando AN considera que no está jugando bien, hace lo que haría cualquier profesional para superar un bache: achacarlo a la falta de ejercicio. ¿La solución? ¡Muy fácil! Salir a correr a medianoche. Luego se despierta a las nueve de la mañana para ir a nadar y sentirse bien. Por supuesto, todo ejercicio tiene su precio, así que puede que acabe flaqueando en el entrenamiento del día siguiente por haber hecho demasiado ejercicio. Es un círculo vicioso.</p>","pt_BR":"<p>Chun-An \"AN\" Chou é o favorito dos fãs na LMS. Sua personalidade peculiar e estilo de jogo agressivo com atiradores formam um pacote perigoso. Mas essas mesmas qualidades às vezes surpreendem até mesmo seus próprios aliados. Assim como seu companheiro Mountain, AN também mostra uma negligência estoica de vitórias e derrotas durante os treinamentos e gosta de jogar a seu próprio passo e de seu próprio jeito.</p>\n\n<p>No entanto, quando AN vê que não está jogando bem, ele faz o que todo jogador profissional faria para sair de uma crise: ele reclama que não tem se exercitado. A solução? Fácil! Ir para uma caminhada no meio da noite. E quem sabe acordar às 9 da manhã para uma nataçãozinha, só para ter certeza. É claro que todo esse exercício tem um preço, então ele provavelmente vai acabar super cansado na prática do dia seguinte... por ter se exercitado demais. É um ciclo vicioso.</p>","es_AR":"<p>Chun-An \"AN\" Chou es uno de los favoritos de los simpatizantes en LMS. Su extravagante personalidad y estilo de juego de acarreo con daño de ataque agresivo se reúnen en un paquete adorable. Pero esas mismas características a veces sorprenden a sus propios compañeros de equipo. De manera muy similar a su compañero Mountain, AN mantiene una estoica despreocupación por los registros de victorias y derrotas en las actuaciones, por lo que juega a su propio ritmo y a su propia manera.</p>\n\n<p>Pero cuando AN encuentra que no está jugando bien, hace lo que cualquier jugador profesional haría: culpa a una falta de ejercicio. ¿La solución? ¡Sencillo! Salir a correr en la mitad de la noche! Y luego levantarse a las 9 AM para ir a nada, solo para estar seguro. Desde luego que todo el ejercicio se pasa de la cuenta, por lo que probablemente falte al siguiente día de práctica... por culpa de mucho ejercicio. Es un círculo vicioso.</p>"},"foreignIds":{"drupalId":"1002","TRLH1":"1001380125","TRLH2":"1001280095","TRLH3":"1001160046","TRLH4":"1001160046","TRTW":"200000149","TRLT3":"200000260"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":34,"slug":"westdoor","name":"Westdoor","firstName":"Shu-Wei","lastName":"Liu","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/westdoor-e3yh8alc.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:30:57.000Z","bios":{"en_US":"<p>Shu-Wei \"Westdoor\" Liu is one of the most storied players in Taiwan, reaching Challenger on the Taiwan, North American, and Korean servers. Seeing Westdoor lock in Twisted Fate was considered guaranteed victory back in 2012. Even now it strikes fear into his opponents, though he has become better known for his godlike Fizz mechanics.\n</p>\n<p>\nIn contrast to his dynamic playstyle in-game, Westdoor is one of the quietest players on ahq e-Sports club in real life, often eating alone. But he is also the undisputed team captain. When his teammates are unsure of what to do, they look to him for guidance -- and he is always there to help push them further. As he explains, “If you have a dream, go chase it. Don’t give up until you grab it.” Westdoor is also the least likely to complain about practice -- in part because he lives and breathes Solo Queue. To top off the man and the legend, Westdoor spends his downtime between queues reading historical and science fiction novels, sharing favorites with his teammate Mountain. A gentleman, a scholar, a captain, and a friend. Is there anything Westdoor can’t do better than us?\n</p>","pl_PL":"<p>Shu-Wei „Westdoor” Liu to jeden z najlepszych graczy w Tajwanie – udało mu się trafić do kręgu Pretendenta w Tajwanie, Ameryce Północnej i Korei. Wybranie przez Westdoora Twisted Fate'a było gwarancją zwycięstwa w 2012 roku. Nawet dziś przeraża to przeciwników, chociaż gracz stał się znany z niesamowitej gry Fizzem.\n</p>\n<p>\nDla kontrastu z jego popisową grą Westdoor jest jednym z najcichszych graczy w klubie ahq i często jada sam. Jest jednak niezaprzeczalnie kapitanem drużyny. Kiedy towarzysze z drużyny nie wiedzą, co robić, traktują go jak przewodnika, a on zawsze staje na wysokości zadania. Sam wyjaśnia to tak: „Jeśli masz marzenie, musisz za nim gonić. Nie poddawaj się, póki się nie spełni”. Westdoor najrzadziej też narzeka na treningi, głównie dlatego, że niemal żyje w kolejce solo. Obrazu tej legendarnej postaci dopełnia fakt, że wolne chwile spędza na czytaniu książek historycznych i science fiction wraz ze swoim towarzyszem, Mountainem. Gentleman, uczony, kapitan i przyjaciel. Czy jest coś, czego Westdoor nie robi lepiej niż my?\n</p>","fr_FR":"<p>Shu-Wei « Westdoor » Liu est l'un des joueurs qui a le plus fait parler de lui à Taïwan, ayant atteint le palier Challenger sur les serveurs taïwanais, nord-américains et coréens. Quand Westdoor parvenait à jouer Twisted Fate en 2012, on pouvait considérer que la partie était jouée d'avance. Et encore aujourd'hui, cette combinaison peut effrayer ses adversaires à juste titre, bien qu'il soit depuis devenu particulièrement réputé pour sa maîtrise impressionnante de Fizz.\n</p>\n<p>\nAlors qu'il se montre incroyablement dynamique lors d'une partie, Westdoor est l'un des joueurs les plus discrets d'ahq e-Sports club dans la vie réelle, mangeant souvent seul. Ce qui ne l'empêche pas d'être le capitaine indiscuté de l'équipe. Quand ses coéquipiers ne savent trop quoi faire, ils se tournent vers lui... et il est toujours prêt à les aider à aller plus loin. Comme il le dit : « Si vous avez un rêve, pourchassez-le. N'abandonnez pas avant de l'avoir atteint. » Westdoor est également le moins enclin à se plaindre de l'entraînement, certainement parce qu'il adore jouer en file solo. Pour terminer de définir l'homme et la légende, il faut savoir que Westdoor passe tout son temps libre à lire des romans historiques ou de science-fiction, partageant ses livres préférés avec son coéquipier Mountain. Gentleman, érudit, capitaine et ami. Existe-t-il une chose que Westdoor ne sait pas faire mieux que nous ?\n</p>","de_DE":"<p>Shu-Wei „Westdoor“ Liu hat die Challenger Series in Taiwan, Nordamerika und Korea erreicht und gilt somit als einer der vielseitigsten Spieler in Taiwan. 2012 sprach man von einem sicheren Sieg, wenn Westdoor Twisted Fate auswählte. Und auch heute fürchten sich seine Gegner noch davor, auch wenn er jetzt eher für seine unglaublichen Spielzüge mit Fizz bekannt ist.</p>\n\n<p>Im Gegensatz zu seinem dynamischen Spielstil ist Westdoor im wahren Leben der ruhigste Spieler bei ahq e-Sports Club, der meistens sogar alleine isst. Aber gleichzeitig ist er der unangefochtene Teamleiter. Wenn seine Teamkameraden nicht genau wissen, was sie tun sollen, warten sie auf seine Führung – und er ist immer zur Stelle, um sie weiter voranzutreiben. Er erklärt das so: „Wenn du einen Traum hast, musst du ihn verfolgen. Und du darfst nicht aufhören, bevor er wahr geworden ist.“ Westdoor würde sich auch niemals über Training beschweren – was zum Teil auch daran liegt, dass die Solo-Warteschlange sein Zuhause ist. Und um der Legende noch einen draufzusetzen, liest Westdoor in seiner Freizeit Geschichts- und Science-Fiction-Romane, die er auch gerne mit seinem Teamkameraden Mountain teilt. Ein Gentleman, ein Gelehrter, ein Leiter und ein Freund. Gibt es eigentlich nichts, was Westdoor nicht besser kann als wir?</p>","es_ES":"<p>Shu-Wei ''Westdoor'' Liu es uno de los jugadores más históricos de Taiwán, y ha conseguido llegar al nivel Aspirante en los servidores de Taiwán, Norteamérica y Corea. En 2012, si Westdoor elegía a Twisted Fate, la victoria estaba garantizada. Incluso hoy en día levanta el pánico entre los rivales, aunque ahora es más famoso por su increíble manejo de Fizz.</p>\n\n<p>En contraste con su estilo de juego dinámico en partida, Westdoor es uno de los jugadores más callados de ahq e-Sports Club en la vida real, y suele comer solo, pero no cabe duda de que es el capitán del equipo. Cuando sus compañeros no tienen claro qué hacer, lo miran para que les guíe, y siempre les ayuda a llegar más lejos. Como él mismo afirma: ''Si tienes un sueño, ve a por él. No te rindas hasta que lo consigas''. Westdoor es también el que menos se queja a la hora de practicar, en parte porque le encanta la cola en solitario. Para rematar al hombre y la leyenda, Westdoor pasa su tiempo libre entre colas leyendo novelas históricas y de ciencia ficción, y comparte sus favoritas con su compañero de equipo Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Habrá algo en lo que Westdoor no logre ser mejor que nosotros?</p>","pt_BR":"<p>Shu-Wei \"Westdoor\" Liu é um dos jogadores mais lendários em Taiwan, conseguindo alcançar o nível Desafiante em Taiwan, América do Norte e Coreia ao mesmo tempo. Ver Westdoor escolher Twisted Fate era considerado uma vitória garantida em 2012. Até mesmo hoje ele ainda põe medo em seus oponentes, apesar de ter ficado mais conhecido por suas façanhas surreais com Fizz.</p>\n\n<p>Em contraste de seu estilo de jogo completamente dinâmico dentro do jogo, Westdoor é um dos jogadores mais quietos da ahq e-Sports Club na vida real, sempre almoçando sozinho em seu canto. Mas ele também é um capitão de equipe indiscutível. Quando seus companheiros não se sentem confiantes sobre o que fazer, eles o procuram para guiá-los e ele sempre está do lado deles para ajudar a melhorá-los. E é como ele diz, “Se você tem um sonho, vá atrás dele. Não desista até alcançá-lo”. Westdoor também é o menos provável de reclamar dos treinos, em parte porque a vida dele é a Fila Solo, mas além disso, a lenda também usa seu tempo livre entre as filas para ler livros de contos históricos e Sci-Fi, sempre compartilhando seus favoritos com seu companheiro Mountain. Um cavalheiro, estudioso, capitão e amigo. Existe alguma coisa em que o Westdoor não é bom?</p>","es_AR":"<p>Shu-Wei \"Westdoor\" Liu es uno de los jugadores más conocidos de Taiwán, y llegó a Aspirante en los servidores de Taiwán, Norteamérica y Corea. Ver a Westdoor en Twisted Fate se consideraba una victoria segura en el 2012. Aún ahora inspira temor en sus oponentes, aunque se ha vuelto más famoso por su mecánica divina con Fizz.</p>\n\n<p>En contraste con su dinámico estilo de juego, Westdoor es uno de los jugadores más tranquilos en ahq e-Sports club en la vida real, llegando incluso a comer varias veces en solitario. Sin embargo, es también el capitán indiscutido del equipo. Cuando sus compañeros no están seguros sobre qué hacer, acuden a su guía. Él siempre está disponible para ayudar a hacer que las cosas avancen más. Como bien dice, \"Si tienes un sueño, ve por él. No te rindas hasta que lo hayas cumplido\". Westdoor es también quien posee la menor posibilidad de quejarse sobre las prácticas, en parte porque vive y respira en cola individual. Por sobre el hombre y la leyenda, Westdoor pasa su tiempo inactivo entre colas leyendo material histórico y novelas de ciencia ficción, compartiendo sus favoritos con su compañero Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Hay algo que Westdoor no haga mejor que nosotros?</p>"},"foreignIds":{"drupalId":"948","TRLH1":"1001380124","TRLH2":"1001280094","TRLH3":"1001160045","TRLH4":"1001160045","TRTW":"200000008","TRLT3":"200000262"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":35,"slug":"albis","name":"Albis","firstName":"Jia-Wei","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/albis-7h5uw9xi.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:23:18.000Z","bios":{"en_US":"<p>Jia-Wei “Albis” Kang is the silent protector of ahq e-Sports Club. While he’s normally modest and reserved, he’s not afraid to spring into action to help his teammates both in and out of game. The LMS veteran has built a large fanbase over the years, earning him 43.4 percent of the support vote.</p>\n\n<p>Albis’s playmaking skills on the Rift were on full display at Worlds, when he played Bard to great effect in the Group Stage. However, he struggled on other champions, and AHQ failed to make it out of their group.</p>","fr_FR":"<p>Chia Wei \"Albis\" Kang est le protecteur silencieux d'ahq e-Sports Club. Même s'il est d'ordinaire modeste et réservé, il n'a pas peur de passer à l'action quand il s'agit d'aider ses coéquipiers, dans et hors jeu. Le vétéran LMS s'est créé une large base de fans au fil des ans, lui permettant d'obtenir 43,4 pour cent des votes support.</p>\n\n<p>Albis a montré tout ce dont il était capable sur la Faille lors du Mondial en jouant Bard de manière impressionnante dans la phase de groupe. Toutefois, il a du mal avec d'autres champions et AHQ n'a pas réussi à sortir gagnant de son groupe. Alors que l'événement All-Stars 2016 ne sera que pur chaos, l'équipe d'Albis peut compter sur lui pour les mener à la victoire.</p>","pl_PL":"Chia Wei „Albis” Kang to milczący obrońca ahq e-Sports Club. Chociaż zazwyczaj jest skromny i zamknięty w sobie, nie boi się rzucić do akcji, gdy trzeba pomóc kolegom, zarówno w grze, jak i poza nią. Ten weteran LMS zebrał w ciągu lat wielką bazę fanów, którzy zapewnili mu 43,4 procenta głosów dla zawodnika wsparcia.</p>\n\nAlbis w pełni zaprezentował swoje umiejętności kreowania rozgrywki na Summoner’s Rift podczas Mistrzostw, gdy niezwykle skutecznie grał Bardem w fazie grupowej. Jednak kiepsko sobie radził z innymi bohaterami i AHQ nie zdołali wydostać się z grupy. Chociaż wydarzenie All-Star 2016 będzie pełne zamieszania, drużyna Albisa może mieć nadzieję, że on zdoła poprowadzić ją do zwycięstwa.\n","de_DE":"<p>Chia Wei „Albis“ Kang ist der stille Beschützer des ahq e-Sports Club. Obwohl er normalerweise eher bescheiden und reserviert ist, hat er weder im Spiel noch im echten Leben Angst, seinen Teamkameraden zur Hilfe zu kommen. Der Veteran der LMS hat sich über die Jahre eine große Fangemeinde aufgebaut und wurde mit 43,4 % der Stimmen zum Supporter gewählt.</p>\n\n<p>Albis Fähigkeiten als Spielmacher in der Kluft waren bei der Weltmeisterschaft gut zu erkennen, als er in der Gruppenphase mit Bard das Kommando übernahm. Dafür hatte er jedoch mit anderen Champions Probleme und AHQ konnte sich nicht für die K.-o.-Phase qualifizieren. Doch Albis Team kann sich darauf verlassen, dass er sie beim All-Stars-Event 2016 durch das Chaos zum Sieg führen wird.</p>","es_ES":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de apoyo.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó a Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","pt_BR":"<p>Chia Wei “Albis” Kang é o protetor silencioso da ahq e-Sports Club. Apesar de normalmente ser modesto e reservado, ele não tem medo de entrar em ação para ajudar seus companheiros de equipe, tanto dentro como fora do jogo. O veterano da LMS construiu uma grande base de fãs ao longo dos anos, rendendo-lhe 43,4% dos votos de suporte.</p>\n\n<p>A habilidade em fazer jogadas em Summoner’s Rift de Albis foi exibida no Mundial, onde ele brilhou de Bardo na Fase de Grupos. Contudo, ele teve dificuldades em outros Campeões e a AHQ não conseguiu sair de seu grupo. Quando o bicho estiver pegando no Evento All-Star 2016, a equipe de Albis pode ter a certeza de que ele os ajudará a procurar a vitória.</p>","es_AR":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","cs_CZ":"<p>Chia Wei „Albis“ Kang je tichý ochránce týmu ahq e-Sports Club. Ačkoliv bývá tichý a nenápadný, nebojí se vrhnout po hlavě do akce, aby pomohl svým kolegům – a to jak ve hře, tak i mimo ni. Tento veterán LMS si za svou dlouholetou kariéru vybudoval bohatou fanouškovskou základnu, která mu při hlasování vynesla podporu ve výši 43,4 %.</p>\n\n<p>Albisovy kreativní herní dovednosti jasně zazářily na MS, kde ve skupině nesmírně efektivně řádil s Bardem. S ostatními šampiony se mu však až tak nedařilo a AHQ ze své skupiny nakonec nepostoupili. Turnaj All-Star 2016 sice bude hrozný masakr, v Albisovi však jeho tým najde pevnou oporu, jež jej může dovést za vítězstvím.</p>","el_GR":"<p>Ο Chia Wei “Albis” Kang είναι ο σιωπηλός προστάτης των ahq e-Sports Club. Συνήθως είναι συγκρατημένος και ντροπαλός, αλλά δεν φοβάται να δράσει αποφασιστικά για να βοηθήσει τους συμπαίκτες του εντός και εκτός παιχνιδιού. Είναι ένας βετεράνος του LMS που έχει αποκτήσει ένα πολύ μεγάλο κοινό όλα αυτά τα χρόνια. Δεν είναι παράξενο, λοιπόν, που πήρε το 43,4% των ψήφων για τη θέση του υποστηρικτή.</p>\n\n<p>Ο Albis έδειξε σε όλους πόσο καλός οργανωτής είναι στο Παγκόσμιο Πρωτάθλημα, όπου έπαιξε φοβερά με τον Βάρδο στη Φάση Ομίλων. Ωστόσο, δεν τα πήγε εξίσου καλά με άλλους ήρωες και οι AHQ δεν κατάφεραν να προκριθούν. Παρόλο που το Τουρνουά All-Star 2016 προβλέπεται αρκετά χαοτικό, οι συμπαίκτες του Albis μπορούν να τον εμπιστευτούν για να τους οδηγήσει στη νίκη.</p>","hu_HU":"Chia Wei „Albis” Kang az ahq e-Sports Club csendes védelmezője. Általában szerény és visszafogott, de a játékban (és azon kívül is) a csapattársai segítségére siet, ha szükség van rá. Az LMS-veteránnak továbbra is jelentős rajongótábora van, akik a támogatói szavazatok 43,4%-át adták le rá.</p>\n\nAlbis a vébén megmutatta, hogy milyen jó irányító, amikor Barddal játszott remekül a csoportkörben. Más hősökkel viszont nem volt sok szerencsére, így az AHQ nem jutott tovább a csoportjából. Bár a 2016-os All-Star gálán őrült meccsekre lehet számítani, Albisra bizalommal hagyatkozhat a csapata.\n","it_IT":"Chia Wei \"Albis\" Kang è il silenzioso protettore degli ahq e-Sports Club. È modesto e riservato, ma anche sempre pronto a scattare in aiuto dei suoi compagni, sia in partita che fuori. Questo veterano della LMS ha attirato a sé nel corso degli anni intere legioni di fan, che l'hanno premiato con il 43,4% dei voti nella categoria Supporto.\n</p>\nLe capacità di regista di Albis nella Landa sono state sotto gli occhi di tutti ai Mondiali, quando si è esibito con il suo Bard nella fase a gironi. Non è riuscito, tuttavia, a replicare il successo con gli altri campioni, e gli ahq non sono riusciti a proseguire la loro avventura nel torneo. Anche se l'All-Star 2016 sarà caratterizzato da un immenso caos, la squadra di Albis potrà contare sulle sue abilità di organizzatore per puntare alla vittoria.\n","ro_RO":"Chia Wei ''Albis'' Kang este protectorul tăcut al celor din ahq e-Sports Club. Cu toate că în mod normal e modest și tăcut, nu-i e teamă să intre în acțiune pentru a-și ajuta coechipierii atât în joc, cât și în afara lui. Veteranul din LMS a strâns un număr mare de fani de-a lungul anilor, obținând 43,4 la sută din voturile pentru suport.</p>\n\nPuterea lui Albis de a întoarce sorții în Rift a uimit spectatorii la Mondiale, când a jucat cu Bard cu mult succes în faza grupelor. Totuși, a avut probleme cu alți campioni, iar AHQ nu a reușit să treacă de grupe. Cu toate că All-Star Event va fi un turneu nebun și haotic, echipa lui Albis se poate baza pe un lucru: că-i poate conduce către victorie.\n","es_MX":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<P>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>"},"foreignIds":{"drupalId":"945","TRLH1":"1001380126","TRLH2":"1001280096","TRLH3":"1001360065","TRLH4":"1001310065","TRTW":"200000104","TRLT3":"200000261"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":302,"slug":"chawy","name":"Chawy","firstName":"Xing-Lei","lastName":"Wong","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chawy-13of7sx8.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2014-09-16T21:52:24.000Z","updatedAt":"2017-07-06T14:32:25.000Z","bios":{"en_US":"","es_AR":"<p>Xing-lei \"Chawy\" Wong es el carrilero central suplente de ahq e-Sports Club.</p>"},"foreignIds":{"drupalId":"377","TRTW":"200000007","TRLH2":"1001280097","TRLH1":"1001380127","TRLT3":"200000259"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":407,"slug":"mountain","name":"Mountain","firstName":"Zhao-Hong","lastName":"Xue","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mountain-a7eo73t.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:32:08.000Z","bios":{"en_US":"<p>Zhao-Hong \"Mountain\" Xue is the meaty, front-line-patrolling, carry-peeling jungler that every squishy champion dreams of having around in a team fight. Mountain integrated with ahq almost instantly after joining in 2014, despite initial worries about synergy with his teammates. His one potential flaw? He likes to experiment with in-game strategy -- sometimes without telling his team first, leading to questionable scrim results. But when ahq needs him to deliver his finest, he is always ready to step up to the plate.\n</p>\n<p>\nWhile Mountain enjoys experimenting with new strategies on the Rift, when he leaves the game behind he becomes more consistent. Whenever ahq goes abroad, the first thing he does is buy a doll from the airport or a local toy store for his girlfriend. And if he has time to kill between queues, he enjoys reading a good historical or science fiction novel with his teammate Westdoor.\n</p>","fr_FR":"<p>Zhao-Hong « Mountain » Xue est un jungler puissant et dominant que tout champion un peu fragile rêve d'avoir à ses côtés pendant un combat d'équipe. Mountain a rejoint ahq presque immédiatement après son arrivée en 2014, malgré des craintes initiales sur la synergie avec ses coéquipiers. Son potentiel point faible ? Il aime tenter de nouvelles stratégies en cours de partie, parfois sans même prévenir son équipe, ce qui peut mener à des résultats ambivalents lors des matchs d'entraînement. Mais quand ahq a besoin qu'il donne le meilleur de lui-même, il répond toujours présent.\n</p>\n<p>\nSi Mountain aime tester de nouvelles stratégies dans la Faille, quand il ne joue pas, il est beaucoup moins créatif. Dès qu'ahq part à l'étranger, il achète toujours une poupée pour sa petite amie à l'aéroport ou dans un magasin de jouets. Et s'il a du temps à perdre entre deux parties, il va lire un roman historique ou de science-fiction avec son coéquipier Westdoor.\n</p>","pl_PL":"<p>Zhao-Hong „Mountain” Xue to walczący na froncie i usuwający prowadzących dżungler, którego każdy wrażliwy bohater lubi mieć przy sobie. Mountain zintegrował się z ahq tuż po przyłączeniu się w 2014 roku mimo tego, że obawiano się o to, jak ułoży mu się współpraca z towarzyszami. Jego potencjalną wadą jest fakt, że lubi eksperymentować ze strategią, czasem nie mówiąc nawet towarzyszom, co daje bardzo różne wyniki. Jednak kiedy ahq naprawdę go potrzebuje, zawsze spełnia oczekiwania drużyny.\n</p>\n<p>\nChociaż Mountain lubi eksperymentować w grze, poza nią jest zrównoważony. Kiedy ahq wybiera się w podróż, zawsze kupuje swojej dziewczynie lalkę na lotnisku lub w sklepie z zabawkami. A jeśli ma czas między meczami, lubi czytać powieści historyczne i science fiction, tak jak jego kolega, Westdoor.\n</p>","de_DE":"<p>Zhao-Hong „Mountain“ Xue ist der robuste, Carry fressende Jungler an der Front, den jeder Champion, der nicht besonders viel aushält, in einem Teamkampf gerne an seiner Seite hätte. Mountain konnte sich trotz anfänglicher Sorgen über die Harmonie mit seinen Teamkameraden gleich nach seinem Beitritt im Jahr 2014 bei ahq integrieren. Seine einzige potenzielle Schwachstelle? Er experimentiert gerne mit der Strategie im Spiel – und manchmal vergisst er, seine Mannschaft darüber in Kenntnis zu setzen, was immer wieder zu fragwürdigen Ergebnissen in Übungsspielen führt. Aber wenn es ernst wird und ahq ihn braucht, stellt er sich der Herausforderung.</p>\n\n<p>Obwohl Mountain in der Kluft gerne mit neuen Strategien experimentiert, ist er abseits des Spiels lange nicht so experimentierfreudig. Immer wenn ahq das Land verlässt, kauft er am Flughafen oder in einem Spielzeugladen eine Puppe für seine Freundin. Und wenn er zwischen den Spielen einmal Zeit totschlagen muss, liest er mit seinem Teamkameraden Westdoor Geschichts- oder Science-Fiction-Romane.</p>","es_ES":"<p>Zhao-Hong ''Mountain'' Xue es ese valioso jungla que todo campeón fácil de asesinar desea tener cerca durante los combates de equipo porque protege en primera línea y defiende al carry. Mountain se integró en ahq al instante cuando se unió a ellos en 2014, a pesar de las preocupaciones iniciales sobre su sinergia con los compañeros de equipo. ¿Su posible punto débil? Le gusta experimentar con la estrategia en partida, a veces sin decírselo primero a sus compañeros, lo que provoca resultados cuestionables durante las prácticas. Pero cuando ahq necesita que lo dé todo, siempre está preparado para saltar a la palestra.</p>\n\n<p>Aunque le gusta probar nuevas estrategias en la Grieta, cuando deja el juego a un lado, se vuelve más coherente. Cuando ahq viaja al extranjero, lo primero que hace es comprarle una muñeca en el aeropuerto o en una tienda de la zona a su novia. Para matar el tiempo durante las colas, le gusta leer novelas históricas o de ciencia ficción con su compañero Westdoor.</p>","pt_BR":"<p>Zhao-Hong \"Mountain\" Xue é o caçador-tanque carregador e protetor que todo campeão frágil sonha em ter por perto em um confronto de equipe. Mountain se integrou quase que instantaneamente com a ahq logo em sua entrada em 2014, apesar de preocupações iniciais sobre a sinergia com seus compaheiros. Seu possível maior defeito? Ele gosta de experimentar com estratégias dentro do jogo, muitas vezes sem dizer aos seus companheiros primeiro, levando a resultados questionáveis durante o treinamento. Mas quando a ahq precisa que ele dê o seu melhor, ele sempre está pronto para atender às expectativas.</p>\n\n<p>Apesar de Mountain gostar de experimentar com novas estratégias no Rift, quando ele deixa essa parte de lado, ele se torna mais consistente. Sempre que a ahq viaja pelo mundo, a primeira coisa que ele faz é comprar uma boneca no aeroporto ou em uma loja de brinquedos local para sua namorada. E durante seu tempo livre da filas do League of Legends, ele gosta de ler uma boa novela histórica ou Sci-Fi com seu companheiro de equipe, Westdoor.</p>","es_AR":"<p>Zhao-Hong \"Mountain\" Xue es el sustancioso junglero que patrulla la primera línea y evita los movimientos del contrario, alguien a quien cada campeón frágil desearía tener cerca en un combate en equipo. Mountain se unió a ahq en el 2014 y se integró sólidamente casi al instante, a pesar de las preocupaciones iniciales sobre la forma de trabajar con sus compañeros. ¿Su posible falla? Le gusta experimentar con la estrategia dentro del juego, a veces sin avisar primero a sus compañeros, lo cual se traduce en cuestionables resultados. Sin embargo, cuando ahq necesita que se desempeñe impecablemente, está siempre listo para cumplir con lo suyo.</p>\n\n<p>Si bien a Mountain le gusta crear nuevas estrategias en la Grieta, cuando deja al juego atrás, se vuelve mucho más consistente. Cada vez que ahq sale del país, lo primero que hace es comprar una muñeca para su novia en el aeropuerto o en una juguetería local. Y, si tiene que matar el tiempo mientras hace fila, disfruta leyendo literatura histórica o novelas de ciencia ficción con su compañero Westdoor.</p>"},"foreignIds":{"drupalId":"1698","TRLH1":"1001380123","TRLH2":"1001280093","TRLH3":"1001160093","TRLH4":"1001160093","TRTW":"200000006","TRLT3":"200000258"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":408,"slug":"ziv","name":"Ziv","firstName":"Yi","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ziv-r8szyen.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:22:21.000Z","bios":{"en_US":"<p>There’s a reason Yi “Ziv” Chen earned a staggering 66.1 percent of the top lane vote for the LMS region. He’s the cream of the crop of LMS top laners, and he’s proven he can compete with the best in the world. He turned heads with his debut at the 2015 Mid-Season Invitational, and he led AHQ to two of their victories with stellar Jayce play at the 2016 World Championship. Unfortunately, AHQ fell just short of making it out of the group stage.</p>\n\n<p>Ziv made a name for himself in the LMS with his unrelenting approach in the top lane. He isn’t afraid to chase his opponents all the way to their fountain if necessary. He’s shown his dedication to improving his craft, and he’s always looking to improve his mechanics in scrims and solo queue.</p>","fr_FR":"<p>Ce n'est pas sans raison que Yi \"Ziv\" Chen a remporté un pourcentage écrasant de 66,1 dans le vote top laner de la région LMS. Il est la crème de la crème des top laners LMS et il a démontré qu'il pouvait affronter les meilleurs du monde. Il a fait tourner les têtes lors de ses débuts dans le Mid-Season Invitational 2015, et AHQ lui doit deux de ses victoires grâce à son jeu exceptionnel de Jayce lors du Championnat du monde 2016. Malheureusement, AHQ n'a pas réussi à sortir gagnant de la phase de groupe.</p>\n\n<p>Ziv s'est fait un nom dans les LMS avec son style implacable dans la voie du haut. Il n'a pas peur de poursuivre ses adversaires jusqu'à leur fontaine, s'il le faut. Il s'est montré déterminé dans l'apprentissage de son art et il cherche toujours à améliorer ses mécaniques dans les matchs amicaux et la file solo. L'événement All-Stars 2016 lui donnera une chance de se libérer et de plonger dans le chaos de l'intersaison.</p>","pl_PL":"Yi „Ziv” Chen nie bez powodu zdobył oszałamiające 66,1 procenta głosów na górnego regionu LMS. Należy do śmietanki górnych LMS i pokazał, że potrafi rywalizować z najlepszymi na świecie. Zwrócił na siebie uwagę podczas debiutu na Mid-Season Invitational 2015, a swoją genialną grą Jaycem doprowadził AHQ do dwóch zwycięstw na Mistrzostwach Świata 2016. Niestety AHQ nie zdołali wyjść z fazy grupowej, choć tak niewiele im do tego brakowało.\n</p>\nZiv zdobył sobie uznanie w LMS swoją nieustępliwością na górnej alei. Gdy trzeba, nie boi się ścigać przeciwników aż do ich fontanny. Wykazał się skrupulatnością w doskonaleniu swojego warsztatu i zawsze jest gotowy poprawiać mechanikę gry podczas sesji treningowych i w kolejce solo. Wydarzenie All-Star 2016 będzie dla niego okazją, by pójść na całość i poszaleć trochę poza sezonem.\n","de_DE":"<p>Es gibt einen Grund, aus dem Yi „Ziv“ Chen von unglaublichen 66,1 % aller Wähler zum Top-Laner für die LMS-Region gewählt wurde. Er ist der beste Top-Laner der LMS und er hat bewiesen, dass er mit den besten Spielern der Welt mithalten kann. Er erregte bereits bei seinem Debüt im Mid-Season Invitational 2015 Aufsehen und führte AHQ mit seinem überragenden Jayce zu zwei Siegen bei der Weltmeisterschaft 2016. Leider schaffte es AHQ knapp nicht, in die K.-o.-Runde der WM einzuziehen.</p>\n\n<p>Ziv machte sich mit seinen erbarmungslosen Spielzügen auf der oberen Lane einen Namen in der LMS. Er schreckt auch nicht davor zurück, seine Gegner bis in die Basis zu verfolgen, wenn es die Situation erfordert. Er hat gezeigt, dass er sich stets steigern will, und versucht, seine Mechaniken in Übungsspielen und der Solo-Warteschlange zu verbessern. Beim All-Stars-Event 2016 bekommt er die Möglichkeit, richtig aufzudrehen und in der Nebensaison ordentlich Chaos zu stiften.</p>","es_ES":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para la calle superior de la región de LMS. Es de lo mejorcito de los top de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograse dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en la calle superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola en solitario. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","pt_BR":"<p>Existe um motivo para Yi “Ziv” Chen ter conseguido 66,1% dos votos da rota do topo da região LMS. Ele faz parte da nata dos jogadores de posição na LMS e provou que pode competir com os melhores do mundo. Ele atraiu olhares com sua estreia no Mid-Season Invitational 2015 e levou a AHQ a duas de suas vitórias, com desempenhos espetaculares de Jayce no Campeonato Mundial 2016. Infelizmente, a AHQ não conseguiu sair da Fase de Grupos.</p>\n\n<p>Ziv fez seu nome na LMS com sua abordagem implacável da rota do topo. Ele não tem medo de perseguir seus oponentes até a fonte, se necessário. Mostrou sua dedicação em melhorar seu ofício e sempre está buscando aprimorar suas mecânicas em duelos na fila solo. O Evento All-Star 2016 lhe dará uma chance de relaxar e mergulhar no caos do pós-temporada.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yi \"Ziv\" Chen은 ahq E-sports Club에 가장 최근 합류한 선수 두 명 중 하나로 2014 월드 챔피언십 이후 팀에 들어갔습니다. 그는 데뷔 무대였던 2015 미드 시즌 인비테이셔널에서 마오카이와 나르를 이용한 압도적 경기력으로 세계를 뒤흔들었습니다. 특히 서구의 탑 라이너들 몇몇이 여기에 희생됐죠. Ziv는 2015 월드 챔피언십에서 ahq가 8강까지 올라가는 데 중요한 역할을 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">전장에서 그가 킬을 올리기 위해 적팀 탑 라이너를 쫓고 있지 않을 때에는 LMS에서 가장 진지한 선수들 중 하나가 됩니다. ahq의 스크림 경기에서 Ziv는 피지컬을 향상시키기 위해 최선을 다하죠. 하지만 연습이 끝나면 긴장을 푼 Ziv로 돌아옵니다. 평소에는 숙소에서 잠을 자거나 친구들과 애니메이션을 보며 하루를 보낼 때가 많습니다. </p>\n","es_AR":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","cs_CZ":"<p>Není žádná náhoda, že Yi „Ziv“ Chen získal za LMS ohromujících 66,1 % hlasů pro horní lajnu. Je absolutní špičkou mezi horními lajnaři z LMS a dokázal, že obstojí i v boji s těmi nejlepšími z celého světa. Vzbudil zaslouženou pozornost již při svém debutu na turnaji Mid-Season Invitational 2015 a svou hvězdnou hrou za Jayce dovedl AHQ ke dvěma z jejich vítězství na mistrovství světa 2016. Přesto AHQ bohužel nepostoupili ze skupiny.</p>\n\n<p>Ziv se v LMS proslavil tím, že v horní lajně nenechá svého soupeře ani na okamžik vydechnout. Je-li to zapotřebí, neváhá jej pronásledovat až na fontánu. Neusíná na vavřínech a neustále se snaží své herní dovednosti zlepšovat v cvičných utkáních a sólové frontě. Na turnaji All-Star 2016 bude mít příležitost utrhnout se ze řetězu a trochu si vychutnat všeobecný masakr v odpočinkové době mezi sezónami.</p>","el_GR":"<p>Δεν είναι τυχαίο που ο Yi “Ziv” Chen πήρε το απίστευτο ποσοστό 66,1% των ψήφων του LMS για τη θέση επάνω λωρίδας. Είναι ό,τι καλύτερο έχει να επιδείξει το LMS στην επάνω λωρίδα και μπορεί να ανταγωνιστεί τους καλύτερους παίκτες του κόσμου σε αυτήν τη θέση. Το ντεμπούτο του στο Mid-Season Invitational 2015 προκάλεσε τεράστια αίσθηση, ενώ αργότερα οδήγησε τους AHQ σε δύο πολύ σημαντικές νίκες στο Παγκόσμιο Πρωτάθλημα 2016 με εκπληκτικό χειρισμό του Τζέις. Δυστυχώς, οι AHQ δεν κατάφεραν να περάσουν από τη φάση ομίλων.</p>\n\n<p>Ο Ziv έγινε διάσημος στο LMS για τον αδυσώπητο τρόπο που έπαιζε στην επάνω λωρίδα. Δεν φοβάται να κυνηγήσει τους αντιπάλους του ακόμη και μέχρι το σιντριβάνι τους, αν χρειαστεί. Έχει αποδείξει την αφοσίωσή του στη βελτίωση του παιχνιδιού του και προσπαθεί πάντα να βελτιώσει τη γνώση των μηχανισμών σε φιλικούς αγώνες και παιχνίδια στην ουρά αναμονής για έναν παίκτη. Στο Τουρνουά All-Star 2016 θα έχει την ευκαιρία να τα δώσει όλα και να σπείρει λίγο χάος προτού ξεκινήσει η σεζόν.</p>","hu_HU":"Nem véletlen, hogy Yi „Ziv” Chen elsöprő, 66,1%-os szavazati aránnyal lehet az LMS régiót képviselő felső ösvényes. Az LMS felső ösvényesei közül is kiemelkedik, és bizonyította, hogy a világ legjobbjaival is elbánik. Először a 2015-ös szezonközi meghívásos versenyen hívta fel magára a figyelmet, és két győzelemre vezette az AHQ-t Jayce-t irányítva a 2016-os világbajnokságon. Balszerencséjükre ez nem volt elég ahhoz, hogy az AHQ továbbjusson a csoportkörből.</p>\n\nZiv azzal szerzett hírnevet magának az LMS-ben, hogy kíméletlenül játszik a felső ösvényen. Akár a forrásig is üldözi az ellenfeleit. Elkötelezetten fejleszti a játéktudását: gyakorlómeccseken és az egyéni várólistán csiszolja a képességeit. A 2016-os All-Star gálán végre ellazulhat, és örömét lelheti a játékban.\n","it_IT":"C'è un motivo alla base dell'incredibile 66,1% di voti guadagnato da Yi \"Ziv\" Chen nella categoria Superiore per la regione LMS. Non solo rappresenta l'élite dei superiori della LMS, ma ha anche dimostrato di saper tenere testa ai migliori giocatori del mondo. Ha attirato l'attenzione sin dal suo debutto al Mid-Season Invitational 2015 e ha condotto gli AHQ a due importanti vittorie ai Mondiali 2016 grazie alle sue giocate stellari con Jayce. Tuttavia, la sua squadra non è riuscita a qualificarsi nella fase a gironi.</p>\n\nZiv si è fatto conoscere nella LMS per il suo approccio aggressivo in corsia superiore. Non ha paura di dare la caccia ai suoi avversari e neppure di seguirli fino alla loro base, se necessario. Ha dimostrato molto impegno nel migliorare il suo gioco ed è sempre intento a studiare nuove meccaniche in allenamento e nelle code in singolo. L'All-Star 2016 gli darà la possibilità di scatenarsi e portare un po' di caos fuori dalla stagione regolare.\n","ro_RO":"Există un motiv pentru care Yi ''Ziv'' Chen a obținut un procent uimitor de 66,1 la sută din voturile pentru culoarul de sus din LMS. Este cel mai bun jucător de pe această poziție din regiune și a dovedit că poate concura liniștit la nivel mondial. A atras privirile spectatorilor prin debutul său la Mid-Season Invitational 2015 și a condus AHQ către două dintre victoriile echipei, jucând surprinzător cu Jayce la Campionatul Mondial 2016. Din păcate, AHQ nu a reușit să treacă de faza grupelor.</p>\n\nZiv și-a creat o reputație în LMS cu strategia sa nemiloasă de pe culoarul de sus. Nu-i e teamă să-și urmărească adversarii până la fântână dacă e cazul. E gata să muncească enorm ca să devină mai bun și încearcă mereu să-și îmbunătățească mecanicile în antrenamente și pe lista de așteptare solo. All-Star Event 2016 este o nouă șansă să se dezlănțuie și să provoace puțin haos în perioada dintre sezoane.\n","es_MX":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>"},"foreignIds":{"drupalId":"4288","TRLH1":"1001380122","TRLH2":"1001280092","TRLH3":"1001360061","TRLH4":"1001310061","TRTW":"200000148","TRLT3":"200000257"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1019,"slug":"lbb","name":"LBB","firstName":"Bing-Xin","lastName":"Liu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lbb-brctu3lx.png","hometown":"","region":"LMS Taiwan","birthdate":null,"createdAt":"2016-01-06T21:51:14.000Z","updatedAt":"2017-03-24T20:16:37.000Z","bios":{},"foreignIds":{"TRTW":"200000058"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84}],"scheduleItems":[{"id":"AV0VpWjcoUG4HPFjOKYA","content":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:match:6a4ff65c-4492-4aa3-a65c-cd2f2922c6ca","scheduledTime":"2017-07-06T10:00:00.362+0000","tags":{"blockLabel":"1","blockPrefix":"day","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:bracket:9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5"},"match":"6a4ff65c-4492-4aa3-a65c-cd2f2922c6ca","tournament":"093599e3-e07d-4b43-8430-3e03b644b1f5","bracket":"9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","league":"43"}],"gameIdMappings":[{"id":"7b1acae5-42f7-4534-8180-fde2fdf79d8b","gameHash":"7180fa77b4d7ff0c"}],"videos":[{"id":7740,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:game:7b1acae5-42f7-4534-8180-fde2fdf79d8b","source":"https://www.youtube.com/embed/tTwYY__n4ss?wmode=transparent&start=24910&rel=0","createdAt":"2017-07-06T16:43:12.000Z","updatedAt":"2017-07-06T16:43:12.000Z","game":"7b1acae5-42f7-4534-8180-fde2fdf79d8b"}],"htmlBlocks":[],"match":{"id":"6a4ff65c-4492-4aa3-a65c-cd2f2922c6ca","name":"R1M6","position":5,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1},{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":1}],"games":{"7b1acae5-42f7-4534-8180-fde2fdf79d8b":{"id":"7b1acae5-42f7-4534-8180-fde2fdf79d8b","name":"G1","generatedName":"AHQ|RNG|G1|6a4ff65c44924aa3a65","input":[{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":1},{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}],"standings":{"result":[[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}],[{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":1}]],"timestamp":1499359251702,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}],[{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":1}]],"timestamp":1499349614016,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"180149","gameRealm":"TRLT3","platformId":"TRLT3:180149","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1"}],[{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32"}]],"timestamp":1499359251702,"source":"bestOf","history":[{"result":[[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1"}],[{"roster":"80c7548f-b327-4f3d-b46c-278139d85c32"}]],"timestamp":1499349614016,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}