{"teams":[{"id":129,"slug":"dire-wolves","name":"Dire Wolves","guid":"be6f059f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-670hnbxe.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-7ka5aby3.png","acronym":"DW","homeLeague":"urn:rg:lolesports:global:league:league:13","altLogoUrl":null,"createdAt":"2015-09-22T01:39:36.000Z","updatedAt":"2017-06-06T05:03:48.000Z","bios":{"en_US":"<br>\n<a href=\"https://www.facebook.com/direwolvesgg/\" target=\"_blank\">Dire Wolves on Facebook</a>\n<br>\n<a href=\"https://twitter.com/direwolvesgg\" target=\"_blank\">Dire Wolves on Twitter</a>\n<br>\n<a href=\"https://store.direwolves.gg/\" target=\"_blank\">Dire Wolves Store</a>\n<br>\n<a href=\"https://www.hyvio.com/direwolves\" target=\"_blank\">Join the Wolfpack</a>","es_AR":"<p>Después de dos años de quedarse cortos en la OPL, los Dire Wolves por fin reclamaron su primer campeonato de liga. Después de unirse a la OPL en 2015, este equipo nunca había quedado en un lugar menor al cuarto o mejor que el segundo... hasta ahora. Su alineación mejorada demostró ser demasiado para su competencia, en gran parte gracias al regreso del tirador <strong>K1ng</strong>, y derrotaron a Legacy eSports 3-1 en la final de la OPL. Ahora están listos para ir al Mid-Season Invitational 2017, en donde estarán buscando reconocimiento internacional.</p>","de_DE":"Nachdem die Dire Wolves die OPL in den letzten beiden Jahren knapp nicht gewinnen konnten, hat es diesmal endlich gereicht. Die Mannschaft spielt seit 2015 in der OPL und belegte immer die Plätze vier, drei oder zwei – bis jetzt. Mit ihrer neuen Aufstellung und der Rückkehr des berühmten AD-Carrys K1ng waren sie für ihre Konkurrenten einfach eine Nummer zu groß, was sie auch im Finale der OPL bewiesen, in dem sie Legacy eSports 3–1 besiegten. Jetzt sind sie beim Mid-Season Invitational 2017 dabei, wo sie um internationale Anerkennung kämpfen werden.","es_ES":"Tras dos años quedándose a las puertas en la OPL, los Dire Wolves han ganado su primer campeonato de liga. Se unieron en 2015 a la OPL y, desde entonces, nunca han quedado por debajo del cuarto puesto, pero tampoco por encima del segundo... hasta ahora. Su nueva plantilla ha resultado ser demasiado fuerte para sus rivales; en gran parte, gracias al regreso de su ADC titular, K1ng. En la final de la OPL, vencieron 3 a 1 a Legacy eSports. Ahora, en el Mid-Season Invitational 2017, tendrán que luchar para ganarse el reconocimiento internacional.","fr_FR":"Après deux mauvaises années en OPL, les Dire Wolves ont enfin remporté leur premier championnat de League of Legends. Depuis son arrivée dans l'OPL en 2015, l'équipe n'avait jamais fait moins bien que 4e place ni mieux que la 2e place – jusqu'à maintenant. Avec leur nouvelle formation, les Dire Wolves n'ont fait qu'une bouché de la concurrence, en grande partie grâce au retour de la star ADC K1ng, et ont vaincu Legacy eSports à 3-1 lors de la finale de l'OPL. À présent, ils se préparent à disputer le Mid-Season Invitational 2017 et ils ont soif de reconnaissance internationale.","pl_PL":"Po dwóch latach, w których tak niewiele im brakowało, by podbić OPL, Dire Wolves nareszcie zdobyli swoje pierwsze mistrzostwo ligi. Po dołączeniu do OPL w 2015 roku drużyna nigdy nie zajęła pozycji gorszej niż czwarta, ani lepszej niż druga — aż do teraz. Odświeżony skład okazał się zbyt twardym orzechem do zgryzienia dla konkurencji — w dużej mierze dzięki powrotowi gwiazdorskiego prowadzącego, K1nga — i drużyna pokonała Legacy eSports 3-1 w finale OPL. Teraz czas na Mid-Season Invitational 2017, gdzie zamierzają zasłużyć na międzynarodowe uznanie.","pt_BR":"<p>Após dois anos morrendo na praia da OPL, os Dire Wolves finalmente venceram o seu primeiro campeonato. Após entrar para a OPL em 2015, a equipe terminou sempre no mínimo em quarto lugar, mas nunca acima do segundo... Até agora. Seu elenco reformulado provou estar acima dos competidores, em grande parte graças ao retorno do grande atirador, K1ng, e eles derrotaram a Legacy eSports na Final da OPL. Agora é a hora do Mid-Season Invitational 2017, quando eles estarão em busca de reconhecimento internacional.</p>"},"foreignIds":{},"players":[858,865,867,1072,1076,1100],"starters":[858,865,867,1076,1100],"subs":[1072]},{"id":199,"slug":"supermassive-esports","name":"BAUSuperMassive eSports","guid":"be7123e9-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-57rm1o9y.png","acronym":"SUP","homeLeague":"urn:rg:lolesports:global:league:league:32","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/supermassive-esports-1twy6scg.png","createdAt":"2016-04-11T16:37:23.000Z","updatedAt":"2017-07-26T14:57:57.000Z","bios":{"en_US":"<p>SuperMassive eSports formed in 2016 to compete in the Turkish Championship League. They set out to gather some of the best players in the region with the goal of succeeding not only domestically, but also internationally. It took some time for the team to gel, but they eventually earned a spot at the 2016 Mid-Season Invitational.</p>\n\n<p>SuperMassive fell to Dark Passage in the 2016 Summer Season playoffs, failing to earn a shot at attending Worlds. But they’ve bounced back in 2017, earning the TCL Winter title and a spot at the 2017 Mid-Season Invitational in Brazil. They’ll be aiming to improve on their performance at last year’s event, but they’ll have to fight their way through the Play-In first.</p>\n\n<p>Coach: Catalin Daniel “Exorant” Podosu</p>","es_AR":"<p>SuperMassive se formó en Turquía justo antes del inicio de la temporada 2016 del Campeonato Turco de League (TCL), logrando alcanzar un éxito y reconocimiento no solo local, sino internacional. Para conseguir dicho objetivo, han incorporar a los mejores jugadores de Turquía en cada uno de sus respectivas posiciones.</p>\n\n<p>A SUP le tomó un buen tiempo congeniar como equipo y crear una sinergia positive. Sin embargo, su alineación joven tomó forma durante el Torneo de Invierno, en el que derrotaron a Beşiktaş con un marcador de 3-1 durante la final.</p>\n\n<p>El siguiente paso para SuperMassive fue el International Wildcard Invitational 2016, en la Ciudad de México. Tras perder enfrentamientos importantes durante la fase de grupos, el equipo se vio obligado a jugar partidas de desempate. A partir de ese momento, todo funcionó en favor de este equipo. Solo perdieron una partida durante la fase de desempate y eliminatorias, lo que concedió a SUP la oportunidad de representar a Turquía en el MSI 2016.</p>","fr_FR":"SuperMassive eSports a été formée en 2016 pour concourir dans la Turkish Championship League. Plusieurs des meilleurs joueurs de la région ont ainsi été réunis dans le but de réussir à domicile, mais aussi au niveau international. L'équipe a mis un peu de temps à se souder, mais elle a finalement décroché une place pour le Mid-Season Invitational 2016.\n\nSuperMassive s'est ensuite inclinée face à Dark Passage lors des play-offs du segment d'été 2016, manquant sa chance de participer au Mondial. Mais l'équipe a rebondi en 2017, remportant le titre hivernal de la TCL, ainsi qu'une place pour le Mid-Season Invitational 2017 au Brésil. Elle cherchera à présent à améliorer sa performance de l'an dernier, mais elle devra d'abord se frayer un chemin à travers les qualifications.\n\nEntraîneur : Catalin Daniel « Exorant » Podosu\n","es_ES":"SuperMassive eSports se formó en 2016 para competir en la Championship League de Turquía (TCL). Fichó a algunos de los mejores jugadores de la región con el propósito de vencer no solo a nivel local, sino internacional. Les llevó un tiempo adaptarse los unos a los otros, pero finalmente consiguieron hacerse con un puesto en el Mid-Season Invitational 2016.\n\nSuperMassive perdió contra Dark Passage en los playoffs de la temporada de verano de 2016, por lo que no consiguió una plaza para el Mundial. En 2017, llegaron con las pilas cargadas y se han ganado el título de invierno de la TCL, así como su participación en el Mid-Season Invitational 2017 en Brasil. Intentarán mejorar los resultados del evento del año pasado, pero para ello tendrán que superar la fase de apertura.\n\nEntrenador: Catalin Daniel ''Exorant'' Podosu\n","de_DE":"SuperMassive eSports wurde 2016 gegründet, um an der türkischen Championship League teilzunehmen. Die Verantwortlichen versammelten ein paar der besten Spieler der Region, um nicht nur national, sondern auch international erfolgreich zu sein. Es dauerte etwas, bis aus den Spielern eine richtige Mannschaft wurde, aber sie konnten sich dennoch einen Platz beim Mid-Season Invitational 2017 sichern.\n\nSuperMassive verlor in den Entscheidungsspielen der Sommer-Saison 2016 gegen Dark Passage und verpasste damit die Teilnahme an der WM. Aber sie konnten 2017 zurückschlagen, den Winter-Split der TCL gewinnen und sich einen Platz beim Mid-Season Invitational 2017 in Brasilien sichern. Dort werden sie versuchen, ihr Ergebnis vom letzten Jahr zu verbessern, aber dazu müssen sie sich zuerst durch die Vorrundenphase kämpfen.\n\nTrainer: Catalin Daniel „Exorant“ Podosu\n","pl_PL":"SuperMassive eSports powstali w 2016 roku, by podjąć rywalizację w Turkish Championship League. Postanowiono zebrać kilku z najlepszych graczy w regionie, stawiając sobie za cel osiągnięcie sukcesu nie tylko u siebie, ale także na świecie. Zgranie się drużyny zajęło trochę czasu, ale w końcu zdobyli miejsce na Mid-Season Invitational 2016.\n\nW play-offach sezonu letniego 2016 SuperMassive ustąpili Dark Passage, tracąc okazję do udziału w Mistrzostwach. Ale w 2017 roku powrócili, zdobywając tytuł zimy TCL i miejsce na Mid-Season Invitational 2017 w Brazylii. Zapewne zamierzają poprawić swoje wyniki z zeszłorocznego turnieju, ale najpierw będą musieli przebić się przez rundę wstępną.\n\nTrener: Catalin Daniel „Exorant” Podosu\n\n","pt_BR":"<p>A SuperMassive eSports foi formada em 2016 para competir na Turkish Championship League. Eles saíram em busca de alguns dos melhores jogadores da região com o objetivo de vencer não apenas nacionalmente, mas também internacionalmente. Demorou algum tempo para a equipe se entender, mas eles finalmente conquistaram um lugar no Mid-Season Invitational 2016.</p>\n\n<p>A SuperMassive perdeu para a Dark Passage nas eliminatórias da Temporada de Verão 2016, perdendo a chance de participar do Mundial. Mas eles se recuperaram em 2017, ganhando o título da Etapa de Inverno da TCL e um lugar no Mid-Season Invitational 2017 no Brasil. Eles vão tentar se sair melhor do que no evento do ano passado, mas vão precisar vencer a Fase de Entrada primeiro.</p>\n\n<p>Técnico: Catalin Daniel \"Exorant\" Podosu</p>","tr_TR":"Kurulduğu günden itibaren şampiyonluk adayı olma parolasıyla yoluna devam eden BAUSuperMassive eSports şimdiye kadar elde ettiği iki KMF bir IWCI kupasıyla doğru adımlar attığını gösterdi.<br><br>Hedefe kilitlendiği zaman korkulacak bir takım haline gelen SUP, geçtiğimiz sene kaçırdığı TBF kupasını bu sene alabilmek için iletişimi ön planda tuttu ve tamamen yerli oyunculardan oluşan bir kadro kurdu.\n"},"foreignIds":{},"players":[282,285,1210,1420,1421,1864,1925],"starters":[282,285,1210,1420,1421],"subs":[1864,1925]}],"players":[{"id":282,"slug":"naru","name":"Naru","firstName":"Koray","lastName":"Bıçak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/naru-7v36dmtn.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1996-08-27","createdAt":"2014-09-16T21:51:39.000Z","updatedAt":"2017-07-21T15:01:28.000Z","bios":{"en_US":"<p>Koray “Naru” Bıçak is a legend of the Turkish scene. He began his career with Dark Passage in 2013 and finished in first place in all but one split. He left the team last year to join SuperMassive eSports, where he continued his success and earned the chance to play at the 2016 Mid-Season Invitational.</p>\n\n<p>Naru is known for his wide champion pool and ability to pick up a new champion at a moment’s notice. His most played champions in the TCL regular season were Ryze, Corki and LeBlanc -- three unique play styles that he balanced effortlessly. If he wants to perform better at this year’s MSI in Brazil, he might need to pull out something surprising against world class mid laners like Bjergsen and Faker.</p>","es_AR":"<p>Koray 'Naru' Bıçak es el jugador profesional de Turquía más exitoso de todos los tiempos. Naru comenzó su carrera con el afamado equipo Dark Passage, con quien asistió a todas las finales de la TCL desde 2013, perdiendo un solo trofeo durante esta travesía. También cuenta con un amplio repertorio de experiencias internacionales, habiendo competido en varios torneos Wildcard y el Campeonato Mundial de 2014.</p>\n\n<p>Naru posee un repertorio de campeones inmenso, y juega cualquier cosa que requiera la composición de su equipo. También es un gran seguidor de los cambios en el metajuego, adoptando selecciones que se ponen de moda en las tendencias globales, y adaptándolas a su propio estilo de juego. Los equipos que participan en el Mid-Season Invitational 2016 necesitarán estar atentos a su flexibilidad y a su tendencia a acumular impresionantes ventajas de últimos golpes.</p>","fr_FR":"Koray « Naru » Bıçak est une légende sur la scène turque. Il a débuté sa carrière chez Dark Passage en 2013 et a terminé en première place dans tous ses segments, à l'exception d'un. Il a quitté l'équipe l'an dernier pour rejoindre SuperMassive eSports, où il a continué sur sa lancée victorieuse et s'est qualifié pour le Mid-Season Invitational 2016.\n\nNaru est connu pour son large pool de champions et sa capacité à choisir un nouveau champion sans préavis. Ses champions les plus utilisés durant la saison régulière de la TCL ont été Ryze, Corki et LeBlanc – trois styles de jeu uniques qu'il a su équilibrer sans mal. Cette année, s'il souhaite améliorer sa performance au MSI, au Brésil, il devra sûrement créer la surprise contre des midlaners de classe mondiale tels que Bjergsen et Faker.\n","es_ES":"Koray ''Naru'' Bıçak es una leyenda de la escena turca. Comenzó su trayectoria profesional con Dark Passage en 2013 y acabó en primer lugar en todos los splits salvo en uno. Abandonó el equipo el año pasado para unirse a SuperMassive eSports, donde siguió cosechando éxitos y se ganó la oportunidad de jugar en el Mid-Season Invitational 2016.\n\nNaru es famoso por su gran variedad de campeones y por su capacidad para aprender a jugar con nuevos campeones rápidamente. Sus campeones más jugados en la temporada regular de la TCL fueron Ryze, Corki y LeBlanc (tres estilos de juego únicos que pudo equilibrar sin esfuerzo). Si quiere obtener mejores resultados en el MSI de este año en Brasil, puede que tenga que sorprender a los mejores mid del mundo, como Bjergsen y Faker.\n","de_DE":"Koray „Naru“ Bıçak ist eine Legende der türkischen E-Sport-Szene. Er begann seine Karriere 2013 bei Dark Passage und gewann mit einer Ausnahme jeden Split. Im letzten Jahr verließ er die Mannschaft und wechselte zu SuperMassive eSports, wo er seinen Erfolgslauf fortsetzte und sich für das Mid-Season Invitational 2017 qualifizieren konnte.\n\nNaru ist für seinen umfangreichen Championpool und seine Fähigkeit bekannt, den Umgang mit neuen Champions in Windeseile zu erlernen. Im Verlauf der regulären Saison der TCL spielte er am häufigsten mit Ryze, Corki und LeBlanc – drei unterschiedliche Spielstile, zwischen denen er problemlos wechseln kann. Wenn er beim diesjährigen MSI in Brasilien eine bessere Vorstellung abliefern will, wird er die eine oder andere Überraschung aus seinem Hut zaubern müssen, um mit Mid-Lanern wie Bjergsen und Faker mithalten zu können.\n","pl_PL":"Koray „Naru” Bıçak to legenda tureckiej sceny. W 2013 roku rozpoczął swoją karierę z Dark Passage i wszystkie splity poza jednym kończył na pierwszym miejscu. Opuścił drużynę w zeszłym roku, by dołączyć do SuperMassive eSports, z którymi kontynuował odnoszenie sukcesów i zdobył szansę na udział w Mid-Season Invitational 2016.\n\nNaru znany jest z szerokiej puli bohaterów i tego, że potrafi niespodziewanie wybrać całkiem nowego bohatera. Najczęściej wykorzystywanymi przez niego bohaterami w sezonie zasadniczym TCL byli Ryze, Corki i LeBlanc — to trzy unikalne style gry, między którymi Naru balansuje bez wysiłku. Jeśli chce dać lepszy występ na tegorocznym MSI w Brazylii, będzie musiał wyciągnąć coś zaskakującego z rękawa, mierząc się ze światowej klasy środkowymi, takimi jak Bjergsen i Faker\n\n","pt_BR":"<p>Koray \"Naru\" Bıçak é uma lenda do cenário turco. Ele começou a sua carreira com a Dark Passage em 2013 e terminou em primeiro lugar em quase todas Etapas, não vencendo apenas uma. Ele saiu da equipe no ano passado para entrar na SuperMassive eSports, onde continuou a ter sucesso e conquistou a chance de jogar no Mid-Season Invitational 2016.</p>\n\n<p>Naru é conhecido pelo seu amplo elenco de Campeões e a habilidade de escolher um novo Campeão rapidamente. Os Campeões com os quais ele mais jogou na temporada regular da TCL foram Ryze, Corki e LeBlanc; três estilos de jogo diferentes que ele equilibrou sem esforço. Se ele quiser se sair melhor neste MSI no Brasil, precisará surpreender os jogadores de meio do mundo, como Bjergsen e Faker.\n</p>","tr_TR":"Koray \"Naru\" Bıçak Şampiyonluk Ligi’nde orta koridor denince akla gelen belki de ilk isim. Uzun yıllar Dark Passage kadrosunda yer alan Naru, yurt içinde düzenlenen her resmi turnuvayı takımının kazanmasında en büyük pay sahibi olan oyunculardan biriydi. Yurt dışında da yavaş yavaş tecrübe kazanmasıyla beraber ilk olarak 2013 IWCQ’da ülkemizi başarıyla temsil eden Dark Passage, bir sonraki sene 2014 Worlds’e katılmayı başarıyordu. Sadece yurt içinde gösterdiği performansla değil, EUW tekli dereceli sıralarında da gösterdiği başarı sonrası bir zamanların efsane takımı Gambit Gaming’den transfer teklifi alan Naru, her çevreden saygı gören bir isim haline geldi. Kaptanı olduğu Dark Passage’dan ayrılıp BAUSuperMassive eSports’a transfer olan Naru, 2016 ve 2017 KMF’yi ve 2016 IWCI’yi kazanmayı başardı ve son MSI’ın kapısından döndü. Bu mevsimde de geçtiğimiz mevsimdeki dominant performansını tekrarlamayı hedefleyen BAUSuperMassive’de Naru’dan beklentiler yüksek.\n <br><br>\nNaru her ne kadar hâlâ en üst düzey orta koridorlardan biri de olsa eski günlerini aradığı bir gerçek. Uzun yıllar boyu üst düzey performans göstermenin onu yıprattığı gerçeği bir yana, karşı orta koridordan skor almak için gereğinden fazla agresif oynaması ve Naru’nun üzerindeki “ne zaman düzelecek” baskısı gibi etmenler de Naru’yu efsanevi performansından uzaklaştırıyor. Eğer BAUSuperMassive geçen seneki başarısını tekrar etmek istiyorsa eski Naru’ya çok ihtiyaçları var.\n"},"foreignIds":{"drupalId":"3200","ESPORTSTMNT03":"200001302","TRLT3":"200000087","ESPORTSTMNT04":"200001535"},"socialNetworks":{"twitch":"http://www.twitch.tv/dpnaru","facebook":"https://www.facebook.com/dpnaru","twitter":"https://twitter.com/koraynaru"},"champions":[],"liveGameTeam":199},{"id":285,"slug":"fabfabulous","name":"fabFabulous","firstName":"Asim Cihat","lastName":"Karakaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fabfabulous-7yh3zrzv.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2014-09-16T21:51:40.000Z","updatedAt":"2017-07-21T14:58:22.000Z","bios":{"en_US":"<p>Asım Cihat \"fabFabulous\" Karakaya is the top laner for SuperMassive eSports. If he had it his way, he’d play nothing but carries in the top lane. But more often than not, his team needs him on a tank like Maokai or Shen. He was able to bring out Camille a bit during the regular season, though, going 5-0 on the champion. In his second trip to the Mid-Season Invitational, he might need to do some carrying if his team wants to make it through to the group stage in Rio de Janeiro.</p>","es_AR":"<p>Asım Cihat 'fabFabulous' Karakaya prefiere jugar carrileros superiores agresivos como Kha'Zix y Nidalee. Sin embargo, el nuevo meta ha cambiado y tuvo que adaptar su estilo de juego a campeones como Maokai. Como resultado tiene una poza de campeones muy amplia, con partidas con Vayne o Lissandra durante la Temporada 4. Esta característica hace que los bloqueos en su contra se vuelvan muy difíciles y le permite adaptarse a los cambios de meta con facilidad.</p>","tr_TR":"Asım \"fabFabulous\" Cihat Karakaya Türkiye’de League of Legends denince akla gelen ilk isimlerden. Bu unvanı da bileğinin hakkıyla kazanan fabFabulous profesyonel arenaya Şampiyonluk Ligi’nin en köklü takımlarından HWA ile adım attı. Gösterdiği inanılmaz performans sonrası yurt dışı turnuvalarda başarı hedefleyen Dark Passage’ın transfer ettiği fabFabulous, 2013 IWCQ’da imza şampiyonu olan Kha’Zix ile Pain Gaming karşısında beşte beş yaparak Dark Passage yöneticilerinin doğru karar verdiğini gösterdi. Bir sonraki sene de Dark Passage ile 2014 Worlds’e giden fabFabulous bu başarısını perçinlemiş oldu. <br><br> Yeni sezonda HWA’ya dönen fabFabulous, Kha’Zix’in başta ormanda oynanması yüzünden ormana geçeceğini söylemişti. Sonradan bu kararından vazgeçen fabFabulous, takımın üst koridoru Stomaged’in Ahraz Esports takımındaki gibi ormana geçmesine ve böylece Şampiyonluk Ligi’nin en üst düzey ormancılarından birinin doğmasına ön ayak oldu. <br><br>  HWA sonrası yıldızlar topluluğu olarak nitelendirilen BAUSuperMassive eSports’a geçen fabFabulous, bu takımda Thaldrin ile forma rekabetine girmesinin yanında koçluk görevine Hatchy gelene dek takımına koçluk bile yaptı. Thaldrin sonrası BAUSuperMassive’in üst koridorunda özlenen performansına devam eden fabFabulous’u sürekli izleyebilmek her espor izleyicisini mutlu eden bir durum.\n \nfabFabulous özellikle agresif şampiyonlarla yaptığı oyunlarla hatırlansa da sadece agresif şampiyonları oynayabildiğini düşünmek yanlış olur. Defansif şampiyonlarla da çok tehlikeli olan fabFabulous, geriye düşen takımını oyunun geç aşamasında takım savaşlarında gösterdiği performansla oyuna geri döndürebileceğini pek çok defa gösterdi. Sadece taraftarları değil, sunucuları bile yaptığı oyunlarla gaza getirip “fab fab fab fab” diye bağırtabilen fabFabulous’un varlığı BAUSuperMassive için çok önemli. Bu mevsim de pek çok yetenekli üst koridora karşı oynayacak olan fab, MSI elemelerinde gösterdiği performansa devam etmeye çalışacak ve performansıyla MSI’a kalamadıkları için üzülen taraftarlarının gönlünü almak için ter dökecek.\n","pl_PL":"Asım Cihat „fabFabulous” Karakaya gra jako górny SuperMassive eSports. Gdyby to zależało tylko od niego, grałby wyłącznie jako prowadzący na górnej alei. Ale często drużyna potrzebuje go w roli obrońcy, takiego jak Maokai lub Shen. Mimo wszystko udało mu się parę razy wybrać Camille podczas sezonu zasadniczego i osiągnąć z tą bohaterką wynik 5-0. W swojej drugiej wyprawie na Mid-Season Invitational być może będzie musiał trochę pograć jako prowadzący, jeśli jego drużyna chce przebić się do fazy grupowej w Rio de Janeiro.","fr_FR":"Asım Cihat « fabFabulous » Karakaya est le toplaner de SuperMassive eSports. S'il pouvait n'en faire qu'à sa tête, il se contenterait de jouer les carrys dans la voie du haut. Mais son équipe a parfois besoin de lui en tant que tank avec Maokai ou Shen. Cela dit, il a été capable d'utiliser un peu Camille pendant la saison régulière et a enregistré un 5-0 avec la championne. Lors de son second passage dans le Mid-Season Invitational, il devra peut-être jouer les carrys occasionnellement si son équipe espère accéder à la phase de groupe à Rio de Janeiro.","es_ES":"Asım Cihat ''fabFabulous'' Karakaya es el jugador de la calle superior de SuperMassive eSports. Si tiene la oportunidad de jugar según su estilo, optará por los carries para la calle superior. No obstante, es frecuente que su equipo necesite que juegue tanques como Maokai o Shen. Durante la temporada regular, pudo jugar un poco con Camille y consiguió un 5-0 con ella. En su segundo viaje al Mid-Season Invitational, puede que tenga que guiar a su equipo hasta la victoria si quieren participar en la fase de grupos en Río de Janeiro.","de_DE":"Asım Cihat „fabFabulous“ Karakaya ist der Top-Laner von SuperMassive eSports. Wenn es nach ihm ginge, würde er auf der oberen Lane nur Carrys spielen. Leider muss er für seine Mannschaft häufig Tanks wie Maokai oder Shen auswählen. Er konnte im Verlauf der regulären Saison aber immer wieder Camille spielen, mit der er bei fünf Siegen und null Niederlagen hält. Bei seiner zweiten Teilnahme am Mid-Season Invitational muss er wahrscheinlich das eine oder andere Spiel entscheiden, wenn er seiner Mannschaft dabei helfen will, die Gruppenphase in Rio de Janeiro zu erreichen.","pt_BR":"<p>Asım Cihat \"fabFabulous\" Karakaya é quem joga na rota superior da SuperMassive eSports. Por ele, jogaria sempre com carregadores na rota superior. Mas, frequentemente, sua equipe precisa dele com um tanque como Maokai ou Shen. Porém ele foi capaz de usar a Camille um pouco durante a temporada regular, conquistando 5-0 com a Campeã. Na sua segunda ida a um Mid-Season Invitational, ele pode precisar carregar um pouco a equipe se quiser passar da Fase de grupos no Rio de Janeiro.</p>"},"foreignIds":{"drupalId":"3198","TRLT3":"200000085","ESPORTSTMNT03":"200001300","ESPORTSTMNT04":"200001533"},"socialNetworks":{"facebook":"https://www.facebook.com/HWA.fabulous"},"champions":[],"liveGameTeam":199},{"id":858,"slug":"destiny","name":"Destiny","firstName":"Mitchell","lastName":"Shaw","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/destiny-h3hdrfj.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:09:07.000Z","updatedAt":"2017-07-14T04:16:04.000Z","bios":{"en_US":"<p>Mitchell “Destiny” Shaw is the support for the OPL’s Dire Wolves. He joined the OPL in 2015 as a support, then role swapped to ADC for the 2016 season. He returned to his original role on Dire Wolves to start the 2017 season. As a former carry player, he sometimes brings that playstyle to support-- he went undefeated in five games on Zyra. He’s also an excellent Nami player when the situation calls for it. He’ll need to be flexible in his champion picks if he wants his team to have the best shot at earning a spot in groups at the 2017 Mid-Season Invitational in Brazil.</p>","es_AR":"<p><strong>Mitchell \"Destiny\" Shaw</strong> es el soporte de los Dire Wolves de la OPL. Se unió a la OPL en 2015 como soporte, pero cambió de papel a tirador para la temporada 2016. Regresó a su papel original en los Dire Wolves al comienzo de la temporada 2017. Como ex tirador, a veces utiliza ese estilo de juego como soporte... salió invicto de cinco partidas con Zyra. Además, es un excelente jugador con Nami cuando la situación lo amerita. Tendrá que ser flexible al escoger a su campeón si quiere que su equipo tenga la mejor oportunidad para ganarse un lugar en la fase de grupos en el Mid-Season Invitational 2017 en Río.</p>","pl_PL":"Mitchell „Destiny” Shaw jest wspierającym Dire Wolves z OPL. W 2015 r. dołączył do OPL jako wspierający, a potem zmienił rolę na prowadzącego w ciągu sezonu 2016. Jednak z początkiem sezonu 2017 powrócił do swojej pierwszej roli w Dire Wolves. Jako były prowadzący czasami wykorzystuje ten styl gry we wsparciu — był niepokonany w pięciu grach Zyrą. Jest także świetnym graczem Nami, gdy wymaga tego sytuacja. Będzie musiał być elastyczny w doborze bohaterów, jeśli chce zapewnić swojej drużynie największe szanse na zdobycie miejsca w grupach podczas Mid-Season Invitational 2017 w Brazylii.","fr_FR":"Mitchell « Destiny » Shaw est le support des Dire Wolves. Il a rejoint l'OPL en 2015 en tant que support, avant de devenir ADC lors de la saison 2016. Il a finalement retrouvé son rôle original chez les Dire Wolves au début de la saison 2017. Son expérience en tant que carry influence parfois son style de jeu en support – il est resté invaincu pendant cinq parties avec Zyra. C'est également un excellent joueur avec Nami lorsque la situation le requiert. Il devra être flexible dans ses choix de champions s'il veut que son équipe ait une chance de décrocher une place lors de la phase de groupe du Mid-Season Invitational 2017 au Brésil.","es_ES":"Mitchell ''Destiny'' Shaw es el apoyo de Dire Wolves. Se unió a la OPL en 2015 como apoyo, pero pasó a jugar como ADC en la temporada 2016. Al comienzo de la temporada 2017 volvió a su rol original con Dire Wolves. Como antiguo carry, aporta parte de ese estilo de juego al rol de apoyo (consiguió mantenerse cinco partidas invicto con Zyra). También es un gran jugador de Nami cuando la situación así lo requiere. Tendrá que ser flexible en su selección de campeones si quiere que su equipo tenga una oportunidad de llegar a la fase de grupos en el Mid-Season Invitational 2017 de Brasil","de_DE":"Mitchell „Destiny“ Shaw ist der Supporter der Dire Wolves. Er begann seine Karriere in der OPL im Jahr 2015 als Supporter, schlüpfte in der Saison 2016 aber in die Rolle des AD-Carrys. Zu Beginn der Saison 2017 übernahm er dann bei den Dire Wolves wieder seine ursprüngliche Rolle. Als ehemaliger Carry legt er auch seine Rolle als Supporter manchmal sehr offensiv an – er schaffte es, mit Zyra fünf Siege ungeschlagen zu bleiben. Außerdem kann er auch mit Nami hervorragend umgehen, wenn es die Situation erfordert. Er wird bei der Championwahl flexibel sein müssen, wenn er mit seiner Mannschaft einen Platz in der Gruppenphase des Mid-Season Invitational 2017 in Brasilien ergattern will.","pt_BR":"<p>Mitchell \"Destiny” Shaw é o suporte dos Dire Wolves da OPL. Ele entrou para a OPL em 2015 como suporte, depois trocou de função para Atirador na temporada 2016. Ele retomou sua função original na Dire Wolves no início da temporada 2017. Como ex-carregador, às vezes ele traz esse estilo de jogo para o suporte; ele passou invicto em cinco jogos como Zyra. E também joga muito bem como Nami quando a situação exige. Ele terá de ser flexível na sua escolha de Campeões se quiser que a sua equipe tenha a chance de avançar no Mid-Season Invitation 2017.</p>"},"foreignIds":{"TRNA1":"1000435440","ESPORTSTMNT03":"200000501","TRLT3":"200000044"},"socialNetworks":{"twitter":"https://twitter.com/DestinyOCE"},"champions":[],"liveGameTeam":129},{"id":865,"slug":"k1ng","name":"k1ng","firstName":"Calvin","lastName":"Truong","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/k1ng-9bm5nq5c.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:32:17.000Z","updatedAt":"2017-07-14T05:22:55.000Z","bios":{"en_US":"<p>Calvin “k1ng” Truong is the star ADC for Dire Wolves. He’s one of the best ADC player in the OPL, and he knows it-- he joined in the league in 2014 under the name “BEST AD.” The 19-year-old left Dire Wolves for a year to play with Legacy eSports, but returned to start the 2017 season. He dominated on lethality-based carries like Varus and Jhin during the regular season, earning a 6.43 KDA that was second best among OPL ADCs. His skills on more traditional ADCs will be tested when he steps onto the international stage for the first time in Brazil.</p>","en_AU":"After spending a year in the much vaunted Legacy system, k1ng has returned home for a real chance to win it all. There are few players in Oceania with a mechanical ceiling as high as k1ng's, and he's in the perfect environment to show it off.","es_AR":"<p><strong>Calvin \"K1ng\" Truong</strong> es el tirador estrella de los Dire Wolves. Es uno de los mejores tiradores de la OPL y lo sabe... se unió a la liga en 2014 con el nombre <strong>\"BEST AD\"</strong>. El chico de 19 años dejó a los Dire Wolves por un año para jugar con Legacy eSports, pero regresó al comienzo de la temporada 2017. Dominó la temporada regular con tiradores basados en letalidad como Varus y Jhin, consiguiendo un KDA de 6.43, el segundo mejor de entre los tiradores de la OPL. Sus habilidades con tiradores más tradicionales se pondrán a prueba en Brasil, cuando suba al escenario internacional por primera vez.</p>","de_DE":"Calvin „K1ng“ Truong ist der Star-AD-Carry der Dire Wolves. Er ist einer der besten AD-Carrys der OPL, und das weiß er auch – 2014 spielte er noch unter dem Namen „BEST AD“. Der 19-jährige verließ die Dire Wolves, um ein Jahr lang bei Legacy eSports zu spielen, kehrte zu Beginn der Saison 2017 aber wieder zu den Wolves zurück. Während der regulären Saison dominierte er mit Carrys wie Varus und Jhin und war mit einer TTU von 6,43 der zweitbeste AD-Carry der OPL. Auf der internationalen Bühne in Brasilien wird er beweisen müssen, dass er auch mit traditionellen AD-Carrys überzeugen kann.","es_ES":"Calvin ''K1ng'' Truong es el famoso ADC de Dire Wolves. Es uno de los mejores ADC de la OPL, y lo sabe. Se unió a la liga en 2014 con el nombre ''BEST AD'' (''El mejor AD''). Este jugador de 19 años dejó Dire Wolves durante un año para jugar con Legacy eSports, pero volvió a comienzos de la temporada 2017. Durante la temporada regular, ha dominado con carries de letalidad como Varus y Jhin, lo que le ha hecho conseguir un A/M/A de 6,43 puntos y le ha colocado como segundo mejor ADC de la OPL. Sus habilidades con los ADC más tradicionales serán puestas a prueba cuando se suba al escenario internacional por primera vez en Brasil.","fr_FR":"Calvin « K1ng » Truong est la star ADC des Dire Wolves. Il est l'un des meilleurs ADC de l'OPL et il se sait : il a intégré le championnat en 2014 sous le pseudo « BEST AD ». Ce joueur de 19 ans a quitté les Dire Wolves pendant un an pour jouer avec Legacy eSports, mais il est revenu au début de la saison 2017. Pendant la saison régulière, il a dominé avec des carrys basés sur la létalité comme Varus et Jhin, ce qui lui a permis d'établir un KDA de 6,43 faisant de lui le deuxième meilleur ADC de l'OPL. Ses compétences avec des ADC plus traditionnels vont maintenant être mises à l'épreuve alors qu'il monte pour la première fois sur la scène internationale au Brésil.","pl_PL":"Calvin „K1ng” Truong to gwiazdorski prowadzący Dire Wolves. Jest jednym z najlepszych prowadzących w OPL i wie o tym — dołączył do ligi w 2014 roku pod pseudonimem „BEST AD”. Ten dziewiętnastolatek opuścił Dire Wolves na rok, by grać z Legacy eSports, ale wrócił z początkiem sezonu 2017. Dominował podczas sezonu zasadniczego, grając opierającymi się na destrukcji prowadzącymi, takimi jak Varus i Jhin, i zdobywając Z/Z/A 6,43 — drugi wynik wśród prowadzących OPL. Jego umiejętności gry bardziej tradycyjnymi prowadzącymi zostaną poddane próbie, gdy po raz pierwszy wkroczy na międzynarodową arenę w Brazylii.","pt_BR":"<p>Calvin \"K1ng” Truong é o principal atirador dos Dire Wolves. Ele é um dos melhores Atiradores na OPL e sabe disso; ele entrou para a liga em 2014 com o nome \"BEST AD”. O jogador de 19 anos deixou a Dire Wolves por um ano para jogar pela Legacy eSports, mas voltou para o início da temporada 2017. Ele dominou com carregadores baseados em Letalidade, como Varus e Jhin, durante a temporada regular, ficando com 6,43 de AMA, segundo melhor entre os Atiradores da OPL. Suas habilidades com Atiradores mais tradicionais serão testadas quando ele passar ao estágio internacional pela primeira vez.</p>"},"foreignIds":{"TRNA1":"1000435426","TRSA1":"465235","ESPORTSTMNT03":"200000426","TRLT3":"200000090"},"socialNetworks":{"twitter":"https://twitter.com/k1ngyb"},"champions":[],"liveGameTeam":129},{"id":867,"slug":"perfection","name":"Phantiks","firstName":"Richard","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perfection-b62yqjy0.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:36:13.000Z","updatedAt":"2017-07-14T04:19:15.000Z","bios":{"en_US":"<p>Richard “Phantiks” Su forms the second half of the Dire Wolves aggressive jungle-mid duo. Phantiks has held down the mid lane for the Dire Wolves since 2015. He’ll pick an assassin whenever the situation allows it; his favorite champions include Kassadin, Fizz and Zed. But he’s equally capable on more traditional mages, which allowed him to lead OPL mid laners with a KDA of 4.94 during the regular season. In his first international appearance at the 2017 Mid-Season Invitational, he’ll have to be careful that his aggression isn’t punished by some of the best mid laners in the world.</p>","en_AU":"Along with Swiffer, Phantiks is perhaps Oceania's most complete mid laner -- but he hasn't been able to translate his raw skill into major success just yet. The rest of the field is catching up with him, but that just might be what he needs to reach the next level.","es_AR":"<p><strong>Richard \"Phantiks\" Su</strong> conforma la segunda mitad del agresivo dúo junglero/central de los Dire Wolves. <strong>Phantiks</strong> defiende el carril central para los Dire Wolves desde el 2015. Escoge un asesino cuando la situación lo permite; sus campeones favoritos incluyen a Kassadin, Fizz y Zed. Pero es igual de eficaz con magos más tradicionales, lo que le ha permitido ser el mejor carrilero medio de la OPL con un KDA de 4.94 durante la temporada regular. En su primera aparición en el Mid-Season Invitational 2017, tendrá que tener cuidado de que su agresividad no sea castigada por algunos de los mejores carrileros centrales del mundo.</p>","pl_PL":"Richard „Phantiks” Su tworzy drugą połowę agresywnego duetu dżungla-środek w Dire Wolves. Broni środkowej alei dla Dire Wolves od 2015 roku. Gdy tylko pozwala mu na to sytuacja, wybiera zabójcę; do jego ulubionych bohaterów należą Kassadin, Fizz i Zed. Równie dobrze jednak radzi sobie, grając bardziej tradycyjnymi magami, co pozwoliło mu znaleźć się na szczycie środkowych OPL z Z/Z/A 4,94 w sezonie zasadniczym. Podczas swojego pierwszego międzynarodowego występu na Mid-Season Invitational 2017 będzie musiał uważać, aby jego agresja nie została ukrócona przez któregoś z najlepszych środkowych na świecie.","fr_FR":"Richard « Phantiks » Su constitue la deuxième moitié de l'agressif duo jungler-midlaner des Dire Wolves. Phantiks tient la voie du milieu pour l'équipe depuis 2015. Il choisit un assassin dès que la situation le permet et ses champions favoris incluent Kassadin, Fizz et Zed. Mais il est également très compétent avec des mages plus traditionnels, ce qui lui a permis de prendre la tête du classement midlaner de l'OPL avec un KDA de 4,94 pendant la saison régulière. Pour sa première apparition internationale au Mid-Season Invitational 2017, il devra éviter que son agressivité ne soit punie par les meilleurs midlaners du monde.","es_ES":"Richard ''Phantiks'' Su es la otra mitad del agresivo dúo jungla-mid de Dire Wolves. Phantiks ocupa el rol de la calle central en Dire Wolves desde 2015. Siempre que la situación lo permite, opta por jugar con asesinos, y sus campeones favoritos son Kassadin, Fizz y Zed. Sin embargo, es igual de bueno con magos tradicionales, lo que le ha permitido destacar entre los mid de la OPL con un A/M/A de 4,94 puntos durante la temporada regular. En su primera aparición internacional en el Mid-Season Invitational 2017, tendrá que tener cuidado para que su agresividad no sea castigada por algunos de los mejores mids de todo el mundo.v","de_DE":"Richard „Phantiks“ Su ist die zweite Hälfte des erfolgreichen Dschungel-Mitte-Duos der Dire Wolves. Phantiks kümmert sich schon seit 2015 um die mittlere Lane der Dire Wolves. Wenn möglich spielt er am liebsten Assassinen, weshalb Kassadin, Fizz und Zed auch zu seinen Lieblingschampions gehören. Er kann aber genauso gut mit traditionellen Magiern umgehen, was er mit einer TTU von 4,94 während der regulären Saison der OPL unter Beweis stellte. Bei seinem ersten internationalen Auftritt beim Mid-Season Invitational 2017 muss er aufpassen, dass seine Aggressivität nicht von den besten Mid-Lanern der Welt bestraft wird.","pt_BR":"<p>Richard \"Phantiks” Su forma a segunda metade da selvagem dupla pelo meio dos Dire Wolves. Phantiks defende o meio dos the Dire Wolves desde 2015. Ele escolhe um assassino sempre que a situação permite; seus Campeões favoritos incluem Kassadin, Fizz e Zed. Mas ele é igualmente capaz com magos mais tradicionais, o que lhe permitiu ficar em primeiro entre jogadores de meio da OPL, com 4,94 de AMA durante a temporada regular. Em sua primeira participação internacional no Mid-Season Invitational 2017, ele terá de cuidar para que sua agressividade não seja punida por alguns dos melhores jogadores de meio do mundo.</p>"},"foreignIds":{"TRNA":"1000435432","TRNA1":"1000435432","TRSA1":"465241","ESPORTSTMNT03":"200000425","TRLT3":"200000043"},"socialNetworks":{"twitter":"https://twitter.com/Phantiks"},"champions":[],"liveGameTeam":129},{"id":1072,"slug":"rippii","name":"Rippii","firstName":"Nathan","lastName":"Mott","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rippii-7g0mtg5y.png","hometown":null,"region":"OCE","birthdate":"1995-12-29","createdAt":"2016-01-20T03:56:51.000Z","updatedAt":"2017-04-27T19:09:04.000Z","bios":{},"foreignIds":{"TRNA1":"1000435436","TRSA1":"465245","ESPORTSTMNT03":"200000502","TRLT3":"200000045"},"socialNetworks":{},"champions":[],"liveGameTeam":129},{"id":1076,"slug":"chippys","name":"Chippys","firstName":"Ryan","lastName":"Short","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chippys-2swnuqsf.png","hometown":"","region":"OCE","birthdate":"1996-12-20","createdAt":"2016-01-21T06:14:29.000Z","updatedAt":"2017-07-14T04:17:51.000Z","bios":{"en_US":"<p>Ryan “Chippys” Short made big leaps forward as a top laner this year. Known for playing carry top laners, including his signature Irelia, he went a combined 8-0 on Camille and Rumble in the OPL regular season. He can also play a tank when needed, and his versatility carried him to an impressive 5.40 KDA, good for second best among OPL top laners. Now his skills as a carry will be put to the test at the 2017 Mid-Season Invitational.</p>","es_AR":"<p>Este año, <strong>Ryan \"Chippys\" Short</strong> se perfiló como el mejor carrilero superior a pasos agigantados. Conocido por jugar con acarreadores de carril superior, incluyendo a su emblemática Irelia, logró sacar un 8-0 combinado entre Camille y Rumble en la temporada regular de la OPL. <strong>Chippys</strong> también puede ser un tanque si es necesario y su versatilidad lo llevó a un impresionante 5.40 de KDA, el segundo mejor entre los carrileros superiores de la OPL. Ahora, sus habilidades como acarreador se podrán a prueba en el Mid-Season Invitational 2017.</p>","pl_PL":"Ryan „Chippys” Short wykonał w tym roku wielki krok naprzód jako górny. Znany jest z gry prowadzącymi górnymi, włącznie z jego sztandarową Irelią. W sezonie zasadniczym osiągnął łączny wynik 8-0, grając Camille i Rumblem. W razie potrzeby potrafi także grać jako obrońca, a wszechstronność pozwoliła mu zdobyć imponujące 5,40 Z/Z/A, zapewniając drugie miejsce wśród najlepszych górnych OPL. Teraz jego umiejętności prowadzącego zostaną przetestowane podczas Mid-Season Invitational 2017.","fr_FR":"Ryan « Chippys » Short a fait d'énormes progrès en tant que toplaner cette année. Connu dans son rôle de carry dans la voie du haut, notamment avec Irelia, il a enregistré une série de victoires combinés de 8-0 avec Camille et Rumble dans la saison régulière de l'OPL. Il sait aussi jouer les tanks au besoin et sa polyvalence lui a permis d'inscrire un KDA impressionnant de 5,40, faisant de lui le deuxième meilleur toplaner de la région. Maintenant, c'est en tant que carry qu'il devra faire ses preuves lors du Mid-Season Invitational 2017.","es_ES":"Ryan ''Chippys'' Short ha hecho grandes avances como jugador de la calle superior este año. Famoso por jugar con carries en top, incluyendo a su predilecta, Irelia, consiguió quedar 8 a 0 con Camille y Rumble en la temporada regular de la OPL. También es capaz de jugar con tanques cuando es necesario, y gracias a su versatilidad ha conseguido un impresionante A/M/A de 5,40 puntos, lo que lo ha colocado como el segundo de los jugadores de la calle superior de la OPL. Ahora tendrá que demostrar sus habilidades como carry en el Mid-Season Invitational 2017","de_DE":"Ryan „Chippys“ Short hat sich in diesem Jahr auf der oberen Lane stark verbessert. Er ist dafür bekannt, auf der oberen Lane gerne Carrys wie seinen Lieblingschampion Irelia zu spielen, und hat in der regulären Saison mit Camille und Rumble insgesamt achtmal gewonnen und nie verloren. Wenn es notwendig ist, hat er auch kein Problem damit, Tanks zu spielen. Diese Vielseitigkeit hat ihm zu einer TTU von 5,40 verholfen, dem zweitbesten Wert aller Top-Laner der OPL. Jetzt muss er beim Mid-Season Invitational 2017 beweisen, wie gut seine Carry-Künste wirklich sind.","pt_BR":"<p>Ryan \"Chippys” Short deu um grande salto de qualidade na rota superior este ano. Conhecido por usar carregadores na rota superior, incluindo sua clássica Irelia, ele fez um agregado de 8-0 em Camille e Rumble na temporada regular da OPL. Ele também pode jogar de tanque quando necessário, e sua versatilidade o levou a impressionantes 5,40 de AMA, ficando em segundo lugar entre jogadores na rota superior da OPL. Agora suas habilidades como carregador serão testadas no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRNA1":"1000435445","TRSA1":"465254","ESPORTSTMNT03":"200000299","TRLT3":"200000041"},"socialNetworks":{"twitter":"https://twitter.com/ChippysOCE"},"champions":[],"liveGameTeam":129},{"id":1100,"slug":"shernfire","name":"Shernfire","firstName":"Shern","lastName":"Tai","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shernfire-1ogbrwxw.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2016-01-21T22:09:01.000Z","updatedAt":"2017-05-31T02:44:03.000Z","bios":{"en_US":"<p>Shern “Shernfire” Tai is the playmaking jungler for the Dire Wolves. The 18-year-old already has over two years of professional experience, first joining the Dire Wolves as a substitute in 2014. After spending two years in the NA Challenger series to little success, Shernfire returned to his first team for the start of 2017. He’s one of the most gold-hungry junglers in the OPL. When the gold is rolling in, his Rengar and Kha’Zix look unstoppable. He’ll have to fight tooth and nail for every jungle camp at the 2017 Mid-Season Invitational, though, where he will face off against some of the world’s best junglers.</p>","es_AR":"<p><strong>Shern \"Shernfire\" Tai</strong> es el junglero que arma jugadas para los Dire Wolves. El chico de 18 años, que se unió a los Dire Wolves como sustituto en 2014, ya tiene más de dos años de experiencia en el juego profesional. Después de pasar dos años en la serie Retador NA con pocos resultados, <strong>Shernfire</strong> regresó a su primer equipo para el comienzo de la temporada 2017. Es uno de los jungleros con más sed de oro en la OPL. Cuando el oro comienza a circular, su Rengar y su Kha'Zix parecen ser imparables. Sin embargo, <strong>Shernfire</strong> tendrá que luchar con garras y dientes por cada campamento de jungla en el Mid-Season Invitational 2017, en donde se enfrentará a algunos de los mejores jungleros del mundo.</p>","de_DE":"Shern „Shernfire“ Tai ist der Spielmacher und Jungler der Dire Wolves. Der 18-jährige, der 2014 als Ersatzspieler zu den Dire Wolves kam, kann bereits auf eine zweijährige Profi-Karriere zurückblicken. Nachdem er zwei erfolglose Jahre in der nordamerikanischen Challenger Series verbracht hatte, kehrte er Anfang 2017 wieder zu seiner alten Mannschaft zurück. Er ist einer der goldgierigsten Jungler in der OPL. Und wenn er genug Gold bekommt, ist er mit Rengar und Kha’Zix nicht zu stoppen. Beim Mid-Season Invitational 2017 wird er sich jedoch mit Händen und Füßen gegen die besten Jungler der Welt zur Wehr setzen müssen.","es_ES":"Shern ''Shernfire'' Tai es el jungla estratega de Dire Wolves. Con solo 18 años, y tras unirse a Dire Wolves en 2014 como suplente, ya cuenta con dos años de experiencia profesional. Tras pasar dos años en la Challenger Series de NA sin mucho éxito, Shernfire volvió a su primer equipo a comienzos de 2017. Es uno de los junglas más hambrientos de oro de la OPL. Cuando abunda el oro, su Rengar y su Kha'Zix son imparables. No obstante, tendrá que luchar con uñas y dientes para hacerse con todos los campamentos de la jungla en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores junglas del mundo.","fr_FR":"Shern « Shernfire » Tai est un jungler qui crée du jeu pour les Dire Wolves. Ce joueur de 18 ans a déjà deux ans d'expérience professionnelle à son actif, ayant rejoint les Dire Wolves pour la première fois en tant que remplaçant en 2014. Après avoir passé deux années dans les Challenger Series NA sans succès ou presque, Shernfire est de retour dans sa première équipe pour le début de l'année 2017. Il est l'un des junglers les plus assoiffés d'or de l'OPL. Et lorsque les PO coulent à flot, ses Rengar et Kha'Zix semblent imbattables. Dans la jungle, il devra lutter pour chaque camp bec et ongles lors du Mid-Season Invitational 2017 face à certains des meilleurs junglers du monde.","pl_PL":"Shern „Shernfire” Tai to rozgrywający dżungler Dire Wolves. Osiemnastolatek ma już za sobą ponad dwa lata profesjonalnego doświadczenia. Po raz pierwszy dołączył do Dire Wolves jako rezerwowy w 2014 roku. Po spędzeniu z niewielkim powodzeniem dwóch lat w NA Challenger Series Shernfire na początku 2017 roku wrócił do swojej pierwszej drużyny. Jest jednym z najbardziej żądnych złota dżunglerów w OPL. Gdy złoto napływa, jego Rengar i Kha’Zix stają się niepowstrzymani. Jednak na Mid-Season Invitational 2017 będzie musiał walczyć na śmierć i życie o każdy obóz w dżungli, stając przeciwko najlepszym dżunglerom na świecie.","pt_BR":"<p>Shern \"Shernfire” Tai é o criador de jogadas dos Dire Wolves. O jovem de 18 anos já tem dois anos de experiência profissional, tendo entrado para os Dire Wolves como substituto em 2014. Após passar dois anos no circuito Desafiante da NA sem muito sucesso, Shernfire voltou à sua primeira equipe para o início de 2017. Ele é um dos melhores caçadores na OPL. Quando o ouro entra, seu Rengar e Kha’Zix parecem invencíveis. Mas ele terá de lutar com unhas e dentes por cada acampamento na selva do Mid-Season Invitational 2017, quando enfrentará alguns dos melhores caçadores do mundo.</p>"},"foreignIds":{"FRA1TMNT1":"375269","ESPORTSTMNT03":"200001275","TRLT3":"200000042"},"socialNetworks":{"twitter":"https://twitter.com/shernfire"},"champions":[],"liveGameTeam":129},{"id":1210,"slug":"stomaged","name":"Stomaged","firstName":"Furkan","lastName":"Güngör","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stomaged-4cek2mao.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2016-04-11T16:48:04.000Z","updatedAt":"2017-07-21T14:58:36.000Z","bios":{"en_US":"<p>Furkan “Stomaged” Güngör is the jungler for SuperMassive eSports. He’s making his second trip to the Mid-Season Invitational after attending in 2016. Stomaged is a versatile jungler, playing 10 unique champions in the 2017 TCL Winter Split. But he’s most at home on strong early game champions like Rek’Sai and Lee Sin. After a poor performance at last year’s event, he’ll be itching for another shot at the world’s top junglers in Brazil.</p>","es_AR":"<p>Furkan 'Stomaged' Güngör es el junglero de SuperMassive. Se unió a la escuadra para participar en el Torneo de Invierno de 2016. Stomaged es considerado como el jugador con mayor crecimiento en SUP, consolidando su transición hacia un junglero fiable y multifacético, en lugar de limitarse a sus viejos hábitos de utilizar solamente campeones tanque durante el 2014 y 2015. Incluso cambió posición al carril superior por un tiempo, pero los monstruos de la Grieta lo sedujeron a regresar a la jungla.  Y es donde mejor se desempeña.</p>\n\n<p>Aunque pudiera faltarle experiencia en torneos internacionales, Stomaged sigue siendo una pieza clave en la alineación de SUP. Y ahora, con un trofeo de campeonato de la TCL y un título IWCI, Stomaged participará en el Mid-Season Invitational 2016 con toda la seguridad y confianza a cuestas.</p>","fr_FR":"Furkan « Stomaged » Güngör est le jungler de SuperMassive eSports. Il revient au Mid-Season Invitational après une première participation en 2016. Stomaged est un jungler polyvalent, il a joué 10 champions uniques lors du segment d'hiver de la TCL 2017. Mais il est le plus à son aise avec des champions de début de partie puissants comme Rek’Sai et Lee Sin. Après une performance médiocre à l'événement de l'an dernier, il tentera de se racheter face aux meilleurs junglers du monde, au Brésil.","es_ES":"Furkan ''Stomaged'' Güngör es el jungla de SuperMassive eSports. Este es su segundo viaje al Mid-Season Invitational tras su visita de 2016. Stomaged es un jungla versátil: ha jugado con 10 campeones diferentes en el split de invierno de la TCL 2017. No obstante, destaca especialmente con campeones fuertes al principio de la partida, como Rek’Sai o Lee Sin. Tras su pobre actuación en el evento del año pasado, intentará aprovechar al máximo su nueva oportunidad internacional contra los mejores junglas del mundo en Brasil.","de_DE":"Furkan „Stomaged“ Güngör ist der Jungler von SuperMassive eSports. Er nimmt nach 2016 bereits zum zweiten Mal am Mid-Season Invitational teil. Stomaged ist ein vielseitiger Jungler, der im Winter-Split der TCL zehn verschiedene Champions spielte. Am wohlsten fühlt er sich aber mit Champions wie Rek’Sai und Lee Sin, die vor allem im frühen Spiel stark sind. Nach einer schwachen Vorstellung im letzten Jahr wird er in diesem Jahr in Brasilien beweisen wollen, dass er mit den besten Junglern der Welt mithalten kann.","pl_PL":"Furkan „Stomaged” Güngör jest dżunglerem SuperMassive eSports. To jego druga wyprawa na Mid-Season Invitational po pojawieniu się na turnieju w 2016 roku. Stomaged to wszechstronny dżungler, który grał 10 różnymi bohaterami podczas zimowego splitu TCL 2017. Jednak najpewniej czuje się, grając bohaterami silnymi we wczesnej fazie gry, takimi jak Rek’Sai i Lee Sin. Po kiepskim występie na zeszłorocznym turnieju nie może się doczekać kolejnej okazji, by zmierzyć się z najlepszymi dżunglerami świata w Brazylii.","pt_BR":"<p>Furkan \"Stomaged\" Güngör é o caçador da SuperMassive eSports. Ele fará sua segunda viagem ao Mid-Season Invitational depois de participar em 2016. Stomaged é um caçador versátil, que jogou com 10 Campeões diferentes na Etapa de Inverno da TCL 2017. Mas ele se sente mais em casa com Campeões fortes já no início do jogo, como Rek’Sai e Lee Sin. Depois de um desempenho ruim no evento do ano passado, ele está ansioso para ter outra chance de ser um dos melhores caçadores do mundo no Brasil.</p>","tr_TR":"Furkan \"Stomaged\" Güngör Şampiyonluk Ligi’nin en değerli ormancılarından biri. Eskiden en değerli üst koridorlardan biri olan Stomaged, 2013 Sezonu dereceli sırasında Ustalık seviyesine özellikle üst koridorda yaptığı Shen oyunlarıyla çıkan ilk oyunculardan biri olmuştu. HWA’da profesyonel kariyerine başlayan Stomaged, HWA’dan sonra AWH ve Ahraz Esports takımlarında da oynadı. HWA’ya geri dönmesiyle beraber orman rolüne geçen Stomaged, fabFabulous ile beraber rakiplerinin korkulu rüyası haline geldi. Yeni kurulan süper takım BAUSuperMassive eSports’ta da bu performansıyla kendine yer bulan Stomaged kendini giderek daha çok geliştirdi ve en iyi yerli ormancı unvanını Crystal’dan almayı başardı. BAUSuperMassive kadrosuyla 2016 ve 2017 KMF’yi kazanan ve 2016 IWCI’yi kazanarak 2016 MSI’a giden Stomaged, bu turnuvada dünyaca ünlü SKT takımından Baron çalarak büyük sükse yaptı. Bu mevsime de orman rolünde Stomaged ile devam eden BAUSuperMassive’in rakipleri beklenmeyen baskınlar için hazır olmalı.\n <br><br>\nEn iyi oynadığı rolü değiştirip yeni rolünde de en iyilerden biri olan Stomaged tam bir başarı hikayesi... Yine de özellikle yurt dışı maçlarda hâlâ diğer ormancılara göre bazı temel eksiklikleri olduğu göze çarpıyor. Bu eksiklerini kapatabilirse fabFabulous, Naru ve Zeitnot gibi isimlere rağmen BAUSuperMassive’in bu mevsim en büyük yıldızı haline gelebilir.\n"},"foreignIds":{"TRLT3":"200000086","ESPORTSTMNT03":"200001301","ESPORTSTMNT04":"200001534"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1420,"slug":"zeitnot","name":"Zeitnot","firstName":"Berkay","lastName":"Aşıkuzun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zeitnot-c7w21tyy.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-01-02","createdAt":"2016-08-22T15:00:06.000Z","updatedAt":"2017-07-21T14:59:37.000Z","bios":{"en_US":"<p>Berkay \"Zeitnot\" Aşıkuzun is the AD carry for SuperMassive eSports. After playing alongside Naru on Dark Passage beginning in 2015, Zeitnot joined SuperMassive to start the 2017 season. During the regular season, he thrived in the lethality meta, going undefeated in 11 games as Varus and Jhin. As the only current member of SuperMassive who didn’t attend the 2016 Mid-Season Invitational, Zeitnot will be making his first international appearance in Brazil. He’ll need to find his footing on a new set of champions if he wants to make it through the Play-In stage and beyond.</p>","de_DE":"Berkay „Zeitnot“ Aşıkuzun ist der AD-Carry von SuperMassive eSports. Zeitnot begann seine Karriere 2015 zusammen mit Naru bei Dark Passage, wechselte zu Beginn der Saison 2017 aber zu SuperMassive. Dank des neuen „Tödlichkeitsfaktor“-Metaspiels blühte er in der regulären Saison auf und schaffte es mit Varus und Jhin, elf Spiele lang ungeschlagen zu bleiben. Da Zeitnot das einzige Mitglied von SuperMassive ist, das nicht beim Mid-Season Invitational 2016 war, wird er in Brasilien sein Debüt auf der internationalen Bühne geben. Er wird sich jedoch mit neuen Champions zurechtfinden müssen, wenn er die Vorrundenphase überstehen will.","es_ES":"Berkay ''Zeitnot'' Aşıkuzun es el ADC de SuperMassive eSports. Tras jugar junto a Naru en Dark Passage al comienzo de 2015, Zeitnot se unió a SuperMassive a comienzos de la temporada 2017. Durante la temporada regular, destacó en el metajuego de la letalidad: consiguió mantenerse 11 partidas invicto con Varus y Jhin. Zeitnot es el único miembro actual de SuperMassive que no asistió al Mid-Season Invitational 2016, por lo que su viaje a Brasil será su primera aparición internacional. Tendrá que aprender a jugar con nuevos campeones si quiere superar la fase de apertura y llegar hasta lo más alto.","fr_FR":"Berkay « Zeitnot » Aşıkuzun est le carry AD de SuperMassive eSports. Après avoir joué aux côtés de Naru chez Dark Passage à partir de 2015, Zeitnot a rejoint SuperMassive au début de la saison 2017. Pendant la saison régulière, il a excellé dans la méta létalité, restant invaincu pendant 11 parties avec Varus et Jhin. Seul membre actuel de SuperMassive n'ayant pas participé au Mid-Season Invitational 2016, Zeitnot fera sa première apparition internationale au Brésil. Il devra donc trouver ses marques avec un nouvel ensemble de champions s'il veut dépasser la phase de qualifications.","pl_PL":"Berkay „Zeitnot” Aşıkuzun jest prowadzącym SuperMassive eSports. Już na początku 2015 roku grał z Naru w Dark Passage Zeitnot, a sezon 2017 rozpoczął, dołączając do SuperMassive. W sezonie zasadniczym rozwinął skrzydła w stanie gry opartym na Destrukcji, nie ponosząc porażki w 11 grach jako Varus i Jhin. Jako jedyny z obecnych członków SuperMassive, który nie wziął udziału w Mid-Season Invitational 2016, Zeitnot po raz pierwszy pojawi się przed międzynarodową widownią w Brazylii. Jeśli chce przebić się przez rundę wstępną i dotrzeć dalej, będzie musiał oprzeć grę na nowym zestawie bohaterów.","pt_BR":"<p>Berkay \"Zeitnot\" Aşıkuzun é o carregador da SuperMassive eSports. Depois de jogar ao lado de Naru na Dark Passage no início de 2015, Zeitnot entrou para a SuperMassive no início da temporada de 2017. Durante a temporada regular, ele teve êxito na meta da Letalidade, conseguindo sair invicto em 11 jogos como Varus e Jhin. Ele é o único membro atual da SuperMassive que não participou do Mid-Season Invitational 2016 e fará sua primeira aparição internacional no Brasil. Ele vai precisar se virar com um novo conjunto de Campeões se quiser passar pela Fase de Entrada e além.</p>","tr_TR":"Berkay \"Zeitnot\" Aşıkuzun Şampiyonluk Ligi’ndeki en yetenekli nişancılardan biri. Kısa süreli Ahraz Gaming macerası dışında uzun yıllar HWA’da kalan Zeitnot kendini Şampiyonluk Ligi’nin en korkulan nişancılarından biri olarak kanıtladı. HolyPhoenix sonrası nişancı rolünde sıkıntı yaşayan Dark Passage’a transfer olan Zeitnot kısa sürede burada da yeteneklerini sergilemeye başladı. Kariyerinin en başarılı yıllarını Dark Passage formasıyla geçiren Zeitnot, son olarak 2016 TBF Şampiyonu olarak 2016 IWCQ’ya katıldı ve 2016 IWCA’da da nişancı pozisyonunda ülkemizi temsil etti. Geçtiğimiz mevsimde BAUSuperMassive eSports’un 5 yerli isimli kadrosunda yer alan Zeitnot şimdiye kadarki en iyi mevsimini geçirdi.\n <br><br>\nBeraber oynadığı Dumbledoge’un ayrılması ve pek fazla tecrübesi olmayan destek Tolerant’ın gelmesiyle Zeitnot için yepyeni bir macera başlıyor. Kendini çoktan kanıtlamış nişancı bu zorlukları rahatlıkla aşacaktır ve MSI ön elemelerinde sergilediği herkesi büyüleyen performansa kaldığı yerden devam edecektir.\n"},"foreignIds":{"ESPORTSTMNT03":"200001255","TRLT3":"200000030","ESPORTSTMNT04":"200001536"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1421,"slug":"rogu","name":"Rogu Sama","firstName":"Burak","lastName":"Eryol","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rogu-1z5rl0lr.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":"1994-06-13","createdAt":"2016-08-22T15:03:26.000Z","updatedAt":"2017-07-21T15:07:51.000Z","bios":{"en_US":"","tr_TR":"Burak \"Rogu sama\" Eryol Şampiyonluk Ligi’nin en tecrübeli destek oyuncularından biri. Profesyonel oyuna BPI ve ANT Gaming takımlarıyla başlasa da Oyunhizmetleri’yle Şampiyonluk Ligi’ne dönene kadar bir süre üst ligden uzak kaldı. Oyunhizmetleri’nde gösterdiği performans sonrası Ruvelius ile Immortoru’nun Şampiyonluk Ligi’nin en korkulan ikililerinden biri haline gelmesini sağlayan gizli kahraman Rogu sama, bir sonraki mevsim Beşiktaş.Oyunhizmetleri’nin KMF oynayan kadrosunda yer aldı. SL i-League turnuvasında da birinci olarak ülkemizi başarıyla temsil eden Beşiktaş.Oyunhizmetleri, aynı başarıyı Şampiyonluk Ligi’nde gösteremedi. Bir sonraki mevsim, mevsim finallerinde Dark Passage’a transfer olan Rogu sama özellikle TBF’de rakip destek Dumbledoge’u kilitleyerek takımının şampiyon olmasında büyük katkı sahibi oldu. Geçtiğimiz mevsim aynı performansı gösteremeyen Rogu bu mevsim Galakticos formasıyla ter dökecek.\n <br><br>\nYeni mevsimde Zeitnot, HolyPhoenix ve Ruve sama yerine tecrübesiz bir oyuncu olan meân ile oynayacak olan Rogu sama’nın artık işi daha zor. Bu mevsimde tank destek şampiyonlar metada kendisine yer bulursa Rogu sama’nın işi oldukça kolaylaşacaktır. Bu mevsime en iddialı kadrolardan biriyle giren Galakticos eğer TBF’de yer almak istiyorsa desteklerinin sergileyeceği performansa çok ihtiyaçları olacak.\n"},"foreignIds":{"ESPORTSTMNT03":"200001237"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1864,"slug":"tolerant","name":"Tolerant","firstName":"Barış","lastName":"Çepnioğlu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tolerant-9q5v56mb.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-04-14T10:25:19.000Z","updatedAt":"2017-07-21T14:38:44.000Z","bios":{"en_US":"","tr_TR":"Almanya doğumlu Türk oyuncu, profesyonel arenaya adım atalı henüz bir buçuk ay olmasına karşın en prestijli iki Türk ekibinin formasını giymeyi başardı. İlk olarak Dark Passage.BKM Express’te HolyPhoenix’in yanında görev alan genç destek, şimdi ise BAUSuperMassive’de Zeitnot’un partneri olacak.<br><br>\nTolerant’ın doldurması gereken boşluk da, üzerindeki sorumluluk da çok büyük. Takımın yıldız desteği Dumbledoge’un yerini alacak genç oyuncunun sürekli selefiyle karşılaştırılması kaçınılmaz gibi duruyor. Her ne kadar BAUSuperMassive’in makro oyununa sağlayacağı uyum merak konusu olsa da, en iyilerle çalışma fırsatına sahip olamsı Tolerant'ın uyum sürecini hızlandıracaktır."},"foreignIds":{"ESPORTSTMNT03":"200001460","ESPORTSTMNT04":"200002914"},"socialNetworks":{},"champions":[],"liveGameTeam":199},{"id":1925,"slug":"secaf","name":"Secaf","firstName":"Sercan","lastName":"Çevikoğlu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/secaf-i0wakbms.png","hometown":"Türkiye","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-05-29T04:37:58.000Z","updatedAt":"2017-07-21T14:43:49.000Z","bios":{},"foreignIds":{"ESPORTSTMNT04":"200002635"},"socialNetworks":{},"champions":[],"liveGameTeam":199}],"scheduleItems":[{"id":"AVuhncX_oUG4HPFjOKNt","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:6a828dfc-2b01-4bde-a90e-e2d9357b9eb0","scheduledTime":"2017-04-28T21:00:00.721+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:2aa734c2-34cc-4dca-b12c-8b6d6bc54421","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"6a828dfc-2b01-4bde-a90e-e2d9357b9eb0","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"2aa734c2-34cc-4dca-b12c-8b6d6bc54421","league":"10"}],"gameIdMappings":[{"id":"c061d0c5-9a62-4937-acd0-ceae46d61c45","gameHash":"4c02d3726a3ee430"}],"videos":[{"id":6696,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:c061d0c5-9a62-4937-acd0-ceae46d61c45","source":"https://www.youtube.com/embed/1SJxY7KlhZ4","createdAt":"2017-04-28T22:32:22.000Z","updatedAt":"2017-04-28T22:32:22.000Z","game":"c061d0c5-9a62-4937-acd0-ceae46d61c45"},{"id":6698,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:c061d0c5-9a62-4937-acd0-ceae46d61c45","source":"https://www.youtube.com/embed/aUqEr373Sqc?wmode=transparent","createdAt":"2017-04-28T23:24:21.000Z","updatedAt":"2017-04-28T23:24:21.000Z","game":"c061d0c5-9a62-4937-acd0-ceae46d61c45"},{"id":6702,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:c061d0c5-9a62-4937-acd0-ceae46d61c45","source":"https://www.youtube.com/watch?v=jY-5PJe6R_A&wmode=transparent","createdAt":"2017-04-29T00:37:46.000Z","updatedAt":"2017-04-29T00:37:46.000Z","game":"c061d0c5-9a62-4937-acd0-ceae46d61c45"},{"id":6930,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:c061d0c5-9a62-4937-acd0-ceae46d61c45","source":"https://www.youtube.com/embed/nCnyVJyg8pA","createdAt":"2017-05-29T03:35:15.000Z","updatedAt":"2017-05-29T03:35:15.000Z","game":"c061d0c5-9a62-4937-acd0-ceae46d61c45"}],"htmlBlocks":[],"match":{"id":"6a828dfc-2b01-4bde-a90e-e2d9357b9eb0","name":"SUP-vs-DW","position":2,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"},{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],"games":{"c061d0c5-9a62-4937-acd0-ceae46d61c45":{"id":"c061d0c5-9a62-4937-acd0-ceae46d61c45","name":"G1","generatedName":"DW|SUP|G1|6a828dfc2b014bdea90e","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"},{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],"standings":{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1496028909352,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493426458094,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493422105837,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493418933656,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493418707493,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120120","gameRealm":"TRLT3","platformId":"TRLT3:120120","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1496028909352,"source":"bestOf","history":[{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493426458094,"source":"bestOf","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493422105837,"source":"bestOf","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493418933656,"source":"bestOf","closed":true},{"result":[[{"roster":"885b7fdb-c6a6-47cb-98e0-1ae83f63d397"}],[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}]],"timestamp":1493418707494,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c":0,"885b7fdb-c6a6-47cb-98e0-1ae83f63d397":1}}}