{"teams":[{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]},{"id":169,"slug":"echo-fox","name":"Echo Fox","guid":"be70e203-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/echo-fox-ejngzoa3.png","acronym":"FOX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-04T23:27:05.000Z","updatedAt":"2017-08-06T19:57:02.000Z","bios":{"fr_FR":"<p>Que se passe-t-il quand une figure médiatique du basketball nord-américain s'intéresse aux LCS ? Ça donne Echo Fox. </p>\n\n<p>L'idée pourrait sembler saugrenue et l'aurait sans aucun doute été il y a deux ans. Oui mais voilà, l'e-sport continue de se développer, notamment grâce à League of Legends, et Echo Fox en est une preuve éclatante. Cette nouvelle équipe qui vient remplacer Gravity Gaming dans les LCS NA est en effet la propriété de Rick Fox, ancien joueur de la NBA notamment pour les Los Angeles Lakers, et acteur à ses heures perdues. Rien que ça ! </p>\n\n<p>Acheter une place en LCS c'est bien, mais ça ne suffit pas. Encore faut-il aligner une équipe compétitive et donc attirer des joueurs de haut niveau. C'est ce qu'a tenté de faire Echo Fox, avec un résultat qui soulève sans doute autant de questions que d'espoirs circonspects chez les fans d'e-sport en général et de League of Legends en particulier. Echo Fox est charpentée autour de son mid laner Henrik « Froggen » Hansen, légende du jeu et un nom qui attirera sans aucun doute le public. Mais le joueur européen a-t-il encore le niveau pour porter son équipe ? Et ses coéquipiers ont-ils les reins assez solides pour l'épauler efficacement ? Que ce soit le joueur coréen de file solo Jeong-hun « kfo » Park en voie du haut ou les trois nord-américains qui complètent l'effectif, les nouveaux compagnons de Froggen manquent pour le moment d'expérience. </p>\n\n<p>Cela peut signifier l'arrivée d'une nouvelle vague de jeunes joueurs bien décidés à faire des étincelles. Cela peut aussi être une saison d'apprentissage difficile qui aboutira à un nouveau passage dans les tréfonds du classement des LCS pour Froggen. Quoiqu'il en soit, les dés sont jetés et Rick Fox va pouvoir regarder ses joueurs depuis le banc tout au long des LCS NA. </p>","en_US":"<p>You'd have trouble finding an easier team to root for than Echo Fox. Given the team's many struggles since joining the league in 2016, including narrowly avoiding relegation in the 2017 NA LCS Spring Promotion tournament, another owner might have jumped ship. But former NBA star Rick Fox isn't just any other owner. His belief in his players is unwavering.</p>\n\n<p>In 2017, Fox is supplementing that belief with some new talent. Former RNG top laner Looper headlines the new additions, along with ex-P1 support Gate. Former Challenger scene jungler Akaadian also joins the team. Nobody has more faith in Echo Fox than its owner; now it's time for the players to prove that faith isn't misplaced.</p>\n\n<p>Coach: Nick \"Inero\" Smith</p>","pl_PL":"<p>Pojawienie się Echo Fox w wiosennym sezonie NA LCS 2016 to powiew świeżości wśród organizacji. Nowo powstała drużyna zastąpiła Gravity w elitarnych rozgrywkach NA LCS, więc śmiało można stwierdził, że od razu skoczyła na głęboką wodę. Ogłoszenie istnienia Echo Fox, a następnie jego składu, wzbudziło wiele emocji wśród społeczeństwa League of Legends. Wynikało to z bardzo małej ilości przecieków na temat powstającego zespołu i ujawnienia atrakcyjnych faktów tuż przed rozpoczynającym się sezonem 6. Dlatego wszyscy zainteresowani dosłownie wychodzili z siebie próbując zaspokoić swoją ciekawość.</p>\n<p>Jednak najbardziej zaskakującymi informacjami dotyczącymi zespołu Echo Fox, były wiadomości o jego właścicielu. Nabywcą miejsca Gravity w NA LCS była powszechnie znana w Ameryce Północnej gwiazda NBA – Rick Fox. Wielu graczy od razu zadało sobie pytanie: jak to się stało, że znana w skali światowej osobistość, tak się zainteresowała grą komputerową. Wyjaśnienia można się doszukać w wielkim uczuciu jego syna, Kyle’a Foxa, do drużyny Counter Logic Gaming. Wkrótce młodemu fanowi udało się zarazić pasją swojego sławnego ojca. W ten sposób trzykrotny mistrz NBA dowiedział się o League of Legends i bardzo szybko również pokochał tą rozrywkę. Można było spotkać Ricka Foxa wśród widzów na wielu wydarzeniach związanych z League of Legends, jak na przykład rozgrywki NA LCS. Rozmawiał z zawodnikami, w szczególności dużo z graczami Counter Logic Gaming, dodając im otuchy przed meczami. Te czynniki doprowadziły sławę do kroku, którego nikt się nie spodziewał – wykupił drużynę Gravity i przemianował ją na Echo Fox. W wywiadzie dla Breitbart powiedział: „Pragnienie, skupienie, poświęcenie i etyka, które widziałem u esportowych atletów przypominają mi presję rywalizacji kiedy ja goniłem za swoją karierą w koszykówkę. Moja pasja została wsparta przez społeczeństwo, jako właściciel drużyny Echo Fox zamierzam popierać jej zawodników w taki sam sposób.”</p>\n<p>Rick Fox zadbał żeby jego drużyna nie została na wstępie zdominowana przez zahartowanych weteranów. Oprócz młodych i obiecujących talentów znalazł w składzie miejsce dla poważanego weterana - Henrika \"Froggen\" Hansena. W wizji właściciela Echo Fox połączenie świeżych pomysłów w wydaniu debiutantów i doświadczenia starych wyjadaczy to przepis na sukces. Uwagę przyciąga także nazwa organizacji – wiadomo, że lisia część pochodzi od nazwiska założyciela, lecz pojawiło się wiele teorii na temat dodatku w postaci słowa „Echo”. Wiele osób doszukało się w tej chwytliwej nazwie nawiązania do międzynarodowego alfabetu lotniczego. Według tej teorii „Echo Fox” to skrócona nazwa fonetyczna dwóch następujących po sobie liter – E i F, czyli w rozwinięciu „Echo Foxtrot”.</p>\n","de_DE":"Es gibt kaum ein Team, das man lieber anfeuert als Echo Fox. Das Team hat seit dem Ligabeitritt 2016 schwer zu kämpfen. Der knapp verhinderte Abstieg im Aufstiegsturnier für die NA LCS 2017 ist nur ein Beispiel dafür, und ein anderer Besitzer hätte das sinkende Schiff sicher verlassen. Aber der ehemalige NBA-Star Rick Fox ist kein Besitzer wie jeder andere. Der Glaube an seine Spieler ist unerschütterlich.\n</p>\n2017 untermauert er diese Einstellung mit einigen neuen Talenten. Looper, der ehemalige Top-Laner von RNG, führt die Neuzugänge an, gemeinsam mit Gate, dem Ex-Supporter von P1. Akaadian, der früher in der Challenger Series als Jungler tätig war, schließt sich ebenfalls dem Team an. Niemand glaubt mehr an Echo Fox als ihr Besitzer, und jetzt liegt es an den Spielern, zu beweisen, dass sein Vertrauen nicht ungerechtfertigt ist.\n</p>\nCoach: Tim „Timkiro“ Cho\n"},"foreignIds":{},"players":[70,191,246,363,607,774,820,1096,1359],"starters":[191,363,774,820,1359],"subs":[70,246,607,1096]}],"players":[{"id":70,"slug":"looper","name":"Looper","firstName":"Hyeongseok","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/looper-agve6x52.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-01-19T22:02:44.000Z","bios":{"en_US":"<p>Hyeongseok \"Looper\" Jang is the latest Korean top laner to make his LCS debut. The ex-Royal Never Give Up starter is a veteran of the scene, with a career that began back in 2013. Originally known for an aggressive playstyle, Looper has evolved into a multi-faceted laner. The former LPL champion is just as capable of tanking on Maokai as he is carrying on Irelia.</p>\n\n<p>Looper brings his many talents to Echo Fox in 2017. The team hopes to have more success with a Korean import this time around after another one, KFO, struggled as their top laner. Looper has the track record of success that Echo Fox sorely needed. At 23, he's one of the older players in the LCS -- but don't let his age fool you. He's still got plenty in the tank, and just one destination in mind: victory.</p>","es_AR":"<p>Hyeong-seok \"Looper\" Jang se posiciona en la cima como el carrilero superior de RNG y, mientras que otros carrileros superiores son alabados por su estabilidad y consistencia, Looper tiene una historia de ser un poco más agresivo. Fue originalmente conocido por su Singed en el 2013, pero Looper ha evolucionado y ahora es un carrilero multifacético. Eligió a Trundle y Rumble durante la temporada de verano de la LPL, pero es más que capaz de ramificarse, como fue demostrado con su habilidad para resistir con Moakai o acarrear con Irelia cuando es necesario. Con 23 años y con una carrera que data desde el 2013, Looper es uno de los jugadores más veteranos en el Mundial, pero no permitas que su vasta carrera te engañe. Es un maestro al que hace ya tiempo se le quitaron los nervios. Su objetivo está en la victoria.</p>","fr_FR":"<p>Hyeong-seok « Looper » Jang est un vétéran d'élite de la voie du haut. Ayant affronté la crème des joueurs d'Asie et remporté des championnats en Corée et en Chine, il est tout à fait capable d'écraser ses adversaires avec des champions tankys comme Poppy et Nautilus.</p>\n\n<p>Looper est bien souvent en première ligne pour RNG : il possède un réel talent pour utiliser la Téléportation et créer des situations favorables à son équipe, qui peut alors écraser ses adversaires lors d'un combat d'équipes ou contrer une rotation adverse en prenant les bonnes décisions.</p>\n\n<p>Alors qu'il jouait à l'origine un rôle de soutien avec Samsung White, il a su s'adapter au fil des différents patchs et constitue désormais un pilier central du line-up de RNG. C'est lui qui porte la lourde charge d'être un carry et une menace majeure au sein de l'équipe, et il est parfaitement synchronisé avec Mata. Vu le danger permanent qu'il incarne grâce à sa maîtrise de la Téléportation, ses adversaires réfléchiront toujours à deux fois avant de s'élancer hors de leur base.</p>\n\n<p>Ses performances ne sont d'ailleurs pas passées inaperçues : il a été nommé huit fois pour le titre de MVP lors du segment de printemps des LPL.\n</p>","es_ES":"<p>Hyeong-seok \"Looper\" Jang va con la cabeza bien alta como el jugador de la calle superior de RNG y, aunque otros de sus análogos son elogiados por la estabilidad y la regularidad, Looper tiene fama de ser un poco más agresivo. Era conocido inicialmente por su Singed, allá por 2013, pero desde entonces se ha transformado en un jugador polifacético. Añadió a Trundle y Rumble a su plantel durante la temporada de verano de la LPL, pero es más que capaz de expandirse, ya que ha demostrado su capacidad de hacer de tanque con Maokai o de ganar la partida con Irelia cuando haga falta.</p>\n\n<p>Con 23 años y una carrera que data de 2013, Looper es uno de los jugadores más adultos del Mundial, pero no dejéis que su larga trayectoria os engañe. Es un maestro que se deshizo de los nervios hace tiempo. Y ahora se concentra en la victoria.</p>","de_DE":"Hyeongseok „Looper“ Jang ist der neueste koreanische Top-Laner, der sein LCS-Debüt gibt. Das ehemalige Mitglied von Royal Never Give Up ist ein Veteran der Szene, der seine Karriere 2013 startete. Er wurde für seinen aggressiven Spielstil bekannt, aber seither hat sich Looper zu einem facettenreichen Top-Laner entwickelt. Der ehemalige Champion der LPL beherrscht es genauso gut, mit Maokai Schaden aufzusaugen wie mit Irelia Spiele im Alleingang zu entscheiden.\n</p>\nLooper unterstützt 2017 Echo Fox mit seinen vielen Talenten. Das Team hofft, dass sie mit diesem koreanischen Import mehr Erfolg haben, nachdem sich der letzte Koreaner, KFO, als Top-Laner nicht durchsetzen konnte. Loopers Erfolgsbilanz ist genau das, was Echo Fox so dringend braucht. Mit 23 Jahren ist er einer der älteren Spieler der LCS – aber man sollte sich nicht von seinem Alter täuschen lassen. Er hat noch immer genug Reserven und nur ein Ziel vor Augen: den Sieg.\n","pl_PL":"<p>Hyeong-seok „Looper” Jang jest doświadczonym weteranem górnej alei. Mając na koncie walki z najlepszymi zawodnikami z Azji, wygrywając mistrzostwa w Korei i Chinach, doskonale odnajduje się w tłuczeniu swoich przeciwników wytrzymałymi bohaterami, takimi jak Poppy czy Nautilus.</p>\n\n<p>Looper z reguły przewodzi RNG, ponieważ jest jednym z najlepszych graczy pod względem używania Teleportacji, aby tworzyć korzystne sytuacje dla swojej drużyny podczas walk drużynowych, lub przechytrzyć przeciwników w grach skupiających się na macro.</p>\n\n<p>Z początku miał bardziej wspierającą rolę podczas gry w Samsung White, ale przyzwyczajał się do zmian w różnych patchach i teraz jest głównym filarem składu RNG. Jego zadaniem w drużynie jest stanowienie zagrożenia dla wrogich prowadzących. Doskonale zgrywa się z Matą, a jego mistrzowskie stosowanie Teleportacji sprawia, że jego przeciwnicy muszą poważnie się zastanowić, zanim opuszczą swoją bazę.</p>\n\n<p>Jego wyniki nie zostały niezauważone, ponieważ był ośmiokrotnie nominowany na najlepszego gracza podczas wiosennego splitu LPL.</p>\n","pt_BR":"<p>Hyeong-seok \"Looper\" Jang marca presença como jogador do topo da RNG e enquanto outros topos são elogiados pela consistência e estabilidade, Looper tem um histórico de ser um pouco mais agressivo. Ele ficou conhecido inicialmente por seu Singed em 2013, mas Looper evoluiu muito desde então e agora é um jogador muito versátil. Ele escolheu Trundle e Rumble na etapa de verão da LPL, mas pode perfeitamente ampliar seu leque, pois já mostrou suas habilidades de tanque com Maokai e de carregador com Irelia quando foi preciso. Com 23 anos e uma carreira que remonta a 2013, Looper é um dos jogadores mais velhos do Mundial, mas não deixe que sua longa carreira o engane. Ele é um mestre que não se abala facilmente. Seu foco está apenas na vitória.</p>"},"foreignIds":{"drupalId":"683","TRLH1":"200000207","TRLH2":"200000111"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":191,"slug":"froggen","name":"Froggen","firstName":"Henrik","lastName":"Hansen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/froggen-ecvbey01.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-01-19T22:02:25.000Z","bios":{"en_US":"<p>One of the strongest control mage players in the world, Henrik “Froggen” Hansen is legendary in the mid lane on his favorite bird, Anivia. After rising to fame with CLG.eu utilizing a slow and methodical playstyle, Froggen and his squad went through a flurry of team and roster changes. From Evil Geniuses to Alliance, and then from Alliance to Elements, Froggen has had a tumultuous few years.</p>\n\n<p>After keeping Echo Fox from relegation by sheer force of will, Froggen has a new opportunity with 2017's retooled roster. With a former LPL champion in the top lane and a new jungler to gank his lane, the LCS icon is in a great spot to succeed. Now he just has to prove he's still got it after all these years. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">전장 장악형 마법사를 세계에서 가장 잘하는 선수 중 하나인 Henrik “Froggen” Hansen은, 애니비아 플레이로 오래 전부터 전설이 된 선수입니다. CLG.eu 시절 느리지만 정교한 플레이 스타일로 명성을 얻은 Froggen 선수는, 동료들과 함께 여러 번 팀을 바꾸었습니다. Evil Geniuses에서 Alliance로, 그리고 다시 Elements로, 지난 몇 년 간 평탄치 않은 시간을 보냈죠. </p>\n<p style=”font-family:”나눔고딕”;\">2015 유럽 LCS 스프링, 서머 스플릿에서 연속해서 7위를 기록한 Froggen 선수와 Elements가 세계 최고 수준의 팀들과 경쟁하려면 뭔가 근본적인 문제를 해결해야 한다는 사실은 자명해 보입니다. 하지만 Froggen 선수의 과거 활약을 생각해보면 아직 그에 대한 기대를 내려놓을 때는 아닙니다. 이번 올스타 대회가 부활의 신호탄을 올릴 수 있는 절호의 기회일지도 모르죠. </p>\n","fr_FR":"<p>Anivia le pigeon bleu. Est-il vraiment besoin de présenter Henrik « Froggen » Hansen ? Le Danois fait partie des quelques légendes de League of Legends encore en activité. Membre de la trilogie originale des dieux européens de la voie du milieu en saison 2, il déchaîne les foules depuis près de 4 ans. Considéré aujourd'hui encore comme le meilleur joueur d'Anivia au monde, Froggen porte avec lui le mythe de CLG.EU et des affrontements mythiques qu'il a menés contre Moscow 5 tout au long de la saison 2.</p>\n\n<p>Mais depuis, l'eau a coulé sous les ponts et le sort n'a pas été favorable au joueur. Dès la saison 3 et l'apparition des LCS, les anciens de CLG.EU ont souffert et laissé d'autres joueurs remporter titres et participation aux championnats du monde. Sentant que des changements étaient nécessaires, le joueur a alors construit autour de lui une équipe annoncée avant le début des LCS EU 2014 comme la première « superteam » de League of Legends. Malheureusement cette équipe construite pour tout gagner a enchaîné l'excellent et le bien moins bon, aussi bien capable de remporter un titre de champion des LCS EU lors du segment d'été que d'être la première équipe européenne à perdre contre des brésiliens lors du Championnat du monde 2014.</p>\n\n<p>La situation du Danois ne s'est pas arrangée en 2015 : il s'est retrouvé bien malgré lui à lutter non pas pour les titres mais pour éviter de se retrouver en tournoi de relégation des LCS EU. Pour la première fois de sa carrière, les critiques d'une partie du public ont été aussi sonores que l'enthousiasme de ses fans. L'ancien recordman du nombre de minions tués en un minimum de temps en compétitif s'est retrouvé considéré par certains comme un joueur trop passif et incapable de prises de décisions. Pire, l'arrivée en fanfare d'une nouvelle génération de joueurs professionnels a bousculé un peu plus chaque jour son statut de mid laner de classe mondiale.</p>\n\n<p>Alors Froggen a fait le grand saut, il est parti en NA, découvrir encore une nouvelle équipe et un nouvel environnement. Un nouveau défi, même s'il ne sera pas dépaysé de retrouver son vieil adversaire Alexey « Alex Ich » Ichetovkin dans les LCS NA. Un dernier défi peut-être aussi, pour celui qui doit plus que jamais prouver qu'il est toujours un monstre du jeu et pas seulement une ancienne gloire dépassée par la concurrence.</p>\n","pl_PL":"<p>Mało kto z europejskich graczy nie słyszał o Henriku \"Froggen\" Hansenie. Duńska ostoja doskonałości na mid-lanie imponuje fanom od pierwszego sezonu. Do grudnia 2011 próbował swojego szczęścia w różnych drużynach, z czego najcieplej wspomina poznanie przyjaciela – Mike’a \"Wickd\" Petersena. Wraz z nim pod koniec 2011 roku trafił do zespołu, gdzie spełniło się wiele z jego marzeń. W Counter Logic Gaming Europe Henrik spędził swój najbardziej owocny okres, konkurując na arenie światowej z najlepszymi ówczesnymi drużynami. W 2012 roku wygrał szereg poważnych i mniejszych międzynarodowych turniejów, lecz największym osiągnięciem było dostanie się na Mistrzostwa Świata drugiego sezonu. W związku z wejściem na arenę azjatyckich zespołów, drużyna CLG EU nie była faworytem, lecz udało im się wszystkich zaskoczyć. Nie tylko podołała wyjściu z grupy, ale również rozgromiła najstarszy chiński zespół Team WE w ćwierćfinale. W półfinale ekipie Henrika nie powiodło się tak dobrze, chociaż wygrali jeden mecz z trzech. Trzecia pozycja ex aequo na takim wydarzeniu była bardzo nobilitująca dla całego CLG EU. </p>\n<p>Wkrótce po tej imprezie drużyna została przemianowana na Evil Geniouses, lecz skład pozostał ten sam. Jednak w międzyczasie na profesjonalnej scenie pojawiło się wiele nowych talentów i konkurencja radykalnie urosła w siłę. W związku z czym „Froggen” nie odniósł tak oszałamiających sukcesów jak w poprzednim sezonie, nawet wiele osób nazwało wyniki EG w tym okresie przeciętnymi. Dlatego Henrik w grudniu 2013 roku opuścił wraz z przyjacielem Mike’iem bezpieczną przystań i w poszukiwaniu sukcesu stał się częścią nowej organizacji – Alliance. W niej osiągnął zdecydowanie więcej niż w poprzedniej drużynie, ponieważ po poznaniu własnych możliwości, w wiosennym sezonie EU LCS 2014, Alliance sięgnęło po złoto. W okresie letnim 2014 roku zajęła pierwsze miejsce w regularnych rozgrywkach, a następnie potwierdziła swoją dominację wygrywając również baraże. W ten sposób „Froggen” zagwarantował sobie udział w kolejnych Mistrzostwach Świata, tym razem sezonu 4. Niestety Alliance nie udało się wyjść z grupy, więc wyczyn z 2012 roku nie został powtórzony. Po tym wydarzeniu organizacja została przemianowana na Elements i zmieniła skład personalny zespołu. Jednak zmiany tylko pogorszyły sytuację Henrika, ponieważ jego drużyna w całym piątym sezonie wypadła przeciętnie, dwukrotnie zajmując 7 miejsce. Jak większość profesjonalnych graczy marzy o pokazaniu się na Mistrzostwach Świata, więc doszedł do wniosku, że musi podjąć radykalne kroki. Pod koniec roku 2015 przeniósł się do Ameryki Północnej żeby dołączyć do nowo powstałego zespołu Echo Fox – biorącego udział w wiosennym sezonie NA LCS 2016.</p>\n<p>„Froggen” osiągnął absolutne mistrzostwo w grze Anivią. W ciągu paru lat na scenie esportowej zyskał reputację najlepszego gracza tą postacią. Dlatego został wybrany do uczestnictwa w imprezie All-Stars Paris przez fanów po to, żeby zagrał Kriofeniksem. Osobistym wyczynem Henrika potwierdzającym jego masterię jest zwycięstwo z powszechnie znanym Lee’iem \"Faker\" Sang-hyeokiem. Zwyciężył z nim w pojedynku 1 vs 1 na wydarzeniu All-Stars Los Angeles 2015. Na tym nie kończą się prywatne sukcesy duńskiego mid-lanera – przez długi okres czasu był rekordzistą w zdobytej farmie w regularnych rozgrywkach. Pobił go Karthusem, zabijając 300 stworów w 23 minuty i 10 sekund.</p>","de_DE":"Mit seinem Lieblingsvögelchen Anivia hat sich Henrik „Froggen“ Hansen zu einem legendären Mid-Laner gemausert, der zu den stärksten Spielern der Welt gehört, die Magier mit Massenkontrolleffekten spielen. Nachdem er mit CLG.eu durch seinen langsamen und methodischen Spielstil zu Ruhm gekommen war, haben Froggen und seine Truppe eine Reihe an Mannschafts- und Aufstellungsänderungen durchgemacht. Froggen hat zwischen den Evil Geniuses, Alliance und Elements ein paar turbulente Jahre erlebt.\n</p>\nNachdem er Echo Fox durch reine Willenskraft vor dem Abstieg bewahren konnte, bietet sich 2017 mit der neuen Aufstellung eine neue Chance für ihn. Mit einem ehemaligen Champion der LPL auf der oberen Lane und einem neuen Jungler, der ihn auf der Lane unterstützt, befindet sich die LCS-Legende in einer guten Ausgangsposition. Jetzt muss er nur noch zeigen, dass er es nach all den Jahren immer noch drauf hat. \n","es_ES":"<p>\nHenrik “Froggen” Hansen es uno de los mejores jugadores del mundo con magos de control, y su Anivia mid es legendaria. Froggen dio el salto a la fama en CLG.eu gracias a su estilo de juego lento y metódico, y después de aquello tanto él como sus compañeros sufrieron una gran cantidad de cambios de equipo y plantilla. De Evil Geniuses a Alliance, y después a Elements. Froggen ha tenido unos años ajetreados. \n</p>\n<p>\nTras quedar en séptimo puesto en los splits de la LCS de 2015 de primavera y verano, está claro que Froggen y el resto de EL tienen que solucionar ciertos aspectos fundamentales antes de estar preparados para vencer a los mejores oponentes. Sin embargo, visto el rendimiento de Froggen, pensamos que no todo está perdido. El evento All-Star 2015 puede ser la ocasión perfecta para el resurgimiento de Froggen. \n</p>"},"foreignIds":{"drupalId":"80","TRLH1":"200000209","TRLH2":"200000113"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":363,"slug":"keith","name":"Keith","firstName":"Yuri","lastName":"Jew","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keith-gmei2hih.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-05-24T21:45:13.000Z","bios":{"en_US":"Yuri \"Keith\" Jew has called himself \"the motivator.\" He was the player Liquid and TSM brought in to nip at the heels of an underperforming starter. He finally earned a starting role with Echo Fox in the 2016 NA LCS Summer Split, but he struggled to find his footing. Fortunately, he showed up when it counted, helping Echo Fox avoid relegation against NRG Esports.\n</p>\n<p>After a rough spring split in the bot lane with his new support Gate, Keith will look to bounce back this summer. While his positioning has been suspect, he's proven willing to play a more supportive role as ADC. With playmakers like Akaadian and Froggen on your team, sometimes all it takes is one Enchanted Crystal Arrow for Echo Fox to take a victory. </p>\n","fr_FR":"<p>Yuri « KEITH » Jew est le roi des « memes » et des réactions humoristiques sur internet. C'est aussi un carry AD nord-américain dont tout le monde reconnaît le talent et le titulaire d'Echo Fox sur ce rôle. Mais malgré quelques apparitions dans les LCS NA au cours de la saison 2015, KEITH est pour le moment connu du grand public avant tout pour sa personnalité, particulièrement aux États-Unis et sur Reddit.</p>\n\n<p>Pourtant, ce joueur d'à peine 18 ans n'est pas passé inaperçu lors de son bref passage en LCS NA, bien au contraire. Souvenez-vous, c'était au début du segment de printemps 2015 et tous les yeux étaient tournés vers Team Liquid après que l'organisation eut réussi à faire venir l'ancien champion du monde Chae « Piglet » Gwang-jin en Amérique du Nord. Mais hélas, impossible d'obtenir un visa pour le Coréen avant le début de la saison. C'est là qu'est entré en scène celui qui s'appelait alors KEITHMCBRIEF (oui, tout en majuscules!), engagé comme remplaçant pour les premiers matchs de la saison. Une pression énorme ? Pas pour le jeune carry AD, auteur de performances éclatantes lors de ses premiers matchs en tant que professionnel, avec deux victoires à la clé. Mieux encore, en raison des performances décevantes de Piglet lors des semaines suivant son arrivée, KEITH a eu le plaisir d'être rappelé deux semaines en cours de saison par Team Liquid. Pour prendre, un temps, la place d'un ancien champion du monde. Une sacrée carte de visite, d'autant plus quand on sait qu'il a réalisé à cette occasion des matchs plus qu'honorables, avec notamment une fiche de 9/1/12 sur Caitlyn. Après un retour infructueux en Challenger series, le joueur a de nouveau fait office de joker de luxe des LCS NA en remplaçant cette fois Jason « WildTurtle » Tran pour un match.</p>\n\n<p>Cette saison, c'est en tant que titulaire d'une toute nouvelle équipe que le jeune joueur va retrouver et affronter ceux qu'il remplaçait hier. Toujours sans pression, mais sans nul doute avec l'envie de bien faire.</p>\n","pl_PL":"<p>\"KEITH\" zainteresował się profesjonalną sceną w połowie 4 sezonu. Wcześniej grał w inne tytuły typu MOBA, lecz ostatecznie najbardziej spodobało mu się League of Legends, dlatego w maju 2014 roku dołączył do Team Gyrations. Tam miał okazję nabrać doświadczenia i poznać przyszłe sławy, takie jak: „NintendudeX” I “Adrian”. Dopiero w kolejnym zespole zaczął odnosić widoczne sukcesy, gdyż będąc w Team LoLPro zagrał w turnieju rozszerzającym skład NA LCS. Szansę Yuriego na coś więcej zostały przekreślone przez Team Coast, który pokonał jego drużynę we wczesnym stadium wydarzenia. Mogło to wynikać z tego, że \"KEITH\" w Team LoLPro zajmował pozycję supporta, a jego główną rolą jest AD Carry. </p>\n<p>W styczniu 2015 roku został zrekrutowany do Team Liquid Academy, co dało mu niesamowite możliwości rozwoju. Pierwszą okazję dostał kiedy na początku wiosennego sezonu 2015 główny AD Carry Team Liquid, „Piglet”, miał problemy z wizą. W związku z tym Yuri został poproszony o wystąpienie jako substytut w regularnym sezonie NA LCS. To był milowy krok w jego karierze profesjonalnego zawodnika, gdyż okazało się, że doskonale sobie radzi wśród najlepszych graczy. Już w pierwszym tygodniu wygrał z takimi potęgami jak Team Impulse i Counter Logic Gaming. Po powrocie brakującego AD, \"KEITH\" grał w szeregach Team Liquid Academy w Challenger Series, niestety bez większych sukcesów. Została mu również dana szansa na miejsce w głównym składzie Team SoloMid, jednak zagrał tylko w jednym tygodniu, po czym organizacja zdecydowała się wrócić do poprzedniego AD Carry. </p>\n<p>Ulubionym bohaterem Yuriego bez wątpienia jest Lucian. Grając głównie Klerykiem Broni siał zniszczenie wśród nieprzyjaciół, dzięki czemu szybko znalazł się w Kręgu Pretendenta. W profesjonalnych rozgrywkach nie dane mu było zagrać ukochaną postacią, lecz mimo tego poradził sobie śpiewająco. Reprezentując Team Liquid podczas NA LCS zaskoczył widzów swoimi zdolnościami w grze między innymi Corkim, Caitlyn i Kog’Mawem. Ciekawostką jest to, że pseudonim Yuriego jest pisany dużymi literami, ponieważ pragnął większej uwagi.</p>\n","de_DE":"Yuri „Keith“ Jew nannte sich selbst „der Motivator“. Er war der Spieler, den Liquid und TSM einwechselten, wenn einer der Stammspieler eine schwache Leistung ablieferte. Im Sommer-Split der NA LCS 2016 konnte er sich schließlich einen Startplatz bei Echo Fox sichern, aber er hatte Schwierigkeiten, seinen Rhythmus zu finden. Zum Glück konnte er gegen NRG Esports seine ganze Leistung abrufen und damit den Abstieg von Echo Fox verhindern.\n</p>\nIn seinem zweiten Split hat Keith erneut die Chance, als AD-Carry von Echo Fox zu glänzen. Wenn er gut mit seinem neuen Supporter Gate harmoniert, könnte die untere Lane von Echo Fox für eine Überraschung in der NA LCS sorgen. Dieses Jahr wird er nicht strauchelnde AD-Carrys ersetzen, sondern versuchen, mit seiner Mannschaft die Top-Teams der NA LCS ins Schwitzen zu bringen.\n"},"foreignIds":{"drupalId":"2999","TRLH1":"200000210","TRLH2":"200000114"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":607,"slug":"grigne","name":"Grig","firstName":"Jonathan","lastName":"Armao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/grigne-1oxeggm8.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-10T18:09:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3803","ESPORTSTMNT02":"200000546","TRLH1":"200000213","TRLH2":"200000117"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1359,"slug":"brandini","name":"Brandini","firstName":"Brandon","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brandini-3s9xhgwg.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-06-12T20:15:57.000Z","updatedAt":"2017-07-16T22:42:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000670","TRLH1":"200000616"},"socialNetworks":{},"champions":[],"liveGameTeam":169}],"scheduleItems":[{"id":"AVIUkYXHJTrHluSI14Je","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:6b55c595-043d-467a-a9d2-a07abdc8afd3","scheduledTime":"2016-01-31T23:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"3","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"6b55c595-043d-467a-a9d2-a07abdc8afd3","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"f9bf6846-4874-4a0b-b1d1-e08be45c2484","gameHash":"5611a9eaf7dc6b76"}],"videos":[{"id":712,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:f9bf6846-4874-4a0b-b1d1-e08be45c2484","source":"https://www.youtube.com/embed/xHCACp7bySk?wmode=transparent","createdAt":"2016-02-01T00:28:45.000Z","updatedAt":"2016-02-01T00:28:45.000Z","game":"f9bf6846-4874-4a0b-b1d1-e08be45c2484"}],"htmlBlocks":[],"match":{"id":"6b55c595-043d-467a-a9d2-a07abdc8afd3","name":"FOX-vs-IMT","position":38,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"},{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],"games":{"f9bf6846-4874-4a0b-b1d1-e08be45c2484":{"id":"f9bf6846-4874-4a0b-b1d1-e08be45c2484","name":"G1","generatedName":"FOX|IMT|G1|6b55c595043d467aa9d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"},{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1454283432137,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001540091","gameRealm":"TRLH1","platformId":"TRLH1:1001540091","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1454283432137,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}