{"teams":[{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]},{"id":334,"slug":"mysterious-monkeys","name":"Mysterious Monkeys","guid":"d4e897b7-40bd-4e65-94b6-1f8ae531267f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-3dr1fds.png","acronym":"MM","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-ftkht7hy.png","createdAt":"2017-05-23T21:16:39.000Z","updatedAt":"2017-07-30T12:57:14.000Z","bios":{"en_US":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","en_GB":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","es_ES":"<p>Nunca se sabe qué podemos esperar de Mysterious Monkeys. El equipo antes conocido como Misfits Academy se clasificó para la LCS EU durante el torneo de promoción de verano de 2017, en el que Giants Gaming y Origen perdieron sus puestos en la liga. Al mantener la plantilla entera de Misfits Academy, los jugadores están acostumbrados a jugar juntos. Para sobrevivir, Mysterious Monkeys tendrá que dar una vuelta a su estilo de juego ya que, contra equipos europeos sólidos, tienen todas las de perder.</p>\n\n<p>Entrenador principal: Petar \"Unlimited\" Georgiev</p>\n<p>Jefe de equipo: Grant \"Grievance\" Trousseau</p>\n","de_DE":"<p>Niemand weiß genau, was von den Mysterious Monkeys zu erwarten ist. Die Mannschaft, die früher als Misfits Academy bekannt war, hat sich im Sommer-Aufstiegsturnier 2017, bei dem Giants Gaming und Origen ihre Plätze in der Liga verloren haben, für die EU LCS qualifiziert. Da die gesamte Startaufstellung von Misfits Academy zur neuen Mannschaft gewechselt ist, sind es die Spieler gewohnt, zusammenzuspielen. Dennoch sind die Mysterious Monkeys gegen die etablierten Mannschaften klare Außenseiter, die sich weiterentwickeln müssen, wenn sie bestehen wollen.</p>\n\n<p>Cheftrainer: Petar „Unlimited“ Georgiev</p>\n<p>Mannschaftsleiter: Grant „Grievance“ Trousseau</p>\n","fr_FR":"<p>Personne ne sait trop à quoi s'attendre avec les Mysterious Monkeys. Anciennement Misfits Academy, l'équipe s'est qualifiée pour les LCS EU pendant le tournoi de promotion d'été 2017 qui a coûté leur place dans la ligue à Giants Gaming et Origen. La formation de Misfits Academy ayant été préservée, l'équipe a l'habitude de jouer ensemble. Mais en position évidente d'outsiders face à des équipes européennes établies, les Mysterious Monkeys vont devoir faire évoluer leur jeu s'ils veulent survivre.</p>\n\n<p>Entraîneur principal : Petar « Unlimited » Georgiev</p>\n<p>Responsable d'équipe : Grant « Grievance » Trousseau</p>\n","pl_PL":"<p>Nikt tak naprawdę nie wie, czego spodziewać się po Mysterious Monkeys. Drużyna znana wcześniej jako Misfits Academy zakwalifikowała się do EU LCS podczas turnieju o awans do letniego splitu 2017, który przyniósł klęskę i wypadnięcie z ligi Giants Gaming i Origen. Do drużyny przeniósł się cały skład Misfits Academy, więc zawodnicy są dobrze zgrani. Jednak powszechnie uznawani za chłopców do bicia dla pozostałych, uznanych drużyn europejskich, Mysterious Monkeys będą musieli podnieść poziom swoich umiejętności w grze, jeśli chcą przetrwać.</p>\n\n<p>Główny trener: Petar „Unlimited” Georgiev</p>\n<p>Menedżer drużyny: Grant „Grievance” Trousseau</p>\n"},"foreignIds":{},"players":[64,341,660,1333,1343,1574,1715,1863,1914,2082],"starters":[64,341,660,1333,1343],"subs":[1574,1715,1863,1914,2082]}],"players":[{"id":64,"slug":"amazing","name":"Amazing","firstName":"Maurice","lastName":"Stückenschneider","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazing-7k66ma5o.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:18.000Z","updatedAt":"2017-06-20T13:14:44.000Z","bios":{"en_US":"<p>Maurice \"Amazingx\" Stückenschneider's jungle prowess is known on both sides of the Atlantic. Amazing rose to fame when he played a key role in the Copenhagen Wolves' promotion to the EU LCS in late 2013. He then hopped across the pond and spent a brief stint in North America with Team SoloMid, helping lead the team to the 2014 World Championship Quarterfinals. At the end of the season he returned to Europe to join Origen's starting roster in the EU Challenger Series, where he easily earned a berth into the EU LCS. A lifelong basketball player, Amazing's competitive nature drives him to dominate the map and make plays for his team.</p>\n\n<p>After the struggles mounted for Origen in 2016, Amazing left the team at the end of the year and became part of the Fnatic organization shortly after. Amazing fell short of his lofty promises for Origen last year and will make sure that the same doesn’t happen this year. An explosive player on the Rift, Amazing still has the ability to take over games at a moment’s notice. A change of scenery may be just what was needed in order to rekindle Amazing’s in-game fire.</p>","de_DE":"<p>Maurice „Amazingx“ Stückenschneiders Fähigkeiten im Dschungel sind auf beiden Seiten des Atlantiks bekannt. Amazing wurde bekannt, als er beim Aufstieg der Copenhagen Wolves in die EU LCS Ende 2013 eine entscheidende Rolle spielte. Daraufhin überquerte er den großen Teich und half Team SoloMid dabei, das Viertelfinale der Weltmeisterschaft 2014 zu erreichen. Am Ende der Saison kehrte er nach Europa zurück, um Origen dabei zu helfen, die europäische Challenger Series zu gewinnen und wieder in die EU LCS aufzusteigen. Amazing spielt schon sein ganzes Leben lang Basketball und seine Wettkampfmentalität verleitet ihn dazu, die Karte zu dominieren und seine Mannschaft mit seinen Spielzügen zu unterstützen.</p>\n\n<p>Nachdem die Probleme für Origen 2016 immer größer geworden waren, verließ Amazing die Mannschaft Ende des Jahres und wechselte kurz darauf zu Fnatic. Amazing konnte seine stolzen Versprechungen letztes Jahr bei Origen nicht umsetzen und er wird alles dafür tun, dass ihm das in diesem Jahr nicht wieder passiert. Er ist in der Kluft brandgefährlich und kann Spiele von einem Augenblick zum anderen an sich reißen. Ein Tapetenwechsel könnte genau das Richtige gewesen sein, um Amazings Funken erneut zu entfachen.</p>","es_ES":"<p>Nadie pone en cuestión que Maurice ‘Amazingx’ Stückenschneider tiene un don para jugar a League of Legends al máximo nivel, pero el alemán es además un abanderado del trabajo duro, algo que aprendió de Kobe Bryant, su ídolo baloncestístico. Puede que esta mentalidad traicione a su apodo, para el cual se inspiró en la canción de Kanye West con la que comparte título, pero es lo que le ha llevado al éxito.</p>\n\n<p>Aunque en un primer momento Amazing desestimó el juego de Riot Games debido a su estética, la insistencia de su hermano acabó pasando factura y el germano se inició como tirador. No obstante, al igual que en otros títulos a los que había jugado antes, su deseo de tener un mayor impacto en las partidas le llevó a la jungla. Udyr, Shyvana y sobre todo Lee Sin fueron los personajes que utilizó para escalar posiciones en el ránking.</p>\n\n<p>Sus 2 800 puntos de ELO al término de la segunda temporada hicieron que Team Acer se hiciera con sus servicios para acceder a la primera edición de la LCS EU. Ante el fallido intento Amazing abandonó la organización y deambuló sin éxito por varios equipos durante el siguiente año, lo que estuvo a punto de provocar su retirada.</p>\n\n<p>Sin embargo, la salida de Ilyas ‘Shook’ Hartsema dejó una vacante en Copenhagen Wolves que el jungla alemán ocupó. La organización danesa se hizo con un puesto en el split de primavera de la LCS EU 2014 a través del Torneo de Promoción, en el que derrotó a Meet Your Makers sin complicaciones. Amazing, que necesitó casi dos años para ingresar en la máxima liga continental, aprovechó la ocasión para convertirse en una de las revelaciones.</p>\n\n<p>Su destreza con Lee Sin, Elise y Evelynn fue un problema que en ocasiones los rivales no pudieron resolver. El equipo tenía carencias evidentes, pero las buenas actuaciones de Amazing y Konstantinos ‘FORG1VENGRE’ Tzortziou permitieron una modesta participación en los Playoffs.</p>\n\n<p>Pero fue en verano cuando Amazing encontró su oportunidad de oro. Team SoloMid buscaba un recambio para Brian ‘TheOddOne’ Wyllie y el alto nivel mecánico del alemán le convirtió en el mejor candidato. Reemplazar a una leyenda de la organización norteamericana más popular no fue sencillo y al principio Amazing lo pasó mal debido a su escaso repertorio de campeones. Para anularle, los contrincantes bloqueaban varios personajes del jungla, que en una ocasión se vio obligado a seleccionar a Volibear para desgracia de sus aliados. Pese a todo, Amazing fue el jugador más valioso de la cuarta semana y Team SoloMid recuperó la corona que Cloud9 le había arrebatado.</p>\n\n<p>El Campeonato Mundial 2014, en el que se enfrentó a junglas de la talla de Choi ‘DanDy’ In-kyu, le ayudó a llevar su juego al siguiente nivel. Deseoso de regresar a Europa, Amazing aprovechó la oferta de Enrique ‘xPeke’ Cedeño y se unió a Origen, donde se ha asentado como uno de los mejores del continente en su posición con actuaciones sólidas, sobre todo con Gragas.</p>","fr_FR":"<p>Maurice « Amazingx » Stückenschneider est un jungler dont la carrière professionnelle débute en janvier 2014, lorsqu’il se qualifie aux League of Legends Championship Series avec l’équipe Copenhagen Wolves. Connu pour avoir un style de jeu agressif, l’Allemand s’illustre principalement avec Lee Sin pendant le segment de printemps, exposant des mécaniques de jeu solidement rodées. Malheureusement pour lui, cette première aventure en LCS s’avère infructueuse. Après avoir obtenu la 6e place sur 8 lors de la saison régulière, Amazing et son équipe finissent dernier des play-offs et sont contraints de passer par le tournoi de promotion pour conserver leur place en LCS. Après avoir réussi cette entreprise, Amazing reçoit une proposition d’outre-Atlantique : l’équipe Team SoloMid veut s’offrir ses services suite au départ du « Général OddOne ». Amazing accepte l’offre et devient l’un des premiers joueurs européens à s’expatrier aux États-Unis.</p>\n\n<p>Il y retrouve le mid laner danois Søren « Bjergsen » Bjerg, également passé par la case Copenhagen Wolves et trouve une certaine complicité avec ce dernier. Malgré de bons résultats, certains observateurs accusent Amazing d’être trop dépendant de Lee Sin et Elise, ses deux champions les plus joués et les seuls à avoir des ratios de victoires convainquant (respectivement 78% et 89%). Néanmoins, en plus d'être un joueur à la technique aiguisée, Amazing se révèle être un excellent tacticien, ce qui vaudra à son équipe la 3e position de la saison régulière. Auteur de très belles parties avec Nunu et Kha’Zix, le jungler mène son équipe à la première place de la saison estivale des LCS NA.</p>\n\n<p>Au Mondial 2014, TSM réussit à sortir du groupe B à la 2e place, puis s’incline en quart de finale face aux futurs champions du monde, réussissant tout de même à sauver l’honneur lors de la troisième partie. Amazing décide par la suite de quitter TSM pour retrouver son Europe natale. Début décembre, il rejoint les rangs d’Origen, une nouvelle structure dont la première ambition est d’accéder aux LCS via les Challenger series. Le pari est tenu et Amazing se qualifie pour la seconde fois. Contrairement à sa première expérience européenne, celle-ci s'avère fructueuse.</p>\n\n<p>Avec le temps et les patchs, la méta de la jungle a évolué. En 2015, les champions résistants font leur retour en force. Amazing s’en accommode très vite et brille particulièrement avec Rek’Sai et Gragas. Son niveau de vision de jeu est très vite remarqué tant sa présence sur la carte est percutante. En duo avec son support Alfonson « Mithy » Aguirre Rodriguez, Amazing réussi à contrer les initiatives adverses et à prendre le contrôle de la vision dans un nouveau style d’agressivité. Ces performances permettent à son équipe de se hisser à la 2e place de la saison estivale des LCS EU et d’obtenir la 2e place des play-offs. Au mondial 2015, Amazing rivalise avec les meilleurs, guidant son équipe jusqu’en demi-finale.</p>","pl_PL":"<p>Pochodzący z Bocholt w Niemczech, Maurice Stückenschneider to zawodnik, którego sława wciąż rośnie. Pierwszy raz zanurzył się w wirtualny świat gier w wieku pięciu lat, dając się porwać starym grom na konsole. Przez parę kolejnych lat nie ciągnęło go do klawiatury i myszki, zdecydowanie bardziej wolał zostać przy padzie. Dopiero w 2010 roku skusił się na grę na komputerze, z okazji wzięcia udziału w wydarzeniach związanych z ESL. Pierwotnie League of Legends odrzucało Maurice’a ze względu na grafikę podobną do kreskówek. Dopiero jego brat nakłonił go do tego, żeby spróbował w nią zagrać.</p>\n<p>\nSwój debiut w świecie Runeterry \"Amazing\" rozpoczął od fascynacji postaciami AD Carry. Po pierwszym sezonie zmienił swoje upodobania. Jego zainteresowanie skupiło się na Jungli, ponieważ chciał mieć większy wpływ na grę. Grając Udyrem, Shyvaną i Lee Sinem udało mu się osiągnąć zawrotny wynik 2,8 tysiąca Elo w drugim sezonie. Jego progres nie umknął uwadze sporej ilości drużyn, po wielu perypetiach skorzystał z oferty Copenhagen Wolves. Z tą drużyną miał okazję pierwszy raz pokazać się na EU LCS, lecz wiosenny sezon 2014 z tą drużyną skończył się na meczach relegacyjnych.  \"Amazing\" odszedł z CW, ale w międzyczasie jego sława zdążyła dotrzeć aż za ocean. Został doceniony przez powszechnie znaną drużynę Team SoloMid. Pomimo powszechnej krytyki jego małego zasobu bohaterów,  wykorzystał swoje umiejętności z tym zdecydowanie lepszym w tym czasie zespołem. Efektem tego było pierwsze miejsce w letnim sezonie 2014, gwarantujące drużynie miejsce na Mistrzostwach Świata 2014. 11 października tego samego roku Maurice odszedł z TSM, powołując się na sprawy rodzinne i wrócił do swojej ojczyzny.</p>\n<p>\n\"Amazing\" na początku swojej kariery w Jungli wzorował się na Danilu \"Diamondprox\" Reshetnikovie, bardzo sugerując się bohaterami, których Rosjanin wybierał. Jednak ostatecznie ulubionymi bohaterami Maurice’a są: Xin Zhao, Shyvana, Lee Sin i Nautilus. Duży wpływ na niego miały też gwiazdy z innych dziedzin. Ze względu na to, że w przeszłości grał zawodniczo w koszykówkę, jednym z jego idoli jest Kobe Bryant, a ulubioną drużyną Los Angeles Lakers. Stąd też wywodzi swoje motto: „Ciężka praca pokonuje talent”. Cieszy swoich fanów aktywnością na Twitterze, gdzie lubi narzekać na sprawy, które go irytują. Mocny charakter Maurice’a widać także w rozmowach z nim. W wywiadzie przed półfinałem Mistrzostw Świata 2015 powiedział „Nie boję się SKT T1”.\n</p>","pt_BR":"<p>\nA fama de Amazingx vem dos dois lados do Atlântico. Ele apareceu no cenário quando subiu com a Copenhagen Wolves para a LCS em 2013. Então ele cruzou o oceano e jogou por um tempo na TSM, ajudando a levar o time até as quartas de final. No final da temporada, ele voltou para a Europa e se juntou à Origen para disputar a Série Desafiante da LCS EU.</p>\n<p>\nEle jogou basquete por muitos anos, e sua natureza competitiva o motiva a dominar o mapa e fazer jogadas para o time. Ele teve lampejos de genialidade ao longo da carreira, mas seu desempenho se consolidou como nunca na Origen. Qual o próximo passo? Amazing só consegue pensar no Mundial. E você vai dizer que ele está errado?</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">정글러로서 Maurice \"Amazingx\" Stückenschneider 선수의 실력은 북미와 유럽 양쪽에서 유명합니다. Amazing 선수는 Copenhagen Wolves의 2013년 말 유럽 LCS 승급에 결정적인 역할을 하며 이름을 널리 알렸죠. 그리곤 대서양을 건너 북미에서 잠시 Team SoloMid에 합류해 2014년 월드 챔피언십 8강까지 진출하는 데 톡톡한 공을 세웠습니다. 그리고 시즌이 끝난 후 유럽으로 돌아와 Origen의 창단 멤버로 유럽 Challenger 시리즈에 출전했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">어릴 때부터 농구를 해온 덕에 지기 싫어하는 면모가 있어 경기를 할 때도 맵을 장악하고 플레이 메이커 역할을 하는 모습을 쉽게 볼 수 있습니다. 선수 생활을 시작할 때부터 뛰어난 실력을 계속 보였던 Amazing 선수이지만 훨씬 꾸준한 모습을 보여준 건 Origen에 합류하면서부터였습니다. Origen의 데뷔 시즌인 2015년, 월드 챔피언십에서 준결승까지 올라갔으니 올스타의 반열에 드는 게 당연해 보입니다. Amazing 선수가 앞으로 어떤 행보를 보일지 매우 기대됩니다. </p>\n","el_GR":"","es_AR":"","ro_RO":"","es_MX":"","tr_TR":"","en_PL":"","ru_RU":"","it_IT":"","en_GB":"","hu_HU":"","cs_CZ":""},"foreignIds":{"drupalId":"1102","TRLH3":"200000056","TRLH4":"200000159"},"socialNetworks":{"azubu":"azubu.tv/amazing","facebook":"https://www.facebook.com/amazinglolx?fref=ts","twitter":"https://twitter.com/Amazing_EU"},"champions":[],"liveGameTeam":334},{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":341,"slug":"kikis","name":"Kikis","firstName":"Mateusz","lastName":"Szkudlarek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kikis-9px5rew4.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-06-20T13:17:06.000Z","bios":{"en_US":"<p>\nMateusz “Kikis” Szkudlarek launched his esports career in 2012 with MeetYourMakers. Kikis spent several years battling it out in the EU Challenger scene before breaking into the EU LCS in 2015 with the Unicorns of Love. He later moved to G2 Esports, helping them to qualify for the EU LCS while also moving out of the jungle and into the top lane.\n</p>\n<p>\nKikis acclimated quickly to the top lane as G2 consistently unraveled opponents leading to a 1st place finish in the 2016 EU LCS Spring Split. After parting ways with G2, Kikis found his way to another top European team: Fnatic. The burden of high expectations lies squarely on Kikis’ shoulders -- but that’s something that he (and his scarves) are used to.\n</p>","de_DE":"<p>Der erste Gedanke, der dabei vermutlich gerade durch den Kopf geht ist „Moment einmal, ist der nicht Jungler?“. </p>\n\n<p>Naja, er war es schließlich vor nicht allzu langer Zeit einmal. Heute ist Mateusz „Kikis“ Szkudlarek, wie ihr schon richtig gelesen habt, der Top-Laner bei G2 Esports. Doch wusstet ihr auch, dass Kikis Karriere eigentlich als Top-Laner begann? Wirklich bekannt wurde der Pole erst mit seinem Durchbruch in die EU LCS mit Unicorns of Love, als er mit seinen Teamkameraden sich durch die EU Challenger Series für die europäische Erstliga qualifizierte. Sein Weg begann jedoch schon weit in der Vergangenheit, nämlich zum Zeitpunkt, als League of Legends gerade in die erste Saison der kompetitiven Szene startete. 2011 schafften Kikis und seine Mannschaft exGameburg Team sich einen Platz in seinem ersten internationalen Turnier, die 2011 World Cyber Games, zu ergattern. Gastgeber war das prestigeträchtige Najin e-mFire, welches durch die Hand des europäischen Teams fiel. Kikis Team schlug ebenso die nordamerikanische Mannschaft Counter Logic Gaming und schaffte es bis ins Finale gegen Chicks Dig ELO, ein Team bestehend aus einer Mischung aus späteren Team SoloMid- und Counter Logic Gaming-Spielern.</p>\n\n<p>Nach der Silbermedaille schlug sich der stilhafte Schal-Connaisseur für drei Jahre durch verschiedene Mannschaften, darunter auch namhafte Organisationen wie MeetYourMakers, mousesports und Team ROCCAT. Als Teil von EloHell spielte er in der regionalen KO-Phase Europas der zweiten Saison, schied allerdings bereits im Vierteilfinale aus. Ende 2013 wechselte Kikis in die Jungle-Rolle und begann für einige Mannschaften der EU CS zu spielen, in der Hoffnung eines Tages den Schritt nach ganz oben zu schaffen. </p>\n\n<p>Mit UOL kam der Durchbruch und auch der massive Strom an Fans, vor allem durch die verrückten Champions, die Kikis in den wichtigsten Spielen seiner Mannschaft auspackte. Mal war es Udyr und ein anderes Mal Gnar, beides Champions, welche wohl kein anderer Jungler der Welt sich trauen würde anzufassen. Besonders nicht im Halbfinale der EU LCS Spring 2015. Da fragt man sich, wie viel Vertrauen seiner Mannschaft sich Kikis verdient haben muss und wie viel Mut man braucht, um eine solche Aktion durchzuziehen. </p>\n\n<p>Im Laufe der folgenden Sommersaison entschied sich der Pole wegen seiner mangelhaften Leistung die Mannschaft zu verlassen und es mit einem Neuanfang bei Gamers2 zu versuchen. Der Wechsel auf die Top-Lane fand schließlich nach einer erfolgreichen Qualifikation für die Rückkehr in die LCS statt, als er seine neuen Jungler Kang-yoon „Trick“ Kim willkommen hieß. </p>\n","fr_FR":"<p>S’il existait un concours du joueur à avoir parcouru le plus d’équipes dans sa carrière, Mateusz « Kikis » Szkudlarek en serait sûrement le grand favori. Le Polonais a déjà porté les couleurs de plus de 20 équipes en 5 années, tantôt en toplane, tantôt en jungle et parfois même en midlane. Alors qu’il n’a que 15 ans, Kikis commence la compétition et participe à des dizaines de tournois. Les résultats sont parfois au rendez-vous, comme quand il envoie au tapis une équipe coréenne en 2011 et obtient la 2e place du tournoi international World Cyber Game ou quand il remporte la Gamers Assembly 2012 face à des équipes européennes comme Counter Logic Gaming Europe.</p>\n\n<p>En 2014, Kikis participe à la première édition des Challenger Series de printemps, mais son équipe Pulse Esports est rapidement éliminée. La seconde édition est davantage un succès. Avec Denial eSports, le Polonais parvient à accrocher la 3e place des play-offs et décroche ainsi son ticket pour le tournoi de promotion. Malheureusement, le joueur et son équipe s’inclinent face à l’équipe sortante, Copenhagen Wolves et échouent à la porte des League of Legends Championship Series. </p>\n\n<p>La saison estivale des Challengers Series de Kikis suit le même schéma : élimination précoce lors de la première édition, accès au tournoi de promotion avec SK Gaming Prime — une équipe différente — lors de la seconde puis échec face à l’équipe issue des LCS, cette fois-ci Gambit Gaming. Finalement, Kikis rejoint une équipe qui, elle, est parvenue à se qualifier aux LCS : Unicorns of Love.</p>\n\n<p>C’est dans cette structure que Kikis connaît ses plus grands succès. Aussitôt arrivé dans le club très fermé des licornes capables de tenir une souris, aussitôt il dispute une compétition internationale : les Intel Extreme Masters San Jose. Le Polonais, dans tout son art, innove comme personne. Face à Team SoloMid, il invoque Twisted Fate jungle et se saisi de l’enchantement Dévoreur, avec lequel il connaît un grand succès et marque les esprits. UoL parvient finalement à se hisser en finale, où l’équipe s’incline face à Cloud9. En LCS, Kikis se montre au niveau et tient tête aux meilleurs. Son équipe se hisse à la très correcte 5e place de la saison régulière. Aux play-offs, il étonne à nouveau en jouant un Shaco très convainquant face à Gambit Gaming. En demi-finale face à SK Gaming, le premier de la saison régulière, il sélectionne Gnar jungle et participe à la victoire de son équipe. La belle aventure se termine sur une finale très serrée dont Fnatic est le seul vainqueur. </p>\n\n<p>Avant la fin de la saison régulière d’été, Kikis quitte Unicorns of Love et rejoint Gamers2. Il aide l’équipe à se hisser à la 3e place des Challengers Series puis contribue à la qualifier aux LCS en s’imposant face à SK Gaming. Depuis, le joueur a cédé sa place de jungler et est retourné à ses premiers amours : la voie du haut.</p>\n","es_ES":"<p>Mateusz “Kikis” Szkudlarek comenzó su carrera de esports el año 2012 junto a MeetYourMakers. Kikis pasó varios años junto a los jugadores europeos de nivel Aspirante hasta que por fin se abrió paso a la LCS en 2015 con los Unicorns of Love. Sus actuaciones con Nidalee y Nunu son dominantes, y el marcador de juego con sus junglas preferidos en el split de primavera ha sido de 6V-2D. Como homenaje al estilo poco ortodoxo de UOL, incluso se atrevió con Shaco una vez a pesar de que muchos consideran que el campeón no es jugable actualmente.</p>\n<p>Kikis pasó de UOL a G2 Esports en 2015, y su debut para el equipo ayudó a G2 a clasificarse para la LCS EU. Este 2016, Kikis ha pasado de la jungla a la calle superior de G2. Solo hay una explicación: ha llegado el momento de desatar el poder de Shaco en la calle superior (o eso esperamos).</p>","pl_PL":"<p>Mateusz bezsprzecznie należy do grona najpopularniejszych polskich zawodników. Równolegle wybija się zdolnościami wśród innych graczy na arenie międzynarodowej. Mało kto może się pochwalić taką wprawą jak „Kikis” na profesjonalnej scenie, gdyż jest jej częścią od początku pierwszego sezonu. Do tego przyczyniło się członkostwo w ponad 20 różnych, bardziej lub mniej znanych, drużynach. Takie doświadczenie, zyskane podczas wspólnej gry z graczami z całej Europy, jest unikatowe na skalę światową. </p>\n<p>Podczas swojej długiej kariery w League of Legends „Kikis” zgromadził mnóstwo imponujących trofeów. Pierwszym znaczącym sukcesem było drugie miejsce na Samsung Euro Championship 2011. Wyjątkowość tego wydarzenia polegała na pokonaniu zespołów reprezentujących Kanadę i Koreę – Counter Logic Gaming i Najin e-mFire. Dla polskiej reprezentacji i Mateusza to był debiut w rozgrywkach na najwyższym poziomie. Po doskonałym starcie do sezonu czwartego „Kikis” brał udział w gigantycznej ilości wydarzeń różnej rangi – od regionalnych turniejów po światowe imprezy jak IEM w San Jose. W międzyczasie cały czas próbował swoich sił w Challenger Series grając w rozmaitych zespołach, jak na przykład: Denial eSports i Lublin Shore. Niestety przeważnie kończył na czwartym miejscu, bez możliwości walki o wejście do kolejnego etapu. Kwalifikacja do turnieju promocyjnego udała mu się dopiero w szeregach SK Gaming Prime, lecz na jego drodze do EU LCS stanął legendarny już zespół Gambit Gaming. „Kikis” poniósł porażkę w starciu z potęgą czerwonej gwiazdy, lecz ostatecznie i tak zagrał w wiosennym sezonie EU LCS 2015. Szansę na pokazanie się zawdzięcza ofercie of Unicorns Of Love, która przyjęła go do głównego składu z szeroko rozłożonymi ramionami. Ten okres przyniósł wiele sukcesów Mateuszowi. W grudniu 2014 roku zajął drugie miejsce na wielkim wydarzeniu – IEM w San Jose, ulegając tylko Cloud9. Natomiast w wiosennym sezonie zespół UOL zajął piąte miejsce, lecz podczas rozgrywek barażowych pokazał pazur. „Kikis” i jego ekipa pokonali Gambit Gaming i zajmujący pierwsze miejsce SK Gaming. Zostali pokonani dopiero w finale w bardzo wyrównanej batalii przeciwko Fnatic z wynikiem 3:2.</p>\n<p>„Kikis” gra profesjonalnie zarówno w jungli jak i na top-lanie, w zależności od potrzeb swojego zespołu. Uwielbia grać Lee Sinem, Shenem i Elise, lecz potrafi pozytywnie zaskoczyć widzów każdym bohaterem. Najgłośniejszym zagraniem Mateusza był doskonały gank Udyrem na drugim poziomie w meczu przeciwko Gambit Gaming podczas wiosennych rozgrywek barażowych. Większość analityków jest zgodna, że „Kikis” to gracz absolutnie nieszablonowy, co jest jego największą zaletą. Tymczasem fani kochają go za prostolinijność, ponieważ nigdy nie wstydził się mówić, tego co naprawdę czuje. Dlatego posiada szczerze oddane grono wielbicieli, którzy podążają za nim, kiedy przenosi się do kolejnych zespołów.</p>\n","es_AR":"<p>Mateusz 'Kikis' Szkudlarek comenzó su carrera en los Esports en 2012 con MeetYourMakers. Kikis pasó varios años peleando en la escena del Challenger de la UE antes de iniciarse en la LCS de la UE en 2015 con los Unicorns of Love. Es mejor conocido por sus actuaciones dominantes usando a Nidalee y Nunu, sus jungleros favoritos, y por mantener un récord de 6 ganados contra 2 perdidos durante el curso del Torneo de Primavera de 2015 de la LCS de la UE. Y en una ocasión, con un estilo poco convencional para UOL, llegó a usar a Shaco; un campeón que muchos consideran injugable en competencias profesionales.</p>\n\n<p>Kikis pasó de UOL a G2 eSports en 2015 y, su debut en el equipo, les permitió calificar para la LCS de la UE. Kikis realizó otro movimiento en 2016, al salir de la jungla para entrar al carril superior de G2. Solo puede haber una explicación para esto: es la hora del terror Iluminati del carril superior conocido como Shaco el Muñeco Sorpresa (eso esperamos).</p>"},"foreignIds":{"drupalId":"1469","TRLH3":"200000263","TRLH4":"200000315","TRLT3":"35063","TRLH2":"1001250015","FRA1TMNT2":"25428"},"socialNetworks":{"twitch":"www.twitch.tv/kikis1205","facebook":"www.facebook.com/MSkikis","twitter":"https://twitter.com/kikis1205"},"champions":[],"liveGameTeam":334},{"id":660,"slug":"cozq","name":"CozQ","firstName":"Sofyan","lastName":"Rechchad","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cozq-7eq65vwu.png","hometown":"Hertogenbosch","region":"EU Challenger Series","birthdate":"1995-05-21","createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-07-06T13:27:23.000Z","bios":{"en_US":"<p>Sofyan \"CozQ\" Rechdad is the mid laner for Mysterious Monkeys. The Dutch mid laner bounced between numerous teams to start his career, which included a brief stint with Turkish team Dark Passage. He found a home on Misfits Academy to start 2017 and helped the team qualify for the EU LCS. He'll remain the starting mid laner for Mysterious Monkeys after the ownership change. He's proven capable on a wide range of mid lane champions, which bodes well for his chances in the LCS.</p>","pl_PL":"Sofyan „CozQ” Rechdad jest środkowym Mysterious Monkeys. Zaczynając karierę, duński środkowy przeskakiwał między wieloma drużynami, zaliczając między innymi krótkie występy w tureckiej drużynie Dark Passage. Na początku 2017 roku znalazł swoje miejsce w Misfits Academy i pomógł drużynie zakwalifikować się do EU LCS. Po zmianie właściciela drużyny pozostanie środkowym w pierwszym składzie Mysterious Monkeys. Pokazał, że świetnie sobie radzi z szerokim wyborem środkowych bohaterów, co dobrze wróży jego szansom w LCS.","fr_FR":"Sofyan « CozQ » Rechdad est le mid laner des Mysterious Monkeys. Le Hollandais a enchaîné les équipes au début de sa carrière, avec notamment un bref séjour chez les Turcs de Dark Passage. Il a finalement trouvé sa place chez Misfits Academy début 2017 et a aidé l'équipe à se qualifier pour les LCS EU. Il conserve sa place de mid laner titulaire des Mysterious Monkeys malgré le changement de propriétaire. CozQ a prouvé son talent avec un large éventail de champions sur la voie du milieu, et les choses se présentent bien pour lui aux LCS, où il devrait avoir toutes ses chances.","es_ES":"Sofyan \"CozQ\" Rechdad es el mid de Mysterious Monkeys. El holandés ha pasado por diversos equipos en el comienzo de su carrera, incluido un breve periodo en el equipo turco Dark Passage. A comienzos de 2017 fue fichado por Misfits Academy y ayudó al equipo a clasificarse para la LCS EU. Seguirá siendo el mid titular de Mysterious Monkeys después del cambio de propietario. Ha demostrado ser capaz de jugar con una gran variedad de campeones, lo que le augura un buen futuro en la LCS.","de_DE":"Sofyan „CozQ“ Rechdad ist der Mid-Laner der Mysterious Monkeys. Der Holländer wechselte zu Beginn seiner Karriere zwischen mehreren Mannschaften hin und her und war für kurze Zeit Teil der türkischen Mannschaft Dark Passage. Zum Jahresbeginn 2017 fand er bei Misfits Academy sein Zuhause und half ihnen bei der Qualifikation zur EU LCS. Auch nach dem Besitzerwechsel behält er seine Position als Mid-Laner für die Mysterious Monkeys. Er hat seine Fähigkeiten mit einer großen Bandbreite an Champions auf der mittleren Lane unter Beweis gestellt, was ihm gute Chancen in der LCS verspricht."},"foreignIds":{"drupalId":"3895","FRA1TMNT1":"375382","TRLH4":"200000300","TRNA1":"1000445250","TREU":"1000565102","TREU1":"1000565102","ESPORTSTMNT02":"200001022","TRLH3":"200000248"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1333,"slug":"yuuki60","name":"Yuuki60","firstName":"Florent","lastName":"Soler","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yuuki60-h09ivc6h.png","hometown":"France","region":"EU Challenger Series","birthdate":"1991-06-21","createdAt":"2016-06-03T16:01:57.000Z","updatedAt":"2017-07-06T13:37:56.000Z","bios":{"en_US":"<p>Florent \"Yuuki60\" Soler is the starting ADC for Mysterious Monkeys. The French marksman paired with support Dreams in the bot lane for Misfits Academy to start 2017, eventually qualifying for the EU LCS. He tends to select more utilty-focused ADCs like Ashe and Jhin, preferring to start the fights himself. After besting the EU CS competition, he's ready for his next challenge.</p>","fr_FR":"<p>Yuuki est un ADC reconnu de la scène française de League of Legends. Véritable vétéran, il a porté haut les couleurs de la France dans des tournois internationaux. Connu pour son positionnement impeccable, il a su créer des duos d'anthologie. </p>\n<p>On ne compte plus le nombres de trophées que Yuuki a pu remporter, sous les couleurs de aAa, Worth It mais aussi Gamers 2 ou il s'illustrait avec Dioud. </p>\n<p>Toujours au plus haut de sa forme, Yuuki a remporté la deuxième place de la Lyon e-Sport #9 avec ses coéquipiers de Renegades pour ensuite rejoindre Misfits en Challenger Series. Aujourd'hui sous le maillot de Millenium, il a a coeur de prouver qu'il reste parmi les meilleurs, et entend bien décrocher le titre de champion de France.</p>","de_DE":"Florent „Yuuki60“ Soler ist der AD-Carry der Mysterious Monkeys. Anfang 2017 tat sich der französische Schütze für Misfits Academy mit Supporter Dreams in der unteren Lane zusammen und trug zur Qualifikation für die EU LCS bei. Er bevorzugt meist unterstützende AD-Carrys wie Ashe oder Jhin und geht gerne zuerst zum Angriff über. Nach dem Sieg in der EU CS ist er bereit für die nächste Herausforderung.","es_ES":"Florent \"Yuuki60\" Soler es el ADC titular de Mysterious Monkeys. El tirador francés jugó con su compañero apoyo, Dreams, en la calle inferior de Misfits Academy al comienzo de 2017 y, finalmente, lograron clasificarse para la LCS EU. Suele decantarse por ADC de utilidad como Ashe y Jhin, ya que prefiere iniciar los combates él mismo. Tras dar lo mejor de sí mismo en la Challenger Series europea, ya está preparado para superar el próximo reto.","pl_PL":"Florent „Yuuki60” Soler to prowadzący w pierwszym składzie Mysterious Monkeys. Na początku 2017 roku roku ten francuski strzelec grał dla Misfits Academy na dolnej alei w parze ze wspierającym Dreamsem i pomógł drużynie zakwalifikować się do EU LCS. Zwykle wybiera bardziej skupionych na walorach użytkowych prowadzących, takich jak Ashe i Jhin, woląc samemu rozpoczynać walki. Po ograniu konkurencji w EU CS jest gotowy na następne wyzwanie."},"foreignIds":{"FRA1TMNT1":"435084","TRNA1":"1000525108","TREU":"1000565112","TRLH4":"200000301","FRA1TMNT2":"45055","TRLH2":"1001250099","TRLH3":"200000249"},"socialNetworks":{"twitter":"https://twitter.com/Yuukii60"},"champions":[],"liveGameTeam":334},{"id":1343,"slug":"dreams","name":"Dreams","firstName":"Min-kook","lastName":"Han","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dreams-dd99r8zs.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-06-06T23:47:30.000Z","updatedAt":"2017-07-06T13:41:55.000Z","bios":{"en_US":"<p>Min-kook \"Dreams\" Han is the Korean support player for Mysterious Monkeys. After earning a spot in the EU LCS while playing with Misfits Academy, he's sticking with the team as it rebrands to Mysterious Monkeys. He'll keep laning alongside his ADC Yuuki60 after finding success in the EU CS. Dreams has showed off a wide champion pool already this year, from shielding supports like Lulu and Karma to more niche picks such as Tahm Kench and Nautilus.</p>","pl_PL":"Min-kook „Dreams” Han jest koreańskim wspierającym w Mysterious Monkeys. Po zdobyciu miejsca w EU LCS z Misfits Academy, został z drużyną, która zmieniła nazwę na Mysterious Monkeys. Szukając dalszego sukcesu w EU CS, będzie walczył na alei obok prowadzącego Yuuki60. Dreams zaprezentował już w tym roku swoją szeroką pulę bohaterów od ochraniających wspierających, takich jak Lulu i Karma, po bardziej niszowe wybory, takie jak Tahm Kench i Nautilus.","fr_FR":"Min-kook « Dreams » Han est le support coréen des Mysterious Monkeys. Après avoir participé aux LCS EU avec Misfits Academy, il a décidé de rester aux côtés de l'équipe, maintenant renommée Mysterious Monkeys. Il continuera de collaborer avec l'ADC Yuuki60 suite à leur succès lors des CS EU. Dreams a déjà utilisé un large éventail de champions cette année, depuis des supports protecteurs comme Lulu et Karma jusqu'à des choix plus originaux comme Tahm Kench et Nautilus.","es_ES":"Min-kook \"Dreams\" Han es el apoyo coreano de Mysterious Monkeys. Tras asegurarse un puesto en la LCS EU jugando con Misfits Academy, permanece en el equipo ahora que ha cambiado su nombre por Mysterious Monkeys. Seguirá formando dúo con su ADC Yuuki60 tras el éxito que cosecharon en la CS EU. Dreams ha demostrado este año que puede dominar una gran variedad de campeones, desde apoyos con escudos como Lulu o Karma a opciones más específicas como Tahm Kench o Nautilus.","de_DE":"Min-kook „Dreams“ Han ist der koreanische Supporter der Mysterious Monkeys. Nachdem er als Teil von Misfits Academy einen Platz in der EU LCS errungen hat, bleibt er der Mannschaft auch nach der Namensänderung zu Mysterious Monkeys erhalten. Er wird im Anschluss an seinen Erfolg in der EU CS weiter an der Seite seines AD-Carrys Yuuki60 die Lane bestreiten. Dreams hat dieses Jahr bereits seinen breitgefächerten Championpool zur Schau gestellt, der von Supportern mit Schilden wie Lulu oder Karma zu eher ungewöhnlichen Wahlen wie Tahm Kench oder Nautilus reicht."},"foreignIds":{"FRA1TMNT1":"435085","TRNA1":"1000525109","TREU1":"1000565114","TREU":"1000565114","TRLH4":"200000302","ESPORTSTMNT02":"200001024","TRLH3":"200000250"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1574,"slug":"abbedagge","name":"Abbedagge","firstName":"Felix","lastName":"Braun","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/abbedagge-dy39ro6t.png","hometown":"Almanya","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T22:14:09.000Z","updatedAt":"2017-03-06T16:30:39.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001189"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1715,"slug":"kitty","name":"Kitty","firstName":"Sanders","lastName":"Everink","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kitty-67qf6sp8.png","hometown":null,"region":"EU LCS","birthdate":"1994-10-17","createdAt":"2017-01-19T08:40:34.000Z","updatedAt":"2017-05-31T21:37:09.000Z","bios":{"en_US":"","fr_FR":"<p>En participant au Challenge France, le Carry AD des Gamers Origin souhaite ajouter une nouvelle étape à son palmarès. En effet, depuis le début de sa carrière en Saison 1, il a remporté plusieurs compétitions de haut niveau en 2016 telles que l'ESL Madrid avec l'équipe Baskonia, ou l'ESL Benelux. Il arrive désormais dans une nouvelle ligue et a tout à prouver avec ses nouveaux coéquipiers.</p>\n\n<p>Il affectionne tout particulièrement des champions très agressifs comme Draven ou Ezreal, un style de jeu qui s'accordera parfaitement avec son support Targamas.</p>"},"foreignIds":{"esportstmnt05":"200000957","TRLH3":"200000309","TRLH4":"200000409"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1863,"slug":"inition","name":"Inition","firstName":"Lukas","lastName":"Otter","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inition-6kxcqgyh.png","hometown":"Avusturya","region":"EU LCS","birthdate":null,"createdAt":"2017-04-14T10:23:40.000Z","updatedAt":"2017-05-31T21:39:04.000Z","bios":{},"foreignIds":{"TRLH3":"200000310","TRLH4":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1914,"slug":"phones","name":"Phones","firstName":"Christian","lastName":"Sieg","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phones-7zhwlue6.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T22:02:28.000Z","updatedAt":"2017-05-31T21:43:42.000Z","bios":{},"foreignIds":{"TRLH3":"200000308","TRLH4":"200000408"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":2082,"slug":"quicktimer","name":"Quicktimer","firstName":"Ricardo","lastName":"Schipper","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quicktimer-be9qv8fs.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-07-30T12:53:12.000Z","updatedAt":"2017-07-30T12:48:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":334}],"scheduleItems":[{"id":"AVxHBnHRoUG4HPFjOKSV","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:6cc2e310-66a1-4370-863f-d8dc47395ec2","scheduledTime":"2017-06-03T15:00:00.121+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"6cc2e310-66a1-4370-863f-d8dc47395ec2","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"bcf455ad-760d-4958-baaf-e93d5f1e272e","gameHash":"b62dc7b8152fba2b"},{"id":"69ff1e9c-c196-4d2a-8edb-6a3783a3c809","gameHash":"f9884f5dff940ff9"}],"videos":[{"id":7094,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:69ff1e9c-c196-4d2a-8edb-6a3783a3c809","source":"https://www.youtube.com/embed/sXBMaCYgNaM?wmode=transparent&rel=0","createdAt":"2017-06-04T02:21:41.000Z","updatedAt":"2017-06-05T05:49:26.000Z","game":"69ff1e9c-c196-4d2a-8edb-6a3783a3c809"},{"id":7095,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:bcf455ad-760d-4958-baaf-e93d5f1e272e","source":"https://www.youtube.com/embed/5uzfPPU8YXg?wmode=transparent&rel=0","createdAt":"2017-06-04T02:28:01.000Z","updatedAt":"2017-06-05T05:43:23.000Z","game":"bcf455ad-760d-4958-baaf-e93d5f1e272e"}],"htmlBlocks":[],"match":{"id":"6cc2e310-66a1-4370-863f-d8dc47395ec2","name":"H2K-vs-MM","position":35,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"games":{"d989dd51-768d-45c0-955d-0e8a9baaf647":{"id":"d989dd51-768d-45c0-955d-0e8a9baaf647","name":"G3","generatedName":"H2K|MM|G3|6cc2e31066a14370863f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"69ff1e9c-c196-4d2a-8edb-6a3783a3c809":{"id":"69ff1e9c-c196-4d2a-8edb-6a3783a3c809","name":"G1","generatedName":"H2K|MM|G1|6cc2e31066a14370863f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641757293,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641096275,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496543078185,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496505748751,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002090092","gameRealm":"TRLH3","platformId":"TRLH3:1002090092","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"bcf455ad-760d-4958-baaf-e93d5f1e272e":{"id":"bcf455ad-760d-4958-baaf-e93d5f1e272e","name":"G2","generatedName":"H2K|MM|G2|6cc2e31066a14370863f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641683747,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641113162,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496543152678,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496508386935,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002090103","gameRealm":"TRLH3","platformId":"TRLH3:1002090103","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641683747,"source":"bestOf","history":[{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641757294,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641113162,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496641096276,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496543152678,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496543078186,"source":"bestOf","closed":true},{"result":[[{"roster":"e8121570-d909-4a38-9326-202e9a3c5c97"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1496508386935,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2":0,"e8121570-d909-4a38-9326-202e9a3c5c97":1}}}