{"teams":[{"id":82,"slug":"team-we","name":"Team WE","guid":"be6e0936-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-we-ei826ceg.png","acronym":"WE","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-07T22:21:53.000Z","bios":{"en_US":"","pl_PL":"Team WE są znani w chińskim e-sporcie od pradziejów. Jako pionierska organizacja e-sportowa zasłynęli w świecie ze swoich drużyn Warcrafta i StarCrafta, zanim w 2011 roku przestawili się na League of Legends. Po latach przeplatających się serii sukcesów i porażek Team WE w 2017 roku naprawdę się odnaleźli. Łącząc stare talenty z nowicjuszami, Team WE zdominowali wiosenny split LPL 2017, osiągając wynik 12–4 w fazie grupowej. Nie spoczęli na laurach i wkrótce przebili się przez konkurencję w play-offach, przegrywając tylko jedną grę w drodze po tytuł wiosennego splitu. Ich zwycięstwo 3–0 z Royal Never Give Up w finale stanowiło ukoronowanie znakomitego sezonu drużyny. Teraz szykują się do Rio, gdzie zamierzają wielokrotnie wykradać Barona oraz eliminować najlepsze drużyny świata na Mid-Season Invitational 2017. \n\nTrener: Namhoon „HooN” Kim\n","es_ES":"Team WE es una vieja leyenda china de los esports. Como organización de esports pionera, ya era famosa mundialmente por sus equipos de Warcraft y Starcraft antes de que se uniera a League of Legends en 2011. Tras años alternando éxitos y fracasos, Team WE ha conseguido establecerse en 2017. Con una mezcla de viejos talentos y jugadores recién llegados, Team WE ha arrasado en el split de primavera de la LPL 2017, en la que batió un récord de 12 victorias frente a 4 derrotas en la fase de grupos. Pero la cosa no se quedó en eso. El equipo no tardaría en abrirse paso en los playoffs y en reclamar la corona del split de primavera con tan solo una derrota en su haber. Su resultado 3-0 en la final contra Royal Never Give Up es el colofón de una temporada estelar. Los jugadores de Team WE ahora se dirigen a Río y están preparados para robar el Barón y machacar a sus adversarios cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017. \n\nEntrenador: Namhoon ''HooN'' Kim\n","de_DE":"Team WE ist eine chinesische E-Sport-Legende, die so alt ist wie die Zeit selbst. Die E-Sport-Organisation gilt als Pionier auf diesem Gebiet und war für ihre Warcraft- und StarCraft-Mannschaften bekannt, bevor sie 2011 auf League of Legends umstieg. Nach Jahren voller Höhen und Tiefen scheint Team WE 2017 endlich einen guten Rhythmus gefunden zu haben. Dank einer Mischung aus alten Talenten und Neulingen konnte Team WE den Frühjahrs-Split der LPL dominieren und beendete die Gruppenphase mit 12 Siegen bei nur 4 Niederlagen. Doch das war ihnen noch nicht genug. Sie marschierten durch die Entscheidungsspiele und verloren auf dem Weg zum Titel nur ein einziges Spiel. Die Krönung ihrer sensationellen Saison war der 3–0 Sieg über Royal Never Give Up im Finale des Frühjahrs-Splits. Jetzt konzentrieren sie sich ganz auf Rio, wo sie den ein oder anderen Baron stehlen und ihre Gegner aufmischen wollen, wenn sie sich beim Mid-Season Invitational 2017 mit den besten Mannschaften der Welt messen. \n\nTrainer: Namhoon „HooN“ Kim\n","pt_BR":"<p>A história da Team WE nos e-Sports chineses é tão antiga quanto o tempo. Como uma organização pioneira na área de e-Sports, eles já haviam alcançado renome internacional com suas equipes de Warcraft e Starcraft quando fizeram o salto para League of Legends em 2011. Após passar anos intercalando sucessos e fracassos, a Team WE encontrou de vez o seu caminho em 2017. Misturando talentos experientes com novatos promissores, a Team WE dominou a Etapa de Primavera da LPL 2017 com um recorde de 12-4 na fase de grupos. Sem parar por aí, eles logo abriram caminho entre a competição das eliminatórias, perdendo apenas um jogo na sua jornada até a coroa da Etapa de Primavera. A surra de 3-0 que deram na Royal Never Give Up na final colocou um ponto de exclamação na sua já extraordinária temporada. Agora, seu foco está no Rio e eles pretendem roubar Barões e mostrar a que vieram em seus confrontos contra as melhores equipes do mundo no Mid-Season Invitational 2017. </p>\n\n<p>Técnico: Namhoon “HooN” Kim</p>","es_AR":"<p>El Team WE es un cuento de Esports tan viejo como el tiempo. Como una organización pionera de Esports, se volvieron conocidos internacionalmente por sus equipos de Warcraft y Starcraft antes de entrar a LoL en el 2011. Después de años de éxitos y fracasos, el Team WE encontró su ritmo en 2017. Al mezclar talento viejo con nuevo, el Team WE dominó el Torneo de Apertura LPL de 2017 y alcanzó un récord de 12-4 en la fase de grupos. No se detuvieron ahí. En cuanto llegaron a las eliminatorias solo perdieron una partida en su camino a la victoria del Torneo de Apertura. Su aplastante 3-0 en el Royal Never Give Up en las finales fue la cereza del pastel en su temporada. Ahora tienen los ojos puestos en Río y están listos para robar barones y aplastar a sus oponentes cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"1849"},"players":[132,511,516,517,603,692,1038,1428,1991,1992],"starters":[132,516,517,692,1038],"subs":[511,603,1428,1991,1992]},{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]}],"players":[{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":132,"slug":"zero","name":"Zero","firstName":"Kyungsub","lastName":"Yun","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zero-bpm8z97p.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:59.000Z","updatedAt":"2017-07-07T22:22:17.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2165","TRLH1":"200000404","TRLH3":"1000205039","TRLT3":"200000232"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":511,"slug":"conan","name":"conan","firstName":"Yi","lastName":"Ke","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/conan-hcob1n8b.png","hometown":"Tianmen, China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-05-09T23:21:19.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2079","TRLH1":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":516,"slug":"xiye","name":"xiye","firstName":"Hanwei","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiye-4520r7ee.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:43.000Z","bios":{"en_US":"<p>Hanwei “xiye” Su is the model student for consistency in the mid lane. He joined up with the WE organization in 2013 as part of their developmental squad but was promoted in early 2015 to their main roster as the starting mid laner. His consistency across a variety of play styles has become his calling card in the LPL. Need a mage that can lock down and annihilate squishy targets? Check, xiye has got you covered. What about an assassin that can dice the enemy team down to size? No problem.</p>\n\n<p>Xiye’s steady performances combined with an ocean deep champion pool means that the enemy never quite knows what composition Team WE could build -- this makes prepping to play against xiye a nightmare. Without an easy way to ban him out, xiye can easily meld his play to whatever mid laner is required. He’ll be the rock that Team WE rely on as they step up their game at the 2017 Mid-Season Invitational in Rio. </p>","de_DE":"Hanwei „xiye“ Su ist das perfekte Beispiel für Beständigkeit auf der mittleren Lane. Er wechselte im Jahr 2013 zu WE und spielte in deren Entwicklungsmannschaft, wurde Anfang 2015 aber zum Mid-Laner der Hauptmannschaft gemacht. Durch seine Beständigkeit und seine unterschiedlichen Spielstile machte er sich schnell einen Namen in der LPL. Brauchst du einen Magier, der verletzliche Ziele jagen und vernichten kann? Kein Problem, xiye ist genau der Richtige dafür. Wie wäre es mit einem Assassinen, der die gegnerische Mannschaft in Stück reißt? Auch kein Problem. Dank xiyes konstanten Leistungen und seines umfangreichen Championpools wissen seine Gegner nie genau, was sie erwartet, und dadurch wird es unglaublich schwer, sich auf xiye vorzubereiten. Es ist schwierig, xiye mit Bannen zu schwächen, denn er kann auf der mittleren Lane so gut wie jeden Champion spielen. In Rio wird er Team WEs Fels in der Brandung sein, wenn sich die Mannschaft für das Mid-Season Invitational 2017 bereit macht. ","es_ES":"Hanwei ''xiye'' Su es el alumno modelo en términos de estabilidad en la calle central. Se unió a la organización de WE en 2013 como parte de su grupo en desarrollo, pero ascendió al principio de 2015 a la plantilla principal como mid titular. Sus resultados positivos con diversos estilos de juego se han convertido en su tarjeta de presentación en la LPL. ¿Su equipo necesita un mago que pueda inmovilizar y aniquilar a los objetivos más débiles? Sin problema, para eso está xiye. ¿Y si conviene más jugar con un asesino que pueda trocear al equipo enemigo? Todo controlado. El desempeño estable de xiye combinado con su gran repertorio de campeones hacen que el equipo enemigo casi nunca pueda prever cuál será la composición de Team WE (eso provoca que prepararse para jugar contra xiye sea toda una pesadilla). Como bloquear su selecciones no es tarea fácil, xiye puede adaptar sin problema su estilo de juego según el mid que mejor encaje. Team WE confiará en sus habilidades cuando se suban al escenario del Mid-Season Invitational 2017 en Río. ","pl_PL":"Hanwei „xiye” Su daje wzór konsekwentnej gry na środkowej alei. Dołączył do organizacji WE w 2013 roku jako część składu rozwojowego, a na początku 2015 roku został awansowany do głównego składu jako pierwszy środkowy. Umiejętna gra różnymi stylami stała się jego wyróżnikiem w LPL. Potrzebny jest mag, który umie blokować i anihilować delikatne cel? Jasne, xiye załatwi sprawę. A co z zabójcą, który potrafi ukrócić zapędy wrogiej drużyny? Żaden problem. Spójne występy xiye w połączeniu z rozległą jak ocean pulą bohaterów oznaczają, że wróg nigdy nie wie, jaką kompozycję wybierze Team WE — a to sprawia, że przygotowanie do gry przeciwko xiye jest koszmarem. Ponieważ nie ma łatwego sposobu, by go zbanować, xiye może szybko dostosować swoją grę do stylu wymaganego w danej sytuacji od środkowego. Jest opoką, na której wesprą się Team WE, by pokazać, na co ich stać na Mid-Season Invitational 2017 w Rio. ","pt_BR":"<p>Hanwei “xiye” Su é o modelo de consistência na rota do meio. Ele entrou para a organização WE em 2013 como parte da sua equipe em formação, mas foi promovido no início de 2015 à sua seleção principal para jogar na rota do meio. Sua consistência em vários estilos de jogo se tornou seu principal trunfo na LPL. Precisam de um mago que imobilize e acabe com alvos frágeis? Pode deixar, o xiye dá conta. E que tal um assassino que possa dar uma podada na equipe inimiga? Sem problema.</p> \n\n<p>Os desempenhos estáveis de xiye e o seu impressionante leque de Campeões fazem com que seus oponentes jamais saibam que composição a Team WE vai montar, o que é um verdadeiro pesadelo para quem precisa se preparar para enfrentá-lo. Sem uma maneira fácil de banir suas principais escolhas, xiye pode facilmente adequar seu estilo de jogo ao de qualquer Campeão da rota do meio que seja necessário. Ele será o alicerce em que a Team WE se apoiará para avançar no Mid-Season Invitational 2017 no Rio. </p>","es_AR":"<p><strong>Hanwei \"xiye\" Su</strong> es la imagen de la coherencia en el carril central. Se unió a la organización WE en 2013 como parte de su escuadrón de desarrollo, pero fue ascendido a inicios de 2015 a su arsenal principal como su carrilero central principal. Su coherencia a lo largo de una variedad de estilos de juego se convirtió en su marco en el LPL. ¿Necesitas a un mago que atrape y aniquile a los objetivos aplastables? Bueno, <strong>xiye</strong> se encarga. ¿Qué hay de un asesino que reduzca a la mitad al equipo enemigo? No hay problema. El desempeño estable de <strong>xiye</strong>, combinado con una profunda agrupación de campeones significa que el enemigo nunca sabe cuál será la composición del Team WE. Esto hace que prepararse para pelear contra <strong>xiye</strong> sea una pesadilla. Sin una forma sencilla de eliminarlo, <strong>xiye</strong> puede adaptarse con facilidad a lo que el carrilero central necesite. Será la roca sobre la cual se base el Team WE cuando se preparen para el Mid-Season Invitational 2017 en Río.</p>"},"foreignIds":{"drupalId":"3186","TRLH1":"200000402","TRLH2":"200000302","TRLT3":"200000230"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":517,"slug":"mystic","name":"Mystic","firstName":"Seongjun","lastName":"Jin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mystic-cktg9mzr.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:57.000Z","bios":{"en_US":"<p>Seongjun “Mystic” Jin started his professional career in his native South Korea with the Jin Air Stealths in 2013. Near the tail-end of 2014 he decided to make the move to China and Team WE Academy. It was here that he made the perilous switch from jungle to AD carry. He acclimated quickly to the new role and Team WE took notice. They promoted Mystic to their roster as a sub and not long after he was promoted yet again to their starting AD carry position where he’s been since the spring of 2015.</p>\n\n<p>He’s comfortable on a variety of champions, from the initiation of Ashe’s Crystal Arrow to the raw carry potential of Piltover’s finest, Caitlyn -- Mystic can play it all. Team WE will rely on his versatility when they come face-to-face with some of the Rift’s most feared bot lane duos at the 2017 Mid-Season Invitational.</p>","pl_PL":"Seongjun „Mystic” Jin zaczął profesjonalną karierę w ojczystej Korei Południowej z Jin Air Stealths w 2013 roku. Pod sam koniec 2014 roku zdecydował się przeprowadzić do Chin i drużyny Team WE Academy. Tam dokonał ryzykownego przejścia z dżungli do roli prowadzącego. Szybko zaaklimatyzował się na nowej pozycji, a Team WE to zauważyli. Dołączyli Mystica do swojego składu jako rezerwowego, a niedługo później ponownie awansowali na pozycję prowadzącego w pierwszym składzie, którą zajmuje od wiosny 2015 roku. Dobrze sobie radzi z różnorakimi bohaterami od inicjującej Kryształowej Strzały Ashe po potencjalnie prowadzącą sławę z Piltover, Caitlyn — Mystic potrafi grać wszystkimi. Team WE będą polegali na jego wszechstronności, gdy staną twarzą w twarz z kilkoma z najgroźniejszych duetów dolnej alei Summoner’s Rift podczas Mid-Season Invitational 2017.","es_ES":"Seongjun ''Mystic'' Jin comenzó su trayectoria profesional en su Corea del Sur natal con Jin Air Stealths en 2013. Al final de 2014, decidió trasladarse a China para formar parte de Team WE Academy. Fue en ese momento cuando hizo un arriesgado cambio de rol: de jungla a AD carry. No tardaría en adaptarse a su nueva posición, y Team WE lo tuvo en cuenta. Lo ascendieron a su plantilla principal como suplente y, poco después, pasaría a ser AD carry titular, posición que ha ocupado desde la primavera de 2015. Se siente cómodo con una gran variedad de campeones: desde la capacidad de iniciación de la Flecha de cristal de Ashe, al potencial para dominar la partida de la sheriff más sofisticada de Piltover, Caitlyn. Mystic es capaz de jugar con cualquier campeón. Team WE confiará en su versatilidad cuando se enfrenten cara a cara contra algunos de los dúos de bot más temidos de la Grieta en el Mid-Season Invitational 2017.","de_DE":"Seongjun „Mystic“ Jin begann seine professionelle Karriere 2013 in seiner Heimat, Südkorea, bei Jin Air Stealths. Gegen Ende des Jahres 2014 entschied er sich aber, nach China zu Team WE Academy zu wechseln. Dort wechselte er auch aus dem Dschungel auf die untere Lane, um dort als AD-Carry zu spielen. Er fand sich schnell in seine neue Rolle ein und machte so Team WE auf sich aufmerksam. Sie nahmen Mystic als Ersatzspieler in ihre Aufstellung auf und machten ihn im Frühjahr 2015 zum Haupt-AD-Carry. Er kommt mit vielen Champions zurecht: Von Ashes Kristallpfeil bis zur brutalen Schadensmaschine aus Piltover, Caitlyn – Mystic kann alles spielen. Team WE wird seine Vielseitigkeit brauchen, wenn sie es beim Mid-Season Invitational 2017 mit den gefürchtetsten Duos auf der unteren Lane zu tun bekommen.v","pt_BR":"<p>Seongjun “Mystic” Jin começou sua carreira profissional na Coreia do Sul, sua terra natal, com a Jin Air Stealths em 2013. Perto do fim de 2014, ele decidiu se mudar para a China e entrou para a Team WE Academy. Foi lá que ele fez a arriscada mudança de caçador para atirador. Ele se acostumou rapidamente à nova função, chamando a atenção da Team WE. Eles então promoveram Mystic à sua seleção como reserva e, pouco tempo depois, ele foi novamente promovido para a posição de atirador principal, que ocupa desde a metade inicial de 2015.</p>\n\n<p>Ele joga com diversos Campeões, sentindo-se confortável tanto com a iniciação da Flecha de Cristal da Ashe quanto com o potencial de carregar partidas da defensora de Piltover, Caitlyn. Mystic é a versatilidade em pessoa. A Team WE vai depender do grande repertório dele quando ficar cara a cara com algumas das duplas da rota inferior mais temidas do Rift no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Seongjun \"Mystic\" Jin</strong> comenzó su carrera profesional en su Corea del Sur nativa con los Jin Air Stealths en 2013. Cerca de finales de 2014 decidió mudarse a China y entrar a la academia del Team WE. Aquí hizo el peligroso cambio de junglero a tirador. Se acostumbró rápidamente al nuevo rol y el Team WE lo notó. Ascendieron a <strong>Mystic</strong> a su arsenal como suplente y no mucho después fue ascendido nuevamente a tirador principal, puesto en el cual ha permanecido desde la primavera de 2015. Se siente cómodo con una variedad de campeones, desde la iniciación de la Flecha de Cristal de Ashe, hasta el potencial de acarreador de la mejor de Piltóver: Caitlyn. <strong>Mystic</strong> puede jugar con todos. El Team WE confía en su versatilidad cuando se enfrenten a los dúos de carril inferior más temidos de la Grieta en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"994","TRLH1":"200000403","TRLH2":"200000303","TRLT3":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":603,"slug":"raison","name":"Raison","firstName":"Soobeen","lastName":"Jeong","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/raison-9vqm9g4s.png","hometown":"","region":"LMS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-09T23:20:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4366","TRLH1":"200000405"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":692,"slug":"condi","name":"Condi","firstName":"Renjie","lastName":"Xiang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/condi-9gseaajf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-07-07T18:00:19.000Z","bios":{"en_US":"<p>Renjie “Condi” Xiang is China’s resident Baron steal specialist, stealing more of the purple monster’s powers than any other jungler in the LPL since 2015. Since joining Team WE, Condi has been instrumental to their success. His in-your-face style, counter-jungling prowess, and potent dueling make him one of the most fearsome players on the Rift. With his aggressive style, he tends to favor dueling champions like Graves, Lee Sin, and Rek’Sai.</p>\n\n<p>Condi was instrumental in Team WE’s dismantling of Royals Never Give Up in the 2017 LPL Spring Split Finals. He consistently sliced through the enemy frontline and deleted the enemy damage dealers, turning even fights into blowouts. After the match, a tearful Condi couldn’t find any words except “I am so grateful to my teammates!” Let’s hope we see the same type of emotion and dominance as Condi travels to Rio to take on the world’s best at the 2017 Mid-Season Invitational.</p>","pl_PL":"Renjie „Condi” Xiang to chiński specjalista od wykradania Baronów. Skradł więcej mocy purpurowego potwora niż jakikolwiek inny dżungler w LPL od 2015 roku. Odkąd dołączył do Team WE, Condi stał się motorem sukcesu drużyny. Jego bezpośredni styl gry, sprawność w kontrowaniu dżunglowania i świetne umiejętności pojedynkowe sprawiają, że jest jednym z najgroźniejszych graczy na Summoner’s Rift. Ze względu na swój agresywny styl najchętniej wybiera pojedynkujących się bohaterów, takich jak Graves, Lee Sin i Rek’Sai. Condi odegrał główną rolę w rozbiciu przez Team WE drużyny Royal Never Give Up w finale wiosennego splitu LPL 2017. Regularnie przebijał się przez wrogą linię frontu i kasował zadających obrażenia przeciwników, zmieniając wyrównane walki w prawdziwą rzeź. Po meczu Condi ze łzami w oczach nie potrafił znaleźć innych słów niż: „Jestem tak bardzo wdzięczny moim kolegom z drużyny!”. Mamy nadzieję zobaczyć podobne emocje i dominację, gdy Condi wyruszy do Rio, by walczyć z najlepszymi na świecie podczas Mid-Season Invitational 2017.","es_ES":"Renjie ''Condi'' Xiang es el ladrón de Barones chino por excelencia, pues ha conseguido robar los efectos del monstruo morado más que ningún otro jungla de la LPL desde 2015. Desde que se unió a Team WE, Condi ha sido fundamental para el éxito del equipo. Su estilo enérgico, su habilidad para robar la jungla enemiga y su potente capacidad para batirse en duelo lo convierten en uno de los jugadores más temidos de la Grieta. Como su estilo es agresivo, suele optar por campeones capaces de batirse en duelo como Graves, Lee Sin o Rek'Sai. Condi fue una pieza clave para la victoria de Team WE contra Royal Never Give Up en la final del split de primavera de la LPL 2017. Consiguió de forma sistemática ignorar al frente enemigo y aplastar a sus campeones de daño, cambiando las tornas del combate a su favor. Tras la partida, con lágrimas en los ojos, Condi solo pudo articular las siguientes palabras: ''¡Les doy gracias infinitas a mis compañeros de equipo!''. Esperamos que se muestre igual de emocionado y dominante cuando viaje a Río para derrotar a los mejores del mundo en el Mid-Season Invitational 2017.","de_DE":"Renjie „Condi“ Xiang ist Chinas Experte, wenn es um das Stehlen von Barons geht (seit 2015 hat er sich die Kräfte des violetten Monsters häufiger zunutze gemacht, als alle anderen Jungler in der LPL)  Seit seinem Wechsel zu Team WE ist Condi für den Erfolg der Mannschaft unerlässlich. Sein aggressiver Stil, seine Stärke im gegnerischen Dschungel und seine Entscheidungen in Duellen machen ihn zu einem der gefährlichsten Spieler in der Kluft. Durch seine Aggressivität bevorzugt er Champions wie Graves, Lee Sin und Rek’Sai. Condi war maßgeblich daran beteiligt, dass Team WE Royal Never Give Up im Finale des Frühjahrs-Splits der LPL 2017 vernichten konnte. Er kämpfte sich immer wieder durch die Frontlinie seiner Gegner, vernichtete die feindlichen Carrys und machte aus ausgeglichenen Kämpfen Gemetzel. Das Einzige, was der überwältigte Condi nach dem Spiel sagen konnte war: „Ich bin meinen Mannschaftskameraden so dankbar!“ Hoffentlich sehen wir auch beim Mid-Season Invitational 2017 so viel Emotion und Dominanz, wo es Condi mit den Besten der Welt zu tun bekommt.","pt_BR":"<p>Renjie “Condi” Xiang é o especialista em roubos de Barão na China, tendo roubado o poder do monstro roxo mais vezes do que qualquer outro caçador da selva na LPL desde 2015. Desde que entrou para a Team WE, Condi tem sido crucial para o seu sucesso. Seu estilo de partir para cima, sua proeza em invasões da selva e seu forte desempenho em duelos fazem dele um dos jogadores mais temíveis no Rift. Com seu estilo agressivo, ele costuma preferir Campeões como Graves, Lee Sin e Rek’Sai. </p>\n\n<p>Condi foi fundamental para o desmantelamento da Royal Never Give Up por parte da Team WE na final da Etapa de Primavera da LPL 2017. Ele consistentemente rasgava a linha de frente inimiga e destruía os causadores de dano, transformando lutas equilibradas em vitórias unilaterais. Depois da partida, com lágrimas nos olhos, Condi conseguiu dizer apenas: “Sou muito grato aos meus companheiros de equipe!” Vamos torcer para ver o mesmo tipo de emoção e dominação agora que Condi viaja ao Rio para enfrentar os melhores do mundo no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Renjie “Condi” Xiang</strong> es el experto en robos de Barón de China, logra robar más de los poderes del monstruo morado que ningún otro junglero en el LPL desde 2015. Desde que se unió al Team WE, <strong>Condi</strong> ha sido clave para su éxito. Tiene un estilo de juego provocativo, destreza para el contrajungleo y es un duelista muy fuerte, lo que lo hace uno de los jugadores más atemorizantes de la Grieta. Con su estilo agresivo tiende a favorecer a los campeones duelistas como Graves, Lee Sin y Rek’Sai. Condi fue clave para el desmantelamiento de los Royal Never Give Up en manos del Team WE en las finales del 2017 del Torneo de Apertura LPL. Abrió la línea frontal del enemigo constantemente y eliminó a todos los enemigos que infligían daño para convertir las peleas justas en palizas. Después de la partida, <strong>Condi</strong> estaba lleno de lágrimas y no podía decir otra cosa más que: <i>\"¡Estoy tan agradecido con mis compañeros!\"</i> Esperamos ver el mismo tipo de emoción y dominio mientras <strong>Condi</strong> viaja a Río para participar en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"4218","TRLH1":"200000401","TRLH2":"200000301","TRLT3":"200000229"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1038,"slug":"957","name":"957","firstName":"Changyu","lastName":"Ke","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/957-fcqbzhtx.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:09.000Z","updatedAt":"2017-07-07T17:52:32.000Z","bios":{"en_US":"<p>Changyu “957” Ke kicked off his career in 2015 as the starting top laner for Team WE’s developmental squad, Team WE Future. It was there that he established himself as a reliable option and as his repertoire grew, his sister team began to take notice. In early 2016, 957 made the jump to Team WE’s LPL squad where he made an immediate difference. His steady, low maintenance play on stalwarts like Maokai, Poppy, and Nautilus provided Team WE with a dependable presence in the top lane.</p>\n\n<p>He requires notoriously low resources in game, freeing up his teammates to farm gold and kills to their heart’s content. He doesn’t mind though, because once opponents come up against him late game, chances are that he’s already an unkillable mega tank. 957’s consistency will truly be tested as he heads to Rio to clash with the best top laners the world has to offer at the 2017 Mid-Season Invitational.</p>","de_DE":"Changyu „957“ Ke begann seine Karriere 2015 als Top-Laner für die Entwicklungsmannschaft von Team WE, Team WE Future. Dort konnte er sich als verlässliche Option etablieren und als er sich weiter steigerte, wurde seine Schwestermannschaft auf ihn aufmerksam. Anfang des Jahres 2016 wechselte 957 schließlich zu Team WE in die LPL, wo er sofort einen Unterschied ausmachte. Seine stabilen Leistungen mit Champions wie Maokai, Poppy und Nautilus verliehen Team WE eine verlässliche Präsenz auf der oberen Lane. Er benötigt nur sehr wenige Ressourcen und überlässt das Gold und die Tötungen seinen Mannschaftskameraden. Aber das stört ihn nicht, denn wenn die Gegner ihm im späten Spiel zu Leibe rücken, ist er in der Regel bereits ein unsterblicher Mega-Tank. Beim Mid-Season Invitational 2017 in Rio wird 957s Beständigkeit auf die Probe gestellt, wenn er es mit den besten Top-Lanern der Welt zu tun bekommt.","es_ES":"Changyu ''957'' Ke comenzó su trayectoria en 2015 como top titular del grupo en desarrollo de Team WE, Team WE Future. A partir de entonces, demostró ser una opción fiable y, a medida que él fue aumentando su repertorio de campeones, el equipo hermano de Team WE comenzó a hacerse notar. A comienzos de 2016, 957 se unió al grupo de la LPL de Team WE y no tardaría en marcar la diferencia. Su estilo de juego estable y de bajo mantenimiento, con campeones resistentes como Maokai, Poppy y Nautilus, aportó a Team WE una presencia de fiar en la calle superior. Necesita muy pocos recursos durante la partida, lo que permite que sus compañeros de equipo puedan farmear y llevarse asesinatos libremente. Y eso no es algo que le afecte, pues cuando los oponentes intenten enfrentarse a él al final de la partida, es probable que ya sea un megatanque inmortal. La estabilidad de 957 será puesta a prueba en Río cuando se enfrente a los mejores jugadores de la calle superior del mundo en el Mid-Season Invitational 2017.","fr_FR":"Changyu „957” Ke rozpoczął karierę w 2015 roku jako główny górny rozwojowego składu Team WE, Team WE Future. Tam pokazał, że jest solidnym zawodnikiem i gdy rozszerzył swój repertuar, siostrzana drużyna zaczęła na niego zwracać uwagę. Na początku 2016 roku 957 przeszedł do występującego w LPL składu Team WE i osiągnięcia drużyny natychmiast się poprawiły. Jego równa, zużywająca niewiele zasobów gra podporami drużyny, takimi jak Maokai, Poppy i Nautilus, zapewniła Team WE stałą obecność na górnej alei. 957 w dalszym ciągu zużywa niewiele zasobów w grze, umożliwiając kolegom farmienie złota i zabójstw, ile dusza zapragnie. Nie przeszkadza mu to wcale, ponieważ gdy przeciwnicy ruszą przeciwko niemu w późnej fazie gry, są duże szanse na to, że będzie już wtedy niemożliwym do zabicia megaobrońcą. Konsekwentny styl gry 957 zostanie poddany prawdziwej próbie, gdy zawodnik pojedzie do Rio, by zetrzeć się z najlepszymi górnymi, jakich ma do zaoferowania świat, na Mid-Season Invitational 2017.","pt_BR":"<p>Changyu “957” Ke começou sua carreira em 2015 como o jogador da rota superior da equipe de formação da Team WE, a Team WE Future. Foi lá que ele se estabeleceu como uma opção confiável, e à medida que seu repertório cresceu, sua equipe irmã começou a prestar atenção nele. No início de 2016, 957 foi transferido para a equipe da LPL da Team WE, onde logo de cara fez a diferença. Seu desempenho estável e econômico com Campeões como Maokai, Poppy e Nautilus fez dele uma presença sustentadora para a Team WE na rota superior. </p><p>Ele consome pouquíssimos recursos no jogo, permitindo que seus companheiros de equipe coletem ouro e abates à vontade. E ele não se importa, porque quando seus oponentes o enfrentam nos estágios mais avançados do jogo, ele geralmente já virou um mega tanque simplesmente invencível. A consistência de 957 será colocada à prova em seu rumo ao Rio, onde ele enfrentará os melhores jogadores da rota superior que o mundo tem a oferecer no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Changyu \"957\" Ke</strong> comenzó su carrera en 2015 como el carrilero superior del escuadrón en desarrollo del Team WE, el Team WE Future. Ahí se estableció como una opción confiable y mientras su repertorio crecía su equipo hermano comenzó a notarlo. A principios del 2016, <strong>957</strong> pasó al escuadrón LPL del Team WE, en donde hizo una diferencia inmediatamente. Su juego firme, pero de bajo mantenimiento con opciones fuertes como Maokai, Poppy y Nautilus brindan al Team WE una presencia confiable en el carril superior. Él necesita recursos increíblemente bajos en una partida, lo que permite que sus compañeros coleccionen oro y asesinatos como les apetezca. No le molesta porque cuando los oponentes lo enfrentan en el juego tardío, es probable que ya sea un megatanque inmortal. La coherencia de <strong>957</strong> será puesta a prueba mientras se dirige hacia Río para enfrentarse con los mejores carrileros superiores del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000400","TRLH2":"200000300","TRLT3":"200000228"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1428,"slug":"ben","name":"Ben","firstName":"Donghyun","lastName":"Nam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben-1yppxrjt.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:25:24.000Z","updatedAt":"2017-07-07T22:23:11.000Z","bios":{"en_US":"<p>Donghyun “Ben” Nam started his professional career in the summer of 2016 when he was signed by Invictus Gaming. He unfortunately didn’t have many chances to showcase his talent when he was with Invictus, but since joining Team WE in late 2016, he’s been able to show glimpses of his mechanical prowess on the Rift. He was largely unknown before joining up with Team WE, but the LPL has been abuzz with his name ever since.</p>\n\n<p>It took him awhile to sync up with lane mate Mystic, but with his mechanical ceiling many fans are clamoring for more from him. After helping his team sweep Royal Never Give Up in the finals, Ben has the chance to show the world how supports can carry games. He’s looking to shine as he squares off against international competition for the first time at the 2017 Mid-Season Invitational.</p>","de_DE":"Donghyun „Ben“ Nam begann seine professionelle Karriere im Sommer 2016, als er bei Invictus Gaming unterschrieb. Leider konnte er bei Invictus sein Talent nur selten unter Beweis stellen, aber seit seinem Wechsel zu Team WE Ende 2016 stellte er immer wieder sein mechanisches Können unter Beweis. Vor seinem Wechsel zu Team WE war er noch Großteils unbekannt, aber seither kennt die ganze LPL seinen Namen. Es hat eine Weile gedauert, bis er sich auf seinen Lane-Partner Mystic eingestellt hatte, aber aufgrund seines mechanischen Könnens erwarten viele Fans noch mehr von ihm. Nachdem er seiner Mannschaft im Finale des Frühjahrs-Splits der LPL geholfen hat, mit Royal Never Give Up den Boden aufzuwischen, bekommt Ben jetzt die Chance, der Welt zu zeigen, wie man als Supporter Spiele entscheidet. Er wird sein Bestes geben, wenn er beim Mid-Season Invitational 2017 auf die internationale Konkurrenz trifft.","es_ES":"Donghyun ''Ben'' Nam comenzó su carrera profesional en el verano de 2016, cuando fue fichado por Invictus Gaming. Por desgracia, no tuvo muchas oportunidades para mostrar su talento cuando jugó con Invictus, pero desde que se unió a Team WE al final de 2016, ha podido hacer gala de sus destrezas en la Grieta. No era apenas conocido cuando se unió a Team WE, pero su nombre no ha dejado de repetirse en la LPL desde entonces. Tardó un tiempo en congeniar con su compañero de calle, Mystic, pero sus capacidades mecánicas son tan buenas que sus fans aún quieren más. Tras ayudar a su equipo a vencer a Royal Never Give Up en la final, Ben ahora tiene la oportunidad de demostrarle al mundo que los apoyos también pueden liderar a su equipo hasta la victoria. Intentará darlo todo cuando pise el escenario internacional por primera vez en el Mid-Season Invitational 2017.","pl_PL":"Donghyun „Ben” Nam zaczął profesjonalną karierę latem 2016 roku, gdy został zwerbowany przez Invictus Gaming. Niestety nie miał wielu okazji, by zademonstrować swój talent, grając z Invictus, dopiero odkąd dołączył do Team WE pod koniec 2016 roku może się popisywać umiejętnościami mechanicznymi na Summoner’s Rift. Przed dołączeniem do Team WE nie był szerzej znany, ale od tamtej pory LPL nie przestaje o nim mówić. Zgranie się z kolegą z alei, Mysticem, zajęło mu trochę czasu, jednak teraz fani domagają się od niego jeszcze więcej, znając górny pułap jego umiejętności mechanicznych. Po tym, jak pomógł swojej drużynie zmieść Royal Never Give Up w finale, Ben ma szansę pokazać światu, że wspierający także potrafią prowadzić do zwycięstwa w grach. Podczas swojego pierwszego starcia z rywalami z całego świata na Mid-Season Invitational 2017 na pewno spróbuje zabłysnąć.","pt_BR":"<p>Donghyun “Ben” Nam começou sua carreira profissional na metade de 2016, quando foi contratado pela Invictus Gaming. Ele infelizmente não teve muitas oportunidades de demonstrar seu talento enquanto esteve na Invictus, mas desde que entrou para a Team WE no final de 2016, temos tido vislumbres da sua proeza mecânica no Rift. Ele era bastante desconhecido antes de se juntar à Team WE, mas desde então seu nome é um dos mais citados na LPL. </p>\n\n<p>Sua sincronia com seu companheiro de rota, Mystic, não foi imediata, mas com seu alto nível de mecânica, muitos fãs estão ansiosos para vê-lo jogar mais. Após ter ajudado sua equipe a massacrar a Royal Never Give Up na final, Ben agora tem a chance de mostrar ao mundo como suportes podem carregar partidas. Ele pretende brilhar no Mid-Season Invitational 2017, onde enfrentará competidores internacionais pela primeira vez.</p>","es_AR":"<p><strong>Donghyun \"Ben\" Nam</strong> comenzó su carrera profesional en el verano de 2016 cuando entró a Invictus Gaming. Por desgracia, no tuvo muchas oportunidades de demostrar su talento cuando estuvo en Invictus, pero desde que se unió al Team WE a fines de 2016, ha podido mostrar destellos de su poderío mecánico en la Grieta. No era famoso antes de unirse al Team WE, pero LPL no deja de oír su nombre desde entonces. Le tomó un tiempo sincronizarse con su compañero de carril, <strong>Mystic</strong>, pero debido a sus habilidades mecánicas muchos seguidores lo aclaman. Después de ayudar a su equipo a ganar el Royal Never Give Up en las finales, <strong>Ben</strong> tuvo la oportunidad de mostrarle al mundo cómo los soportes pueden ser acarreadores en las partidas. Busca destacar en la competencia internacional por primera vez en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000406","TRLH2":"200000306"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1991,"slug":"zbb","name":"Zbb","firstName":"Zhi","lastName":"Ke","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:24:21.000Z","updatedAt":"2017-06-07T00:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1992,"slug":"laozhou","name":"Laozhou","firstName":"Chao","lastName":"Zhou","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:17:21.000Z","updatedAt":"2017-07-07T17:53:44.000Z","bios":{},"foreignIds":{"TRLT3":"200000233"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163}],"scheduleItems":[{"id":"AVvpJRwTQMQFcjhwbQz3","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:7182281e-b3d9-4002-859a-3b306222cc0b","scheduledTime":"2017-05-13T18:00:00.739+0000","tags":{"blockLabel":"4","blockPrefix":"day","subBlockLabel":"Sub Block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:ecc482a1-3d62-480d-8e84-b46e28317fa7","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"7182281e-b3d9-4002-859a-3b306222cc0b","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"ecc482a1-3d62-480d-8e84-b46e28317fa7","league":"10"}],"gameIdMappings":[{"id":"56f39325-afb2-4a34-b581-da0309d662ff","gameHash":"f2c7aa22e4c07abf"}],"videos":[{"id":6854,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:56f39325-afb2-4a34-b581-da0309d662ff","source":"https://www.youtube.com/embed/dZ_ZmCzmwpE","createdAt":"2017-05-13T19:03:51.000Z","updatedAt":"2017-05-13T19:03:51.000Z","game":"56f39325-afb2-4a34-b581-da0309d662ff"},{"id":6856,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:56f39325-afb2-4a34-b581-da0309d662ff","source":"https://www.youtube.com/embed/IOS6tNuB31s?wmode=transparent","createdAt":"2017-05-13T20:39:24.000Z","updatedAt":"2017-05-13T20:39:24.000Z","game":"56f39325-afb2-4a34-b581-da0309d662ff"},{"id":6881,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:56f39325-afb2-4a34-b581-da0309d662ff","source":"https://www.youtube.com/watch?v=MhL6qbVIqoE&wmode=transparent","createdAt":"2017-05-15T14:01:28.000Z","updatedAt":"2017-05-15T14:01:28.000Z","game":"56f39325-afb2-4a34-b581-da0309d662ff"},{"id":6981,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:56f39325-afb2-4a34-b581-da0309d662ff","source":"https://www.youtube.com/embed/_hzuPcV-iwA","createdAt":"2017-05-29T04:07:53.000Z","updatedAt":"2017-05-29T04:07:53.000Z","game":"56f39325-afb2-4a34-b581-da0309d662ff"}],"htmlBlocks":[],"match":{"id":"7182281e-b3d9-4002-859a-3b306222cc0b","name":"WE-vs-G2","position":5,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"},{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}],"games":{"56f39325-afb2-4a34-b581-da0309d662ff":{"id":"56f39325-afb2-4a34-b581-da0309d662ff","name":"G1","generatedName":"G2|WE|G1|7182281eb3d94002859a3","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"},{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}],"standings":{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1496030732923,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494856777425,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494708149982,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702536194,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702422304,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702135946,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002190242","gameRealm":"TRLH1","platformId":"TRLH1:1002190242","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1496030732923,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494856777425,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494708149982,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702536194,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702422304,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"0ca447eb-fd4e-4fea-8601-159f91554ef7"}],[{"roster":"14f9851a-a22d-4876-8fdf-5598adcd6fd7"}]],"timestamp":1494702135946,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"14f9851a-a22d-4876-8fdf-5598adcd6fd7":0,"0ca447eb-fd4e-4fea-8601-159f91554ef7":1}}}