{"teams":[{"id":18,"slug":"cloud9","name":"Cloud9 ","guid":"be6c8a00-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cloud9-gnd9b0gn.png","acronym":"C9","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-01T18:45:39.000Z","updatedAt":"2017-08-02T22:06:55.000Z","bios":{"en_US":"<p>The dream meme team is back for 2017 with some promising new additions. Although Cloud9 performed the best of any North American team at the 2016 World Championship, they weren’t satisfied with their quick exit in the quarterfinals. Former Challenger scene standout Contractz was handed the reigns to the jungle in his rookie season. The team also acquired Ray, Apex Gaming’s former playmaking top laner. \n\n<p>Despite a strong split, the team once again fell to TSM in the 2017 NA LCS Spring Split finals. Heading into summer, if Cloud9's young players can hone their raw talent, the team could rise to new heights this year.</p>\n\n<p>Coach: Han-gyu \"Reapered\" Bok<p>","fr_FR":"<p>Cloud9 a fait une entrée fracassante sur la scène compétitive de League of Legends pendant la saison 3, lors du segment d'été des LCS NA, avec un score astronomique de 25-3. Suite à ses débuts spectaculaires, l'équipe a fait plusieurs apparitions lors de championnats régionaux et internationaux, allant des play-offs régionaux des LCS NA au Championnat du monde. Toutefois, Cloud9 est tombée de son piédestal en 2015, retombant à la 7e place du segment d'été des LCS NA 2015. Malgré un parcours bien ficelé jusqu'en finale du tournoi régional NA 2015 qui a valu à C9 de se qualifier pour le Championnat du monde 2015, les performances de l'équipe ont soulevé de nombreuses questions. Reste à savoir si ses membres possèdent encore le talent nécessaire pour s'imposer comme ils ont su le faire par le passé.</p>","pl_PL":"<p>C9 to, obok Teamu SoloMid, najbardziej utytułowana amerykańska organizacja w historii. Cloud9 znane jest z utrzymywania nieustannie wysokiego poziomu oraz przywiązania do graczy. Podczas gdy inne drużyny dokonują co najmniej kilku zmian rocznie, w zespole, której symbolem jest niebieska chmurka, przez pierwsze dwa lata współpracy… nie było żadnych rotacji.</p>\n<p> \nZaczęło się zwyczajnie, od przygody z Quantic Gaming, gdzie w 2012 roku występował obiecujący skład złożony z Haia, LemonNationa, Nientosoha, Wild Turtle’a i Yazukiego. Pierwsze podejście drużyny do NA LCS było nieudane, ale na początku 2013 roku gracze i organizacja zdecydowali się dać sobie drugą szansę w nieco zmienionym składzie, a do zespołu dołączyli Balls, Meteos i Sneaky. Formacja bez trudu przeszła eliminacje i po zwycięstwie w meczu barażowym dostała się do letniego splitu NA LCS 2013. Miała to być dopiero druga edycja rozgrywek, a jednocześnie początek legendy Cloud9.</p>\n<p>\nByło powszechnie wiadomo, że nowy zespół w stawce jest naprawdę dobry, ale nie że aż tak dobry. Cloud9 całkowicie zdominowało rozgrywki, ustanawiając niewyobrażalny rekord 25-3, bo tyle wynosił bilans drużyny na koniec sezonu zasadniczego. C9 nie zamierzało jednak poprzestawać na wygraniu sezonu zasadniczego i w play-offach poszło za ciosem – 2:0 z Dignitas i 3:0 z TSM-em w finale zapewniły beniaminkowi triumf w debiutanckim splicie w NA LCS.</p>\n<p>\nTo z kolei pozwoliło Cloud9 na wyjazd na Mistrzostwa Świata. Oczekiwania kibiców były ogromne, ale zespół nie sprostał presji, odpadając z rywalizacji w swoim pierwszym meczu, w ćwierćfinale przeciwko Fnatic. Tę klęskę C9 powetowało sobie na krajowym podwórku – rok 2014 znów stał pod znakiem niebieskobarwnej dominacji, czego dowodzi kolejny fantastyczny split zakończony wynikiem 24-4 i triumf w wiosennych play-offach. Latem z formą zespołu było już nieco gorzej, a wygranie fazy zasadniczej przyszło C9 z dużym trudem. Ostatecznie w finale play-offów Cloud9 było zmuszone uznać wyższość Teamu SoloMid. Wystarczyło to, by po raz kolejny pojechać na światowy czempionat i niestety po raz kolejny zawodnicy C9 wracali ze spuszczonymi głowami po odpadnięciu w ćwierćfinale.</p>\n<p>\nWiosna 2015 była już łabędzim śpiewem formacji, której po raz kolejny udało się dostać do finału play-offów NA LCS. Tam jednak nie sprostali świetnie dysponowanemu Teamowi SoloMid, który po raz drugi z rzędu zwyciężył w rozgrywkach, jednocześnie po raz drugi spychając C9 na drugą pozycję.</p>\n<p>\nTo jednak był dopiero początek problemów zespołu, który coraz bardziej oddalał się od swoich najlepszych czasów. Narastające wewnętrzne problemy oraz uciążliwe kontuzje zmusiły Haia „Haia” Lama do rezygnacji z występów. Legendę zespołu zastąpił na środkowej alei ogromny duński talent, Nikolaj „Incarnati0n” Jensen, który został właśnie dopuszczony do grania na profesjonalnej scenie. Szybko okazało się jednak, że Incarnati0n potrzebuje trochę czasu na aklimatyzację, a cały zespół – Haia. Zastąpienie doświadczonego shot-callera okazało się niemożliwe i gra zespołu, który okupował dolne rejony tabeli, nie wyglądała najlepiej. Hai wrócił, zastępując Williama „Meteosa” Hartmana w roli dżunglera i doprowadził formację do utrzymania, a dzięki niezłej wiośnie, drużyna dostała się również do baraży o wyjazd na Mistrzostwa Świata. I znów – udało się. Co ciekawe, C9 było w tym splicie bliskie odpadnięcia z rywalizacji, a bezpieczne, siódme miejsce wywalczyło dopiero w dodatkowym meczu barażowym przeciwko Teamowi 8.</p>\n<p>\nNa MŚ, po pierwszej rundzie fazy grupowej, wydawało się, że sen C9 będzie trwał – drużyna wygrała wszystkie trzy mecze i mogło było odnieść wrażenie, że tylko kataklizm może pozbawić ją miejsca w ćwierćfinale. No cóż – trzy porażki i przegrana w barażach o drugie miejsce okazały się właśnie takim kataklizmem. Nie udało się. Zespół przygotowuje się do sezonu 2016 bogatszy o ostatnie doświadczenia i zamierza powrócić na pierwsze miejsce, a pomóc mają interesujące zmiany w składzie.</p>\n<p>\nW przerwie między rozgrywkami Hai przeniósł się na pozycję wspierającego, którą pełnić będzie wespół z utalentowanym Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity. Pozycję dżunglera zajął natomiast rozchwytywany po rozpadzie Teamu Impulse Koreańczyk Lee „Rush” Yoon-jae, który był objawieniem sezonu 2015 w NA LCS.</p>\n","de_DE":"Das Meme-Dream-Team kehrt 2017 mit einigen vielversprechenden Neuzugängen zurück. Obwohl Cloud9 das beste nordamerikanische Team bei der Weltmeisterschaft 2016 war, gaben sie sich mit dem schnellen Ausscheiden im Halbfinale nicht zufrieden. Contractz, der vor allem durch seine Leistungen in der Challenger Series bekannt wurde, übernimmt in seiner ersten Saison die Führung im Dschungel. Das Team hat außerdem Ray aufgenommen, der früher als Spielmacher bei Apex Gaming in der oberen Lane tätig war. Wenn sie es schaffen, ihr rohes Talent mit den Führungsqualitäten der Veteranen zu kombinieren, könnte Cloud9 dieses Jahr neue Höhen erklimmen.</p>\n<p>\nCoach: Trainer: Han-gyu „Reapered“ Bok</p>\n","es_ES":"<p>Nadie puede discutir que el camino para llegar al Mundial de Cloud9 ha sido más duro que el de ningún otro equipo. Tras una dolorosa derrota contra TSM en la final de la LCS NA, el equipo consiguió una vez más superar el clasificatorio regional y reservarse el último puesto para representar a Norteamérica en el Mundial. Ha sido un viaje agotador, pero la experiencia seguro que no tiene precio. Cloud9 ya ha jugado cinco enfrentamientos al mejor de 5 sin haber pisado aún siquiera el escenario del Mundial.</p> \n<p>Tras una temporada regular durante la que tuvieron problemas de coordinación en algunos momentos, han jugador de forma mucho más coherente durante los playoffs. Si pueden sacar provecho de su arduo camino hasta el Mundial, van a ser una fuerza a tener en cuenta en el escenario internacional.</p>","pt_BR":"É difícil negar que alguma outra equipe teve um caminho mais árduo para o Mundial do que a Cloud9. Depois de uma derrota arrasadora para a TSM nas Finais de Verão da NA LCS, a equipe se reergueu e lutou mais uma vez pelas Classificatórias Regionais para conseguir a última vaga da América do Norte para o Mundial. A jornada foi difícil, mas a experiência pode ter sido de grande valor. Cloud9 agora já jogou cinco partidas separadas de Melhor de 5 antes mesmo de ir para o Mundial. Depois de uma temporada regular que mostrou algumas dificuldades em sinergia, eles estavam muito mais coesos nas eliminatórias. Se eles puderem usar seu árduo caminho para o Mundial como uma vantagem, eles certamente serão uma força a ser reconhecida no palco internacional","es_AR":"<p>Es muy difícil encontrar un equipo que haya luchado más que Cloud9 para llegar al Mundial. Después de una desgarradora derrota ante TSM en la final del torneo de clausura de la LCS NA, el equipo se repuso y volvió a competir en las clasificatorias regionales para ganarse el último boleto de Norteamérica al Mundial. Fue una hazaña agotadora, pero la experiencia obtenida es una recompensa invaluable. Cloud9 ya ha jugado cinco combates al mejor de cinco antes de aparecer en el Mundial. Aunque tuvieron problemas para trabajar bien en grupo en la temporada regular, supieron complementarse mucho más en las eliminatorias. Si saben aprovechar la experiencia obtenida en el arduo camino que atravesaron para llegar al Mundial, serán una fuerza que dejará su huella en el escenario internacional.</p>\n\n<p><strong>Entrenador: Han-gyu \"Reapered\" Bok</strong></p>"},"foreignIds":{"drupalId":"304"},"players":[45,115,163,255,482,499,508,1120],"starters":[45,115,482,499,1120],"subs":[163,255,508]},{"id":264,"slug":"flyquest","name":"FlyQuest","guid":"be7244a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flyquest-89bnqpyh.png","acronym":"FLY","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2017-01-05T18:49:16.000Z","updatedAt":"2017-06-23T01:31:34.000Z","bios":{"en_US":"<p>Formerly Cloud9 Challenger, FlyQuest is about to reap the rewards of its Challenger Series success. The team’s mix of ex-Cloud9 veterans and fresh talent saw them rampage their way through to the 2017 NA LCS Spring Promotion Tournament, earning a spot in the NA LCS.</p>\n\n<p>Behind veteran mid laner Hai’s leadership, the team found unexpected success in the 2017 NA LCS Spring Split. LemonNation played the mastermind with his signature notebook, and Balls served as the team’s muscle in the top lane. Maybe you can teach old dogs new tricks.</p>\n\n<p>Coach: Thomas \"ThinkCard\" Slotkin</p>","de_DE":"FlyQuest, ehemals Cloud9 Challenger, ist drauf und dran, für ihren Erfolg in der Challenger Series belohnt zu werden. Mit einer Mischung aus alten Cloud9-Veteranen und neuen Talenten marschierten sie durch das Frühjahrs-Aufstiegsturnier der NA LCS 2017 und haben sich damit einen Platz in der NA LCS gesichert.\n</p>\nTrotz des neuen Besitzers bleibt die Mannschaft größtenteils unverändert. Unter der Führung des Mid-Laner-Veteranen Hai hat das Team hohe Erwartungen für 2017. LemonNation ist mit seinem unverkennbaren Notizblock zurück und Balls ist bereit, als treibende Kraft in der oberen Lane zu fungieren. Sollte FlyQuest Erfolg haben, sind sie der Beweis dafür, dass man auch einem alten Fuchs neue Tricks beibringen kann.\n"},"foreignIds":{},"players":[57,112,114,116,354,500,549],"starters":[57,112,114,116,549],"subs":[354,500]}],"players":[{"id":45,"slug":"impact","name":"Impact","firstName":"Eonyoung","lastName":"Jeong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/impact-8a44ib2j.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-07-04T19:26:43.000Z","bios":{"en_US":"<p>Former World Champion Eonyoung “Impact” Jeong isn’t quite ready to hang up the mouse and keyboard. The former SK Telecom T1 top laner put on a show in the 2016 NA LCS Playoffs, proving no other top laner in North America measured up. While his regular season was uninspiring, he almost singlehandedly earned Cloud9 a spot at the 2016 World Championship.</p>\n\n<p>Unfortunately, Impact struggled to find his groove on the world stage. Cloud9 was the only NA team to earn a quarterfinals berth, but they were quickly eliminated by Samsung Galaxy. As the shield to Ray's sword, the dynamic duo dominated the competition in the 2017 NA LCS Spring Split. With such talent in the top lane, Cloud9’s opponents’ nightmares will be just two words, repeating forever: “top die.”</p>","fr_FR":"<p>L'ancien champion du monde Eonyoung \"Impact\" Jeong n'est pas prêt à raccrocher souris et clavier. Après un segment d'été des LCS NA peu inspiré, l'ancien top laner de SK Telecom T1 a eu le vent en poupe durant les play-offs. Aucun autre top laner en Amérique du Nord n'est arrivé à la hauteur de ses performances lors des play-offs, et Cloud9 doit une grande partie de son succès post-saison à son jeu spectaculaire, ce qui a également permis de mettre un terme aux problèmes de communication qui affectaient Cloud9.</p>\n\n<p>En dépit de sa domination régionale, Impact a eu du mal à trouver ses marques dans le Championnat du monde cette année. Alors qu'il s'est montré inébranlable sur la voie du haut pour Cloud9 durant les play-offs, il a trouvé des adversaires à sa hauteur avec les top laners Duke de SK Telecom T1 et CuVee de Samsung Galaxy. Toutefois, Impact et les autres joueurs de Cloud9 ont le mérite d'être la seule équipe d'Amérique du Nord à avoir atteint les quarts de finale, et Impact les représentera lors de l'événement All-Stars. Avec 41,7 pour cent du vote top laner, il aura une chance supplémentaire cette année de \"déchirer la voie du haut\".</p>","pl_PL":"Były Mistrz Świata, Eonyoung „Impact” Jeong, nie zamierza jeszcze zawiesić na kołku mysz i klawiatury. Po niezbyt udanych występach w letnim splicie NA LCS dawny górny SKTelecom T1 szalał w fazie pucharowej. Żaden inny górny w Ameryce Północnej nie dorównywał formą Impactowi podczas playoffów, a Cloud9 zawdzięczają w dużej mierze swój sukces po sezonie jego znakomitej grze. Rozwiały się także wątpliwości dotyczące problemów z komunikacją wewnątrz Cloud9.\n</p>\nPomimo dominacji w regionie, Impact nie potrafił odnaleźć się w tym roku na Mistrzostwach Świata. Chociaż podczas fazy pucharowej na górnej alei Cloud9 był nie do ruszenia, znalazł równych sobie w postaci górnego SK Telecom T1, Duke’a i CuVee z Samsung Galaxy. Mimo to, Impact i reszta Cloud9 zasługują na uznanie jako jedyna drużyna z Ameryki Północnej, która dotarła do ćwierćfinałów. Wkrótce Impact będzie ją reprezentował na wydarzeniu All-Star. Mając 41,7 procenta głosów na górnego, dostanie w tym roku jeszcze jedną szansę, by pokazać jak „góra umiera”.\n","de_DE":"Der ehemalige Weltmeister Eonyoung „Impact“ Jeong ist noch nicht bereit, Maus und Tastatur an den Nagel zu hängen. Der ehemalige Top-Laner von SK Telecom T1 hat bei den Entscheidungsspielen der NA LCS 2016 eine Show abgeliefert und damit bewiesen, dass ihm kein Top-Laner in Nordamerika das Wasser reichen kann. Obwohl seine Leistungen in der regulären Saison uninspiriert waren, hat er Cloud9 fast im Alleingang zur Weltmeisterschaft 2016 geführt.</p>\n<p>\nLeider hatte Impact bei der Weltmeisterschaft Probleme damit, seinen Rhythmus zu finden. Cloud9 war das einzige nordamerikanische Team, das sich einen Platz im Viertelfinale sichern konnte, allerdings sind sie anschließend direkt an Samsung Galaxy gescheitert. In diesem Frühjahrs-Split wird Impact versuchen, auf einem noch höheren Level zu spielen. Darüber hinaus wird er Ray, seinen neuen Teamkollegen, unter seine Fittiche nehmen. Der talentierte Top-Laner wird den Gegnern von Cloud9 Albträume bescheren, in denen sich zwei Worte unendlich wiederholen: „top die“.\n","es_AR":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","es_ES":"<p>Aún no ha llegado el momento de que el que fuera campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del split de verano de la LCS NA poco inspirado, el exjugador de la calle superior de SK Telecom T1 lo dio todo en los playoffs. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallan las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en la calle superior para Cloud9 durante los playoffs, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su jugador de la calle superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para la calle superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","pt_BR":"<p>Ex-campeão do mundo, Eoyoung “Impact” Jeong ainda não está preparado para pendurar o mouse e o teclado. Após um começo nada inspirador na Etapa de Verão da NA LCS, o ex-topo da SK Telecom T1 arrasou nas eliminatórias. Nenhum outro jogador de topo da América do Norte chegou perto de seu desempenho, e a Cloud9 deve de seu sucesso de pós-temporada à sua mecânica incrível, que também acabou com as preocupações de comunicação interna da equipe.</p>\n\n<p>Apesar da dominância regional, Impact teve dificuldades em se manter constantemente bem no Campeonato Mundial deste ano. Apesar de ter sido imprescindível na rota do topo para a Cloud9 durante as eliminatórias, ele encontrou adversários à altura como Duke, da SK Telecom T1 e CuVee, da Samsung Galaxy. Impact e o restante da Cloud9 merecem o crédito de terem sido a única equipe da América do Norte a chegar nas quartas-de-final, fazendo dele o representante da equipe para o Evento All-Star. Com 41,7% dos votos da rota do topo, ele terá mais uma chance de acabar com o topo.</p>","cs_CZ":"<p>Bývalý mistr světa Eonyoung „Impact“ Jeong ještě není připraven pověsit klávesnici a myš na hřebík. Po neslaném nemastném letním splitu severoamerického LCS se v play-off tento dřívější horní lajnař z SK Telecom T1 doslova utrhl ze řetězu. Žádný jiný horní lajnař ze Severní Ameriky se s jeho formou ve vyřazovací části turnaje nemohl měřit a Cloud9 za svůj úspěch z velké části vděčili právě jeho hvězdným výkonům, čímž navíc vzaly zasvé obavy, že se Cloud9 potýká s komunikačními problémy.</p>\n\n<p>Ačkoliv ve svém regionu řádil Impact jako černá ruka, na letošním mistrovství světa se mu už tak skvěle nedařilo. Během vyřazovacích zápasů byl sice v horní lajně pro Cloud9 cennou oporou, našel však sobě rovné v Dukovi z SK Telecom T1 a v CuVeem ze Samsung Galaxy. Přesto si Impact a zbytek Cloud9 zaslouží uznání za to, že se stali jediným severoamerickým týmem, který se probojoval do čtvrtfinále, a Impact bude tento region reprezentovat i na turnaji All-Star. Z hráčů v horní lajně obdržel 41,7 % hlasů a bude tak mít letos ještě jednu šanci provést svůj klasický „top die“.</p>","el_GR":"<p>Ο πρώην Παγκόσμιος Πρωταθλητής Eonyoung “Impact” Jeong δεν είναι ακόμα έτοιμος να κρεμάσει το ποντίκι και το πληκτρολόγιό του. Μετά από ένα απογοητευτικό Summer Split στο LCS Βόρειας Αμερικής, ο πρώην παίκτης επάνω λωρίδας των SK Telecom T1 έκανε μια καταπληκτική εμφάνιση στα πλέι οφ. Κανένας άλλος παίκτης επάνω λωρίδας στη Βόρεια Αμερική δεν μπόρεσε να συγκριθεί μαζί του στα πλέι οφ και οι Cloud9 οφείλουν μεγάλο μέρος της επιτυχίας τους στους αγώνες μετά το τέλος της σεζόν στην εκπληκτική του φόρμα, αποστομώνοντας και όσους έλεγαν ότι οι Cloud9 είχαν προβλήματα επικοινωνίας.</p>\n\n<p>Παρά την κυριαρχία του σε τοπικό επίπεδο, ο Impact δυσκολεύτηκε πολύ να βρει το ρυθμό του στο φετινό Παγκόσμιο Πρωτάθλημα. Παρόλο που ήταν πραγματικός τοίχος στην επάνω λωρίδα των Cloud9 κατά τη διάρκεια των πλέι οφ, δυσκολεύτηκε πολύ ενάντια σε άλλους δυνατούς παίκτες επάνω λωρίδας, όπως τον Duke των SK Telecom T1 και τον CuVee των Samsung Galaxy. Ωστόσο, ο Impact και οι υπόλοιποι Cloud9 αξίζουν ένα μεγάλο «μπράβο» που ήταν η μοναδική ομάδα από τη Βόρεια Αμερική που κατάφερε να φτάσει στους προημιτελικούς. Μάλιστα, ο Impact θα εκπροσωπήσει την ομάδα του και στο Τουρνουά All-Star. Άλλωστε, ήταν ο παίκτης που συγκέντρωσε το 41,7% των ψήφων για την επάνω λωρίδα, άρα θα έχει την ευκαιρία να δείξει αν είναι όντως ο καλύτερος στη θέση του.</p>","hu_HU":"A korábbi világbajnok Eonyoung „Impact” Jeong még nem szeretné szögre akasztani az egeret és a billentyűzetet. Az NA LCS gyenge nyári szakasza után az SK Telecom T1 egykori felső ösvényese nagyon rákapcsolt a rájátszásban. Egyetlen másik észak-amerikai játékos sem tudott felérni hozzá, és a Cloud9 jórészt neki köszönheti a szezon utáni sikereit, amivel egyébként sikerült eloszlatni a Cloud9 kommunikációs problémáival kapcsolatos pletykákat is.\n</p>\nA regionális sikerek ellenére Impact nehezen talált magára az idei világbajnokságon. Bár a Cloud9 felső ösvényén nem akadt ellenfélre a rájátszás során, a vb-n olyanokkal kellett szembenéznie, mint Duke (SK Telecom T1) és CuVee (Samsung Galaxy). Impact és a Cloud9 többi tagja egyedüli észak-amerikai csapatként jutott a negyeddöntőig, és Impact képviselheti őket az All-Star gálán. A felső ösvényesekre leadott szavaztok 41,7%-át söpörte be, így idén kap még egy utolsó esélyt, hogy bizonyítson.\n","it_IT":"L'ex campione del mondo Eonyoung \"Impact\" Jeong sembra non avere ancora intenzione di appendere mouse e tastiera al chiodo. Dopo un Summer Split LCS NA poco ispirato, l'ex superiore di SK Telecom T1 si è fatto valere durante i playoff. Nessun altro giocatore top in Nord America è riuscito a tenergli testa durante questo periodo e Cloud9 deve gran parte del suo successo post-stagionale alle sue giocate stellari, che hanno messo anche a tacere le voci che parlavano di problemi di comunicazione interni alla squadra.\n</p>\nNonostante il predominio nella sua regione, Impact ha sofferto molto per trovare il giusto ritmo ai Mondiali di quest'anno. Pur essendo un elemento immancabile nella corsia superiore dei Cloud9 durante i playoff, ha avuto filo da torcere contro giocatori nel suo stesso ruolo del calibro di Duke degli SK Telecom T1 e CuVee dei Samsung Galaxy. In ogni caso, Impact e i suoi compagni dei Cloud9 meritano un encomio per essere stati l'unico team nordamericano a raggiungere i quarti di finale, e sarà proprio Impact a rappresentarli nell'evento All-Star. Forte del 41,7% dei voti per la categoria Superiore, ora avrà un'altra occasione per dominare la sua corsia.\n","ro_RO":"Fostul Campion Mondial Eonyoung ''Impact'' Jeong nu e încă pregătit să lase deoparte mouse-ul și tastatura. După o etapa de vară neinspirată în LCS NA, fostul jucător de pe culoarul de sus al SK Telecom T1 a avut parte de o serie de victorii în playoff-uri. Niciun alt jucător de pe culoarul de sus din America de Nord nu s-a ridicat la forma sa din playoff-uri. Cloud9 datorează o mare parte din succesul său de după sezon manevrelor excepționale ale lui Impact, care au pus capăt neliniștilor legate de problemele de comunicare ale echipei.\n</p>\nÎn ciuda dominației sale regionale, Impact nu a reușit să se facă remarcat la Campionatul Mondial din acest an. Cu toate că a fost o forță de neoprit pe culoarul de sus pentru Cloud9 în timpul playoff-urilor, și-a întâlnit nașii în Duke de la SK Telecom T1 și în CuVee de la Samsung Galaxy. Însă cei din Cloud9 merită apreciați pentru că au fost singura echipă din America de Nord care a ajuns în sferturile de finală, iar Impact își va reprezenta regiunea la All-Star Event. Cu 41,7 la sută din voturile pentru culoarul de sus, va mai avea o șansă anul acesta să-și omoare adversarii de unul singur, fără ajutorul nimănui.\n","ko_KR":"","es_MX":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>"},"foreignIds":{"drupalId":"691","TRLH1":"200000172","TRLH2":"200000076","TRLH3":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":57,"slug":"wildturtle","name":"WildTurtle","firstName":"Jason","lastName":"Tran","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wildturtle-3siezu72.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-02T18:43:29.000Z","bios":{"en_US":"<p>Jason “WildTurtle” Tran has earned the \"wild\" part of his name through intense aggression in games. Whereas other AD carries excel at the delicate dance of staying out of reach, firing away, WildTurtle goes full aggro and can be found in melee range as often as not. When it backfires, he looks over-eager... but when it succeeds, the fans go crazy.</p>\n\n<p>After finding little playoff success with Immortals in 2016, WildTurtle made his way back to TSM for the start of 2017. Sporting his trademark all-in style, WildTurtle helped TSM to another title in the spring split. He finally shook off his playoff woes in the 2017 NA LCS Spring Finals, taking down Cloud9 in a close five game series. After Doublelift's return, WildTurtle heads to FlyQuest, where he should fit right in with Hai's aggressive shotcalls.</p>","fr_FR":"La partie « wild » (« sauvage ») du surnom de Jason « WildTurtle » Tran vient de son style de jeu particulièrement agressif. Alors que d'autres carrys AD excellent dans l'art délicat de rester hors de portée et d'attaquer à distance, WildTurtle aime aller au contact et se retrouve bien souvent à portée de mêlée. Quand la situation se retourne contre lui, il donne l'impression d'être trop zélé... mais quand il réussit, ses fans se déchaînent.\n\nAprès avoir connu un succès timide lors des play-offs avec les Immortals en 2016, WildTurtle est revenu chez TSM début 2017. Avec son style agressif caractéristique, il apporte à TSM le mordant qui lui manquait depuis le départ de Doublelift. Il a fini par oublier ses déboires lors de la finale du segment de printemps des LCS NA 2017, en éliminant Cloud9 lors d'un match serré en cinq manches. WildTurtle compte bien tout donner pour connaître un succès similaire au Brésil, lors du Mid-Season Invitational 2017.\n","pl_PL":"Jason „WildTurtle” Tran zawdzięcza „dziką” część swojego przydomka („wild” — z ang. „dziki”) niesamowitej agresji w grze. Podczas gdy inni prowadzący doskonalą delikatny taniec polegający na trzymaniu się poza zasięgiem i atakowaniu z daleka, WildTurtle idzie na całość i dość często można go zobaczyć walczącego w zwarciu. Gdy to się źle skończy, zarzuca się mu nadgorliwość... ale gdy się uda, fani szaleją.\n\nPonieważ nie osiągnął wielkich sukcesów z Immortals w 2016 roku, WildTurtle powrócił do TSM z początkiem 2017 roku. Prezentując swój firmowy, brawurowy styl gry, WildTurtle przywróci TSM agresję, której im brakowało po odejściu Doublelifta. Nareszcie otrząsnął się z problemów w play-offach, pokonując podczas finału wiosny NA LCS 2017 Cloud9 w wyrównanej serii pięciu gier. Wyruszając w podróż do Brazylii na Mid-Season Invitational 2017, zamierza kontynuować ten sukces\n","de_DE":"Jason „WildTurtle“ Tran verdankt das „Wild“ in seinem Namen seiner unglaublichen Aggressivität in den Spielen. Während andere AD-Carrys außerhalb der Reichweite bleiben und dennoch Schaden verursachen, geht WildTurtle immer volles Risiko und ist mindestens genauso häufig in Nahkampfreichweite. Wenn das nach hinten losgeht, wirkt er übereifrig, aber wenn er Erfolg hat, drehen seine Fans durch.\n</p>\nDa er mit den Immortals im Jahr 2016 keinen Erfolg in den Entscheidungsspielen hatte, wechselte WildTurtle Anfang 2017 wieder zu TSM zurück. Mit seinem „Alles oder nichts“-Stil bringt WildTurtle die Aggressivität nach Doublelifts Abgang zu TSM zurück. Er hofft, seine Probleme mit Entscheidungsspielen hinter sich lassen zu können, während er die Lebensleisten seiner Gegner leert, um TSM dabei zu helfen, die Krone im Frühjahrs-Split der NA LCS zu verteidigen.\n","es_ES":"Jason ''WildTurtle'' Tran se ha ganado la parte wild (salvaje) de su nombre gracias a su agresividad en las partidas. Si otros ADC destacan por sus ágiles movimientos, que los hacen inalcanzables y escurridizos, WildTurtle se lanza a tope y a menudo se le puede ver a distancia cuerpo a cuerpo. Cuando le sale el tiro por la culata, queda demasiado impaciente; si le sale bien, el público enloquece.\n\nTras quedarse a dos velas en los playoffs con Immortals en 2016, WildTurtle ha vuelto a TSM al comienzo de 2017. Gracias a su distintivo estilo de darlo todo, WildTurtle volverá a aportar un toque de agresividad a TSM tras la retirada de Doublelift. Logró acabar con su miedo a los playoffs en la final de primavera de la LCS NA 2017, en la que consiguió vencer a Cloud9 en una serie de cinco partidas. Intentará tener el mismo éxito en su viaje a Brasil para jugar en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Jason \"WildTurtle\" Tran ganhou a parte do “wild” do seu nome por causa da suas agressões intensas nos jogos. Enquanto outros carregadores mandam bem na delicada dança de ficar fora de alcance, atirando, WildTurtle ataca agressivamente e pode ser encontrado no combate corpo a corpo frequentemente. Quando isso não dá certo, ele parece muito afobado... mas quando dá, os fãs vão à loucura.</p>\n\n<p>Depois de ter um pouco de sucesso nas eliminatórias com a Immortals em 2016, o WildTurtle voltou para a TSM no início de 2017. Exibindo sua marca registrada de ir com tudo, WildTurtle traz a agressividade de volta à TSM depois da saída do Doublelift. Ele finalmente esqueceu o desgosto das eliminatórias nas Finais de Primavera da LCS NA 2017, derrotando a Cloud9 em cinco partidas acirradas. Ele tentará carregar esse sucesso consigo na viagem ao Brasil para o Mid-Season Invitational 2017.\n\n</p>"},"foreignIds":{"drupalId":"178","TRLH1":"200000251","TRLH2":"200000155","TRLT3":"200000235"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/WILDTURTLEX","twitter":"https://twitter.com/tsmwildturtle"},"champions":[],"liveGameTeam":264},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":264},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":264},{"id":115,"slug":"sneaky","name":"Sneaky","firstName":"Zachary ","lastName":"Scuderi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sneaky-3c359lbn.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:51.000Z","updatedAt":"2017-07-04T19:27:36.000Z","bios":{"en_US":"<p>The man, the meme, the legend. Zachary “Sneaky” Scuderi might be the class clown of the NA LCS, but his play is no joke. He’s consistently been a top ADC since he took the league by storm with Cloud9 in Season 3 with his meta-defying Ashe picks. During the 2016 NA LCS Summer Split, he led ADCs and was fourth overall in KDA with 6.3, and he also led ADCs with a 75.7% kill participation rate.</p>\n\n<p><i>“I’ve been getting a lot of memes, as of recent, about my laning phase. It doesn’t really mean anything. But there’s memes, and I could destroy them.” - Sneaky</i></p>\n\nSneaky put up a middling performance in lane and out of it at the 2016 World Championship before Cloud9 was eliminated. He brings a veteran presence to Cloud9’s retooled roster, looking to prove his detractors wrong. What memes will be destroyed or born in 2017? We’ll just have to wait and see.</p>","fr_FR":"<p>Zachary « Sneaky » Scuderi est l'un des carrys AD les plus mortels des LCS NA. Ne vous laissez\n\npar ses singeries, car Sneaky répond présent quand Cloud9 a besoin d'un exploit. Il est parvenu à obtenir \n\nun KDA de 7,2 lors du segment printanier des LCS NA 2015, le deuxième meilleur de la ligue, et il \n\ncontinue de voler de victoire en victoire depuis lors.</p>\n\n<p>L'ascension de Sneaky vers la célébrité a commencé pendant la Saison 3, quand sa décision de choisir \n\nAshe contre la logique de la metagame a propulsé Cloud9 au sommet du classement des LCS NA. Depuis, \n\nSneaky est devenu un fantastique carry AD polyvalent. Il joue désormais admirablement Corki, Tristana \n\net Lucian, et il empoche régulièrement les ratios KDA les plus élevés des LCS NA. Il est probablement le \n\njoueur professionnel de LoL qui propage le plus de memes usés jusqu'à la corde. « Same ».</p>","pl_PL":"<p>Gdyby zorganizować konkurs na najbardziej niedocenianego gracza w NA LCS Sneaky miałby bardzo dużą szansę, by zgarnąć trofeum. Na najwyższym poziomie gra już od ponad dwóch lat, ale nigdy nie dorównywał popularnością Doubleliftowi czy chociażby Wild Turtle’owi. Nie zmienia to faktu, że jest doskonałym strzelcem, być może najlepszym w Ameryce.</p>\n<p>\nSneaky jak niemal każdy zawodnik zaczynał w niewielkich organizacjach. Pierwszym przystankiem na jego drodze na szczyt był zespół Ordinance Gaming, w którym w 2012 roku pełnił rolę… mid-lanera i gdzie spotkał m.in. Roberta „RobertaXLee” Lee. Później przyszedł czas na zmianę pozycji – środkową aleję Sneaky zamienił na pozycję strzelca, w której to roli rozpoczął przygody z Absolute Legends NA oraz Pulse Esports. Dobra postawa Sneaky’ego nie umknęła większym organizacjom i lutym 2013 roku Zachary dołączył do Teamu Dignitas, ale spędził tam tylko pół roku. Pojawiła się oferta z Quantic Gaming, późniejszego Cloud9, którą zaakceptował.</p>\n<p>\nSzybko okazało się, że była to znakomita decyzja. Sneaky wraz z kolegami dwukrotnie sięgał po trofeum dla najlepszego zespołu w NA LCS i dwukrotnie zajmował w tych rozgrywkach drugie miejsce. Początkowo Zachary preferował strzelców, którzy posiadali efekty kontroli tłumu, bo tego wymagała od niego taktyka zespołu. Jego flagową bohaterką stała się w tym czasie Ashe. Co jednak oczywiste, grając tym typem czempionów nie mógł pokazać pełni swoich możliwość. Zmieniło się to wraz z modyfikacją strategii drużyny, która w 2014 roku postanowiła odciążyć nieco Haia „Haia” Lama na środkowej alei i bardziej skupić się na dolnej alei, gdzie potencjał do prowadzenia gier miał właśnie Sneaky. Kiedy po wielkich sukcesach, przyszedł mniej udany okres, Sneaky był tak naprawdę jedynym zawodnikiem C9, który nigdy nie zawodził i nierzadko to właśnie jego fenomenalna postawa i znakomite umiejętności mechaniczne pozwalały Cloud9 wygrywać gry. W wiosennym splicie 2015 Zachary miał najwyższe KDA (7,2), zadał najwięcej procentowych obrażeń (33,9%) i ginął najrzadziej spośród wszystkich zawodników NA LCS (25 śmierci). Co prawda amerykański strzelec miał nieznacznie gorszy letni split 2015, ale to nadal jest zawodnik, na którego C9 zawsze może liczyć.</p>\n<p>\nSneaky nigdy nie wygrał jednak głosowanie na najlepszego ADC w Ameryce, a w plebiscycie z listopada 2015 roku zajął drugie miejsce z wynikiem 20,3%, tracąc do zwycięzcy, Yilanga „Doublelifta” Penga, aż 32,5% głosów.</p>\n<p>\nW trakcie swojej kariery najbardziej wsławić się grą Ezrealem, Gravesem i Corkim. Ciężko też nie zauważyć sentymentu dla Ashe, bowiem Sneaky był jednym z dwóch ADC w Ameryce, który zdecydował się na kilkukrotny wybór tej bohaterki w meczach NA LCS po jej reworku. Co ciekawe, Sneaky jest… daltonistą, co sprawia, że nie potrafi odróżniać pewnych (nie wszystkich) kolorów. Na początku swojej kariery posługiwał się nickiem „SnEaKyCaStRoO”, ale zmienił go natychmiast, gdy dowiedział się, co znaczy to wyrażenie.\n</p>","de_DE":"Der Mann, das Meme, die Legende. Zachary „Sneaky“ Scuderi ist zwar der Klassenclown der NA LCS, aber wenn er spielt, ist Schluss mit lustig. Seit er durch seine Leistungen mit Ashe das Metaspiel veränderte und die Liga im Sturm eroberte, gehört Sneaky, der in Saison 3 bei Cloud9 unterschrieb, zu den besten ADCs. Beim Sommer-Split der NA LCS 2016 führte er die ADCs mit einer Tötungsbeteiligung von 75,7 % an und landete mit einer TTU (KDA) von 6,3 auf dem vierten Platz aller Spieler.</p>\n\n„Ich bekomme in letzter Zeit jede Menge Memes, die sich auf meine Anfangsphase beziehen. Das hat eigentlich nichts zu bedeuten. Aber es gibt sie und ich könnte sie zerstören.“ – Sneaky\n</p>\nSneaky hat bei der Weltmeisterschaft 2016 in der Lane und abseits davon nur eine mittelmäßige Leistung abgeliefert, bis Cloud9 ausgeschieden ist. Er wird seine Erfahrung in die Aufstellung von Cloud9 einbringen und versuchen, seine Kritiker Lügen zu strafen. Welche Memes werden 2017 wohl zerstört werden und welche neuen werden entstehen? Die Zeit wird es zeigen.\n","es_ES":"<p>El hombre, el meme, la leyenda. Zachary ''Sneaky'' Scuderi puede que sea el payaso de la clase de la LCS NA, pero sus jugadas no son un chiste. No ha dejado de ser un ADC de primera desde que llegó a la liga pisando fuerte con Cloud9 en la temporada 3, cuando seleccionaba a Ashe en contra de la lógica del metajuego. Durante el split de verano de la LCS NA 2016, destacó entre los ADC y quedó en cuarto lugar con una A/M/A de 6,3 puntos. También destacó entre ellos por su 75,7 % de participación en asesinatos.</p>\n\n<p>''Últimamente han hecho muchos memes de mí, por mi fase de calles. No significa nada para mí en realidad. Pero los memes están ahí, y yo podría destruirlos''.</p>\n\n<p>Sneaky ha tenido que soportar críticas por sus jugadas en la fase de calles, pero su tendencia a los pentakills a final de partida camufla cualquier fallo del principio. Destaca con campeones ADC de utilidad como Ashe y Sivir, y su Jhin es temido universalmente, lo que ha suscitado que lo bloqueen o que lo seleccionen el primero durante los playoffs. Intentará demostrar que sus detractores se equivocaban consiguiendo un pentakill en el escenario internacional, destruyendo algunos memes y, quizás, si tenemos suerte, creando otros nuevos.</p>","pt_BR":"<p>O homem, o meme, a lenda. Zachary “Sneaky” Scuderi pode ser o palhaço da turma na NA LCS, mas suas jogadas não são nenhuma piada. Ele tem sido consistentemente um dos melhores atiradores desde que saiu destruindo com a Cloud9 na 3º Temporada com suas escolhas de Ashe que desafiavam as leis do meta. Durante a Etapa de Verão da NA LCS 2016, ele esteve na liderança entre os atiradores e ficou em quarto lugar geral com um AMA de 6,3 e também ficou entre os primeiros em participação em abates com 75,7%.</p>\n\n<p>“Tenho ouvido muitas piadas sobre minha fase de rotas recentemente. Eu não as levo a sério e sei que posso destruí-las” - Sneaky</p>\n\n<p>Sneaky já recebeu muitas críticas por seu estilo de jogo na fase de rotas, mas sua propensão a Pentakills no fim de jogo compensa qualquer começo ruim. Ele se sobressai em atiradores de utilidade como Ashe e Sivir, e seu Jhin é universalmente temido, levando a ser banido ou escolhido em primeiro durante as eliminatórias. Ele fará de tudo para desmentir seus difamadores indo atrás do Pentakill no palco internacional, destruindo alguns memes e quem sabe (se tivermos sorte) criando alguns novos.</p>","es_AR":"<p>El hombre, el meme, la legenda. Zachary \"Sneaky\" Scuderi es quien hace reír a todos con sus bromas en la LCS NA, pero su juego no es ningún chiste. Ha sido uno de los mejores tiradores desde que sacudió la liga entera con Cloud9 en la temporada 3 jugando con su revolucionaria Ashe. Durante el torneo de clausura de la LCS NA 2016, jugó de tirador y quedó en cuarto lugar con 6.3 puntos de KDA. Además, logró un 75.7% de participación en asesinatos como tirador.</p>\n\n<p><i>\"Me han hecho muchos memes recientemente sobre mi etapa en los carriles. En realidad eso no quiere decir nada. Pero hay memes, y puedo destruirlos\".</i></p>\n\n<p>Sneaky ha soportado críticas por su juego en la fase de carriles, pero su tendencia a lograr pentakills en las últimas partes de los combates compensa los errores al comienzo. Se destaca con tiradores de utilidad como Ashe y Sivir, y su juego con Jhin es temido por todos, ya que logra bloqueos y primeras selecciones durante las eliminatorias. Buscará demostrar a sus detractores que estaban equivocados logrando un pentakill en el escenario internacional, destruyendo algunos memes y, quizás (si tenemos suerte), hasta creando algunos nuevos.</p>"},"foreignIds":{"drupalId":"331","TRLH1":"200000175","TRLH2":"200000079","TRLH3":"200000339"},"socialNetworks":{"twitch":"https://twitch.tv/c9sneaky","facebook":"https://facebook.com/c9sneaky","twitter":"https://twitter.com/c9sneaky"},"champions":[],"liveGameTeam":18},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":264},{"id":163,"slug":"bunny-fufuu","name":"Bunny FuFuu","firstName":"Michael","lastName":"Kurylo","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bunny-fufuu-b4cl3hl3.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-25T17:02:59.000Z","bios":{"en_US":"<p>\nKnown for his Thresh picks, Michael “Bunny Fufuu” Kurylo is a long time support player in the NA scene. Bunny Fufuu originally played support for Curse during the 2014 NA LCS Spring Split before moving to Curse Academy, which later rebranded as Gravity. The move served both him and Gravity well, with his skills in the bot lane steadily improving until he was regarded as one of the best supports in North America.\n</p>\n<p>\nBunny Fufuu's impact in the bot lane caught the attention of more than a few teams, and he was scooped up by Cloud9 in the 2015 offseason.\n</p>\n<p>\nLearn more about Bunny FuFuu's journey in the competitive scene in his <a href=\"https://www.youtube.com/watch?v=G0uDn46IUxE\" target=\"_blank\">Drive episode</a>.\n</p>","fr_FR":"<p>Support bien connu sur la scène nord-américaine, Michael « Bunny Fufuu » est réputé pour son Thresh. \n\nBunny Fufuu jouait à l'origine support pour Curse, lors du segment printanier des LCS NA 2014, avant de \n\npasser chez Curse Academy, qui a ensuite changé de nom pour devenir Gravity. Ce changement a été \n\nfructueux pour lui comme pour Gravity, et ses compétences sur la voie du bas se sont constamment \n\naméliorées jusqu'à ce qu'il soit considéré comme l'un des meilleurs supports d'Amérique du Nord.</p>\n\n<p>L'impact de Bunny Fufuu sur la voie du bas a attiré l'attention de plusieurs équipes et il a fini par être \n\nrecruté par Cloud9 durant l'intersaison 2015. Il travaille en étroite collaboration avec Hai, qui est sans \n\ndoute l'un des meilleurs meneurs nord-américains, avec qui il partage le poste de support chez C9. \n\nProfitant des conseils stratégiques de LemonNation et d'un puissant partenaire en la personne de \n\nSneaky, Bunny Fufuu continuera forcément de faire forte impression lors des LCS NA. </p>\n\n<p>Pour en savoir plus sur le parcours de Bunny Fufuu sur la scène compétitive, regardez l'épisode de Drive \n\nqui lui est consacré.</p>","pl_PL":"<p>Michael Kurylo przedstawił się szerszej publiczności w 2014 roku, kiedy to zasłynął w amerykańskim SoloQ nieprawdopodobną grą Threshem.</p>\n<p> \nVideo: https://www.youtube.com/watch?v=KVIj1t5duP8</p>\n<p>\nNa półprofesjonalnej scenie swoich sił próbował już wcześniej w mniej znanych formacjach, ale to właśnie sezon 2014 okazał się przełomowy. Co prawda w składzie Curse utalentowanemu wspierającemu nie udało się zaistnieć. Najpierw rywalizował z Georgem „Zekentem” Liu i Brandonem „Saintviciousem” DiMarco w szalonym wiosennym splicie 2014. Ciekawostką jest fakt, że Michael występował wtedy w LCS i jednocześnie… uczęszczał do szkoły. Później do zespołu dołączył wyrzucony z TSM-u Alex „Xpecial” Chu. Obydwaj zawodnicy rywalizowali o miejsce w składzie formacji, ale ostatecznie, pomimo pozytywnych recenzji, jakie BunnyFuFuu otrzymał za wiosenne występy, to były gracz TSM-u wygrał ten pojedynek. </p>\n<p>\nNiemniej kariera Michaela potoczyła się w myśl przysłowia „co się odwlecze, to nie uciecze”. BunnyFuFuu dołączył do występującego w NA Challenger Series Curse Academy i to właśnie wokół niego przebudowana została drużyna. </p>\n<p>\n- W ciągu roku BunnyFuFuu będzie lepszy od Xpeciala – powiedział jednak w sierpniu 2014 roku legendarny amerykański dżungler Saintvicious, który występował z Bunny’m w CA.</p>\n<p>\nCurse Academy udało się zebrać naprawdę silny skład i zespół był jednym z faworytów do awansu do LCS. Początki były trudne, ale ostatecznie cel udało się spełnić od razu w pierwszym splicie. Michael i jego koledzy z drużyny byli zmuszeni zmienić organizację i do wiosennej edycji rozgrywek 2015 przystąpili pod banderą Gravity.</p>\n<p>\nZespół zaskoczył znakomitym startem w wiosennym splicie 2015, a BunnyFuFuu, zgodnie z oczekiwaniami, był jednym z filarów zespołu. Ostatecznie drużyna zadomowiła się w środku tabeli i to był na tamten moment szczyt możliwości Michaela i jego kolegów. W przerwie między splitami zmienił się jednak partner Bunny’ego na dolnej alei – Davida „Copa” Robertsona zastąpił obiecujący Johny „Altec” Ru. W związku z tą rotacją uwaga drużyny skupiła się głównie na dolnej alei, gdzie duet młokosów radził sobie fenomenalnie, prowadząc zespół do walki o najwyższe lokaty. Gravity przez moment było nawet liderem rozgrywek, ale ostatecznie skończyło letnią edycję na czwartej pozycji i szybko odpadło w play-offach.</p>\n<p>\nBunnyFuFuu nadal słynie z nieprawdopodobnej gry Threshem, ale w ciągu ostatniego roku jego champion pool znacznie się rozszerzył – amerykański wspierający niemal równie chętnie sięgał po Shena, Alistara, Jannę czy Brauma. Ewidentnie ma jednak tendencję do gry wytrzymałymi wspierającymi. W letnim splicie 2015 BunnyFuFuu był czwartym najczęściej asystującym zawodnikiem w NA LCS. Tę samą lokatę zajął w klasyfikacji supportów obejmującej KDA. Był również drugim najczęściej wardującym graczem w amerykańskich rozgrywkach. Co ciekawe, nick Michaela początkowo miał brzmieć „BunnyFuFu”, ale był on zajęty, wobec czego gracz zdecydował się po prostu dodać drugie „u” i tak powstał obecny pseudonim.</p>\n<p>\nW przerwie przed sezonem 2016 wspierający dołączył do Cloud9, gdzie ma pełnić rolę supporta wymiennie z Haiem „Haiem” Lamem.\n</p>"},"foreignIds":{"drupalId":"1341","TRLH1":"1001220059","TRLH2":"1001160109"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":354,"slug":"bigfatlp","name":"bigfatlp","firstName":"Michael","lastName":"Tang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bigfatlp-fvccyz4y.png","hometown":"Canada","region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2017-01-09T18:10:57.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"320"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":482,"slug":"incarnati0n","name":"Jensen","firstName":"Nicolaj","lastName":"Jensen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/incarnati0n-e5bzh5bb.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2015-05-15T18:24:28.000Z","updatedAt":"2017-07-04T19:27:23.000Z","bios":{"en_US":"<p>Nicolaj “Jensen” Jensen is out to prove there’s more than one great Danish mid laner in the NA LCS. After initially struggling when he joined Cloud9 in 2015 to replace departing Hai, he’s done more than just gain his footing: he’s become one of the most dangerous mid laners in the league. During the 2016 NA LCS Summer Split, he led the league in kills with 207 and set a new LCS record with 20 kills in a single game in the playoffs.</p>\n\n<p>Like the rest of Cloud9, Jensen was unsatisfied with the team’s performance at Worlds. Joining a retooled roster for 2017, he had to build synergy with his new jungler, Contractz. A strong season for Jensen and Cloud9 was unfortunately capped by a crushing defeat to TSM in the 2017 NA LCS Spring Split finals. With a clean slate for summer, Jensen will be looking to body fools on his way to the 2017 World Championship. </p>","fr_FR":"<p>Nicolaj « Jensen » Jensen est un mid laner danois de haut niveau, connu pour préférer des assassins \n\ncomme Zed et Fizz. Jensen a commencé sa carrière e-sportive avec Team Solo Mebdi en 2012, lors des \n\nqualifications pour les LCS EU de la Saison 3. Cependant, l'équipe a été disqualifiée du tournoi et s'est \n\nséparée au début de l'année 2013.</p>\n\n<p>Jensen est revenu à la compétition en 2015 quand Cloud9 l'a choisi pour remplacer son mid laner sur le \n\ndépart, Hai. Au début, Jensen a eu du mal dans le nouvel environnement des LCS NA, mais son KDA s'est \n\namélioré considérablement au fur et à mesure qu'il s'habituait au style de jeu de l'équipe et à la scène \n\ndes LCS NA. Jensen a terminé son premier segment professionnel en participant au mondial 2015, au \n\ncours duquel Cloud9 a été éliminée dès la phase de groupe.</p>","pl_PL":"<p>Nikolaj Jensen, bardziej znany jako Incarnati0n, to jedna z najbardziej kontrowersyjnych postaci na profesjonalnej scenie. Głośno o Duńczyku po raz pierwszy zrobiło się w 2012 roku, przed eliminacjami do pierwszego splitu EU LCS w historii. Incarnati0n całkowicie zdominował w tym czasie europejskie SoloQ i jego drużyna była jednym z faworytów do zdobycia miejsca w elitarnych rozgrywkach. Kilka dni przed zawodami sceną wstrząsnęła jednak zaskakująca wiadomość – Incarnati0n (znany wtedy pod pseudonimem Veigodx), a także jego kolega z zespołu Simon „Rayt3rch” Näslund zostali ukarani dożywotnią dyskwalifikacją, a ich formacja (Team Solo Mebdi) wykluczona z turnieju.</p>\n<p>\nSzybko na jaw wyszły na jaw powody tej decyzji. Nikolaj zbudował sobie rozległą kartotekę związaną z łamaniem Kodeksu Przywoływacza. Kara nie sprawiła jednak, że Incarnati0n porzucił League of Legends. Duńczyk tworzył kolejne konta, które były co jakiś czas eliminowane: Vizikodex, Quas0, Suq, Reversio, Apdo Dog2 czy najbardziej znane Wizikx. Mid-laner niejednokrotnie udowadniał ogromną skalę talentu, regularnie dostając się na najwyższe lokaty w europejskim SoloQ. W końcu, po niemal dwóch latach trwania tego procederu, w 2014 roku, Riot zobaczył znaczącą poprawę w postępowaniu gracza i pozwolił mu na pracę z SK Gaming w roli trenera. Niemniej, biorąc pod uwagę powody dyskwalifikacji Duńczyka, Riot pozostawał nieugięty, jeśli chodzi o występy Incarnati0na jako gracza. </p>\n<p>\nTymczasem SK Gaming, od czasu zatrudnienia Nikolaja, odnotowało niesamowity postęp i wygrało fazę zasadniczą wiosennego splitu 2014, zajmując też drugą pozycję w play-offach i trzecią na koniec letniej edycji. Formacji udało się też pojechać na Mistrzostwa Świata. Ogromny progres był widoczny w postawie mid-lanera drużyny Jesse’ego „Jesiza” Le. Wszystko wskazuje na to, że Duńczyk fantastycznie odnalazł się w nowej roli. Nie ulega jednak wątpliwości, że to rozwiązanie go nie satysfakcjonowało – chciał grać.</p>\n<p>\nIncarnati0n skupił się więc na swojej karierze jako zawodnika. Mid-laner potrzebował jeszcze dwóch podejść do aktualizacji jego sprawy. Dopiero w maju 2015 roku przekonał Riot co do swojej przemiany i został dopuszczony do gry na najwyższym poziomie. Ta sprawa podzieliła społeczność na zwolenników drugiej szansy dla utalentowanego zawodnika i przeciwników tej decyzji, wskazujących na skrajnie toksyczną przeszłość. Ostatecznie jednak nie miało to większego znaczenia, bo decyzja była wiążąca i po Duńczyka zgłosiła się chmara chętnych. Od początku faworytem w wyścigu po podpis Incarnati0na było jednak Cloud9 i to właśnie tam trafił obiecujący gracz.</p>\n<p>\n„W dziesięciostopniowej skali, przyjmując za 10 Fakera, myślę, żę Bjergsen i Incarnati0n są prawdopodobnie około ósemki. Pozostali mid-lanerzy z NA LCS oscylują w większości w przedziale 6-7.” – powiedział William „Scarra” Li przed startem splitu, stawiając Incarnati0na obok Bjergsena.</p>\n<p>\nPoczątki nie były jednak łatwe. Incarnati0n miał problemy z zaaklimatyzowaniem się na tak wysokim poziomie i ze spełnieniem wygórowanych oczekiwań kibiców. Kilka pierwszych kolejek było bardzo przeciętne w jego wykonaniu, co spowodowało falę krytyki ze strony fanów, ale później z każdym meczem radził sobie lepiej. Na pewno bardzo pomógł mu powrót do drużyny Haia „Haia” Lama, bowiem od zmiany dżunglera progres był jeszcze wyraźniejszy. Pod koniec splitu Incarnati0n był już mocnym punktem zespołu i miał spory udział w sensacyjnym wywalczeniu przez Cloud9 awansu na Mistrzostwa Świata. Trudy debiutu już więc za nim, a rok 2016 powinien być dla niego znacznie bardziej udany.</p>\n<p>\nW czasach dominacji SoloQ Incarnati0na zasłynął z niezwykle efektywnej gry zabójcami – przede wszystkim Fizzem i Zedem. Na profesjonalnej scenie jego styl gry znacznie się jednak zmienił w związku z wymogami dynamicznie ewoluującej mety. W lecie najczęściej grał Orianną, Azirem i Viktorem, co całkowicie zrozumiałem, gdyż te postaci były w tym czasie najmocniejsze. Jego pocket-pickiem był natomiast AP Kog’Maw. Co ciekawe, spośród graczy NA LCS, Duńczyk najlepiej dogaduje się z Johnym „Altec’iem” Ru i Christianem „IWillDominate” Riverą.\n </p>","de_DE":"Nicolaj „Jensen“ Jensen will allen beweisen, dass es nicht nur einen überragenden dänischen Mid-Laner gibt. Nachdem er anfangs Probleme hatte, als er 2015 als Ersatz für Hai zu Cloud9 gekommen war, konnte er mehr als nur Fuß fassen: Er wurde zu einem der gefährlichsten Mid-Laner der Liga. Beim Sommer-Split der NA LCS 2016 führte er die Liga mit 207 Tötungen an und stellte in den Entscheidungsspielen mit 20 Tötungen in einem einzigen Spiel einen neuen Rekord auf.</p>\n\nJensen war, wie der Rest von Cloud9, mit der Leistung bei der Weltmeisterschaft unzufrieden. In der neuen Aufstellung für den Frühjahrs-Split 2017 muss er an der Synergie zwischen ihm und seinem neuen Jungler, Contractz, arbeiten. Eine gute Harmonie zwischen Mid-Laner und Jungler ist das Erfolgsrezept vieler Top-Teams. Sollten sie es schaffen, gut zusammenzuarbeiten, ist kaum abzusehen, was Jensen 2017 alles erreichen kann.\n","es_ES":"<p>Nicolaj ''Jensen'' Jensen va a demostrar que no solo hay un jugador danés fantástico en la calle central de la LCS NA. Tras tener algunos problemas inicialmente cuando se unió a Cloud9 en 2015 para reemplazar a Hai, no solo se ha ganado su posición, sino que se ha convertido en uno de los mid más peligrosos de la liga. Durante el split de verano de la LCS NA 2016, despuntó en la liga con 207 asesinatos y ha establecido un nuevo récord en la LCS con 20 asesinatos en una sola partida durante los playoffs. También destacó por el número de súbditos asesinados por minuto, alcanzando una media de 9,5.</p>\n\n<p>Tras una dura derrota contra TSM en la final de verano de la LCS NA 2016, Jensen tomó las riendas de su equipo y derrotó a Immortals de nuevo en un enfrentamiento al mejor de 5, lo que significaría su clasificación para el Mundial. Aunque se hizo un nombre jugando asesinos como Zed y LeBlanc, también ha destacado con selecciones específicas como Vel'Koz y Syndra. Si Cloud9 quiere superar la fase de grupos este Mundial, a diferencia del año pasado, Jensen tendrá que deshacerse de los recuerdos de las derrotas del pasado. Puede que las emociones sean el rival más duro para Jensen en el escenario internacional; si consigue dominarlas, su límite serán las nubes.</p>","pt_BR":"<p>Nicolaj “Jensen” Jensen veio para provar que há mais do que só um grande jogador dinamarquês na rota do meio na NA LCS. Após um começo difícil quando entrou para a Cloud9 em 2015 para substituir Hai, ele fez muito mais do que só conquistar o seu lugar: ele se tornou um dos meios mais perigosos do League. Durante a Etapa de Verão da NA LCS 2016, ele ficou na liderança em número de abates marcando 207 e alcançou um novo recorde na LCS com 20 abates em um único jogo nas eliminatórias. Ele também ficou em primeiro em abates de tropa por minuto, marcando 9,5.</p>\n\n<p>Depois de uma derrota esmagadora para a TSM na Final da Etapa de Verão da NA LCS, Jensen reuniu sua equipe, que conseguiu derrotar mais uma vez a Immortals em uma melhor de 5, qualificando-se assim para o Mundial. Apesar de ter feito seu nome jogando com assassinos como Zed e LeBlanc, ele também se sobressai em escolhas mais específicas como Vel’Koz e Syndra. Se a Cloud9 espera superar sua saída na Fase de Grupos do Mundial do ano passado, Jensen vai ter que superar as derrotas do passado. As emoções talvez sejam um de seus piores inimigos no palco internacional. Se ele conseguir controlá-las, o céu é o limite.</p>","es_AR":"<p>Nicolaj \"Jensen\" Jensen ha venido para demostrar que hay más de un carrilero central danés habilidoso en la LCS NA. Después de un arduo inicio en Cloud9 como reemplazo de Hai en el 2015, ha logrado más que ganarse su lugar: se ha convertido en uno de los carrileros centrales más poderosos de la liga. Durante el torneo de clausura de la LCS NA 2016, encabezaba la liga con 207 asesinatos y registró una marca inédita de la LCS con 20 asesinatos en un solo combate durante las eliminatorias. También lideró la liga con 9.5 CS por minuto.</p>\n\n<p>Después de una aplastante derrota ante TSM en la final del torneo de clausura de la LCS NA 2016, Jensen reunió a su equipo para derrotar a Immortals una vez más en un combate al mejor de cinco y clasificar al Mundial. A pesar de que se hizo reconocido jugando con asesinos como Zed y Leblanc, también se destacó usando personajes especializados como Vel’Koz y Syndra. Si Cloud9 espera mejorar luego de su salida en la fase de grupos del Mundial del año pasado, Jensen deberá despejar los fantasmas de las derrotas anteriores. Quizás las emociones sean el rival más duro de Jensen en el escenario internacional. Si logra dominarlas, su límite será el cielo.</p>"},"foreignIds":{"drupalId":"4330","TRLH1":"200000174","TRLH2":"200000078","TRLH3":"200000338"},"socialNetworks":{"facebook":"https://www.facebook.com/c9incarnati0n","twitch":"https://twitch.tv/incarnati0n","twitter":"https://twitter.com/Incarnati0nLoL"},"champions":[],"liveGameTeam":18},{"id":499,"slug":"smoothie","name":"Smoothie","firstName":"Andy","lastName":"Ta","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smoothie-5yeikqg2.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:10.000Z","updatedAt":"2017-07-04T19:27:48.000Z","bios":{"en_US":"<p>Andy “Smoothie” Ta offers Cloud9 the perfect blend of support attributes -- control of the map, and protection of carries. After spending most of the 2016 Summer Split sharing time in the support role, Smoothie took over the job full time near the end of the split and never looked back. Despite limited playtime, Smoothie had the third best support KDA in the league for the Summer Split.</p>\n\n<p>In less than a year, Smoothie went from bouncing around the NA Challenger scene all the way to the 2016 World Championship. While the rookie was overshadowed by some of the world’s finest, he’s one of the best young supports in the scene. He’ll have his sophomore season to level up his skills and take another shot at greatness on the world stage.</p>","fr_FR":"<p>Andy « Smoothie » Ta a rejoint Team Liquid en 2015 après ses débuts aux LCS avec Team Dragon \n\nKnights, plus tôt dans l'année. Bien que ce support ait été plutôt discret dans sa première année aux LCS, \n\nSmoothie a impressionné les dirigeants de TL au point que ces derniers lui ont proposé une place dans \n\nl'équipe ; équipe qui a fini à la première place de la saison régulière du segment d'été des LCS NA 2015. \n\nIl ne tient qu'à lui de prouver qu'il est capable de conserver son poste.</p>","pl_PL":"<p>Pochodzący z Calgary, w Kanadzie, \"Smoothie\" zainteresował się profesjonalną sceną dopiero w sezonie piątym. Dołączył do Team Dragon Knights w lutym 2015 roku, zastępując poprzedniego supporta. Zamiana zbiegła się w czasie z początkiem wiosennego sezonu NA Challenger Series 2015. Andy, wraz z drużyną, skończył go na drugim miejscu z wynikiem 7:3. Po zajęciu też drugiego miejsca w rozgrywkach barażowych zakwalifikował się do Summer Promotion Tournament. TDK zostało wybrane przez Winterfox, lecz udało im się zwyciężyć, pomimo substytucji mid-lanera. Niestety „rycerze” nie poradzili sobie najlepiej w letnim sezonie NA LCS 2015, kończąc na ostatnim miejscu z wynikiem 3:15. Przez pozycję na samym dnie zostali automatycznie przeniesieni z powrotem do NA Challenger Series. Dlatego \"Smoothie\" opuścił szeregi Team Dragon Knights w październiku 2015 roku. Jednak umiejętności Kanadyjczyka zaprezentowane w tym okresie zrobiły wrażenie na wielu osobach – w efekcie dostał zaproszenie do Team Liquid.</p>\n<p>\nPrzyjęcie Andiego do drużyny zostało ogłoszone 16.10.2015 poprzez film w internecie pt. „Team Liquid Smoothie Challenge”. W nim czterech członków organizacji ściera się w konkursie na zrobienie najlepszego koktajlu, a o zwycięzcę ma wyłonić tajemniczy sędzia. Oczywiście sędzia to Andy, który oświadcza, że jest tylko jeden prawdziwy „Smoothie” i że będzie supportem w  Team Liquid. Fakt, że zastępuje doświadczonego Alexa \"Xpecial\" Chu’a, bardzo dobrze o nim świadczy.</p>\n<p>\nZa swojego ulubionego bohatera uważa Thresha, jednak cieszy go też gra Janną i Annie. W letnim sezonie NA LCS 2015 można także było zobaczyć jego imponującą grę Nautilusem. Pomimo krótkiego stażu na scenie esportowej posiada sporą ilość wielbicieli, co jest główną zasługą jego aktywności na portalach społecznościowych. Lubi umieszczać w internecie zdjęcia swojego autorstwa, np. swoich z innymi ludźmi lub potraw. Aż 1500 osób śledzi jego dzieła sztuki fotografii. Poza tym przepada za komentowaniem bieżących wydarzeń na świecie. Wszystko zapowiada, że będzie miał doskonały kontakt z fanami.\n</p>","de_DE":"Andy „Smoothie“ Ta bietet Cloud9 die perfekte Mischung an Supporter-Attributen: Er sorgt dafür, dass seine Mannschaft die Kontrolle über die Karte hat und beschützt die Carrys. Nachdem Smoothie die Supporter-Rolle für einen Großteil des Sommer-Splits 2016 teilen musste, ist er seit Ende der Saison alleine für das Wohl seiner Mitspieler verantwortlich. Trotz der beschränkten Spielzeit erreichte Smoothie die drittbeste Supporter-TTU (KDA) des Sommer-Splits.\n</p>\nIn weniger als einem Jahr hat es Smoothie von der nordamerikanischen Challenger-Szene bis zur Weltmeisterschaft 2016 geschafft. Auch wenn er von einigen der besten Spieler der Welt überschattet wurde, gehört er trotzdem zu den besten jungen Supportern der Szene. In seiner zweiten Saison hat er die Chance, weiter an seinen Fähigkeiten zu arbeiten und erneut zu versuchen, auf der WM-Bühne zu brillieren.\n","es_AR":"<p>Andy \"Smoothie\" Ta ofrece a Cloud9 la combinación perfecta de atributos de un soporte: control del mapa y protección de acarreadores. Después de pasar la mayor parte de la temporada regular del 2016 jugando parcialmente en ese rol con Bunny FuFuu, Smoothie comenzó a desempeñar esta tarea de tiempo completo para el final de la temporada y sin mirar atrás. A pesar de que su tiempo de juego fue limitado durante la mayor parte del torneo, Smoothie obtuvo el tercer mejor KDA de un soporte en la liga con 5.6 puntos. Se destacó con el Bardo durante la temporada regular, y su Tahm Kench ayudó a sellar la victoria del quinto combate contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha tenido un largo recorrido desde sus días en la escena de retadores de NA durante los últimos dos años. En el juego temprano, su fuerte carril protege a Sneaky y permite que el acarreador principal de C9 sobreviva intacto hasta el final del combate. Aunque Smoothie suele quedar opacado por Biofrost, otro gran soporte novato, tuvo un desempeño increíble para alguien con tan poca experiencia profesional. La falta de experiencia se pondrá a prueba en el Mundial. Allí se debilitará y perderá, o permanecerá firme y ganará bajo las brillantes luces del escenario internacional.</p>","es_ES":"<p>Andy ''Smoothie'' Ta ofrece a Cloud9 la mezcla perfecta de atributos de apoyo: control del mapa y protección para los carries. Tras pasar la mayor parte de la temporada regular de 2016 compartiendo el rol de apoyo con Bunny FuFuu, Smoothie acabó por ocupar el puesto a tiempo completo al final de la temporada, y no ha mirado atrás desde entonces. A pesar de haber contado con tiempo limitado de juego la mayor parte del split, Smoothie consiguió la tercera mejor A/M/A de apoyo de la liga, con una puntuación de 5,6. Durante la temporada regular destacó con Bardo, y su Tahm Kench ayudó a conseguir la victoria en la quinta partida contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha recorrido un largo camino desde que frecuentara la escena Aspirante de Norteamérica durante los últimos dos años. Al principio de la partida, su potente actividad en calle protege a Sneaky, lo que ayuda que el carry principal de C9 llegue a final de partida de una pieza. Aunque Biofrost, otro apoyo principiante, suele hacerle sombra, Smoothie lo hace increíblemente bien para tener tan poca experiencia profesional. Su escasa experiencia será puesta a prueba en el Mundial, donde podrá derrumbarse y perder, o mantenerse como un témpano de hielo y ganar bajo los ardientes focos del escenario internacional.</p>","pt_BR":"<p>Andy “Smoothie” Ta oferece à Cloud9 a mistura de atributos perfeita para um suporte: controle de mapa e proteção de carregadores. Após passar grande parte da temporada regular de 2016 dividindo a função de suporte com Bunny FuFuu, Smoothie passou a exercer a função em tempo integral próximo do final da temporada e nunca mais olhou para trás. Apesar de seu pouco tempo de jogo em grande parte da Etapa, Smoothie alcançou o terceiro melhor AMA entre os suportes da liga, marcando 5,6. Ele se sobressaiu de Bardo durante a temporada regular e seu Tahm Kench ajudou a fechar o último jogo contra a Immortals nas Semifinais.</p>\n\n<p>Smoothie trilhou um longo caminho desde a época em que se aventurava no cenário Desafiante na NA até esses últimos dois anos. No início do jogo, sua poderosa fase de rotas consegue proteger Sneaky e ajudar que o principal carregador da C9 chegue inteiro no fim de jogo. Apesar de Smoothie muitas vezes ser ofuscado por Biofrost, outro suporte novato incrível, ele ainda tem um desempenho excelente para alguém com tão pouca experiência no cenário profissional. Mas essa falta de experiência será posta à prova no Mundial, onde ele só terá duas opções: ser massacrado e perder ou manter a calma e vencer sob os enormes holofotes do palco internacional.</p>"},"foreignIds":{"drupalId":"3799","TRLH2":"200000080","TRLH1":"200000176","TRLH3":"200000340"},"socialNetworks":{"twitter":"https://twitter.com/LiquidSmoothiee"},"champions":[],"liveGameTeam":18},{"id":500,"slug":"remilia","name":"Remilia","firstName":"Maria","lastName":"Creveling","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/remilia-2xae9ut5.png","hometown":"USA","region":"NA LCS","birthdate":"1995-02-02","createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-09T22:17:03.000Z","bios":{"en_US":"<p>\nMaria \"Remi\" Creveling is one of the most mechanically skilled up-and-coming supports in North America. Commonly known as \"MadWife\" due to her <a href=\"https://www.youtube.com/watch?v=Ju3VybZ3HY8\" target=\"_blank\">impeccable Thresh hooks</a>, Remi can (and has) single-handedly turned the tides of a game due to her individual skill.\n</p>","fr_FR":"<p>Maria « Remilia » Creveling est l'un des supports les plus prometteurs d'Amérique du Nord en termes de\n\nmécaniques de jeu. Également surnommée « MadWife » grâce à ses lancers de grappin impeccables \n\navec Thresh, Remilia peut renverser la tendance d'une partie à elle toute seule grâce à son talent \n\nindividuel (ce qu'elle ne se gêne pas pour faire). Bien qu'elle fasse ses débuts aux LCS NA, Remilia a \n\naccompli suffisamment d'exploits durant les Challenger Series NA et en file solo pour qu'on puisse avoir \n\nla certitude qu'elle saura terroriser son adversaire.</p>","pl_PL":"<p>To absolutnie unikatowy członek LA Renegades. Patrząc na jej mało znaną przeszłość, nikt się nie spodziewał, że w sezonie 6 to właśnie ona zapisze się na stałe w kartach historii League of Legends. Jest pierwszą kobietą, która wzięła udział w rozgrywkach LCS. Jednak dużo ciekawsza od tego faktu jest jej droga do tego celu. Podróż Marii do NA LCS rozpoczęła się bardzo wcześnie - chociaż pasjonuje się dziełem Riot Games od wczesnego pierwszego sezonu, to do trzeciego nie brała udziału w konkursowych rozgrywkach. W lipcu 2013 na miesiąc dołączyła do Curse Academy i miała okazję zagrać w MOBAFire Challenger Series. Przez kolejne 2 lata szukała swojego miejsca na profesjonalnej scenie League of Legends. Maria miała okazję grać z wieloma znanymi zawodnikami, jak np. \"Chaox”. Kompetencje zdobyte podczas tych poszukiwań, sprawiły, że stała się powszechnie znana i poważana wśród profesjonalnych graczy. W marcu 2015 roku dołączyła do Misfits i od tego momentu zaczęły się jej sukcesy.</p>\n<p>Pierwszym znaczącym wyczynem była wygrana w AlphaDraft Challenger League na przełomie kwietnia i maja 2015 roku. Maria i jej zespół przegrali tylko jeden mecz podczas całego wydarzenia. Następnie skończyła Challenger Series z rewelacyjnym wynikiem 8:2, jednak w dogrywce ulegli Team Coast. Ostatecznie w meczach barażowych pokonali Team Imagine 2:1, a następnie Team Coast 3:2. W ten sposób \"Remilia\" stała się pierwszą kobietą, która została zakwalifikowana do rozgrywek LCS. </p>\n<p>Doskonale widać jak Maria rozwijała swoje umiejętności podczas kolejnych sezonów – zaczynała od złota w pierwszym sezonie, a w każdym kolejnym była o szczebel wyżej. W społeczeństwie League of Legends często jest nazywana „Madwife”, ze względu na wyjątkowe umiejętności w grze swoim ulubionym bohaterem – Threshem. Jednak żaden bohater nadający się jako suport nie jest jej obcy. Grając w szeregach LA Renegades wielokrotnie pokazywała, że również potrafi grać na najwyższym poziomie Morganą, Nautilusem oraz Janną. Dużo można się dowiedzieć o jej preferencjach z portali społecznościowych, gdyż jest wyjątkowo aktywna m.in. na Twitterze. Już po pierwszym rzucie oka na profil Marii widać, że uwielbia anime, co też przysporzyło jej wielu wielbicieli.</p>\n"},"foreignIds":{"drupalId":"1327","TRLH1":"1001220129","TRLH2":"1001160179"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":18}],"scheduleItems":[{"id":"AVw2eyggQMQFcjhwbQ1i","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:73484b50-fead-4588-bcf6-53456e3fb9a0","scheduledTime":"2017-06-18T22:00:00.299+0000","tags":{"blockLabel":"3","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"73484b50-fead-4588-bcf6-53456e3fb9a0","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"5c69f9be-fce7-4ef3-ab49-14a109eb0b2d","gameHash":"5991e235e5f64a66"},{"id":"69d6fe14-9d4d-472f-950a-6a50615cb891","gameHash":"99760ac33cf3a905"}],"videos":[{"id":7419,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:5c69f9be-fce7-4ef3-ab49-14a109eb0b2d","source":"https://www.youtube.com/embed/emXtQsNYa3c?wmode=transparent&rel=0","createdAt":"2017-06-18T22:23:15.000Z","updatedAt":"2017-06-18T22:23:15.000Z","game":"5c69f9be-fce7-4ef3-ab49-14a109eb0b2d"},{"id":7457,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:69d6fe14-9d4d-472f-950a-6a50615cb891","source":"https://www.youtube.com/embed/6pHTwsERl0Y?wmode=transparent&rel=0","createdAt":"2017-06-20T22:28:03.000Z","updatedAt":"2017-06-20T22:28:03.000Z","game":"69d6fe14-9d4d-472f-950a-6a50615cb891"}],"htmlBlocks":[],"match":{"id":"73484b50-fead-4588-bcf6-53456e3fb9a0","name":"FLY-vs-C9","position":15,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"},{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],"games":{"cdc530e2-82ba-440c-a646-2d241cde56c3":{"id":"cdc530e2-82ba-440c-a646-2d241cde56c3","name":"G3","generatedName":"C9|FLY|G3|73484b50fead4588bcf6","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"},{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5c69f9be-fce7-4ef3-ab49-14a109eb0b2d":{"id":"5c69f9be-fce7-4ef3-ab49-14a109eb0b2d","name":"G1","generatedName":"C9|FLY|G1|73484b50fead4588bcf6","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"},{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497824909050,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497822449541,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002230213","gameRealm":"TRLH1","platformId":"TRLH1:1002230213","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"69d6fe14-9d4d-472f-950a-6a50615cb891":{"id":"69d6fe14-9d4d-472f-950a-6a50615cb891","name":"G2","generatedName":"C9|FLY|G2|73484b50fead4588bcf6","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497997990209,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497825462771,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002230219","gameRealm":"TRLH1","platformId":"TRLH1:1002230219","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497997990269,"source":"bestOf","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1497825462771,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9":1,"366948fe-89b4-4353-9e46-bb0f86107a6e":0}}}