{"teams":[{"id":181,"slug":"isurus-gaming","name":"Isurus Gaming","guid":"be70f742-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/isurus-gaming-93mimfv8.png","acronym":"ISG","homeLeague":"urn:rg:lolesports:global:league:league:24","altLogoUrl":null,"createdAt":"2016-01-18T19:09:51.000Z","updatedAt":"2017-07-24T15:37:12.000Z","bios":{"es_AR":"<p>Isurus Gaming nació en Latinoamérica en el 2013 y ha sido una de las organizaciones más exitosas desde entonces. El equipo tiene un exceso de trofeos en la región, incluyendo tres trofeos de primer lugar en los últimos dos años. El equipo entró al 2017 como una de los alineaciones más estables de la región. Solo cambió de jugadores cuando <strong>Claudio \"Clatos\" Navarrete</strong> se retiró de la escena profesional. Los tiburones también hicieron historia como el primer equipo de LAS en dejar su hogar y visitar Corea. La inversión rindió frutos cuando Isurus ganó el primer lugar en la CLS, y ahora tiene la oportunidad de jugar contra algunos de los mejores equipos del mundo. Con una de las alineaciones más consolidadas que América del Sur tiene para ofrecer, Isurus quiere destacar con su primer boleto al Mid-Season Invitational.</p>","en_US":"<p>Isurus Gaming came to power in the Latin American scene in 2013 and they’ve been one of the most successful organizations since. The team has collected a plethora of trophies in the region including three first place finishes over the last two years. The team came into 2017 with one of the steadiest rosters in the region, only changing players in the jungle after Claudio \"Clatos\" Antonio Navarrete Salazar retired from professional play.</p>\n\n<p>The sharks also made history as the first LAS team to leave their homeland and bootcamp in Korea. The investment paid off as Isurus took the first place crown in the CLS and now have a shot to play against some of the best teams in the world. With one of the most star-studded rosters that Latin America South has to offer, Isurus is looking to make a splash with their first-ever ticket to the Mid-Season Invitational.</p>\n\n<p>Coach: Mark “Ukkyr” Leuenberger</p>","de_DE":"Isurus Gaming etablierte sich 2013 als Macht in Lateinamerika und ist seither eine der erfolgreichsten Mannschaften der Region. Die Mannschaft hat in ihrer Region bereits eine Fülle an Trophäen gewonnen, und konnte sich in den letzten zwei Jahren drei erste Plätze sichern. Isurus Gaming hat sich 2017 nur an einer Position verändert (sie mussten einen neuen Jungler suchen, nachdem Claudio „Clatos“ Antonio Navarrete Salazar seine professionelle Karriere beendet hatte) und gehört damit zu den beständigsten Mannschaften der Region. Außerdem schrieben die Haie als erste LAS-Mannschaft, die ihre Heimat verließ und in Korea trainierte, Geschichte. Die Investition machte sich bezahlt, denn Isurus konnte die CLS gewinnen und hat jetzt die Chance, sich mit den besten Mannschaften der Welt zu messen. Isurus hat die meisten Starts Lateinamerikas (Süd) in seiner Aufstellung und wird versuchen, bei ihrem ersten Auftritt beim Mid-Season Invitational überhaupt, für Furore zu sorgen.","cs_CZ":"","fr_FR":"Isurus Gaming a fait son apparition sur la scène latino-américaine en 2013 et n'a cessé d'engranger les réussites depuis. L'équipe a raflé une pléthore de trophées dans la région et a notamment obtenu trois premières places sur ces deux dernières années. Isurus Gaming a abordé 2017 avec une des formations les plus stables de la région. En effet, seul son jungler a changé après que Claudio « Clatos » Antonio Navarrete Salazar s'est retiré de la scène professionnelle. Les requins ont également marqué l'histoire en étant la première équipe LAS à quitter sa terre natale pour aller s'entraîner en Corée. Et l'investissement a payé : Isurus a remporté la CLS et a maintenant l'opportunité d'affronter certaines des meilleures équipes du monde. Dotée des plus grandes stars d'Amérique latine Sud, Isurus compte bien créer la sensation pour sa toute première participation au Mid-Season Invitational.","pl_PL":"Isurus Gaming zdobyli rozgłos na scenie Ameryki Łacińskiej w 2013 roku i od tamtej pory pozostają jedną z najlepiej sobie radzących organizacji. W ciągu ostatnich dwóch lat drużyna zdobyła szereg nagród w regionie, włącznie z trzykrotnym zajęciem pierwszego miejsca. Drużyna rozpoczęła 2017 rok z jednym z najmocniejszych składów w regionie, zmieniając tylko zawodników w dżungli, po tym jak Claudio „Clatos” Antonio Navarrete Salazar zakończył występy profesjonalne. Rekiny przeszły do historii także jako pierwsza drużyna LAS, która wyjechała z ojczyzny na obóz treningowy w Korei. Inwestycja opłaciła się, gdy Isurus zajęli pierwsze miejsce w CLS, a teraz mają szansę zagrać przeciwko kilku najlepszym drużynom na świecie. Mając jeden z najbardziej gwiazdorskich składów w Ameryce Łacińskiej — Południe, Isurus spróbują narobić szumu i zdobyć swój pierwszy bilet na Mid-Season Invitational","es_ES":"Isurus Gaming ganó protagonismo en la escena latinoamericana en 2013 y, desde entonces, se han convertido en una de las organizaciones más exitosas. El equipo acumula múltiples trofeos regionales; entre ellos, tres primeros puestos en los últimos dos años. El equipo inició la temporada 2017 con una de las plantillas más estables de su región. Solo sustituyeron al jungla, dado que Claudio Antonio ''Clatos'' Navarrete Salazar decidió retirarse de la escena profesional. Los tiburones también hicieron historia como el primer equipo de LAS que abandona su tierra para entrenar en Corea. La inversión dio su fruto, pues Isurus se ha hecho con la corona del primer puesto en la CLS y ahora tendrá la oportunidad de jugar contra algunos de los mejores equipos del mundo. Con una de las plantillas más estelares de Sudamérica, Isurus pretende dejar huella en su primera participación en el Mid-Season Invitational.","pt_BR":"<p>A Isurus Gaming nasceu na América Latina em 2013 e, desde então, tem sido uma das organizações mais bem-sucedidas no meio. A equipe colecionou uma série de troféus na região, incluindo três de primeiro lugar nos últimos dois anos. Em 2017, a Isurus Gaming formou uma das equipes mais estáveis da região, tendo mudado de jogador apenas quando Claudio \"Clatos\" Antonio Navarrete Salazar se aposentou do cenário profissional. Os caras também fizeram história como a primeira equipe da América Latina - Sul a deixar sua terra natal e ir treinar na Coreia. O investimento valeu a pena, pois a Isurus levou o primeiro lugar no CLS e agora tem a chance de enfrentar alguns dos melhores times do mundo. Com uma das seleções mais premiadas que o sul da América Latina tem a oferecer, a Isurus vai tentar deixar sua marca com sua primeira participação no Mid-Season Invitational.</p>"},"foreignIds":{},"players":[1189,1191,1192,1257,1368,2018,2020],"starters":[1189,1191,1192,1257,1368],"subs":[2018,2020]},{"id":318,"slug":"marines-esports","name":"GIGABYTE Marines","guid":"0d7c7400-eeee-458d-a76f-3e0440c7bdbf","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/marines-esports-ed4kafqu.png","acronym":"GAM","homeLeague":"urn:rg:lolesports:global:league:league:10","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/marines-esports-fqdynzgf.png","createdAt":"2017-04-16T19:37:27.000Z","updatedAt":"2017-07-26T17:50:26.000Z","bios":{"en_US":"<p>Vietnam’s GIGABYTE Marines are one of the youngest professional organizations in the world, having been formed at the tail end of 2016. They wasted no time in picking up top talent for the region and as a result rampaged through their first split in the Vietnam Championship Series A Spring Season. Through the regular season and playoffs they didn’t drop a single game to any opponent, showcasing just how dominant they could be. Their momentum carried through to the Garena Premier League (GPL), where they were seeded into the playoffs and subsequently qualified for the 2017 Mid-Season Invitational after dispatching the opposition in convincing fashion. If their early success is any indication, they’ll be a team to watch as they square up against some of the best teams in the world.</p>\n\n<p>Coach: Nguyen Duy Thanh “Tinikun” Duong</p>","es_AR":"<p>Los Marines Esports de Vietnam son una de las organizaciones profesionales más jóvenes del mundo; se formaron a finales de 2016. No perdieron tiempo en escoger a los mejores talentos de la región y, como resultado, arrasaron en su primer torneo en la temporada de primavera del Campeonato Serie A de Vietnam. Durante la temporada regular y eliminaciones no cedieron ni una sola partida a sus oponentes, demostrando qué tan dominantes podían ser. Su impulso se extendió hasta la Garena Premier League (GPL), en donde tuvieron una entrada en las eliminatorias y subsecuentemente calificaron para el Mid-Season Invitational 2017 después de acabar con la oposición de una manera bastante persuasiva. Si su éxito temprano es un indicio, será un equipo que habrá que seguir al enfrentarse a algunos de los mejores equipos en el mundo.</p>","pl_PL":"Wietnamscy Marines Esports to jedna z najmłodszych organizacji profesjonalnych na świecie. Uformowali się pod sam koniec 2016 roku. Nie tracąc czasu, ściągnęli do siebie najlepsze talenty w regionie i w rezultacie wzięli szturmem swój pierwszy split w sezonie wiosennym Vietnam Championship Series A. W toku sezonu zasadniczego i play-offów nie przegrali z nikim ani jednej gry, pokazując, jak bardzo potrafią dominować. Z impetem przebili się do Garena Premier League (GPL), gdzie zdobyli miejsce w play-offach i w konsekwencji zakwalifikowali się do Mid-Season Invitational 2017, pokonując przeciwników w przekonujący sposób. Jeśli ich wczesny sukces ma być wyznacznikiem przyszłości, będą drużyną, na którą trzeba mieć oko, gdy zmierzą się z kilkoma z najlepszych drużyn na świecie.","fr_FR":"Les Vietnamiens de Marines Esports constituent l'une des équipes les plus jeunes du monde, sa formation ne datant que de fin 2016. Ils n'ont pas perdu de temps pour recruter les meilleurs talents de la région, ce qui leur a permis de faire un carnage lors de leur premier segment, pendant la saison de printemps des Vietnam Championship Series A. Pendant la saison régulière et les play-offs, ils n'ont pas perdu une seule partie, prouvant de manière plus que convaincante leur supériorité. Ils ont ensuite continué sur leur lancée dans la Garena Premier League (GPL), en participant aux play-offs, puis en se qualifiant pour le Mid-Season Invitational 2017 après s'être facilement débarrassés de leurs adversaires. À en juger par son succès précoce, il faudra surveiller Marine Esports de près dans ses futurs affrontements contre les meilleures équipes du monde.","es_ES":"La organización Marines Esports de Vietnam es uno de los equipos profesionales más nuevos del mundo, fundado a finales de 2016. No han dudado al elegir a los mejores talentos de la región y por eso han arrasado en su primer split en la temporada de primavera de la Championship Series vietnamita. Durante la temporada regular y los playoffs, no perdieron una sola partida contra ningún oponente, dejando claro su gran potencial. Ese impulso los llevó hasta la Garena Premier League (GPL), donde participaron en los playoffs y se clasificaron para el Mid-Season Invitational 2017 tras despachar a sus rivales de forma convincente. Si este éxito es muestra de lo que puede llegar a ofrecer, será un equipo a tener en cuenta cuando se enfrente a algunos de los mejores del mundo.","de_DE":"Marines Esports aus Vietnam wurde erst Ende 2016 gegründet und ist damit eine der jüngsten professionellen Organisationen der Welt. Sie verschwendeten jedoch keine Zeit und sicherten sich einige der besten Talente, mit denen sie sich gleich in ihrem ersten Split der vietnamesischen Championship Series A den Titel sichern konnten. Dabei verloren sie weder ein Spiel in der regulären Saison noch in den Entscheidungsspielen und stellten damit unter Beweis, wie dominant sie sein können. Sie konnten ihren Erfolgslauf auch in der Garena Premier League (GPL) fortsetzen, wo sie für die Entscheidungsspiele gesetzt waren und sich für das Mid-Season Invitational 2017 qualifizieren konnten, nachdem sie ihre Gegner in überzeugender Manier besiegt hatten. Wenn sie auf ihrem frühen Erfolg aufbauen können, könnte diese Mannschaft im Duell mit den Besten der Welt für eine Überraschung sorgen.","pt_BR":"<p>A GIGABYTE Marines, do Vietnã, é uma das organizações profissionais mais jovens do mundo, tendo se formado no fim de 2016. Eles não perderam tempo escolhendo grandes talentos da região e, como resultado, atropelaram na primeira Etapa da Temporada de Primavera do Campeonato de Série A do Vietnã. Ao longo da temporada regular e das eliminatórias, eles não perderam uma única partida, demonstrando exatamente até onde eles podem ir. Eles mantiveram esse ritmo até a Garena Premier League (GPL), quando foram cabeça-de-chave e passaram às eliminatórias, qualificando-se para o Mid-Season Invitational 2017 após derrotar os oponentes de forma incontestável. Se o seu sucesso inicial for algum indicativo, vale a pena observá-los em suas disputas contra algumas das melhores equipes do mundo.</p>"},"foreignIds":{},"players":[13,915,1491,1885,1886,1887],"starters":[13,915,1491,1886,1887],"subs":[1885]}],"players":[{"id":13,"slug":"archie","name":"Archie","firstName":"Minh Nhut","lastName":"Tran","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/archie-f50lczuu.png","hometown":"Ho Chi Minh City","region":"SEA","birthdate":"1992-07-26","createdAt":"2014-07-16T22:59:15.000Z","updatedAt":"2017-05-13T18:50:41.000Z","bios":{"en_US":"<p>Minh Nhut \"Archie\" Tran is the brains behind the GIGABYTE Marines. As an AD Carry in a former life with the Saigon Jokers, he became renown for his refined Ezreal play. Not only did he play AD Carry formerly, but he also tried his hand in the top lane as well. As one of the few players that has played at a professional level in three different positions, Archie has accumulated an incredible amount of game knowledge. He leverages all this when he’s masterminding his team’s macro play from the support position. While Optimus and Levi may live in the spotlight, Archie pulls the strings quietly in the background in order to lead the Marines to glory. He’s hoping to orchestrate more victories as his team heads to Brazil for their first test against top-flight international competition.</p>","de_DE":"Minh Nhut „Archie“ Tran ist der Denker von Marines Esports. Archie war in seinem früheren Leben der AD-Carry der Saigon Jokers und erlangte aufgrund seiner starken Spielzüge mit Ezreal Bekanntheit. Er hat früher aber nicht nur als AD-Carry, sondern auch als Top-Laner gespielt. Archie gehört zu den wenigen Spieler, die in ihrer professionellen Karriere auf drei verschiedenen Positionen gespielt haben, und er hat sich ein unglaubliches Wissen über das Spiel angeeignet. Und dieses Wissen nutzt er, wenn er das Makrospiel seiner Mannschaft von der Supporter-Position aus lenkt. Obwohl Optimus und Levi mehr im Rampenlicht stehen, ist es eigentlich Archie, der im Hintergrund die Fäden zieht und die Marines zum Ruhm führt. Er hofft, seine Mannschaft auch in Brasilien zu einigen Siegen führen zu können, wo sie sich mit der internationalen Konkurrenz messen müssen.","es_ES":"Minh Nhut ''Archie'' Tran es el cerebro detrás de Marines Esports. Jugó como AD carry para Saigon Jokers y se hizo famoso por sus grandes jugadas con Ezreal. No solo ha jugado como ADC, sino que también ha pasado por la calle superior. Archie, uno de los pocos jugadores que ha jugado a nivel profesional en tres posiciones diferentes, ha acumulado una cantidad increíble de conocimiento sobre el juego. Saca provecho de su gran conocimiento cuando planea las macroestrategias de su equipo desde la posición de apoyo. Aunque Optimus y Levi se lleven el protagonismo, Archie maneja los hilos entre bambalinas para que los Marines consigan la gloria. Espera poder orquestar más victorias ahora que su equipo se dispone a viajar a Brasil para disputar su primer campeonato internacional.","fr_FR":"Minh Nhut « Archie » Tran est le cerveau des Marines Esports. Ancien carry AD des Saigon Jokers, il est devenu célèbre pour son utilisation raffinée d'Ezreal. En plus de son expérience de carry, il s'est également essayé à la voie du haut. L'un des seuls joueurs à avoir joué dans trois positions différentes au niveau professionnel, Archie a accumulé des connaissances de jeu inégalables. Et il en tire profit en orientant le macro-jeu de son équipe à partir de sa position de support. Optimus et Levi vivent peut-être sous le feu des projecteurs, mais c'est Archie qui tire les ficelles dans l'ombre afin de conduire les Marines à la gloire. Il espère maintenant orchestrer d'autres victoires alors que son équipe se dirige vers le Brésil pour son premier défi contre les meilleurs joueurs internationaux.","pl_PL":"Minh Nhut „Archie” Tran to mózg Marines Esports. Jako były prowadzący Saigon Jokers stał się znany z doskonałej gry Ezrealem. Nie tylko grał wcześniej jako prowadzący, ale także próbował sił na górnej alei. Będąc jednym z niewielu zawodników, którzy grali na profesjonalnym poziomie na trzech różnych pozycjach, Archie uzyskał niesamowity zasób wiedzy o grze. Wykorzystuje ją w pełni, gdy kieruje grą makro swojej drużyny z pozycji wspierającego. Podczas gdy Optimus i Levi walczą w blasku jupiterów, Archie cicho pociąga za sznurki w tle, prowadząc Marines do chwały. Ma nadzieję, że uda mu się zdobyć więcej zwycięstw, gdy jego drużyna wybierze się do Brazylii, by po raz pierwszy przetestować swoje umiejętności przeciwko najlepszym rywalom międzynarodowym.","pt_BR":"<p>Minh Nhut \"Archie\" Tran é o cérebro por trás da GIGABYTE Marines. Como ADC anterior da Saigon Jokers, ele ficou famoso por seu jogo refinado como Ezreal. Não só ele jogou como ADC antes, como também tentou a mão pela rota superior. Como um dos poucos jogadores que se aventuraram no nível profissional em três posições distintas, Archie acumulou uma enorme quantidade de conhecimento do jogo. Ele tira proveito de tudo isso quando planeja o jogo da equipe a partir de sua posição de suporte. Enquanto Optimus e Levi vivem sob os holofotes, Archie carrega o piano silenciosamente por trás dos panos e leva os Marines à glória. Ele espera orquestrar mais vitórias agora que sua equipe vai ao Brasil disputar sua primeira competição internacional.</p>"},"foreignIds":{"drupalId":"960","TRLT3":"200000051","TRLH1":"200000446","TRLH2":"200000346"},"socialNetworks":{"facebook":"https://www.facebook.com/SAJArchie-312854105507403/"},"champions":[{"id":206,"playerId":13,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2015-11-26T18:17:10.000Z","updatedAt":"2017-05-13T18:50:41.000Z"}],"liveGameTeam":318},{"id":915,"slug":"optimus","name":"Optimus","firstName":"Van Cuong","lastName":"Tran","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/optimus-iccm94kb.png","hometown":null,"region":"N/A","birthdate":"","createdAt":"2015-11-26T18:26:07.000Z","updatedAt":"2017-05-13T18:46:14.000Z","bios":{"en_US":"<p>Van Cuong “Optimus” Tran is making his case for being the best mid laner in the Southeast Asia region. Nicknamed “OP-timus” for his many highlight plays, Optimus began his career in 2013 with the Saigon Jokers. Despite a brief stint as an ADC, he’s proven himself a match for SEA mid lane legends Westdoor and Morning. He’s a veteran of several international events, including a handful of All-Star events where he showed the world glimpses of his ridiculous skill ceiling, but he’ll need to keep surprising us in order to give his team a fighting chance in Brazil. One thing’s for sure, though: When you’ve got someone like Optimus who has ample experience and can pop off at a moment’s notice, you’ll always have at shot at downing even the mightiest of foes.</p>","de_DE":"Van Cuong „Optimus“ Tran beansprucht den Titel des besten Mid-Laners in Südostasien für sich. Optimus hat seine Karriere im Jahr 2013 bei den Saigon Jokers begonnen und für seine vielen überragenden Spielzüge den Spitznamen „OP-timus“ bekommen. Trotz eines kurzen Intermezzos als AD-Carry bewies er, dass er den südostasiatischen Mid-Laner-Legenden, Westdoor und Morning, das Wasser reichen kann. Er war schon bei einigen internationalen Events dabei, darunter auch eine Handvoll All-Stars-Events, bei denen er der Welt Teile seines unglaublichen Könnens zeigen konnte. Aber er wird uns auch weiterhin überraschen müssen, damit seine Mannschaft in Brasilien eine Chance hat. Eines ist aber sicher: Wenn du jemanden wie Optimus in deiner Mannschaft hast, der schon einiges an Erfahrung hat und sein Können im Handumdrehen abrufen kann, dann hast du selbst gegen die stärksten Gegner eine Chance.","es_AR":"<p><strong>Van Cuong \"Optimus\" Tran</strong> demostrará por qué es el mejor carrilero central de la región del Sureste de Asia. <strong>Optimus</strong> comenzó su carrera en 2013 con los Saigon Jokers y recibió el apodo de <strong>\"OP-timus\"</strong> por sus muchas jugadas estelares. A pesar de un corto tiempo como tirador, <strong>Van Cuong</strong> ha demostrado ser un competidor digno frente a leyendas de la región SEA del carril central como <strong>Westdoor</strong> y <strong>Morning</strong>. Es un veterano en una gran cantidad de eventos internacionales, incluyendo varios eventos All-Star en donde le ha mostrado al mundo vistazos de su increíble techo de habilidad; sin embargo, tendrá que seguir sorprendiéndonos para que pueda darle una oportunidad a su equipo en Brasil. Pero hay algo que es seguro: Cuando tienes a alguien como <strong>Optimus</strong>, con una amplia experiencia y que puede aparecerse de la nada en cualquier momento, siempre tendrás una oportunidad de vencer al enemigo más fuerte.</p>","es_ES":"Van Cuong ''Optimus'' Tran quiere demostrar que es el mejor mid de la región del sudeste asiático. Comenzó su trayectoria en 2013 con los Saigon Jokers, y fue apodado ''OP-timus'' por sus muchas jugadas destacadas. A pesar de haber pasado un breve periodo de tiempo jugando como ADC, ha demostrado estar a la altura de las leyendas mid del sudeste asiático Westdoor y Morning. Veterano en diversos eventos internacionales, ha participado en varios All-Star, donde mostró al mundo su estratosférica habilidad. No obstante, tendrá que seguir sorprendiéndonos si quiere que su equipo tenga la oportunidad de competir en Brasil. Una cosa está clara: si un equipo cuenta con alguien como Optimus, con gran experiencia y que puede reaccionar al instante, siempre existirá una oportunidad de vencer a los enemigos más fuertes.","fr_FR":"Van Cuong « Optimus » Tran a prouvé son talent en devenant le meilleur midlaner d'Asie du Sud-Est. Surnommé « OP-timus » pour ses nombreux temps forts, Optimus a commencé sa carrière en 2013 avec les Saigon Jokers. Malgré une courte période en tant qu'ADC, il a démontré qu'il était au niveau des midlaners mythiques de la région, Westdoor et Morning. Il a déjà participé à de nombreux événements internationaux, dont quelques tournois All-Stars où il a fait preuve d'un niveau de maîtrise absolu, mais il devra continuer à nous surprendre si son équipe espère remporter la victoire au Brésil. En tout cas, une chose est sûre : Avec un joueur expérimenté et capable d'exploser instantanément comme Optimus, même les ennemis les plus redoutables peuvent devenir inoffensifs.","en_PL":"","es_MX":"Van Cuong ''Optimus'' Tran está haciendo las maletas porque es el mejor central del Sudeste Asiático. Comenzó su trayectoria en 2013 con los Saigon Jokers, y recibe el nombre de ''OP-timus'' por sus jugadas de otro nivel. A pesar de que pasó un breve periodo de tiempo jugando como ADC, ha demostrado que puede equipararse a las leyendas de central de su región, Westdoor y Morning. En el International Wildcard All-Star Event 2016, demostró, en varias partidas clave, lo engañosa y destructiva que es la recientemente actualizada LeBlanc. Ahora tendrá la oportunidad de poner a prueba sus habilidades contra los centrales de todo el mundo en el All-Star Event 2016 de Barcelona.","pl_PL":"Van Cuong „Optimus” Tran zdobywa dla siebie uznanie jako najlepszy środkowy regionu Azji Południowowschodniej. Zyskał przezwisko „OP-timus” za swoje liczne świetne zagrywki. Karierę rozpoczął w 2013 r. u Saigon Jokers. Pomimo krótkich występów jako prowadzący, okazał się godnym przeciwnikiem legend środkowej alei z SEA, Westdoora i Morninga. Jest weteranem kilku imprez międzynarodowych, włącznie z paroma turniejami All-Star, na których pokazał światu swój niesamowicie wysoki pułap umiejętności. Będzie jednak musiał dalej nas zaskakiwać, aby zapewnić swojej drużynie szanse podczas walki w Brazylii. Jedno jest pewne: gdy ma się w drużynie kogoś takiego jak Optimus, z jego wielkim doświadczeniem, który potrafi momentalnie dać z siebie wszystko, zawsze jest szansa na pokonanie nawet najsilniejszych przeciwników.","pt_BR":"<p>Van Cuong \"Optimus” Tran tem se candidatado como melhor jogador da rota do meio do sudeste asiático. Conhecido como \"OP-timus” por realizar muitas jogadas de destaque, Optimus começou sua carreira em 2013 pela Saigon Jokers. Embora já tenha jogado como Atirador, ele provou ser tão bom quanto os lendários Westdoor e Morning, jogadores da rota do meio do sudeste asiático. Ele tem experiência em muitos eventos internacionais, incluindo alguns eventos All-Star, onde deu ao mundo mostras de sua habilidade absurda. Contudo ele terá de continuar nos surpreendendo se quiser ajudar a sua equipe a chegar longe no MSI 2017. Mas uma coisa é certa: Quando você tem alguém como Optimus, que tem ampla experiência e pode tirar um coelho da cartola a qualquer momento, você sempre terá chance de derrubar até os mais poderosos adversários.</p>"},"foreignIds":{"TRLH3":"1001360038","TRLH4":"1001310038","TRLT3":"200000049","TRLH1":"200000444","TRLH2":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1189,"slug":"pride","name":"Pride","firstName":"Franco","lastName":"Sanzana","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pride-3wvs6u0n.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1996-05-19","createdAt":"2016-03-21T17:02:40.000Z","updatedAt":"2017-06-19T14:26:31.000Z","bios":{"es_AR":"<p><strong>Franco \"Pride\" Sanzana</strong> comenzó su carrera a finales del 2013, y con el tiempo llegó a Isurus Gaming en el 2015, en donde ha estado desde entonces. Su debut en la CLS no fue exactamente destacado, le llovieron críticas mientras se posicionaba en el carril superior. Pronto se estabilizó y se volvió famoso por su poza de campeones extremadamente amplia. En la temporada regular, <strong>Pride</strong> jugó con 14 campeones diferentes, lo cual le dio a Isurus la flexibilidad que necesitaba para poder quedar en primer lugar en las eliminatorias de la CLS. Su equipo cuenta con su flexibilidad mientras busca la oportunidad de pelear contra los mejores equipos del mundo en el evento principal del Mid-Season Invitational 2017.</p>","en_US":"<p>Franco “Pride” Sanzana started his career in late 2013 and eventually made his way to Isurus Gaming in 2015, where he’s been ever since. His debut in the CLS wasn’t exactly explosive, and he was the subject of criticism as he found his footing in the top lane. He would soon steady out and become renowned for his extremely deep champion pool. Over the regular season, Pride played 14 unique champions which gave Isurus the draft flexibility they needed in order to take home first place in the CLS playoffs. His team will rely on his flexibility as they fight for a chance to play against the best teams in the world at the 2017 Mid-Season Invitational Main Event.</p>","de_DE":"Franco “Pride” Jesús Sanzana Villarroel begann seine Karriere Ende 2013 und wechselte 2015 zu Isurus Gaming, wo er seither spielt. Sein Debüt in der CLS war nicht gerade erfolgreich und er musste sich viel Kritik gefallen lassen, während er sich an seine Rolle als Top-Laner gewöhnte. Dennoch konnte er schnell mit guten Leistungen aufzeigen und ist für seinen extrem umfangreichen Championpool bekannt. Im Verlauf der regulären Saison spielte Pride 14 unterschiedliche Champions und verleiht Isurus dadurch genug Flexibilität, um die Entscheidungsspiele der CLS auf dem ersten Platz zu beenden. Seine Mannschaft wird auch beim Mid-Season Invitational 2017 auf seine Flexibilität setzen, wo sie in der Vorrunde um einen Platz beim Haupt-Event kämpfen.","fr_FR":"Franco « Pride » Jesús Sanzana Villarroel a débuté sa carrière fin 2013 pour finalement intégrer en 2015 Isurus Gaming, où il évolue actuellement. Après des débuts relativement ternes en CLS, il a fait l'objet de nombreuses critiques avant de trouver ses marques sur la voie du haut. Pride a ensuite stabilisé son jeu et est devenu célèbre pour son pool de champions très varié. Lors de la saison régulière, Pride a joué 14 champions différents, donnant ainsi à Isurus une flexibilité qui s'est révélée décisive pour prendre la première place des play-offs de la CLS. Son équipe s'appuiera sans aucun doute sur sa polyvalence dans la lutte qui lui permettra peut-être d'affronter les meilleures équipes du monde lors du Mid-Season Invitational 2017.","es_ES":"Franco Jesús ''Pride'' Sanzana Villarroel comenzó su carrera deportiva al final de 2013 y, finalmente, fue fichado por Isurus Gaming en 2015, donde ha permanecido desde entonces. Su debut en la CLS no fue precisamente explosivo, y tuvo que enfrentarse a las críticas mientras se adaptaba a la calle superior. No obstante, no tardaría en aclimatarse y en hacerse famoso por su gran repertorio de campeones. Durante la temporada regular, Pride jugó con 14 campeones diferentes, lo que proporcionó a Isurus la flexibilidad que necesitaba para hacerse con el primer puesto en los playoffs de la CLS. Su equipo confiará en su flexibilidad cuando compitan por poder enfrentarse contra los mejores equipos del mundo en el evento principal del Mid-Season Invitational 2017.","pl_PL":"Franco „Pride” Jesús Sanzana Villarroel rozpoczął karierę pod koniec 2013 r. i ostatecznie trafił do Isurus Gaming w 2015 r., gdzie gra do tej pory. Jego debiut w CLS nie był szczególnie porywający i zawodnik spotykał się z krytyką, gdy szukał swojego miejsca na górnej alei. Wkrótce nabrał pewności siebie i stał się znany ze swojej niezwykle rozległej puli bohaterów. W toku sezonu zasadniczego Pride grał 14 różnymi bohaterami, co zapewniło Isurus elastyczność wyboru, której potrzebowali, by zabrać do domu nagrodę za zdobycie pierwszego miejsca w play-offach CLS. Drużyna będzie polegała na jego wszechstronności, walcząc o szansę gry przeciwko najlepszym drużynom na świecie podczas głównego wydarzenia na Mid-Season Invitational.","pt_BR":"<p>Franco \"Pride\" Jesús Sanzana Villarroel começou sua carreira no final de 2013 e terminou na Isurus Gaming em 2015, onde está desde então. Sua estreia na CLS não foi exatamente bem-vinda, e ele foi alvo de críticas à medida que se desenvolvia na rota superior. Logo ele se estabeleceu e ficou renomado por sua grande variedade de Campeões. Ao longo da temporada regular, Pride jogou com 14 Campeões diferentes, o que deu à Isurus a flexibilidade de combinações de que precisava para levar para casa o primeiro lugar na CLS. Sua equipe vai confiar em sua flexibilidade enquanto luta por uma chance de jogar contra os melhores do mundo no grande evento do Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000080"},"socialNetworks":{"twitch":"http://www.twitch.tv/frannkiitoo","facebook":"https://www.facebook.com/Frannkiitooop"},"champions":[{"id":273,"playerId":1189,"championId":111,"championKey":"Nautilus","championName":"Nautilus","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"},{"id":274,"playerId":1189,"championId":78,"championKey":"Poppy","championName":"Poppy","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"},{"id":275,"playerId":1189,"championId":33,"championKey":"Rammus","championName":"Rammus","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"}],"liveGameTeam":181},{"id":1191,"slug":"emp","name":"emp","firstName":"Benjamín","lastName":"Ramírez","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/emp-8oj6hyco.png","hometown":"Copiapó, Chile","region":"Copa Latinoamérica Sur","birthdate":"1996-09-17","createdAt":"2016-03-21T17:20:48.000Z","updatedAt":"2017-06-19T14:28:29.000Z","bios":{"es_AR":"<p><strong>Benjamin \"emp\" Ramírez</strong> jugó como tirador antes de pasar al carril central en el 2015. Esa fue la mejor jugada de su carrera, ya que se le considera el mejor carrilero central y hasta el mejor jugador de la CLS. Punto. Su estrategia perfecta junto a su inmensa poza de campeones lo convierten en un letal oponente en cualquier partida. Su amplio conocimiento es considerado como el mejor de la región de Latinoamérica Sur. <strong>Emp</strong> podrá ser el mejor en la CLS, pero está a punto de encontrarse con otro nivel de competencia cuando llegue al escenario internacional del MSI. Dependerá de él guiar a Isurus Gaming mientras pelean por estar en el evento principal en Río.</p>","en_US":"<p>Benjamin “emp” Ramírez played ADC before making the jump to the mid lane in 2015. The move ended up being the best of his career, as he’s widely considered the best mid laner, if not the best player in the CLS -- period. His rock solid mechanics coupled with his ocean-deep champion pool makes him a lethal opponent in any game. His macro knowledge is also applauded as some of the best in the Latin America South region. Emp may be the best in the CLS, but he’s about to find a new level of competition as he hits the international stage at MSI. It’ll be up to him to lead Isurus Gaming as they fight their way to the main event in Rio.</p>","de_DE":"Benjamin „Emp“ Ramírez war AD-Carry, bevor er 2015 auf die mittlere Lane wechselte. Diese Entscheidung erwies sich als die beste seiner Karriere und er gilt heute als einer der besten Mid-Laner, wenn nicht sogar als der beste Spieler der CLS – Punkt. Seine soliden Mechaniken und sein unglaublich großer Championpool machen ihn in jedem Spiel zu einem tödlichen Gegner. Außerdem hat er mit das umfangreichste „Makro“-Wissen aller Spieler Lateinamerikas (Süd). Emp gehört vielleicht zu den besten Spielern der CLS, aber auf der internationalen Bühne des MSI wird er es mit ganz neuen Gegnern zu tun bekommen. Es wird an ihm liegen, Isurus Gaming ins Haupt-Event von Brasilien zu führen.","fr_FR":"Benjamin « Emp » Ramírez jouait Carry AD avant de se lancer sur la voie du milieu en 2015. Ce choix s'est révélé être le meilleur de sa carrière car il est désormais considéré par beaucoup comme le meilleur mid-laner, si ce n'est le meilleur joueur, de la CLS. Ses mécaniques de jeu irréprochables, associées à un pool de champions extrêmement vaste, font de lui un adversaire redoutable en toute situation. Sa connaissance du jeu est, selon certains, sans égale dans la région Amérique latine Sud. Emp est peut-être le meilleur joueur de la CLS, mais il est sur le point de découvrir un niveau de compétition inédit sur la scène internationale du MSI. Isurus Gaming attend beaucoup de lui lors de la phase qualificative de l'événement qui se tiendra au Brésil.","es_ES":"Benjamín ''Emp'' Ramírez jugaba de AD carry antes de trasladarse a la calle central en 2015. Este cambio resultó ser un hito en su carrera, ya que ahora se le considera uno de los mejores mid, si no jugadores, de la CLS. Sus sólidas mecánicas, así como su gran variedad de campeones, lo convierten en un rival letal en cualquier partida. Su conocimiento de la macroestrategia también es aplaudido como uno de los mejores de la región sudamericana. Puede que Emp sea el mejor de la CLS, pero ahora tendrá que enfrentarse a un nuevo nivel competitivo en el escenario internacional del MSI. En sus manos está liderar a Isurus Gaming hasta el evento principal en Río.","pl_PL":"Benjamin „Emp” Ramírez grał jako prowadzący, zanim w 2015 roku przeskoczył na środkową aleję. Ten skok okazał się najlepszym w jego karierze, ponieważ jest powszechnie uważany za najlepszego środkowego, jeśli nie najlepszego zawodnika w CLS. Kropka. Jego doskonałe umiejętności mechaniczne w połączeniu z rozległą jak ocean pulą bohaterów sprawiają, że jest zabójczym przeciwnikiem w każdej grze. Także jego znajomość gry makro chwalona jest jako jedna z najlepszych w regionie Ameryki Łacińskiej — Południe. Emp być może jest najlepszy w CLS, ale wkrótce zasmakuje rywalizacji na nowym poziomie, wchodząc na międzynarodową arenę MSI. To do niego będzie należało prowadzenie Isurus Gaming podczas walki na drodze do najważniejszego starcia w Rio.","pt_BR":"<p>Benjamin \"Emp\" Ramírez jogou como Atirador antes de mudar para a rota do meio em 2015. A mudança acabou sendo a melhor da sua carreira, pois ele é amplamente considerado o melhor meio, se não o melhor jogador de todos, na CLS e ponto. Sua mecânica extremamente sólida junto com sua seleção de Campeões bastante ampla faz dele um adversário letal em qualquer jogo. Seu conhecimento global também é tido como um dos melhores na região sul da América Latina. Emp pode ser o melhor da CLS, mas está prestes a se deparar com um novo nível de competição no palco internacional do MSI. Ele será o responsável por liderar a Isurus Gaming enquanto lutam por uma vaga no grande evento no Rio.</p>"},"foreignIds":{"TRLT3":"200000081"},"socialNetworks":{"twitch":"http://www.twitch.tv/empl0l","facebook":"https://www.facebook.com/Empl0l"},"champions":[{"id":279,"playerId":1191,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"},{"id":280,"playerId":1191,"championId":7,"championKey":"Leblanc","championName":"LeBlanc","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"},{"id":281,"playerId":1191,"championId":42,"championKey":"Corki","championName":"Corki","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"}],"liveGameTeam":181},{"id":1192,"slug":"newbie","name":"Newbie","firstName":"Leandro","lastName":"Marcos","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/newbie-40l0fj6e.png","hometown":"La Rioja, Argentina","region":"Copa Latinoamérica Sur","birthdate":"1997-01-16","createdAt":"2016-03-21T17:27:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z","bios":{"es_AR":"<p><strong>Leandro \"Newbie\" Marcos</strong> no es ningún novato, aunque su apodo lo sugiera. De hecho, fue el primer jugador latinoamericano en legar al nivel de Retador en el famoso e implacable servidor coreano. Como la mayoría de los jugadores en su equipo, tiene una amplia poza de campeones que le otorga una enorme flexibilidad en la fase de bloqueos. Aunque se siente cómodo con casi todo, destaca cuando cosecha almas con Thresh. Su absurda tasa de victorias del 89% con el Carcelero Implacable lo vuelve una fuerza que temer cuando se encuentra entre la espada y la pared. El entrenamiento de <strong>Newbie</strong> en Corea del Sur lo volvió el mejor soporte de la CLS. Quiere llevar su Sentencia de Muerte a la competencia mientras Isurus Gaming viaja a Brasil para enfrentar su más grande desafío contra los mejores oponentes internacionales en el MSI.</p>","en_US":"<p>Leandro “Newbie” Marcos is about as far from a “newbie” as it gets. In fact, he was the first Latin American player to climb to Challenger Tier on the notoriously ruthless Korean server. Like most players on his team, he sports a deep champion pool that has given them huge amounts of flexibility in the drafting phase. While he feels comfortable on almost anything, he excels at reaping souls on Thresh. His ludicrous 89% win rate on the Chain Warden makes him a force to be reckoned with every time it's locked in for him. Newbie’s training in South Korea has led to him being called the clear cut best support in the CLS. He’s looking to give a Death Sentence to the competition as Isurus Gaming travel to Brazil and face their biggest challenge yet against top-flight international competition at MSI.</p>","de_DE":"Leandro „Newbie“ Marcos ist alles andere als ein Neuling. Er war der erste lateinamerikanische Spieler, der auf dem erbarmungslosen koreanischen Server die Herausforderer-Klasse erreichte. Wie die meisten Spieler aus seiner Mannschaft kann auch er auf einen umfangreichen Championpool zurückgreifen, dank dem er bei der Championauswahl sehr flexibel ist. Obwohl er mit so gut wie jedem Champion zurechtkommt, liefert er mit Thresh überragende Leistungen ab. Seine unglaubliche Siegesrate von 89 % mit dem Kettenwächter macht ihn zu einer Urgewalt, wenn er ihn auswählen kann. Newbies Training in Südkorea hat dazu geführt, dass er als bester Supporter der CLS gilt. Er wird versuchen, das Todesurteil für seine Gegner zu sein, wenn Isurus Gaming nach Brasilien reist und sich dort auf der internationalen Bühne des MSI seiner bisher größten Herausforderung stellt.","fr_FR":"Leandro « Newbie » Marcos n'a en réalité pas grand-chose à voir avec un « newbie ». En fait, c'est même le premier joueur latino-américain à avoir atteint le palier Challenger sur l'impitoyable serveur coréen. Comme la plupart des joueurs de son équipe, il peut se targuer d'un vaste pool de champions qui donne à son équipe une grande flexibilité lors de la sélection. S'il est à l'aise avec quasiment tous les champions, il excelle dans le fauchage d'âmes avec Thresh. Son incroyable taux de victoires de 89 % avec le Garde aux chaînes fait de lui un adversaire mortel chaque fois qu'il joue ce personnage. L'entraînement de Newbie en Corée du Sud l'a conduit à être considéré comme le meilleur support de la CLS. Newbie aimerait bien être un acteur décisif de la victoire de son équipe au Brésil, là où Isurus Gaming devra relever son plus grand défi face à la crème de la compétition internationale, lors du MSI.","es_ES":"Leandro ''Newbie'' Marcos no es tan novato como su nombre sugiere. De hecho, fue el primer jugador latinoamericano que subió al nivel Aspirante en el famoso y despiadado servidor coreano. Como la mayoría de los jugadores de su equipo, es capaz de jugar con campeones muy dispares, lo que le aporta una gran flexibilidad a la hora de crear la composición del equipo. Aunque se siente cómodo con casi cualquier campeón, su habilidad para cosechar almas con Thresh es inmejorable. Su ridículo porcentaje de victorias del 89 % con el Carcelero Implacable lo convierte en un rival a tener en cuenta cada vez que selecciona. Los entrenamientos de Newbie en Corea del Sur han hecho que se convierta, sin lugar a dudas, en el mejor apoyo de la CLS. Ya está preparado para sentenciar a muerte a sus rivales en el viaje a Río de Isurus Gaming, donde se enfrentará a su mayor reto hasta la fecha contra los mejores rivales internacionales en el MSI.","pl_PL":"Leandro „Newbie” Marcos pod żadnym względem nie jest „żółtodziobem”. Prawdę mówiąc, był pierwszym latynoamerykańskim zawodnikiem, który dotarł do Kręgu Pretendenta na bezlitosnym serwerze koreańskim. Podobnie jak większość zawodników w jego drużynie dysponuje szeroką pulą bohaterów, co zapewnia zespołowi dużą elastyczność w fazie wyboru. Chociaż czuje się pewnie niemal z dowolnym bohaterem, najlepiej mu idzie koszenie dusz z Threshem. Ze względu na jego obłędny, wynoszący 89% wskaźnik zwycięstw ze Strażnikiem Łańcuchów, trzeba się z nim liczyć za każdym razem, gdy wybierze tego bohatera. Po treningu w Korei Południowej Newbie zaczął być nazywany zdecydowanie najlepszym wspierającym w CLS. Zamierza wydać Wyrok Śmierci na rywali, gdy Isurus Gaming wyruszą do Brazylii, by zmierzyć się ze swoim największym jak dotąd wyzwaniem w walce przeciwko najlepszym międzynarodowym przeciwnikom na MSI.","pt_BR":"<p>Conheça Leandro \"Newbie\" Marcos, que de newbie não tem nada. De fato, ele foi o primeiro jogador latino-americano a chegar no nível Desafiante no infame e brutal servidor coreano. Assim como a maioria dos jogadores de sua equipe, ele controla uma ampla variedade de Campeões, o que lhe dá imensa flexibilidade na fase de seleção. Embora fique confortável com quase tudo, ele se destaca mesmo ao ceifar almas com o Thresh. Sua inacreditável taxa de vitórias de 89% com o Guardião das Correntes faz dele uma força implacável sempre que é sua vez em jogo. O treinamento de Newbie na Coreia do Sul lhe rendeu o indisputado título de melhor suporte na CLS. Ele vai tentar Sentenciar a concorrência com a Isurus Gaming, enfrentando seu maior desafio contra competidores internacionais de primeira categoria no MSI.</p>"},"foreignIds":{"TRLT3":"200000082"},"socialNetworks":{"facebook":"https://www.facebook.com/GGnewbie","twitch":"https://www.twitch.tv/newbiesupp"},"champions":[{"id":285,"playerId":1192,"championId":40,"championKey":"Janna","championName":"Janna","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"},{"id":286,"playerId":1192,"championId":201,"championKey":"Braum","championName":"Braum","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"},{"id":287,"playerId":1192,"championId":48,"championKey":"Trundle","championName":"Trundle","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"}],"liveGameTeam":181},{"id":1257,"slug":"qqmore","name":"QQmore","firstName":"Diego","lastName":"Apablaza","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/qqmore-fpnz3ic2.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1999-05-03","createdAt":"2016-05-17T20:38:02.000Z","updatedAt":"2017-06-19T14:27:29.000Z","bios":{"es_AR":"<p><strong>Diego \"QQmore\" Apablaza</strong> es uno de los jugadores más jóvenes de la CLS con tan solo 17 años de edad. Comenzó su carrera a mediados del 2016, se unió a Isurus Gaming como sustituto, pero después de la partida del junglero estrella <strong>Claudio \"Clatos\" Navarrete</strong>, QQmore llegó al estrellato... y estaba preparado para ello. En la temporada de Apertura de la CLS del 2017, se volvió famoso por su agresivo estilo de juego, lo cual le consiguió el mejor promedio de asesinatos y muertes y oro por minuto que cualquier otro junglero en la liga. Al parecer, el joven tenía cosas que enseñarles a sus mayores. Lo más impresionante es que aún le quedan años para que mejore su estrategia. ¡Isurus confiará en su agresiva y joven arma para que los lleve a la victoria en el Mid-Season Invitational 2017 de Brasil!</p>","en_US":"<p>Diego \"QQMore\" Apablaza is one of the youngest players in the CLS at just 17 years old. He started his career in mid-2016, joining Isurus Gaming as a substitute, but after the departure of starting jungler Claudio \"Clatos\" Antonio Navarrete Salazar, QQMore was thrust into the spotlight -- and he was ready for it. In the 2017 CLS Opening Season he became notorious for his aggressive style of jungling, which lead to him having the best KDA and GPM of any jungler in the league. It seemed that the youngster had a thing or two to teach his elders. The most impressive part is that he’s still got years left to grow his game. Isurus will be relying on their aggressive young gun to help carry them to victory at the 2017 Mid-Season Invitational in Brazil!</p>","de_DE":"Diego „QQMore“ Apablaza Abarzúa ist mit seinen 17 Jahren einer der jüngsten Spieler der CLS. QQMore begann seine Karriere Mitte 2016 als Ersatzspieler bei Isurus Gaming, aber nach dem Abgang von Claudio „Clatos“ Antonio Navarrete Salazar rückte er plötzlich ins Rampenlicht – und er war mehr als nur bereit. Zu Beginn der Saison 2017 machte er sich mit seinem aggressiven Spielstil im Dschungel einen Namen und hatte die beste TTU und das meiste GPM aller Jungler der Liga. Es hatte den Anschein, als könnten die erfahrenen Spieler noch das ein oder andere von ihm lernen. Und das Beeindruckendste daran ist, dass er sich in den nächsten Jahren noch weiter verbessern kann. Isurus verlässt sich darauf, dass ihr aggressiver, junger Jungler sie beim Mid-Season Invitational 2017 in Brasilien von einem Sieg zum nächsten führen wird!","fr_FR":"Âgé de 17 ans à peine, Diego « QQMore » Apablaza Abarzúa est l'un des plus jeunes joueurs des CLS. Il a débuté sa carrière courant 2016 comme remplaçant au sein d'Isurus Gaming. Suite au départ du jungler titulaire Claudio « Clatos » Antonio Navarrete Salazar, QQMore s'est vu propulsé sur le devant de la scène, une opportunité à laquelle il était préparé. Lors de la saison d'ouverture des CLS 2017, il s'est fait remarquer pour son style de jungler agressif, une qualité de jeu qui lui a valu les meilleures statistiques de KDA et de PO par minute du championnat. Visiblement, le jeunot avait deux ou trois choses à apprendre à ses aînés. Mais ce qui impressionne surtout, c'est qu'il a encore des années devant lui pour développer son jeu. Isurus pourra compter sur la fougue et l'agressivité de ce jeune joueur pour tenter de triompher lors du Mid-Season Invitational 2017 au Brésil !","pl_PL":"Diego „QQMore” Apablaza Abarzúa jest jednym z najmłodszych zawodników CLS. Ma zaledwie 17 lat. Rozpoczął karierę w połowie 2016 roku, dołączając do Isurus Gaming jako rezerwowy, ale po odejściu dżunglera pierwszego składu, Claudio „Clatos” Antonio Navarrete Salazara, QQMore wkroczył w światła jupiterów — i był na to gotowy. W sezonie otwierającym CLS 2017 zasłynął ze swojego agresywnego stylu dżunglowania, dzięki któremu uzyskał najlepsze Z/Z/A i wskaźnik złota na minutę wśród wszystkich dżunglerów w lidze. Wydaje się, że młodzik może nauczyć starszych tego i owego. Najbardziej imponujące jest to, że wciąż ma przed sobą wiele lat na rozwój umiejętności w grze. Isurus będą polegali na swoim agresywnym młodym zawadiace, licząc na to, że pomoże im osiągnąć zwycięstwo na Mid-Season Invitational 2017 w Brazylii!","es_ES":"Diego ''QQMore'' Apablaza Abarzúa, con tan solo 17 años de edad, es uno de los jugadores más jóvenes de la CLS. Comenzó su trayectoria profesional a mitad de 2016, cuando se unió a Isurus Gaming como suplente. No obstante, no sería hasta la retirada del jungla titular, Claudio Antonio ''Clatos'' Navarrete Salazar, que QQMore se convertiría en el protagonista. Y estaba más que preparado para serlo. En la temporada inicial de la CLS 2017, se ha hecho notar por su estilo agresivo en la jungla, lo que le ha permitido conseguir el mejor A/M/A y la mejor media de oro por minuto de todos los junglas de la liga. Parece que el más joven tiene un par de cosas que enseñarles a los más veteranos. Lo más impresionante es que aún le quedan años para seguir mejorando. Isurus confiará en el estilo agresivo de su jugador más joven para hacerse con la victoria en el Mid-Season Invitational 2017 en Brasil.","pt_BR":"<p>Diego \"QQMore\" Apablaza Abarzúa é um dos jogadores mais jovens no CLS, com apenas 17 anos. Ele iniciou sua carreira na metade de 2016, juntando-se à Isurus Gaming como substituo. Porém, depois da partida do caçador inicial, Claudio \"Clatos\" Antonio Navarrete Salazar, QQMore foi lançado sob os holofotes - e estava preparado para isso. Na Temporada de Abertura do CLS 2017, ele ficou em destaque por seu estilo agressivo de jogo na selva, o que o levou a ter as melhores médias de AMA e OPM de todos os caçadores na liga. Parece que o jovem tinha algo a ensinar aos mais velhos. O mais impressionante é que ele ainda tem vários anos para se desenvolver no jogo. Em todo caso, a Isurus acredita que essa força jovem e agressiva possa levá-los à vitória no Mid-Season Invitational 2017 no Rio!</p>"},"foreignIds":{"TRLT3":"200000018"},"socialNetworks":{"facebook":"https://www.facebook.com/qqamor/"},"champions":[{"id":381,"playerId":1257,"championId":203,"championKey":"Kindred","championName":"Kindred","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"},{"id":382,"playerId":1257,"championId":76,"championKey":"Nidalee","championName":"Nidalee","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"},{"id":383,"playerId":1257,"championId":60,"championKey":"Elise","championName":"Elise","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"}],"liveGameTeam":181},{"id":1368,"slug":"kindless","name":"Kindless","firstName":"Benjamín","lastName":"Fuenzalida","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kindless-cgp6i7ju.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1998-07-17","createdAt":"2016-06-13T19:10:32.000Z","updatedAt":"2017-06-19T14:27:25.000Z","bios":{"en_US":"<p>Benjamín \"Kindless\" Fuenzalida is Isurus Gaming’s newest addition to the roster. This addition proved to be fruitful, as Kindless has quickly become one of the best marksmen in the CLS. He can switch up his style in order to meet the demands of the draft while still dishing out consistent damage on whatever champion he happens to get. Need some long range initiation? Pick up the artsy murderer, Jhin. How about consistent damage throughout sustained teamfights? Grab him Ezreal and those Mystic Shots chunk enemy health bars. Kindless will face his biggest test yet, as he faces off against some of the best marksmen on the planet. He’ll have his work cut out for him, but there’s few better ways to test your mettle than at the Mid-Season Invitational. Will he step up? We’re about to find out.</p>","es_AR":"<p><strong>Benjamín \"Kindless\" Fuenzalida</strong> es el nuevo miembro de la alineación de Isurus Gaming. Rindió frutos, ya que <strong>Kindless</strong> se convirtió rápidamente en uno de los mejores tiradores de la CLS. Puede cambiar su estilo para lidiar con las demandas de la batalla mientras inflige un daño consistente con cualquier campeón que utiliza. ¿Necesitas una iniciación a distancia? Utilizará al artista sanguinario Jhin. ¿Qué hay del daño consistente para peleas en equipo prolongadas? Usa a Ezreal y a esos Disparos Místicos para masacrar las barras de vida del enemigo. <strong>Kindless</strong> enfrentará su mayor reto al pelear contra los mejores tiradores del planeta. No le será sencillo, pero no hay mejor forma de demostrar la valía que en el Mid-Season Invitational. ¿Lo logrará? Vamos a averiguarlo.</p>","de_DE":"Benjamín „Kindless“ Fuenzalida Barrera ist das neueste Mitglied von Isurus Gaming. Und dieser Neuzugang erwies sich als äußerst ergiebig, denn Kindless wurde schnell zu einem der besten Schützen der CLS. Er kann seinen Stil ändern, um sich an die Anforderungen der Auswahl anzupassen und gleichzeitig mit jedem Champion, den er in die Finger bekommt, Schaden verursachen. Fehlt ein Initiator aus der Ferne? Dann spielt er den künstlerischen Mörder Jhin. Wie wäre es mit regelmäßigem Schaden in langanhaltenden Teamkämpfen? Überlass ihm Ezreal und er wird die Lebensbalken der Gegner mit „Mystischer Schuss“ bearbeiten. Kindless steht vor seiner größten Herausforderung, denn er bekommt es mit ein paar der besten Schützen des Planeten zu tun. Er wird alle Hände voll zu tun haben, aber es gibt kaum eine bessere Möglichkeit, um sein Können unter Beweis zu stellen, als das Mid-Season Invitational. Wird er sich in den Vordergrund spielen? Wir werden es bald herausfinden.","fr_FR":"Benjamín « Kindless » Fuenzalida Barrera est le dernier joueur à avoir rejoint la formation d'Isurus Gaming. Ce nouvel élément s'est révélé précieux, car Kindless est rapidement devenu l'un des meilleurs tireurs de la CLS. Capable de changer de style pour répondre aux contraintes de la sélection, il parvient toujours à infliger des dégâts constants, quel que soit le champion avec lequel il joue. Vous avez besoin d'engager le combat à distance ? Il prendra l'assassin virtuose, Jhin. Vous voulez infliger des dégâts constants dans des combats d'équipes prolongés ? Il prendra Ezreal pour saper la jauge de PV de l'ennemi avec des Tirs mystiques. Kindless se retrouve aujourd'hui face à son plus grand test, un défi qui l'opposera aux meilleurs tireurs de la planète. La tâche sera difficile, mais il existe peu de meilleures opportunités que le Mid-Season Invitational pour prouver son talent. Sera-t-il à la hauteur ? Nous sommes sur le point de le découvrir.","pl_PL":"Benjamín „Kindless” Fuenzalida Barrera to najnowszy nabytek w składzie Isurus Gaming. Ten nabytek okazał się strzałem w dziesiątkę, ponieważ Kindless szybko stał się jednym z najlepszych strzelców w CLS. Potrafi dostosować swój styl gry do wymogów wyboru, wciąż zadając konkretne obrażenia dowolnym bohaterem, który mu się trafi. Potrzeba inicjacji z dystansu? Wybierzcie dla niego artystycznego mordercę, Jhina. A co ze stałymi obrażeniami w ciągu długotrwałej walki drużynowej? Dajcie mu Ezreala, a Mistyczne Strzały nadszarpną zdrowie na paskach wrogów. Kindlessa czeka największa próba jak do tej pory, ponieważ zmierzy się z kilkoma najlepszymi strzelcami na świecie. Czeka go sporo roboty, ale trudno o lepszą próbę umiejętności niż Mid-Season Invitational. Czy da sobie radę? Niedługo się przekonamy.","es_ES":"Benjamín ''Kindless'' Fuenzalida Barrera es el fichaje más reciente de Isurus Gaming. Este fichaje ha dado sus frutos, pues Kindless se ha convertido rápidamente en uno de los mejores tiradores de la CLS. Es capaz de adaptar su estilo según las necesidades del equipo, al mismo tiempo que inflige daño constante con cualquier campeón con el que juegue. ¿Hace falta iniciar combates a distancia? Para eso está el artístico asesino Jhin. ¿Hace falta infligir daño constante en combates de equipo prolongados? Dadle a Ezreal y él se encargará de que sus Disparos místicos acaben con la barra de vida de los enemigos. A Kindless le toca superar su prueba más difícil hasta la fecha, pues tendrá que verse las caras con algunos de los mejores tiradores del planeta. No será una tarea fácil, pero existen pocos escenarios mejores para poner a prueba su destreza que el del Mid-Season Invitational. ¿Superará la prueba? Pronto lo descubriremos.","pt_BR":"<p>Benjamín \"Kindless\" Fuenzalida Barrera é o mais novo integrante da Isurus Gaming. Este acréscimo acabou sendo frutífero, pois Kindless rapidamente virou um dos melhores atiradores na CLS. Ele muda o estilo de jogo para se adaptar às demandas da composição das equipes ao mesmo tempo em que causa danos consistentes com o campeão que vier. Precisa de uma iniciação à distância? Pegue o assassino artista, Jhin. E que tal danos consistentes nos longos confrontos de equipe? Vá de Ezreal, que aqueles Disparos Místicos acabam com a barra de vida dos inimigos. Kindless vai enfrentar seu maior desafio até agora, pois vai competir com alguns dos melhores atiradores do mundo. Não vai ser uma tarefa fácil, mas há poucas maneiras melhores de testar sua coragem do que no Mid-Season Invitational. Será que ele vai ficar à altura? É o que vamos descobrir.</p>"},"foreignIds":{"TRLT3":"200000019"},"socialNetworks":{},"champions":[],"liveGameTeam":181},{"id":1491,"slug":"levi","name":"Levi","firstName":"Duy Khanh","lastName":"Do","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/levi-ck1xccz8.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-12-05T18:12:25.000Z","updatedAt":"2017-05-13T18:50:58.000Z","bios":{"en_US":"<p>Duy Khanh “Levi” Do is one of the most promising young talents in Southeast Asia. He began his career in 2015 as a mid laner for SkyRed, but later made the switch to jungling. While his role changed, his affinity for playing assassins in the mid lane still shapes his playstyle as a jungler. He dominated with Kha’Zix in several games at the 2016 International Wildcard All-Star Event, showing off the potential of the newly-reworked Voidreaver. Levi has settled easily into the current meta where carry junglers are the picks of choice. He excels at deleting the opposition with ease, whether that be a shotgun to the face as Graves or making mincemeat of a squishy on Rengar, he can do it all. Levi also played a key defensive role in the tense base race against the TCL All-Stars. If his past performance is any indication, we’re in for a wild ride in Brazil. Buckle up!</p>","de_DE":"Duy Khanh „Levi“ Do ist eines der größten jungen Talente in Südostasien. Levi startete seine Karriere im Jahr 2015 als Mid-Laner für SkyRed, wechselte aber später in den Dschungel. Obwohl er seine Rolle gewechselt hat, ändert sich nichts an seiner Vorliebe für Assassinen auf der mittleren Lane, die weiterhin seinen Stil im Dschungel beeinflusst. Beim IWCA 2016 dominierte er mit Kha’Zix mehrere Spiele und zeigte dabei das Potenzial des überarbeiteten Räubers der Leere. Levi gewöhnte sich schnell an das neue Metaspiel, in dem Carry-Jungler die erste Wahl sind. Er kann seine Gegner mit Leichtigkeit unschädlich machen, egal ob er ihnen mit Graves die Waffen an die Schläfe hält oder sie mit Rengar zu Hackfleisch verarbeitet. Außerdem spielte Levi eine entscheidende Rolle im knappen Wettrennen um die Basen gegen die TCL-All-Stars. Gemessen an seinen alten Vorstellungen dürfte uns in Brasilien eine wilde Reise bevorstehen. Wir sollten uns wohl besser anschnallen!","es_ES":"Duy Khanh ''Levi'' Do es uno de los jóvenes talentos más prometedores del sudeste asiático. Comenzó su trayectoria en 2015 como mid de SkyRed, pero más tarde se cambiaría a la posición de jungla. Aunque su rol cambió, su afinidad con los asesinos en mid dio forma a su estilo de juego en la jungla. Dominó con Kha'Zix en varias partidas del International Wildcard All-Star Event de 2016, demostrando el potencial del recién actualizado Saqueador del Vacío. Levi se ha adaptado fácilmente al metajuego actual, en el que los junglas carry son habituales. Tiene grandes dotes para machacar al oponente sin dificultad alguna, ya sea con un disparo a la cara con Graves o haciendo carne picada de los más débiles con Rengar. Él puede con todo. Levi también cumplió un papel defensivo clave en la tensa carrera hacia la base contra los All-Stars de TCL. Si sigue en sus trece, ya podemos prepararnos para otra tensa carrera en Brasil. ¡Abrochaos los cinturones!","es_AR":"<p><strong>Duy Khanh \"Levi\" Do</strong> es uno de los talentos jóvenes más prometedores del Sureste de Asia. Comenzó su carrera en 2015 como carrilero central en SkyRed, pero más tarde cambió a junglero. Aunque cambió su papel, su gusto por jugar con asesinos en el carril central sigue definiendo su estilo de juego como junglero. En el International Wildcard All-Star Event 2016 dominó con Kha'Zix en varias partidas, demostrando así el potencial del recientemente modificado Saqueador del Vacío. <strong>Levi</strong> se ha adaptado fácilmente al metajuego en el cual los jungleros acarreadores son la elección principal. Es experto en acabar con el enemigo fácilmente, ya sea con una escopeta en la cara como Graves o haciendo carne molida a un enemigo débil con Rengar. Él puede con todo. <strong>Levi</strong> también tuvo un papel defensivo clave en el <a href=\"https://youtu.be/d7AIGccpe2c?t=3509\" target=\"_blank\">tenso torneo</a> contra los All-Stars de TCL. Si su desempeño en el pasado se puede considerar como una señal, podemos esperar un buen espectáculo en Brasil. ¡Abróchense los cinturones!</p>","fr_FR":"Duy Khanh « Levi » Do est l'un des jeunes talents les plus prometteurs d'Asie du Sud-Est. Il a commencé sa carrière en 2015 en tant que midlaner pour SkyRed, avant de passer au rôle de jungler. Malgré ce changement, il adore jouer les assassins sur la voie du milieu et cette passion influence son style de jeu en tant que jungler. Il a dominé avec Kha’Zix dans plusieurs parties de l'événement All-Stars IWC 2016, montrant le potentiel du Faucheur du Néant suite à sa récente refonte. Levi s'est adapté facilement à la méta actuelle où les junglers carrys sont les choix privilégiés. Il sait se débarrasser de l'opposition comme personne, que ce soit à coups de fusil avec Graves ou en réduisant ses victimes en bouillie avec Rengar – il sait tout faire. Levi a également joué un rôle défensif clé dans la course tendue pour assiéger la base ennemie contre les All-Stars des TCL. Étant donné ses performances passées, le spectacle devrait valoir le détour au Brésil. Accrochez vos ceintures !","pl_PL":"Duy Khanh „Levi” Do jest jednym z najbardziej obiecujących młodych talentów z Azji Południowowschodniej. Rozpoczął karierę jako środkowy w SkyRed w 2015 r., ale później przeszedł na dżunglowanie. Chociaż jego rola się zmieniła, nawyk grania zabójcami na środkowej alei wciąż ma wpływ na jego styl gry na pozycji dżunglera. Dominował, grając Kha’Zixem w kilku grach podczas wydarzenia International Wildcard All-Star 2016, pokazując potencjał dopiero co odświeżonego Łowcy Pustki. Levi łatwo dopasował się do aktualnego stanu gry, zgodnie z którym najchętniej wybiera prowadzących dżunglerów. Szybko i bez wysiłku kasuje przeciwników, czy to strzelając im w twarz jako Graves, czy robiąc z nich mielonkę jako Rengar. Potrafi wszystko. Levi odegrał także kluczową rolę defensywną w zaciętym wyścigu do bazy przeciwko All-Stars z TCL. Jego wcześniejsze występy pokazują, że w Brazylii czeka nas szalona jazda. Zapnijcie pasy!","es_MX":"Duy Khanh ''Levi'' Do es uno de los jóvenes talentos más prometedores del Sudeste Asiático. Este chico de 19 años comenzó su trayectoria el año pasado como central de SkyRed, pero más tarde se cambiaría a la posición de la jungla. Aunque su rol cambió, su afinidad con los asesinos centrales dio forma a su estilo de juego en la jungla. Dominó con Kha'Zix en varias partidas en el International Wildcard All-Star Event 2016, demostrando el potencial del recién actualizado Saqueador del Vacío. Levi también cumplió un papel defensivo clave en <a href=\"https://www.youtube.com/watch?v=Xje30TIdRPE&feature=youtu.be&t=1h4m54s\">tensa carrera hacia la base </a> contra los All-Stars de TCL. Si esas actuaciones quieren decir algo, está claro que habrá caos en Barcelona.","el_GR":"","en_PL":"","cs_CZ":"","pt_BR":"<p>Duy Khanh \"Levi” Do é um dos talentos mais jovens e promissores do sudeste asiático. Ele começou sua carreira em 2015 como jogador da rota do meio para a SkyRed, mas acabou mudando para a Selva. Embora tenha mudado de função, sua afinidade com os assassinos da rota do meio ainda definem seu estilo de jogo como Caçador. Durante o International Wildcard All-Star 2016, ele dominou diversas partidas com seu Kha’Zix, mostrando todo o potencial do reformulado Ceifador do Vazio. Levi se encaixou fácil na meta atual, em que os caçadores da selva são a bola da vez. Ele é capaz de eliminar a oposição com facilidade, seja com uma arma na cara como Graves ou fazendo picadinho como Rengar. Ele faz de tudo. Levi também teve um papel defensivo fundamental na corrida pela base inimiga contra a TCL All-Stars. Apertem os cintos!</p>"},"foreignIds":{"TRLH3":"1001360037","TRLH4":"1001310037","TRLT3":"200000048","TRLH1":"200000443","TRLH2":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1885,"slug":"sergh","name":"Sergh","firstName":"Nam Loc","lastName":"Lieu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sergh-7st1or6f.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:39:00.000Z","updatedAt":"2017-05-09T19:16:02.000Z","bios":{},"foreignIds":{"TRLT3":"200000052","TRLH1":"200000447"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1886,"slug":"slay","name":"Slay","firstName":"Ngoc Hung","lastName":"Nguyen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/slay-ctubpw87.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:43:39.000Z","updatedAt":"2017-05-13T18:49:40.000Z","bios":{"en_US":"<p>Ngoc Hung \"Slay\" Nguyen started his career in 2014 as a part of G5 E-Sport Fate Team. He eventually helped the Saigon Jokers to a Vietnam Championship Series A victory in 2016 before jumping on the opportunity to becomes GIGABYTE Marines’ starting AD Carry in December of 2016. Since then, he’s helped the team tear through the competition on their way the 2017 Mid-Season Invitational. He’ll have to prove that he’s got what it takes to gunsling with the best as he hits the international stage for the first time in his career in Brazil.</p>","pl_PL":"Ngoc Hung „Slay” Nguyen zaczął karierę w 2014 roku jako część G5 E-Sport Fate Team. Ostatecznie pomógł Saigon Jokers zdobyć zwycięstwo w Vietnam Championship Series A w 2016 roku, a potem skorzystał z okazji, by stać się prowadzącym w pierwszym składzie Marines Esports, w grudniu 2016 roku. Od tamtego czasu pomagał drużynie przebijać się przez konkurencję w drodze do Mid-Season Invitational 2017. Będzie musiał dowieść, że jest w stanie pojedynkować się z najlepszymi, gdy po raz pierwszy w swojej karierze wkroczy na międzynarodową arenę w Brazylii.","fr_FR":"Ngoc Hung « Slay » Nguyen a commencé sa carrière en 2015 au sein de G5 E-Sport Fate Team. Il a ensuite contribué à la victoire des Saigon Jokers dans les Vietnam Championship Series A en 2016 avant de sauter sur l'occasion de devenir le carry AD titulaire de Marines Esports en décembre 2016. Depuis, il a aidé l'équipe à pulvériser la concurrence sur la route du Mid-Season Invitational 2017. Lorsqu'il montera sur la scène internationale pour la première fois de sa carrière au Brésil, il devra prouver qu'il est au niveau des meilleurs.","es_ES":"Ngoc Hung ''Slay'' Nguyen comenzó su trayectoria en 2014 como parte de G5 E-Sport Fate Team. Poco después, ayudó a que Saigon Jokers ganase la Championship Series A en 2016, y no tardaría en surgirle la oportunidad de ocupar el puesto de ADC titular de Marine Esports en diciembre de 2016. Desde entonces, ha ayudado a que su equipo se abra paso en la competición hasta llegar al Mid-Season Invitational 2017. Tendrá que demostrar que tiene lo que hace falta para medirse ante los mejores en su primera aparición en el escenario internacional en Brasil.","de_DE":"Ngoc Hung „Slay“ Nguyen begann seine Karriere 2014 bei G5 E-Sport Fate Team. 2016 verhalf er Saigon Jokers zum Titel in der vietnamesischen Championship Series, bevor er im Dezember 2016 die Gelegenheit ergriff, zu Marines Esports zu wechseln. Seither half er der Mannschaft dabei, die Konkurrenz aus dem Weg zu räumen und sich für das Mid-Season Invitational 2017 zu qualifizieren. Wenn er in Brasilien zum ersten Mal in seiner Karriere die internationale Bühne betritt, wird er beweisen müssen, dass er es mit den Besten der Welt aufnehmen kann.","es_AR":"<p><strong>Minh Nhut \"Archie\" Tran</strong> es el genio detrás de los Marines Esports. Siendo tirador en el pasado con los Saigon Jokers, <strong>Archie</strong> se volvió conocido por su refinado estilo con Ezreal. No contento con ser tirador, también probó suerte en el carril superior. Como uno de los pocos jugadores que ha jugado a nivel profesional en tres posiciones distintas, <strong>Archie</strong> ha acumulado una gran cantidad de conocimiento acerca del juego. <strong>Archie</strong> logra un gran equilibrio cuando funge como mente maestra al crear jugadas desde su posición de soporte. Si bien <strong>Optimus</strong> y <strong>Levi</strong> se llevan todos los reflectores, <strong>Archie</strong> mueve los hilos silenciosamente desde atrás para llevar a los Marines a la gloria. Espera poder orquestar más victorias en su camino hacia Brasil para su primer enfrentamiento contra competidores de talla internacional.</p>","pt_BR":"<p>Ngoc Hung \"Slay\" Nguyen começou sua carreira em 2014 como parte da G5 E-Sport Fate Team. Por fim, ele ajudou a Saigon Jokers a vencer o Temporada de Primavera do Campeonato de Série A do Vietnã antes de embarcar na oportunidade de se tornar Carregador dos Marines Esports em dezembro de 2016. Desde então, ele ajudou sua equipe a atropelar a competição rumo ao Mid-Season Invitational 2017. Ele terá de provar que é capaz de disputar com os melhores no cenário internacional pela primeira vez na carreira.</p>"},"foreignIds":{"TRLT3":"200000050","TRLH1":"200000445","TRLH2":"200000345"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":1887,"slug":"stark","name":"Stark","firstName":"Cong Minh","lastName":"Phan","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stark-9hy5qaf.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T19:45:11.000Z","updatedAt":"2017-05-13T18:52:38.000Z","bios":{"en_US":"<p>Cong Minh \"Stark\" Phan is extremely new to the Rift. The 19-year-old started his professional career just a couple of months ago when he joined up with Vietnam’s best team, the GIGABYTE Marines. He was noticed by the team due to his exceptional performance on the Vietnamese solo queue ladder. Even though he’s the team’s newest addition, he’s fit in just fine with their high octane style, excelling on top lane bullies like Renekton and Rumble. Look for Stark to make a name for himself as he and the Marines fight to put their region on the map at the 2017 Mid-Season Invitational.</p>","de_DE":"Cong Minh „Stark“ Phan ist ein absoluter Neuling in der Kluft. Der 19-jährige begann seine professionelle Karriere erst vor ein paar Monaten, als er bei der besten Mannschaft Vietnams, Marines Esports, anheuerte. Die Mannschaft wurde aufgrund seiner herausragenden Leistung in der vietnamesischen Solo-Warteschlange auf ihn aufmerksam. Obwohl er das neueste Mitglied der Mannschaft ist, passt er perfekt zum kraftvollen Stil seiner Kameraden und liefert auf der oberen Lane überragende Leistungen mit Champions wie Renekton und Rumble ab. Stark will sich einen Namen machen und wird zusammen mit den Marines versuchen, beim Mid-Season Invitational 2017 Eindruck zu hinterlassen.","es_ES":"Cong Minh ''Stark'' Phan es todo un principiante en la Grieta. Este jugador de 19 años comenzó su carrera profesional hace tan solo un par de meses, cuando fue fichado por el mejor equipo de Vietnam, Marines Esports. El equipo se percató de su potencial tras observar su excepcional actuación en la cola en solitario vietnamita. Aunque es el fichaje más reciente del equipo, encaja perfectamente con su estilo acelerado, y destaca con los matones de la calle superior como Renekton y Rumble. Que a nadie le extrañe que Stark se haga valer cuando él y los Marines luchen por poner a su región en el mapa durante el Mid-Season Invitational 2017.","fr_FR":"Cong Minh « Stark » Phan est un nouveau venu dans la Faille. Le joueur de 19 ans a commencé sa carrière professionnelle il y a à peine deux mois lorsqu'il a rejoint la meilleure équipe vietnamienne, Marines Esports. Il a été repéré par l'équipe grâce à sa performance exceptionnelle dans le classement de la file solo du Vietnam. Même s'il est le petit dernier de l'équipe, il correspond parfaitement à son style explosif, excellant sur la voie du haut avec des brutes comme Renekton et Rumble. Stark cherchera sans doute à se faire un nom avec les Marines en tentant de marquer l'histoire au Mid-Season Invitational 2017.","pl_PL":"Cong Minh „Stark” Phan jest naprawdę nowy na Summoner’s Rift. Ten 19-latek rozpoczął swoją profesjonalną karierę dopiero kilka miesięcy temu, gdy dołączył do najlepszej drużyny Wietnamu, Marines Esports. Został zauważony przez drużynę dzięki swojej wyjątkowej grze na wietnamskiej drabince kolejki solo. Chociaż jest najnowszym uzupełnieniem drużyny, doskonale dopasował się do jej żywiołowego stylu. Najlepiej gra górnymi osiłkami, takimi jak Renekton i Rumble. Spodziewajcie się, że Stark zdobędzie rozgłos dla siebie, gdy razem z Marines będzie walczył na Mid-Season Invitational 2017 o zaznaczenie swojego regionu na mapie.","es_AR":"<p><strong>Cong Minh \"Stark\" Phan</strong> es muy muy nuevo en la Grieta. Este chico de 19 años comenzó su carrera profesional hace un par de meses cuando se unió al mejor equipo de Vietnam, los Marines Esports. El equipo lo notó gracias a su desempeño excepcional en la cola individual de Vietnam. Aunque es el agregado más reciente al equipo, se ha acoplado más que bien con el estilo de alto octanaje y es experto en el carril superior con matones como Renekton y Rumble. No le quites el ojo a <strong>Stark</strong> mientras busca ganarse un lugar cuando él y los Marines peleen para poner a su región en el mapa en el Mid-Season Invitational 2017.</p>","pt_BR":"<p>Cong Minh \"Stark\" Phan é um recém-chegado no Rift. O jovem de 19 anos iniciou sua carreira profissional há poucos meses, quando entrou para a melhor equipe do Vietnã, a Marines. Ele foi visto pela equipe devido ao seu excepcional desempenho na classificação solo do Vietnã. Apesar de ser o integrante mais recente da equipe, ele se encaixou muito bem com seu estilo agressivo, demonstrando excelência com brutamontes da rota superior como Renekton e Rumble. Vejamos se Stark coloca o seu nome no mapa ao mesmo tempo em que os Marines lutam para dar destaque à sua região no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000047","TRLH1":"200000442","TRLH2":"200000342"},"socialNetworks":{},"champions":[],"liveGameTeam":318},{"id":2018,"slug":"aioros","name":"Aioros","firstName":"Bruno","lastName":"Romero","roleSlug":"support","photoUrl":null,"hometown":null,"region":"Copa Latinoamérica Sur","birthdate":null,"createdAt":"2017-06-19T14:30:47.000Z","updatedAt":"2017-06-19T14:30:47.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":181},{"id":2020,"slug":"ankor","name":"Ankor","firstName":"Gabriel","lastName":"Toro","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"Copa Latinoamérica Sur","birthdate":null,"createdAt":"2017-06-19T16:02:49.000Z","updatedAt":"2017-06-19T16:02:49.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":181}],"scheduleItems":[{"id":"AVuhncYAQMQFcjhwbQy2","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:73aa5903-02bc-451d-87fc-05a3343a2a38","scheduledTime":"2017-05-01T20:00:00.086+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"4","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:c71dc70f-b5df-41c5-83e1-2ba4d29a1759","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"73aa5903-02bc-451d-87fc-05a3343a2a38","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"c71dc70f-b5df-41c5-83e1-2ba4d29a1759","league":"10"}],"gameIdMappings":[{"id":"6f70a968-d722-4fe7-aeed-f2d05395a7e4","gameHash":"dca72b76bb504ccf"}],"videos":[{"id":6754,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:6f70a968-d722-4fe7-aeed-f2d05395a7e4","source":"https://www.youtube.com/embed/MsVs_Haz_s0","createdAt":"2017-05-01T20:51:49.000Z","updatedAt":"2017-05-01T20:51:49.000Z","game":"6f70a968-d722-4fe7-aeed-f2d05395a7e4"},{"id":6755,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:6f70a968-d722-4fe7-aeed-f2d05395a7e4","source":"https://www.youtube.com/watch?v=zunMXESTbvI&wmode=transparent","createdAt":"2017-05-01T21:00:16.000Z","updatedAt":"2017-05-01T21:00:16.000Z","game":"6f70a968-d722-4fe7-aeed-f2d05395a7e4"},{"id":6764,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:6f70a968-d722-4fe7-aeed-f2d05395a7e4","source":"https://www.youtube.com/embed/VI27oOmc0s0?wmode=transparent","createdAt":"2017-05-02T00:40:23.000Z","updatedAt":"2017-05-02T00:40:23.000Z","game":"6f70a968-d722-4fe7-aeed-f2d05395a7e4"},{"id":6947,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:6f70a968-d722-4fe7-aeed-f2d05395a7e4","source":"https://www.youtube.com/embed/TjtjVomjpAs","createdAt":"2017-05-29T03:35:55.000Z","updatedAt":"2017-05-29T03:35:55.000Z","game":"6f70a968-d722-4fe7-aeed-f2d05395a7e4"}],"htmlBlocks":[],"match":{"id":"73aa5903-02bc-451d-87fc-05a3343a2a38","name":"ISG-vs-GAM","position":1,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"},{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],"games":{"6f70a968-d722-4fe7-aeed-f2d05395a7e4":{"id":"6f70a968-d722-4fe7-aeed-f2d05395a7e4","name":"G1","generatedName":"GAM|ISG|G1|73aa590302bc451d87f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"},{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1496029187345,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493672609791,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493672129029,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493671743688,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"130267","gameRealm":"TRLT3","platformId":"TRLT3:130267","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1496029187345,"source":"bestOf","history":[{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493672609791,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493672129030,"source":"bestOf","closed":true},{"result":[[{"roster":"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493671743688,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"c4ca48c9-da6f-47e5-9482-0de31fa4a0fe":1,"6b377edd-527d-4e1f-897c-1cafe2373a5c":0}}}