{"teams":[{"id":16,"slug":"gambit-gaming","name":"Gambit Gaming","guid":"be6c87e3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/gambit-gaming-7vpa8jy6.png","acronym":"GMB","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-05-12T23:34:46.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"69"},"players":[78,79,80,84,200,218,321,328,339,818],"starters":[78,80,84,200,321],"subs":[79,218,328,339,818]},{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]}],"players":[{"id":78,"slug":"diamondprox","name":"Diamondprox","firstName":"Danil","lastName":"Reshetnikov","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/diamondprox-gx80qbxc.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-06-15T22:40:21.000Z","bios":{"en_US":"<p>Danil “Diamondprox” Reshetnikov was one of the most innovative junglers in the world during Season 2. Diamondprox’s overwhelming map control kickstarted an aggressive counter-jungling strategy that continues to influence the League of Legends meta even now. </p>\n\n<p>Despite struggling to make an impact in the 2014 and 2015 EU LCS, Diamondprox was still regarded as one of the best junglers in Europe. The Unicorns of Love took Diamondprox in during the 2015 offseason, betting that his prior experience would be a boon for their revamped squad. Now, Apex Pride are hoping he can help them earn a spot in the NA LCS.</p>","fr_FR":"<p>Comme dans tout sport, il y a dans League of Legends des joueurs qui ont marqué leur époque, et le Russe Danil « Diamondprox » Reshetnikov est de ceux-là. Il se fait repérer alors qu’il n’est que platine, rejoint l’équipe Empire (qui deviendra Moscow Five) et domine très vite la scène européenne, allant jusqu’à impressionner à l’international. Diamondprox se démarque par sa capacité d’adaptation et son inventivité. Nombre d’observateurs estiment que c’est lui qui a inventé la tactique du counter-jungle, pratique à laquelle il s’adonne particulièrement bien avec Shyvana. Moscow Five est alors connue pour ses excellents résultats lors des compétitions majeurs et principalement lors des différentes éditions des Intel Extreme Masters.</p>\n\n<p>M5 et Diamondprox confirment leur supériorité sur la scène européenne en remportant les finales régionales, ce qui les qualifie d’office pour le mondial 2012. Considérés comme favoris, les M5 surprennent en s’inclinant en demi-finale face aux futurs champions du monde, les Taipei Assassins. Après quelques autres contre-performances, Diamondprox et ses coéquipiers (qui jouent désormais pour Gambit Gaming) réussissent à vaincre les équipes coréennes Azubu Frost et Azubu Blaze aux IEM Katowice 2013, avec un Diamondprox sur Xin Zhao pendant la majorité du temps.</p>\n\n<p>Dès la première occurrence, les M5 prennent part aux League of Legends Championship Series. Diamondprox participe énormément au succès de l’équipe et dicte la méta. Il est le pionnier du Nasus jungle, se démarque par son utilisation de Volibear, marque les esprits avec ses variantes d’Evelynn et va même jusqu’à invoquer Karma. Son équipe n’est plus maîtresse de la région mais obtient la 2e place de la saison de printemps et la 3e de la saison d’été, guidée par son agressivité réfléchie.</p>\n\n<p>Avec le temps, les départs successifs de ses coéquipiers et les problèmes logistiques inhérents à la structure pour laquelle il joue, les résultats de Diamondprox se sont dégradés. Celui qui a été plébiscité par la communauté lors des deux premières éditions des All-Stars n’arrive plus à mener son équipe vers la victoire, bien qu’il reste l’un des meilleurs junglers européens. Après être passé à deux doigts de la relégation en 2015 et alors que Gambit a vendu sa place en LCS, Diamondprox cherche à donner un second souffle à sa carrière en rejoignant Unicorns of Love et compte bien prouver qu’une légende ne meurt jamais.</p>\n","pl_PL":"<p>Gwiazda League of Legends od wczesnego drugiego sezonu. Złośliwi wytykają, że czerwona, bo pochodzi z Rosji. Nie zmienia to faktu, że to jeden z graczy, którzy wywarli największy wpływ na zmianę mety w grze. Danil Reshetnikov zaistniał w drużynie Team Empire, która zaskoczyła inne popularne zespoły absolutnie nietypowymi zagraniami. Później ten sam skład zawodników był znany jako Moscow Five, a następnie Gambit Gaming. Cała rosyjska ekipa była znana z innowacyjnych wyborów i zagrań, jednak król nowości wśród nich to właśnie \"Diamondprox\". Można śmiało powiedzieć, że zrewolucjonizował grę w jungli wielokrotnie podczas istnienia sceny esportowej. Brakiem obaw przed porażką i ośmieszeniem otworzył drzwi dla wielu nowych postaci na tej pozycji, zainicjował między innymi wybór Karmy, Mundo i Nasusa. Oprócz zaskakującej selekcji bohaterów, zdumiewał również swoim stylem gry – na przykład sztuką kontrowania przeciwników w ich własnej jungli. Jednak wielbiciele i społeczeństwo najlepiej znają Danila z niezwykłych zagrań Lee Sinem i Evelynn.</p>\n<p>\n\"Diamondprox\" od wczesnego drugiego sezonu uczestniczył w życiu esportowym League of Legends. Można by długo wymieniać turnieje, które wygrał i te, w których znalazł się na podium, lecz najważniejszymi dokonaniami były jego występy na Mistrzostwach Świata i turniejach IEM. W wydarzeniu o najwyższej randze na scenie League of Legends wziął udział dwukrotnie – w drugim i trzecim sezonie. Za pierwszym razem zespół Moscow Five było jednym z faworytów – uległ w półfinale w walce z Taipei Assasins. Miarę tego osiągnięcia, można mierzyć w powszechnej opinii po tej imprezie, że z zachodnich drużyn tylko ta rosyjska może się mierzyć z Azjatami. Na Mistrzostwach Świata 2013 poszło jej gorzej, ponieważ Danil wraz z kolegami dotarli tylko to ćwierćfinałów. Co i tak było niesamowitym osiągnięciem jak na europejską ekipę. Zdecydowanie lepszy owoc zebrali na wydarzeniach IEM - \"Diamondprox\" dwukrotnie był półfinalistą i raz zwycięzcą podczas Mistrzostw Świata IEM. Ponadto czterokrotnie wygrali etapy kwalifikacyjne, podczas których dominowali tak doświadczonych przeciwników jak: Team SoloMid, Fnatic i Counter Logic Gaming. Przed wiosennym sezonem EU LCS 2016 pożegnał się z pozostałościami po legendarnej rosyjskiej drużynie i w poszukiwaniu swojego miejsca dołączył do Unicorns of Love.\nDanil to jeden z bardzo małego grona graczy, które znalazło swoją drugą połówkę i się ożeniło. Podobnie jak jego kolega z drużyny, „Alex Ich”, trafił na swoją sympatię, kiedy profesjonalnie grał w League of Legends. \"Diamondprox\" spotkał „Rogue” w solo que po przeciwnej stronie barykady i w tym starciu Darina została upokorzona przez jego grę Skarnerem. W związku z czym padło parę ostrych słów między nimi. Dlatego „Rogue” zauważyła, że w kolejnej grze jej rywalem znowu jest Danil. Tym razem pogratulował swojej konkurentce dobrej gry, a po meczu zaczęli ze sobą rozmawiać. Od słów do czynów, wkrótce potem zaczęli się ze sobą spotykać – jak widać miłość potrafi znaleźć ujście w najbardziej nieoczekiwanych momentach i miejscach. \n</p>","es_ES":"<p>La eterna leyenda rusa toma un nuevo rumbo. Por primera vez en su carrera profesional desde Octubre de 2011, Danil ‘Diamondprox’ Reshetnikov opta por cambiar de aires. El jugador proveniente de World of Warcraft que enamoró a todo el mundo en Team Empire, Moscow Five y Gambit Gaming decide por primera vez dejar la infraestructura que tantos éxitos le ha otorgado en el pasado para intentar solucionar un final de carrera con un declive pasivo.</p>\n\n<p>Diamondprox empezó en 2011 a jugar para Team Empire gracias a la invitación de su amigo y apoyo del equipo Edward ‘Gosu Pepper’ Abgaryan. Tan sólo dos meses durarían ambos bajo el nombre de Team Empire, puesto que en Diciembre de ese mismo año la plantilla sería fichada por Moscow Five y un mes más tarde ya estarían dando la sorpresa en la IEM Season VI – Global Challenge Kiev que ganarían ante los grandes equipos de Europa y Norteamérica. Con campeones como Shyvana y Lee Sin el joven ruso sacaba a la palestra un estilo agresivo de invasión hacia la jungla enemiga que chocó mucho a los jungla de apoyo de aquella época. Grandes jugadores de la historia de League of Legends han elogiado al jungla por su innovación y agresividad.</p>\n\n<p>En Marzo de 2012, Diamondprox volvería a la senda de la innovación adaptada a su estilo de juego en la IEM Season VI – World Championship disputada en Hannover. La aparición estelar de Nocturne con presencia global en el mapa permitió sorprender a sus rivales. Aunque la mayor alegría llegaría a los amantes de Udyr a causa de la aparición en el último partido de la final ante Dignitas como respuesta a la propia Shyvana que él mismo había popularizado.</p>\n\n<p>En ese mismo año llegaron los mejores momentos de Diamond como en la Dreamhack Summer 2012 o las finales regionales de la segunda temporada en Colonia. Aquel Moscow Five que estuvo a punto de llegar a la final del Campeonato Mundial 2012 en el que sólo perdió ante el vencedor Taipei Assasins. Este momento supuso la cúspide en la carrera del jugador que a partir de entonces no ha conseguido éxitos del mismo calibre. Todavía se recuerda esa arrasadora primera partida que disputó con Xin Zhao.</p>\n\n<p>Después del último gran torneo jugado como Moscow Five en la IPL5 debido al arresto del CEO del equipo, Diamondprox sólo consiguió mantener su estatus debido a grandes actuaciones las Intel Extreme Masters como la victoria en 2013 en Katowice ante Azubu Frost. El formato de liga regular de la League Championship Series no favoreció al jugador debido al distanciamiento de la organización de la sede en Colonia con problemas de visado, y poco a poco su nivel fue bajando hasta la actualidad. En el año 2013 fue votado para representar a Europa en el All Stars y en el Campeonato Mundial de 2013 se clasificaría para cuartos de final.</p>\n\n<p>Tanto 2014 como 2015 fueron años aciagos para el jungla. El primer año todavía mantuvo su caché a pesar de los malos resultados del equipo con buenas actuaciones mediante el uso de junglas agresivos, pero ya no volverían a clasificarse a un Campeonato Mundial y en los últimos tiempos el jugador sólo conserva detalles de calidad.</p>\n\n<p>En Unicorns of Love podría renacer. Su carácter innovador encaja perfectamente con el equipo, y supone un reto motivacional nuevo para el ruso. A pesar de ser introvertido, su privilegiada mente podría otorgar una mejora en la toma de decisiones, faceta de la que siempre ha carecido el equipo.</p>","de_DE":"<p>Wenn man eSports-Fans nach dem einen Jungler fragt, wird sicherlich aus vieler Munde der Name „Diamond“ ertönen. Nicht viele Europäer haben sich einen solchen, vor allem auch international anerkannten Ruf erspielen können. Er ist anpassungsfähig, erfahren, Shotcaller und einer der größten Innovatoren seiner Position. Während er mit Lee Sin noch einen recht vertrauten Pick schon sehr früh an den Tag gebracht hat, wurde es schnell außergewöhnlicher. So hat er vor allem in der dritten Saison viele Trends im Jungle geschaffen. Evelynn, Nasus und nicht zu vergessen seine Karma waren noch nicht einmal alle Champions, die er allein in dieser Zeit erfolgreich in die Kluft brachte. </p>\n<h2><p>Der große Aufstieg</p></h2>\n<p>Bekannt wurde Danil \"Diamondprox\" Reshetnikov, nachdem sein damaliger Kader von Team Empire Ende 2011 von Moscow Five aufgekauft wurde. Während die Russen anfangs noch nicht sonderlich bekannt waren, änderte sich dies schon zwei Monate später schlagartig. Bei der IEM Season VI in Kiew setzte sich das Team gegen eine Armee von großen Namen durch, unter ihnen auch Zweitplatzierter der vorigen Weltmeisterschaft against All authority und TSM, den schon damaligen Favoriten der Amerikaner. Mit nur einem verlorenen Spiel während des gesamten Turniers war sehr schnell klar, dass es diese Spieler drauf haben. </p>\n<p>Die gesamte zweite Saison sollte sich ein Trend fortsetzen, der aus einem emporkommenden Team mit guten Spielern schon fast so etwas wie Legenden machte. Zusammen mit seinem Teamkollegen Alexey \"Alex Ich\" Ichetovkin hat er die gegnerischen Lanes in ein regelrechtes Chaos versetzt, um sichere Siege einzuholen. Das hat M5 nicht nur weitere Turniersiege eingebracht, sondern letztendlich zu einem Top 4 Erfolg auf der zweiten Weltmeisterschaft geführt. </p>\n<h2><p>Sein Weg mit Gambit</p></h2>\n<p>Nachdem der CEO von Moscow Five Anfang 2013 verhaftet wurde, stand das erfolgreiche Team zum Verkauf bereit. Der glückliche Käufer: Gambit Gaming. Unter neuem Namen ging es gleich da weiter, wo man zuvor aufhörte: Wer sich an die IEM Season VII in Katowice erinnert, hat sicherlich noch Gambits dortige Erfolgsgeschichte vor Augen. Nach einem knappen Sprung aus der Gruppenphase gelang es dem Team nicht nur eins, sondern gleich zwei Aufeinandertreffen gegen die damals stärksten koreanischen Teams ohne Niederlage zu gewinnen. Spätestens ab diesem Zeitpunkt wurde Diamondprox auch von vielen Koreanern als einer der besten Jungler anerkannt. Er wurde Vorbild für viele später auch erfolgreiche professionelle Jungler. </p>\n<p>Die LCS veränderte dann so einiges, während die Konkurrenz anfangs noch vergleichsweise schwach war, wurde diese über die Jahre immer stärker. Das einst so undenkbar trennbare Team verlor nach und nach seine Spieler, bis zum Schluss nur noch Diamondprox und Edward „Edward“ Abgaryan übrig blieben. Das Ende vom ursprünglichen Gambit war gekommen. </p>\n<p> „Es waren vier teuflische Jahre, Jungs“, Worte, die sich Diamond am Anfang seiner Karriere in League of Legends wohl kaum zu träumen gewagt hätte. Und doch – nach vier Jahren Achterbahnfahrt der Gefühle, kann er stolz von seinen Jahren mit den vier russischen Kumpanen reden. Ein Kapitel seines Lebens, das mit dem Austritt aus Gambit Gaming nun geschlossen wurde. </p>\n<h2><p>Das diamantene Einhorn</p></h2>\n<p>Wenn sich ein Kapitel schließt, öffnet sich ein anderes. Das richtige Team ist jedenfalls gefunden. Die Unicorns Of Love sind dafür bekannt, ungewöhnliche Champions auszupacken, da passt der neue Jungler perfekt hinein, um die Gegner noch weiter in die Irre zu führen. Er selbst erhofft sich nicht nur als Person, sondern sich auch als Anführer weiter zu verbessern, wie er in einem Interview bekannt gab. In jedem Fall wird er sein Bestes geben, um nicht nur sein Team, sondern auch den vielen treuen Fans zu zeigen, was ein Diamondprox alles so drauf hat. </p>\n"},"foreignIds":{"drupalId":"88","TRLH3":"1001220067","TRLH4":"1001190117","TRLH1":"1001300002","FRA1TMNT1":"445028"},"socialNetworks":{"twitch":"http://www.twitch.tv/tehdiamondz","facebook":"www.facebook.com/GambitDiamondprox","twitter":"http://twitter.com/tehDiamondz"},"champions":[],"liveGameTeam":16},{"id":79,"slug":"genja","name":"Genja","firstName":"Evgeny","lastName":"Andryushin","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/genja-7ryw4cgi.png","hometown":"Russia","region":null,"birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-01-07T10:54:45.000Z","bios":{"en_US":"Evgeny \"Genja007\" Andryushin is currently a substitute AD carry for Gambit Gaming. Known as a prolific experimenter in the bot lane, he has run AD Kennen, 1v2 Urgot, Manamune Ashe, and he was the progenitor of Trinity Force Kog’Maw. While unorthodox, his builds and champion picks have generally netted positive results. However, a string of disappointing performances in the 2014 EU LCS left Genja on the GMB bench. Only time will tell if the madman of GMB will have a chance to return to his crazy champion picks."},"foreignIds":{"drupalId":"90","TRLH3":"1001000090","TRLH4":"1001000090"},"socialNetworks":{},"champions":[],"liveGameTeam":16},{"id":80,"slug":"gosu-pepper","name":"Edward","firstName":"Eduard","lastName":"Abgaryan","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/gosu-pepper-fkra03q8.png","hometown":"Russia","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-01-28T22:47:35.000Z","bios":{"en_US":"<p>Eduard “Edward” Abgaryan (formerly Gosu Pepper, who was formerly Edward, who was formerly, uh...Gosu Pepper...)  has played in both the EU and NA LCS. However, Eduard's impact (and reputation) is based on his time in Europe with Gambit Gaming (formerly Moscow Five). Gambit terrorized the early years of League of Legends esports, challenging even the best teams that Korea had to offer. Over the years GMB’s success in the EU LCS became more and more rare as their original roster evaporated.</p>\n\n<p>Eduard took his support mechanics to a new organization in 2016, signing for ROCCAT. The squad will be relying on Edward's communication skills and historical knowledge of the game, especially with their new (and largely untested) AD carry, Mohammad\" Safir\" Tokhi.</p>","pl_PL":"<p>Gosu Pepper to niesamowicie doświadczony gracz, który jest już żywą legendą profesjonalnej sceny. Na najwyższym poziomie występuje od października 2011 roku, kiedy to związał się z rosyjskim Teamem Empire. To tam spotkał Alexeia „Alex Icha” Ichetovkina, Eugene’a „Genję” Andryushina, Daniela „Diamondproxa” Reshetnikova i Eugene’a „Dariena” Mazaeva, z którymi stworzył później jeden z najsłynniejszych zespołów w historii League of Legends. Skład dość szybko opuścił Empire i związał się z organizacją Moscow 5.</p>\n<p>\nWraz z M5 Gosu Pepper zdominował europejską scenę, wygrywając przystanek IEM w Kijowie, finał IEM, European Challenger Circuit, regionalne finały sezonu 2 i zajmując szereg drugich miejsc. Dzięki temu awansował na Mistrzostwa Świata sezonu 2, gdzie jego zespół uchodził za jednego z faworytów zmagań, lecz ostatecznie poległ w półfinale. W tym czasie armeński wspierający wybierał najczęściej Zyrę, Nunu oraz Sonę i prezentował bardzo agresywny styl gry, dzięki czemu kibice zaczęli nazywać go „kerującym supportem”.</p>\n<p>\nPo tym bardzo udanych okresie, Gosu Pepper i spółka postanowili zmienić otoczenie i z Moscow5 przenieśli się do organizacji Gambit Gaming. W tym czasie support zmienił nick, zamieniając „Gosu Pepper” na „Edward” – nowy pseudonim był po prostu imieniem zawodnika. Przełomowe dla poczynań armeńskiego gracza okazało się wprowadzenie do gry nowej postaci – Thresha, z którym Edward był utożsamiany przez większość swojej kariery, a dzięki doskonałej grze tym bohaterem zyskał przydomek „Thresha księcia Armienii”. Support osiągał kolejne sukcesy z Gambitem, zwyciężając w turnieju IEM w Katowicach oraz zajmując drugie miejsce w wiosennym splicie EU LCS. W zespole pojawiły się jednak problemy wewnętrzne i Edward zdecydował się odejść z zespołu i dołączyć do występującego w NA LCS Teamu Curse. Armeńczyk stał się tym samym pierwszym graczem w historii, który zmienił region, zapoczątkowując prawdziwą rewolucję w tym względzie.</p>\n<p>\nUtytułowany wspierający nie mógł się jednak do końca odnaleźć za Oceanem i po rozczarowującym szóstym miejscu w letnim splicie NA LCS 2013 opuścił amerykańską formację i wrócił do Gambitu, w którym występował przez kolejne cztery splity. W tym czasie uczestniczył w powolnym upadku legendarnej formacji, która stała się europejskim przeciętniakiem. Sam Edward dał się poznać jako innowator, prezentując na pozycji wspierającego takie postaci jak Amumu, Kennen czy Gragas, ale nie mógł odnaleźć formy z sezonu 2 i 3. Kilkukrotnie zmieniał też partnera na dolnej alei: po Genji przyszedł Kristoffer „P1noy” Pedersen, a później duńskiego strzelca zastąpił Konstantinos „FORG1VEN” Tzortizou. Edward grał też przez chwilę z Amaurym „Moopzem” Minguerche , ale z żadnym z wymienionych graczy nie potrafił stworzyć takiej synergii jak z Genją w pierwszych sezonach współpracy.</p>\n<p>\nOstatecznie Edward z każdym splitem prezentował się gorzej i po dość solidnych występach w 2014 roku, przyszedł gorszy okres w sezonie2015. W letnim splicie tegoż sezonu Edward zagrał aż dziesięcioma różnymi bohaterami, a więcej niż dwa razy wybierał tylko Alistara (sześciokrotnie). W końcu, po nieudanym ostatnim okresie, wspierający pożegnał się z Gambitem, zmienił nick z powrotem na „Gosu Pepper” i dołączył do Teamu ROCCAT, z którym przystąpi do wiosennego splitu 2016, próbując odbudować mistrzowską formę z poprzednich sezonów.</p>\n<p>\nCo ciekawe, pierwszym nickiem armeńskiego gracza był Immortalrus, co jest złożeniem słowa „immortal” co w języku angielskim oznacza „nieśmiertelnego” oraz końcówki „rus”, która jest powszechnie używanym skrótem dla Rosji (z ang. „Russia”).</p>\n","fr_FR":"<p>Edward « Edward » Abgaryan (précédemment connu sous le nom de Gosu Pepper, et précédemment sous celui d'Edward, et encore précédemment sous celui de... Gosu Pepper...) a joué à la fois aux LCS NA et aux LCS EU. Mais son impact (et sa réputation) viennent de son passage chez Gambit Gaming (précédemment connue sous le nom de Moscow Five). Gambit a terrorisé les autres équipes lors des premières années de League of Legends dans le monde de l'e-sport, défiant même les meilleures formations coréennes. Au fil du temps, et alors que les membres d'origine partaient les uns après les autres, la suprématie de GMB sur les LCS EU se fit de plus en plus ténue.</p>\n<p>Edward a signé avec ROCCAT en 2016, proposant ainsi à l'équipe ses talents de support. L'équipe pourra compter sur la bonne communication d'Edward et sur sa connaissance de longue date du jeu, ce qui viendra complémenter leur nouveau carry AD Mohammad « Safir » Tokhi, qui n'a pas encore fait ses preuves.</p>","de_DE":"<p>Edward „Edward“ Abgaryan ist ein Veteran in der LCS und wahrscheinlich der Erfahrenste im neuen Team ROCCAT. Bekannt wurde er 2001 mit dem Team Moscow 5 mit Alexey „Alex Ich“ Ichetovkin. Unter dem Namen Gosu Pepper machte er sich als Support einen Namen und gewann mehrere IEM-Turniere, ehe Moscow 5 zu Gambit Gaming wurde. 2013 folgte ein Wechsel zum amerikanischen Team Curse, ehe er im November des gleichen Jahres zu Gambit Gaming zurückwechselte. </p>\n\n<p><h2>Seit Beginn dabei</p></h2>\n<p>Schon seit dem Release von League of Legends ist Edward mit dabei. Vorher spielte er Dota und wechselte dann auf die ersten nordamerikanischen Server. 2011 spielte er das erste Mal professionell für Team Empire. Bekannt ist Edward zudem dafür, dass er kein Blatt vor den Mund nimmt. </p>\n<i><p> „Ich bin nicht so unhöflich wie einige denken. Jeder redet immer von angemessenem Sportlerverhalten… Das ist Schwachsinn. Wenn ich jemanden nicht mag, dann sag ich ihm das auch direkt.“ - Edward „Edward“ Abgaryan\n </i></p>\n\n<p><h2>The Thresh King</p></h2>\n<p>Als Support entwickelte er einen eigenen Championpool und Spielstil. </p>\n<i><p> „Als ich das erste Mal ADC spielte war Genja sehr passiv. Er kümmerte sich nicht um die Gegner, sondern farmte und Edward war derjenige, der die Lane kontrollierte und immer wieder Schaden austeilte. Ich war frustriert, weil ich mich fragte, warum mein Support nicht dasselbe machte.“ - Bora „YellOwStaR“ Kim</i></p>\n<p>Neben einem aggressiven Spielstil etablierte er vor allem die Taktik des Roams zur Mid-Lane, um Tötungen zu erzwingen und stellte die Gegner damals vor ein komplett neues Problem. </p>\n<p>Edward bezeichnete Sona immer als den perfekten Support-Champion, machte sich nach der Veröffentlichung von Thresh jedoch mit ihm einen Namen. Mit Thresh wurde Edward noch gefährlicher, sodass er schnell den Spitznamen „The Thresh Prince of Armenia“ und später „The Thresh King“ verpasst bekam. </p>\n<p>Aber er ist auch für untypische Support Picks wie Nunu oder Amumu bekannt. </p>\n\n<p><h2>Beliebte Champions: </p></h2>\n<p>•\tThresh</p>\n<p>•\tSona</p>\n<p>•\tNunu</p>\n","es_ES":"<p>Eduard 'Edward' Abgaryan (anteriormente conocido como Gosu Pepper, que a su vez fue conocido como Edward, que a su vez fue conocido como...Gosu Pepper...) es un jugador que ha participado en ambas LCS, Europa y Norteamérica. La reputación de Eduard viene por el fantástico papel que el apoyo realizó en las filas de Gambit Gaming (previamente Moscow Five). Cuando los esports todavía estaban en pañales, Eduard ya jugaba (y ganaba) contra los mejores equipos del mundo, desde Norteamérica a Corea. Sin embargo con los años el equipo ruso se fue desgastando poco a poco, llegando a la desaparición para la LCS EU 2016.</p>\n\n<p>El apoyo empezará el año en las filas de ROCCAT, que confiará en Eduard para llevar la comunicación entre sus compañeros de equipo y la estrategia a seguir en los momentos clave. Especialmente importante es la sinergia con su nuevo compañero de equipo, el tirador novato Mohammad 'Safir' Tokhi.</p>"},"foreignIds":{"drupalId":"91","TRLH3":"1001220038","TRLH4":"1001190088"},"socialNetworks":{"twitter":"https://twitter.com/EdwardCarryLoL"},"champions":[],"liveGameTeam":16},{"id":84,"slug":"cabochard","name":"Cabochard","firstName":"Lucas ","lastName":"Simon-Meslet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cabochard-iak53xzd.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T10:49:06.000Z","bios":{"en_US":"<p>Lucas “Cabochard” Simon-Meslet is looking to get back into form for 2017. After an impressive performance in the 2016 EU LCS Spring Split, Cabochard regressed last summer. He still put up some nice games on Irelia and Fiora, but like the rest of Vitality he failed to find consistency.</p>\n\n<p>Entering 2017 armed with a new botlane, Cabochard will aim to make an impact and return to his Spring Split self. Not usually one to perform as well on tanks, if Cabochard is allowed to focus on dealing damage, he should have no problem dispensing with his opponents in the top lane.</p>","de_DE":"<p>Lucas „Cabochard“ Simon-Meslet wird 2017 versuchen, seine alte Form wiederzufinden. Nach einer beeindruckenden Vorstellung im Frühjahrs-Split der EU LCS 2016 ging es für Cabochard im letzten Sommer bergab. Er lieferte zwar mit Irelia und Fiora ein paar ansprechende Leistungen ab, aber ihm fehlte wie dem Rest von Vitality die Beständigkeit. \n\n2017 beginnt mit einem neuen Duo auf der unteren Lane und Cabochard wird versuchen, wieder zu seiner Form aus dem Frühjahrs-Split 2016 zurückzufinden. Cabochard liefert mit Tanks zwar nicht die besten Leistungen ab, aber wenn er sich auf Schaden verursachende Champions konzentrieren kann, wird er mit seinen Gegner auf der oberen Lane Schlitten fahren.</p>","fr_FR":"<p>Durant l'intersaison 2015, Lucas « Cabochard » Simon-Meslet a rejoint Team Vitality, une nouvelle organisation qui a acquis la place de Gambit aux LCS. Lorsqu'il était chez Gambit, Cabochard préférait grandement les champions AP, tels que Kennen et Morgana. Il a également joué avec quelques champions tanky, mais il revenait souvent à ses incroyables Fizz et Ryze. Bien que les performances de Cabochard aient diminué quelque peu vers la fin de la saison et aux play-offs, son potentiel restait suffisant pour lui garantir une place chez VIT en 2016.</p>","es_ES":"<p>Si bien es cierto que Lucas ‘Cabochard’ Simon-Meslet es un jugador agresivo que disfruta bajo la luz de los focos que apuntan al principal artífice de la victoria, en realidad no hace honor a la terquedad que su apodo le presupone al ser capaz de anteponer los intereses del colectivo a los suyos.</p>\n\n<p>De hecho, uno de los desafíos que se ha autoimpuesto con tal de estar a la altura de las expectativas en torno a su potencial es demostrar su versatilidad en la calle superior. El francés pasó de competir ocasionalmente junto a leyendas de la talla de Danil ‘Diamondprox’ Reshetnikov a, en cuestión de meses, amasar una ingente cantidad de recursos para liderar a aquellos a los que otrora admiraba.</p>\n\n<p>El protagonismo de Cabochard en Gambit Gaming se saldó con un éxito moderado, aunque no impidió que el joven se quedara con una espinita clavada ante la oportunidad perdida de clasificarse para los Playoffs de verano tras la polémica sanción a Konstantinos ‘FORG1VEN’ Tzortziou. De nada le sirvieron al joven jugador los elogios que propios y extraños dedicaban a sus actuaciones con campeones como Morgana, Kennen o Hecarim. Cabochard apuntó alto, pero acabó luchando por la permanencia en la máxima competición europea.</p>\n\n<p>Una vez conocido el éxito gracias a la conquista de la novena edición de la Intel Extreme Masters Colonia, Cabochard se ha unido a Team Vitality con el objetivo de hacer desaparecer de su paladar el agridulce sabor que le dejó creer que podría haber incluso participado en el Campeonato Mundial 2015 de contar con el tirador griego para reencontrarse con la miel de la victoria.</p>","pl_PL":"<p>18-letni, francuski top-laner swoją profesjonalną karierę rozpoczynał stosunkowo niedawno, bo w sierpniu 2013 roku. Początkowo występował w mniej znanych formacjach takich jak COREPLAY, GSI Gaming czy Heavy Botlane. Z tą ostatnią drużyną z całkiem niezłej strony zaprezentował się jednak w kwalifikacjach EU Challenger Series, odpadając dopiero w ostatnim meczu przeciwko faworytom zmagań. Co ciekawe, w GSI Gaming oraz HB Cabochard grał razem ze swoim bratem, Ugo „Istarim” Simon-Mesletem.</p>\n<p>\nPierwszym ważnym momentem w karierze francuskiego gracz był występ w piątym tygodniu letniego splitu EU LCS 2014, kiedy to Cabochard zastąpił mającego problemy z wizą Evgeny’ego \"Dariena\" Mazaeva. Cabochard zaprezentował się z niezłej strony i z pewnością miało to wpływ na to, że w miesiąc później otrzymał ofertę od pragnącego powrócić do elitarnych rozgrywek Ninjas in Pyjamas, na którego czele stał były mid-laner Gambitu Alexey „Alex Ich” Ichetovkin. Aspiracje te pozostały niespełnione, ale talent Francuza po raz kolejny dostrzegł Gambit, który tym razem szukał stałego zastępstwa dla Dariena. Był to drugi ważny moment w karierze francuskiego top-lanera. </p>\n<p>\nLucas do tego czasu był niezłym zawodnikiem, ale nie wyróżniał się zanadto nawet na tle rywali z Challenger Series. Tymczasem kiedy zaczął występować w EU LCS zrobił ogromny postęp i zaskoczył wszystkich, szybko stając się jednym z najlepszych graczy górnej alei na Starym Kontynencie. Co prawda Gambit spisywał się poniżej oczekiwań, ale jedyną osobą, do której kibice nie mogli mieć najmniejszych zastrzeżeń był właśnie Cabochard, który prezentował równą, wysoką formę przez cały 2015 rok. </p>\n<p>\nW tym czasie Francuz dał się poznać jako niesamowicie utalentowany mechanicznie zawodnik o bardzo szerokim champion poolu i jednocześnie gracz, który nie boi się niestandardowych rozwiązań. To właśnie on był pionierem, jeśli chodzi o wykorzystanie Gankplanka na profesjonalnej scenie – można powiedzieć, że grał piratem zanim jeszcze to było modne, bowiem wybierał tą postać jeszcze przed zmianami, które dotknęły bohatera.</p>\n<p>\nW letnim splicie EU LCS 2015 Cabochard najczęściej grał Hecarimem (4 razy) i Fizzem (trzykrotnie). Francuz był w tej edycji rozgrywek drugim najczęściej zabijającym top-lanerem i najlepiej farmiącym graczej górnej alei. W większości statystyk znajdował się na podium na swojej pozycji. Interesujący, choć nie do końca chwalebny, jest fakt, że zabierał też najwięcej złota drużynowego wśród zawodników górnej linii. Zdawałoby się to potwierdzać mentalność Cabocharda, który zawsze dąży do tego, by mieć duży wpływ na poczynania zespołu. Z tego powodu często prosi swoich dżunglerów o ganki, na co narzekali niektórzy jego byli koledzy z drużyny jak na przykład Tri Tin „K0u” Lam, z który Cabochard występował w barwach NiP. </p>\n<p>\nCo ciekawe, nick francuskiego top-lanera po francusku znaczy „uparty”, a motywacją do przyjęcia takiego właśnie pseudonimu dostarczyła zawodnikowi piosenka Cabochards autorstwa 25G i Setha Gueko.</p>"},"foreignIds":{"drupalId":"1489","TRLH3":"200000119","TRLH4":"200000222"},"socialNetworks":{"twitch":"www.twitch.tv/cabochardlol","facebook":"www.facebook.com/CabochardLol/","twitter":"https://twitter.com/CabochardLoL"},"champions":[],"liveGameTeam":16},{"id":200,"slug":"moopz","name":"Moopz","firstName":"Amaury","lastName":"Minguerche","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moopz-g4a4k2t5.png","hometown":"Belgium","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-01-24T14:52:54.000Z","bios":{"en_US":"Amaury \"Moopz\" Minguerche is a substitute AD carry for Team Vitality.","de_DE":"Amaury \"Moopz\" Minguerche ist ein Ersatzspieler für Team Vitality.","fr_FR":"Dès le début de la saison 1, Moopz s'est investi sur League of Legends. Une transistion réussie puisqu'il atteignit le rang de n°1 du classement européen, avec Morgana et Sion, ses deux champions préférés de l'époque. Un résultat qui lui permit de rejoindre l'équipe Sypher en 2012, un équipe belge ayant participé aux IEM New-York. \n<br />\nPar la suite, Moopz a joué dans de nombreuses teams en Challenger Series comme SK Gaming, mousesport, SUPA HOT CREW et même remplaçant en LCS de l'équipe française Vitality. Il joue aujourd'hui support dans la Team-LDLC et a participé à la précédente édition du Challenge France. Il revient déterminé à porter son équipe vers la victoire. "},"foreignIds":{"drupalId":"1108","TRLH3":"1001220079","TRLH4":"1001190129","FRA1TMNT2":"80126","esportstmnt05":"200000889"},"socialNetworks":{"twitch":"http://www.twitch.tv/moopzy","facebook":"https://www.facebook.com/Moopzy/","twitter":"http://twitter.com/Moopzlol"},"champions":[],"liveGameTeam":16},{"id":218,"slug":"forg1ven","name":"FORG1VEN","firstName":"Konstantinos-Napolen","lastName":"Tzortziou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/forg1ven-g8j1q71b.png","hometown":"Greece","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:02.000Z","updatedAt":"2016-09-23T00:12:59.000Z","bios":{"en_US":"<p>Konstantinos-Napolen “FORG1VEN” Tzortziou is one of the most intense AD carries in Europe. Scoring a phenomenal 12.3 KDA in the 2015 EU LCS Spring Split, FORG1VEN was almost untouchable on his preferred Graves and Lucian picks. After leaving SK Gaming in the wake of their poor performance in the 2015 EU LCS Spring Playoffs, FORG1VEN was briefly picked up by Gambit Gaming, then ended up as H2K’s starting AD Carry. After finishing 4th in the 2016 EU LCS Spring Split, he made his way to Origen before returning to H2K.</p>\n\n<p>FORG1VEN's performances in the EU LCS have left his opponents both devastated and elated. Sometimes he controls the entire map with an iron grip, methodically crushing towers and farming until he can almost 1 vs. 5. And then, in the not-so-great times, FORG1VEN farms off in a corner while his team loses objective after objective. Despite his inconsistency, FORG1VEN remains one of the most feared AD carries in Europe, and after finally blasting his way to Worlds, it’s time from him to show us what we’ve been missing all these years.</p>","de_DE":"<p>„By far“ – antwortete Konstantinos „FORG1VEN“ Tzortziu-Napoleon auf die Frage, ob die Bot-Lane aus ihm und Christoph „nRated“ Seitz die beste der EU LCS sei.</p>\n\n<p>Manch einer könnte jetzt denken, dass FORG1VEN wohl der überheblichste Spieler aller Zeiten wäre und eigentlich gar nicht so gut ist, wie er meint. Tatsächlich ist diese Aussage nicht ganz ohne Fundament, denn gewann er im Frühling 2015 den MVP-Titel der europäische LCS. Vor allem tat er dies ohne ein Bestandteil des Gewinnerteams zu sein, was für gewöhnlich nicht vorkommt. </p>\n<p><h2>Ausnahmetalent</p></h2>\n<p>Der 23 Jahre alte Grieche ist ein Talent, wie die Welt nur selten zu Gesicht bekommt. In vielen anderen Spielen hat er große Erfolge verbuchen können, mit denen er sich stolz brüsten kann. Sein Verständnis für Spielmechaniken und sein Fingerspitzengefühl übertreffen die Meisten seiner Art, was wir als Zuschauer glücklicherweise oft genug zu sehen bekommen, denn auch FORG1VENs Ehrgeiz ist riesig. Er weiß, dass er gut ist und wie er damit umzugehen hat. Ist er der Superstar, so dreht sich das Team um ihn und nicht anders, denn dies ist der garantierte Weg zum Sieg. Es ist ihm egal, ob sein Mid-Laner oder Jungler das Spiel ebenso auf seine Weise gewinnen könnten. Er kann es besser. </p>\n\n<p>Schon zu seiner Zeit bei Copenhagen Wolves war FORG1VEN der einzige Lichtblick, wenn die Mannschaft in der Bredouille stand, was ehrlich gesagt, ziemlich oft vorkam. Mit Petar „Unlimited“ Georgiev, seinem ehemaligen Support und Freund, gewann er regelmäßig seine Lane und gewann damit viel Respekt von seinen Kollegen und Fans. CW gilt ohnehin als Talentschule, sie nehmen unbekannte Amateure in ihr Kader auf und bilden diese zu späteren Superstars aus. </p>\n<p><h2>Erfolge mit SK Gaming</p></h2>\n\n<p>Es überraschte nicht Viele, als das europäische Top-Team SK Gaming den hitzköpfigen Griechen rekrutierte, als der Spring Split 2015 näher rückte. Ohne zu zögern dominierte die Mannschaft mithilfe ihres Neulings die EU LCS und verteidigte wochenlang den ersten Platz der Tabelle, um schließlich dennoch nur auf den vierten Platz in der KO Phase zu rutschen. Trotzdem lässt es sich nicht verleugnen, dass die reguläre Saison eines der erfolgreichsten Splits eines einzelnen Teams in Europa war. Vergleichbar sind lediglich der EU LCS Summer 2014 mit Alliances 21-7-Stand, sowie Fnatics perfekte Saison im vergangenen Sommer. </p>\n\n<p>Hätte SK Gaming dies auch ohne FORG1VEN geschafft? Dies weiß natürlich keiner, aber es deutet darauf hin, denn als er im Sommer zu Gambit Gaming wechselte, erfuhr die Mannschaft den Totalabsturz auf den neunten Platz und schaffte nicht einmal den Klassenerhalt. </p>\n\n<p>Wo alle Spieler einer Organisation zuvor noch um ihren Spielmacher herum gespielt haben, so war es unter Gambit nicht mehr der Fall. FORG1VEN nahm nicht mehr den Löwenanteil der Ressourcen an sich, sondern teilte sich diesen mit dem anderen Spielmacher des Teams Lucas “Cabochard” Simon-Meslet. Zudem erlebte das Metaspiel einen Wandel, welches Schützen auf die billigen Plätze verwies und so auch Gambits Carry. FORG1VEN änderte seinen Spielstil und lernte Champions, welche besser in einer Teamumgebung funktionieren, statt eine Ein-Mann-Armee zu bilden. So sahen wir ihn im Sommer 2015 Sivir und Corki spielen, statt seines typischen aber gefürchteten Lucian/Caitlyn/Graves-Trios. </p>\n<p><h2>GODG1VEN?</p></h2>\n\n<p>2016 hat der griechische Veteran mal wieder einen neuen Arbeitgeber: H2K. Dass er den doch so souverän spielenden Petter „Hjärnan“ Freyschuss ersetzte, deutet darauf hin, dass er es nach drei Jahren in der League of Legends-Szene immer noch verdammt gut drauf hat. Auch der Schützenklasse wurde kräftig unter die Arme gegriffen und neue glänzende Gegenstände wurden ihnen zur Verfügung gestellt. Die Voraussetzungen für ein weiteres Jahr GODG1VEN stehen und die Mannschaft um ihn herum wird alles Mögliche tun, um ihm dies zu gewähren. </p>\n\n<p>Konstantinos „FORG1VEN“ Tzortziu-Napoleon ist bereit, Europa zu erobern.</p>\n","pl_PL":"<p>Ciężko nie zauważyć podobieństwa pomiędzy FORG1VEN’em, a amerykańskim zawodnikiem Yiliangiem “Doubleliftem” Pengiem – obydwaj irytują kibiców swoją arogancją, ale jednocześnie zadziwiają nieprawdopodobnymi umiejętnościami mechanicznymi. \nGdy jednak spojrzymy na greckiego zawodnika z nieco innej strony, okazuje się, że FORG1VEN jako gracz ma wiele zalet – jest świetny indywidualnie i potrafi pociągnąć cały zespół, jeśli otrzyma ku temu możliwości, wiele wymaga od innych, ale równie dużo od siebie i ma mentalność zwycięzcy, jakże potrzebną, gdy mówimy o rywalizacji (e-)sportowej. Ogromnym problemem okazuje się jednak nieumiejętność współpracy, co można zauważyć od początku kariery Greka w LCS.\n\n<p>FORG1VEN został zauważony w 2013 roku. Zespół, który dostał się do EU LCS, Copenhagen Wolves, szukał wtedy strzelca, który byłby w stanie godnie zastąpić powracającego do Fnatic Martina „Rekklesa” Larsona. Uwagę CW zwrócił właśnie Grek, który doskonale radził sobie w soloQ. Do tej pory Konstantinos występował wyłącznie w rodzimych zespołach, wśród których można wymienić chociażby Test Your Limits czy Mad Gods Gaming. Oferta od Wilków z Kopenhagi była więc dla niego dużą szansą.\n\n<p>Od początku gra całego zespołu opierała się właśnie na greckim strzelcu, który spełniał swoje zadania doskonale i miał ogromny wkład w dostanie się do play-offów. Tam jednak CW odpadło już w ćwierćfinale, a FORG1VEN dał upust swoim emocjom na portalach społecznościowych, oskarżając kolegów z ekipy o brak zaangażowania i stwierdzając, że nie interesuje go gra o utrzymanie, a jedynie walka o końcowy triumf. Grek dograł z drużyną mecz barażowy i odszedł z zespołu. Już wtedy wiele drużyn dostrzegało ogromny talent Greka, ale obawiało się jego niepokornego charakteru. Dodatkowo FORG1VEN deklarował, że interesuje go tylko gra o najwyższe cele, wobec czego oczekiwał jedynie ofert z czołowych zespołów. Wskutek tego zawodnik kolejny split spędził poza rozgrywkami LCS, występując w rodzimym zespole Different Dimension. Tymczasem w listopadzie 2014 roku zgłosiło się do niego SK Gaming, które kompletowało bardzo silny roster na wiosenny split 2015. FORG1VEN przyjął ofertę i początkowo SK z nim w składzie całkowicie zdominowało europejskie zmagania, kończąc sezon zasadniczy z wynikiem 15-3. Grecki strzelec otrzymał za tą edycję rozgrywek tytuł MVP i wydawało się, że nic nie zatrzyma SK Gaming i samego ADC. Tymczasem problemy wewnętrzne sprawiły, że formacja błyskawicznie odpadła w play-offach, a FORG1VEN opuścił drużynę. </p>\n\n<p>Ze względu na warunki kontraktu nie mógł w następnym splicie wystąpić w EU LCS, ale zgłosił się po niego Gambit zdecydowany na wykupienie gracza za niebagatelną kwotę, która według nieoficjalnych źródeł miała być zbliżona do wartości nowego samochodu średniej klasy. Początkowo wydawało się, że grecki zawodnik ma szansę odnaleźć się w nowym zespole, ale rzeczywistość szybko to zweryfikowała. Gambit w tym czasie cierpiał na brak treningów przed startem rozgrywek i spisywał się poniżej oczekiwań, a sam FORG1VEN nie mógł pokazać pełni swoich umiejętności ze względu na fakt, że przeciwnicy często skupiali się właśnie na nim.</p>\n\n<p><i>„Granie z FORG1VEN’em jako moim ADC jest zupełnie inną grą, 2 na 3, 2 na 4 w każdej grze” – powiedział partner Greka z dolnej alei, Edward „Edward” Abgaryan.</i></p>\n\n<p>Ostatecznie jego nowy zespół zawiódł i skończył sezon zasadniczy na słabym, ósmym miejscu, choć do końca walczył o play-offy. Sam FORG1VEN został pod koniec splitu… zawieszony. Powodem było toksyczne zachowanie w kolejce solowej. To nie pozwoliło Grekowi uczestniczyć w barażach, a zawodnik szybko rozstał się z Gambitem.</p>\n\n<p>Na wiosenny split 2016 zawodnik dołączył do tworzącego mocny zespół H2k. Co ciekawe, FORG1VEN jest jedynym graczem, który zdobył pierwsze miejsce zarówno w Challengerze na serwerze EUW, jak i na EUNE. Dodatkowo ma na swoim koncie penta-killa zdobytego w rozgrywkach LCS (jeszcze w barwach CW), a także przez pewien czas dzierżył rekord w ilości zabitych stworów w jednej grze (652). Znany jest też właśnie z niezwykle efektywnego farmienia.</p>\n","fr_FR":"<p>Le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon a fait ses armes en jouant pendant plus d’un an à l’échelle nationale. C’est en octobre 2013 qu’il rejoint sa première équipe internationale, Copenhagen Wolves, qui cherchait un remplaçant à Martin « Rekkles » Larsson, de retour chez Fnatic.</p>\n\n<p>Le carry AD rencontre très vite ses premiers succès lors de tournois européens. Par la suite, il parvient à se qualifier à la saison printanière des League of Legends Championship Series 2014 après avoir remporté le tournoi de promotion et battu l’équipe sortante MeetYourMakers. L’entrée en matière est délicate. FORG1VENGRE et ses coéquipiers ne parviennent qu’à atteindre la 6e place sur 8. Le joueur, bien que son expérience professionnelle soit maigre, se montre très impressionnant mécaniquement et se trouve être un farmeur hors-pair. Malheureusement, ce n’est pas suffisant pour éviter les défaites face à Alliance et Gambit Gaming : son équipe arrive à la dernière place lors des play-offs. Le carry AD contribue à sauver son équipe de la relégation mais est alors remercié par la structure.</p>\n\n<p>Il fait alors un pas en arrière et retourne dans une équipe grecque quelques temps. À l’approche de la saison de printemps 2015, il rejoint SK Gaming, une équipe qui, selon lui, a le potentiel de viser le haut du tableau. Il s’avère qu’il avait du flair : les résultats sont immédiatement excellents. Accompagné par l’Allemand Christoph « nRated » Seitz en voie du bas, FORG1VENGRE excelle avec Lucian et Graves et arbore un KDA global supérieur à 12 ! Il livre sa confiance au micro de Sjokz en déclarant que son duo est le meilleur du moment en Europe, by far. SK Gaming réalise une saison régulière presque parfaite et termine à la 1ère place avec 15 victoires pour 3 défaites. FORG1VENGRE est sacré meilleur joueur de la saison ! </p>\n\n<p>Mais l'idylle s’arrête là. Pendant les play-offs, Unicorns of Love et H2K s’inspirent de ce qu’ont fait les équipes asiatiques aux IEM World face à SK Gaming : bannir les champions favoris de FORG1VENGRE afin de le museler, ce qui leur permet de vaincre SK Gaming. FORG1VENGRE quitte alors la structure et rejoint Gambit Gaming mais connaît des mésaventures logistiques qui plombent le début de saison de l’équipe. C’est avec l’arrivée du coach Kévin « Shaunz » Ghanbarzadeh que les résultats s’améliorent, mais le Grec est vite rattrapé par ses démons et se fait suspendre pendant 4 matchs suite à un comportement antisportif et au non-respect du Code de l’invocateur. Il est alors remplacé pour la fin de saison.</p>\n\n<p>Cette année, H2K fait le pari de prendre sous son aile un des carrys AD les plus impressionnants mécaniquement, malgré son passif. FORG1VENGRE aura donc encore l’occasion de montrer l’étendue de son immense talent !</p>\n","es_ES":"<p>Konstantinos ''FORG1VEN'' Tzortziou-Napoleon es uno de los AD carries más intensos de Europa. Con una increíble A/M/A de 12,3 puntos en el split de primavera de la LCS EU 2015, FORG1VEN era prácticamente intocable con sus campeones preferidos, Graves y Lucian. Tras dejar SK Gaming por su pobre actuación en los playoffs de primavera de la LCS EU 2015, FORG1VEN fue fichado brevemente por Gambit Gaming y acabó como AD carry titular de H2K. Después de acabar cuartos en el split de primavera de la LCS EU 2016, se trasladó a Origen justo antes de volver a H2K.</p>\n\n<p>Las actuaciones de FORG1VEN en la LCS EU han dejado a sus oponentes tanto devastados como eufóricos. A veces, controla todo el mapa a la perfección, destruye torretas de forma metódica y asesina tantos súbditos que casi puede enfrentarse uno contra cinco. Pero en sus peores momentos, FORG1VEN se queda farmeando en una esquina mientras su equipo pierde un objetivo tras otro. A pesar de sus inconsistencias, FORG1VEN sigue siendo uno de los AD carries más temidos en Europa, y tras conseguir abrirse camino hasta el Campeonato Mundial, es hora de que nos demuestre lo que nos hemos perdido todos estos años.</p>","es_AR":"<p>Konstantinos \"FORG1VEN\" Tzortziou-Napoleon es uno de los ADC más penetrantes de Europa. Con un KDA fenomenal de 12.3 puntos en el torneo de apertura de la LCS EU 2015, FORG1VENGRE fue casi intocable con Graves y Lucian, sus personajes favoritos. Luego de dejar SK Gaming tras un mal desempeño en las eliminatorias de primavera de la LCS EU 2015, FORG1VEN tuvo un paso corto por Gambit Gaming y terminó como ADC inicial de H2K. -Tras terminar cuarto en el torneo de apertura de la LCS EU 2016, pasó por Origen antes de regresar a H2K.</p>\n\n<p>Las actuaciones de FORG1VEN en la LCS EU dejaron a sus rivales devastados y exaltados. A veces controla todo el mapa con mano de hierro, destrozando torres de forma metódica y efectuando asesinatos reiterados a más no poder contra hasta 5 rivales. Y luego, en los tiempos no tan buenos, FORG1VEN efectúa asesinatos reiterados desde un rincón mientras su equipo pierde un objetivo tras otro. A pesar de sus altibajos, FORG1VEN sigue siendo uno de los ADC más temidos de Europa y, después de haberse asegurado un lugar en el Mundial, es hora de que nos muestre todo lo que nos hemos perdido estos años.</p>","pt_BR":"<p>Konstantinos “FORG1VEN” Tzortziou-Napoleon é um dos atiradores mais intensos da Europa. Marcando um AMA fenomenal de 12,3 na Etapa de Primavera da EU LCS 2015, FORG1VEN era quase invencível com suas escolhas favoritas, Graves e Lucian. Depois de deixar a SK Gaming no momento de sua pior performance nas Eliminatórias de Primavera da EU LCS 2015, FORG1VEN foi logo acolhido pela Gambit Gaming até finalmente terminar como o atirador titular da H2K. Depois de terminar em 4º lugar na Etapa de Primavera da EU LCS 2015, ele resolveu entrar para a Origen, mas retornou novamente para a H2K.</p>\n\n<p>O desempenho de FORG1VEN na EU LCS deixou seus oponentes tanto devastados quanto exultantes. Às vezes ele consegue controlar o mapa inteiro com punhos de ferro, destruindo torres metodicamente e acumulando recursos até que ele seja praticamente capaz de enfrentar um 1 x 5. Mas também há momentos assim não tão gloriosos, em que FORG1VEN fica em um canto só acumulando seus recursos enquanto sua equipe perde objetivos um atrás do outro. Apesar de sua inconsistência, FORG1VEN ainda é um dos atiradores mais temidos da Europa, e depois de finalmente conseguir seu lugar no Mundial, está na hora de ele nos mostrar o que ainda não vimos esse ano.</p>"},"foreignIds":{"drupalId":"1104","TRLH3":"1001220028","TRLH4":"1001190078","TRLH1":"1001380090","TRLH2":"1001280060","FRA1TMNT2":"25439"},"socialNetworks":{"facebook":"https://www.facebook.com/forg1ven247","twitter":"https://twitter.com/FORG1VENGRE"},"champions":[],"liveGameTeam":16},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":16},{"id":328,"slug":"steeelback","name":"Steeelback","firstName":"Pierre","lastName":"Medjaldi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/steeelback-6w0pq1lj.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-18T22:51:12.000Z","bios":{"en_US":"<p>Pierre \"Steeelback Medjaldi is still looking for a team he can call home. He rose to prominence with Fnatic in 2015 but was replaced by a returning Rekkles. He joined Gambit Gaming for a split. Then he migrated to the Unicorns of Love but departed after a playoff defeat. He spent the 2016 EU LCS Summer Split with ROCCAT before deciding to move on once again.</p>\n\n<p>Steeelback and Team Vitality both hope to have found the perfect match. Steeelback's talent has never been in question; he put up impressive numbers in the Summer Split despite ROCCAT nearly getting relegated. Alongside ex-KT Rolster support Hachani, Steeelback has the potential to rival the best bot lanes in the EU LCS -- if he's willing to stick around.</p>","de_DE":"<p>Pierre „Steeelback“ Medjaldi sucht immer noch nach einem Team, in dem er sich zu Hause fühlt. Er wurde 2015 mit Fnatic bekannt, wurde später allerdings durch Rekkles ersetzt. Daraufhin spielte er einen Split bei Gambit Gaming. Danach zog es ihn zu den Unicorns of Love, die er nach einer Niederlage in den Entscheidungsspielen jedoch wieder verließ. Während des Sommer-Splits der EU LCS 2016 spielte er dann bei ROCCAT, bevor er wieder weiterzog.\n\nJetzt hoffen sowohl Steeelback als auch Team Vitality, dass sie perfekt zusammenpassen. Steeelbacks Talent steht außer Frage. Er lieferte im Sommer-Split eine beeindruckende Leistung ab, obwohl ROCCAT beinahe absteigen musste. Neben dem ehemaligen Supporter von KT Rolster, Hachani, hat Steeelback das Potenzial, die besten Duos auf der unteren Lane herauszufordern – wenn er nicht wieder die Mannschaft wechselt.</p>","fr_FR":"<p>Pierre « Steeelback » Medjaldi a rejoint les rangs de SK Gaming Prime à la fin de l’année 2014, sans trouver le succès car éliminé prématurément du tournoi d'expansion qui permettait l’accès aux League of Legends Championship Series. </p>\n\n<p>Mais le Français accède tout de même aux LCS. Steeelback est en effet repéré par son compatriote Bora « YellOwStaR » Kim par pur hasard alors que ce dernier écumait les parties classées. Le vétéran de Fnatic qui cherchait un dernier joueur pour son équipe est agréablement surpris par le niveau de jeu du carry AD. Il décèle chez lui une soif d’apprendre très développée et décide de l’inviter à le rejoindre dans sa nouvelle aventure.</p>\n\n<p>En très peu de temps, le duo français et ses trois coéquipiers réussissent à créer un jeu qu’ils exposent aux yeux d’un public européen positivement surpris. Dès la première semaine, Steeelback et ses coéquipiers montrent une cohésion impressionnante et remportent leurs deux parties. Galvanisé et guidé par un des meilleurs support au monde, le jeune joueur tient la dragée haute à certains des meilleurs carrys AD d’Europe. S’il n’est que la 3e source de dégâts d’une équipe très centrée sur son toplaner Seung-hoon « Huni » Heo, Steeelback est régulier et sait être la tornade qui vient balayer les combats d’équipe avec Corki ou Graves, ne laissant aucune chance de fuite à ses adversaire. Il signe un très bon ratio KDA de 8,9.</p>\n\n<p>Steeelback et Fnatic sont sacrés champions d’Europe après avoir remporté les play-offs et sont conviés au tournoi sur invitation de mi-saison. Le carry AD montre ses limites face à certains des meilleurs joueurs du monde et est remercié par la suite. Le management de Fnatic a indiqué être conscient du potentiel du Français mais ne pas avoir le temps d’attendre que le joueur soit formé, les ambitions du club ayant fortement augmenté.</p>\n\n<p>À la recherche d’un nouveau toit, Steeelback se tourne vers l’Amérique du Nord et rejoint Odyssey Gaming. Malheureusement, l’équipe ne parvient pas à se qualifier aux Challenger series NA. Il rejoint par la suite une équipe qui, elle, est parvenue à accéder à la compétition : Team Imagine. Après des résultats mitigés, il parvient tout de même à accéder au tournoi de promotion, mais son équipe se fait éliminer par Team 8, l’escouade sortante des LCS.</p>\n\n<p>En 2016, Steeelback revient en Europe et compte bien réitérer une bonne performance en LCS, cette fois-ci avec Unicorns of Love. Au début du segment de printemps, il s’illustre notamment avec sa Kalista, terminant le segment avec un KDA de 33 sur ce personnage et un KDA général de 6.81. Malgré de bonnes statistiques personnelles, l’équipe ne suit pas et termine à la 5ème place de la saison régulière. Une performance décevante pour Steeelback qui décide de partir pour Roccat au début du segment d’été.</p>\n","pl_PL":"<p>Pierwszą próbę zaistnienia w League of Legends Pierre podjął w drużynie GSI Gaming w sierpniu 2014 roku. Skończyło się tylko na podejściu, gdyż w jego szeregach nie wystąpił na scenie esportowej. Udało mu się pokazać z kolejnym zespołem – SK Gaming Prime, do którego dołączył w listopadzie tego samego roku. Z tą organizacją miał okazję nabrać doświadczenia i wziąć udział w Challenger Series. Jednak nie odniósł tam sukcesów, na których mu zależało.</p>\n<p>\nPrzełomem w karierze francuza było dostanie się, w styczniu 2015 roku, do sztandarowego zespołu Europy - Fnatic. Poprzedni AD Carry, „Rekkles”, postawił mu poprzeczkę bardzo wysoko. Wielu fanów było bardzo zawiedzionych wyborem Pierra Medjaldi na tą pozycję. On sam skomentował to krótko: „Chciałbym się sprawdzić w rozgrywkach EU LCS i zasłużyć na miejsce pomiędzy najlepszymi graczami AD Carry w Europie.” Miał taką okazję w wiosennym sezonie 2015 i udowodnił, że nie był złym wyborem. Fnatic po tym okresie uplasowało się na 2gim miejscu, co w dużej mierze było jego zasługą. Później poprawił ten wynik wraz z drużyną w rozgrywkach barażowych. Czołowa pozycja w Europie po pierwszym semestrze to jedno z największych dokonań Pierra. Drugie największe osiągnięcie to występ na 2015 Mid-Season Invitational. \"Steeelback\" zmierzył się na tym wydarzeniu z najlepszymi zawodnikami z całego świata i wypadł całkiem dobrze. Fnatic został zatrzymany dopiero przez SKT T1, przyszłych Mistrzów Świata, w zaciętej walce z wynikiem 2:3. Niestety wkrótce po turnieju, w maju 2015 roku, organizacja Fnatic zdecydowała się na ponowne przyjęcie Martina „Rekkles” Larssona, więc Pierre poszedł w odstawkę. </p>\n<p>\nPo tym wydarzeniu wypowiedział się, że chciałby móc się wykazać po MSI, ale taka szansa nie została mu dana. \"Steeelback\" wrócił do prób dostania się do EU Challenger Series wraz z drużyną Odyssey Gaming, lecz bez pomyślności. Następnie zasilił skład Team Imagine, które walczyło o kwalifikację do NA LCS. W rozgrywkach kwalifikacyjnych skończyli na trzeciej pozycji, przez co później musieli się zmierzyć z doświadczonym Team8. Niestety przeciwnicy okazali się mocniejsi, więc nowa drużyna Pierra pozostała w NA Challenger Series. 2 miesiące później zrezygnował dalszej walki o wejście wyżej, na rzecz propozycji zespołu, który już znajdował się w wiosennym sezonie EU LCS 2016. W listopadzie stał się członkiem Unicorns Of Love, gotowy do kolejnego podejścia w profesjonalnych rozgrywkach.</p>\n<p>\nWypowiedzi Pierra z wywiadów to nieliczne źródła, z których można się dowiedzieć czegoś o nim. To bardzo skryty gracz, z reguły rzadko udzielający się na portalach społecznościowych. Po jego wyborach w meczach można się łatwo domyślić, że najbardziej lubi grać Corkim, Lucianem i Sivir. Tymi bohaterami miał najlepsze wyniki i nim zawdzięcza wejście do Kręgu Pretendenta w Europie i Ameryce Północnej.\n</p>","es_ES":"<p>Aunque Pierre ‘Steeelback’ Medjaldi se hizo popular gracias a su fichaje por Fnatic en el Split de primavera de la LCS 2015, el jugador ya ha pasado hasta por siete equipos en menos de un año. Sin miedo a nuevos retos y aventuras, el joven francés todavía tiene una larga carrera por delante para demostrar que no sólo fue una apuesta arriesgada, sino también una garantía de futuro que explotará en Unicorns of Love.</p>\n\n<p>No es del todo cierto asegurar que Steeelback era un completo desconocido antes de fichar por Fnatic pero sí que es cierto que sus apariciones son con cuentagotas. En Agosto ficharía por GSI Gaming, equipo francés en el que también participaron Lucas ‘Cabochard’ Simon-Meslet y Aleksi ‘Hiiva’ Kaikkonen. Quizás por el contacto con el segundo pudo competir con SK Gaming Prime en el intento en Noviembre de entrar a la LCS por el torneo de promoción de primavera, aunque serían derrotados en la primera ronda por Reason Gaming.</p>\n\n<p>Aquí es cuando la vida del tirador cambia totalmente de rumbo debido al fichaje por Fnatic. Aunque el voto de confianza de Bora ‘YellOwStaR’ Kim le permitió entrar al equipo, la toma de contacto con Fnatic fue curiosamente por Fabian ‘Febiven’ Diepstraten que realizó la sugerencia para que probase por la escuadra inglesa. Durante primavera se mostró sólido pero no espectacular aunque no sería tarea fácil enfrentarse a los mejores del mundo en su posición en el Mid Season Invitational 2015. Su dominio de Sivir les otorgó una posibilidad táctica que le permitió cumplir su rol secundario.</p>\n\n<p>Pero con la llegada de Martin ‘Rekkles’ Larsson, el joven francés decidió tomar rumbo a las américas. La suerte no le acompañó ni en Odyssey Gaming al no poder clasificarse para la Challenger Series norteamericana ni en Imagine, puesto que ya en Challenger Series no fueron rival de Team8 para ascender a la League Championship Series. El jugador mostró una faceta más agresiva con campeones como Lucian o Corki que le permitieron aportar el desgaste necesario, pero todavía se mantuvo en una posición de retaguardia más pasiva.</p>\n\n<p>Con Zdravets ‘Hylissang’ Galabov la fase de líneas será un factor fundamental a la hora de decidir las partidas debido a la agresividad del búlgaro. El tirador tendrá que dar un paso adelante en su agresividad en una metajuego que a priori podría beneficiar a su Lucian, pero en el que la duda es la principal amenaza.</p>\n\n<p>Después de Fnatic y la Challenger Series norteamericana, esta supone la tercera aventura de Steeelback. El jugador ya ha afirmado su número de la suerte es el tres, de ahí las tres es en su nombre, y además también posee a tres campeones favoritos fuera de la propia posición de tirador, como son Zed, Lee Sin y Thresh. ¿Será la tercera la vencida?</p>"},"foreignIds":{"drupalId":"2903","TRLH3":"200000122","TRLH4":"200000225"},"socialNetworks":{"twitch":"http://www.twitch.tv/steeelback","facebook":"www.facebook.com/Steeelback","twitter":"http://twitter.com/Steeelb4ck"},"champions":[],"liveGameTeam":16},{"id":339,"slug":"p1noy","name":"P1noy","firstName":"Kristoffer ","lastName":"Pedersen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/p1noy-2747h2i6.png","hometown":"Denmark","region":"Challenge France","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-05T18:14:06.000Z","bios":{"en_US":"","fr_FR":"P1noy est un Carry AD présent sur la scène compétitive européenne depuis plusieurs années. Commençant sa carrière en saison 3, il a joué dans de nombreuses team en Challenger Series, comme Reason Gaming (2014), Copenhagen Wolves (2016) ou Huma (2016). \n<br />\nRepéré par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires. \n"},"foreignIds":{"drupalId":"3660","TRLH3":"1001000088","TRLH4":"1001240005","FRA1TMNT1":"375181","esportstmnt05":"200000938","ESPORTSTMNT02":"200001015","ESPORTSTMNT04":"200001605"},"socialNetworks":{},"champions":[],"liveGameTeam":16},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":818,"slug":"imsofresh","name":"ImSoFresh","firstName":"Karim ","lastName":"Bbahla","roleSlug":"jungle","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/IMSOFRESH.LD_lolesports.PP_.jpg","hometown":"Belgium","region":null,"birthdate":null,"createdAt":"2015-07-15T21:08:36.000Z","updatedAt":"2015-09-01T21:55:04.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1122"},"socialNetworks":{},"champions":[],"liveGameTeam":16},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34}],"scheduleItems":[{"id":"AU3UKWYoJTrHluSI14C5","content":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:match:773c613c-7f6d-484e-8dc4-20ad21936647","scheduledTime":"2015-06-19T19:00:00.000+0000","tags":{"subBlockLabel":"EU LCS Summer - Week 4 - Day 2","blockLabel":"4","leagueLabel":"urn:rg:lolesports:global:league:league:3","blockPrefix":"week","subBlockPrefix":"day","yearLabel":"2015","stageLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1:bracket:051ebefd-5274-445e-ae69-bf52861028a1","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:6fee33c6-bf3e-46f3-82b3-d21934202ee1"},"match":"773c613c-7f6d-484e-8dc4-20ad21936647","tournament":"6fee33c6-bf3e-46f3-82b3-d21934202ee1","bracket":"051ebefd-5274-445e-ae69-bf52861028a1","league":"3"}],"gameIdMappings":[{"id":"4a981514-38b7-4431-b58d-148b615041e5","gameHash":"359ba6dda907db8b"}],"videos":[],"htmlBlocks":[],"match":{"id":"773c613c-7f6d-484e-8dc4-20ad21936647","name":"R2M8","position":7,"state":"resolved","groupPosition":1,"input":[{"roster":"e06c5387-b8a7-48c2-96d6-52450e7f0e32"},{"roster":"d8c8e5a2-9056-4edd-ae3c-e807848c8072"}],"games":{"4a981514-38b7-4431-b58d-148b615041e5":{"id":"4a981514-38b7-4431-b58d-148b615041e5","name":"G1","generatedName":"GMB|UOL|G1|773c613c7f6d484e8dc","input":[{"roster":"e06c5387-b8a7-48c2-96d6-52450e7f0e32"},{"roster":"d8c8e5a2-9056-4edd-ae3c-e807848c8072"}],"standings":{"result":[[{"roster":"d8c8e5a2-9056-4edd-ae3c-e807848c8072"}],[{"roster":"e06c5387-b8a7-48c2-96d6-52450e7f0e32"}]],"timestamp":1438718812352,"source":"manual","note":"Clone results from Match Service","closed":true},"scores":{},"gameId":"1001200109","gameRealm":"TRLH3","platformId":"TRLH3:1001200109","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"d8c8e5a2-9056-4edd-ae3c-e807848c8072"}],[{"roster":"e06c5387-b8a7-48c2-96d6-52450e7f0e32"}]],"timestamp":1438718812352,"source":"manual","note":"Clone results from Match Service","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"e06c5387-b8a7-48c2-96d6-52450e7f0e32":0,"d8c8e5a2-9056-4edd-ae3c-e807848c8072":1}}}