{"teams":[{"id":2,"slug":"bangkok-titans","name":"Bangkok Titans","guid":"be6c63c3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/sites/default/files/BKT_GPL.TMPROFILE_0.png","logoUrl":"http://assets.lolesports.com/team/bangkok-titans-597g0x1v.png","acronym":"BKT","homeLeague":"urn:rg:lolesports:global:league:league:1","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-03-02T21:45:03.000Z","bios":{"en_US":"The Bangkok Titans are the undisputed champions of Thailand’s League of Legends esports scene. They achieved six consecutive 1st place finishes in the Thailand Pro League from 2014 to 2015. However, they aren’t content with just domestic domination. The Titans have built on their foundation of success at home, climbing to 1st place finishes in both the 2015 GPL Summer and 2015 International Wildcard Tournament Turkey.\n</p>","fr_FR":"Bangkok Titans sont les champions incontestés de la scène e-sportive thaïlandaise. Ils ont obtenu six 1re place en Thailand Pro League entre 2014 et 2015. Mais la concurrence nationale ne leur suffit pas. Les Titans ont terminé premier lors du Segment d'été de la GPL 2015 et de l'International Wildcard 2015 en Turquie.","pl_PL":"Bangkok Titans to niekwestionowany mistrz tajlandzkiej sceny E-sportowej League of Legends. Osiągnęło sześć 1. miejsc z rzędu w Thailand Pro League od roku 2014 do 2015. Jednakże dominacja w kraju to za mało. Titans wykorzystali sukces odniesiony w kraju, zajmując 1. miejsce w letnim GPL 2015 oraz 2015 International Wildcard Tournament Turkey.","de_DE":"Die Bangkok Titans sind die unangefochtenen Champions der thailändischen League of Legends eSports Szene. Sie erkämpften sich sechs Mal aufeinanderfolgend den ersten Platz in der Profi Liga zwischen 2014 und 2015. Doch trotzdem sind sie mit ihrem regionalen Erfolg nicht zufrieden. Sie knüpften an ihre Siegesreihe an und gewannen das Sommer Finale der GPL 2015 und das Wildcard Turnier in der Türkei.","es_ES":"Nadie puede negar que Bangkok Titans es el equipo de League of Legends más potente de Tailandia. Entre 2014 y 2015 ha obtenido seis títulos consecutivos de la Thailand Pro League. Sin embargo, no se contentan con dominar a sus anchas en su país. Los Titans han utilizado su éxito local como cimientos para crecer, como demuestra el primer puesto cosechado tanto en el torneo de verano de la GPL 2015 como en el torneo internacional por invitación celebrado en Turquía este mismo año.","pt_BR":"A Bangkok Titans é a campeã absoluta no League of Legends tailandês. De 2014 a 2015, eles conseguiram seis títulos na Thailand Pro League. Mas eles não estão satisfeitos com o domínio regional, e querem fazer bonito internacionalmente. O primeiro passo já foi dado: eles venceram tanto a GPL de verão 2015 quanto o International Wildcard 2015 na Turquia, conquistando a vaga para o Mundial. \n"},"foreignIds":{"drupalId":"1024"},"players":[7,10,11,843,844,846],"starters":[7,10,11,843,844],"subs":[846]},{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]}],"players":[{"id":7,"slug":"warl0ck","name":"WarL0cK","firstName":"Pawat","lastName":"Ampaporn","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/warl0ck-cm8ktgfb.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:13.000Z","updatedAt":"2015-09-29T18:06:01.000Z","bios":{"en_US":"<p>Joining the Bangkok Titans in 2013, Pawat “WarL0cK” Ampaporn is the veteran team captain of the squad. He has been through several role swaps, with short stints in the jungle and support roles before finally finding his home in the top lane in 2014. Warl0ck excels with top lane tanks, playing champions like Maokai and Mundo to perfection. He acts as a disruptive force to his opponents' carries, and if he’s fed, he will often outright kill them.\n</p>\n<p>\nAfter two years of hard work, WarL0ck established himself as the best top laner not only in Thailand, but in the whole of Southeast Asia. The next step is proving he has what it takes to scuffle with the best top laners in the world.</p>","fr_FR":"<p>Pawat « WarL0cK » Ampaporn a rejoint Bangkok Titans en 2013, ce qui fait de lui le capitaine vétéran de l'équipe. Il a occupé plusieurs positions, avec quelques essais dans la jungle et comme support avant de trouver son poste de prédilection en 2014, sur la voie du haut. Warl0ck est excellent avec les tanks sur la voie du haut et il joue à la perfection des champions comme Maokai et Mundo. Il sait contrer les carrys de l'adversaire et il est parfaitement capable de les écraser si les circonstances s'y prêtent.\n</p>\n<p>\nAprès deux ans de dur labeur, WarL0ck est devenu le meilleur top laner non seulement de Thaïlande, mais de toute l'Asie du Sud-est. Il lui reste à montrer ce qu'il peut faire sur la voie du haut contre les meilleurs joueurs du monde.\n</p>","pl_PL":"<p>Dołączywszy do Bangkok Titans w 2013 roku, Pawat „WarL0cK” Ampaporn jest doświadczonym kapitanem drużyny. Zaliczył kilka zmian roli, na krótko goszcząc w dżungli i jako wspierający, zanim wreszcie odnalazł się w górnej alei w 2014 roku. Warl0ck najlepiej sprawdza się jako obrońca, do perfekcji wcielając się w bohaterów takich jak Maokai i Mundo. Doskonale sprawdza się w przeszkadzaniu wrogim prowadzącym, a jeżeli udało mu się zyskać przewagę, bardzo często po prostu ich zabije.\n</p>\n<p>\nPo dwóch latach ciężkiej pracy WarL0ck został uznany za najlepszego górnego nie tylko w Tajlandii, ale w całej Azji Południowo-Wschodniej. Kolejnym jego krokiem będzie udowodnienie, że potrafi rywalizować z najlepszymi górnymi z całego świata.\n</p>","de_DE":"<p>Pawat “WarL0cK” Ampaporn ist der Veteran und Team Kapitän der Bangkok Titans seit er 2013 Teil von ihnen geworden ist. Er hat sich schon an vielen Rollen versucht, mit einem kurzen Abstecher in den Jungle oder auch als Support, bis er endlich 2014 auf der Top-Lane angekommen ist. Warl0cKs Ass im Ärmel sind die Top-Lane Tanks wie Maokai und Mundo, welche er perfektioniert hat. Er ist die zerstörerische Kraft der Titans und der Einzige, der die gegnerischen Carries im Schach halten kann. Liegt er einmal vorne, kann er sie oftmals gänzlich aus dem Spiel nehmen. </p>\n\n<p>Nach rund zwei Jahren harter Arbeit, machte Warl0cK sich einen Namen als bester Top-Laner und das nicht nur in Thailand, sondern in ganz Südostasien. Jetzt muss er nur noch zeigen, ob er es mit den besten Top-Lanern der Welt aufnehmen kann. </p>\n","es_ES":"<p>Se unió a Bangkok Titans en el 2013, Pawat “WarL0cK” Ampaporn es el veterano capitán del equipo. Ha pasado por distintos cambios de rol, con un breve paso tanto en jungla como support finalmente encontró su hogar en la calle superior en 2014. La especialidad de WarL0cK son los tanques en la calle superior, juega campeones como Maokai y Dr. Mundo a la perfección. Actúa como una fuerza disuasoria para los asesinos enemigos, y si es él el que ha conseguido ponerse por delante en la partida, que se preparen sus adversarios. </p>\n\n<p>Después de dos años de trabajo duro, WarL0cK se estableció como el mejor top no sólo en Tailandia, sino en todo el Sudeste Asiático. El siguiente paso es demostrar que tiene lo que hay que tener para medirse a los mejores jugadores del mundo. </p>\n","pt_BR":"<p>O capitão e veterano da Bangkok está no time desde 2013, e já passou por diversas rotas. Teve sua época de caçador e suporte até fixar moradia na rota superior em 2014. Warl0ck é especialista em emboscadas no topo, conduzindo Maokai e Mundo com perfeição. Ele costuma incomodar a vida dos carregadores inimigos, e vai direto para o abate se estiver forte na partida.</p> \n<p>\nDepois de dois anos de muita dedicação, ele se estabeleceu como o melhor jogador do topo não só na Tailândia, mas em todo o sudeste asiático. O próximo passo é provar que ele está à altura dos melhores do mundo.</p>"},"foreignIds":{"drupalId":"1025","TRLH3":"1001160057","TRLH4":"1001160057"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":10,"slug":"lloyd","name":"Lloyd","firstName":"Juckkirsts","lastName":"Kongubon","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lloyd-6bj83xgb.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:14.000Z","updatedAt":"2015-09-29T18:11:08.000Z","bios":{"en_US":"<p>After picking up League of Legends in 2013, Juckkirsts ”Lloyd” Kongubon almost immediately started looking to compete professionally. He joined Thailand's amateur squad known as Team FlashDive, and following solid performances in local tournaments, soon caught the attention of several elite teams. Near the end of 2013, he was signed by the Bangkok Titans. \n</p>\n<p>\nLloyd is known for his exceptional laning mechanics, playing aggressively into his opponent to force trades. Eventually he either zones his opponent out of lane or snags a kill. Lloyd is more than just an aggressive AD carry though -- he is also a pillar for his team. He acts as a motivator for his teammates when they are down, pushing them to fight until the Nexus explodes. Lloyd is determined to prove that BKT is a world-class team.\n</p>","fr_FR":"<p>Dès qu'il fixa son choix sur League of Legends en 2013, Juckkirsts « Lloyd » Kongubon chercha à entrer sur la scène professionnelle. Il rejoignit une équipe amateur thaïlandaise appelée Team FlashDive et ses excellentes performances dans les compétitions locales attirèrent l'attention de plusieurs équipes de haut rang. Vers la fin de 2013, il rejoignit Bangkok Titans. \n</p>\n<p>\nLloyd est connue pour ses mécaniques exceptionnelles sur les voies et pour son jeu agressif contraignant ses adversaires à concéder des échanges défavorables. Il finit souvent par repousser son opposant ou par le tuer. Mais Lloyd n'est pas qu'un carry AD agressif, c'est aussi un pilier pour son équipe. Il sait motiver ses coéquipiers quand ils n'ont plus le moral, les pousse à combattre jusqu'à l'explosion du Nexus. Lloyd veut vraiment prouver que BKT est une équipe de classe mondiale.\n</p>","pl_PL":"<p>Po rozpoczęciu gry w League of Legends w 2013 roku Juckkirsts „Lloyd” Kongubon praktycznie od razu zaczął rozglądać się za profesjonalnymi rozgrywkami. Dołączył do amatorskiej drużyny z Tajlandii znanej jako Team FlashDrive i dzięki osiągnięciu dobrych wyników w lokalnych turniejach wkrótce zwrócił na siebie uwagę kilku profesjonalnych drużyn. Pod koniec 2013 roku dołączył do Bangkok Titans. \n</p>\n<p>\nLloyd słynie z niezwykle wyjątkowej zdolności do walki w alejach, agresywnie prowokując swoich przeciwników w celu wymuszenia walki. Ostatecznie albo zmusza przeciwnika do odwrotu, albo go zabija. Jednakże Lloyd nie jest wyłącznie agresywnym prowadzącym – jest także filarem dla swojej drużyny. Motywuje swoich kolegów, gdy podupadają na duchu, i popycha ich do walki, dopóki nexus nie eksploduje. Lloyd pragnie udowodnić, że BKT jest drużyną światowej klasy.\n</p>","de_DE":"<p>Nachdem er gerade Mal im Jahr 2013 anfing League of Legends zu spielen, suchte Juckkirsts „Lloyd“ Kongubon fast zeitgleich nach professionellen Karrierewegen. Er wurde Teil des thailändischen Amateurteams „Team FlashDive“ und lieferte dort solide Leistungen ab. Dies brachte ihm viel Aufmerksamkeit, unter anderem von den Bangkok Titans, sodass er Ende 2013 bei ihnen unterschrieb. Lloyd ist bekannt für seine starke Präsenz in der Laning-Phase, da er aggressiv spielt und seine Gegner zu einem stetigen Schadensaustausch zwingt. Am Ende drängt er seinen Gegner entweder von der Lane oder staubt eine Tötung ab. Aber Lloyd ist mehr als nur ein aggressiver Schütze – er ist auch die Säule des Teams. Er motiviert seine Mitspieler, wenn sie am Boden sind und treibt sie an, bis der gegnerische Nexus fällt. Lloyd ist fest entschlossen zu zeigen, dass sein Team Weltklasse besitzt. </p>","es_ES":"<p>Desde que comenzara a jugar a League of Legends en 2013 la idea de Juckkirsts ”Lloyd” Kongubon fue convertirse en jugador profesional. Se unió a un equipo amateur tailandés llamado Team FlashDive y, gracias a sus buenas actuaciones en torneos locales, llamó la atención de algunos de los mejores equipos. A finales de 2013 firmó por Bangkok Titans. </p>\n\n<p>Lloyd es conocido por sus mecánicas en fase de calles, jugando de forma agresiva para forzar enfrentamientos. Eventualmente lo que acaba ocurriendo es que, o bien saca a su oponente de la calle o bien lo asesina. Aunque Lloyd es algo más que un tirador agresivo -- también es uno de los pilares de su equipo. Motiva a sus compañeros cuando están en horas bajas, animandoles a no rendirse hasta que el Nexo explote. Lloyd está determinado a demostrar que BKT es un equipo de clase mundial. </p>\n","pt_BR":"<p>Lloyd começou a jogar League em 2013, e logo já estava competindo profissionalmente. Ele fez parte do time amador Team FlashDive, e depois de boas atuações em torneios locais chamou a atenção dos times grandes. No final de 2013, foi contratado pela Bangkok Titans. </p>\n<p>\nEle é conhecido por suas habilidades mecânicas incríveis na rota, jogando de forma agressiva para ganhar trocas contra o adversário. O resultado costuma ser um dos dois: rival morto, ou rival afastado para longe da rota. Mas ele é mais que um atirador agressivo -- também é o pilar do time. É quem traz a motivação quando os companheiros estão abatidos, botando todo mundo para cima até derrubar o Nexus.\n</p>"},"foreignIds":{"drupalId":"1728","TRLH3":"1001160060","TRLH4":"1001160060"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":11,"slug":"007x","name":"007x","firstName":"Chayut","lastName":"Suebka","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/007x-53wft7u.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2014-07-16T22:59:14.000Z","updatedAt":"2015-09-29T18:05:32.000Z","bios":{"en_US":"<p>Chayut “007x” Suebka earned the brilliant nickname 00Jayce due to his debonair mechanics in the top lane. However, in the middle of 2014, 007x moved to the jungle to boost BKT’s team synergy. The move paid off. BKT took 1st place in the 2015 Thailand Pro League Summer, 2015 GPL Summer, and 2015 International Wildcard Tournament Turkey. \n</p>\n<p>\n007x channels his inner James Bond every time he hits the Rift. He frequently works in tandem with his mid laner Nuttapong \"G4” Menkasikan to set up ambushes against the enemy jungler or to lure the opposing mid laner into a gankable position. With a diverse champion pool and a love for initiating for his team, 007x will be playing aggressive no matter who he faces.\n</p>","fr_FR":"<p>Chayut « 007x » Suebka a gagné le surnom 00Jayce en raison de ses mécaniques de jeu « séduisantes » sur la voie du haut. Pourtant, au cours de l'année 2014, 007x entra dans la jungle pour doper la synergie d'équipe de BKT. Ce fut un excellent choix. BKT prit la première place de la Thailand Pro League au cours de l'été 2015, de la GPL de l'été 2015 et de l'International Wildcard Tournament 2015 en Turquie. \n</p>\n<p>\n007x fait ressortir le James Bond qui est en lui à chaque fois qu'il va dans la Faille. Il travaille souvent en tandem avec son mid laner Nuttapong « G4 » Menkasikan pour planifier des embuscades contre le jungler ennemi ou pour attirer le mid laner adverse jusqu'à une position où il est possible de le ganker. Disposant d'une grande variété de champions jouables et aimant initier les combats pour son équipe, 007x est une terreur pour tous ses adversaires.\n</p>","pl_PL":"<p>Chayut „007x” Suebka zdobył wspaniały pseudonim 00Jayce dzięki swojej wytwornej grze w górnej alei. Jednakże w 2014 roku 007x przeniósł się do dżungli, aby wzmocnić synergię w BKT. Opłaciło się. BKT zajęło 1. miejsce w turniejach 2015 Thailand Pro League Summer, 2015 GPL Summer oraz 2015 International Wildcard Tournament Turkey. \n</p>\n<p>\n007x zachowuje się niczym James Bond za każdym razem, gdy pojawia się na Rift. Często współpracuje ze środkowym Nuttapongiem „G4” Menkasikanem, aby przygotować zasadzki na wrogiego dżunglera lub wywabić wrogiego środkowego na pozycję, która umożliwi gankowanie. Dzięki dużej puli bohaterów oraz uwielbieniu rozpoczynania walk dla swojej drużyny 007x jest postrachem dla wszystkich przeciwników.\n</p>","de_DE":"<p>Chayut „007x“ Suebka erhielt den großartigen Spitznamen 00Jayce wegen seinen charmanten Fähigkeiten auf der Top-Lane. Doch in der Mitte von 2014 wechselte 007x in den Jungle, um die Teamkonstellation zu verbessern – und es klappte! BKT wurde Erster in der Thailand Pro League im Sommer 2015, beim 2015 GPL Summer und dem internationalen Wildcard Turnier diesen Jahres in der Türkei. </p>\n\n<p>007x lässt seinen inneren James Bond zum Vorschein kommen, wenn er auf der Kluft der Beschwörer spielt. Er arbeitet eng mit seinem Mid-Laner Nuttapog „G4“ Menkasikan zusammen, um den gegnerischen Jungler in einen Hinterhalt zu locken oder den Mid-Laner in eine Position zu drängen, die ihn angreifbar von allen Seiten macht. Mit einem breiten Spektrum an Champions und einer Vorliebe für Kampferöffnungen, ist 007x der Schrecken von jedem ihm gegenüberstehenden Gegner. </p>\n","es_ES":"<p>Chayut “007x” Suebka se ganó el genial apodo de 00Jayce debido a sus actuaciones en la calle superior. No obstante, a mediados de 2014, 007x cambió de posición a la jungla para darle un empujón a la sinergia como equipo de BKT. Y mereció la pena. BKT consiguió la primera plaza en la Thailand Pro League Summer 2015, GPL Summer 2015 y el Wildcard Tournament Turkey. </p>\n\n<p>0007x canaliza a su James Bond interior cada vez que aparece por la Grieta. Normalmente trabaja en equipo con su compañero en la calle central Nuttapong “G4” Menkasikan para montar emboscadas contra el jungla enemigo, o llevar al jugador de la calle central rival a una posición desfavorable. Con un amplio abanico de campeones y su preferencia por composiciones que puedan iniciar peleas de equipo, 007x causará terror en cada enemigo al que se enfrente. </p>\n","pt_BR":"<p>Chayut ganhou o apelido de 00Jayce devido a suas atuações dignas de um cavalheiro na rota do topo. No meio da temporada de 2014, porém, 007x mudou-se para a selva com a missão de melhorar a sinergia do time. E a troca deu resultado. Os Titans ficaram em primeiro lugar na etapa de verão da liga tailandesa, na GPL de verão e no International Wildcard 2015 na Turquia.</p> \n<p>\nQuando entra em jogo, ele encarna seu James Bond interior. Trabalha sempre em conjunto com o jogador do meio G4 para fazer emboscadas contra o caçador adversário ou simplesmente tirar da toca o rival da rota do meio para facilitar emboscadas. Ele tem um leque de Campeões muito grande, e gosta muito de iniciar as lutas para o time, atuando sempre de forma agressiva.</p>"},"foreignIds":{"drupalId":"2684","TRLH3":"1001160058","TRLH4":"1001160058"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":843,"slug":"g4","name":"G4","firstName":"Nuttapong","lastName":"Menkasikan","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/g4-861t8d6b.png","hometown":"Thailand","region":"GPL","birthdate":"","createdAt":"2015-09-03T03:13:50.000Z","updatedAt":"2015-09-29T18:10:11.000Z","bios":{"en_US":"<p>Nuttapong “G4” Menkasikan is the shining star of Thai League of Legends. He has consistently achieved success in his League of Legends career, especially with the Bangkok Titans. G4 started playing professionally in 2013 and has won nine out of eleven major Finals he has participated in, seven of which were during his tenure on BKT.\n</p>\n<p>\nG4 isn’t just tagging along for the ride to victory though. He is famous for his impeccable play on assassin champions like Zed and Kassadin, and his thirst for kills is legendary. G4 led the charts at the 2015 International Wildcard Tournament Turkey with the most kills overall, snagging an average of seven kills per game. In short, G4 is the focal point for BKT. His success is their key to victory.\n</p>","fr_FR":"<p>Nuttapong « G4 » est l'étoile au firmament thaïlandais de League of Legends. Il n'a connu que le succès dans sa carrière au sein de League of Legends, notamment avec les Bangkok Titans. G4 a commencé à jouer en professionnel en 2013 et il a remporté neuf des onze principales finales auxquelles il a participé, dont sept sous le blason de BKT.\n</p>\n<p>\nG4 ne se contente pas de rechercher la victoire, cependant. Il est célèbre pour sa maîtrise d'assassins comme Zed et Kassadin et sa soif d'éliminations est légendaire. G4 a mené le classement 2015 de l'International Wildcard Tournament en Turquie avec le plus grand nombre d'éliminations pour une moyenne de sept champions exécutés par partie. En bref, G4 est l'épine dorsale de BKT. Son succès est leur clé pour la victoire.\n</p>","pl_PL":"<p>Nuttapong „G4” Menkasikan jest prawdziwą gwiazdą tajskiego League of Legends. Jego kariera w League of Legends jest pełna sukcesów, szczególnie gdy gra z Bangkok Titans. G4 zaczął grać profesjonalnie w 2013 roku i zwyciężył w 9 z 11 wielkich finałów, w których brał udział, a 7 z nich było w szeregach BKT.\n</p>\n<p>\nJednakże G4 nie załapuje się tylko na darmową przejażdżkę do zwycięstwa. Słynie z doskonałej gry zabójcami, takimi jak Zed czy Kassadin, a o jego żądzy zabijania krążą legendy. Prowadził w rankingu liczby zabójstw turnieju 2015 International Wildcard Tournament Turkey, w którym zdobywał średnio 7 zabójstw w każdym meczu. W skrócie, G4 jest ważnym elementem BKT. Jego sukces jest ich kluczem do zwycięstwa.\n</p>","de_DE":"<p>Nuttapong „G4“ Menkasikan ist der Star der thailändischen League of Legends Szene. Er hat kontinuierliche große Erfolge eingeräumt, ins besonders mit den Bangkok Titans. Im Jahr 2013 startete er seine professionelle Karriere und gewann neun von elf großen Finals, sieben während seiner Laufbahn bei den Titans. </p>\n\n<p>G4 ist jedoch mehr als nur ein Mitläufer des Teams. Er ist berühmt für seine tadellose Leistung mit Assassinen wie Zed oder Kassadin und sein Verlangen nach Eliminierungen ist legendär. G4 lag an der Spitze der Liste des Wildcard Turniers in der Türkei für die meisten Tötungen im ganzen Wettkampf mit einem Durchschnitt von sieben Tötungen pro Spiel. Man kann sagen, G4 ist die Stütze von BKT – sein Erfolg ist der Schlüssel zu ihrem Sieg. </p>\n","es_ES":"<p>Nuttapong ”G4” Menkasikan es la estrella del League of Legends Tailandés. Desde que comenzó, el mid no ha parado de cosechar éxitos en su carrera como jugador de League of Legends, especialmente con Bangkok Titans. La carrera profesional de G4 comenzó en 2013 y, desde entonces, ha ganado nueve de once grandes finales en las que ha participado, siete de ellas durante su estancia en BKT. </p>\n\n<p>Aunque G4 no es sólo un sinónimo de camino hacia la victoria. Es famoso por sus jugadas impecables en asesinos como Zed y Kassadin, y su sed de sangre es legendaria. G4 lideró en el International Wildcard Tournament 2015 con el mayor número total de asesinatos, consiguiendo una media de siete por partido. En resumen, G4 es la pieza clave de BKT. Su éxito es la llave hacia la victoria. </p>\n","pt_BR":"<p>A estrela do League of Legends na Tailândia tem uma carreira de sucesso, principalmente jogando pela Bangkok Titans. Ele começou jogando profissionalmente em 2013, e venceu 9 de 11 campeonatos que disputou, sendo 7 pelo time atual. </p>\n<p>\nG4 é impecável com assassinos como Zed e Kassadin, sempre em busca de abates. No International Wildcard da Turquia em 2015 (segundo semestre), ele conseguiu o maior número de abates em geral, com média de 7 por jogo. Ele é o ponto focal da BKT, e o caminho do time para as vitórias.</p>"},"foreignIds":{"TRLH3":"1001160059","TRLH4":"1001160059","drupalId":"2685"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":844,"slug":"moss","name":"Moss","firstName":"Sorawat","lastName":"Boonphrom","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/moss-5wmzr5kz.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2015-09-03T04:53:03.000Z","updatedAt":"2015-09-29T18:11:46.000Z","bios":{"en_US":"<p>Sorawat ”Moss” Boonphrom is the newest addition to the Bangkok Titans roster. Before joining the squad, he was the team captain of Bangkok Titan’s biggest rival, Team Infinite. Any doubts of Moss’ loyalty to BKT were assuaged during his debut at the 2015 International Wildcard Tournament Turkey. He helped BKT sweep through the tournament with seeming ease, landing a relentless cascade of Thresh hooks.\n</p>\n<p>\nMoss has a penchant for unusual champion picks. He pulled out several niche supports such as Gragas and Kennen at the IWC Turkey, catching his opponents off-guard. If there is one member on BKT with the ability (and desire) to shake up the meta, it’s Moss.\n</p>","fr_FR":"<p>Sorawat « Moss » Boonphrom est le nouveau coéquipier des Bangkok Titans. Avant de rejoindre l'équipe, il était le capitaine du principal rival de Bangkok Titan, Team Infinite. Si quelqu'un avait des doutes sur la loyauté de Moss envers BKT, ils ont été levés lors de ses débuts à l'International Wildcard Tournament 2015 en Turquie. Il a aidé BKT à dominer le tournoi, notamment avec le tournoiement des grappins de son Thresh.\n</p>\n<p>\nMoss a un goût pour les choix de champion inhabituels. Il a travaillé avec divers supports de niche comme Gragas et Kennen à l'IWC en Turquie, prenant ses adversaires par surprise. Si quelqu'un, au sein de l'équipe BKT, a la capacité et la volonté de faire évoluer la meta, c'est bien Moss.\n</p>","pl_PL":"<p>Sorawat „Moss” Boonphrom jest najnowszym dodatkiem do składu Bangkok Titans. Przed dołączeniem do nich był kapitanem największych rywali Bangkok Titans, Team Infinite. Wszelkie wątpliwości co do lojalności Mossa do BKT zniknęły podczas jego debiutu w turnieju 2015 International Wildcard Tournament Turkey. Pomógł BKT przebić się przez turniej bez większych problemów, co chwila doskonale trafiając hakami Thresha.\n</p>\n<p>\nMoss słynie z wybierania nietypowych bohaterów. Podczas IWC Turkey sięgnął po kilku z nich, jak chociażby Gragasa czy Kennena, zupełnie zaskakując swoich przeciwników. Jeżeli jest jakiś członek BKT, który może (i chce) wstrząsnąć metą, to właśnie Moss\n</p>","de_DE":"<p>Sorawat „Moss“ Boonphrom ist der neuste Zuwachs der Bangkok Titans. Bevor er Teil des Teams wurde, war er Kapitän des größten Rivalens von BKT, Team Infinite. Jeder Zweifel, dass Moss BKT nicht loyal ist, wurde während dem Wildcard Turnier beseitigt. Er half seinem Team durch das Turnier mit einer Leichtigkeit, die sich in seinen immer wieder treffenden Todesurteilen von Thresh widerspiegelten. </p>\n\n<p>Moss hat eine Vorliebe für ungewöhnliche Champion Picks. Er zauberte so einige außergewöhnliche Unterstützer, wie beispielsweise Gragas oder Kennen, auf das Spielfeld. Aus der Reserve lockte er damit so einige Bot-Lanes, die dem Ganzen nicht geheuer waren. Wenn es einen Spieler von den Bangkok Titans gibt, der das Zeug hat die Meta aufzumischen, dann ist es Moss. </p>\n","es_ES":"<p>Sorawat ”Moss” Boonphrom ha sido la última incorporación a la plantilla de Bangkok Titans. Antes de unirse al equipo, era capitán de Team Infinite, el mayor rival de Bangkok Titans. Aunque cualquier duda de la implicación de Moss con el equipo se disipó cuando, en su debut, contribuyó para conseguir la clasificación para el Campeonato Mundial mediante el International Wildcard Tournament 2015. Ayudó al equipo a arrasar en el campeonato con aparente facilidad, en gran parte debido a su precisión con Thresh y Sentencia de Muerte. </p>\n\n<p>Moss tiene inclinación por jugar campeones diferentes. En la IWC Turkey ha jugado unos cuantos supports inusuales como Gragas o Kennen, pillando a sus enemigos desprevenidos. Si hay un miembro de BKT con la suficiente habilidad (y ganas) para darle la vuelta al metajuego, ese es Moss. </p>\n","pt_BR":"<p>Antes de entrar para a BKT em 2015, Moss era simplesmente o capitão da maior rival, Team Infinite. Dúvidas sobre a sua lealdade logo caíram durante o International Wildcard 2015 na Turquia, quando ele ajudou o time a passar com facilidade pelos rivais, usando com sabedoria seus ganchos de Thresh. \n</p>\n<p>\nMoss gosta de usar Campeões incomuns. No IWC, ele foi visto usando Gragas e Kennen para surpreender os adversários. Se existe alguém na BKT capaz de balançar o meta, esse alguém é Moss.</p>"},"foreignIds":{"TRLH3":"1001160061","TRLH4":"1001160061","drupalId":"4907"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":846,"slug":"qaizer","name":"QaiZer","firstName":"Nuttapong","lastName":"Dechtanon","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/qaizer-9mecqset.png","hometown":"Thailand","region":"GPL","birthdate":null,"createdAt":"2015-09-04T23:54:24.000Z","updatedAt":"2015-09-29T18:11:47.000Z","bios":{"en_US":"<p>Nuttapong “QaiZer” Dechtanon is a substitute top laner for the Bangkok Titans. While he is a relatively new addition to the squad, he brings a wealth of experience in multiple roles to BKT.</p>","fr_FR":"<p>\nNuttapong « QaiZer » Dechtanon est le top laner remplaçant de Bangkok Titans. Bien qu'assez nouveau dans l'équipe, il a emmagasiné beaucoup d'expérience à de multiples positions au sein de l'équipe BKT.\n</p>","es_ES":"<p>\nNuttapong ''QaiZer'' Dechtanon es el suplente de Bangkok Titans para la calle superior. Aunque es relativamente nuevo en el puesto, ha aportado gran experiencia a BKT en diferentes roles.\n</p>","pl_PL":"<p>\nNuttapong „QaiZer” Dechtanon jest rezerwowym zawodnikiem w górnej alei z drużyny Bangkok Titans. Choć jest on nowym nabytkiem w drużynie, jest w stanie zaoferować jej bardzo wiele ze względu na swe bogate doświadczenia.\n</p>","de_DE":"<p>\nNuttapong „QaiZer“ Dechtanon ist Ersatz-Toplaner bei den Bangkok Titans. Er ist zwar noch relativ neu in der Mannschaft, aber er bringt sich mit jeder Menge Erfahrung in verschiedenen Rollen bei BKT ein. \n</p>","pt_BR":"<p>Apesar de ser novo no time, QaiZer é um jogador substituto que traz muita experiência em diversas rotas, principalmente no topo, como reserva de WarL0cK.</p>"},"foreignIds":{"TRLH3":"1001160062","TRLH4":"1001160062"},"socialNetworks":{},"champions":[],"liveGameTeam":2},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33}],"scheduleItems":[{"id":"AU_di2gZJTrHluSI14F1","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:78471ed4-b756-46fc-a18e-694676be4f2e","scheduledTime":"2015-10-03T13:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"3","subBlockLabel":"paris - W1D3","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:f6c0af3f-85e7-4de6-b064-ee9a0558d668"},"match":"78471ed4-b756-46fc-a18e-694676be4f2e","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"f6c0af3f-85e7-4de6-b064-ee9a0558d668","league":"9"}],"gameIdMappings":[{"id":"eba0f878-f495-4df9-a6a6-18f19e345cb3","gameHash":"1d324001eb90cccd"}],"videos":[{"id":56,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:eba0f878-f495-4df9-a6a6-18f19e345cb3","source":"https://www.youtube.com/embed/ZEt3mERvhOM?wmode=transparent","createdAt":"2015-10-03T15:26:00.000Z","updatedAt":"2015-10-03T16:41:08.000Z","game":"eba0f878-f495-4df9-a6a6-18f19e345cb3"},{"id":57,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:eba0f878-f495-4df9-a6a6-18f19e345cb3","source":"https://www.youtube.com/embed/QM9fiG-Yv_I?wmode=transparent","createdAt":"2015-10-03T15:26:09.000Z","updatedAt":"2015-10-03T15:26:09.000Z","game":"eba0f878-f495-4df9-a6a6-18f19e345cb3"},{"id":69,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:eba0f878-f495-4df9-a6a6-18f19e345cb3","source":"https://www.youtube.com/embed/6aTQqC1pPQk?wmode=transparent","createdAt":"2015-10-04T11:53:50.000Z","updatedAt":"2015-10-04T11:53:50.000Z","game":"eba0f878-f495-4df9-a6a6-18f19e345cb3"},{"id":70,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:eba0f878-f495-4df9-a6a6-18f19e345cb3","source":"https://www.youtube.com/embed/C6FJfx3T98U?wmode=transparent","createdAt":"2015-10-04T11:53:59.000Z","updatedAt":"2015-10-04T11:53:59.000Z","game":"eba0f878-f495-4df9-a6a6-18f19e345cb3"}],"htmlBlocks":[],"match":{"id":"78471ed4-b756-46fc-a18e-694676be4f2e","name":"H2K-vs-BKT","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"},{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}],"games":{"eba0f878-f495-4df9-a6a6-18f19e345cb3":{"id":"eba0f878-f495-4df9-a6a6-18f19e345cb3","name":"G1","generatedName":"BKT|H2K|G1|78471ed4b75646fca18","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"},{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}],"standings":{"result":[[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}],[{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}]],"timestamp":1443881684285,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380375","gameRealm":"TRLH3","platformId":"TRLH3:1001380375","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}],[{"roster":"b0598a21-e7d7-4b10-b8ad-2e12abe0be14"}]],"timestamp":1443881684285,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"d228ed48-cad9-4f6d-8973-2bef614fa96a":1,"b0598a21-e7d7-4b10-b8ad-2e12abe0be14":0}}}