{"teams":[{"id":90,"slug":"jin-air-green-wings","name":"Jin Air GreenWings","guid":"be6e116b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/jin-air-green-wings-2m0c2a5n.png","acronym":"JAG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-02-28T19:33:51.000Z","bios":{"en_US":"<p>Jin Air GreenWings are one of the most methodical teams in the LCK. They focus heavily on slowly scaling into late-game advantages, frequently using Baron buffs or stacked Drakes to secure victory. A combination of farm-heavy lanes and champions who excel at poke and disengage make sure Jin Air don’t get knocked out before they can reach their late-game potential.</p>","fr_FR":"Jin Air Green Wings est l'une des équipes les plus méthodiques des LCK. Ils concentrent leurs efforts principalement sur l'acquisition et le cumul d'avantages pour les fins de parties, ayant fréquemment recours au buff du Baron ou à celui des cinq dragons pour assurer la victoire. L'association d'un farm conséquent sur les voies et de champions qui excellent dans l'art du poke tout en étant capables d'endiguer les initiations de combats ennemies permettent à l'équipe Jin Air de survivre jusqu'en fin de partie pour exploiter le potentiel accumulé.","pl_PL":"Jin Air Green Wings to jedna z najbardziej metodycznych drużyn w LCK. Skupiają się na zdobyciu przewagi w późniejszej fazie gry, często zdobywając Barona lub pięć ładunków Smoka, aby zapewnić sobie wygraną. Połączenie bohaterów skupiających się na farmieniu i tych, którzy dobrze nękają, sprawia, że Jin Air nie przegra przed osiągnięciem przewagi w późniejszym etapie meczu.","ko_KR":"<p>Jin Air Green Wings는 LCK에서 가장 꼼꼼하게 경기를 풀어가는 팀입니다. 느린 템포로 경기를 풀어가며 천천히 승기를 잡아 경기 후반에 우위를 점하는 식으로 플레이하죠. 그 과정에서 바론 버프와 드래곤 5 중첩을 이용해 승리를 쟁취하는 모습을 자주 보여줍니다. 파밍에 치중하는 라인전과 뛰어난 포킹 및 도주 기술을 지닌 챔피언을 조합해 경기 후반 잠재력을 발휘할 수 있을 때까지 경기를 끌고 가는 것이죠.</p>"},"foreignIds":{"drupalId":"998"},"players":[583,599,762,1042,1261,1686,1687],"starters":[583,599,762,1686,1687],"subs":[1042,1261]},{"id":94,"slug":"longzhu-incredible-miracle","name":"Longzhu Gaming","guid":"be6e1699-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/longzhu-incredible-miracle-2xpijv2d.png","acronym":"LZ","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-26T23:53:11.000Z","bios":{"en_US":"<p>Longzhu Gaming is looking to take the next step in 2017. Formerly Incredible Miracle, Longzhu Gaming failed to mesh in 2016 despite signing many high-profile free agents. While the team avoided relegations, Longzhu missed out on the playoffs in both the spring and summer. With a strong new bot lane duo, Longzhu hopes to earn a spot in the playoffs and more in 2017.</p>"},"foreignIds":{"drupalId":"889"},"players":[313,770,1027,1041,1905,1906,1907,1908,1909],"starters":[313,770,1027,1906,1907],"subs":[1041,1905,1908,1909]}],"players":[{"id":313,"slug":"gorilla","name":"Gorilla","firstName":"Beomhyun","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gorilla-44p51bn8.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-09-16T21:53:45.000Z","updatedAt":"2017-05-31T00:39:21.000Z","bios":{"en_US":"<p>\nBeomhyun \"Gorilla\" Kang rose over the years to become one of the best supports in Korea. Known for his Thresh and Janna plays, Gorilla is a master of manipulating the battlefield through vision and careful engagement. From saving Pray when he plays too aggressively to picking off opponents with hooks and stuns, Gorilla has played a key role in ROX's rise in the LCK standings.\n</p>\n<p>\nEven though Gorilla secured his first LCK trophy in the 2016 LCK Summer Split, he often found himself in the wrong places at the wrong times. For a player as storied as Gorilla, these types of mistakes were something nobody expected to see. After heartbreak at the 2016 World Championship, Gorilla will take his talents to Longzhu Gaming in 2017 and try another shot at a Worlds title.\n</p>","fr_FR":"<p>Beom-Hyeon « Gorilla » Kang est devenu au fil des ans un des meilleurs supports de Corée. Connu pour sa virtuosité avec Thresh et Janna, Gorilla sait comme personne manipuler le champ de bataille grâce a sa maîtrise de la vision et des engagements raisonnés. Sauvant PraY quand il joue trop agressivement ou s'abattant sur l'ennemi avec des grappins ou des étourdissements, Gorilla a joué un rôle clé dans l'ascension de KOO au sein des LCK.\n</p>\n<p>\nEn gros, si vous vous considérez comme le digne héritier des carrys AD enflammés façon WildTurtle, n'oubliez pas de recruter Gorilla pour vous sortir du pétrin. Aidez-nous, Beom-Hyeon Gorilla. Vous êtes notre seul espoir.\n</p>","pl_PL":"<p>Przez lata Beom-Hyeon „Gorilla” Kang zdobył pozycję jednego z najlepszych graczy w Korei. Znany z doskonałej gry Threshem i Janną, jest prawdziwym mistrzem manipulacji na polu walki za sprawą skutecznego wykorzystania wizji i niezwykłej ostrożności. Gorilla pomógł KOO zdobyć sukces w ramach LCK – a to ratował PraYa, gdy ten grał zbyt agresywnie, a to załatwiał przeciwników, posługując się hakami i ogłuszeniem.\n</p>\n<p>\nJeśli uznajesz się za duchowego spadkobiercę żywiołowego stylu gry WildTurtle'a, postaraj się mieć gdzieś pod ręką Gorillę, żeby w razie czego ocalił ci skórę. Pomóż nam, Beom-Hyeon Gorilla. Jesteś naszą jedyną nadzieją.\n</p>","de_DE":"<p>Beom-hyeon „GorillA“ Kang entwickelte sich über die Jahre zu einem der besten Supporter Koreas. GorillA, der vor allem für seine Spielzüge mit Thresh und Janna bekannt ist, ist ein Meister in Sachen Übersicht auf dem Schlachtfeld und wenn es um vorsichtiges Initiieren geht. GorillA rettete PraY, wenn dieser zu aggressiv spielte, oder schnappte sich Gegner mit gezielten Einsätzen seines Hakens oder Betäubungen und spielte somit eine Schlüsselrolle bei ROX’ Aufstieg in der LCK.</p>\n\n<p>Obwohl sich GorillA beim Sommer-Split der LCK 2016 seinen ersten Titel sichern konnte, war er oft zur falschen Zeit am falschen Ort. Niemand hatte erwartet, dass ein so guter Spieler wie GorillA solche Fehler machen würde. Während die Weltmeisterschaft 2016 näher rückt, muss GorillA wieder zu seiner alten Hochform zurückfinden, wenn er dieses Jahr mit einer letzten – und wichtigsten – Trophäe krönen will.</p>","es_ES":"<p>Beom-Hyeon ''GorillA'' Kang se ha convertido en uno de los mejores apoyos en Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro de la manipulación del campo de batalla gracias a la visión y a su cautela al iniciar combates. El papel de GorillA ha sido clave en el ascenso de ROX en la LCK, desde salvar a PraY cuando es demasiado agresivo hasta aislar oponentes con ganchos y aturdimientos.</p>\n\n<p>Aunque GorillA se aseguró su primer trofeo de la LCK en el split de verano de 2016, con demasiada frecuencia estaba en el lugar equivocado en el momento equivocado. Ese tipo de errores son algo que no se espera de jugadores con tanta experiencia como GorillA. Conforme se acerca el Campeonato Mundial 2016, GorillA tendrá que mejorar sus jugadas y volver a adaptarlas a sus habituales estándares astronómicamente altos si quiere llegar este año a la final y, lo que es más importante, llevarse el trofeo.</p>","pt_BR":"<p>Beom-hyeon \"Gorilla\" Kang cresceu bastante nesses últimos anos até se tornar um dos melhores suportes da Coreia. Conhecido por suas jogadas com Thresh e Janna, Gorilla é um mestre em manipular o campo de batalha através de visão e confrontos bem pensados. Desde salvar a PraY quando ele joga agressivo demais a apanhar seus adversários com correntes e atordoamentos, Gorilla teve um papel essencial na ascensão da ROX no cenário da LCK.</p>\n\n<p>Apesar de Gorilla ter conseguido garantir seu primeiro troféu da LCK na Etapa de Verão da LCK 2016, ele frequentemente se encontra nos lugares errados e nas horas erradas. Para um jogador tão experiente como Gorilla, esses tipos de erros são coisas que ninguém espera ver. Conforme o Campeonato Mundial 2016 se aproxima, Gorilla terá que calibrar suas jogadas de volta a seus padrões astronomicamente altos se quiser fechar este ano com o mais importante troféu de todos.</p>","es_AR":"<p>Beom-hyeon «GorillA\" Kang fue creciendo con los años hasta llegar a convertirse en uno de los mejores soportes de Corea. Conocido por sus jugadas con Thresh y Janna, GorillA es un maestro a la hora de manipular el campo de batalla gracias a su visión y su cuidadoso estilo de combate. Pasa de salvar a PraY cuando se torna demasiado agresivo a aniquilar a sus rivales con ganchos y aturdimientos, por lo que su rol fue clave para el ascenso de posiciones de ROX en la clasificación de la LCK.</p>\n\n<p>Aunque GorillA se garantizó su primer trofeo de LCK en el torneo de clausura de la LCK 2016, varias veces se ha visto en el lugar equivocado en los momentos más inoportunos. Para un jugador con la historia de GorillA, estos tipos de errores fueron algo que nadie esperaba ver. Con el Campeonato Mundial 2016 aproximándose, GorillA deberá llevar su juego de vuelta a los niveles astronómicamente altos para poder coronar su año con el último (y más importante) trofeo.</p>"},"foreignIds":{"drupalId":"894","ESPORTSTMNT06":"200000372"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":583,"slug":"snowflower","name":"SnowFlower","firstName":"Hoeijong","lastName":"Noh","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/snowflower-cbxe8725.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:40:55.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4335","ESPORTSTMNT06":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":599,"slug":"ikssu","name":"ikssu","firstName":"Ik-su","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ikssu-hnpzq48.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-02-09T01:12:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4388","ESPORTSTMNT06":"200000436"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":762,"slug":"kuzan","name":"Kuzan","firstName":"Seonghyuk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kuzan-f46tmtun.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-31T00:35:12.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4386","ESPORTSTMNT06":"200000360"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":770,"slug":"pray","name":"Pray","firstName":"Jong In","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pray-dqs5qv2u.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-06-08T17:30:10.000Z","bios":{"en_US":"<p>Jong In \"Pray\" Kim is considered one of the best AD carries in Korea. Pray initially signed with Najin Black Sword in 2012, and he led the team to 1st place in the 2012-2013 OGN Champions Winter competition. Known for his Ezreal and Twitch mechanics, Pray demonstrated just how effective an aggressive AD carry could be in the Korean meta (hint: it was really effective).</p>\n\n\n<p>After a short personal break in 2014, Pray returned to esports when he joined the newly created ROX Tigers (previously KOO Tigers). His impact was immediate as the team rocketed to the 2015 World Championship Finals in their first year of existence. PraY and ROX followed that effort up with a second place finish in the 2016 LCK Spring Split and soon after in the 2016 LCK Summer Split, PraY took home his first LCK trophy. After finally finding domestic success, Pray found himself facing off with SK Telecom T1 at Worlds, and based on history, you can guess how that went. He’ll attempt to put another bitter loss to SKT behind him with a new team in 2017.</p>","fr_FR":"<p>Jong-in « PraY » Kim est considéré comme l'un des meilleurs carrys AD de Corée. À l'origine, PraY a signé avec NaJin Black Sword en 2012 et a conduit son équipe à la première place lors du tournoi OGN Champions Winter 2012-2013. Connu pour sa maîtrise d'Ezreal et de Twitch, PraY a démontré à quel point un carry AD agressif pouvait être efficace dans la méta coréenne. (spoiler : à un très haut point)</p>\n\n<p>Après une courte pause personnelle en 2014, PraY est revenu sur la scène e-sport lorsqu'il a rejoint l'équipe toute jeune des ROX Tigers (anciennement KOO Tigers). Son impact a été immédiat : l'équipe s'est propulsée vers la finale du Championnat du monde 2015 l'année même où il a été créé. PraY et ROX ont poursuivi leurs efforts pour décrocher la seconde place dans le segment de printemps des LCK 2016 et juste après dans le segment d'été de la même année, PraY a remporté son premier trophée LCK. Après avoir enfin rencontré le succès à domicile, PraY s'est retrouvé face à SK Telecom T1 lors du Mondial et, au vu des antécédents, l'issue n'est pas difficile de deviner. Il essaiera de laisser derrière lui une autre défaite amère face à SKT en réalisant de bonnes performances lors de l'événement All-Stars 2016.</p>","pl_PL":"Jong In „PraY” Kim uważany jest za jednego z najlepszych prowadzących w Korei. PraY początkowo dołączył do Najin Black Sword w 2012 roku i doprowadził drużynę do pierwszego miejsca na zawodach OGN Champions Winter 2012-2013. Znany ze świetnej gry Ezrealem i Twitchem PraY zademonstrował, jak skuteczny może być agresywny prowadzący w koreańskiej rzeczywistości (podpowiedź: był bardzo skuteczny).</p>\n\nPo krótkiej przerwie w 2014, wymuszonej sytuacją osobistą, PraY wrócił do e-sportu, dołączając do właśnie utworzonych ROX Tigers (dawniej KOO Tigers). Jego wpływ stał się widoczny natychmiast i drużyna pomknęła do finału Mistrzostw Świata 2015 w pierwszym roku swojego istnienia. Po tym osiągnięciu PraY i ROX zajęli drugie miejsce podczas wiosennego splitu LCK 2016. Wkrótce później, po letnim splicie 2016, PraY zabrał do domu swoje pierwsze trofeum LCK. Gdy wreszcie odniósł sukces lokalny, PraY stanął twarzą w twarz z SK Telecom T1 na Mistrzostwach, a znając ich ostateczne wyniki, można się domyślić, jak to się skończyło. Z pewnością spróbuje zatrzeć wspomnienie kolejnej gorzkiej porażki z SKT słodkim smakiem sukcesu podczas wydarzenia All-Star 2016.\n","de_DE":"<p>Jong-in „PraY“ Kim gilt als einer der besten AD-Carrys Koreas. PraY unterschrieb 2012 bei Najin Black Sword und führte die Mannschaft in den Jahren 2012 und 2013 zum Titel des „OGN Champions Winter“-Turniers. PraY ist für seine Fähigkeiten mit Ezreal und Twitch bekannt und hat allen gezeigt, wie effektiv ein aggressiver AD-Carry im koreanischen Metaspiel sein kann (kleiner Tipp: Er war wirklich effektiv).</p>\n\n<p>Nach einer kurzen persönlichen Auszeit kehrte PraY 2014 in die E-Sport-Szene zurück und wechselte zu den neu gegründeten ROX Tigers (ehemals KOO Tigers). Sein Einfluss war sofort spürbar, als die Mannschaft gleich in ihrem ersten Jahr das Finale der Weltmeisterschaft 2015 erreichte. PraY und ROX legten mit einem zweiten Platz beim Frühjahrs-Split der LCK 2016 nach, bevor sie beim Sommer-Split der LCK 2016 ihre erste Trophäe in der LCK mit nach Hause nehmen konnten. Nach diesem heimischen Erfolg traf PraY bei der Weltmeisterschaft auf SK Telecom T1 und der Rest ist Geschichte. Er wird versuchen, auch diese knappe Niederlage gegen SKT wegzustecken und beim All-Stars-Event 2016 eine ansprechende Leistung abzuliefern.</p>","es_ES":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores AD carry de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un AD carry agresivo en el metajuego coreano (creednos, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el split de primavera de la LCK 2016 y, poco después, en el split de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","pt_BR":"<p>Jong-in \"PraY\" Kim é considerado um dos melhores atiradores da Coreia. PraY a princípio assinou um contrato com a NaJin Black Sword in 2012 e levou a equipe ao 1º lugar na competição de Inverno da OGN Champions 2012-2013. Conhecido por suas habilidades com Ezreal e Twitch, PraY demonstrou o quão eficiente um atirador agressivo pode ser no meta coreano (tipo, muito eficiente).</p>\n\n<p>Depois de um descanso por motivos pessoais em 2014, PraY fez sua volta ao e-Sports quando entrou para a recém-formada ROX Tigers (antiga KOO/GE Tigers). Seu impacto foi imediato e sua equipe foi parar direto nas Finais do Campeonato Mundial 2015 logo em seu primeiro ano de existência. PraY e ROX continuaram com seus esforços e alcançaram o segundo lugar na Etapa de Primavera da LCK 2016, fazendo também a mesma façanha na Etapa de Verão, onde PraY levou para casa seu primeiro troféu da LCK. Após finalmente encontrar sucesso em casa, PraY enfrentou a SK Telecom T1 no Mundial e, bem, vocês sabem o que aconteceu. Ele tentará colocar outra derrota contra a SKT no passado e desempenhar bem no Evento All-Star 2016.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"PraY\" 김종인은 한국 최고의 원거리 딜러 중 하나로 여겨집니다. PraY는 맨 처음 2012년 Najin Black Sword와 계약했고 2012-2013 OGN 챔피언스 윈터 시즌에서 팀을 1위로 이끌었습니다. 이즈리얼, 트위치로 유명한 PraY는 공격적인 원거리 딜러가 한국 메타에서 얼마나 효과적인지 보여줬죠. </p>\n<p style=”font-family:”나눔고딕”;\">2014년 잠시 개인적으로 휴식을 취한 PraY는 e스포츠로 돌아와 새롭게 만들어진 팀 KOO Tigers (구 GE Tigers)에 합류했습니다. 그의 영향력은 즉시 나타났습니다. KOO Tigers가 창단 첫해에 2015 월드 챔피언십 결승전까지 진출했거든요. PraY와 KOO Tigers는 비록 결승전에서 SKT를 물리치진 못했지만 월드 챔피언십에서 보여준 PraY의 놀라운 경기력은 유럽 관중들에게 깊은 인상을 남겼습니다. </p>\n","es_AR":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>","cs_CZ":"<p>Jong In „PraY“ Kim je považován za jednoho z nejlepších korejských ADC. Nejprve roku 2012 nastoupil do týmu Najin Black Sword a dotáhl jej na 1. místo soutěže OGN Champions Winter 2012–2013. PraY, proslulý především svou úžasnou herní technikou za Ezreala a Twitche, názorně předvedl, jak efektivní může být agresivní ADC v korejské metě (tzn. nesmírně efektivní).</p>\n\n<p>Po krátké pauze, kterou si z osobních důvodů udělal v roce 2014, se PraY k esportům vrátil a podepsal smlouvu s nově vytvořeným celkem ROX Tigers (dříve KOO Tigers). Jeho vliv se projevil prakticky okamžitě a hned během prvního roku katapultoval tým až do finále mistrovství světa 2015. PraY a ROX na tento úspěch navázali druhým místem v jarním splitu LCK 2016 a krátce poté, v letním splitu LCK 2016, získal PraY svou první ligovou trofej. Když se mu konečně začalo dařit na domácí scéně, čekal jej na MS boj s SK Telecom T1, a všichni víme, jak to dopadlo. Nyní se pokusí vzpomínky na hořkou prohru s SKT zahnat špičkovým výkonem na turnaji All-Star 2016.</p>","el_GR":"<p>Ο Jong In \"PraY\" Kim θεωρείται ένας από τους καλύτερους AD Carry στην Κορέα. Η πρώτη ομάδα του PraY ήταν οι Najin Black Sword το 2012, οι οποίοι με τη βοήθειά του κατάφεραν να πάρουν την 1η θέση στη διοργάνωση OGN Champions Winter 2012-2013. Γνωστός για τον άριστο χειρισμό του Έζρεαλ και του Τουίτς, ο PraY έδειξε στην κορεατική σκηνή πόσο αποτελεσματικός μπορεί να γίνει ένας επιθετικός AD Carry (πάρα πολύ αποτελεσματικός, όπως αποδείχτηκε).</p>\n\n<p>Μετά από ένα μικρό διάλειμμα για προσωπικούς λόγους το 2014, ο PraY επέστρεψε στα esports με μια νέα τότε ομάδα, τους ROX Tigers (προηγουμένως KOO Tigers). Έκανε αμέσως αισθητή την παρουσία του, καθώς η ομάδα εκτοξεύτηκε στον Τελικό Παγκοσμίου Πρωταθλήματος 2015 τον πρώτο χρόνο της σταδιοδρομίας τους. Ο PraY και οι ROX συνέχισαν εξίσου καλά, παίρνοντας τη δεύτερη θέση στο Spring Split 2016 του LCK και λίγο μετά, στο Summer Split 2016 του LCK, ο PraY κέρδισε το πρώτο του τρόπαιο στο LCK. Αφού κατάφερε να φτάσει επιτέλους στην κορυφή εντός των συνόρων, ο PraY βρέθηκε λίγο μετά να μάχεται με τους SK Telecom T1 στο Παγκόσμιο Πρωτάθλημα και τα υπόλοιπα τα γνωρίζετε. Είναι βέβαιο ότι θα προσπαθήσει να ξεπεράσει άλλη μια πικρή ήττα από τους SKT με μια δυνατή εμφάνιση στο Τουρνουά All-Star 2016.</p>","hu_HU":"Jong In „PraY” Kim Korea egyik legjobb lövészének számít. PraY 2012-ben a Najin Black Swordhoz igazolt, és az OGN Champions 2012-2013-as téli szakaszában győzelemre is vezette csapatát. Ezreallal és Twitchcsel félelmetesen játszik, és bizonyította, hogy milyen hatékony lehet egy agresszív lövész a koreai metajátékban (nagyon).</p>\n\nPraY magánéleti okokból rövid pihenőt tartott 2014-ben, és az újonnan alakított ROX Tigers (akkoriban KOO Tigers) kötelékében tért vissza az e-sportba. Jelentős hatása volt a csapat eredményeire, és már az első teljes évükben a 2015-ös világbajnokság döntőjéig jutottak. PraY és a ROX a lendületüket megőrizve másodikok lettek az LCK 2016-os tavaszi szakaszában, a nyári szakaszban pedig PraY megnyerte első LCK-s bajnoki címét. A hazai sikerek után az SK Telecom T1 lett a vesztük a vb-n, csakúgy, mint az előző évben. Az SKT-től elszenvedett újabb kellemetlen vereséget a 2016-os All-Star gálán próbálja majd feledni.\n","it_IT":"Jong In \"PraY\" Kim è considerato uno dei migliori ADC di tutta la Corea. PraY ha iniziato la sua carriera nei NaJin Black Sword nel 2012, e ha condotto alla vittoria la sua squadra nel Champions Winter OGN 2012-2013. Famoso per le sue giocate con Ezreal e Twitch, PraY ha dimostrato quanto può essere efficace un AD carry aggressivo all'interno del meta coreano (spoiler: è MOLTO efficace).</p>\n\nDopo una breve pausa per motivi personali nel 2014, PraY è tornato nel mondo degli eSport unendosi ai novellini ROX Tigers (ex KOO Tigers). Il suo impatto fu immediato e il team raggiunse la finale dei Mondiali 2015 al suo primo anno d'età. PraY e i ROX proseguirono la striscia positiva con un secondo posto allo Spring Split LCK 2016 e poi al Summer Split, dove PraY ha portato a casa il suo primo trofeo LCK. Dopo aver agguantato il successo in casa, PraY ha dovuto affrontare gli SKT ai Mondiali, e il resto è storia. All'All-Star cercherà di lasciarsi alle spalle l'amara sconfitta deliziandoci con una prestazione degna del suo nome.\n","ro_RO":"Jong In ''PraY'' Kim este privit ca unul dintre cei mai buni jucători ADC din Coreea. PraY și-a început cariera în 2012, alături de Najin Black Sword, conducându-și echipa către primul loc în competiția OGN Champions Winter 2012-2013. Cunoscut în principal pentru mecanicile sale de joc cu Ezreal și Twitch, PraY a demonstrat cât de eficient poate fi un ADC agresiv în meta-ul coreean (mai exact: extrem de eficient).</p>\n\nDupă o scurtă pauză din motive personale în 2014, PraY s-a întors la eSports, alăturându-se echipei ROX Tigers (cunoscuți anterior drept KOO Tigers), care de-abia fusese creată. Impactul lui a fost vizibil instantaneu, iar echipa a ajuns în finala Campionatului Mondial 2015 în primul an după ce a fost fondată. PraY și ROX au mers înainte cu aceeași hotărâre și au terminat pe locul al doilea în etapa de primăvară a LCK 2016 și, la scurtă vreme după aceea, PraY a luat acasă primul trofeu LCK în etapa de vară din 2016 a competiției. După ce a obținut în sfârșit succesul pe plan local, PraY a întâlnit SK Telecom T1 la Mondiale. Istoria și-a spus cuvântul și puteți ghici ce s-a întâmplat. Va încerca să treacă iar peste înfrângerea amară împotriva celor de la SKT printr-o victorie dulce la All-Star Event 2016.\n","es_MX":"<p>Muchos consideran a Jon In \"PraY\" Kim uno de los mejores tiradores de Corea. PraY comenzó con NaJin Black Sword en 2012 y consiguió el primer puesto en la competición OGN Champions Winter de 2012-2013. Conocido por su destreza con Ezreal y Twitch, PraY demostró hasta qué punto puede ser efectivo un tirador agresivo en el metajuego coreano (en serio, fue muy efectivo).</p>\n\n<p>Tras una breve pausa personal en 2014, PraY regresó a los esports junto al recién formado ROX Tigers (anteriormente conocido como KOO Tigers). Su impacto se notó de inmediato y el equipo ascendió como la espuma durante su primer año hasta la final del Campeonato Mundial 2015. PraY y ROX continuaron sus esfuerzos hasta conseguir un segundo puesto en el torneo de primavera de la LCK 2016 y, poco después, en el de verano, PraY se llevaría a casa su primer trofeo de la LCK. Tras conseguir destacar en su región, a PraY le tocó enfrentarse a SK Telecom T1 en el Mundial y, si nos basamos en experiencias anteriores, es fácil deducir lo que ocurrió. Intentará olvidar otra amarga derrota contra SKT con una actuación increíble en el All-Star Event 2016.</p>"},"foreignIds":{"drupalId":"369","ESPORTSTMNT06":"200000371"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1027,"slug":"bdd","name":"BDD","firstName":"Bo-sung","lastName":"Kwak","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bdd-gqyzlus1.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:55.000Z","updatedAt":"2017-05-31T00:45:54.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000370"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1041,"slug":"zzus","name":"Zzus","firstName":"Jun-su","lastName":"Jang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zzus-in7b4s5r.png","hometown":"South Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:08:13.000Z","updatedAt":"2017-05-31T00:45:11.000Z","bios":{},"foreignIds":{"TRKR1":"225061"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1042,"slug":"sohwan","name":"SoHwan","firstName":"Jun-yeong","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sohwan-73kaxrw7.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:12:01.000Z","updatedAt":"2017-05-31T00:35:44.000Z","bios":{},"foreignIds":{"TRKR1":"225134"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":1261,"slug":"raise","name":"Raise","firstName":"Ji-hwan","lastName":"Oh","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/raise-3exkvfey.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-18T16:06:09.000Z","updatedAt":"2017-05-31T00:35:23.000Z","bios":{"en_US":"<p>\nJi-hwan “Raise” Oh launched his career in Korea, playing for Stardust in the Challengers Korea 2016 Spring Split. After his team failed to make the jump to Champions Korea, he and fellow teammate Sang-won “Parang” Lee decided to make the jump to Europe to play for ROCCAT as part a revamped lineup for the Summer Split.\n</p>\n<p>\nRaise is known for playing tanky, initiation-heavy supports that allow him to dictate when and how team fights happen. He'll be looking to get those fights started in the LCK for 2017 on the Jin Air GreenWings.\n</p>","de_DE":"<p>Ji-hwan \"Raise\" Oh aus Korea ist der neue Support für ROCCAT. Er wurde zusammen mit seinem Teamkollegen  Sang-won \"Parang\" Lee in der koreanischen Challenger Series entdeckt und nach Europa importiert. Mit dem Team Stardust erzielten sie einen dritten Platz während des Splits, konnte sich in den Playoffs aber nicht behaupten. Raise war der Shotcaller und der positive Geist in seinem alten Team. Von insgesamt 33 Spielen wählte der Support rund 15 Mal den Minotaurus Alistar. Von der Gewinnrate ist Raise allerdings mit Thresh am erfolgreichsten: sie liegt bei 80%. Im Gegensatz zu anderen Supports greift der Koreaner eher auf die kraftvollen Tanks zurück, wie Alistar, Trundle oder Shen, und spielte keinen einzigen Supportmagier im letzten Split. Doch nach eigener Aussage spielt er gerne Karma oder Lux, sodass es nur noch eine Frage der Zeit ist, bis man Raise eine magische Unterstützung herzaubern wird.</p>","pl_PL":"<p>Oh \"Raise\" Ji-hwan pojawił się w świecie esportu na początku 2016 roku. Został przyjęty jako wspierający do drużyny Stardust w swoim ojczystym kraju – Korei Południowej. Od 18 stycznia 2016 roku brał udział w wiosennym sezonie Challengers Korea. Tam konkurował o szansę na kwalifikację do LCK, pierwszej w Korei i renomowanej na świecie ligi. Podczas regularnego sezonu swoją grą osiągnął trzecie miejsce na podium, zapewnione przez wynik 17 wygranych i 11 porażek. Tak wysoka pozycja dała mu szansę na zawalczenie w rozgrywkach barażowych o kwalifikację do LCK. Niestety marzenia o prestiżowym awansie zostały rozwiane już w pierwszym spotkaniu baraży - poniósł porażkę w starciu z Ever8 Winners. Poziom pojedynku zachwycał wyrównaniem, o czym świadczy wynik 3 do 2. „Raise” w tych meczach był wzorowym wspierającym, w szczególności kiedy grał Alistarem, lecz jego szanse na kwalifikacje zostały przekreślone. 10 maja 2016 roku doszło do przełomu w życiu młodego Koreańczyka. Wraz z górnym ze swojej drużyny został przyjęty do europejskiego zespołu Team ROCCAT. Przeprowadzka przyniosła mu ze sobą wiele wyzwań, jednym z najpoważniejszych była bariera językowa. Nowa organizacja Oha szybko się wypowiedziała na ten temat, zapewniając, że pod względem komunikacji w grze z nowymi graczami nie ma żadnych problemów. Dodatkowo zostały zorganizowane zajęcia z angielskiego dla debiutantów z Korei, na których ci doskonale sobie radzą.</p>\n<p>Oh przyznaje, że nie spędził dużo czasu, wybierając swój pseudonim. Szukał czegoś, co będzie miało pozytywny wydźwięk, zarówno w znaczeniu, jak i brzmieniu. Dlatego zechciał być nazywany „Raise”. Według niego łatwo się je wymawia i cieszy go, kiedy je słyszy. Równie pewnie odpowiedział, kiedy został zapytany o ulubionego bohatera. Najbardziej lubi grać Strażnikiem Łańcuchów, lecz nie stroni też od innych twardych wspierających. Podczas rozgrywek w Korei najczęściej wybierał Alistara, Thresha i Brauma, którym grając wygrał najwięcej meczów podczas pobytu w Korei. Posiada również unikalne zalety, w poprzedniej drużynie (Stardust) był shot callerem, czyli graczem dyrygującym resztą zespołu w kwestii podejmowania decyzji. Poza grą zadziwił europejską publikę między innymi umiejętnością jeżdżenia na monocyklu i zaangażowaniem na stronach portali społecznościowych, które założył dopiero po przyjeździe do Europy. </p>\n","fr_FR":"<p>Ji-hwan « Raise » Oh a rejoint les rangs de Roccat en tant que support titulaire au début du segment d’été 2016. D’origine coréenne, il a précédemment joué pour l’équipe coréenne Stardust où il finira la saison régulière à la troisième place de la seconde ligue coréenne, mais l’équipe se faisant éliminer des play-offs, il partira en direction de l’Europe où il rejoint Roccat au début du segment de été. Connu pour jouer des supports à orientation de tank et à fort potentiel d’initiation de combat, la synergie pourrait rapidement se créer entre lui et Pierre « Steeelback » Medjaldi et ainsi rivaliser avec les meilleurs duos du continent.</p>"},"foreignIds":{"TRLH3":"1001310005","TRLH4":"1001270005","TRLH2":"1001250032","FRA1TMNT2":"45026","ESPORTSTMNT06":"200001029"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":1686,"slug":"umti","name":"UmTi","firstName":"Sunghyeon","lastName":"Um","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/umti-6xrfjkdb.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2017-01-12T18:39:51.000Z","updatedAt":"2017-05-31T00:41:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000437"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":1687,"slug":"teddy","name":"Teddy","firstName":"Jin-sung","lastName":"Park","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/teddy-iulccg48.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-12T18:41:15.000Z","updatedAt":"2017-05-31T00:41:17.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":90},{"id":1905,"slug":"rascal","name":"Rascal","firstName":"Kwanghee","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rascal-8urxxqt3.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:02.000Z","updatedAt":"2017-05-31T00:47:11.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1906,"slug":"khan","name":"Khan","firstName":"Dongha","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/khan-9ek3s7ka.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:04:16.000Z","updatedAt":"2017-07-20T17:16:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001338"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1907,"slug":"cuzz","name":"Cuzz","firstName":"Uchan","lastName":"Mun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuzz-h4602gy8.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:11:11.000Z","updatedAt":"2017-05-31T00:39:07.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000369"},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1908,"slug":"justice","name":"Justice","firstName":"Seokjun","lastName":"Yoon","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/justice-ciws9z5c.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:05:33.000Z","updatedAt":"2017-05-31T00:45:08.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94},{"id":1909,"slug":"jin","name":"Jin","firstName":"Woojin","lastName":"Lee","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T19:13:13.000Z","updatedAt":"2017-05-25T19:13:13.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":94}],"scheduleItems":[{"id":"AVTGAP_DQMQFcjhwbQf0","content":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:match:7b41121d-9fc2-41a9-92ac-52cd8f37879d","scheduledTime":"2016-05-28T05:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db","blockLabel":"1","subBlockLabel":"4","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:bracket:2819fc4e-457f-4242-96ad-0d9137aa9222"},"match":"7b41121d-9fc2-41a9-92ac-52cd8f37879d","tournament":"a9a19798-6c5b-4383-ab27-e2bd08e224db","bracket":"2819fc4e-457f-4242-96ad-0d9137aa9222","league":"6"}],"gameIdMappings":[{"id":"5ac41bf5-0f48-4be6-8652-f3577ed44af2","gameHash":"fb904c0909b43576"},{"id":"f3df2325-9745-43a9-88f2-88b74f4995d0","gameHash":"5d316d93f28e5e72"}],"videos":[{"id":2839,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:5ac41bf5-0f48-4be6-8652-f3577ed44af2","source":"https://www.youtube.com/embed/zrheEH9Ki7Y?wmode=transparent&start=1587","createdAt":"2016-05-28T19:03:49.000Z","updatedAt":"2016-05-28T19:03:49.000Z","game":"5ac41bf5-0f48-4be6-8652-f3577ed44af2"},{"id":2840,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:f3df2325-9745-43a9-88f2-88b74f4995d0","source":"https://www.youtube.com/embed/zrheEH9Ki7Y?wmode=transparent&start=4923","createdAt":"2016-05-28T19:03:55.000Z","updatedAt":"2016-05-28T19:03:55.000Z","game":"f3df2325-9745-43a9-88f2-88b74f4995d0"}],"htmlBlocks":[],"match":{"id":"7b41121d-9fc2-41a9-92ac-52cd8f37879d","name":"JAG-vs-LZ","position":32,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"},{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}],"games":{"5ac41bf5-0f48-4be6-8652-f3577ed44af2":{"id":"5ac41bf5-0f48-4be6-8652-f3577ed44af2","name":"G1","generatedName":"JAG|LZ|G1|7b41121d9fc241a992ac","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"},{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}],"standings":{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464461890363,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464419915706,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464419899290,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1070301","gameRealm":"TRKR1","platformId":"TRKR1:1070301","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f3df2325-9745-43a9-88f2-88b74f4995d0":{"id":"f3df2325-9745-43a9-88f2-88b74f4995d0","name":"G2","generatedName":"JAG|LZ|G2|7b41121d9fc241a992ac","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"},{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}],"standings":{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464461683388,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464420124014,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1070302","gameRealm":"TRKR1","platformId":"TRKR1:1070302","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"22e4b349-d71e-4972-aa7b-323d9d7482cd":{"id":"22e4b349-d71e-4972-aa7b-323d9d7482cd","name":"G3","generatedName":"JAG|LZ|G3|7b41121d9fc241a992ac","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"},{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464461683389,"source":"bestOf","history":[{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464461890364,"source":"bestOf","closed":true},{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464419915706,"source":"bestOf","closed":true},{"result":[[{"roster":"639eb604-3d0a-4041-a4df-0f06f4258104"}],[{"roster":"b47d89ec-960c-4946-946c-9b12b7986647"}]],"timestamp":1464420124015,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b47d89ec-960c-4946-946c-9b12b7986647":0,"639eb604-3d0a-4041-a4df-0f06f4258104":1}}}