{"teams":[{"id":122,"slug":"renegades","name":"Renegades","guid":"be6eff04-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/renegades-11rbdlso.png","acronym":"REN","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-05-31T12:19:31.000Z","bios":{"en_US":"<p>\nA band of former Misfits, Renegades stormed through the 2015 NA Challenger Series and into the NA LCS within a year of their founding. Their success in the NACS was largely attributed to superior map and objective control, not individual laning talent, but don't let that fool you. Former Moscow 5 star Alexey \"Alex Ich\" Ichetovkin and former Team Dignitas star (and prophet) Alberto \"Crumbz\" Rengifo bring their fair share of experience and mechanical skill to the REN lineup. Combined with the stellar bot lane duo of Aleš \"Freeze\" Kněžínek and support Maria \"Remi\" Creveling, the Renegades ongoing success seems almost inevitable.\n</p>\n<p>\nCoach: David Tu\n</p>","fr_FR":"<p>Anciennement connus sous le nom de Misfits, les Renegades ont balayé leurs adversaires lors des Challenger Series NA 2015 et se sont qualifiés pour les LCS NA seulement un an après leur fondation. Leur succès lors des CS NA a été largement attribué à leur meilleur contrôle de la carte et des objectifs, et non à leur talent individuel en phase de laning, mais ne vous laissez pas abuser. L'ancienne star de Moscow 5, Alexy « Alex Ich » Ichetovkin et l'ancienne star (et prophète) de Team Dignitas, Alberto « Crumbz » Rengifo, ont apporté leur lot d'expérience et de maîtrise des mécaniques de jeu à l'équipe. Si l'on combine ces atouts certains au talentueux duo formé par Aleš « Freeze » Kněžínek et son support Maria « Remi » Creveling en voie du bas, le succès des Renegades semble assuré.</p>","pl_PL":"<p>Renegaci z Los Angeles wywodzą się z zespołu Misfits, który został założony na początku marca 2015. Twórcą był Chris \"Doombang\" Badawi, były prawnik patentowy z Nowego Jorku. W wywiadzie dla the Score e-sports wyjawił co przekonało go do takiego kroku. Pewnego dnia miał wypadek samochodowy, tak poważny, że z trudem udało mu się pozostać przy życiu. To skłoniło go do weryfikacji swojego życia – „Doombang” stwierdził, że nie chce być prawnikiem, bo w głębi duszy zawsze był graczem. Pierwotnie chciał kupić Curse Academy, ale skończyło się to tylko zdobyciem wielu przydatnych kontaktów w społeczeństwie League of Legends. </p>\n<p>\nWkrótce potem Chris Badawi zaprosił do rozmów Alberta \"Crumbz\" Rengifa, przyszłego kapitana LA Renegades, żeby podyskutować o stworzeniu nowej organizacji. Okazało się, że doskonale się rozumieją w kategorii idei, jak ma taki zespół wyglądać. Według filozofii Chrisa LA Renegades ma być drużyną, którą nie jest odbierana jako firma, tylko rodzina. To ma być miejsce gdzie każdy członek kocha i jest dumny z tego co robi, zamiast czuć nieustającą presję. \"Crumbz\" zaproponował Alexeya \"Alex Ich\" Ichetovkina jako kolejnego uczestnika tego projektu, którego \"Doombang\" przyjął z olbrzymim entuzjazmem. Tych trzech pasjonatów, połączonych wspólnym celem, zaczęło współpracę żeby niebawem ogłosić utworzenie Misfits. <p/>\n<p>\nPierwsza połowa 2015 roku przyniosła zespołowi wiele zmian. Przede wszystkim udało mu się dostać do 2015 NA Challenger Series, po trzech zwycięskich spotkaniach o wyniku 2:0. Zbiegło się to  w czasie ze zmianami w samej organizacji. Drużyna została przemianowana z Misfits na LA Renegades. Powszechnie znany prezenter, Christopher \"MonteCristo\" Mykles, dołączył do drużyny jako współwłaściciel. Pojawienie się kolejnej bardzo dobrze znanej twarzy zasiliło powiększające się, olbrzymie już grono kibiców tej drużyny. W międzyczasie Chris \"Doombang\" Badawi wywołał aferę w społeczeństwie League of Legends, w efekcie czego został wykluczony z uczestnictwa w LCS do końca sezonu 2016. </p>\n<p>\nPomimo tego, że na pierwszy rzut oka gracze z LA Renegades wydawali się przypadkową zbieranią, osiągnęli już swoje pierwsze sukcesy. Skończyli 2015 NA Challenger Series na drugim miejscu, po przegraniu dogrywki z Team Coast, z wynikiem 8:2. Jednak najważniejszym triumfem dla nich były rozgrywki kwalifikacjyjne do NA LCS. Renegaci zmierzyli się z najpoważniejszymi konkurentami z Challenger series. Najpierw wygrali z Team Imagine 2 do 1, a następnie w żazartej walce z Team Coast 3 do 2. Dzięki temu udało im się zrealizować ich najważniejszy cel – dostać się do wiosennego sezonu NA LCS 2016.</p>\n"},"foreignIds":{"drupalId":"4429"},"players":[144,160,272,323,501,680,784],"starters":[144,160,501,680],"subs":[272,323,784]},{"id":169,"slug":"echo-fox","name":"Echo Fox","guid":"be70e203-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/echo-fox-ejngzoa3.png","acronym":"FOX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-04T23:27:05.000Z","updatedAt":"2017-08-06T19:57:02.000Z","bios":{"fr_FR":"<p>Que se passe-t-il quand une figure médiatique du basketball nord-américain s'intéresse aux LCS ? Ça donne Echo Fox. </p>\n\n<p>L'idée pourrait sembler saugrenue et l'aurait sans aucun doute été il y a deux ans. Oui mais voilà, l'e-sport continue de se développer, notamment grâce à League of Legends, et Echo Fox en est une preuve éclatante. Cette nouvelle équipe qui vient remplacer Gravity Gaming dans les LCS NA est en effet la propriété de Rick Fox, ancien joueur de la NBA notamment pour les Los Angeles Lakers, et acteur à ses heures perdues. Rien que ça ! </p>\n\n<p>Acheter une place en LCS c'est bien, mais ça ne suffit pas. Encore faut-il aligner une équipe compétitive et donc attirer des joueurs de haut niveau. C'est ce qu'a tenté de faire Echo Fox, avec un résultat qui soulève sans doute autant de questions que d'espoirs circonspects chez les fans d'e-sport en général et de League of Legends en particulier. Echo Fox est charpentée autour de son mid laner Henrik « Froggen » Hansen, légende du jeu et un nom qui attirera sans aucun doute le public. Mais le joueur européen a-t-il encore le niveau pour porter son équipe ? Et ses coéquipiers ont-ils les reins assez solides pour l'épauler efficacement ? Que ce soit le joueur coréen de file solo Jeong-hun « kfo » Park en voie du haut ou les trois nord-américains qui complètent l'effectif, les nouveaux compagnons de Froggen manquent pour le moment d'expérience. </p>\n\n<p>Cela peut signifier l'arrivée d'une nouvelle vague de jeunes joueurs bien décidés à faire des étincelles. Cela peut aussi être une saison d'apprentissage difficile qui aboutira à un nouveau passage dans les tréfonds du classement des LCS pour Froggen. Quoiqu'il en soit, les dés sont jetés et Rick Fox va pouvoir regarder ses joueurs depuis le banc tout au long des LCS NA. </p>","en_US":"<p>You'd have trouble finding an easier team to root for than Echo Fox. Given the team's many struggles since joining the league in 2016, including narrowly avoiding relegation in the 2017 NA LCS Spring Promotion tournament, another owner might have jumped ship. But former NBA star Rick Fox isn't just any other owner. His belief in his players is unwavering.</p>\n\n<p>In 2017, Fox is supplementing that belief with some new talent. Former RNG top laner Looper headlines the new additions, along with ex-P1 support Gate. Former Challenger scene jungler Akaadian also joins the team. Nobody has more faith in Echo Fox than its owner; now it's time for the players to prove that faith isn't misplaced.</p>\n\n<p>Coach: Nick \"Inero\" Smith</p>","pl_PL":"<p>Pojawienie się Echo Fox w wiosennym sezonie NA LCS 2016 to powiew świeżości wśród organizacji. Nowo powstała drużyna zastąpiła Gravity w elitarnych rozgrywkach NA LCS, więc śmiało można stwierdził, że od razu skoczyła na głęboką wodę. Ogłoszenie istnienia Echo Fox, a następnie jego składu, wzbudziło wiele emocji wśród społeczeństwa League of Legends. Wynikało to z bardzo małej ilości przecieków na temat powstającego zespołu i ujawnienia atrakcyjnych faktów tuż przed rozpoczynającym się sezonem 6. Dlatego wszyscy zainteresowani dosłownie wychodzili z siebie próbując zaspokoić swoją ciekawość.</p>\n<p>Jednak najbardziej zaskakującymi informacjami dotyczącymi zespołu Echo Fox, były wiadomości o jego właścicielu. Nabywcą miejsca Gravity w NA LCS była powszechnie znana w Ameryce Północnej gwiazda NBA – Rick Fox. Wielu graczy od razu zadało sobie pytanie: jak to się stało, że znana w skali światowej osobistość, tak się zainteresowała grą komputerową. Wyjaśnienia można się doszukać w wielkim uczuciu jego syna, Kyle’a Foxa, do drużyny Counter Logic Gaming. Wkrótce młodemu fanowi udało się zarazić pasją swojego sławnego ojca. W ten sposób trzykrotny mistrz NBA dowiedział się o League of Legends i bardzo szybko również pokochał tą rozrywkę. Można było spotkać Ricka Foxa wśród widzów na wielu wydarzeniach związanych z League of Legends, jak na przykład rozgrywki NA LCS. Rozmawiał z zawodnikami, w szczególności dużo z graczami Counter Logic Gaming, dodając im otuchy przed meczami. Te czynniki doprowadziły sławę do kroku, którego nikt się nie spodziewał – wykupił drużynę Gravity i przemianował ją na Echo Fox. W wywiadzie dla Breitbart powiedział: „Pragnienie, skupienie, poświęcenie i etyka, które widziałem u esportowych atletów przypominają mi presję rywalizacji kiedy ja goniłem za swoją karierą w koszykówkę. Moja pasja została wsparta przez społeczeństwo, jako właściciel drużyny Echo Fox zamierzam popierać jej zawodników w taki sam sposób.”</p>\n<p>Rick Fox zadbał żeby jego drużyna nie została na wstępie zdominowana przez zahartowanych weteranów. Oprócz młodych i obiecujących talentów znalazł w składzie miejsce dla poważanego weterana - Henrika \"Froggen\" Hansena. W wizji właściciela Echo Fox połączenie świeżych pomysłów w wydaniu debiutantów i doświadczenia starych wyjadaczy to przepis na sukces. Uwagę przyciąga także nazwa organizacji – wiadomo, że lisia część pochodzi od nazwiska założyciela, lecz pojawiło się wiele teorii na temat dodatku w postaci słowa „Echo”. Wiele osób doszukało się w tej chwytliwej nazwie nawiązania do międzynarodowego alfabetu lotniczego. Według tej teorii „Echo Fox” to skrócona nazwa fonetyczna dwóch następujących po sobie liter – E i F, czyli w rozwinięciu „Echo Foxtrot”.</p>\n","de_DE":"Es gibt kaum ein Team, das man lieber anfeuert als Echo Fox. Das Team hat seit dem Ligabeitritt 2016 schwer zu kämpfen. Der knapp verhinderte Abstieg im Aufstiegsturnier für die NA LCS 2017 ist nur ein Beispiel dafür, und ein anderer Besitzer hätte das sinkende Schiff sicher verlassen. Aber der ehemalige NBA-Star Rick Fox ist kein Besitzer wie jeder andere. Der Glaube an seine Spieler ist unerschütterlich.\n</p>\n2017 untermauert er diese Einstellung mit einigen neuen Talenten. Looper, der ehemalige Top-Laner von RNG, führt die Neuzugänge an, gemeinsam mit Gate, dem Ex-Supporter von P1. Akaadian, der früher in der Challenger Series als Jungler tätig war, schließt sich ebenfalls dem Team an. Niemand glaubt mehr an Echo Fox als ihr Besitzer, und jetzt liegt es an den Spielern, zu beweisen, dass sein Vertrauen nicht ungerechtfertigt ist.\n</p>\nCoach: Tim „Timkiro“ Cho\n"},"foreignIds":{},"players":[70,191,246,363,607,774,820,1096,1359],"starters":[191,363,774,820,1359],"subs":[70,246,607,1096]}],"players":[{"id":70,"slug":"looper","name":"Looper","firstName":"Hyeongseok","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/looper-agve6x52.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-01-19T22:02:44.000Z","bios":{"en_US":"<p>Hyeongseok \"Looper\" Jang is the latest Korean top laner to make his LCS debut. The ex-Royal Never Give Up starter is a veteran of the scene, with a career that began back in 2013. Originally known for an aggressive playstyle, Looper has evolved into a multi-faceted laner. The former LPL champion is just as capable of tanking on Maokai as he is carrying on Irelia.</p>\n\n<p>Looper brings his many talents to Echo Fox in 2017. The team hopes to have more success with a Korean import this time around after another one, KFO, struggled as their top laner. Looper has the track record of success that Echo Fox sorely needed. At 23, he's one of the older players in the LCS -- but don't let his age fool you. He's still got plenty in the tank, and just one destination in mind: victory.</p>","es_AR":"<p>Hyeong-seok \"Looper\" Jang se posiciona en la cima como el carrilero superior de RNG y, mientras que otros carrileros superiores son alabados por su estabilidad y consistencia, Looper tiene una historia de ser un poco más agresivo. Fue originalmente conocido por su Singed en el 2013, pero Looper ha evolucionado y ahora es un carrilero multifacético. Eligió a Trundle y Rumble durante la temporada de verano de la LPL, pero es más que capaz de ramificarse, como fue demostrado con su habilidad para resistir con Moakai o acarrear con Irelia cuando es necesario. Con 23 años y con una carrera que data desde el 2013, Looper es uno de los jugadores más veteranos en el Mundial, pero no permitas que su vasta carrera te engañe. Es un maestro al que hace ya tiempo se le quitaron los nervios. Su objetivo está en la victoria.</p>","fr_FR":"<p>Hyeong-seok « Looper » Jang est un vétéran d'élite de la voie du haut. Ayant affronté la crème des joueurs d'Asie et remporté des championnats en Corée et en Chine, il est tout à fait capable d'écraser ses adversaires avec des champions tankys comme Poppy et Nautilus.</p>\n\n<p>Looper est bien souvent en première ligne pour RNG : il possède un réel talent pour utiliser la Téléportation et créer des situations favorables à son équipe, qui peut alors écraser ses adversaires lors d'un combat d'équipes ou contrer une rotation adverse en prenant les bonnes décisions.</p>\n\n<p>Alors qu'il jouait à l'origine un rôle de soutien avec Samsung White, il a su s'adapter au fil des différents patchs et constitue désormais un pilier central du line-up de RNG. C'est lui qui porte la lourde charge d'être un carry et une menace majeure au sein de l'équipe, et il est parfaitement synchronisé avec Mata. Vu le danger permanent qu'il incarne grâce à sa maîtrise de la Téléportation, ses adversaires réfléchiront toujours à deux fois avant de s'élancer hors de leur base.</p>\n\n<p>Ses performances ne sont d'ailleurs pas passées inaperçues : il a été nommé huit fois pour le titre de MVP lors du segment de printemps des LPL.\n</p>","es_ES":"<p>Hyeong-seok \"Looper\" Jang va con la cabeza bien alta como el jugador de la calle superior de RNG y, aunque otros de sus análogos son elogiados por la estabilidad y la regularidad, Looper tiene fama de ser un poco más agresivo. Era conocido inicialmente por su Singed, allá por 2013, pero desde entonces se ha transformado en un jugador polifacético. Añadió a Trundle y Rumble a su plantel durante la temporada de verano de la LPL, pero es más que capaz de expandirse, ya que ha demostrado su capacidad de hacer de tanque con Maokai o de ganar la partida con Irelia cuando haga falta.</p>\n\n<p>Con 23 años y una carrera que data de 2013, Looper es uno de los jugadores más adultos del Mundial, pero no dejéis que su larga trayectoria os engañe. Es un maestro que se deshizo de los nervios hace tiempo. Y ahora se concentra en la victoria.</p>","de_DE":"Hyeongseok „Looper“ Jang ist der neueste koreanische Top-Laner, der sein LCS-Debüt gibt. Das ehemalige Mitglied von Royal Never Give Up ist ein Veteran der Szene, der seine Karriere 2013 startete. Er wurde für seinen aggressiven Spielstil bekannt, aber seither hat sich Looper zu einem facettenreichen Top-Laner entwickelt. Der ehemalige Champion der LPL beherrscht es genauso gut, mit Maokai Schaden aufzusaugen wie mit Irelia Spiele im Alleingang zu entscheiden.\n</p>\nLooper unterstützt 2017 Echo Fox mit seinen vielen Talenten. Das Team hofft, dass sie mit diesem koreanischen Import mehr Erfolg haben, nachdem sich der letzte Koreaner, KFO, als Top-Laner nicht durchsetzen konnte. Loopers Erfolgsbilanz ist genau das, was Echo Fox so dringend braucht. Mit 23 Jahren ist er einer der älteren Spieler der LCS – aber man sollte sich nicht von seinem Alter täuschen lassen. Er hat noch immer genug Reserven und nur ein Ziel vor Augen: den Sieg.\n","pl_PL":"<p>Hyeong-seok „Looper” Jang jest doświadczonym weteranem górnej alei. Mając na koncie walki z najlepszymi zawodnikami z Azji, wygrywając mistrzostwa w Korei i Chinach, doskonale odnajduje się w tłuczeniu swoich przeciwników wytrzymałymi bohaterami, takimi jak Poppy czy Nautilus.</p>\n\n<p>Looper z reguły przewodzi RNG, ponieważ jest jednym z najlepszych graczy pod względem używania Teleportacji, aby tworzyć korzystne sytuacje dla swojej drużyny podczas walk drużynowych, lub przechytrzyć przeciwników w grach skupiających się na macro.</p>\n\n<p>Z początku miał bardziej wspierającą rolę podczas gry w Samsung White, ale przyzwyczajał się do zmian w różnych patchach i teraz jest głównym filarem składu RNG. Jego zadaniem w drużynie jest stanowienie zagrożenia dla wrogich prowadzących. Doskonale zgrywa się z Matą, a jego mistrzowskie stosowanie Teleportacji sprawia, że jego przeciwnicy muszą poważnie się zastanowić, zanim opuszczą swoją bazę.</p>\n\n<p>Jego wyniki nie zostały niezauważone, ponieważ był ośmiokrotnie nominowany na najlepszego gracza podczas wiosennego splitu LPL.</p>\n","pt_BR":"<p>Hyeong-seok \"Looper\" Jang marca presença como jogador do topo da RNG e enquanto outros topos são elogiados pela consistência e estabilidade, Looper tem um histórico de ser um pouco mais agressivo. Ele ficou conhecido inicialmente por seu Singed em 2013, mas Looper evoluiu muito desde então e agora é um jogador muito versátil. Ele escolheu Trundle e Rumble na etapa de verão da LPL, mas pode perfeitamente ampliar seu leque, pois já mostrou suas habilidades de tanque com Maokai e de carregador com Irelia quando foi preciso. Com 23 anos e uma carreira que remonta a 2013, Looper é um dos jogadores mais velhos do Mundial, mas não deixe que sua longa carreira o engane. Ele é um mestre que não se abala facilmente. Seu foco está apenas na vitória.</p>"},"foreignIds":{"drupalId":"683","TRLH1":"200000207","TRLH2":"200000111"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":191,"slug":"froggen","name":"Froggen","firstName":"Henrik","lastName":"Hansen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/froggen-ecvbey01.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-01-19T22:02:25.000Z","bios":{"en_US":"<p>One of the strongest control mage players in the world, Henrik “Froggen” Hansen is legendary in the mid lane on his favorite bird, Anivia. After rising to fame with CLG.eu utilizing a slow and methodical playstyle, Froggen and his squad went through a flurry of team and roster changes. From Evil Geniuses to Alliance, and then from Alliance to Elements, Froggen has had a tumultuous few years.</p>\n\n<p>After keeping Echo Fox from relegation by sheer force of will, Froggen has a new opportunity with 2017's retooled roster. With a former LPL champion in the top lane and a new jungler to gank his lane, the LCS icon is in a great spot to succeed. Now he just has to prove he's still got it after all these years. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">전장 장악형 마법사를 세계에서 가장 잘하는 선수 중 하나인 Henrik “Froggen” Hansen은, 애니비아 플레이로 오래 전부터 전설이 된 선수입니다. CLG.eu 시절 느리지만 정교한 플레이 스타일로 명성을 얻은 Froggen 선수는, 동료들과 함께 여러 번 팀을 바꾸었습니다. Evil Geniuses에서 Alliance로, 그리고 다시 Elements로, 지난 몇 년 간 평탄치 않은 시간을 보냈죠. </p>\n<p style=”font-family:”나눔고딕”;\">2015 유럽 LCS 스프링, 서머 스플릿에서 연속해서 7위를 기록한 Froggen 선수와 Elements가 세계 최고 수준의 팀들과 경쟁하려면 뭔가 근본적인 문제를 해결해야 한다는 사실은 자명해 보입니다. 하지만 Froggen 선수의 과거 활약을 생각해보면 아직 그에 대한 기대를 내려놓을 때는 아닙니다. 이번 올스타 대회가 부활의 신호탄을 올릴 수 있는 절호의 기회일지도 모르죠. </p>\n","fr_FR":"<p>Anivia le pigeon bleu. Est-il vraiment besoin de présenter Henrik « Froggen » Hansen ? Le Danois fait partie des quelques légendes de League of Legends encore en activité. Membre de la trilogie originale des dieux européens de la voie du milieu en saison 2, il déchaîne les foules depuis près de 4 ans. Considéré aujourd'hui encore comme le meilleur joueur d'Anivia au monde, Froggen porte avec lui le mythe de CLG.EU et des affrontements mythiques qu'il a menés contre Moscow 5 tout au long de la saison 2.</p>\n\n<p>Mais depuis, l'eau a coulé sous les ponts et le sort n'a pas été favorable au joueur. Dès la saison 3 et l'apparition des LCS, les anciens de CLG.EU ont souffert et laissé d'autres joueurs remporter titres et participation aux championnats du monde. Sentant que des changements étaient nécessaires, le joueur a alors construit autour de lui une équipe annoncée avant le début des LCS EU 2014 comme la première « superteam » de League of Legends. Malheureusement cette équipe construite pour tout gagner a enchaîné l'excellent et le bien moins bon, aussi bien capable de remporter un titre de champion des LCS EU lors du segment d'été que d'être la première équipe européenne à perdre contre des brésiliens lors du Championnat du monde 2014.</p>\n\n<p>La situation du Danois ne s'est pas arrangée en 2015 : il s'est retrouvé bien malgré lui à lutter non pas pour les titres mais pour éviter de se retrouver en tournoi de relégation des LCS EU. Pour la première fois de sa carrière, les critiques d'une partie du public ont été aussi sonores que l'enthousiasme de ses fans. L'ancien recordman du nombre de minions tués en un minimum de temps en compétitif s'est retrouvé considéré par certains comme un joueur trop passif et incapable de prises de décisions. Pire, l'arrivée en fanfare d'une nouvelle génération de joueurs professionnels a bousculé un peu plus chaque jour son statut de mid laner de classe mondiale.</p>\n\n<p>Alors Froggen a fait le grand saut, il est parti en NA, découvrir encore une nouvelle équipe et un nouvel environnement. Un nouveau défi, même s'il ne sera pas dépaysé de retrouver son vieil adversaire Alexey « Alex Ich » Ichetovkin dans les LCS NA. Un dernier défi peut-être aussi, pour celui qui doit plus que jamais prouver qu'il est toujours un monstre du jeu et pas seulement une ancienne gloire dépassée par la concurrence.</p>\n","pl_PL":"<p>Mało kto z europejskich graczy nie słyszał o Henriku \"Froggen\" Hansenie. Duńska ostoja doskonałości na mid-lanie imponuje fanom od pierwszego sezonu. Do grudnia 2011 próbował swojego szczęścia w różnych drużynach, z czego najcieplej wspomina poznanie przyjaciela – Mike’a \"Wickd\" Petersena. Wraz z nim pod koniec 2011 roku trafił do zespołu, gdzie spełniło się wiele z jego marzeń. W Counter Logic Gaming Europe Henrik spędził swój najbardziej owocny okres, konkurując na arenie światowej z najlepszymi ówczesnymi drużynami. W 2012 roku wygrał szereg poważnych i mniejszych międzynarodowych turniejów, lecz największym osiągnięciem było dostanie się na Mistrzostwa Świata drugiego sezonu. W związku z wejściem na arenę azjatyckich zespołów, drużyna CLG EU nie była faworytem, lecz udało im się wszystkich zaskoczyć. Nie tylko podołała wyjściu z grupy, ale również rozgromiła najstarszy chiński zespół Team WE w ćwierćfinale. W półfinale ekipie Henrika nie powiodło się tak dobrze, chociaż wygrali jeden mecz z trzech. Trzecia pozycja ex aequo na takim wydarzeniu była bardzo nobilitująca dla całego CLG EU. </p>\n<p>Wkrótce po tej imprezie drużyna została przemianowana na Evil Geniouses, lecz skład pozostał ten sam. Jednak w międzyczasie na profesjonalnej scenie pojawiło się wiele nowych talentów i konkurencja radykalnie urosła w siłę. W związku z czym „Froggen” nie odniósł tak oszałamiających sukcesów jak w poprzednim sezonie, nawet wiele osób nazwało wyniki EG w tym okresie przeciętnymi. Dlatego Henrik w grudniu 2013 roku opuścił wraz z przyjacielem Mike’iem bezpieczną przystań i w poszukiwaniu sukcesu stał się częścią nowej organizacji – Alliance. W niej osiągnął zdecydowanie więcej niż w poprzedniej drużynie, ponieważ po poznaniu własnych możliwości, w wiosennym sezonie EU LCS 2014, Alliance sięgnęło po złoto. W okresie letnim 2014 roku zajęła pierwsze miejsce w regularnych rozgrywkach, a następnie potwierdziła swoją dominację wygrywając również baraże. W ten sposób „Froggen” zagwarantował sobie udział w kolejnych Mistrzostwach Świata, tym razem sezonu 4. Niestety Alliance nie udało się wyjść z grupy, więc wyczyn z 2012 roku nie został powtórzony. Po tym wydarzeniu organizacja została przemianowana na Elements i zmieniła skład personalny zespołu. Jednak zmiany tylko pogorszyły sytuację Henrika, ponieważ jego drużyna w całym piątym sezonie wypadła przeciętnie, dwukrotnie zajmując 7 miejsce. Jak większość profesjonalnych graczy marzy o pokazaniu się na Mistrzostwach Świata, więc doszedł do wniosku, że musi podjąć radykalne kroki. Pod koniec roku 2015 przeniósł się do Ameryki Północnej żeby dołączyć do nowo powstałego zespołu Echo Fox – biorącego udział w wiosennym sezonie NA LCS 2016.</p>\n<p>„Froggen” osiągnął absolutne mistrzostwo w grze Anivią. W ciągu paru lat na scenie esportowej zyskał reputację najlepszego gracza tą postacią. Dlatego został wybrany do uczestnictwa w imprezie All-Stars Paris przez fanów po to, żeby zagrał Kriofeniksem. Osobistym wyczynem Henrika potwierdzającym jego masterię jest zwycięstwo z powszechnie znanym Lee’iem \"Faker\" Sang-hyeokiem. Zwyciężył z nim w pojedynku 1 vs 1 na wydarzeniu All-Stars Los Angeles 2015. Na tym nie kończą się prywatne sukcesy duńskiego mid-lanera – przez długi okres czasu był rekordzistą w zdobytej farmie w regularnych rozgrywkach. Pobił go Karthusem, zabijając 300 stworów w 23 minuty i 10 sekund.</p>","de_DE":"Mit seinem Lieblingsvögelchen Anivia hat sich Henrik „Froggen“ Hansen zu einem legendären Mid-Laner gemausert, der zu den stärksten Spielern der Welt gehört, die Magier mit Massenkontrolleffekten spielen. Nachdem er mit CLG.eu durch seinen langsamen und methodischen Spielstil zu Ruhm gekommen war, haben Froggen und seine Truppe eine Reihe an Mannschafts- und Aufstellungsänderungen durchgemacht. Froggen hat zwischen den Evil Geniuses, Alliance und Elements ein paar turbulente Jahre erlebt.\n</p>\nNachdem er Echo Fox durch reine Willenskraft vor dem Abstieg bewahren konnte, bietet sich 2017 mit der neuen Aufstellung eine neue Chance für ihn. Mit einem ehemaligen Champion der LPL auf der oberen Lane und einem neuen Jungler, der ihn auf der Lane unterstützt, befindet sich die LCS-Legende in einer guten Ausgangsposition. Jetzt muss er nur noch zeigen, dass er es nach all den Jahren immer noch drauf hat. \n","es_ES":"<p>\nHenrik “Froggen” Hansen es uno de los mejores jugadores del mundo con magos de control, y su Anivia mid es legendaria. Froggen dio el salto a la fama en CLG.eu gracias a su estilo de juego lento y metódico, y después de aquello tanto él como sus compañeros sufrieron una gran cantidad de cambios de equipo y plantilla. De Evil Geniuses a Alliance, y después a Elements. Froggen ha tenido unos años ajetreados. \n</p>\n<p>\nTras quedar en séptimo puesto en los splits de la LCS de 2015 de primavera y verano, está claro que Froggen y el resto de EL tienen que solucionar ciertos aspectos fundamentales antes de estar preparados para vencer a los mejores oponentes. Sin embargo, visto el rendimiento de Froggen, pensamos que no todo está perdido. El evento All-Star 2015 puede ser la ocasión perfecta para el resurgimiento de Froggen. \n</p>"},"foreignIds":{"drupalId":"80","TRLH1":"200000209","TRLH2":"200000113"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":363,"slug":"keith","name":"Keith","firstName":"Yuri","lastName":"Jew","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keith-gmei2hih.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-05-24T21:45:13.000Z","bios":{"en_US":"Yuri \"Keith\" Jew has called himself \"the motivator.\" He was the player Liquid and TSM brought in to nip at the heels of an underperforming starter. He finally earned a starting role with Echo Fox in the 2016 NA LCS Summer Split, but he struggled to find his footing. Fortunately, he showed up when it counted, helping Echo Fox avoid relegation against NRG Esports.\n</p>\n<p>After a rough spring split in the bot lane with his new support Gate, Keith will look to bounce back this summer. While his positioning has been suspect, he's proven willing to play a more supportive role as ADC. With playmakers like Akaadian and Froggen on your team, sometimes all it takes is one Enchanted Crystal Arrow for Echo Fox to take a victory. </p>\n","fr_FR":"<p>Yuri « KEITH » Jew est le roi des « memes » et des réactions humoristiques sur internet. C'est aussi un carry AD nord-américain dont tout le monde reconnaît le talent et le titulaire d'Echo Fox sur ce rôle. Mais malgré quelques apparitions dans les LCS NA au cours de la saison 2015, KEITH est pour le moment connu du grand public avant tout pour sa personnalité, particulièrement aux États-Unis et sur Reddit.</p>\n\n<p>Pourtant, ce joueur d'à peine 18 ans n'est pas passé inaperçu lors de son bref passage en LCS NA, bien au contraire. Souvenez-vous, c'était au début du segment de printemps 2015 et tous les yeux étaient tournés vers Team Liquid après que l'organisation eut réussi à faire venir l'ancien champion du monde Chae « Piglet » Gwang-jin en Amérique du Nord. Mais hélas, impossible d'obtenir un visa pour le Coréen avant le début de la saison. C'est là qu'est entré en scène celui qui s'appelait alors KEITHMCBRIEF (oui, tout en majuscules!), engagé comme remplaçant pour les premiers matchs de la saison. Une pression énorme ? Pas pour le jeune carry AD, auteur de performances éclatantes lors de ses premiers matchs en tant que professionnel, avec deux victoires à la clé. Mieux encore, en raison des performances décevantes de Piglet lors des semaines suivant son arrivée, KEITH a eu le plaisir d'être rappelé deux semaines en cours de saison par Team Liquid. Pour prendre, un temps, la place d'un ancien champion du monde. Une sacrée carte de visite, d'autant plus quand on sait qu'il a réalisé à cette occasion des matchs plus qu'honorables, avec notamment une fiche de 9/1/12 sur Caitlyn. Après un retour infructueux en Challenger series, le joueur a de nouveau fait office de joker de luxe des LCS NA en remplaçant cette fois Jason « WildTurtle » Tran pour un match.</p>\n\n<p>Cette saison, c'est en tant que titulaire d'une toute nouvelle équipe que le jeune joueur va retrouver et affronter ceux qu'il remplaçait hier. Toujours sans pression, mais sans nul doute avec l'envie de bien faire.</p>\n","pl_PL":"<p>\"KEITH\" zainteresował się profesjonalną sceną w połowie 4 sezonu. Wcześniej grał w inne tytuły typu MOBA, lecz ostatecznie najbardziej spodobało mu się League of Legends, dlatego w maju 2014 roku dołączył do Team Gyrations. Tam miał okazję nabrać doświadczenia i poznać przyszłe sławy, takie jak: „NintendudeX” I “Adrian”. Dopiero w kolejnym zespole zaczął odnosić widoczne sukcesy, gdyż będąc w Team LoLPro zagrał w turnieju rozszerzającym skład NA LCS. Szansę Yuriego na coś więcej zostały przekreślone przez Team Coast, który pokonał jego drużynę we wczesnym stadium wydarzenia. Mogło to wynikać z tego, że \"KEITH\" w Team LoLPro zajmował pozycję supporta, a jego główną rolą jest AD Carry. </p>\n<p>W styczniu 2015 roku został zrekrutowany do Team Liquid Academy, co dało mu niesamowite możliwości rozwoju. Pierwszą okazję dostał kiedy na początku wiosennego sezonu 2015 główny AD Carry Team Liquid, „Piglet”, miał problemy z wizą. W związku z tym Yuri został poproszony o wystąpienie jako substytut w regularnym sezonie NA LCS. To był milowy krok w jego karierze profesjonalnego zawodnika, gdyż okazało się, że doskonale sobie radzi wśród najlepszych graczy. Już w pierwszym tygodniu wygrał z takimi potęgami jak Team Impulse i Counter Logic Gaming. Po powrocie brakującego AD, \"KEITH\" grał w szeregach Team Liquid Academy w Challenger Series, niestety bez większych sukcesów. Została mu również dana szansa na miejsce w głównym składzie Team SoloMid, jednak zagrał tylko w jednym tygodniu, po czym organizacja zdecydowała się wrócić do poprzedniego AD Carry. </p>\n<p>Ulubionym bohaterem Yuriego bez wątpienia jest Lucian. Grając głównie Klerykiem Broni siał zniszczenie wśród nieprzyjaciół, dzięki czemu szybko znalazł się w Kręgu Pretendenta. W profesjonalnych rozgrywkach nie dane mu było zagrać ukochaną postacią, lecz mimo tego poradził sobie śpiewająco. Reprezentując Team Liquid podczas NA LCS zaskoczył widzów swoimi zdolnościami w grze między innymi Corkim, Caitlyn i Kog’Mawem. Ciekawostką jest to, że pseudonim Yuriego jest pisany dużymi literami, ponieważ pragnął większej uwagi.</p>\n","de_DE":"Yuri „Keith“ Jew nannte sich selbst „der Motivator“. Er war der Spieler, den Liquid und TSM einwechselten, wenn einer der Stammspieler eine schwache Leistung ablieferte. Im Sommer-Split der NA LCS 2016 konnte er sich schließlich einen Startplatz bei Echo Fox sichern, aber er hatte Schwierigkeiten, seinen Rhythmus zu finden. Zum Glück konnte er gegen NRG Esports seine ganze Leistung abrufen und damit den Abstieg von Echo Fox verhindern.\n</p>\nIn seinem zweiten Split hat Keith erneut die Chance, als AD-Carry von Echo Fox zu glänzen. Wenn er gut mit seinem neuen Supporter Gate harmoniert, könnte die untere Lane von Echo Fox für eine Überraschung in der NA LCS sorgen. Dieses Jahr wird er nicht strauchelnde AD-Carrys ersetzen, sondern versuchen, mit seiner Mannschaft die Top-Teams der NA LCS ins Schwitzen zu bringen.\n"},"foreignIds":{"drupalId":"2999","TRLH1":"200000210","TRLH2":"200000114"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":501,"slug":"ninja","name":"Ninja","firstName":"Geon-woo","lastName":"Noh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ninja-4csesuls.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-30T02:20:51.000Z","bios":{"en_US":"<p>Geon-woo \"Ninja\" Noh was originally meant to be a loan from to the Dragon Knights, but North America seems to agree with him. These days Ninja is most often found with his partner in fun Seraph, and the two solo laners have built up a great dynamic. Team Envy snapped up the duo in 2016 with the hope that giving the old friends a fresh start would propel their new team to victory. Their gamble paid off in the form of Team Envy making the playoffs in their inaugural split together. The team will bank on Ninja and Seraph’s chemistry growing and landing them right back where they want to be -- the playoffs.</p>","de_DE":"Geon-woo „Ninja“ Noh war ursprünglich eine Leihgabe der Dragon Knights, aber Nordamerika scheint ihm zu liegen. Heutzutage trifft man Ninja meistens mit seinem Freund Seraph zusammen an und die beiden Solo-Laner harmonieren großartig. Team Envy verpflichtete das Duo 2016 in der Hoffnung, dass die beiden Freunde ihre neue Mannschaft zum Sieg führen würden. Und ihr Wagnis machte sich bezahlt, als Team Envy gleich im ersten Split die Entscheidungsspiele erreichte. Die Mannschaft hofft darauf, dass Ninjas und Seraphs Harmonie noch besser geworden ist und sie wieder dorthin führen wird, wo sie sein wollen: in die Entscheidungsspiele."},"foreignIds":{"drupalId":"2143","TRLH1":"200000226","TRLH2":"200000130"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":607,"slug":"grigne","name":"Grig","firstName":"Jonathan","lastName":"Armao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/grigne-1oxeggm8.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-10T18:09:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3803","ESPORTSTMNT02":"200000546","TRLH1":"200000213","TRLH2":"200000117"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":784,"slug":"leonyx","name":"Leonyx","firstName":"Rob","lastName":"Lee","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/leonyx-86twbq9h.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:47.000Z","updatedAt":"2017-01-19T22:25:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4563","TRLH1":"200000223","TRLH2":"200000127"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1359,"slug":"brandini","name":"Brandini","firstName":"Brandon","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brandini-3s9xhgwg.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-06-12T20:15:57.000Z","updatedAt":"2017-07-16T22:42:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000670","TRLH1":"200000616"},"socialNetworks":{},"champions":[],"liveGameTeam":169}],"scheduleItems":[{"id":"AVIUxnmkJTrHluSI14KL","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:7c4342f8-82e0-4ab2-b729-14b1f0a83699","scheduledTime":"2016-03-20T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"7c4342f8-82e0-4ab2-b729-14b1f0a83699","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"80bf670a-70a5-43ac-bc0d-af215e3fb39c","gameHash":"ff12c73b5147ea33"}],"videos":[{"id":2272,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:80bf670a-70a5-43ac-bc0d-af215e3fb39c","source":"https://www.youtube.com/embed/LjUaRNkq0q0?wmode=transparent","createdAt":"2016-03-20T21:36:19.000Z","updatedAt":"2016-03-20T21:36:19.000Z","game":"80bf670a-70a5-43ac-bc0d-af215e3fb39c"}],"htmlBlocks":[],"match":{"id":"7c4342f8-82e0-4ab2-b729-14b1f0a83699","name":"REN-vs-FOX","position":29,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}],"games":{"80bf670a-70a5-43ac-bc0d-af215e3fb39c":{"id":"80bf670a-70a5-43ac-bc0d-af215e3fb39c","name":"G1","generatedName":"FOX|REN|G1|7c4342f882e04ab2b72","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}],"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1458504203961,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001650049","gameRealm":"TRLH1","platformId":"TRLH1:1001650049","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"8b82d54c-ba37-46f9-a49c-be79a5b51869"}]],"timestamp":1458504203961,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}