{"teams":[{"id":76,"slug":"lgd-gaming","name":"LGD Gaming","guid":"be6df3df-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-5n0d69lg.png","acronym":"LGD","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-if86jc4q.png","createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:34:16.000Z","bios":{"en_US":"","fr_FR":"Pendant des années, LGD est restée coincée au milieu du classement des LPL. En dépit de quelques succès dans des tournois mineurs, ces joueurs n'ont pas menacé la domination d'EDG et de SHRC dans l'e-sport chinois. Puis LGD a décidé que ça suffisait comme ça. Elle a reconstruit l'équipe avec des joueurs coréens aguerris (imp, Flame et Acorn) à la fin de 2014. Les résultats parlent d'eux-mêmes : 1re place lors des play-offs d'été au LPL 2015.","pl_PL":"Od lat LGD znajduje się pośrodku tabeli LPL. Pomimo sukcesów w mniejszych turniejach nawet nie zbliżyło się do sukcesów EDG i SHRC w chińskim E-sporcie. I wtedy właśnie LGD stwierdziło, że starczy tego dobrego. Do swojego składu wcielili niezwykle utalentowanych Koreańczyków – impa, Flame'a i Acorna – pod koniec 2014 roku. Wyniki mówią same za siebie – 1. miejsce w letnich playoffach LPL 2015.","de_DE":"Seit Jahren steckte LGD in der Mitte der LPL-Tabelle fest. Trotz einigen Erfolgen bei kleineren Turnieren, schafften sie es nicht, die Dominanz von EDG oder SHRC zu beenden. Doch damit sollte nun ein für alle Mal Schluss sein. Sie verbesserten ihr Team mit den bekannten koreanischen Talenten imp, Flame und Acorn im Sommer 2014. Die Ergebnisse sprechen für sich - erster Platz der LPL Sommersaison in diesem Jahr.","es_ES":"LGD se pasó varios años estancado en centro de la tabla de la LPL. A pesar de obtener algunos éxitos en torneos menores, apenas alcanzó a mellar el férreo dominio que ejercían EDG o SHRC sobre los deportes electrónicos en China. Hasta que decidieron que ya estaba bien. A finales de 2014 reconstruyeron la plantilla con talentos coreanos de primera categoría, como Imp, Flame o Acorn. Los resultados hablan por sí mismos: Primer puesto de las eliminatorias de verano de la LPL 2015.","pt_BR":"A LGD passou anos vivendo na parte do meio da tabela LPL. Apesar de vitórias em alguns torneios menores, eles estavam longe de ameaçar a EDG ou a Royal Club no cenário chinês. Mas então eles deram um basta. Reconstruíram o time no final de 2014 com grandes astros coreanos: imp, Flame e Acorn. Os resultados falam por sisó -- campeões das eliminatórias de verão da LPL 2015.\n"},"foreignIds":{"drupalId":"1850"},"players":[56,67,541,589,605,998,1431],"starters":[67,541,589,605,998],"subs":[56,1431]},{"id":79,"slug":"invictus-gaming","name":"Invictus Gaming","guid":"be6dfd0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/invictus-gaming-cnnnfwdo.png","acronym":"IG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:30:22.000Z","bios":{"en_US":"","fr_FR":"Invictus Gaming piaffe devant la porte de la gloire depuis si longtemps que l'équipe paraît presque frappée d'une malédiction. Au cours des deux dernières années, ils sont arrivés quatre fois 3e aux finales régionales ou aux play-offs de printemps de la LPL. Cependant, avec l'aide de joueurs dynamiques comme KaKAO et RooKie, Invictus va peut-être enfin briser la malédiction et parvenir au sommet.","pl_PL":"Invictus Gaming przez tak długo znajdowało się na krawędzi osiągnięcia sukcesu, że można pomyśleć, że drużyna jest przeklęta. Zajęli 3. miejsce podczas wiosennych playoffów LPL / finałów regionalnych 4 razy w ciągu ostatnich dwóch lat. Jednakże dzięki dołączeniu tak utalentowanych graczy, jak KaKAO i Rookie być może Invictus wreszcie przełamie klątwę i wywalczy sobie drogę na szczyt tabeli.","de_DE":"Invictus Gaming schwebte lange Zeit an der Grenze zum Erfolg, sodass es schien, sie seien verflucht. In zwei Jahren brachten sie viermal den dritten Platz in den LPL Spring Playoffs/Regional Finals nach Hause. Aber vielleicht schafft es diesmal Invictus, mit den dynamischen Talenten wie KaKAO und RooKie, den Fluch zu durchbrechen und sich den ganz Großen anzuschließen.","es_ES":"Invictus Gaming se ha quedado tantas veces a la puertas de la gloria que casi parece que están gafados. Han quedado en tercera posición en los Playoffs de primavera de la LPL y en las finales regionales de China cuatro veces en los dos últimos años. Aunque con los fichajes de los coreanos KaKAO y RooKie, quizás Invictus va a romper la maldición definitivamente y a hacerse un hueco entre los mejores equipos del mundo.","pt_BR":"A Invictus Gaming se aproximou da consagração tantas vezes, que até parece um time amaldiçoado. Eles ficaram em terceiro lugar nas Regionais e Eliminatórias da LPL quatro vezes nos últimos dois anos. Talvez agora, com a chegada de pequenos monstros como KaKAO e RooKie, eles consigam quebrar a maldição e chegar entre os grandes do Mundial. \n"},"foreignIds":{"drupalId":"632"},"players":[122,519,522,1664,1871,1980,1981,1982],"starters":[122,519,522,1664,1871],"subs":[1980,1981,1982]}],"players":[{"id":56,"slug":"cool","name":"Cool","firstName":"Jia-Jun","lastName":"Yu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/cool-esrj8abc.png","hometown":"Yiyang, China","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:14.000Z","updatedAt":"2017-06-06T23:29:21.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"698","TRLH1":"1000185041","TRLH3":"1000105048"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":67,"slug":"imp","name":"imp","firstName":"Seung-bin","lastName":"Gu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/imp-5lcuchzd.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:27.000Z","updatedAt":"2016-02-01T22:57:45.000Z","bios":{"en_US":"<p>Seung-bin “imp” Gu is notorious for his former rivalry with Gwang-jin “Piglet” Chae and his unabashed trash talk. But imp is more than just talk, and his recent results speak for themselves. Imp started his career on Samsung White (formerly MVP Ozone), a team that would eventually be one of the greatest of all time. Imp played a key role in their dominant performance -- and 1st place finish -- at the 2014 World Championship.</p>\n\n<p>In the wake of his move to LGD, imp matured. When naysayers said he would fail without his world-class support partner Mata, he proved them wrong. When his interviewers expected trash talk and arrogance, imp displayed humility and courteous manners. But there’s still a monster hiding beneath imp’s newfound modesty. The fact is, imp is very good at League of Legends, and he knows it.</p>","fr_FR":"<p>Seung-bin « imp » Gu est célèbre pour son ancienne rivalité avec Gwang-jin « Piglet » Chae et pour sa gouaille insolente. Mais imp n'est pas celui qui parle le plus : ses récents résultats sont plus éloquents encore que lui. Imp a commencé sa carrière chez Samsung White (anciennement MVP Ozone), une équipe qui allait compter parmi les meilleures de tous les temps. Imp a joué un rôle clé dans ses performances spectaculaires (et sa première place) aux Championnats du monde 2014.</p>\n\n<p>À la suite de son arrivée chez LGD, imp est devenu plus mûr. Quand les mauvaises langues ont prédit qu'il allait forcément échouer sans l'aide de son exceptionnel support, Mata, il leur a prouvé le contraire. Alors que ses interlocuteurs s'attendaient à le voir arrogant et désagréable, imp s'est montré humble et courtois. Mais cela ne veut pas dire qu'il n'y a pas un monstre qui dort derrière la nouvelle modestie dont fait preuve imp. De fait, imp est un excellent joueur de League of Legends et il le sait. Après tout, il est le premier des cinq anciens membres de Samsung White à s'être assuré une place aux Championnats du monde 2015. </p>","pl_PL":"<p>Seung-bin „imp” Gu okrył się złą sławą przez swą niegdysiejszą rywalizację z Gwang-jinem „Pigletem” Chae, a także bezwstydną krytykę innych zawodników. Imp nie jest jednak mocny wyłącznie w gębie, a jego niedawne rezultaty mówią same za siebie. Imp rozpoczął karierę jako zawodnik Samsung White (dawniej MVP Ozone) – drużyna ta przeszła do historii jako jedna z najlepszych. Rola impa w zajęciu przez drużynę pierwszego miejsca podczas mistrzostw świata 2014 była kluczowa.</p>\n\n<p>Po dołączeniu do LGD imp bardzo dojrzał jako gracz. Udowodnił malkontentom mówiącym, że nie poradzi sobie bez światowej klasy zawodnika wsparcia, Maty, jak bardzo się mylą. Ilekroć prowadzący wywiad oczekiwali przechwałek i arogancji, imp wykazywał się grzecznością i pokorą. Pod przykrywką skromności wciąż jednak drzemie w nim bestia. Prawda jest taka, że imp jest świetnym graczem w League of Legends i doskonale zdaje sobie z tego sprawę. Bądź co bądź jako pierwszy spośród pięciu zawodników Samsung White zdołał zająć pierwsze miejsce w mistrzostwach świata 2015. </p>","de_DE":"<p>Seung-bin “imp” Gu ist berühmt berüchtigt wegen seiner früheren Rivalität mit Gwang-jin “Piglet” Chae und ihren unerreichten Provokationen. Aber imp ist mittlerweile mehr als nur heiße Luft, was seine letzten Erfolge unter Beweis stellen. Imp begann seine Karriere bei Samsung White (früher MVP Ozone), einem Team das eventuell eines der besten der Welt für alle Zeit werden kann. Imp spielte eine Schlüsselrolle bei ihren dominanten Auftritten- und beendete die Weltmeisterschaft mit dem Titel. </p>\n\n<p>Durch seinen Wechsel zu LGD reifte imp. Die Pessimisten, die Imp´s Zukunft ohne seinen früheren Supporter Mata zum Scheitern verurteilten, überzeugte er deutlich. Wenn Reporter auf Provokation und Arroganz warteten, zeigte er Menschlichkeit und gutes Benehmen. Aber hinter seinem neugefundenen Anstand ist immer noch der frühere imp versteckt. Denn imp ist verdammt gut in League of Legends und genau das weiß er auch. Nach all dem war er der Erste von seinen früheren Mitspielern von Samsung White, der sich seinen Platz bei Worlds 2015 sicherte. </p>\n","es_ES":"Seung-bin ''Imp'' Gu es famoso tanto por su feroz rivalidad con Gwang-jin ''Piglet'' Chae como por una extraordinaria capacidad de meter la pata al hablar. Pero al margen de comentarios desafortunados, sus actuaciones de los últimos tiempos son aún más elocuentes. Comenzó su carrera en Samsung White (el antiguo MVP Ozone), un equipo que terminaría por convertirse en el mejor de la historia. De hecho, Imp desempeñó un papel fundamental en la exhibición realizada en el Campeonato Mundial de 2014 (y en la victoria que le puso la guinda).\n\nTras su paso a LGD, Imp ha madurado. Cuando algunos agoreros aseguraron que se vendría abajo sin su compañero, el fabuloso apoyo Mata, Imp demostró que se equivocaban. Y cuando toda la prensa esperaba que exhibiera su habitual arrogancia, respondió con una humildad y una educación impropias de él. Pero debajo de esta nueva prudencia se esconde todavía una bestia. El hecho es que Imp es un grandísimo jugador de League of Legends y lo sabe. A fin de cuentas, ha sido el primero de los cinco antiguos integrantes de Samsung White en asegurarse una plaza en el Campeonato Mundial de 2015. \n","pt_BR":"<p>Seung-bin “imp” Gu é famoso por sua antiga rivalidade com Gwang-jin “Piglet” Chae e todas as provovações que a seguiram. Mas imp é mais do que apenas conversa fiada, e seu histórico recente prova isso. Ele começou sua carreira na Samsung White (antes conhecida como MVP Ozone), uma equipe que eventualmente entraria na história como uma das melhores de todos os tempos. Imp foi uma peça chave na atuação dominante - e o primeiro lugar - no Campeonato Mundial de 2014.</p>\n\n<p>Entre todas as conversas durante sua mudança para a LGD, Imp amadureceu. Quando críticos disseram que sem Mata como suporte ele iria falhar, ele provou o contrário. Quando seus entrevistadores esperavam arrogância e provocações, Imp foi cordial e humilde. Mas ainda há um monstro por trás de sua nova modéstia. O fato é: Imp é muito bom em League of Legends. E ele sabe. Afinal, ele foi o primeiro dos cinco ex-integrantes da Samsung White a assegurar sua vaga no Campeonato Mundial 2015.</p>"},"foreignIds":{"drupalId":"681","TRLH3":"1001160026","TRLH1":"1001180006","TRLH4":"1001160026","TRLH2":"1001140006"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":122,"slug":"duke","name":"Duke","firstName":"Hoseong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/duke-e8izehd9.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-06T23:30:15.000Z","bios":{"en_US":"","es_AR":"<p>Ho-seong \"Duke\" Lee ha sido parte de la escena coreana desde el 2013. Al comienzo, jugaba bajo el nombre de \"Leopard\", pero lo cambió a Duke luego de unirse a NaJin Black Sword. Después de la fusión con NaJin, Duke se convirtió en el carrilero superior inicial de NaJin e-mFire, grupo formado poco tiempo antes. Aunque los resultados del equipo fueron muy variados, Duke fue considerado uno de los mejores carrileros superiores de Corea. Luego de más resultados regulares, Duke dejó la organización NaJin a finales del 2015.</p>\n\n<p>Poco después de su partida de NaJin, SKTelecom sumó a Duke para que ocupe el lugar de uno de los mejores carrileros superiores en el 2015, MaRin, luego de que este se fuera a jugar a China. A pesar de que Duke y compañía tuvieron un mal arranque del 2016, encontraron el equilibrio y terminaron adjudicándose el trofeo del torneo de apertura de la LCK 2016. Incluso con la descalificación temprana de SKTelecom en las eliminatorias del torneo de clausura de la LCK 2016, sus esperanzas están puestas en lo más alto de todo: el Mundial. Con su reservada forma de ser, Duke jamás lo aceptaría, pero es uno de los carrileros superiores más emocionantes de Corea, ¡y no se llama Smeb! Valdrá mucho la pena seguirlo en el Mundial.</p>","fr_FR":"<p>Ho-seong « Duke » Lee est présent sur la scène coréenne depuis 2013. Il jouait alors sous le nom de « Leopard », mais il a changé son surnom pour devenir « Duke » après avoir rejoint NaJin Black Sword. Après la fusion de NaJin, Duke a pris la position de toplaner titulaire au sein de l'équipe nouvellement créée des NaJin e-mFire. Même si les résultats de cette nouvelle escouade ont été mitigés, Duke a été perçu comme l'un des meilleurs toplaners de Corée. Voyant que les résultats restaient peu convaincants, Duke a décidé de quitter l'organisation NaJin fin 2015.</p>\n\n<p>Peu après son départ de NaJin, SKTelecom s'est tournée vers Duke pour qu'il reprenne le flambeau de l'un des plus grands toplaners de 2015, MaRin, après son départ vers la Chine. Bien que Duke et ses nouveaux coéquipiers aient quelque peu lutté au début de l'année 2016, ils ont trouvé leurs marques au fil des semaines. C'est à l'approche de la fin du segment de printemps que Duke a finalement développé tout son talent : le timing parfait pour révéler tout son potentiel. Après avoir éliminé les ROX Tigers pour décrocher la couronne du tournoi Champions Spring 2016, Duke va enfin avoir la chance de remporter un deuxième trophée international depuis qu'il a rejoint SKTelecom. Avec sa nature réservée, Duke ne vous le dirait probablement jamais lui-même, mais il est l'un des toplaners les plus en vue de Corée. À votre place, on garderait un œil sur lui.</p>\n","de_DE":"<p>Ho-seong „Duke“ Lee ist bereits seit 2013 Teil der koreanischen Szene. Ursprünglich unter dem Namen „Leopard“ bekannt, wechselte er seinen Namen zu „Duke“, als er den NaJin Black Swords beitrat. Nachdem sich NaJin zusammenschloß, wurde Duke zu einem festen Mitglied als Top-Laner in der Startformation des neu geformten NaJin e-mFire-Teams. Obowohl die Ergebnisse des Teams eher gemischter Natur waren, wurde Duke stets als einer der besten Top-Laner Koreas bezeichnet und als sich die bescheidenden Resultate von NaJin fortsetzten, verließ er NaJin Ende 2015.</p>\n\n<p>Kurz nach seinem Abgang von NaJin wendete sich SKTelecom an Duke und bat ihn, in die Fußstapfen von MaRin, dem besten Top-Laner 2015, zu treten, der nach China gewechselt war. Obwohl Duke und seine Kameraden zu Beginn des Jahres Probleme hatten, fanden sie wieder in die Spur und gewannen den Frühjahrs-Split der LCK 2016. Trotz des frühen Ausscheidens von SKTelecom beim Sommer-Split der LCK 2016 sind die Erwartungen für die Weltmeisterschaft hoch. Duke ist zurückhaltend und würde so etwas nie selbst sagen, aber er ist neben Smeb einer der interessantesten Top-Laner in Korea. An deiner Stelle würde ich ihn bei der WM im Auge behalten.</p>","pl_PL":"<p>Ho-seong „Duke” Lee występuje na koreańskiej scenie od 2013 roku. Zaczynał grać pod ksywką „Leopard”, ale zmienił ją na „Duke” po dołączeniu do NaJin Black Sword. Po połączeniu NaJin, Duke został początkowym górnym w nowoutworzonym NaJin e-mFire. Mimo że wyniki drużyny były przeciętne, Duke był uznawany za jednego z najlepszych górnych w Korei, a po kolejnych podobnych rezultatach Duke opuścił organizację NaJin pod koniec 2015 roku.</p>\n\n<p>Wkrótce po tym SKTelecom odezwało się do Duke'a, aby zastąpił jednego z najlepszych górnych 2015 roku, MaRina, gdy ten odszedł, aby grać w Chinach. Mimo że Duke i reszta mieli problemy na początku 2016 roku, wraz z upływem czasu zaczęli radzić sobie coraz lepiej. Pod koniec wiosennego splitu Duke wreszcie się rozkręcił i to akurat w idealnym czasie. Po pokonaniu ROX Tigers podczas Champions Spring 2016, Duke ma teraz szansę na zdobycie drugiego międzynarodowego trofeum od kiedy dołączył do SKTelecom. Ze względu na swoją skromność, Duke nigdy by tego nie powiedział, ale jest jednym z najbardziej ekscytujących graczy z Korei. Na waszym miejscu obserwowalibyśmy go uważnie.</p>\n","es_ES":"<p>Ho-seong ''Duke'' Lee lleva siendo parte del panorama coreano desde 2013. Antes jugaba bajo el nombre de \"Leopard\", pero cuando llegó a NaJin Black Sword decidió cambiarse el nombre a Duke. Tras la fusión de equipos, Duke se convirtió en el top inicial de NaJin e-mFire. A pesar de que los resultados del equipo eran bastante mixtos, Duke fue considerado uno de los mejores top de Corea, y terminó dejando NaJin a finales de 2015.</p>\n\n<p>Tras dejar NaJin, SKTelecom le pidió a Duke que llenara el vacío que había dejado MaRin, uno de los mejores jugadores de la calle superior de 2015, que había abandonado el equipo para jugar en China. Aunque Duke y compañía lo pasaron mal a principios de 2016, recuperaron fuerzas y se llevaron el trofeo del split de primavera de la LCK 2016 a casa. Puede que SKTelecom tuviese que abandonar antes de lo previsto tras perder en los playoffs del split de verano de la LCK 2016, pero las esperanzas de ganar el Mundial siguen siendo altas. Al ser tan reservado, él nunca os lo diría, pero Duke es uno de los top más prometedores de Corea, aparte de Smeb. Os aconsejamos que sigáis su progreso en el Campeonato Mundial de cerca.</p>","pt_BR":"<p>Ho-seong “Duke” Lee tem participado do cenário coreano desde 2013. Jogando a princípio sob o nome de “Leopard”, ele mudou seu nome para “Duke” quando entrou para a NaJin Black Sword. Depois da união da NaJin, Duke se tornou o topo titular da recém-formada NaJin e-mFire. Apesar dos resultados da equipe terem sido inconsistentes, Duke era visto como um dos melhores topos da Coreia, mas depois de constantes resultados medianos, Duke decidiu sair da formação da NaJin no final de 2015.</p>\n\n<p>Logo depois de sua saída da NaJin, Duke foi chamado pela SK Telecom para substituir um dos melhores topos de 2015, MaRin, após sua saída para jogar na China. Apesar de Duke e seus companheiros terem sofrido um pouco no início de 2016, eles conseguiram encontrar sua sintonia e terminaram levando para casa o troféu da Etapa de Primavera da LCK 2016. Mesmo com a saída precoce da SKT nas eliminatórias da Etapa de Verão da LCK 2016, as esperanças ainda são altas para o Mundial. Tendo uma natureza reservada, Duke provavelmente nunca falaria isso, mas ele é um dos topos mais promissores da Coreia que não tem o nome de Smeb. Eu ficaria de olho nele no Mundial se fosse você.</p>"},"foreignIds":{"drupalId":"2811","TRKR1":"225039","TRLT3":"35084","TRLH1":"1001380052","TRLH2":"1001280022"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":519,"slug":"kid","name":"Kidkid","firstName":"Yan","lastName":"Ge","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kid-d4hufczg.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:24:40.000Z","bios":{"en_US":"","fr_FR":"<p>Ge « Kid » Yan est un incroyable carry AD. Il s'entraîne constamment pour s'améliorer et développer de meilleures synergies avec son partenaire de la voie du bas, Kitties. Et tout cet entraînement a fini par payer : ses performances régulières aux LPL lui a valu le surnom « d'ancre de stabilité ».</p>\n\n<p>À la différence de bon nombre de joueurs pro, Kid n'a pas perdu sa nonchalance en devenant une star, du moins pas en dehors de son rigoureux programme d'entraînement ! Mais quand l'entraînement prend fin, c'est un Kid très relax qu'on retrouve. Quand il est l'heure de s'amuser, il est prêt à se donner à fond.</p>","pl_PL":"<p>Ge „Kid” Yan to rzetelny prowadzący. Ciągle trenuje, starając się poprawić swoją formę i współpracę z partnerem z dołu, Kitties. Ćwiczenia opłaciły się – jego stabilna gra w LPL sprawiła, że zaczęto go nazywać „Ostoją stabilności”.</p>\n\n<p>W przeciwieństwie do innych zawodowców Kid nie przestał być wyluzowany, gdy stal się gwiazdą. Oczywiście nie dotyczy to jego rygorystycznych treningów. Jednak po treningu pojawia się na powrót zrelaksowany Kid. Kiedy przychodzi pora na zabawę, oddaje jej się bez reszty.</p>","de_DE":"<p>Ge “Kid” Yan ist ein Arbeitstier als AD Carry. Er trainiert konstant, um besser zu werden und arbeitet an seiner Synergie mit seinem Supporter, Kitties. Und die ganze Arbeit hat sich ausgezahlt, seine konstanten Leistungen in der LPL brachten ihm den Namen “The Anchor of Stability”.</p>\n\n<p>Im Gegensatz zu anderen Profis opferte er nicht sein entspanntes Wesen, um ein Star zu werden – zumindest nicht abseits seines harten Trainingsplanes! Aber wenn das Training vorbei ist, kommt das entspannte Kind zu Tage. Wenn die Zeit zum Spaß haben gekommen ist, ist er mittendrin dabei. </p>\n","es_ES":"<p>Ge “Kid” Yan es un trabajador por naturaleza. Este tirador se somete a duras sesiones de entrenamiento para que mejoren tanto él como jugador como la sinergia de la calle inferior con su compañero y support, Kitties. Y tanto entrenamiento ha dado sus frutos -- gracias a sus actuaciones consistentes en la LPL se ha ganado el apodo de “El Ancla de la Estabilidad”. </p>\n\n<p>A diferencia de muchos jugadores profesionales, Kid no ha sacrificado su actitud relajada y alegre para convertirse en una estrella -- ¡Al menos fuera de las sesiones de entrenamiento con su equipo! Cuando la práctica termina, descubrimos Kid relajado y bromista. Porque si es la hora de divertirse, ahí está él. </p>\n","pt_BR":"<p>Kid é um atirador incansável. Ele está sempre treinando para evoluir e ter uma sinergia melhor com seu parceiro de rota, Kitties. E tanta dedicação deu resultado -- com atuações consistentes na LPL, ele ganhou o apelido de \"Âncora da Estabilidade\".</p>\n<p>Ao contrário de vários jogadores, ele não sacrificou seu temperamento tranquilo para virar uma estrela -- pelo menos não fora do horário de treino. Quando o jogo acaba, surge o Kid tranquilão, pronto para se divertir.</p>"},"foreignIds":{"drupalId":"2064","TRLH4":"1001160033","TRLH3":"1001160033"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":522,"slug":"rookie","name":"Rookie","firstName":"Ui-jin","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rookie-3ohvy99s.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:27:32.000Z","bios":{"en_US":"","fr_FR":"<p>Eui-jin « RooKie » Song n'est qu'un nouveau venu aux LPL, mais ne vous laissez pas tromper par son pseudo (« le bleu » en anglais) : il a affronté bon nombre des meilleurs joueurs du monde. RooKie a été en première ligne du nouveau départ de KT Rolster en 2014, et le lien qu'il a développé avec son coéquipier jungler de KT, KaKAO, les a aidés à remporter plusieurs matchs des LCK.</p>\n\n<p>Lorsque KaKAO a décidé de participer aux LPL, RooKie a suivi le mouvement. Il a emporté avec lui son affinité pour les mages de contrôle, comme Azir et Orianna, ainsi qu'une tendance à utiliser des coups flamboyants pour remporter les parties. Si cette tendance a quelque peu reflué lors de sa première année aux LPL, RooKie a encore bon nombre de tours dans sa manche, notamment une excellente Cassiopeia.</p>","pl_PL":"<p>Eui-jin „RooKie” Song może i od niedawna gra w LPL, ale walczył już z najtrudniejszymi przeciwnikami na świecie. RooKie był główną siłą napędową KT Rolster w 2014 roku, a przyjaźń nawiązana z dżunglerem KaKAO pozwoliła wygrać wiele meczów w LCK.</p>\n\n<p>Kiedy KaKAO przeniósł się do LPL, RooKie zabrał się z nim. Zawsze lubił kontrolujących magów takich jak Azir czy Orianna i dalej ma tendencje do wygrywania popisowymi akcjami. Chociaż jego popisy nieco osłabły podczas pierwszego roku w LPL, RooKie wciąż ma kilka asów w rękawie, np. grę Cassiopeią.</p>","de_DE":"<p>Eui-jin “RooKie” Song mag zwar neu in der LPL sein, aber lass dich nicht von seinem Namen täuschen – er spielte schon gegen einige der besten Teams auf der Welt. RooKie war bei der Verjüngung von KT Rolster 2014 vorne mit dabei, und die Verbindung mit seinem Teamkameraden und Jungler von KT KaKAO trug dazu bei, viele Spiele in der LCK zu gewinnen. </p>\n\n<p>Als KaKAO in die LPL wechselte, zog RooKie nach. Er brachte eine Vorliebe für Kontrollmagier wie Azir und Orianna zu seinem neuen Arbeitsplatz mit und eine Tendenz zu riskanten Zügen, um Spiele zu gewinnen. Während sein Vertrauen auf riskante Spielzüge während seinem ersten Jahr in der LPL verblasste, packt er immer wieder ein Ass aus dem Ärmel – inklusive einer tödlichen Cassiopeia. </p>\n","es_ES":"<p>Puede que Eui-jin “RooKie” Song sea relativamente nuevo en la LPL, pero no dejes que su nombre te engañe -- ha jugado contra algunos de los rivales más fuertes del mundo. RooKie estuvo al frente en el proceso de renovación que sufrió KT Rolster durante 2014, y el lazo que desarrolló con su compañero en la jungla KaKAO ayudó a su equipo a ganar bastantes partidos en la LCK. </p>\n\n<p>Cuando KaKAO se fue a la LPL, RooKie hizo las maletas y se fue con él. En China, ha desarrollado una afinidad por magos que controlan a sus enemigos como Azir y Orianna, y una tendencia a depender de jugadas brillantes para ganar las partidas. Aunque durante su primer año en la LPL se ha vuelto más sobrio, RooKie sigue teniendo algún as en la manga -- incluída una Cassiopeia demoledora. </p>\n","pt_BR":"<p>RooKie pode ser novo na LPL, mas não se engane. Ele já jogou contra alguns dos melhores jogadores do mundo. Ele foi parte fundamental do rejuvenescimento da KT Rolster em 2014, e sua sinergia com o caçador KAKAO ajudou o time a vencer muitas particas na LCK.</p>\n<p>Quando KAKAO mudou-se da Coreia para a China, RooKie foi junto. Levou consigo o controle de magos como Azir e Orianna, criando uma tendência de jogadas exuberantes para vencer partidas. Apesar de essa exuberância ter perdido o encanto com o passar do tempo, ele ainda tem vários truques na manga -- incluindo uma Cassiopeia venenosa.</p>\n","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “RooKie” 송의진 선수가 LPL에 진출한 진 그리 오래되지 않았지만 아이디대로 신인인 건 아닙니다. 세계에서 가장 치열한 리그에서 뛴 적 있는 선수죠. RooKie 선수는 kt 롤스터가 2014년 팀을 재정비할 때 최전선에 섰고 같은 팀의 정글러 KaKAO 선수와 멋진 호흡으로 LCK에서 팀의 선전을 이끌었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">KaKAO 선수가 LPL로 이적할 때, RooKie 선수도 따라가면서 아지르나 오리아나 같은 장악형 마법사 플레이와 현란한 플레이로 승리하는 전략을 새 팀에 선사했죠. 비록 현란한 플레이에 의존하는 플레이는 LPL 진출 첫해를 보내며 사라졌지만 그 외에도 적을 떨게 하는 카시오페아 플레이처럼 여러 전술을 갖춘 선수입니다. </p>\n"},"foreignIds":{"drupalId":"2149","TRLH3":"1001160032","TRLH4":"1001160032","TRLH1":"1001180003","TRLH2":"1001140003"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":541,"slug":"eimy","name":"Eimy","firstName":"Dan","lastName":"Xie","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/eimy-fmyi9due.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:36:23.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4513"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":589,"slug":"pyl","name":"Pyl","firstName":"Bo","lastName":"Chen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pyl-ahtd159j.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:30:25.000Z","bios":{"en_US":"<p>\nBo “Pyl” Chen is one of the best supports in the LPL, with much of his strength coming from the diverse champion pool he brings to the bot lane and his dynamic shot-calling. He’s no slouch on his mechanics either; His Thresh is a must-ban, his Alistar tramples the competition, and his Janna always finds the right position to blow away the opposition. But as the captain of LGD, his ability to call out rotations and map objective prioritization truly set him apart. Pyl is the glue that holds LGD together.\n</p>","fr_FR":"<p>\nChen « Pyl » Bo est l'un des meilleurs supports des LPL, et l'une de ses principales forces, c'est la variété de champions qu'il peut faire intervenir sur la voie du bas et sa capacité à donner des ordres en s'adaptant à la situation. Il est également loin d'être manchot en ce qui concerne les compétences techniques : son Thresh est à bannir absolument, son Alistar écrabouille l'adversaire et sa Janna est toujours au bon endroit au bon moment pour souffler l'ennemi. Mais en tant que capitaine de LGD, c'est surtout sa capacité à donner des ordres et à définir les priorités pour les objectifs de la carte qui font la différence. Pyl est le ciment qui fait tenir LGD ensemble. Il devrait continuer dans cette optique lorsqu'il accueillera ses amis des LPL à l'événement All-Star 2015 avec son fameux sourire.\n</p>","pl_PL":"<p>\nChen „Pyl“ Bo gehört zu den besten Supportern in der LPL, und ein großer Teil seiner Stärke beruht auf seinem breitgefächerten Championpool, den er in die untere Lane mitbringt, und auf seinem dynamischen Shot-Calling. Doch auch seine Mechaniken können sich sehen lassen. Seinen Thresh zu bannen ist Pflicht, sein Alistar zertrampelt seine Rivalen und seine Janna findet immer die richtige Position, um den Gegner auszuschalten. Was ihn jedoch als Teamleiter wirklich ausmacht, ist seine Fähigkeit, Wechsel anzuordnen und bei den Kartenzielen Prioritäten zu setzen. Pyl ist der Leim, der LGD zusammenhält. Dies werden wir auch beim All-Star-Event 2015 erleben, wenn er die anderen Stars der LPL mit seinem berühmten Lächeln begrüßt.\n</p>","de_DE":"<p>Chen “Pyl” Bo ist einer der besten Supporter in der LPL, was vor allem von seinem großen Championpool für die Bot-Lane und seinem dynamischen Shotcalling herrührt. Aber auch seine Mechaniken sind nicht die schlechtesten; sein Thresh ist ein Must-Ban, sein Alistar trampelt die Spiele nieder und seine Janna findet immer die richtige Position, um die Gegner wegzuwehen. Zudem hebt ihn seine Fähigkeit als Kapitän das Team über die Karte zu navigieren und sein Fokus auf Objekte hervor. Pyl ist der Kleber, der LGD zusammenhält. </p>\n\n<p>Tatsächlich sind seine Fähigkeiten so begehrt, dass sich selbst Seung-bin “imp” Gu für LGD entschieden hat, nur um mit Pyl zusammenspielen zu können. Während er vorher seine Bot-Lane-Partner übertroffen hat, fand er mit Imp einen Partner, der jeden seiner Züge mitgehen kann. </p>\n","es_ES":"<p>\nChen ''Pyl'' Bo es uno de los mejores apoyos de la LPL, gracias a la diversidad del arsenal de campeones que puede usar en la calle inferior y a su dinamismo a la hora de marcar jugadas. Y por mecánicas tampoco es manco: Aunque los rivales bloqueen a su Thresh (como suelen hacer), es perfectamente capaz de pisotearlos con Alistar y siempre encuentra el modo de hacerlos volar por los aires con Janna. Como capitán de LGD, su habilidad para organizar las rotaciones y priorizar los objetivos lo convierte en único. Pyl es el pegamento que mantiene unido a LGD. Y seguirá siéndolo en el All-Star 2015, cuando luzca su ya famosa sonrisa para dar la bienvenida a otras estrellas de la LPL.\n</p>","pt_BR":"<p>Chen “Pyl” Bo é um dos melhores suportes na LPL, com muito de sua força vindo de um vasto leque de Campeões aliado à sua dinâmica de chamadas de equipe. Ele não é fraco em mecânicas também; seu Thresh é um banimento quase permanente, seu Alistar atropela as rotas, e sua Janna sempre sabe o lado certo para jogar os furacões. Mas como capitão da LGD, sua habilidade de chamar rotações, posicionar a equipe para objetivos e pressão pelo mapa é o que o diferencia. Pyl é a cola que segura a LGD junta.</p>\n\n<p>De fato, as habilidades de Pyl são tão aclamadas que Seung-bin “imp” Gu escolheu propositalmente a LGD somente para jogar com o suporte. Se antes ele brilhava mais do que seus parceiros de rota, quando Imp entrou na equipe, Pyl encontrou um companheiro de equipe que pudesse ser o seu par perfeito.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Chen “Pyl” Bo 선수는 LPL 최고의 서포터로 꼽힙니다. 넓은 챔피언 폭과 적극적인 지휘에서 그 저력이 나오는 선수입니다. 게다가 피지컬까지 뛰어납니다. 항상 쓰레쉬를 밴당하고 알리스타를 플레이할 땐 상대를 짓뭉개버리죠. 잔나를 잡으면 항상 정확한 위치 선정으로 상대를 날려버립니다. 그리고 LGD의 주장으로서 맵 상의 주요 목표물을 노릴 시기나 어떤 목표물을 먼저 노릴지 정하는 능력이 아주 뛰어납니다. Pyl 선수는 LGD를 하나로 묶는 구심점이기도 합니다. 이번 올스타 대회에서 다른 LPL 올스타를 만났을 때도 특유의 미소로 반기며 팀을 끈끈하게 만들어 주리라 기대해 봅니다. </p>"},"foreignIds":{"drupalId":"2069","TRLH3":"1001160027","TRLH4":"1001160027","TRLH1":"1001180005","TRLH2":"1001140005"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":605,"slug":"godv","name":"GodV","firstName":"Zhen","lastName":"Wei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/godv-awtbwftn.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:35:21.000Z","bios":{"en_US":"","fr_FR":"<p>Wei « We1less » Zhen, précédemment connu sous le nom de GODV, a placé la barre très haut lorsqu'il a choisi son premier surnom. Mais, sachant que We1less est devenu l'un des mid laners les plus réputés des LPL, il savait peut-être exactement ce qu'il faisait. Sa carrière n'a pas été de tout repos, mais on dirait que We1less est enfin sur le point d'arriver à ses fins.</p>\n\n<p>À l'origine, We1less était meneur de jeu chez Vici Gaming. Il jouait de façon égoïste et, s'il voyait une opportunité de plonger dans le combat, il n'hésitait pas une seule seconde. Évidemment, cette stratégie ne portait pas forcément ses fruits, que ce soit pour lui ou pour son équipe. Cependant, avec le temps, We1less est devenu plus réfléchi et a développé son esprit d'équipe. C'est un joueur dynamique qui réfléchit toujours à ce qu'il pourrait apporter à son équipe plutôt que le contraire.</p>\n\n<p>Même si We1less a eu du mal à rejoindre la Faille en 2016 à cause d'une blessure persistante, il a pu prouver son énorme potentiel de jeu à la toute fin du segment d'été. Enregistrant des scores hallucinants, We1less nous a montré à quel point son niveau était élevé. Ses éclairs de génie ont ébloui les fans, qui l'ont choisi pour participer à l'événement All-Stars 2016 de Barcelone. Il déborde de talent et, à en croire ses dernières performances, ses sorts risquent d'être précoces et nombreux. </p>","pl_PL":"Wei „We1less” Zhen, dawniej znany jako GODV, całkiem wysoko ustawił sobie poprzeczkę, wybierając swoje stare przezwisko. Jednak biorąc pod uwagę, że We1less został okrzyknięty jednym z najlepszych środkowych w LPL, może dokładnie wiedział, co robi. Jego podróż była trudna, ale wydaje się, że We1less nareszcie dociera do celu.</p>\n\nDawno, dawno temu We1less był rozgrywającym w Vici Gaming. Grał egoistycznie i gdy tylko dostrzegał okazję do ataku, zazwyczaj z niej korzystał. Oczywiście taka strategia nie zawsze kończyła się dobrze dla niego lub jego drużyny. Teraz jednak We1less jest rozważniejszy i bardziej zorientowany na drużynę. To dynamiczny zawodnik, który zawsze myśli o tym, jak może zapewnić korzyści swojej drużynie (a nie odwrotnie).</p>\n\nChociaż We1less miał problemy z grą na Summoner’s Rift w 2016 roku z powodu uporczywej kontuzji, pod sam koniec letniego splitu zaprezentował swój pełny potencjał jako zawodnik. Zdobywając naprawdę niesamowite wyniki punktowe, We1less pokazał nam, że ustawił sobie poprzeczkę naprawdę wysoko. Jego przebłyski geniuszu oszołomiły fanów, którzy zagłosowali na niego i wysłali na wydarzenie All-Star 2016 w Barcelonie. Ma ogromy potencjał i jeśli można robić założenia w oparciu o jego wcześniejsze występy, to czary We1lessa na turnieju będą latały szybko i często. \n","de_DE":"<p>Wei „We1less“ Zhen, ehemals bekannt als GODV, legte die Latte für sich selbst ziemlich hoch, als er sich für seinen alten Namen entschied. Aber wenn man bedenkt, dass We1less zu einem der am meisten gelobten Mid-Laner der LPL wurde, dann könnte man meinen, er wusste damals ganz genau, was er tat. Sein Weg war steinig, aber es scheint, als wäre We1less endlich angekommen.</p>\n\n<p>Vor langer Zeit war We1less der Spielmacher von Vici Gaming. Er war ein egoistischer Spieler, der so gut wie jede Gelegenheit nutzt, einen Gegner bis zum Schluss zu verfolgen. Natürlich endete diese Strategie nicht immer gut für ihn oder seine Mannschaft. Heute spielt We1less jedoch wesentlich berechnender und teamorientierter. Er ist ein dynamischer Spieler, der immer darüber nachdenkt, wie er seiner Mannschaft helfen kann.</p>\n\n<p>Und obwohl We1less 2016 mit einer hartnäckigen Verletzung zu kämpfen hatte, war sein Potenzial gegen Ende des Sommer-Splits klar zu erkennen. We1less lieferte ein paar unglaubliche Ergebnisse ab und zeigte uns, wie gut er wirklich sein kann. Er ließ immer wieder seine Klasse aufblitzen und begeisterte damit die Fans, die ihn beim All-Stars-Event 2016 in Barcelona sehen wollen. Er steckt voller Potenzial, und wenn man an seine vergangenen Leistungen denkt, ist davon auszugehen, dass er schnell mit viel Zaubern um sich schleudern wird.</p>","es_ES":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores de la calle central más codiciados de la LPL, puede que supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del split de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes.</p>","pt_BR":"<p>Wei “We1less” Zhen, antes conhecido como GODV, subiu bastante o patamar quando escolheu seu antigo apelido. Porém, considerando que We1less se tornou um dos jogadores de meio mais prolíficos da LPL, é provável que ele soubesse direitinho o que estava fazendo. Sua jornada foi difícil, mas parece que We1less finalmente está para chegar.\n\nUm dia, We1less foi um criador de jogadas na Vici Gaming. Ele jogava de forma egoísta e, se tivesse a oportunidade de mergulhar, ele normalmente o fazia. Obviamente, essa estratégia nem sempre dava certo, tanto para ele, quanto para sua equipe. Agora, We1less é mais calculado e pensa mais na equipe. Ele é um jogador dinâmico, sempre pensando em como ele pode beneficiar sua equipe, em vez do contrário.</p>\n\n<p>Apesar de We1less ter tido problemas entrando em Summoner’s Rift em 2016 com uma lesão, seu grande potencial de jogo estava à mostra no fim da Etapa de Verão. Ostentando alguns placares ridiculamente bons, We1less nos mostrou quão alto pode chegar. Seu desempenho incrível deixou uma boa impressão nos fãs que deixaram claro que o queriam no Evento All-Star 2016 em Barcelona. Ele está repleto de potencial para grandes jogadas e, se seus desempenhos anteriores são qualquer indicador, vai ter muito feitiço voando pelo mapa. </p>","cs_CZ":"<p>Wei „We1less“ Zhen, dříve známý jako GODV, si při výběru své předchozí přezdívky nasadil laťku pěkně vysoko. Ale jelikož se z něj stal jeden z nejsledovanějších středových lajnařů v LPL, možná věděl, co dělá. Jeho cesta na výsluní byla trnitá, ovšem zdá se, že konečně nese svoje ovoce.</p>\n\n<p>We1less býval kapitánem Vici Gaming. Hrával sobecky, a když se mu naskytla příležitost vrhnout se po hlavě do boje, jen málokdy jí odolal. Tato strategie samozřejmě pro něj i jeho tým nekončila pokaždé dobře. Nyní je We1less prozíravější a víc myslí na své spolubojovníky. Hraje dynamicky a neustále přemýšlí, čím by mohl svému týmu prospět on, ne naopak.</p>\n\n<p>A ačkoliv se kvůli nepříjemnému zranění podíval We1less do Žlebu v roce 2016 jen málokdy, na konci letního splitu bylo jeho řádění na bojišti hodně znát. Jeho statistiky poskočily do závratných výšin a ukázal nám, co můžeme očekávat od skutečně hvězdného hráče. Fanoušky tyto záblesky dokonalosti náležitě okouzlily, takže jej v hlasování vyslali na turnaj All-Star 2016. Dokáže provádět naprosto úchvatné akce a z jeho předchozích výkonů lze soudit, že i v Barceloně budou kouzla létat často a již krátce po zahájení utkání. </p>","el_GR":"<p>Ο Wei “We1less” Zhen, γνωστός στο παρελθόν ως GODV, ανέβασε μόνος του ψηλά τον πήχη με το όνομα που διάλεξε τότε. Από την άλλη πλευρά, ο We1less έχει γίνει ένας από τους πιο διάσημους παίκτες μεσαίας λωρίδας στο LPL, επομένως ίσως και να μην το έκανε κατά τύχη. Η διαδρομή του ήταν πολύ δύσκολη, αλλά όλα δείχνουν ότι ο We1less κοντεύει να φτάσει στον προορισμό του.</p>\n\n<p>Μια φορά κι έναν καιρό, ο We1less ήταν ο οργανωτής των Vici Gaming. Έπαιζε με πολύ εγωιστικό τρόπο και, όταν έβλεπε μια ευκαιρία να χωθεί στη δράση, ποτέ δεν την άφηνε να πάει χαμένη. Προφανώς, αυτή η στρατηγική δεν είχε πάντα καλή κατάληξη για αυτόν και για την ομάδα του. Τώρα, όμως, ο We1less παίζει πολύ πιο ομαδικά και στρατηγικά. Είναι ένας ευέλικτος παίκτης που σκέφτεται πάντα πώς μπορεί να βοηθήσει την ομάδα του και όχι πώς μπορεί να βοηθήσει αυτόν η ομάδα.</p>\n\n<p>Παρόλο που ο We1less δυσκολεύτηκε αρκετά να βρει το ρυθμό του στο 2016 λόγω ενός πολύ επίμονου τραυματισμού, έδειξε πολύ καλά τι μπορεί να κάνει στο τέλος του Summer Split. Σε μια σειρά αγώνων όπου πέτυχε εξωπραγματικές επιδόσεις, ο We1less έδειξε σε όλους πόσο ψηλά μπορεί να φτάσει. Αυτές οι θεαματικές του εκλάμψεις γοήτευσαν το κοινό που τον έστειλε στο Τουρνουά All-Star 2016. Είναι πάντα έτοιμος για μια μεγάλη κίνηση και, αν κρίνουμε από τις προηγούμενες εμφανίσεις του, θα δούμε πολλά ξόρκια στο παιχνίδι, συχνά και από νωρίς. </p>","hu_HU":"<p>Wei „We1less” Zhen, korábbi nevén GODV, elég magasra tette a lécet a korábbi neve megválasztásával. De mivel We1less lett az LPL egyik legfelkapottabb középső ösvényese, valószínűleg már akkor is tudta, hogy mi a dörgés. Nem volt egyszerű az út, de úgy tűnik, hogy We1less révbe érhet.</p>\n\n<p>We1less régebben a Vici Gaming irányítója volt. Önzően játszott, és ha meglátott egy lehetőséget, azonnal lecsapott rá. Ez a „stratégia” nyilván nem mindig volt előnyös a csapata számára. Mára We1less sokkal számítóbb és csapatközpontúbb lett. Dinamikus játékos, aki mindig azt nézi, hogyan segítheti a csapatát, és nem fordítva.</p>\n\nWe1less nehezen tudott belevágni a 2016-os évbe egy zavaró sérülés miatt, de a nyári szakasz végén ismét megcsillogtatta játéktudását. We1less elképesztő statisztikákat produkált, jelezve, hogy a határ számára a csillagos ég. Ezek a felvillanások is meggyőzték a rajongókat, hogy ott a helye a 2016-os All-Star gálán Barcelonában. Mindig ott van benne egy látványos akció esélye, és ha a korábbiak alapján kellene tippelni, akkor hamar el fog szabadulni a pokol a Szurdokban. \n","it_IT":"<p>Wei \"We1less\" Zhen, già noto come GODZ, ha scelto per se stesso un nome pieno di aspettative. E a quanto pare sapeva cosa stava facendo, visto che è riuscito a diventare uno dei centrali più apprezzati della LPL. Il suo viaggio non è stato dei più semplici, ma a quanto pare sta per arrivare alla sua meta.</p>\n\nIn passato We1less ha fatto il regista in Vici Gaming. Il suo stile era molto egoistico e sfruttava ogni occasione per tuffarsi all'attacco. Ovviamente, quella strategia non funzionava sempre. Ora però We1less è diventato più riflessivo e aperto al gioco di squadra. È un giocatore dinamico, sempre intento a pensare a come aiutare il proprio team, invece che usare il supporto della squadra a suo beneficio.</p>\n\nPur avendo avuto difficoltà ad affacciarsi sulla Landa nel 2016 a causa di un infortunio, il suo grande potenziale è stato sotto gli occhi di tutti verso la fine del Summer Split. Con le sue cifre da capogiro, We1less ci ha dimostrato di non avere limiti. Le sue brillanti giocate hanno abbagliato i fan, che hanno votato per la sua presenza all'All-Star 2016 di Barcellona. We1less ha un potenziale incredibile, e a giudicare dalle sue prestazioni passate vedremo qualcosa di straordinario. \n","ro_RO":"Wei ''We1less'' Zhen, cunoscut în trecut ca GODV, și-a stabilit un standard destul de înalt când și-a ales vechiul nume. Dar, având în vedere că a devenit unul dintre cei mai titrați jucători de pe culoarul din mijloc din LPL, poate că era conștient de ceea ce face. Drumul său a fost unul cu suișuri și coborâșuri, dar se pare că We1less e în sfârșit aproape de destinație.</p>\n\nDemult, We1less era playmaker la Vici Gaming. Era un jucător egoist; dacă vedea o oportunitate de a se arunca în luptă, de obicei profita de ea. Evident, acea strategie n-a fost întotdeauna strălucită, nici pentru el și nici pentru Vici. Acum, însă, We1less este mai calculat și mai atent la interesele echipei. E un jucător dinamic, care se gândește mereu cum își poate ajuta coechipierii, în loc să se gândească cum îl pot ajuta ei pe el.</p>\n\nChiar dacă We1less nu a putut intra în Rift în 2016 din cauza unei accidentări, potențialul său de a crea situații favorabile a ajuns în lumina reflectoarelor spre finalul etapei de vară. Reușind niște scoruri incredibile, We1less ne-a arătat cât de bun este cu adevărat. Reușitele sale impresionante i-au uimit pe fani, care l-au votat la All-Star Event 2016 din Barcelona. Are un potențial uriaș de a crea faze spectaculoase și, dacă e să ne luăm după reușitele sale din trecut, va lansa vrăji des, încă de la început. \n","es_AR":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>","es_MX":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>"},"foreignIds":{"drupalId":"4529","TRLH3":"1001360058","TRLH4":"1001310058"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":998,"slug":"jinoo","name":"Jinoo","firstName":"Jin-woo","lastName":"Lim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jinoo-53memnp9.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:32:05.000Z","updatedAt":"2016-02-01T22:57:58.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1431,"slug":"intruder","name":"Intruder","firstName":"Sheng","lastName":"Tang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/intruder-3ffozme5.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:35:52.000Z","updatedAt":"2016-08-24T21:36:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1664,"slug":"megan","name":"Megan","firstName":"Liu-Yi","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/megan-900drhog.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:38:18.000Z","updatedAt":"2017-06-06T23:28:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1871,"slug":"ning","name":"Ning","firstName":"Zhen-Ning","lastName":"Gao","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T18:39:15.000Z","updatedAt":"2017-04-16T18:39:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1980,"slug":"west","name":"West","firstName":"Long","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:18:02.000Z","updatedAt":"2017-06-06T23:18:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1981,"slug":"theshy","name":"TheShy","firstName":"Seung-Lok","lastName":"Kang","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:24:15.000Z","updatedAt":"2017-06-06T23:24:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1982,"slug":"rio","name":"Rio","firstName":"Fu-Hua","lastName":"Wen","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:28:00.000Z","updatedAt":"2017-06-06T23:28:00.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79}],"scheduleItems":[{"id":"AVx_m21pQMQFcjhwbQ7f","content":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:match:81182ba1-33b1-4762-be65-84ca231937a1","scheduledTime":"2017-07-27T09:00:00.121+0000","tags":{"blockLabel":"7","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:bracket:fc6c3d1a-8bb5-46e8-b633-3adcfe627827","leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06"},"match":"81182ba1-33b1-4762-be65-84ca231937a1","tournament":"465a2d10-2a73-43cb-a627-f0c87b564f06","bracket":"fc6c3d1a-8bb5-46e8-b633-3adcfe627827","league":"7"}],"gameIdMappings":[],"videos":[{"id":8188,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:921aa39f-2a49-4ede-96ec-bcf06f798d24","source":"https://www.youtube.com/embed/-ktE4uZpIN4?wmode=transparent&start=3024&rel=0","createdAt":"2017-07-27T18:16:05.000Z","updatedAt":"2017-07-27T18:16:05.000Z","game":"921aa39f-2a49-4ede-96ec-bcf06f798d24"},{"id":8189,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:6882818d-a18f-4113-b2ad-e1da78d3ce59","source":"https://www.youtube.com/embed/-ktE4uZpIN4?wmode=transparent&start=5965&rel=0","createdAt":"2017-07-27T18:16:49.000Z","updatedAt":"2017-07-27T18:16:49.000Z","game":"6882818d-a18f-4113-b2ad-e1da78d3ce59"}],"htmlBlocks":[],"match":{"id":"81182ba1-33b1-4762-be65-84ca231937a1","name":"IG-vs-LGD","position":3,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],"games":{"921aa39f-2a49-4ede-96ec-bcf06f798d24":{"id":"921aa39f-2a49-4ede-96ec-bcf06f798d24","name":"G1","generatedName":"IG|LGD|G1|81182ba133b14762be65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501179155425,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501178804775,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"70c4f454-f648-4344-85f9-9bfc82aa503b":{"id":"70c4f454-f648-4344-85f9-9bfc82aa503b","name":"G3","generatedName":"IG|LGD|G3|81182ba133b14762be65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6882818d-a18f-4113-b2ad-e1da78d3ce59":{"id":"6882818d-a18f-4113-b2ad-e1da78d3ce59","name":"G2","generatedName":"IG|LGD|G2|81182ba133b14762be65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}],"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501179235740,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501178770158,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501179235740,"source":"bestOf","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501179155425,"source":"bestOf","closed":true},{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2c2e0afa-c947-4225-8d4b-7100711447d7"}]],"timestamp":1501178770158,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"2c2e0afa-c947-4225-8d4b-7100711447d7":0,"b4bc775a-2241-4829-81da-9c1a5e28126f":1}}}