{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":105,"slug":"kt-rolster","name":"kt Rolster","guid":"be6e39bf-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/kt-rolster-8rh5ukll.png","acronym":"KT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:44.000Z","bios":{"en_US":"<p>KT Rolster built a name for themselves in Korea through their strong objective control and individual laning talent. If their lanes went poorly, KT relied on their star junglers inSec and KaKAO to bail them out. Unfortunately for KT, their strategy faltered in the wake of inSec and KaKAO leaving to join teams in the LPL.</p>\n\n<p>After years of playing second fiddle to SK telecom T1, KT Rolster knocked their rivals out of the 2016 LCK Summer Playoffs. However, KT lost to ROX in a closely contested LCK Finals match, forcing them to play in the Regional Qualifier, where they were knocked out by Samsung Galaxy. Entering 2017 with a rebuilt roster packed with star power, they'll be sure to compete for the top spot in the LCK.</p>","fr_FR":"KT Rolster s'est fait un nom en Corée avec sa maîtrise des contrôles d'objectifs et l'habileté de ses membres sur les voies. Si la phase de voie se présentait mal, KT pouvait toujours compter sur les junglers inSec et KaKAO pour les sortir du pétrin. Malheureusement pour KT, cette stratégie est entrée dans une impasse quand inSec et KaKAO les ont quittés pour une autre équipe. Cela dit, quand une étoile est passée, une autre monte. Les espoirs de KT Rolster aux LCK reposent désormais sur les épaules des très capables ssumday, Arrow et Nagne.","pl_PL":"KT Rolster zyskało sławę w Korei dzięki swojej niezwykle skutecznej kontroli celów oraz talentowi do walki w alejach. Jeżeli gracze w alejach się nie popisali, KT polegało na swoich dżunglerach, inSecu i KaKAO, aby zaprowadzili porządek. Niestety dla KT strategia ta przestała działać w wyniku odejścia inSeca i KaKAO, którzy dołączyli do drużyn w LPL. Jednakże gdy jedna gwiazda znika, na jej miejscu pojawia się nowa. Marzenia KT Rolster o LCK spoczywają teraz w rękach ssumdaya, Arrowa i Nagne.","de_DE":"KT Rolster haben sich in Korea einen Namen durch ihre starke Objective-Kontrolle und individuellem Talent gemacht. Ssumday ist der Superstar-Top-Laner in Korea und lässt nicht mehr los, sobald er sich einen Vorteil verschaffen kann. Die ersten Minuten der Spiele mit KT zeichnen sich stets durch den immensen Druck des Jungle/Support-Duos aus. Es ist zu erwarten, dass der gegnerische Jungler bei ihrem Anblick in Angstschweiß ausbricht, wenn er nicht weiß, sein Territorium zu verteidigen.","es_ES":"KT Rolster se ha ganado una reputación en Corea por méritos propios gracias a un control férreo de sus objetivos y el talento de sus jugadores. Si en las calles la cosa no iba bien ahí estaba su jungla estrella para solucionar la partida, primero inSec y luego KaKAO. Desafortunadamente para KT, su estrategia falló cuando tanto inSec primero como KaKAO después abandonaron Corea para probar suerte en la LPL china. Pero cuando una estrella se va, otra se alza. Los sueños de KT Rolster residen ahora en ssumday, Arrow y Picaboo, que harán todo lo posible por llevar a su equipo a lo más alto.","pt_BR":"A KT Rolster construiu seu nome na Coreia com um estilo de jogo baseado em forte controle de objetivos e muito talento individual nas rotas. Se eles perdessem na rota, podiam confiar nos caçadores inSec e KaKAO para salvar o dia. Infelizmente, ambos deixaram o time para ir jogar na LPL. Mas quando uma estrela se apaga, outra surge no lugar. Os sonhos da KT agora estão depositados em Ssumday, Arrow e Piccaboo.\n","ko_KR":"<p>KT Rolster는 강력한 오브젝트 관리와 라인전 경기력으로 유명세를 탔습니다. 라인전에서 적팀에 밀리게 돼도 스타 정글러 inSec 선수와 KaKAO 선수가 팀을 승리로 이끌어주었죠. 하지만 두 정글러가 LPL에 진출하며 팀을 떠나자 팀 전략에 구멍이 났습니다. 하지만 별이 떠난 자리에는 다른 별이 뜨기 마련. 이제 KT Rolster는 ssumday 선수와 Arrow 선수를 선두에 내세워 전장에 나서고 있습니다.</p>"},"foreignIds":{"drupalId":"642"},"players":[69,72,304,749,769,2050],"starters":[69,72,304,749,769],"subs":[2050]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":69,"slug":"mata","name":"Mata","firstName":"Sehyoung","lastName":"Cho","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mata-7wmee6cg.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-06T14:11:34.000Z","bios":{"en_US":"<p>Sehyoung \"Mata\" Cho is one of the few League players who hardly needs an introduction. Mata is not just a World Champion, but the MVP of the series that won Samsung White the 2014 world title and Summoner's Cup. He’s one of the most well known Thresh players in the world, and his tactical mind is legendary.</p>\n\n<p>On the Rift, Mata is an invaluable addition to Royal Never Give Up, and has achieved an incredible synergy with his hot-headed, wildly-aggressive ADC partner Uzi. Unfortunately, his stellar play wasn’t enough to carve out a win against the eventual World champions, SK Telecom T1. Mata will have a chance to flash hook his way to some redemption in 2017.</p>","es_AR":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","fr_FR":"<p>Se-hyeong « Mata » Cho est l'un des rares joueurs de League of Legends qu'on ne présente plus. Mata n'est pas seulement champion du monde, il est aussi le MVP de la série qui a valu à Samsung White le titre de championne du monde 2014 et la Coupe de l'invocateur. Il est l'un des joueurs de Thresh les plus connus au monde, et son esprit tactique est légendaire.</p>\n\n<p>Sur la Faille, Mata est un ajout de taille pour Royal Never Give Up, et il a établi une synergie extraordinaire avec Uzi, son partenaire ADC impétueux et agressif. Malheureusement, son jeu exemplaire n'a pas suffi à vaincre les futurs champions du monde de SK Telecom T1. Mata trouvera peut-être la rédemption à coups de Saut éclair et de Grappin grâce à sa nomination à l'événement All-Stars 2016 de Barcelone. Accompagné de son partenaire de voie Uzi, la plus grande contribution de Mata se jouera dans sa façon de superviser le champ de bataille de la Faille de l'invocateur. Avec le commandant Mata à la barre, le vaisseau All-Stars de la Chine a une chance de se maintenir à flot, même si les probabilités ne jouent pas en leur faveur.</p>","es_ES":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de League que casi no necesita una presentación. No solo es un campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White ganase el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia increíble con su impulsivo e increíblemente agresivo ADC, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de calle Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","de_DE":"<p>Se-hyeong „Mata“ Cho gehört zu den wenigen League-Spielern, die man nicht groß vorstellen muss. Mata ist nicht nur ein Weltmeister, er wurde auch noch zum wertvollsten Spieler gewählt, als Samsung White 2014 Weltmeister wurde und den Beschwörerpokal gewann. Er ist einer der bekanntesten Thresh-Spieler der Welt und seine Taktiken sind legendär.</p>\n\n<p>In der Kluft ist Mata für Royal Never Give Up unbezahlbar und harmoniert unglaublich gut mit seinem hitzköpfigen, extrem aggressiven AD-Carry-Partner Uzi. Leider reichte seine überragende Leistung nicht, um die späteren Weltmeister, SK Telecom T1, zu besiegen. Doch Mata hat genug Stimmen bekommen, um am All-Stars-Event 2016 in Barcelona teilzunehmen, wo er die Chance auf Wiedergutmachung bekommt. Zusammen mit seinem Lane-Partner Uzi wird Matas größter Beitrag seine Übersicht in der Kluft der Beschwörer sein. Wenn Mata das Kommando übernimmt, stehen die Chancen gut, dass Chinas All-Stars-Schiff nicht kentern wird, selbst wenn alles gegen sie sprechen sollte.</p>","pl_PL":"Sehyeong „Mata” Cho jest jednym z kilku zawodników League of Legend, których nie trzeba przedstawiać. Mata to nie tylko mistrz świata — był także najlepszym zawodnikiem serii, podczas której zdobył dla Samsung White mistrzostwo i Puchar Przywoływacza w 2014 roku. To jeden z najlepiej znanych na świecie zawodników grających Threshem, a jego taktyczny umysł jest legendarny.</p>\n\nNa Summoner’s Rift Mata stanowi bezcenne uzupełnienie Royal Never Give Up i osiągnął niebywałe zgranie ze swoim porywczym, szaleńczo agresywnym prowadzącym partnerem, Uzim. Niestety jego znakomita gra nie wystarczyła, by zdobyć zwycięstwo przeciwko ostatecznym Mistrzom Świata, SK Telecom T1. Mata będzie miał okazję wyhaczyć swoje odkupienie dzięki nominacji do gry na wydarzeniu All-Star 2016 w Barcelonie. Mając za sobą kolegę z alei, Uziego, największą odpowiedzialnością Maty będzie nadzorowanie przebiegu walki na polu bitwy Summoner’s Rift. Gdy u steru stoi kapitan Mata, chiński okręt na All-Star zawsze będzie miał szanse utrzymać się na powierzchni, nawet w niesprzyjających okolicznościach.\n","pt_BR":"<p>Sehyeong \"Mata\" Cho é um dos poucos jogadores do League que nem precisa de apresentações. Mata não é apenas um Campeão Mundial. Ele é o MVP da série que deu o Campeonato à Samsung White. Ele é um dos jogadores de Thresh mais conhecidos do mundo e seu raciocínio tático é lendário.</p>\n\n<p>Mata é uma adição inestimável para a Royal Never Give Up e alcançou uma incrível sinergia com seu parceiro cabeça-quente e altamente agressivo, o atirador Uzi. Infelizmente, sua mecânica incrível não foi suficiente para arrancar uma vitória contra a campeã do Mundial, a SK Telecom T1. Mata terá uma chance de dar aquele Flash com gancho e agarrar sua redenção após ser eleito para participar do Evento All-Star 2016 em Barcelona. Com Uzi também eleito, a maior contribuição de Mata será em como ele cuida do campo de batalha que é Summoner’s Rift. Com o comandante Mata no manche, o navio All-Star da China tem uma chance de continuar navegando, mesmo se a sorte estiver contra eles.</p>","cs_CZ":"<p>Sehyeong „Mata“ Cho je jedním z mála hráčů League of Legends, kteří nepotřebují žádné zdlouhavé představování. Mata není jen mistr světa, ale také držitel ocenění pro nejužitečnějšího hráče za sérii, ve které Samsung White v roce 2014 vyhrál MS a Vyvolávačův pohár. Je jedním z nejslavnějších hráčů Threshe na světě a o jeho taktických dovednostech se vyprávějí legendy.</p>\n\n<p>Ve Žlebu je Mata nedocenitelnou oporou týmu Royal Never Give Up, s jehož horkokrevným a divoce agresivním ADC Uzim si vybudoval neuvěřitelně dokonalou synergii. Bohužel ani jeho hvězdné výkony nestačily na překonání SK Telecom T1, kteří nakonec letošní mistrovství světa vyhráli. Mata bude mít ještě šanci se se svým hákem pomstít, jelikož byl nominován na turnaj All-Star 2016 v Barceloně. S lajnovým parťákem Uzim v závěsu bude největším Matovým příspěvkem to, jak si dokáže udržovat přehled o celkovém dění na bojišti. Když bude mít na All-Star čínská loď u kormidla kapitána Matu, bude šanci udržet se na vodě, i když nepatří mezi favority.</p>","el_GR":"<p>Ο Sehyeong \"Mata\" Cho ανήκει στην ελίτ των παικτών του League που δεν χρειάζονται συστάσεις. Ο Mata δεν είναι μόνο Παγκόσμιος Πρωταθλητής, αλλά και ο MVP των αγώνων με τους οποίους οι Samsung White κατάκτησαν το Παγκόσμιο Πρωτάθλημα 2014 και το Κύπελλο Επικαλεστή. Είναι ένας από τους πιο διάσημους παίκτες του Θρες στον κόσμο και φημίζεται για τη στρατηγική του σκέψη.</p>\n\n<p>Σε αγωνιστικό επίπεδο, ο Mata είναι μια πολύτιμη προσθήκη στους Royal Never Give Up και έχει καταφέρει να συντονιστεί τέλεια με τον θερμόαιμο και εξαιρετικά επιθετικό ADC της ομάδας, τον Uzi. Δυστυχώς, η καταπληκτική του εμφάνιση δεν ήταν αρκετή για να δώσει τη νίκη στην ομάδα του στον αγώνα με τους SK Telecom T1 που στη συνέχεια θα έπαιρναν το Παγκόσμιο Πρωτάθλημα. Ο Mata θα έχει πάλι μια ευκαιρία να δείξει τι αξίζει, αφού επιλέχθηκε για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Ήδη γυαλίζει το φανάρι και το Φλας του. Μαζί με τον Uzi, τον συμπαίκτη του στη λωρίδα, ο Mata θα είναι ακόμη πιο πολύτιμος στην ομάδα του επειδή γνωρίζει καλύτερα από τον καθένα τη στρατηγική που απαιτεί το Φαράγγι των Επικαλεστών. Με καπετάνιο τον Mata, το πλήρωμα της Κίνας που θα ταξιδέψει στο All-Star έχει καλές πιθανότητες να μην ναυαγήσει, παρόλο που τα στατιστικά δεν είναι με το μέρος του.</p>","hu_HU":"Sehyeong „Mata” Cho a kevés LoL-játékos egyike, aki nem igazán szorul bemutatásra. Mata nem csupán világbajnok, hanem MVP volt egy olyan versenyen, ahol a Samsung White 2014-ben világbajnok lett, és elnyerte az Idézők Kupáját. A világ egyik legismertebb Thresh-játékosának taktikai érzéke legendás.</p>\n\nA Szurdokban Mata a Royal Never Give Up csodafegyvere, és meglepően jól működik együtt a forrófejű, rendkívül agresszív partnerével, Uzival. Sajnos az emberfeletti teljesítménye is kevés volt ahhoz, hogy megverjék a későbbi világbajnok SK Telecom T1-t. Mata most visszavághat, mert beszavazták őt a 2016-os All-Star gála játékosai közé. Állandó társa, Uzi is vele tart, így Mata stratégiai gondolkodása is jobban érvényesülhet az Idézők szurdokában. Mata parancsnokkal a hídon Kína All-Star-hajója akkor sem fog felborulni, ha az esélyek nem nekik kedveznek.\n","it_IT":"Sehyeong \"Mata\" Cho è uno dei pochi giocatori di LoL a non aver bisogno di presentazioni. Mata non è semplicemente un campione del mondo, ma anche il MVP della serie che ha visto i Samsung White conquistare i Mondiali 2014 e la Coppa degli evocatori. È uno dei più celebri giocatori di Thresh al mondo e la sua abilità tattica è leggendaria.</p>\n\nIn Landa, è una risorsa insostituibile dei Royal Never Give Up, tra i quali ha costruito un'incredibile sinergia con il suo aggressivo compagno ADC Uzi. Purtroppo le sue giocate stellari non sono bastate a strappare una vittoria contro i futuri campioni del mondo, gli SK Telecom T1. Mata avrà la possibilità di rifarsi e \"agganciare\" la vittoria all'All-Star 2016 di Barcellona. In compagnia del suo compagno di corsia Uzi, Mata potrebbe contribuire al successo della squadra soprattutto grazie alla sua visione del campo di battaglia. Con il comandante Mata al timone, la squadra cinese avrà sempre una possibilità di rimanere a galla, anche quando sembra che non ci sia via di scampo.\n","ro_RO":"Sehyeong ''Mata'' Cho este unul dintre puținii jucători de LoL care nu mai au nevoie de vreo prezentare. Mata nu este doar Campion Mondial, ci și MVP-ul Campionatului Mondial în care Samsung White a câștigat Cupa Invocatorului în 2014. Este unul dintre cei mai cunoscuți jucători de Thresh din lume, iar manevrele sale tactice sunt legendare.</p>\n\nÎn Rift, Mata este o piesă inestimabilă a echipei Royal Never Give Up și a dezvoltat o sinergie incredibilă cu partenerul său ADC temperamental și foarte agresiv, Uzi. Din păcate, manevrele sale uimitoare nu au fost de ajuns pentru a obține o victorie în fața viitorilor campioni mondiali, SK Telecom T1. Acum că a fost nominalizat să joace la evenimentul All-Star 2016 din Barcelona, Mata va avea ocazia să-și ia revanșa. Avându-l alături de colegul său de culoar, Uzi, cea mai importantă contribuție a lui Mata va fi controlul asupra câmpului de luptă. Cu comandantul Mata la cârmă, vasul All-Star al Chinei se va putea menține la suprafață chiar și atunci când șansele nu sunt favorabile.\n","es_MX":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>"},"foreignIds":{"drupalId":"682","ESPORTSTMNT06":"200000344","TRLT3":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":72,"slug":"pawn","name":"Pawn","firstName":"Wonseok","lastName":"Heo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pawn-bwchpx6p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:29.000Z","updatedAt":"2017-07-06T14:11:08.000Z","bios":{"en_US":"<p>\nWonseok “Pawn\" Heo is one of the best known mid laners in the world, with a career dating back to 2013. Pawn is a battle hardened veteran, with some truly impressive games under his belt. Pawn shocked the world when he solo killed Faker in the 2013 WCG Qualifiers, and he hasn’t stopped since. From there, he found himself on Samsung White during one of the most competitive and closely-matched periods in Korea’s history.\n</p>\n<p>\nSSW turned in a dominant performance during the 2014 World Championship, taking the cup home in almost unrivaled fashion. However, the team disintegrated in the aftermath of their success, and Pawn joined Edward Gaming at the end of 2014. Now rejoining the LCK, he'll once again take on Faker in the mid lane.\n</p>","fr_FR":"<p>Won-seok « PawN » Heo est l'un des meilleurs mid laners du monde. Point. Au nombre de ses trophées, on retrouve les play-offs des LPL, le Mid-Season Invitational et le Championnat du monde de League of Legends. Il a également battu Faker et SKT à de nombreuses occasions, notamment lors de la finale du MSI 2015. Et malgré son surnom (qui signifie « pion » en anglais), PawN nous rappelle plutôt une reine, capable de se déplacer où elle veut et semant la destruction dans les rangs ennemis.</p>\n<p>\nPawN a été recruté par Edward Gaming fin 2014, quand toute une vague de vedettes coréennes a migré vers les LPL. PawN a aidé à propulser EDG jusqu'à la 1re place de la Demacia Cup Spring Season 2015 et des play-offs printaniers des LPL 2015. Mais PawN sait que la route est encore longue. « Je trouve que Samsung White était une équipe parfaite », dit PawN, et EDG a encore beaucoup de travail à faire pour parvenir à ce niveau de performance. En attendant, PawN continuera à semer la peur chez ses adversaires chaque fois qu'il arrivera dans la Faille.\n</p>","pl_PL":"<p>\nHeo „PawN” Won-seok jest jednym z najlepszych graczy w środkowej alei na całym świecie. Czemu? Cóż, wygrał parę „drobnych” turniejów, takich jak choćby rozgrywki play-off LPL, turniej Mid-Season InvitationaL i mistrzostwa świata w League of Legends. Wielokrotnie też pokonywał Fakera i SKT – także podczas finałów 2015 MSI. Choć jego ksywka oznacza „pionek”, jego styl gry może bardziej kojarzyć się z królową, która porusza się po planszy w dowolnym kierunku, niszcząc każdego napotkanego przeciwnika.\n</p>\n<p>\nPawN został zwerbowany przez Edward Gaming pod koniec 2014 r. Był jedną z wielu koreańskich gwiazd, które przeszły do LPL. Pomógł EDG wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek play-off 2015 LPL. Pawn wie jednak, że przed nim trudne zadanie. „Wydaje mi się, że Samsung White było drużyną idealną” przyznaje PawN, a EDG czeka dużo pracy, jeżeli zamierzają osiągnąć podobny poziom. W międzyczasie PawN nadal będzie siał postrach w sercach wrogów za każdym razem, gdy wkroczy na Rift.\n</p>","de_DE":"<p>Won-seok „PawN“ Heo, dessen Karriere 2013 begann, ist einer der bekanntesten Mid-Laner der Welt. Obwohl PawN erst 19 Jahre alt ist, ist er bereits ein abgehärteter Veteran, der schon ein paar wirklich beeindruckende Spiele abgeliefert hat. PawN schockierte die Welt, als er Faker bei der Qualifikationsrunde für das WCG 2013 alleine besiegte, und hat seither nicht mehr nachgelassen. Kurz darauf wechselte er in einer der umkämpftesten und knappsten Phasen in Koreas Geschichte zu Samsung White.</p>\n\n<p>SSW lieferte bei der Weltmeisterschaft 2014 eine dominante Leistung ab und konnte sich den Titel beinahe widerstandslos sichern. Nach dem Erfolg brach die Mannschaft jedoch auseinander und PawN wechselte Ende 2014 zu Edward Gaming. Seither hat er EDG zu ein paar ihrer dominantesten Siege geführt. Doch der junge Spieler hat immer wieder mit Krankheiten zu kämpfen. Aber trotz dieser Rückschläge ist er immer noch ein Teil der Mannschaft und fest entschlossen, ihr zu dienen.</p>","es_ES":"<p>Won-seok \"PawN\" Heo es uno de los jugadores de la calle central más conocidos del mundo, con una carrera que data del año 2013. A pesar de tener solo 19 años, PawN es un veterano curtido en batalla que tiene en su haber unas partidas increíbles. Sorprendió a todo el mundo cuando acabó él solo con Faker en el clasificatorio del WCG 2013 y no ha parado desde entonces. Desde aquel momento, se encontraba en Samsung White durante uno de los periodos más competitivos y reñidos en la historia de Corea.</p>\n\n<p>SSW hizo gala de una actuación dominante durante el Campeonato Mundial 2014, hasta el punto de llevarse a casa el trofeo sin que casi nadie les plantase cara. No obstante, el equipo se deshizo como resultado de su éxito y PawN se unió a Edward Gaming a finales de 2014. Desde entonces, ha liderado a EDG en algunas de sus victorias más aplastantes. Aunque el joven jugador ha tenido que enfrentarse a alguna enfermedad. Y, a pesar de esto, sigue en el equipo, dispuesto a actuar.</p>","pt_BR":"<p>Won-seok “PawN” Heo é um dos jogadores do meio mais conhecidos do mundo, com uma carreira iniciada em 2013. Apesar de ter apenas 19 anos, PawN é um veterano experiente na batalha e tem alguns jogos realmente impressionantes no currículo. PawN chocou o mundo quando abateu Faker sozinho nas Classificatórias da WCG 2013 e desde então não parou mais. A partir dali, entrou para a Samsung White durante um dos períodos mais competitivos e disputados na história da Coreia.</p>\n\n<p>A SSW teve uma atuação dominante durante o Campeonato Mundial 2014 e levou a copa para casa de maneira incontestável. No entanto, a equipe se desfez em resultado a todo esse sucesso e PawN foi para a Edward Gaming no final de 2014. Desde então, ele liderou a EDG em algumas de suas vitórias mais sólidas. Porém, o jovem jogador está lutando contra uma doença. Mas apesar das adversidades, ele ainda está na equipe e está determinado a contribuir.</p>","es_AR":"<p>Won-seok “PawN” Heo es uno de los mejores carrileros centrales del mundo, con una carrera que se inició en el 2013. Con tan solo 19 años, PawN es un veterano endurecido por los enfrentamientos, con partidas realmente impresionantes bajo la manga. PawN deslumbró al mundo cuando derrotó a Faker en WCG 2013 y no para desde entonces. A partir de allí, se encontró en Samsung White durante uno de los juegos más competitivos y cerrados en la historia de Corea.</p>\n\n<p>SSW logró un desempeño deslumbrante durante el Campeonato Mundial 2015 y se llevó la copa a casa de una manera inigualable. Sin embargo, el equipo se desintegró después de todo este éxito y PawN se unió a Edward Gaming a finales del 2014. Desde entonces, condujo a EDG a algunas de las victorias más contundentes. Lamentablemente, el joven jugador tiene que hacer frente a una enfermedad. A pesar de esta adversidad, sigue formando parte del equipo y está determinado a seguir adelante.</p>"},"foreignIds":{"drupalId":"983","ESPORTSTMNT06":"200000342","TRLT3":"200000214"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":304,"slug":"deft","name":"Deft","firstName":"Hyeokgyu","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deft-4s8iwywa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-07-06T14:18:47.000Z","bios":{"en_US":"<p>\nThere are many ways to introduce Hyeokgyu “Deft” Kim: Ezreal fanatic, world class AD carry, veteran, hypercarry... Deft has been playing since 2013, earning accolades as a player who could pump out absurd amounts of damage thanks to his ability to duck, dodge, and weave through teamfights.\n</p>\n<p>\nAfter the 2014 World Championship, Deft joined up with Edward Gaming, beginning an era of dominance where the team picked up a series of convincing victories. It started with the 2015 Demacia Cup Spring, and then continued into the 2015 LPL Spring Split, where EDG only dropped six games in total. From there, EDG picked up the top prize at the 2015 Mid-Season Invitational, winning a thrilling Bo5 series against SKTelecom T1, 3-2. Yet through it all, something has eluded Deft...he has yet to take home the greatest prize of all: the World Championship.\n</p>","fr_FR":"<p>Hyuk-kyu « Deft » Kim est réputé pour être l'un des carrys AD les plus agressifs du monde, ce qui nous change de ses débuts professionnels chez Samsung Blue, où il avait plus tendance à fuir un combat qu'à tenter l'affrontement. Mais depuis qu'il a rejoint les LPL, Deft tend à repousser les limites de ses champions (pour ne pas dire qu'il les dépasse de temps en temps). De façon générale, Deft fait preuve de force et de confiance dès qu'il arrive sur la Faille.</p>\n\n<p>Par contraste, Deft, en personne, est plutôt discret, voire effacé. Il suit souvent ses coéquipiers dans la maison d'EDG, ne sachant visiblement pas trop quoi faire par lui-même. Peut-être espère-t-il que la voix douce de Meiko, son partenaire sur la voie du bas, le ramènera à bon port.</p>","pl_PL":"<p>Hyuk-kyu „Deft” Kim uważany jest powszechnie za jednego z najagresywniejszych prowadzących na świecie. Wiele się zmieniło, odkąd zaczynał karierę w Samsung Blue. Wówczas prędzej był gotów uciekać niż nawiązać walkę z przeciwnikiem. Odkąd jednak Deft przeniósł się do LPL, coraz częściej zdarza mu się w pełni wykorzystywać zalety swoich bohaterów (a także podejmować ryzykowne decyzje). Ilekroć Deft wyrusza na Rift, wykazuje się siłą i pewnością siebie.</p>\n\n<p>Z kolei w życiu prywatnym jest osobą cichą, wręcz potulną. Często zdarza mu się chodzić po domu drużynowym za pozostałymi członkami EDG, jakby nie wiedział, co robić, gdy zostaje sam. Być może wyczekuje kojącego głosu Meiko, partnera z dolnej alejki.</p>","de_DE":"<p>Man kann Hyuk-kyu „Deft“ Kim auf viele Arten vorstellen: Als Ezreal-Freak, als Weltklasse-AD-Carry, als Veteran, als Hypercarry … Deft spielt schon seit 2013 und hat als Spieler, der dank seiner schnellen Reflexe in Teamkämpfen unglaublichen Schaden austeilen kann, einige Auszeichnungen gewonnen.\nNach der Weltmeisterschaft 2014 wechselte Deft zu Edward Gaming und leitete damit eine Ära ein, in der die Mannschaft im Frühjahr beim Demacia Cup 2015 und kurz darauf beim Frühjahrs-Split der LPL 2015 einen überzeugenden Sieg nach dem anderen feierte und insgesamt nur sechs Spiele verlor. Danach gewann EDG das spannende Finale des Mid-Season Invitational 2015 gegen SKTelecom T1 mit 3–2. Deft war schon bei vielen internationalen Turnieren, aber eines fehlt ihm immer noch: der Weltmeistertitel. Deft hat bewiesen, dass er immer alles tut, um sein Ziel zu töten. Während sich EDG auf die Weltmeisterschaft vorbereitet, müssen sich die anderen Mannschaften vor seinem beweglichen und riskanten, aber lohnenden Spielstil in Acht nehmen. Eines ist jedenfalls sicher: Solange Deft in der Kluft ist, darf man EDG niemals abschreiben.</p>","es_ES":"<p>Hay muchas maneras de presentar a Hyuk-kyu \"Deft\" Kim: fanático de Ezreal, AD carry de talla mundial, veterano, hypercarry... Deft lleva jugando desde 2013 y ha conseguido elogios como jugador capaz de infligir cantidades ingentes de daño gracias a su capacidad de eludir, esquivar y moverse en los combates de equipo.</p>\n\n<p>Después del Campeonato Mundial 2014, Deft se unió a Edward Gaming, lo que dio comienzo a una era de dominio en la que el equipo se hizo con una serie de victorias convincentes en la 2015 Demacia Cup Spring y en la fase de primavera de la LPL de 2015, donde solo perdieron seis partidas. Después EDG consiguió subir a lo más alto del MSI 2015, tras una emocionante victoria por 3 a 2 en una serie al mejor de 5 contra SK Telecom T1. </p>\n\n<p>Deft ha participado en muchos torneos internacionales, pero todavía le falta por llevarse a casa el mayor premio de todos: el título del Campeonato Mundial. Ha demostrado que cuando tiene un asesinato a la vista, hará todo lo que haga falta para conseguirlo. Con EDG en el Mundial, los rivales tendrán que tener cuidado con su estilo de juego de gran movilidad, gran riesgo y gran recompensa. Una cosa está clara: mientras Deft esté en la Grieta, no se puede dar a EDG por muerto.</p>","pt_BR":"<p>Podemos apresentar Hyuk-kyu “Deft” Kim de várias formas: Fanático por Ezreal, atirador de nível internacional, veterano, hipercarregador... Deft joga desde 2013 e é tido como um jogador que consegue causar quantidades absurdas de dano graças a sua habilidade de se esconder, desviar e driblar em confrontos de equipe.</p>\n<p>Depois do Campeonato Mundial 2014, Deft entrou para a Edward Gaming, iniciando uma era de domínio em que a equipe conquistou uma série de vitórias convincentes na Etapa de Primavera da Demacia Cup 2015 e depois a Série de Primavera da LPL 2015, onde a EDG só perdeu seis jogos no total. Depois disso, a EDG levou o primeiro lugar no MSI 2015, ganhando uma série de melhor de cinco contra a SKTelecom T1 por 3 a 2. Deft já participou de inúmeros torneios internacionais, mas ainda não levou para casa o grande prêmio: o Campeonato Mundial. Mas já demonstrou que quando coloca uma presa na mira, ele faz de tudo para abatê-la. Com a EDG no Mundial, os oponentes precisarão tomar cuidado com seu estilo de jogo de alta mobilidade, alto risco e alta recompensa. Uma coisa é certa: enquanto Deft continuar no Rift, a EDG continua na parada.</p>","es_AR":"<p>Existen muchas maneras de presentar a Hyuk-kyu “Deft” Kim: fanático de Ezreal, ADC de primera categoría, veterano, hiperacarreador... Deft no deja de jugar desde el 2013, consagrándose como un jugador capaz de infligir absurdas cantidades de daño gracias a su habilidad para agacharse, esquivar y eludir peleas en equipo.</p>\n\n<p>Después del Campeonato Mundial 2015, Deft se unió a Edward Gaming y comenzó una era de dominio en la que el equipo consiguió una serie de victorias en la Copa de Verano de Demacia 2015 y luego en la Serie de Primavera de LPL 2015, donde EDG solo perdió seis partidas en total. Después, EDG consiguió el primer premio en el Torneo por Invitación de Mitad de Temporada 2015, ganando por 3-2, una increíble serie al mejor de 5 contra SKTelecom T1. Deft participó en un montón de torneos internacionales, pero aún le falta llevarse a casa el premio más importante de todos: el Campeonato Mundial. Deft demostró que consigue lo que se propone y hará todo lo que esté a su alcance para lograrlo. Cuando EDG llegue al Mundial, los oponentes tendrán que cuidarse de su estilo de juego sumamente ágil, de alto riesgo y altura. Una cosa es segura: siempre que Deft esté parado en la Grieta, no podrás contra EDG.</p>"},"foreignIds":{"drupalId":"985","ESPORTSTMNT06":"200000343","TRLT3":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":749,"slug":"score","name":"Score","firstName":"Dong-bin","lastName":"Ko","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/score-gtlz6pjd.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:20:25.000Z","bios":{"en_US":"<p>Dong-bin \"Score\" Ko, once known as “The Immortal Score,” is one of a select few Korean pros to transition smoothly from playing one role to another. Originally the pre-eminent ADC for KT Rolster, Score had a knack for surviving team fights due to his excellent positioning.\n</p>\n<p>\nScore traded in his guns and rockets for a flask and burrowing kit and moved into the jungle in 2015. Now working with a new roster, he'll have to build synergy with his new all-star laners to find success in 2017.\n</p>","fr_FR":"<p>Dong-bin « Score » Go, naguère surnommé l'« Immortel Score », est un des rares professionnels coréens à avoir su passer de façon fluide d'un rôle à un autre. Quand il était le carry AD par excellence de KT Rolster, Score avait le don pour survivre aux combats d'équipes grâce à son excellent sens du positionnement.\n</p>\n<p>\nScore opéra une reconversion vers la jungle en 2015. Pour l'heure, ce choix a l'air de sourire à KT Rolster. Les ganks de Score sur la voie du haut donnent constamment à ssumday un avantage crucial. Il fut un temps où Score amassait les éliminations sur la voie du bas, mais aujourd'hui je pense qu'on peut dire\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...que son score ne l'intéresse plus. (Phreak par pitié, ne touche pas à mon clavier).</p>","pl_PL":"<p>Dongbin „Score” Go, znany kiedyś jako „The Immortal Score” jest jednym z niewielu koreańskich zawodowców, którzy gładko przeszli z jednej roli w inną. Niegdyś był prowadzącym w KT Rolster i często przeżywał walki drużynowe ze względu na idealne ustawienie.\n</p>\n<p>\nScore przesiadł się z rakiet i broni na mikstury i przeszedł do dżungli w 2015 roku. Chwilowo ruch ten wydaje się służyć KT Rolster. Ganki Score'a na górnej alei zapewniają ssumdayowi przewagę. Chociaż Score niegdyś sam zdobywał zabójstwa na dole, teraz można powiedzieć,..\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...że Score'a nie obchodzi już jego score (wynik). (Phreak, daj spokój, zostaw mój komputer).\n</p>","de_DE":"<p>Dongbin \"Score\" Ko war wie heute schon zu Zeiten von KT Rolster Bullets der Teamkapitän und hat die Kommandos gegeben. Das Bemerkenswerte ist, dass er dies damals als Schütze, also einer sehr mikrolastigen Rolle, machte, was zu dieser Zeit keiner anderer zu diesem Maße mit Erfolg nachmachen konnte. Als Anfang 2015 die beiden Schwesterteams KTA und KTB sich zusammentaten, hat Score seine Rolle zum Jungler gewechselt. Sehr schnell nahm dieser Wechsel eine solide Form an, wobei auch die langjährige Erfahrung eine große Rolle spielte. Score wandelt diese in kluge Jungle-Pfade und Manöver um seine Gegner herum um. Zusammen mit seinem Support Piccaboo bilden diese beiden das beste Jungle/Support-Duo in Korea, das dem Gegner immer und immer wieder klar macht, dass sie keine Führung so leicht aus den Händen geben.</p>","es_ES":"<p>Dong-bin \"Score\" Go, una vez conocido como “El inmortal Score”, es uno de los pocos elegidos coreanos que ha cambiado con éxito su rol dentro del juego. Originalmente en el puesto de tirador para KT Rolster, Score tiene un truco para sobrevivir en todas las peleas gracias a su extraordinario posicionamiento. </p>\n\n<p>Score cambió sus pistolas y cohetes por la mochila de explorador y se fue a la jungla en 2015. Hasta ahora el cambio parece haber funcionado para KT Rolster. Las emboscadas de Score en la calle superior suelen darle ventaja a su compañero ssumday. Hubo un tiempo en el que Score acaparaba los asesinatos de su equipo, aquellos maravillosos años…</p>\n","pt_BR":"<p>Dong-bin \"Score\" Go, uma vez conhecido como \"O Imortal Score\", é um dos poucos jogadores coreanos a transitar tranquilamente de uma posição para outra. Originalmente um proeminente atirador para a KT Rolster, Score era conhecido por sobreviver às lutas com seu excelente posicionamento.\n</p>\n<p>\nScore trocou suas armas e foguetes por um machete e repelentes, e mudou-se para a selva em 2015. Até agora tudo tem dado certo para a KT Rolster. As emboscadas de Score na rota do topo regularmente colocam Ssumday em uma vantagem crucial para a equipe. Enquanto Score antigamente era conhecido por conquistar abates para si próprio na rota de baixo, hoje em dia você pode até dizer que...\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n...ele não se importa muito com seu score (placar). (Phreak pfv, deixe meu computador em paz).\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한때 생존왕이라고 불리기도 했던 \"Score\" 고동빈은 포지션 전향이 순탄하게 이루어진 몇 안 되는 한국 프로게이머들 중 하나입니다. KT Rolster의 탁월한 원거리 딜러였던 Score는 훌륭한 위치 선정으로 팀 전투에서 생존하는 능력이 좋았습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 Score는 총과 로켓 대신 술통과 매복 스킬을 들고 정글로 들어갔습니다. 그의 포지션 전향은 KT Rolster에게 도움이 되고 있는 듯합니다. Score의 탑 라인 갱킹은 Ssumday가 계속해서 우위에 설 수 있게 해줍니다. 한때 Score는 봇 라인에서 킬을 독식했을지 몰라도 요즘은 자기 스코어에 신경 쓰지 않습니다. </p>\n"},"foreignIds":{"drupalId":"2163","ESPORTSTMNT06":"200000341","TRLT3":"200000213"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":769,"slug":"smeb","name":"Smeb","firstName":"Kyungho","lastName":"Song","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smeb-afu7c8ds.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-07-06T14:10:36.000Z","bios":{"en_US":"<p>Kyungho \"Smeb\" Song is the most feared top laner in the world; but it wasn’t always that way. His professional debut with Incredible Miracle in 2013 was disastrous, and he was crushed repeatedly by the LCK’s top lane heavyweights. After Smeb made the move to the ROX Tigers (previously KOO Tigers) in late 2014, he defied his critics, and his play skyrocketed under the tutelage of ROX coach NoFe. Smeb’s endearing ascension gained him fans and respect as one of the most formidable foes on the Rift.</p>\n\n<p>Smeb has continually reached new heights as a player, collecting his second straight LCK MVP award in the 2016 LCK Summer Split, when he led a resilient ROX squad to their first-ever LCK crown. The hype behind Smeb was at a fever pitch heading into Worlds until the Tigers met their bitter rivals, SK Telecom T1, in the Semifinals. Even though Smeb and company fell to SKT in a hardfought battle, his admirable performances left an impression on viewers.</p>","fr_FR":"<p>Kyung-ho « Smeb » Song est aujourd'hui le top laner le plus craint au monde, mais cela n'a pas toujours été le cas. Ses débuts en tant que professionnel avec Incredible Miracle en 2013 ont été désastreux et se sont soldés par de nombreux échecs face aux poids lourds top laners des LCK. Après avoir rejoint les ROX Tigers (anciennement KOO Tigers) fin 2014, il a défié ses détracteurs et ses performances explosèrent sous la houlette de l'entraîneur des ROX, NoFe. Avec son ascension, Smeb a conquis les fans et le respect de ses pairs comme l'un des ennemis les plus imposants de la Faille.</p>\n\n<p>Smeb n'a jamais cessé d'évoluer en tant que joueur, remportant sa deuxième récompense de MVP LCK lors du segment d'été des LCK 2016 quand, grâce à la ténacité de l'équipe, ROX a pu y décrocher sa première couronne. L'engouement derrière Smeb était encore à son comble lors du Mondial jusqu'à la rencontre entre les Tigers et leurs adversaires cinglants, SK Telecom T1, lors de la demi-finale. Même si Smeb et son équipe ont perdu face à SKT après un combat acharné, ses performances incroyables ont fait forte impression sur les spectateurs qui l'ont propulsé sur la scène de l'événement All-Stars 2016 à Barcelone.</p>","pl_PL":"<p>Kyungho „Smeb” Song to budzący największą grozę na świecie gracz górnej alei — ale nie zawsze tak było. Jego profesjonalny debiut w Incredible Miracle w 2013 okazał się katastrofalny. Smeb był raz za razem miażdżony przez weteranów górnej alei z LCK. Gdy Smeb przeniósł się do ROX Tigers (dawniej KOO Tigers) pod koniec 2014 roku, rzucił rękawicę krytykom, a jego gra osiągnęła niebotyczny pułap dzięki opiece trenera ROX, NoFe. Śmiały awans Smeba przysporzył mu fanów oraz zapewnił szacunek należny jednemu z najgroźniejszych przeciwników na Summoner’s Rift.</p>\n<p>\nSmeb nieustannie osiągał nowe wyżyny jako zawodnik, zdobywając drugą z rzędu nagrodę dla Najlepszego Zawodnika LCK, gdy doprowadził mocny skład ROX do ich pierwszego wielkiego zwycięstwa w LCK. Gorączka zachwytów nad Smebem rosła w toku Mistrzostw, aż Tigers spotkali się w półfinałach ze swoimi zaciętymi rywalami, SK Telecom T1. Chociaż Smeb i koledzy ulegli SKT w zażartym boju, jego godny podziwu występ zrobił wrażenie na widzach, którzy wysłali go na wydarzenie All-Star 2016 w Barcelonie.\n","de_DE":"<p>Kyung-ho „Smeb“ Song ist der gefürchtetste Top-Laner der Welt, aber das war nicht immer der Fall. 2013 gab er ein katastrophales Debüt in der professionellen E-Sport-Szene für Incredible Miracle und wurde außerdem immer wieder von anderen Top-Lanern der LCK vernichtet. Nachdem Smeb Ende 2014 zu den ROX Tigers (ehemals KOO Tigers) gewechselt hatte, ließ er seine Kritiker verstummen und verbesserte seine Spielweise unter der Anleitung von ROX’ Coach NoFe ungemein. Smebs Aufstieg brachte ihm Fans und den Respekt der besten Spieler der Kluft ein.</p>\n\n<p>Smeb hat als Spieler immer wieder neue Höhen erreicht und nachdem er beim Sommer-Split 2016 seinen zweiten Titel als MVP der LCK erhalten hatte, führte er ROX zum ersten Sieg in der LCK. Der Hype um Smeb erreichte bei der Weltmeisterschaft seinen Höhepunkt, bis die Tigers im Halbfinale auf ihren größten Rivalen trafen: SK Telecom T1. Obwohl sich Smeb und seine Kameraden SKT nach einem harten Kampf beugen mussten, hinterließ seine Vorstellung bleibenden Eindruck bei den Zuschauern, die ihn jetzt auf der Bühne des All-Stars-Events 2016 in Barcelona sehen wollen.</p>","es_ES":"<p>Kyungho \"Smeb\" Song es considerado el top más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el split de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","pt_BR":"<p>Kyung-ho \"Smeb\" Song é um dos topos mais temidos do mundo, mas nem sempre foi assim. Sua estreia profissional na Incredible Miracle em 2013 foi um desastre e ele era constantemente destruído pelos pesos-pesados da rota do topo na LCK.  Depois de ter entrado para a ROX Tigers (antiga KOO/GE Tigers) no final de 2014, ele desafiou todos os críticos e seu desempenho explodiu sob a tutela do técnico da ROX, NoFe. A ascensão cativante de Smeb ganhou a ele fãs e respeito como um dos inimigos mais formidáveis no Rift.</p>\n\n<p>Smeb continuiu a atingir novos patamares como jogador, conquistando seu segundo prêmio consecutivo como MVP da LCK. O topo liderou a equipe resiliente da ROX a sua primeira coroa na LCK. A animação por trás de Smeb estava altíssima ao entrar no Mundial, até a Tigers encontrar sua rival, a SK Telecom T1, nas Semifinal. Apesar de Smeb e companhia terem perdido para a SKT em uma batalha difícil, seu desempenho admirável deixou uma impressão nos jogadores que os levou a votar nele para o Evento All-Star 2016.</p>","ko_KR":"<p>\"Smeb\" 송경호 선수는 LCK의 최강 탑 라이너 중 한 명입니다. 2013년 Incredible Miracle에서 e스포츠 경력을 시작했지만 별다른 모습을 보여주지 못했던 Smeb 선수는 2014년 말 ROX Tigers에 입단한 후 달라진 모습을 보여주기 시작했습니다. NoFe 코치의 지도를 받아 나르, 럼블, 헤카림을 마스터해 누구보다도 더 능수능란하게 다루는 모습을 보여주었죠. 특히 나르로 뛰어난 모습을 보여 2015 LCK 스프링에서는 나르로 6승 1패를 기록하기도 했습니다.</p>\n<p>ROX Tigers는 카토비체에서 개최된 IEM 시즌 IX 월드 챔피언십에서 World Elite에게 패하기는 했지만, 꾸준히 세계 최강급 팀으로서의 면모를 보여 왔습니다. LCK의 상위권 팀들과 자주 맞붙어야 하는 ROX Tigers에게 있어 Smeb 선수가 탑에서 럼블과 나르로 잠재력을 발휘할 수 있느냐는 팀의 성패와 직결되죠. Smeb 선수가 제 기량만 발휘할 수 있다면 ROX Tigers의 앞날을 밝을 것입니다. </p>\n","es_AR":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","cs_CZ":"<p>Kyungho „Smeb“ je nejobávanějším horním lajnařem na světě, ale nebylo tomu tak vždy. Jeho profesionální debut s Incredible Miracle roku 2013 skončil katastrofou a špičkoví horní lajnaři z LCK si z něj opakovaně dělali fackovacího panáka. Když však koncem roku 2014 přestoupil do ROX Tigers (dříve KOO Tigers), vzal svým kritiků vítr z plachet a pod vedením trenéra NoFea z ROXu se jeho herní schopnosti ohromným tempem zlepšovaly. Svou cílevědomostí a odhodláním si Smeb vysloužil davy fanoušků a pověst jednoho z nejtěžších nepřátel, na jaké lze ve Žlebu narazit.</p>\n\n<p>Smebova hvězda na herním nebi září čím dál jasněji. Během letního splitu LCK 2016 získal podruhé po sobě ocenění pro nejužitečnějšího hráče ligy, a to zcela zaslouženě, neboť dovedl nezdolný tým ROX k jeho historicky prvnímu titulu z LCK. Nadšení jeho fanoušků dosáhlo s příchodem MS neuvěřitelných výšin, studená sprcha však přišla v semifinále, kde Tigers narazili na své úhlavní nepřátele z SK Telecom T1. Smeb a jeho tým sice SKT podlehli, avšak byla to tvrdá bitva a jeho výkony zanechaly v divácích takový dojem, že se rozhodli jej vyslat do Barcelony na turnaj All-Star 2016.</p>","el_GR":"<p>Ο Kyungho \"Smeb\" Song θεωρείται ο πιο επικίνδυνος παίκτης επάνω λωρίδας στον κόσμο. Δεν ήταν πάντα έτσι, όμως. Έκανε το ντεμπούτο του στην επαγγελματική σκηνή με τους Incredible Miracle του 2013 και γνώρισε την απόλυτη αποτυχία, καθώς τον τσαλαπάτησαν όλοι οι δυνατοί παίκτες επάνω λωρίδας του LCK. Όταν ο Smeb πήρε μεταγραφή στους ROX Tigers (προηγουμένως KOO Tigers) στα τέλη του 2014, όχι μόνο διέψευσε τους κριτικούς του, αλλά βελτίωσε θεαματικά το παιχνίδι του με την καθοδήγηση του προπονητή των ROX, NoFe. Η άνοδος του Smeb κέρδισε τη συμπάθεια και το σεβασμό του κόσμου και τον έκανε έναν από τους πιο τρομακτικούς αντιπάλους στο παιχνίδι.</p>\n\n<p>Ο Smeb κατακτά διαρκώς νέες κορυφές ως παίκτης και πρόσφατα κέρδισε το δεύτερό του βραβείο MVP στο Summer Split 2016 του LCK, όπου οδήγησε τους εξαιρετικά ανθεκτικούς ROX στην πρώτη τους κατάκτηση του πρωταθλήματος. Η πορεία του Smeb είχε δημιουργήσει τρομακτικό ενθουσιασμό, μέχρι που οι Tigers συνάντησαν τους αιώνιους αντιπάλους τους, SK Telecom T1, στους Ημιτελικούς. Παρόλο που ο Smeb και η παρέα του ηττήθηκαν μετά από σκληρό αγώνα, οι εκπληκτικές εμφανίσεις του έκαναν θετική εντύπωση στους θεατές, με αποτέλεσμα να κερδίσει μια θέση στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη.</p>","hu_HU":"Kyungho „Smeb” Song ma a világ legrettegettebb felső ösvényese, de ez nem mindig volt így. 2013-as bemutatkozása az Incredible Miracle tagjaként katasztrofálisra sikeredett, és az LCK felső ösvényes nehézsúlyú játékosai sorra kiütötték. Smeb átigazolt a ROX Tigershez (korábban KOO Tigers) 2014 végén. A ROX edzője, NoFe irányítása alatt hatalmasat fejlődött. Smeb üstökösszerű felemelkedése sok rajongót és rengeteg tiszteletet hozott neki, és ma már a Szurdok egyik legkeményebb harcosának számít.\n</p>\nSmeb egyre magasabbra jut játékosként, zsinórban kétszer lett MVP az LCK 2016-os nyári szakaszában, majd megnyerte a ROX csapatával együtt az első LCK-s bajnoki címüket. Smeb menetelése a vb-n is folytatódott, amíg a Tigers nem találkozott legnagyobb riválisával, az SK Telecom T1-nal az elődöntőben. Bár Smeb és csapata kemény küzdelem után elesett az SKT ellen, így is elég népszerűvé vált ahhoz, hogy kijusson a 2016-os All-Star gálára.\n","it_IT":"Oggi Kyungho \"Smeb\" Song è il superiore più temuto al mondo, ma non è stato sempre così. Il suo debutto professionale con gli Incredible Miracle nel 2013 fu disastroso e lui stesso fu schiacciato ripetutamente in corsia superiore dai pesi massimi della LCK. Dopo essere passato ai ROX Tigers (ex KOO Tigers) alla fine del 2014, ha smentito ogni critica portando il suo gioco a livelli stellari sotto la guida del coach dei ROX, NoFe. L'affascinante ascesa di Smeb gli è valsa l'affetto di numerosi fan e il rispetto degli avversari, che lo considerano uno dei più formidabili guerrieri della Landa.\n</p>\nSmeb ha continuato a raggiungere nuove vette come giocatore, ottenendo il secondo premio consecutivo come MVP nella LCK durante il Summer Split 2016, quando ha guidato i ROX al loro primo trofeo LCK. Gli occhi del mondo erano puntati su Smeb durante i Mondiali, soprattutto durante la battaglia in semifinale contro gli acerrimi rivali degli SK Telecom T1. Anche se Smeb e i suoi compagni si sono dovuti arrendere davanti agli SKT dopo un'intensa battaglia, le sue notevoli prestazioni hanno impressionato il pubblico, che ha deciso di mandarlo dritto a Barcellona per l'All-Star.\n","ro_RO":"Kyungho ''Smeb'' Song este unul dintre cei mai temuți jucători de pe culoarul de sus din lume; dar nu a fost mereu așa. Debutul său pe scena profesionistă alături de Incredibile Miracle în 2013 a fost unul dezastruos, iar el a fost învins în repetate rânduri de legendele de pe culoarul de sus din LCK. După ce Smeb a venit la ROX Tigers (cunoscuți anterior drept KOO Tigers) la finalul lui 2014, și-a sfidat criticii și și-a îmbunătățit stilul de joc sub tutela lui NoFe, antrenorul echipei. Ascensiunea lui incredibilă i-a adus fani și respect, fiind considerat acum unul dintre cei mai formidabili adversari din Rift.</p>\n\nSmeb a atins în mod constant noi culmi ca jucător, câștigând al doilea titlu consecutiv de MVP în LCK în etapa de vară LCK 2016, când a condus echipa ROX către primul ei titlu din LCK. Speranțele și entuziasmul fanilor au atins apogeul la începutul Campionatului Mondial, când cei din Tigers și-au întâlnit adversarii înverșunați, SK Telecom T1, în semifinale. Chiar dacă Smeb și echipa lui au fost învinși de SKT într-un meci extrem de dificil, reușitele sale admirabile le-au lăsat spectatorilor o impresie plăcută, care-l aduce pe scena All-Star Event 2016 din Barcelona.\n\n","es_MX":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>"},"foreignIds":{"drupalId":"2151","ESPORTSTMNT06":"200000340","TRLT3":"200000212"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":2050,"slug":"ssun","name":"Ssun","firstName":"Taeyang","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:19:56.000Z","updatedAt":"2017-07-06T14:11:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001523","TRLT3":"200000200"},"socialNetworks":{},"champions":[],"liveGameTeam":105}],"scheduleItems":[{"id":"AU_di2jUJTrHluSI14GG","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:814eb469-c995-4399-a0ec-bd633dfbe8ad","scheduledTime":"2015-10-10T12:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"7","subBlockLabel":"paris - W2D3","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:f4f94de5-3cb2-422d-89ed-2d95526f65cc"},"match":"814eb469-c995-4399-a0ec-bd633dfbe8ad","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"f4f94de5-3cb2-422d-89ed-2d95526f65cc","league":"9"}],"gameIdMappings":[{"id":"7a5b73a5-5833-49e6-bc3a-a327b2292de1","gameHash":"69153079d3e6df79"}],"videos":[{"id":138,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:7a5b73a5-5833-49e6-bc3a-a327b2292de1","source":"https://www.youtube.com/embed/LFCayCubvIA?wmode=transparent","createdAt":"2015-10-10T14:48:56.000Z","updatedAt":"2015-10-10T14:48:56.000Z","game":"7a5b73a5-5833-49e6-bc3a-a327b2292de1"},{"id":139,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:7a5b73a5-5833-49e6-bc3a-a327b2292de1","source":"https://www.youtube.com/embed/JEi1oMDfJHk?wmode=transparent","createdAt":"2015-10-10T15:09:15.000Z","updatedAt":"2015-10-10T15:09:15.000Z","game":"7a5b73a5-5833-49e6-bc3a-a327b2292de1"},{"id":167,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:7a5b73a5-5833-49e6-bc3a-a327b2292de1","source":"https://www.youtube.com/embed/iMFBNHY5a2Q?wmode=transparent","createdAt":"2015-10-11T09:54:54.000Z","updatedAt":"2015-10-11T09:54:54.000Z","game":"7a5b73a5-5833-49e6-bc3a-a327b2292de1"},{"id":168,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:7a5b73a5-5833-49e6-bc3a-a327b2292de1","source":"https://www.youtube.com/embed/mbClqE68c-4?wmode=transparent","createdAt":"2015-10-11T09:54:42.000Z","updatedAt":"2015-10-11T09:54:42.000Z","game":"7a5b73a5-5833-49e6-bc3a-a327b2292de1"}],"htmlBlocks":[],"match":{"id":"814eb469-c995-4399-a0ec-bd633dfbe8ad","name":"TSM-vs-KT","position":3,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6ba0b32d-5a59-481f-ae7c-fe1a360a70de"},{"roster":"a76887ff-82f8-4944-a061-306b9bd618a2"}],"games":{"7a5b73a5-5833-49e6-bc3a-a327b2292de1":{"id":"7a5b73a5-5833-49e6-bc3a-a327b2292de1","name":"G1","generatedName":"KT|TSM|G1|814eb469c9954399a0ec","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6ba0b32d-5a59-481f-ae7c-fe1a360a70de"},{"roster":"a76887ff-82f8-4944-a061-306b9bd618a2"}],"standings":{"result":[[{"roster":"a76887ff-82f8-4944-a061-306b9bd618a2"}],[{"roster":"6ba0b32d-5a59-481f-ae7c-fe1a360a70de"}]],"timestamp":1444484613020,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380814","gameRealm":"TRLH3","platformId":"TRLH3:1001380814","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"a76887ff-82f8-4944-a061-306b9bd618a2"}],[{"roster":"6ba0b32d-5a59-481f-ae7c-fe1a360a70de"}]],"timestamp":1444484613020,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"6ba0b32d-5a59-481f-ae7c-fe1a360a70de":0,"a76887ff-82f8-4944-a061-306b9bd618a2":1}}}