{"teams":[{"id":61,"slug":"pain-gaming","name":"paiN Gaming","guid":"be6cb1f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/pain-gaming-1c8c1wji.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/pain-gaming-cxhmtitg.png","acronym":"PNG","homeLeague":"urn:rg:lolesports:global:league:league:14","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/pain-gaming-farnhu45.png","createdAt":"2015-05-11T23:11:10.000Z","updatedAt":"2017-06-16T17:32:44.000Z","bios":{"pt_BR":"<p>Como primeira equipe profissional do país, a paiN conquistou desde 2012 diversos títulos, muitos torcedores (tanto a favor quanto contra) e um lugar de destaque na história de League. Foi a equipe brasileira que primeiro desbravou fronteiras internacionais (IEM Worlds 2013 e International Wildcard 2013), formou a primeira gaming house da América Latina e sempre esteve presente em grandes decisões\n<p>Após um tempo em segundo plano, a equipe voltou com tudo com a famosa esquadra Mylon, SirT, Kami, brTT e Dioud, que desbancou a INTZ na final do CBLoL 2015 e batalhou até conquistar duas vitórias no Campeonato Mundial - o melhor desempenho de uma equipe brasileira na maior competição que existe.</p>\n<p>Novamente, a equipe entrou em um hiato durante 2016, quase amargando um rebaixamento inesperado, mas se safando na Série de Promoção. Apesar de melhorar na Segunda Etapa, a paiN parece ter ganho mais fôlego e motivação com um ano de resultados ruins e saídas de ídolos. E todos sabem: é quando você menos espera que a paiN realmente ressurge.</p>\n\n<h2>Histórico em torneios oficiais</h2>\n<p>\n<ul class=\"esp-team-history\">\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2017</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>3/4º lugar</strong> CBLoL - 1ª Etapa</li>\n    </ul>\n  </li>\n<br>\n<p>\n<li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2016</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>6º lugar</strong> CBLoL - 1ª Etapa</li>\n      <li><strong>3º lugar</strong> CBLoL - 2ª Etapa</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2015</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>3º lugar</strong> CBLoL - 1ª Etapa</li>\n      <li><strong>1º lugar</strong> CBLoL - 2ª Etapa</li>\n      <li><strong>1º lugar</strong> International Wildcard (Chile)</li>\n      <li><strong>12-13º lugar</strong> Campeonato Mundial 2015</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2014</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>2º lugar</strong> Liga Brasileira - Série dos Campeões</li>\n      <li><strong>3º lugar</strong> CBLoL 2014 - Final Regional</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2013</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>1º lugar</strong> Campeonato Brasileiro</li>\n      <li><strong>2º lugar</strong> International Wildcard (Alemanha)</li>\n\t  <li><strong>2º lugar</strong> Desafio Internacional</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2012</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>3º lugar</strong> Campeonato Brasileiro</li>\n    </ul>\n  </li>\n</ul>","en_US":"paiN Gaming is one of the most famous squads in Brazilian esports. AD carry brTT and mid laner Kami have developed into highly charismatic individuals with massive fanbases. But paiN isn’t just a resting home for big egos. They consistently rank among the top three teams in Brazil, and recently snagged a 1st place finish in the 2015 CBLOL Winter Playoffs.","fr_FR":"PaiN Gaming est l'une des plus célèbres équipes e-sportives brésiliennes. Des joueurs comme brTT et Kami sont devenus très charismatiques et possèdent une immense base de fans. Mais paiN n'est pas qu'un concentré d'egos. L'équipe s'est régulièrement classée parmi les trois meilleures au Brésil et a récemment obtenu une 1re place lors des play-offs d'hiver de la CBLOL 2015.","pl_PL":"PaiN Gaming to jedna z najsłynniejszych brazylijskich drużyn, a większość tej sławy zawdzięcza swoim zawodnikom. Gracze tacy jak brTT i Kami są niezwykle charyzmatycznymi osobami posiadającymi rzesze fanów. Jednakże paiN nie kończy się na zawodnikach z wielkim ego. Ciągle znajduje się w najlepszej trójce brazylijskich drużyn, a niedawno zdobyło 1. miejsce w zimowych playoffach CBLOL 201","de_DE":"PaiN Gaming ist eins der berühmtesten Teams in Brasilien. Der Schütze brTT und Mid-Laner Kami entwickelten sich zu regionalen Stars und bauten sich durch ihr charismatisches Auftreten eine riesige Fan-Gemeinschaft auf. Aber paiN ist nicht nur ein Zuhause für große Egos. Sie befinden sich kontinuierlich unter den Top drei Teams von Brasilien, schnappten sich den ersten Platz im CBLOL Winter Finale 2015 und viel wichtiger, die Wildcard für Worlds.","es_ES":"PaiN Gaming es uno de los equipos más conocidos del panorama de los deportes electrónicos en Brasil. Su carry DA, brTT, y su calle central, Kami, son jugadores enormemente populares, con auténticas legiones de seguidores. Pero PaiN no es un simple albergue para egos hipertrofiados. Además de quedar sistemáticamente entre los tres primeros clasificados en Brasil, recientemente se han hecho con el primer puesto en las eliminatorias de invierno de la CBLOL 2015."},"foreignIds":{},"players":[418,420,440,446,456,773,946],"starters":[418,420,440,446,456],"subs":[773,946]},{"id":108,"slug":"koo-tigers","name":"ROX Tigers","guid":"be6e3e07-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/koo-tigers-5xgsd4td.png","acronym":"ROX","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:04.000Z","bios":{"en_US":"<p>The ROX Tigers are ferocious in their pursuit of victory. The team formerly known as the KOO Tigers formed in 2014 and quickly evolved into one of the LCK’s elite predators. While they maintained a spot among the best, SK Telecom T1 seemed to have their number. Their fortunes turned in Champions Summer 2016, when they finally claimed their first title and stepped out of the shadow of Faker and company.</p>\n\n<p>Their triumph was short lived. When ROX met SKT again in the semifinals at the 2016 World Championship, ROX lost a close series to their rivals. After a huge roster shakeup that saw many fan favorites depart, ROX heads into 2017 looking to forge a new path to the top of the food chain.</p>","fr_FR":"KOO Tigers (précédemment GE Tigers) s'est formée en 2014, récupérant des joueurs chez NaJin Sword, NaJin Shield et Incredible Miracle. KOO, malgré cette composition éclectique, a vite su trouver l'unité requise pour combattre. Koo a obtenu la 2e place lors du Segment de printemps des LCK 2015 et a grimpé jusqu'aux demi-finales du Championnat du monde IEM Saison IX dans l'année qui a suivi sa formation.","pl_PL":"KOO Tigers (wcześniej znane jako GE Tigers) zostało utworzone w 2014 roku, zbierając graczy z NaJin Sword, NaJin Shield i Incredible Miracle. KOO szybko stało się zgraną drużyną, mimo że dla obserwatorów z zewnątrz mogło wyglądać nieco jak stwór Frankensteina. KOO zajęło 2. miejsce podczas wiosennego split LCK 2015 i dotarło do półfinałów mistrzostw świata sezonu dziewiątego IEM w ciągu roku od utworzenia.","de_DE":"<p>Dir ROX Tigers (ehemals KOO Tigers) wurden 2014 mit Spielern von NaJin Sword, NaJin Shield und Incredible Miracle gegründet. ROX verschmolz schnell zu einer eingeschworenen Einheit, obwohl die Mannschaft für Außenstehende wie eine von Frankensteins Kreationen aussah. Obwohl ROX eine der stärksten Mannschaften in der LCK war, schnappte SK Telecom T1 ihnen jeden Erfolg vor der Nase weg. Doch 2016 wendete sich das Blatt zugunsten der Tigers, als sie ihren ersten Split in der LCK gewannen und endlich aus dem Schatten von Faker und dessen Kameraden treten konnten. ROX hat zwar gerade erst den ersten Titel in der LCK gewonnen, aber jetzt richten sie ihre Augen auf das ultimative Ziel: Die Trophäe der Weltmeisterschaft 2016.</p>","es_ES":"<p>ROX Tigers (anteriormente llamado KOO Tigers) es un equipo formado en 2014 a partir de los jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se convirtió enseguida en una unidad de batalla, aunque pareciese un equipo Frankenstein para quien lo viese desde fuera. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapársele de las manos, pues SK Telecom T1 se la arrebataba una y otra vez. La suerte de los Tigers cambió en 2016 cuando finalmente consiguieron ganar su primer split de la LCK, lo que les hizo salir de la sombra de Faker y compañía. Puede que ROX haya conseguido su primer título de la LCK, pero ahora tiene la mirada puesta en su objetivo definitivo: el trofeo del Campeonato Mundial 2016.</p>","pt_BR":"A ROX Tigers (antiga KOO Tigers) foi formada em 2014, trazendo jogadores da NaJin Sword, NaJin Shield e Incredible Miracle. Mas a ROX rapidamente se integrou formando uma única unidade de combate, mesmo com muitos dizendo que essa equipe seria um frankenstein.  Apesar de ser uma das equipes mais fortes da LCK, a vitória parecia evitá-los constantemente toda vez que se encontravam com a SK Telecom T1. Mas a sorte da Tiger mudou em 2016 quando finalmente conseguiram ganhar sua primeira Etapa da LCK, saindo assim das sombras de Faker e companhia. A ROX pode ter conseguido levar para a casa seu primeiro título da LCK, mas agora eles estão de olho em um prêmio muito maior: o troféu do Campeonato Mundial 2016.","ko_KR":"<p>ROX Tigers(전 KOO/GE Tigers)는 2014년에 NaJin Sword, NaJin Shield, Incredible Miracle 출신 선수들을 모아 창단한 팀입니다. 언뜻 보기에는 마구잡이로 선수들을 한 팀에 모아놓은 듯했지만 창단 후 얼마 되지 않아 가공할 만한 모습을 보이기 시작했죠. </p>\n<p>창단 후 채 1년도 지나지 않은 시점에서 2015 LCK 스프링에서 2위에 올랐고 IEM 시즌 IX 월드 챔피언십에서는 준결승까지 진출했을 정도니까요. 뒤이어 2015 월드 챔피언십에서는 당당히 2위에 오르며 세계 최강팀 중 하나로 자리매김했습니다. 2016 스프링 정규 시즌에서는 16승 2패로 1위를 했지만, 플레이오프 결승에서 SKT T1에 3대1로 패하면서 아쉽게 2016 스프링 시즌에 우승하지는 못하였습니다.</p>\n","es_AR":"<p>ROX Tigers (anteriormente conocidos como KOO Tigers) se formó en el 2014 con jugadores de NaJin Sword, NaJin Shield e Incredible Miracle. ROX se armó como una unidad de lucha, aún cuando los ojos ajenos miraban al equipo como apenas un rejunte de miembros. A pesar de ser uno de los equipos más fuertes de la LCK, la victoria parecía escapárseles siempre, ya que SK Telecom T1 les bloqueaba el paso en todas las oportunidades. La suerte de los Tigers cambió en el 2016, cuando finalmente ganaron su primer torneo de la LCK, lo que les permitió salir de la sombra de Faker y compañía. ROX se adjudicó su primer título de LCK, pero ahora su foco está en el objetivo principal: el trofeo del Campeonato Mundial 2016.</p>\n\n<p><strong>Entrenador: Kim \"Ssong\" Sang-su</strong></p>"},"foreignIds":{"drupalId":"3641"},"players":[572,742,1044,1045,1231,1270,2049],"starters":[572,1044,1045,1231,2049],"subs":[742,1270]}],"players":[{"id":418,"slug":"mylon","name":"Mylon","firstName":"Matheus","lastName":"Borges","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mylon-66dytwkw.png","hometown":"Santos - SP","region":"CBLOL Brazil","birthdate":"1996-08-11","createdAt":"2015-05-13T21:04:39.000Z","updatedAt":"2017-05-30T20:36:47.000Z","bios":{"pt_BR":"Campeão Brasileiro em 2012 com apenas 15 anos, Mylon sempre esteve entre os melhores topos do país. Figura conhecida dos torcedores tanto por seu alto nível de jogo quanto pelas declarações polêmicas, ele chegou na paiN Gaming após pouco mais de dois anos na rival Keyd Stars. Foi um dos pilares da equipe na conquista do CBLoL, Wildcard e campanha do Mundial. Seu estilo de jogo é hiper agressivo, o que pode pesar contra ele. Mylon dificilmente perde a sua fase de rotas e é excepcional em utilizar o Teleporte para flanquear os adversários, mas é frequentemente pego fora de posição.","en_US":"<p>Matheus \"Mylon\" Borges is something of a legend in Brazil, with titles and accolades going back as early as Season 2.  While he experimented with tanks in the top lane at the beginning of his time with paiN Gaming, he has always looked most comfortable on AP champions that can dominate in lane.\n</p>\n<p>\nFrequently found roaming toward the mid lane, Mylon has been a major factor in paiN’s increased map pressure this season. His teleport plays across the map, along with his constant willingness to initiate team fights, were critical in elevating this paiN roster to their first Championship in two years.  Look for Mylon to test out his signature Rumble against international competition.\n</p>","fr_FR":"<p>Matheus « Mylon » Borges est une sorte de légende au Brésil, avec des récompenses qui remontent à la Saison 2. Il a essayé des tanks sur la voie du haut dans ses premiers temps chez paiNGaming, mais il a toujours semblé être beaucoup plus à l'aise avec des champions AP qui peuvent dominer sur la voie.\n</p>\n<p>\nMylon, que l'on voit souvent rôder près de la voie du milieu, a joué un rôle important dans la pression croissante que paiN a fait peser sur la carte cette saison. Ses téléportations autour de la carte et son besoin impétueux de déclencher des combats d'équipe comptent parmi les raisons qui ont conduit paiN à leur premier Championnat du monde en deux ans. Nous aurons ainsi l'occasion de voir Mylon essayer son fameux Rumble face aux meilleurs joueurs du monde.\n</p>","pl_PL":"<p>Matheus „Mylon” Borges to w Brazylii swoista legenda. Może się poszczycić tytułami i wyróżnieniami pochodzącymi jeszcze z Sezonu Drugiego. Na początku swej przygody z paiN Gaming Matheus eksperymentował głównie z obrońcami w górnej alei. Najlepiej spisuje się jednak, prowadząc dominujących magów.\n</p>\n<p>\nCzęsto przenosi się też do środkowej alei. Wkładu Mylona w doskonałą kontrolę zespołu paiN w tym sezonie nie sposób przecenić. To m.in. dzięki jego teleportom i talentowi do wszczynania ostrej walki drużyna zakwalifikowała się do Mistrzostw po raz pierwszy od dwóch lat. Nie przegapcie chwili, gdy Mylon poprowadzi swojego ulubionego Rumble'a przeciwko światowej konkurencji.\n</p>","de_DE":"<p>Matheus „Mylon“ Borges ist eine Art Legende in Brasilien, ausgezeichnet mit mehreren Titeln, die schon bis zur zweiten Saison zurückreichen. Am Anfang seiner Karriere bei paiN Gaming experimentierte er oftmals mit Tanks auf der Top-Lane, doch meist dominierte er mit Fähigkeitsstärken-Champions auf denen er sich offensichtlich am wohlsten fühlte.</p>\n\n<p>Mylon ist ein großer Bestandteil der immens wachsenden Roaming-Taktik in dieser Saison, da er auch häufiger mal die Mid-Lane besucht und somit den Druck auf dem Spielfeld erhöht. Sein Gebrauch von „Teleport“ und der konstanten Einsatzbereitschaft, Teamkämpfe initiieren zu wollen, hat paiN Gaming seit zwei Jahre die Teilnahme zur Weltmeisterschaft endlich ermöglicht. </p>\n","es_ES":"<p>Matheus “Mylon” Borges es una leyenda en Brasil, con títulos y premios que se remontan a la Temporada 2. Aunque al comienzo de su carrera en paiN Gaming se caracterizaba por jugar campeones tanque en la calle superior, siempre se ha visto mucho más cómodo con magos, por ejemplo Nidalee o Rumble, que le permiten dominar a su oponente. </p>\n\n<p>Con frecuencia acude a la calle central para ayudar a su compañero Kami, siendo esto un factor importante en la presión que paiN Gaming ejerce en sus enemigos a través de todo el mapa, esto sumado al deseo continuo de iniciar peleas de equipo han sido dos factores críticos para llevar a paiN Gaming a conquistar su primer campeonato en dos años. Esperad el Rumble de Mylon en la competición internacional. </p>\n"},"foreignIds":{"TRLH3":"1001160086","TRLH4":"1001160086","drupalId":"4869"},"socialNetworks":{"facebook":"https://www.facebook.com/mylonzete","twitter":"https://twitter.com/mylonzete","twitch":"https://www.twitch.tv/mylonzete"},"champions":[{"id":5,"playerId":418,"championId":68,"championKey":"Rumble","championName":"Rumble","createdAt":"2015-05-13T21:08:04.000Z","updatedAt":"2017-05-30T20:36:46.000Z"},{"id":6,"playerId":418,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2015-05-13T21:08:04.000Z","updatedAt":"2017-05-30T20:36:46.000Z"},{"id":424,"playerId":418,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2016-05-17T22:55:02.000Z","updatedAt":"2017-05-30T20:36:46.000Z"}],"liveGameTeam":61},{"id":420,"slug":"kami","name":"Kami","firstName":"Gabriel","lastName":"Bohm","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kami-bitvt7yz.png","hometown":"Pelotas - RS","region":"CBLOL Brazil","birthdate":"1996-02-21","createdAt":"2015-05-13T21:14:29.000Z","updatedAt":"2017-05-30T20:25:18.000Z","bios":{"pt_BR":"<p>Kami é uma unanimidade no cenário local. Jogador brasileiro mais bem ranqueado nas filas americanas em 2011 e 2012 e líder em 2013, ele é a peça central de uma das maiores equipes brasileiras, ocupando a posição de titular da paiN desde dezembro de 2011.</p> \n<p>Ele ficou conhecido pelo estilo seguro e passivo na rota, mas em 2015 passou a brilhar como nunca exibindo suas mecânicas apuradas em jogadas imprevisíveis - de roubos de Barão improváveis a jogadas de utilidade servindo os rivais de bandeja para o seu time. Surgiram conversas sobre sua provável ida para a LCS Norte Americana, mas ele continuou no país, fortalecendo seu legado na rota do meio.</p>\n<p>O sonho de muitos novatos é enfrentá-lo, e disputas contra antigos rivais sempre será o destaque das partidas. Para um jogador do meio, você não inicia no cenário competitivo até jogar contra o lendário Kami.</p>","en_US":"<p>Gabriel \"Kami\" Santos is the heart of paiN Gaming. He joined the squad in Season 2 and has competed under the paiN banner since IEM São Paulo 2012. He takes pride in this, knowing that stability is important for his region to be taken seriously by fans and sponsors alike. In a sport rife with players hopping between teams at the drop of a hat, Kami is a rock of consistency.\n</p>\n<p>\nKami is also a leader on and off the rift, a true team captain. He is a patient player who makes decisions with the bigger picture in mind. It doesn’t hurt that he is one of the most mechanically skilled players in CBLoL. As an all around mage, he’ll often wait for big team fights to make his move. But once he sees an opportunity, watch out. Kami has no problem taking over games if given half a chance.</p>","fr_FR":"<p>Gabriel « Kami » Santos est le coeur de paiN Gaming. Il a rejoint l'équipe durant la Saison 2 et il joue sous l'étendard de paiN depuis l'IEM São Paulo 2012. Il en est très fier, sachant que cette stabilité est importante pour que sa région soit prise au sérieux tant par les fans que par les sponsors. Dans un sport qui voit tellement de joueurs passer d'une équipe à l'autre sur un coup de tête, Kami est un modèle de constance.\n</p>\n<p>\nKami est également un vrai chef, sur la Faille et dans la vie, un vrai capitaine d'équipe. C'est un joueur patient, qui prend des décisions en gardant en tête les objectifs stratégiques. Et le fait qu'il soit techniquement l'un des joueurs les plus doués des CBLoL y est pour beaucoup. Mage polyvalent, il attend souvent que les gros combats d'équipe débutent pour intervenir. Mais dès qu'il voit une opportunité, il la saisit. Kami n'a aucun problème à prendre la partie en main si on lui en laisse l'occasion.\n</p>","pl_PL":"<p>Gabriel „Kami” Santos to serce drużyny paiN Gaming. Dołączył do zespołu w Sezonie Drugim i gra pod banderą paiN od czasu IEM São Paulo 2012. Jest bardzo dumny z tego faktu – wie, że trzymanie stałego składu pomaga szerzyć popularność jego regionu wśród fanów i sponsorów. Wokół zawodnicy wciąż zmieniają zespoły, a Kami trwa niezmienny niczym skała.\n</p>\n<p>\nJest też przywódcą i prawdziwym kapitanem drużyny, również poza Rift. Słynie z cierpliwości i przemyślanych decyzji. Nie zaszkodzi dodać, że to jednocześnie jeden z najmocniejszych technicznie zawodników w CBLoL. Jako wszechstronny mag często czai się i czeka, aż wywiąże się poważna walka. Jednak gdy tylko dostrzeże szansę na akcję, wszyscy muszą się mieć na baczności. Kami lubi dominować na mapie, kiedy tylko ma ku temu sposobność.\n</p>","de_DE":"<p>Gabriel „Kami“ Santos ist das Herz von paiN Gaming. Er trat dem Team in der zweiten Saison bei und hatte sein Debüt unter dem paiN Banner auf der IEM Sao Paulo 2012. Darauf ist er stolz, denn er weiß wie wichtig Beständigkeit in seiner Region ist, vor allem, um von den Fans und den Sponsoren ernst genommen zu werden. In einer Sportart, in der die Spieler ihre Teams teilweise im Sekundentakt wechseln, ist Kami der Fels in der Brandung. </p>\n\n<p>Kami ist ein Anführer, nicht nur in der Kluft, sondern auch außerhalb des Spiels, jemand der ein echter Kapitän ist. Er ist ein sehr geduldiger Spieler und trifft immer Entscheidungen ohne den Blick fürs Ganze zu verlieren. Zusätzlich kann man ohne ein schlechtes Gewissen zu haben sagen, dass er einer der begabtesten Spieler in seiner Region ist. Als Alleskönner auf dem Gebiet der Magier, gibt er sich dennoch geduldig, um den richtigen Moment abzupassen. Steht ein großer Kampf an ist er bereit, um seinen Zug durchzuführen. Aber Vorsicht! Sieht er eine Möglichkeit, zögert er keine Sekunde, das Spiel an sich zu reißen. </p>\n","es_ES":"<p>Gabriel “Kami” Santos es el alma de paiN Gaming. Se unió al equipo en la Temporada 2 y ha jugado bajo su escudo desde la IEM de Sao Paulo en 2012. Y está orgulloso de ello, porque sabe que la estabilidad es importante para que su región, Brasil, madure y sea tomada en serio por patrocinadores y público. En un deporte plagado de jugadores cambiado de equipo cada dos por tres, Kami es la roca de la consistencia. </p>\n\n<p>Kami es también el líder, tanto dentro como fuera de la Grieta, un auténtico capitán. Él es el jugador paciente que toma las decisiones valorando los pros y los contras de cada una de ellas a largo plazo. Un mago todoterreno, normalmente espera a las peleas de equipo para entrar en acción. Ándate con ojo, Kami cerrará un partido si le das la más mínima oportunidad. </p>\n"},"foreignIds":{"TRLH3":"1001160088","TRLH4":"1001160088","drupalId":"4871"},"socialNetworks":{"facebook":"https://www.facebook.com/paiNKamiRazer","twitter":"https://twitter.com/Kamizeon","twitch":"https://www.twitch.tv/kamikat"},"champions":[{"id":425,"playerId":420,"championId":4,"championKey":"TwistedFate","championName":"Twisted Fate","createdAt":"2016-05-17T23:07:03.000Z","updatedAt":"2017-05-30T20:25:18.000Z"},{"id":426,"playerId":420,"championId":103,"championKey":"Ahri","championName":"Ahri","createdAt":"2016-05-17T23:07:03.000Z","updatedAt":"2017-05-30T20:25:18.000Z"},{"id":427,"playerId":420,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-05-17T23:07:03.000Z","updatedAt":"2017-05-30T20:25:18.000Z"}],"liveGameTeam":61},{"id":440,"slug":"loop","name":"Loop","firstName":"Caio ","lastName":"Almeida","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loop-gfqzjny2.png","hometown":"São Paulo - SP","region":"CBLOL Brazil","birthdate":"1995-02-15","createdAt":"2015-05-13T23:06:08.000Z","updatedAt":"2017-05-30T20:26:43.000Z","bios":{"pt_BR":"Vice-campeão brasileiro em 2012 e jogador da Keyd Stars entre janeiro de 2013 e Outubro de 2015, Loop conheceu os altos e baixos da profissão atuando como caçador, atirador e suporte, posição que ocupa atualmente. O paulista é conehcido por ser um dos jogadores mais estrategistas do cenário brasileiro, e soma não só nas táticas, mas na liderança como coordenador de jogadas. Flexível nas escolhas, Loop pode atuar como tanque e iniciador ou como protetor de seus carregadores. Após um hiato competitivo de um ano, ele volta com a motivação mais alta do que nunca em busca do título que falta em sua carreira.","en_US":""},"foreignIds":{},"socialNetworks":{"twitch":"http://www.twitch.tv/loopk","facebook":"https://www.facebook.com/LoopLoL","twitter":"https://twitter.com/loopk_"},"champions":[{"id":37,"playerId":440,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2015-05-13T23:06:39.000Z","updatedAt":"2017-05-30T20:26:43.000Z"},{"id":38,"playerId":440,"championId":12,"championKey":"Alistar","championName":"Alistar","createdAt":"2015-05-13T23:06:39.000Z","updatedAt":"2017-05-30T20:26:43.000Z"},{"id":39,"playerId":440,"championId":201,"championKey":"Braum","championName":"Braum","createdAt":"2015-05-13T23:06:39.000Z","updatedAt":"2017-05-30T20:26:43.000Z"}],"liveGameTeam":61},{"id":446,"slug":"matsukaze","name":"Matsukaze","firstName":"Pedro","lastName":"Gama","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/matsukaze-9ky04scl.png","hometown":"Niterói - RJ","region":"CBLOL Brazil","birthdate":"1994-02-01","createdAt":"2015-05-13T23:17:58.000Z","updatedAt":"2017-05-30T20:29:25.000Z","bios":{"pt_BR":"<p>Matsu já chamava atenção em equipes semi-profissionais, e foi um dos poucos novatos que realmente deixaram o status de revelação para se consolidarem no CBLoL, em 2015. Autor de um dos únicos Pentakills do CBLoL até agora, o atirador ficou um tempo nas sombras, mas sempre foi considerado um jogador com potencial altíssimo. </p>\n<p>Matsukaze tem um estilo diferente: em vez de criar jogadas, ele espera a definição até o último segundo, pensando a todo segundo em seu posicionamento. Isso faz com que suas jogadas demorem a acontecer, principalmente em um meta de lutas rápidas, mas contribui para o sempre alto A/M/A do atirador.</p>","en_US":""},"foreignIds":{},"socialNetworks":{"facebook":"https://www.facebook.com/MatsukazeLoL","twitter":"https://twitter.com/Matsucakeru","twitch":"http://www.twitch.tv/matsucake"},"champions":[{"id":55,"playerId":446,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2015-05-13T23:18:33.000Z","updatedAt":"2017-05-30T20:29:25.000Z"},{"id":197,"playerId":446,"championId":157,"championKey":"Yasuo","championName":"Yasuo","createdAt":"2015-11-04T20:02:26.000Z","updatedAt":"2017-05-30T20:29:25.000Z"},{"id":377,"playerId":446,"championId":222,"championKey":"Jinx","championName":"Jinx","createdAt":"2016-05-17T20:36:07.000Z","updatedAt":"2017-05-30T20:29:25.000Z"}],"liveGameTeam":61},{"id":456,"slug":"taeyeon","name":"Tay","firstName":"Rodrigo","lastName":"Panisa","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/taeyeon-chx0csjh.png","hometown":"Guarujá - SP","region":"CBLOL Brazil","birthdate":"1996-11-22","createdAt":"2015-05-13T23:39:02.000Z","updatedAt":"2017-05-30T20:40:53.000Z","bios":{"pt_BR":"<p>TaeYeon é conhecido da maioria dos profissionais pelas filas ranqueadas (além de jogos normais - é o jogador do servidor brasileiro que mais jogou partidas de LoL desde a abertura dele), e conseguiu no competitivo emplacar seu jogo com alta mobilidade e agressividade calculada.</p>\n<p>Sua mecânica fortíssima também permitia que jogasse com diversos tipos de campeões no meio, e também foi o que deu a luz ao técnico MiT para testá-lo em várias posições.</p>","en_US":""},"foreignIds":{},"socialNetworks":{"facebook":"https://www.facebook.com/taylolxd","twitter":"https://www.twitter.com/taylolxd","twitch":"https://www.twitch.tv/taeyeon"},"champions":[{"id":109,"playerId":456,"championId":238,"championKey":"Zed","championName":"Zed","createdAt":"2015-07-15T18:34:24.000Z","updatedAt":"2017-05-30T20:40:52.000Z"},{"id":225,"playerId":456,"championId":92,"championKey":"Riven","championName":"Riven","createdAt":"2016-01-15T21:56:34.000Z","updatedAt":"2017-05-30T20:40:52.000Z"},{"id":430,"playerId":456,"championId":268,"championKey":"Azir","championName":"Azir","createdAt":"2016-05-17T23:17:51.000Z","updatedAt":"2017-05-30T20:40:52.000Z"}],"liveGameTeam":61},{"id":572,"slug":"sangyoon","name":"Sangyoon","firstName":"Sangyun","lastName":"Kwon","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sangyoon-7zedseul.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-31T00:53:57.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4334","ESPORTSTMNT06":"200000376"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":742,"slug":"shy","name":"Shy","firstName":"Sangmyeon","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shy-flf80pma.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-31T00:47:21.000Z","bios":{"en_US":"<p>CJ Entus top lane player Sang-myeon \"Shy\" Park is one of the longest tenured professional League of Legends players in Korea. The 24 year old has been competing at the highest level since 2012 when he joined MiG Frost. Shy was at the forefront of CJ Entus’ golden age as an organization, when both CJ Entus Frost and sister team CJ Entus Blaze made the OGN Champions Finals with regularity. \n</p>\n<p>\nWhile sometimes timid off the Rift, Shy is quick with a smile, and quicker with a carry. Shy will need to lend all of his veteran experience to his teammates if they are going to succeed on the new ROX Tigers roster. But don’t count him out yet. Sometimes it’s the old dogs that have the biggest bite.\n</p>","fr_FR":"<p>Sur la voie du haut, CJ Entus dispose de Sang-myeon « Shy », l'un des vétérans les plus aguerris de la scène professionnelle coréenne. À 24 ans, il joue au plus haut niveau depuis 2012, époque à laquelle il a rejoint MiG Frost. Shy était aux avant-postes pendant l'âge d'or de CJ Entus en tant qu'organisation, c'est-à-dire lorsque les équipes sœurs CJ Entus Frost et CJ Entus Blaze terminaient régulièrement en finale d'OGN Champions. \n</p>\n<p>\nQuoiqu'il soit parfois timide en dehors de la Faille, Shy se rattrape avec un carry. Shy devra apporter toute son expérience de vétéran à ses coéquipiers s'ils entendent reprendre le flambeau de CJ lorsque le groupe était à son sommet. Ne l'oubliez pas trop vite. Le vieux lion a toujours un mot à dire face aux jeunes loups.\n</p>","pl_PL":"<p>Górny gracz CJ Entus, Sang-myeon „Shy” Park jest jednym z najbardziej doświadczonych profesjonalnych graczy w LoLa w Korei. Ten 24-latek grał na najwyższym poziomie od 2012 roku, kiedy dołączył do MiG Frost. Shy był kluczowym elementem złotej ery CJ Entus, kiedy zarówno CJ Entus Frost i siostrzana drużyna, CJ Entus Blaze regularnie docierały do finałów OGN Champions. \n</p>\n<p>\nChociaż niektórzy są nieśmiali poza Rift, Shy jest zawsze skory do uśmiechu i grania prowadzącym. Jeśli jego drużyna chce doprowadzić do kolejnej złotej ery CJ, musi podzielić się z nią całym swoim doświadczeniem. Nie należy go jednak ignorować. Czasem nawet skamieliny potrafią być groźne.\n</p>"},"foreignIds":{"drupalId":"371","ESPORTSTMNT06":"200000373"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":773,"slug":"rakin","name":"Rakin","firstName":"Rafael","lastName":"Knittel","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rakin-ezk35n2t.png","hometown":"Salvador - BA","region":"CBLOL Brazil","birthdate":"1994-12-25","createdAt":"2015-06-03T19:06:32.000Z","updatedAt":"2017-05-30T20:32:33.000Z","bios":{"en_US":"","pt_BR":"O baiano conseguiu se provar como novato em uma rota dominada por grandes nomes do cenário brasileiro. Controlando os mais diversos tipos de campeões - mas com preferência para os magos de controle, Rakin entra para a paiN para somar à posição, aprendendo e duelando com Kami para fortalecer seu nível individual e o da equipe, e quem sabe até substituir o lendário meio em algumas partidas."},"foreignIds":{"drupalId":"4552"},"socialNetworks":{"twitch":"twitch.tv/raxyz ","facebook":"https://www.facebook.com/leaguerakin","twitter":"https://twitter.com/rakinlol"},"champions":[{"id":438,"playerId":773,"championId":26,"championKey":"Zilean","championName":"Zilean","createdAt":"2016-05-17T23:49:15.000Z","updatedAt":"2017-05-30T20:32:33.000Z"},{"id":439,"playerId":773,"championId":8,"championKey":"Vladimir","championName":"Vladimir","createdAt":"2016-05-17T23:49:15.000Z","updatedAt":"2017-05-30T20:32:33.000Z"},{"id":440,"playerId":773,"championId":25,"championKey":"Morgana","championName":"Morgana","createdAt":"2016-05-17T23:49:15.000Z","updatedAt":"2017-05-30T20:32:33.000Z"}],"liveGameTeam":61},{"id":946,"slug":"picoca","name":"Picoca","firstName":"Matheus","lastName":"Tavares","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/picoca-5p10ec3l.png","hometown":"Itabaiana - SE","region":"CBLOL Brazil","birthdate":"1994-09-13","createdAt":"2016-01-04T20:19:54.000Z","updatedAt":"2017-05-30T20:42:19.000Z","bios":{"pt_BR":"O jogador sergipano entrou para o CBLoL direto na atual campeã brasileira. O desafio foi grande: substituir o francês Dioud e manter o nível da equipe que participou do Mundial 2015, e Picoca deu conta do recado. Agora na reserva, ele deve continuar sendo um ponto de apoio importante na moral da paiN, além de um substituto à altura dos titulares.  "},"foreignIds":{},"socialNetworks":{"twitch":"www.http://twitch.tv/picoca_lol","youtube":"www.youtube.com/picocalol","facebook":"www.facebook.com/picocalol/","twitter":"www.twitter.com/picocalol"},"champions":[{"id":236,"playerId":946,"championId":4,"championKey":"TwistedFate","championName":"Twisted Fate","createdAt":"2016-01-16T14:22:49.000Z","updatedAt":"2017-05-30T20:42:19.000Z"},{"id":237,"playerId":946,"championId":34,"championKey":"Anivia","championName":"Anivia","createdAt":"2016-01-16T14:22:49.000Z","updatedAt":"2017-05-30T20:42:19.000Z"},{"id":238,"playerId":946,"championId":76,"championKey":"Nidalee","championName":"Nidalee","createdAt":"2016-01-16T14:22:49.000Z","updatedAt":"2017-05-30T20:42:19.000Z"}],"liveGameTeam":61},{"id":1044,"slug":"lindarang","name":"Lindarang","firstName":"Manheung","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lindarang-8tddakt4.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:16:03.000Z","updatedAt":"2017-05-31T00:51:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000374"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1045,"slug":"seonghwan","name":"SeongHwan","firstName":"Seonghwan","lastName":"Yun","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seonghwan-g8jv42cj.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:14:35.000Z","updatedAt":"2017-05-31T00:52:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000440"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1231,"slug":"key","name":"Key","firstName":"Hangi","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/key-9cxe5iyu.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-04-28T19:01:05.000Z","updatedAt":"2017-05-31T00:53:08.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000959"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":1270,"slug":"mightybear","name":"Mightybear","firstName":"Min-soo","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mightybear-dx94b7va.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:33:03.000Z","updatedAt":"2017-05-31T00:46:49.000Z","bios":{"en_US":"<p>\nMin-soo “Mightybear” Kim launched his professional career in late 2014 while playing for team Positive Energy in China. He then moved on to powerhouse Chinese esports organization Newbee (best known for their Dota 2 teams), where he stayed until early 2016. \n</p>\n<p>\nIn mid-2016 Mightybear decided to make the move to Europe in order to play with Team Vitality. After a brief stay, he made his way to Korea for 2017.\n</p>","de_DE":"<p>Min-Soo „Mightybear“ Kim ist praktisch der Neue in der Klasse. Er fing mit der Schule direkt im Ausland an, wo er sich allerdings nicht wohl fühlte, weil er nie zu Wort kam. Der Suchdrang nach einem neuen Zuhause wuchs schnell und Worten folgten die Taten. </p>\n\n<p>Im Klartext heißt dies, dass der koreanische Amateur, der vorher unter „Moon“ und „PandaBears“ bekannt war, sein professionelles Debüt in der Zweitliga Chinas, der LSPL, feierte. Bei Positive Energy konnte er kein Spiel für seine erste Mannschaft absolvieren, doch gab es für ihn einen Hauch an Hoffnung, als Newbee (heute in der LPL) den Club aufkaufte. Tatsächlich kam er im Demacia Cup 2015 Summer gegen Team WE Future und während der LPL 2016 Spring Promotion zum Einsatz. Allerdings konnte er mit den einhergehenden sechs Niederlagen (beide 0:3-Spielstände) bisher noch nichts unter Beweis stellen und hofft wieder einmal von seinen Fans und Kollegen respektiert geachtet zu werden. </p>\n\n<p>Mit Vitality könnte dies sein Durchbruch sein, eine Mannschaft aus alten Veteranen und hungrigen Amateuren. Die Mischung hat sich in League of Legends stets als Formel für Erfolg bestätigt und mit dem frisch entzündetem Feuer in Mightybear, könnte er vielleicht der neue Kang-Yun „Trick“ Kim der EU LCS sein.\n</p>","fr_FR":"<p>La vague de jeunes junglers talentueux venus de Corée du Sud ne s’arrête pas ! Après Cho « H0R0 » Jae-hwan chez Millenium, Kim « Reignover » Yeu-jin puis Lee « Spirit » Da-yoon chez Fnatic et Kim « Trick » Gang-yun chez G2 Esports, voici que Kim « Mightybear » Min-su débarque à son tour sur le Vieux Continent. Sa destination n’est autre que la structure française Team Vitality. </p>\n\n<p>Mightybear a fait ses premiers pas en Chine, notamment dans l’équipe Newbee, qui évoluait en LSPL, la deuxième division chinoise. En 2016, il n’a disputé aucun match compétitif car il était le remplaçant de Baek « Swift » Da-hoon. </p>\n\n<p>Son intégration au sein de sa nouvelle équipe a été facilitée par sa maîtrise déjà très bonne de l’anglais, ce qui a facilité le choix de Vitality. Sa vision de jeu et son agressivité devraient permettre à Vitality de trouver un second souffle. Sa mission reste périlleuse car il doit faire oublier Ilyas « Shook » Hartsema en se montrant plus régulier et en montrant plus d’initiative. </p>","pl_PL":"<p>Min-su „Mightybear” Kim, pomimo koreańskiego pochodzenia, karierę profesjonalnego gracza rozpoczął w Chinach. W grudniu 2014 roku dołączył do pierwszej esportowej organizacji w Krainie Smoków – do Positive Energy. W szeregach chińskiego zespołu udało mu się wziąć udział w wielu pomniejszych turniejach, a nawet zagrać przeciwko krajowym potęgom, takim jak LGD Gaming czy Team WE. Do swoich sukcesów z tego okresu może zaliczyć utrzymanie się w drugorzędnej lidze w Chinach. Jednak już w maju 2015 roku grał pod nową banderą, gdyż został wykupiony z całym zespołem przez inną organizację. Dołączył do drużyny Newbee, gdzie miał największe osiągnięcia podczas pobytu w Chinach. Wraz z zespołem miał okazję zawalczyć w kwalifikacjach do najbardziej prestiżowej ligi w Państwie Środka, czyli LPL. Jednak na jego drodze kolejny raz stanął zespół WE, przeciwko któremu nie pomogły nadzwyczajne umiejętności Min-su w grze Gragasem. </p>\n<p>W maju 2016 roku został zapytany przez swojego agenta czy chciałby profesjonalnie grać w Europie. Odpowiedź Min-su była zdecydowanie pozytywna. Już wtedy potrafił mówić po angielsku, więc nie widział żadnych przeszkód w dołączeniu do Team Vitality. „Mightybear” od początku zaskakiwał swoim pogodnym usposobieniem. W wywiadzie przed letnim splitem EU LCS 2016 stwierdził, że nie odczuwa presji i jest bardzo optymistycznie nastawiony do gry w Europie. Po przyjeździe na nowy kontynent był zachwycony wyglądem miast i stylem życia Europejczyków. Jak tylko stał się członkiem Team Vitality, to założył konta na portalach społecznościowych. Od razu rozpoczął bardzo aktywne życie na tych stronach, przepełnione elementami humorystycznymi związanymi z jego pseudonimem „Mightybear”.</p>\n<p>W piątym sezonie zauważalnie gustował w niezwykle twardych dżunglerach, chociaż za swoich ulubionych bohaterów uważa Nidalee i Gravesa. Najlepiej sobie radził Gragasem i Rek’sai, lecz zdarzało się również, że wybierał bohaterów innego typu, jak na przykład ukochaną Nidalee. Od maja 2016 roku, czyli przeprowadzki do Europy, coraz częściej można było zobaczyć go w akcji Gravesem i Kindred. Jego największym osobistym osiągnięciem było wejście do Kręgu Pretendenta w Korei, który to wyczyn udało mu się powtórzyć na serwerze EU West w czasie krótszym niż miesiąc. Imponującym osiągnięciem oczywiście pochwalił się na portalach społecznościowych.</p>\n\n"},"foreignIds":{"TRLH3":"1001310014","TRLH4":"1001270014","TRLH2":"1001250062","FRA1TMNT2":"45034","ESPORTSTMNT06":"200001028"},"socialNetworks":{},"champions":[],"liveGameTeam":108},{"id":2049,"slug":"lava","name":"Lava","firstName":"Taehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:26:19.000Z","updatedAt":"2017-07-01T23:40:36.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001525"},"socialNetworks":{},"champions":[],"liveGameTeam":108}],"scheduleItems":[{"id":"AU_di2hpJTrHluSI14F9","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:84181fd4-2704-4a04-91dd-88efe430074a","scheduledTime":"2015-10-08T14:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"5","subBlockLabel":"paris - W2D1","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:a18d312c-46d6-4e34-9a5e-087e9d612a90"},"match":"84181fd4-2704-4a04-91dd-88efe430074a","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"a18d312c-46d6-4e34-9a5e-087e9d612a90","league":"9"}],"gameIdMappings":[{"id":"55b8cdf9-b80f-4aa9-8377-25d6725841ca","gameHash":"828ef9a4dd73bd08"}],"videos":[{"id":107,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:55b8cdf9-b80f-4aa9-8377-25d6725841ca","source":"https://www.youtube.com/embed/OnobCfAkXdY?wmode=transparent","createdAt":"2015-10-08T15:51:58.000Z","updatedAt":"2015-10-08T15:51:58.000Z","game":"55b8cdf9-b80f-4aa9-8377-25d6725841ca"},{"id":108,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:55b8cdf9-b80f-4aa9-8377-25d6725841ca","source":"https://www.youtube.com/embed/NmhEPDnc0sM?wmode=transparent","createdAt":"2015-10-08T15:56:21.000Z","updatedAt":"2015-10-08T15:56:21.000Z","game":"55b8cdf9-b80f-4aa9-8377-25d6725841ca"},{"id":118,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:55b8cdf9-b80f-4aa9-8377-25d6725841ca","source":"https://www.youtube.com/embed/VSE0q1acHlE?wmode=transparent","createdAt":"2015-10-09T10:07:58.000Z","updatedAt":"2015-10-09T10:07:58.000Z","game":"55b8cdf9-b80f-4aa9-8377-25d6725841ca"},{"id":149,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:55b8cdf9-b80f-4aa9-8377-25d6725841ca","source":"https://www.youtube.com/embed/Dix3rj-aU5g?wmode=transparent","createdAt":"2015-10-11T09:25:05.000Z","updatedAt":"2015-10-11T09:25:05.000Z","game":"55b8cdf9-b80f-4aa9-8377-25d6725841ca"}],"htmlBlocks":[],"match":{"id":"84181fd4-2704-4a04-91dd-88efe430074a","name":"KOO-vs-PNG","position":5,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"63c6d183-f8c8-4e46-9794-5d3fd7e0e3e5"},{"roster":"3514860d-fdc3-437f-9d25-43d24791c03e"}],"games":{"55b8cdf9-b80f-4aa9-8377-25d6725841ca":{"id":"55b8cdf9-b80f-4aa9-8377-25d6725841ca","name":"G1","generatedName":"KOO|PNG|G1|84181fd427044a0491d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"63c6d183-f8c8-4e46-9794-5d3fd7e0e3e5"},{"roster":"3514860d-fdc3-437f-9d25-43d24791c03e"}],"standings":{"result":[[{"roster":"63c6d183-f8c8-4e46-9794-5d3fd7e0e3e5"}],[{"roster":"3514860d-fdc3-437f-9d25-43d24791c03e"}]],"timestamp":1444318091197,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380641","gameRealm":"TRLH3","platformId":"TRLH3:1001380641","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"63c6d183-f8c8-4e46-9794-5d3fd7e0e3e5"}],[{"roster":"3514860d-fdc3-437f-9d25-43d24791c03e"}]],"timestamp":1444318091197,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"3514860d-fdc3-437f-9d25-43d24791c03e":0,"63c6d183-f8c8-4e46-9794-5d3fd7e0e3e5":1}}}