{"teams":[{"id":187,"slug":"apex","name":"Apex","guid":"be7107c4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/apex-9sdy9cc9.png","acronym":"APX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-20T22:26:46.000Z","updatedAt":"2016-09-17T20:23:58.000Z","bios":{"en_US":"<p>\nWe are Apex - hear us roar. Say hello to the newest team to enter the LCS. Even though this is a fresh team, there are some experienced players on the roster, and they’ve been working hard to make it from the Challenger circuit into the LCS. Apex has been playing together since the beginning of 2016, and they actually have an advantage in some of the older LCS teams in that aspect - new recruits aside, they know each other and have built up their synergy. The team even took an intensive boot camp in Korea before preparing for the Summer Split. With a veteran coach in their corner, and former LCS players looking to take another shot at the big leagues, Apex Gaming are bound to be an exciting team to watch.\n</p>\n<p>\nCoach: Brandon “Saintvicious” DiMarcio\n</p>"},"foreignIds":{},"players":[78,148,166,168,247,275,395,399,508,746],"starters":[166,168,247,399,508],"subs":[78,148,275,395,746]},{"id":215,"slug":"team-envy","name":"Team Envy","guid":"be713b5f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-1tyrikdl.png","acronym":"NV","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-i4es8cq5.png","createdAt":"2016-05-18T22:11:40.000Z","updatedAt":"2017-07-19T23:33:05.000Z","bios":{"en_US":"<p>Team Envy burst into the NA LCS in 2016 after acquiring the slot of Renegades. Their team fared well, gaining a playoff berth in their first split as an organization. The honeymoon period quickly ended though, and the team switched up their roster ahead of the 2017 Spring Split, adding veterans Lira and Apollo into the mix. After narrowly avoiding relegation, Envy will build around their breakout jungler Lira as they head into the summer split.</p>\n<p>Coach: Dong Hwan \"Violet\" Kim</p>","de_DE":"Team Envy stürmte 2016 in die NA LCS, nachdem sie den Platz der Renegades ergattert hatten. Die Mannschaft präsentierte sich gut und schaffte es gleich in ihrem ersten Split, in die Entscheidungsspiele einzuziehen. Kurz darauf endete die Hochphase jedoch und die Mannschaft ergänzte ihre Aufstellung für den Frühjahrs-Split 2017 um die Veteranen Lira und Apollo. Die beiden stoßen gerade noch rechtzeitig zum Rest der Mannschaft, um vor dem Beginn des Frühjahrs-Splits, in dem sie wieder die Entscheidungsspiele erreichen wollen, trainieren zu können."},"foreignIds":{},"players":[149,160,247,347,545,680,1449],"starters":[160,247,545,680,1449],"subs":[149,347]}],"players":[{"id":78,"slug":"diamondprox","name":"Diamondprox","firstName":"Danil","lastName":"Reshetnikov","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/diamondprox-gx80qbxc.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-06-15T22:40:21.000Z","bios":{"en_US":"<p>Danil “Diamondprox” Reshetnikov was one of the most innovative junglers in the world during Season 2. Diamondprox’s overwhelming map control kickstarted an aggressive counter-jungling strategy that continues to influence the League of Legends meta even now. </p>\n\n<p>Despite struggling to make an impact in the 2014 and 2015 EU LCS, Diamondprox was still regarded as one of the best junglers in Europe. The Unicorns of Love took Diamondprox in during the 2015 offseason, betting that his prior experience would be a boon for their revamped squad. Now, Apex Pride are hoping he can help them earn a spot in the NA LCS.</p>","fr_FR":"<p>Comme dans tout sport, il y a dans League of Legends des joueurs qui ont marqué leur époque, et le Russe Danil « Diamondprox » Reshetnikov est de ceux-là. Il se fait repérer alors qu’il n’est que platine, rejoint l’équipe Empire (qui deviendra Moscow Five) et domine très vite la scène européenne, allant jusqu’à impressionner à l’international. Diamondprox se démarque par sa capacité d’adaptation et son inventivité. Nombre d’observateurs estiment que c’est lui qui a inventé la tactique du counter-jungle, pratique à laquelle il s’adonne particulièrement bien avec Shyvana. Moscow Five est alors connue pour ses excellents résultats lors des compétitions majeurs et principalement lors des différentes éditions des Intel Extreme Masters.</p>\n\n<p>M5 et Diamondprox confirment leur supériorité sur la scène européenne en remportant les finales régionales, ce qui les qualifie d’office pour le mondial 2012. Considérés comme favoris, les M5 surprennent en s’inclinant en demi-finale face aux futurs champions du monde, les Taipei Assassins. Après quelques autres contre-performances, Diamondprox et ses coéquipiers (qui jouent désormais pour Gambit Gaming) réussissent à vaincre les équipes coréennes Azubu Frost et Azubu Blaze aux IEM Katowice 2013, avec un Diamondprox sur Xin Zhao pendant la majorité du temps.</p>\n\n<p>Dès la première occurrence, les M5 prennent part aux League of Legends Championship Series. Diamondprox participe énormément au succès de l’équipe et dicte la méta. Il est le pionnier du Nasus jungle, se démarque par son utilisation de Volibear, marque les esprits avec ses variantes d’Evelynn et va même jusqu’à invoquer Karma. Son équipe n’est plus maîtresse de la région mais obtient la 2e place de la saison de printemps et la 3e de la saison d’été, guidée par son agressivité réfléchie.</p>\n\n<p>Avec le temps, les départs successifs de ses coéquipiers et les problèmes logistiques inhérents à la structure pour laquelle il joue, les résultats de Diamondprox se sont dégradés. Celui qui a été plébiscité par la communauté lors des deux premières éditions des All-Stars n’arrive plus à mener son équipe vers la victoire, bien qu’il reste l’un des meilleurs junglers européens. Après être passé à deux doigts de la relégation en 2015 et alors que Gambit a vendu sa place en LCS, Diamondprox cherche à donner un second souffle à sa carrière en rejoignant Unicorns of Love et compte bien prouver qu’une légende ne meurt jamais.</p>\n","pl_PL":"<p>Gwiazda League of Legends od wczesnego drugiego sezonu. Złośliwi wytykają, że czerwona, bo pochodzi z Rosji. Nie zmienia to faktu, że to jeden z graczy, którzy wywarli największy wpływ na zmianę mety w grze. Danil Reshetnikov zaistniał w drużynie Team Empire, która zaskoczyła inne popularne zespoły absolutnie nietypowymi zagraniami. Później ten sam skład zawodników był znany jako Moscow Five, a następnie Gambit Gaming. Cała rosyjska ekipa była znana z innowacyjnych wyborów i zagrań, jednak król nowości wśród nich to właśnie \"Diamondprox\". Można śmiało powiedzieć, że zrewolucjonizował grę w jungli wielokrotnie podczas istnienia sceny esportowej. Brakiem obaw przed porażką i ośmieszeniem otworzył drzwi dla wielu nowych postaci na tej pozycji, zainicjował między innymi wybór Karmy, Mundo i Nasusa. Oprócz zaskakującej selekcji bohaterów, zdumiewał również swoim stylem gry – na przykład sztuką kontrowania przeciwników w ich własnej jungli. Jednak wielbiciele i społeczeństwo najlepiej znają Danila z niezwykłych zagrań Lee Sinem i Evelynn.</p>\n<p>\n\"Diamondprox\" od wczesnego drugiego sezonu uczestniczył w życiu esportowym League of Legends. Można by długo wymieniać turnieje, które wygrał i te, w których znalazł się na podium, lecz najważniejszymi dokonaniami były jego występy na Mistrzostwach Świata i turniejach IEM. W wydarzeniu o najwyższej randze na scenie League of Legends wziął udział dwukrotnie – w drugim i trzecim sezonie. Za pierwszym razem zespół Moscow Five było jednym z faworytów – uległ w półfinale w walce z Taipei Assasins. Miarę tego osiągnięcia, można mierzyć w powszechnej opinii po tej imprezie, że z zachodnich drużyn tylko ta rosyjska może się mierzyć z Azjatami. Na Mistrzostwach Świata 2013 poszło jej gorzej, ponieważ Danil wraz z kolegami dotarli tylko to ćwierćfinałów. Co i tak było niesamowitym osiągnięciem jak na europejską ekipę. Zdecydowanie lepszy owoc zebrali na wydarzeniach IEM - \"Diamondprox\" dwukrotnie był półfinalistą i raz zwycięzcą podczas Mistrzostw Świata IEM. Ponadto czterokrotnie wygrali etapy kwalifikacyjne, podczas których dominowali tak doświadczonych przeciwników jak: Team SoloMid, Fnatic i Counter Logic Gaming. Przed wiosennym sezonem EU LCS 2016 pożegnał się z pozostałościami po legendarnej rosyjskiej drużynie i w poszukiwaniu swojego miejsca dołączył do Unicorns of Love.\nDanil to jeden z bardzo małego grona graczy, które znalazło swoją drugą połówkę i się ożeniło. Podobnie jak jego kolega z drużyny, „Alex Ich”, trafił na swoją sympatię, kiedy profesjonalnie grał w League of Legends. \"Diamondprox\" spotkał „Rogue” w solo que po przeciwnej stronie barykady i w tym starciu Darina została upokorzona przez jego grę Skarnerem. W związku z czym padło parę ostrych słów między nimi. Dlatego „Rogue” zauważyła, że w kolejnej grze jej rywalem znowu jest Danil. Tym razem pogratulował swojej konkurentce dobrej gry, a po meczu zaczęli ze sobą rozmawiać. Od słów do czynów, wkrótce potem zaczęli się ze sobą spotykać – jak widać miłość potrafi znaleźć ujście w najbardziej nieoczekiwanych momentach i miejscach. \n</p>","es_ES":"<p>La eterna leyenda rusa toma un nuevo rumbo. Por primera vez en su carrera profesional desde Octubre de 2011, Danil ‘Diamondprox’ Reshetnikov opta por cambiar de aires. El jugador proveniente de World of Warcraft que enamoró a todo el mundo en Team Empire, Moscow Five y Gambit Gaming decide por primera vez dejar la infraestructura que tantos éxitos le ha otorgado en el pasado para intentar solucionar un final de carrera con un declive pasivo.</p>\n\n<p>Diamondprox empezó en 2011 a jugar para Team Empire gracias a la invitación de su amigo y apoyo del equipo Edward ‘Gosu Pepper’ Abgaryan. Tan sólo dos meses durarían ambos bajo el nombre de Team Empire, puesto que en Diciembre de ese mismo año la plantilla sería fichada por Moscow Five y un mes más tarde ya estarían dando la sorpresa en la IEM Season VI – Global Challenge Kiev que ganarían ante los grandes equipos de Europa y Norteamérica. Con campeones como Shyvana y Lee Sin el joven ruso sacaba a la palestra un estilo agresivo de invasión hacia la jungla enemiga que chocó mucho a los jungla de apoyo de aquella época. Grandes jugadores de la historia de League of Legends han elogiado al jungla por su innovación y agresividad.</p>\n\n<p>En Marzo de 2012, Diamondprox volvería a la senda de la innovación adaptada a su estilo de juego en la IEM Season VI – World Championship disputada en Hannover. La aparición estelar de Nocturne con presencia global en el mapa permitió sorprender a sus rivales. Aunque la mayor alegría llegaría a los amantes de Udyr a causa de la aparición en el último partido de la final ante Dignitas como respuesta a la propia Shyvana que él mismo había popularizado.</p>\n\n<p>En ese mismo año llegaron los mejores momentos de Diamond como en la Dreamhack Summer 2012 o las finales regionales de la segunda temporada en Colonia. Aquel Moscow Five que estuvo a punto de llegar a la final del Campeonato Mundial 2012 en el que sólo perdió ante el vencedor Taipei Assasins. Este momento supuso la cúspide en la carrera del jugador que a partir de entonces no ha conseguido éxitos del mismo calibre. Todavía se recuerda esa arrasadora primera partida que disputó con Xin Zhao.</p>\n\n<p>Después del último gran torneo jugado como Moscow Five en la IPL5 debido al arresto del CEO del equipo, Diamondprox sólo consiguió mantener su estatus debido a grandes actuaciones las Intel Extreme Masters como la victoria en 2013 en Katowice ante Azubu Frost. El formato de liga regular de la League Championship Series no favoreció al jugador debido al distanciamiento de la organización de la sede en Colonia con problemas de visado, y poco a poco su nivel fue bajando hasta la actualidad. En el año 2013 fue votado para representar a Europa en el All Stars y en el Campeonato Mundial de 2013 se clasificaría para cuartos de final.</p>\n\n<p>Tanto 2014 como 2015 fueron años aciagos para el jungla. El primer año todavía mantuvo su caché a pesar de los malos resultados del equipo con buenas actuaciones mediante el uso de junglas agresivos, pero ya no volverían a clasificarse a un Campeonato Mundial y en los últimos tiempos el jugador sólo conserva detalles de calidad.</p>\n\n<p>En Unicorns of Love podría renacer. Su carácter innovador encaja perfectamente con el equipo, y supone un reto motivacional nuevo para el ruso. A pesar de ser introvertido, su privilegiada mente podría otorgar una mejora en la toma de decisiones, faceta de la que siempre ha carecido el equipo.</p>","de_DE":"<p>Wenn man eSports-Fans nach dem einen Jungler fragt, wird sicherlich aus vieler Munde der Name „Diamond“ ertönen. Nicht viele Europäer haben sich einen solchen, vor allem auch international anerkannten Ruf erspielen können. Er ist anpassungsfähig, erfahren, Shotcaller und einer der größten Innovatoren seiner Position. Während er mit Lee Sin noch einen recht vertrauten Pick schon sehr früh an den Tag gebracht hat, wurde es schnell außergewöhnlicher. So hat er vor allem in der dritten Saison viele Trends im Jungle geschaffen. Evelynn, Nasus und nicht zu vergessen seine Karma waren noch nicht einmal alle Champions, die er allein in dieser Zeit erfolgreich in die Kluft brachte. </p>\n<h2><p>Der große Aufstieg</p></h2>\n<p>Bekannt wurde Danil \"Diamondprox\" Reshetnikov, nachdem sein damaliger Kader von Team Empire Ende 2011 von Moscow Five aufgekauft wurde. Während die Russen anfangs noch nicht sonderlich bekannt waren, änderte sich dies schon zwei Monate später schlagartig. Bei der IEM Season VI in Kiew setzte sich das Team gegen eine Armee von großen Namen durch, unter ihnen auch Zweitplatzierter der vorigen Weltmeisterschaft against All authority und TSM, den schon damaligen Favoriten der Amerikaner. Mit nur einem verlorenen Spiel während des gesamten Turniers war sehr schnell klar, dass es diese Spieler drauf haben. </p>\n<p>Die gesamte zweite Saison sollte sich ein Trend fortsetzen, der aus einem emporkommenden Team mit guten Spielern schon fast so etwas wie Legenden machte. Zusammen mit seinem Teamkollegen Alexey \"Alex Ich\" Ichetovkin hat er die gegnerischen Lanes in ein regelrechtes Chaos versetzt, um sichere Siege einzuholen. Das hat M5 nicht nur weitere Turniersiege eingebracht, sondern letztendlich zu einem Top 4 Erfolg auf der zweiten Weltmeisterschaft geführt. </p>\n<h2><p>Sein Weg mit Gambit</p></h2>\n<p>Nachdem der CEO von Moscow Five Anfang 2013 verhaftet wurde, stand das erfolgreiche Team zum Verkauf bereit. Der glückliche Käufer: Gambit Gaming. Unter neuem Namen ging es gleich da weiter, wo man zuvor aufhörte: Wer sich an die IEM Season VII in Katowice erinnert, hat sicherlich noch Gambits dortige Erfolgsgeschichte vor Augen. Nach einem knappen Sprung aus der Gruppenphase gelang es dem Team nicht nur eins, sondern gleich zwei Aufeinandertreffen gegen die damals stärksten koreanischen Teams ohne Niederlage zu gewinnen. Spätestens ab diesem Zeitpunkt wurde Diamondprox auch von vielen Koreanern als einer der besten Jungler anerkannt. Er wurde Vorbild für viele später auch erfolgreiche professionelle Jungler. </p>\n<p>Die LCS veränderte dann so einiges, während die Konkurrenz anfangs noch vergleichsweise schwach war, wurde diese über die Jahre immer stärker. Das einst so undenkbar trennbare Team verlor nach und nach seine Spieler, bis zum Schluss nur noch Diamondprox und Edward „Edward“ Abgaryan übrig blieben. Das Ende vom ursprünglichen Gambit war gekommen. </p>\n<p> „Es waren vier teuflische Jahre, Jungs“, Worte, die sich Diamond am Anfang seiner Karriere in League of Legends wohl kaum zu träumen gewagt hätte. Und doch – nach vier Jahren Achterbahnfahrt der Gefühle, kann er stolz von seinen Jahren mit den vier russischen Kumpanen reden. Ein Kapitel seines Lebens, das mit dem Austritt aus Gambit Gaming nun geschlossen wurde. </p>\n<h2><p>Das diamantene Einhorn</p></h2>\n<p>Wenn sich ein Kapitel schließt, öffnet sich ein anderes. Das richtige Team ist jedenfalls gefunden. Die Unicorns Of Love sind dafür bekannt, ungewöhnliche Champions auszupacken, da passt der neue Jungler perfekt hinein, um die Gegner noch weiter in die Irre zu führen. Er selbst erhofft sich nicht nur als Person, sondern sich auch als Anführer weiter zu verbessern, wie er in einem Interview bekannt gab. In jedem Fall wird er sein Bestes geben, um nicht nur sein Team, sondern auch den vielen treuen Fans zu zeigen, was ein Diamondprox alles so drauf hat. </p>\n"},"foreignIds":{"drupalId":"88","TRLH3":"1001220067","TRLH4":"1001190117","TRLH1":"1001300002","FRA1TMNT1":"445028"},"socialNetworks":{"twitch":"http://www.twitch.tv/tehdiamondz","facebook":"www.facebook.com/GambitDiamondprox","twitter":"http://twitter.com/tehDiamondz"},"champions":[],"liveGameTeam":187},{"id":148,"slug":"shiphtur","name":"Shiphtur","firstName":"Danny","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/shiphtur-3a942emw.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-06-22T22:23:47.000Z","bios":{"en_US":"<p>\nDanny “Shiphtur” Le has been competing professionally since 2012. Known for a deep champion pool, Shiphtur is most effective on mid lane assassins like Ahri and Kassadin, but he can also hold his own with control mages, as evidenced by his fantastic 10.75 KDA on Ziggs in the 2014 NA LCS Summer Split. \n</p>\n<p>\nShiphtur got his first taste of the NA LCS while playing for Team Coast, then wreaked havoc from the mid lane with Team Dignitas. As one of the more experienced players in the LCS, Shiphtur has seen the focus of professional play transition from individual mechanics to coordinated team play. \"It's all about getting down the macro,\" Shiphtur says. \"Honestly in League of Legends right now, you can win a game purely on macro, rotations and such. Individual play really doesn't mean anything right now.\" Now, Shiphtur takes up his place on Delta Fox's new lineup.\n</p>","fr_FR":"<p>Cette saison encore, Danny « Shiphtur » Le tiendra la voie du milieu pour Dignitas. À 22 ans, le Canadien est déjà un vétéran de League of Legends.</p>\n\n<p>Il a débuté sa carrière peu avant la saison 3 et le lancement des LCS. Des LCS qu'il a immédiatement rejoints au sein de Good Game University, aux côtés notamment de Darshan « ZionSpartan » Upadhyaya (aujourd'hui connu sous le pseudonyme de Darshan). Malheureusement pour lui, des problèmes de visa l'ont empêché de jouer avant le début du segment d'été. Ses malheurs ont continué tout au long de la saison puisque l'équipe, rebaptisée Team Coast, a enchaîné les défaites pour finir à la 7e place du classement, synonyme de passage en tournoi de relégation. Une victoire 3 à 2 contre The Walking Zed leur a permis de se maintenir au plus haut niveau pour la saison 4, mais le répit ne fut que de courte durée. Lors du segment de printemps des LCS de la saison 4, Shiphtur et ses comparses n'ont su faire mieux qu'une 6e place puis un retour en tournoi de relégation après deux défaites en play-offs contre Counter Logic Gaming puis Dignitas. Cette fois le couperet est tombé sous la forme d'une défaite face à compLexity.Black, 3 victoires à 1, et le mid laner s'est retrouvé bouté hors des LCS.</p>\n\n<p>C'est le moment qu'a choisi Dignitas pour le recruter, toujours aux côtés de ZionSpartan. Avec sa nouvelle équipe, le joueur canadien s'est retrouvé une fois de plus très proche des relégations, évitées de justesse en fin de saison. L’histoire se répète lors du segment de printemps de la saison 5 des LCS, où l’équipe termine à la 9ème place et doit de nouveau passer par le tournoi de relégation. Malgré une légère amélioration lors du segment d'été, Shiphtur aborde la saison 6 sans aucune certitude. À lui de prouver enfin qu'il mérite véritablement sa place sur le terrain des LCS, face à une compétition chaque année plus relevée.</p>","pl_PL":"<p>Z pochodzenia Kanadyjczyk, z krwi Wietnamczyk, z urodzenia mid-laner. Danny Le sam wybrał tą linię, gdyż uważał, że jest najbliżej centrum wydarzeń i ma największy potencjał. Podczas swojej przygody z League of Legends wielokrotnie udowadniał, że zasługuje na tą pozycję. Pojawił się na scenie esportowej pod koniec drugiego sezonu i do stycznia 2013 roku grał na różnych pozycjach w paru pomniejszych drużynach. Wtedy nastąpił przełom w jego życiu, ponieważ trafił do Good Game University, później znanego jako Team Coast. Aż do kwietnia 2014 roku zespół walczył o przetrwanie w NA LCS, ponieważ wśród innych bardziej doświadczonych drużyn był przysłowiowym chłopcem do bicia. Nie przeszkodziło to Danniemu w pokazaniu się z najlepszej strony na scenie esportowej. Zrobił pentakilla Anivią na wiosennych rozgrywkach kwalifikacyjnych w Challenger Series w styczniu 2013 roku. Niestety w kwietniu 2014 roku porażka z compLexity.Black przesądziła o relegacji Team Coast z powrotem do Challenger Series. Miesiąc później \"Shiphtur\" opuścił tą drużynę, gdyż od razu dostał propozycje od swoich niedawnych konkurentów z NA LCS. W maju 2014 roku dołączył do Team Dignitas, gdzie w swojej pierwszej grze wiosennego sezonu 2014 zrobił kolejnego pentakilla, tym razem LeBlanc. </p>\n<p>\nDanny przysłużył się wszystkim innym graczom, przecierając drogę w oddziałach imigracyjnych Stanów Zjednoczonych. Jako pierwszy zawodnik esportowy otrzymał wizę P-1A, która przysługuje tylko profesjonalnym atletom. Kolejną jego zasługą dla społeczeństwa League of Legends było wprowadzenie Ziggsa do profesjonalnej gry. Wyborem Hextechowego Sapera sprowokował wiele banów w turniejach, lecz mimo tego jest jeszcze parę innych bohaterów, które \"Shiphtur\" uwielbia. Doskonale gra Anivią, co wielokrotnie udowadniał na różnej maści meczach, podobnie traktuje Ahri i Dianę. Szczytem jego możliwości jest Krąg Pretendenta z ponad tysiącem punktów LP. W wywiadzie po Mistrzostwach Świata 2015 Danny oświadczył, że według niego najmocniejszy zespół w NA LCS 2016 będzie miał Team SoloMid. Dodał też, że nie bez powodu pojechał na długi trening do Korei i że ma zamiar godnie stawić im czoła. Całość podsumował, że kocha League of Legends i jest bardzo wdzięczny fanom, którzy przy nim wytrwali. </p>\n"},"foreignIds":{"drupalId":"38","TRLH1":"1001220076","TRLH2":"1001160126","FRA1TMNT1":"375096","ESPORTSTMNT02":"200002373"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":149,"slug":"nien8","name":"Nientonsoh","firstName":"Zach","lastName":"Malhas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nien8-cf8vutwb.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-19T22:31:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"176","TRLH1":"200000231","TRLH2":"200000135"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":187},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":545,"slug":"lira","name":"LirA","firstName":"Taeyou","lastName":"Nam","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lira-8wdoxm79.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-25T23:33:32.000Z","bios":{"en_US":"<p>Tae-yoo \"LirA\" Nam has been on his jungle game ever since 2013. A veteran of Korea’s LCK, he’s played for teams like CJ Entus, KT Rolster, and the Afreeca Freecs. LirA has impressed while on the Rift, and he’s only gotten better with age. Even though his play improved over time, he began sharing his role with SeongHwan while on the Afreeca Freecs.</p>\n\n<p>The uncertainty with his role going forward lead LirA to look for opportunities elsewhere and soon enough he was on a flight headed to Los Angeles. He joined up with Team Envy as their new starting jungler and looks like a star. Despite a disappointing record, Lira's play in the jungle earned his team leads early in many games. If he can help convert just some of those early leads to late-game ones, LirA and Team Envy can run with the best of them.</p>","de_DE":"Tae-yoo „Lira“ Nam dominiert schon seit 2013 im Dschungel. Als Veteran der koreanischen LCK hat er schon bei CJ Entus, KT Rolster und Afreeca Freecs gespielt. Lira hat in der Kluft beeindruckende Leistungen abgeliefert und er wurde mit dem Alter nur besser. Obwohl er mit der Zeit immer besser wurde, teilte er sich seinen Platz bei den Afreeca Freecs mit SeongHwan.\n</p>\nDa er sich seines Arbeitsplatzes nicht mehr sicher sein konnte, schaute er sich nach anderen Möglichkeiten um, und nur kurze Zeit später saß er in einem Flugzeug Richtung Los Angeles. Er hat sich Team Envy angeschlossen und wie es scheint, ist er eine unmittelbare Verbesserung im Dschungel. Er beherrscht jeden Champion von Lee Sin bis Kindred, es geht nur darum, was sein Team gerade braucht. Liras Reichtum an Wissen und Erfahrung wird es dem neuen Team Envy ermöglichen, im Frühjahrs-Split 2017 wieder um den Einzug in die Entscheidungsspiele zu kämpfen.\n"},"foreignIds":{"drupalId":"4332","TRLH1":"200000225","TRLH2":"200000129"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":746,"slug":"roar","name":"Roar","firstName":"Jang-won","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/roar-3sgsb7kb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-06-15T22:40:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"874","TRLH1":"1001300003","FRA1TMNT1":"445029"},"socialNetworks":{},"champions":[],"liveGameTeam":187},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":215}],"scheduleItems":[{"id":"AVTfrURioUG4HPFjOJ_y","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:8506e37f-fb97-4157-8b40-e5255bee27da","scheduledTime":"2016-06-11T03:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"2","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"8506e37f-fb97-4157-8b40-e5255bee27da","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"cee115b5-87d2-4b4c-a33b-e3dcc75a8b95","gameHash":"53918301f0b91c8f"},{"id":"6d4f9160-5d06-4ce2-a6dd-0085d51dfe69","gameHash":"996e843d01cae5e6"},{"id":"3362774d-cbf0-441d-b0ff-16a79be34636","gameHash":"101816173ebc860f"}],"videos":[{"id":3071,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:3362774d-cbf0-441d-b0ff-16a79be34636","source":"https://www.youtube.com/embed/R4eNrr8CmbA?wmode=transparent","createdAt":"2016-06-11T06:06:27.000Z","updatedAt":"2016-06-11T06:06:27.000Z","game":"3362774d-cbf0-441d-b0ff-16a79be34636"},{"id":3072,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:6d4f9160-5d06-4ce2-a6dd-0085d51dfe69","source":"https://www.youtube.com/embed/vdxekbG1ZSw?wmode=transparent","createdAt":"2016-06-11T06:30:33.000Z","updatedAt":"2016-06-11T06:30:33.000Z","game":"6d4f9160-5d06-4ce2-a6dd-0085d51dfe69"},{"id":3073,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:cee115b5-87d2-4b4c-a33b-e3dcc75a8b95","source":"https://www.youtube.com/embed/ofWPOUtyBCU?wmode=transparent","createdAt":"2016-06-11T07:30:09.000Z","updatedAt":"2016-06-11T07:30:09.000Z","game":"cee115b5-87d2-4b4c-a33b-e3dcc75a8b95"}],"htmlBlocks":[],"match":{"id":"8506e37f-fb97-4157-8b40-e5255bee27da","name":"APX-vs-NV","position":34,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"},{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],"games":{"6d4f9160-5d06-4ce2-a6dd-0085d51dfe69":{"id":"6d4f9160-5d06-4ce2-a6dd-0085d51dfe69","name":"G2","generatedName":"APX|NV|G2|8506e37ffb9741578b40","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"},{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],"standings":{"result":[[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}]],"timestamp":1465626459746,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}],[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}]],"timestamp":1465621825549,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740024","gameRealm":"TRLH1","platformId":"TRLH1:1001740024","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"cee115b5-87d2-4b4c-a33b-e3dcc75a8b95":{"id":"cee115b5-87d2-4b4c-a33b-e3dcc75a8b95","name":"G3","generatedName":"APX|NV|G3|8506e37ffb9741578b40","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"},{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],"standings":{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465629778429,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465624829578,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740025","gameRealm":"TRLH1","platformId":"TRLH1:1001740025","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"3362774d-cbf0-441d-b0ff-16a79be34636":{"id":"3362774d-cbf0-441d-b0ff-16a79be34636","name":"G1","generatedName":"APX|NV|G1|8506e37ffb9741578b40","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"},{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],"standings":{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465624851367,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465618268530,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740014","gameRealm":"TRLH1","platformId":"TRLH1:1001740014","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465629778430,"source":"bestOf","history":[{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465626459746,"source":"bestOf","closed":true},{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465624851367,"source":"bestOf","closed":true},{"result":[[{"roster":"510a4d44-1829-4479-8f77-0cad87944b07"}],[{"roster":"6f394509-2d2b-48d4-a987-3d849b01b644"}]],"timestamp":1465624829579,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"510a4d44-1829-4479-8f77-0cad87944b07":1,"6f394509-2d2b-48d4-a987-3d849b01b644":0}}}