{"teams":[{"id":191,"slug":"lyon-gaming","name":"Lyon Gaming","guid":"be711156-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lyon-gaming-f9fug4e2.png","acronym":"LYN","homeLeague":"urn:rg:lolesports:global:league:league:30","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lyon-gaming-b7fyn18y.png","createdAt":"2016-01-25T20:39:55.000Z","updatedAt":"2017-05-29T20:53:59.000Z","bios":{"en_US":"<p>Lyon Gaming is one of Latin America’s premier League of Legends organizations. Since their inception in 2013, they have become one of the region’s most respected teams because of their consistent success. In 2016 they came within a game of heading to the World Championship but were ousted by the eventual tournament darlings, Albus NoX Luna. Regardless, 2016 was the most successful year in the organization’s history and 2017 is shaping up to be another record breaker. With their tickets to the 2017 Mid-Season Invitational punched, they’re looking to prove that their loss to Albus NoX was an aberration and that they have what it takes to trade punches with the best teams in the world.</p>\n\n<p>Coach: Rodrigo “Yeti” Del Castillo Diaz</p>","pt_BR":"<p>Lyon Gaming é uma das principais organizações de League of Legends da América Latina. Desde sua fundação, em 2013, eles se tornaram uma das equipes mais respeitadas devido ao seu sucesso consistente. Em 2016 eles ficaram a uma partida de entrar para o Campeonato Mundial, mas foram desclassificados por aqueles que se tornaram os queridinhos do torneio, Albus NoX Luna. Ainda assim, 2016 foi o ano de maior sucesso na história da organização, e 2017 parece destinado a mais recordes. Com passaportes carimbados para o Mid-Season Invitational 2017, eles querem provar que a derrota para Albus NoX foi um ponto fora da curva e que são mais do que capazes de competir entre as melhores equipes do mundo.</p>","es_MX":"","es_AR":"Lyon Gaming es el mejor equipo a nivel competitivo de toda latinoamérica. En 2016 se quedaron a una partida de clasificar para el Mundial, pero la escuadra terminó cayendo ante Albus NoX Luna. Aun así, 2016 fue el año más exitoso en la historia de la organización y en 2017 los leones estarán buscando representar a LAN por primera vez en el Mundial de China. Para ello, tendrán que conseguir su novena copa en nuestra región. ","es_ES":"Lyon Gaming es una de las principales organizaciones de League of Legends de Latinoamérica. Desde su fundación en 2013, se ha convertido en uno de los equipos más respetados de la región gracias a su regularidad. En 2016 se quedó a una sola partida de participar en el Campeonato Mundial, pero Albus NoX Luna, el que acabaría siendo la revelación del torneo, consiguió vencerle. Aun así, 2016 fue el año de mayor éxito de la historia de la organización, y 2017 parece que también será un año en el que batirán más de un récord. Con su puesto en el Mid-Season Invitational 2017 garantizado, están dispuestos a demostrar que su derrota contra Albus NoX fue una excepción y que tienen lo que hace falta para enfrentarse a los mejores equipos del mundo.","pl_PL":"Lyon Gaming to jedna z głównych organizacji League of Legends w Ameryce Łacińskiej. Powstali w 2013 roku i dołączyli do najbardziej cenionych w regionie drużyn. Zapewniły im to stale odnoszone sukcesy. W 2016 roku zabrakło im jednej wygranej gry, by dostać się na Mistrzostwa Świata, ale zostali pokonani przez późniejszych beniaminków turnieju, Albus NoX Luna. Tak czy inaczej, 2016 był najbardziej udanym rokiem w historii organizacji, a 2017 ma szansę stać się kolejnym przełomem. Mając bilet na Mid-Season Invitational 2017, zamierzają pokazać, że przegrana z Albus NoX była wypadkiem przy pracy i wystarczy im ikry, by pójść na wymianę ciosów z najlepszymi drużynami świata.","fr_FR":"Lyon Gaming représente l'une des organisations de League of Legends les plus importantes d'Amérique latine. Depuis ses débuts en 2013, elle est devenue l'équipe la plus respectée de la région en raison de son succès constant. En 2016, elle n'était qu'à une partie de participer au Championnat du monde, mais elle a été éliminée par les futures coqueluches du tournoi, Albus NoX Luna. Quoi qu'il en soit, 2016 a été l'année la plus fructueuse dans l'histoire de cette équipe et 2017 s'annonce également riche en succès. Après avoir obtenu sa qualification pour le Mid-Season Invitational 2017, Lyon Gaming espère prouver que sa défaite face à Albus NoX n'était qu'un coup de malchance et que l'équipe sera à la hauteur face aux meilleures formations internationales.","de_DE":"Lyon Gaming ist eine der besten „League of Legends“-Organisationen Lateinamerikas. Seit ihrer Gründung im Jahr 2013 entwickelte sich Lyon Gaming aufgrund ihres anhaltenden Erfolgs zu einer der angesehensten Mannschaften der Region. 2016 waren sie nur ein Spiel davon entfernt, zur Weltmeisterschaft zu fahren, mussten sich schließlich aber den späteren Publikumslieblingen, Albus NoX Luna, geschlagen geben. Trotzdem war 2016 das erfolgreichste Jahr in der Geschichte der Organisation und 2017 scheint ein weiteres Rekordjahr zu werden. Sie konnten ihr Ticket für das Mid-Season Invitational 2017 bereits lösen, wo sie versuchen werden, allen zu beweisen, dass ihre Niederlage gegen Albus NoX nur ein Ausreißer war und sie es sehr wohl mit den besten Mannschaften der Welt aufnehmen können."},"foreignIds":{},"players":[836,909,1125,1131,1182,1932],"starters":[836,909,1125,1131,1182],"subs":[1932]},{"id":311,"slug":"virtuspro","name":"Virtus.pro","guid":"58c1c46d-495a-4179-b07d-087a053c972f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/virtuspro-9gi348fo.png","acronym":"VP","homeLeague":"urn:rg:lolesports:global:league:league:45","altLogoUrl":null,"createdAt":"2017-04-14T01:11:16.000Z","updatedAt":"2017-07-04T10:27:25.000Z","bios":{"en_US":"<p>Virtus.pro has been competing in the CIS region since 2014. Their growth culminated in a 1st place finish in the 2017 LCL Spring split, where they defeated Vaevictis eSports in a close 3-2 match. The 2017 Mid-Season Invitational will be the first international event for every player on the team. At the least, their trip to Brazil will be a learning experience. At most, they could be the next in a line of CIS teams to surprise the world.</p>\n\n<p>Coach: Dmitry “Moo” Sukhanov</p>","es_AR":"<p>Virtus.pro ha competido en la región CIS desde el 2014. Al pasar los años, han visto mejoras graduales en las posiciones. Ese crecimiento culminó en el 1&deg; lugar del torneo de la LCL Spring de 2017, donde derrotaron a Vaevictis eSports en una cerrada serie 3 a 2. El Mid-Season Invitational 2017 será el primer evento internacional para cada jugador en el equipo. Como mínimo, el viaje a Brasil será una experiencia educativa. Y claro, podrían ser los próximos en una línea de equipos de CIS en sorprender al mundo.</p>","de_DE":"Virtus.pro tritt schon seit 2014 in der CIS-Region an. Im Laufe der Jahre konnte sich die Mannschaft immer weiter verbessern. Diese Entwicklung gipfelte im ersten Platz des Frühjahrs-Split der LCL 2017, wo Virtus.pro Vaevictis eSports in einer engen Begegnung mit 3–2 besiegen konnte. Das Mid-Season Invitational 2017 ist für alle Spieler der Mannschaft das erste internationale Event. Im schlechtesten Fall wird ihre Reise nach Brasilien eine gute Lernerfahrung. Im besten Fall könnte Virtus.pro die nächste Mannschaft aus der CIS sein, die die Welt überrascht.","fr_FR":"Virtus.pro est présent en compétition dans la région CEI depuis 2014. Au fil des années, l'équipe a constamment progressé dans les classements. Cette ascension a atteint son point culminant lors du segment de printemps de la LCL 2017 avec une première place, arrachée face à Vaevictis eSports sur un score de 3-2. Le Mid-Season Invitational 2017 sera le premier événement international pour tous les joueurs de l'équipe. Quoi qu'il arrive, leur voyage au Brésil promet d'être une expérience enrichissante. Mais avec un peu de chance, ils pourraient être la prochaine équipe de la CEI à créer une surprise mondiale.","es_ES":"Virtus.pro lleva compitiendo en la región de CIS desde 2014. Con el paso de los años, ha ido mejorando en la clasificación. Su crecimiento ha culminado con un primer puesto en el split de primavera de la LCL 2017, que consiguieron venciendo 3 a 2 a Vaevictis eSports en un disputado enfrentamiento. El Mid-Season Invitational 2017 será el primer evento internacional para todos los jugadores del equipo. En el peor de los casos, su viaje a Brasil será, como mínimo, una experiencia enriquecedora. En el mejor de los casos, podría ser el próximo equipo de CIS en darle una sorpresa al mundo.","en_PL":"","pl_PL":"Virtus.pro grają w regionie CIS od 2014 roku. W ciągu kolejnych lat krok po kroku poprawiali swoje miejsce w rankingu. Ten wzrost osiągnął swój punkt kulminacyjny, gdy zespół zdobył 1 miejsce podczas wiosennego splitu LCL 2017, pokonując Vaevictis eSports w zaciętym meczu z wynikiem 3−2. Mid-Season Invitational 2017 będzie dla wszystkich członków drużyny pierwszym występem na scenie międzynarodowej. W najgorszym przypadku podróż do Brazylii będą mogli potraktować jako okazję do zdobycia nowych doświadczeń. W najlepszym mogą zostać kolejną drużyną CIS, która zadziwi świat.","pt_BR":"<p>A Virtus.pro compete na região CIS (Comunidade dos Estados Independentes) desde 2014. O progresso culminou em um 1º lugar na Etapa de Primavera do LCL 2017, quando derrotaram a Vaevictis eSports em uma partida acirrada que terminou em 3-2. O Mid-Season Invitational 2017 será o primeiro evento internacional de todos os jogadores da equipe. No pior dos casos, sua viagem ao Rio de Janeiro será uma experiência de aprendizado; no melhor, eles podem ser a próxima equipe da CIS a surpreender o mundo.</p>"},"foreignIds":{},"players":[339,1855,1857,1858,1859,2053,2054],"starters":[339,1855,1857,1858,1859],"subs":[2053,2054]}],"players":[{"id":339,"slug":"p1noy","name":"P1noy","firstName":"Kristoffer ","lastName":"Pedersen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/p1noy-2747h2i6.png","hometown":"Denmark","region":"Challenge France","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-05T18:14:06.000Z","bios":{"en_US":"","fr_FR":"P1noy est un Carry AD présent sur la scène compétitive européenne depuis plusieurs années. Commençant sa carrière en saison 3, il a joué dans de nombreuses team en Challenger Series, comme Reason Gaming (2014), Copenhagen Wolves (2016) ou Huma (2016). \n<br />\nRepéré par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires. \n"},"foreignIds":{"drupalId":"3660","TRLH3":"1001000088","TRLH4":"1001240005","FRA1TMNT1":"375181","esportstmnt05":"200000938","ESPORTSTMNT02":"200001015","ESPORTSTMNT04":"200001605"},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":836,"slug":"whitelotus","name":"Whitelotus","firstName":"Matías","lastName":"Musso","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whitelotus-h5g2aeh1.png","hometown":"Marcos Juárez, Argentina","region":"LAN","birthdate":"1996-08-27","createdAt":"2015-08-25T15:49:03.000Z","updatedAt":"2017-04-27T22:52:32.000Z","bios":{"pt_BR":"<p>Matías \"WhiteLotus\" Musso começou a jogar League of Legends lá na 2a Temporada, antes de começar sua carreira profissional com a RtN Gaming. Ele chegou à Lyon Gaming em maio de 2016, e a equipe tem sido absolutamente dominante desde então. Com a ajuda de WhiteLotus, a Lyon mandou ver na Temporada de Abertura e nas Eliminatórias do LLN 2017, recebendo um convite para o Mid-Season Invitational 2017 no processo. Amplamente considerado o principal atirador na região LAN, ele é conhecido por ser extremamente agressivo, o que tende a ser uma ótima atitude para seus Campeões preferidos: Kalista, Lucian e Vayne. Ele vai partir para cima das barras de vida dos oponentes quando estrear no estágio internacional contra alguns dos melhores jogadores do mundo no MSI.</p>","en_US":"<p>Matías \"Whitelotus\" Musso started playing League of Legends way back in Season 2 before getting his professional start with RtN Gaming. He made his way to Lyon gaming in May of 2016 and the team has been absolutely dominant since. With the help of WhiteLotus, Lyon tore their way through the 2017 LLN Opening Season and Playoffs netting themselves an invite to the 2017 Mid-Season Invitational in the process. Widely considered to be the top AD Carry in the LAN region, he’s known for being extremely aggressive, which tends to pair exceedingly well with his favorite champions Kalista, Lucian, and Vayne. He’ll be looking to tear through the opposition’s health bars when he hits the international stage against some of the best players in the world at MSI.</p>","es_AR":"<p><strong>Matías \"Whitelotus\" Musso</strong> comenzó a jugar LoL hace un tiempo, en la temporada 2, antes de iniciar su carrera como jugador profesional con RtN Gaming. Llegó a Lyon Gaming en mayo de 2016 y, desde entonces, el equipo ha sido completamente invencible. Con la ayuda de <strong>Whitelotus</strong>, Lyon dominó la temporada de apertura y las eliminatorias del LLN 2017, ganándose así un lugar en el Mid-Season Invitational 2017 en el proceso. <strong>Whitelotus</strong>, generalmente considerado como el mejor tirador de la región LAN, es conocido por ser extremadamente agresivo, cualidad que queda excepcionalmente bien con sus campeones favoritos: Kalista, Lucian y Vayne. Espera con muchas ansias drenar las barras de vida de sus oponentes cuando llegue al escenario internacional y se enfrente a algunos de los mejores jugadores del mundo en el MSI.</p>","pl_PL":"Matías „WhiteLotus” Musso zaczął grać w League of Legends już w drugim sezonie, zanim jeszcze wystartował z profesjonalną karierą w RtN Gaming. W maju 2016 roku przeszedł do Lyon Gaming i od tamtego czasu drużyna absolutnie dominowała. Z pomocą WhiteLotusa Lyon przebili się przez sezon otwierający LLN 2017 i play-offy, zdobywając w efekcie zaproszenie na Mid-Season Invitational 2017. Powszechnie jest uważany za najlepszego prowadzącego w regionie LAN i znany z ekstremalnej agresji, świetnie pasującej do jego ulubionych bohaterów: Kalisty, Luciana i Vayne. Spróbuje zdemolować paski zdrowia przeciwników, gdy wkroczy na międzynarodową arenę MSI, by zagrać przeciwko najlepszym zawodnikom na świecie.v","fr_FR":"Matías « WhiteLotus » Musso a commencé à jouer à League of Legends pendant la saison 2 avant de faire ses débuts sur la scène professionnelle avec RtN Gaming. Il est arrivé chez Lyon en mai 2016 et, depuis, l'équipe est en position dominante. Avec l'aide de WhiteLotus, Lyon s'est frayé un chemin à travers la saison d'ouverture de la LLN 2017 et les play-offs, décrochant au passage une place pour le Mid-Season Invitational 2017. Considéré comme le meilleur carry AD de la région LAN, il est connu pour être extrêmement agressif, ce qui correspond parfaitement à ses champions préférés, Kalista, Lucian et Vayne. Débarquant à présent sur la scène internationale à l'occasion du MSI, il tentera sûrement d'annihiler les jauges de PV de ses adversaires, qui ne seront autre que les meilleurs joueurs du monde."},"foreignIds":{"TRLT3":"200000036"},"socialNetworks":{"facebook":"https://www.fb.com/whitelotuslol","twitch":"http://www.twitch.tv/matimusso96"},"champions":[{"id":128,"playerId":836,"championId":429,"championKey":"Kalista","championName":"Kalista","createdAt":"2015-08-26T11:52:46.000Z","updatedAt":"2017-04-27T22:52:31.000Z"},{"id":317,"playerId":836,"championId":236,"championKey":"Lucian","championName":"Lucian","createdAt":"2016-03-21T19:22:44.000Z","updatedAt":"2017-04-27T22:52:31.000Z"},{"id":318,"playerId":836,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-03-21T19:22:44.000Z","updatedAt":"2017-04-27T22:52:31.000Z"}],"liveGameTeam":191},{"id":909,"slug":"seiya","name":"Seiya","firstName":"Ali","lastName":"Bracamontes","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seiya-8q0ls0yw.png","hometown":"Mexico","region":"LAN","birthdate":"1996-08-06","createdAt":"2015-11-26T17:28:18.000Z","updatedAt":"2017-05-29T20:44:03.000Z","bios":{"en_US":"<p>Ali \"Seiya\" Bracamontes is Lyon’s AD Carry turned mid lane star. Seiya is considered by many to be not only the most well-known player in the region, but the best player in the region hands down. If you need convincing, he ended the 2017 LLN Opening Season with an absolutely bonkers 11.2 KDA. During his time with Lyon Gaming he has won a plethora of championships on his way to becoming the region’s brightest star. Seiya and company punched their tickets to the 2017 Mid-Season Invitational with an emphatic 3-0 win over the Just Toys Havoks, and they’ll need to squeeze out every ounce of his talent as they face off against the best players the planet has to offer.</p>","es_AR":"<p><strong>Ali \"Seiya\" Bracamontes</strong> es la estrella del carril medio. Muchos consideran a <strong>Seiya</strong> no solo el jugador más conocido de la región, sino también el mejor jugador de esta. Si no nos crees, terminó la temporada de apertura del LLN 2017 con un insano 11.2 de KDA. Durante su tiempo con Lyon Gaming ha ganado una gran cantidad de campeonatos en su camino a convertirse en la estrella más brillante de la región. <strong>Seiya</strong> y compañía sellaron su pase al Mid-Season Invitational 2017 con una enfática victoria 3-0 sobre Just Toys Havoks y tendrán que utilizar hasta la última gota de su talento al enfrentarse a los mejores jugadores del planeta.</p>","de_DE":"Der ehemalige AD-Carry, Ali „Seiya“ Bracamontes, ist Lyons neuer Star auf der mittleren Lane. Seiya ist für viele nicht nur der bekannteste Spieler, sondern auch der mit Abstand beste Spieler der Region. Und falls du mir nicht glaubst: Am Ende des Frühjahrs-Splits der LLN 2017 hatte er eine unglaubliche TTU von 11,2. Während seiner Zeit bei Lyon Gaming hat er eine Vielzahl von Meisterschaften gewonnen und wurde zu einem der größten Stars der Region. Seiya und seine Kameraden lösten ihr Ticket für das Mid-Season Invitational 2017 mit einem eindrucksvollen 3–0 Sieg über Just Toys Havoks. Sie werden ihr Talent wieder unter Beweis stellen müssen, wenn sie es mit den besten Spielern des Planeten zu tun bekommen.","es_ES":"Ali ''Seiya'' Bracamontes es el ADC de Lyon convertido en estrella de la calle central. Muchos consideran a Seiya no solo uno de los jugadores más conocidos de la región, sino también el mejor. Por si teníais dudas al respecto, ha conseguido acabar la temporada inicial de la LLN 2017 con un aplastante A/M/A de 11,2 puntos. Durante su etapa con Lyon Gaming ha ganado múltiples campeonatos y se ha convertido en la mayor estrella de su región. Seiya y sus compañeros han logrado asegurarse un puesto en el Mid-Season Invitational 2017 con una asombrosa victoria 3 a 0 contra Just Toys Havoks. Ahora, tendrán que exprimir cada gota de su talento para enfrentarse a los mejores jugadores del planeta.v","fr_FR":"Ali « Seiya » Bracamontes, le carry AD de Lyon, est devenu une star de la voie du milieu. Seiya est considéré par beaucoup comme le joueur le plus célèbre, mais aussi comme le joueur le plus talentueux de la région. Si vous avez besoin d'être convaincu, sachez qu'il a terminé la saison d'ouverture de la LLN 2017 avec un KDA hallucinant de 11,2. Pendant sa carrière chez Lyon Gaming, il a remporté une tonne de championnats jusqu'à devenir la plus grande star de sa région. Seiya et sa formation ont décroché leur ticket pour le Mid-Season Invitational 2017 avec une victoire catégorique de 3-0 contre Just Toys Havoks. Lyon Gaming va devoir exploiter tout le talent de son prodige pour affronter les meilleurs joueurs du monde.","pl_PL":"Ali „Seiya” Bracamontes to prowadzący Lyon, który stał się gwiazdorem środkowej alei. Seiya przez wielu uważany jest nie tylko za jednego z najlepiej znanych zawodników w regionie, ale także wprost za najlepszego zawodnika regionu. Potwierdzeniem tej opinii jest absolutnie obłędny wynik 11,2 Z/Z/A, z którym zakończył sezon otwierający LLN 2017 z. Podczas czasu spędzonego z Lyon Gaming wygrał szereg mistrzostw, by po drodze stać się najjaśniejszą gwiazdą regionu. Seiya i koledzy zdobyli bilety na Mid-Season Invitational 2017 po zdecydowanym zwycięstwie 3−0 z Just Toys Havoks. Ale mierząc się z najlepszymi zawodnikami na świecie, będą musieli maksymalnie wykorzystać jego talent.","pt_BR":"<p>Ali \"Seiya” Bracamontes é o atirador da Lyon que se transformou em estrela do meio. Seiya é considerado por muitos não só o jogador mais conhecido, mas também o melhor jogador da região. Se quiser uma prova, ele acabou a Temporada de Abertura da LLN 2017 com incríveis 11,2 de AMA. No seu período com a Lyon Gaming, ele venceu muitos campeonatos até se tornar a maior estrela da região. Seiya e companhia carimbaram os passaportes para ao Mid-Season Invitational de 2017 com uma vitória devastadora por 3-0 sobre a Just Toys Havoks e terão de usar todo o seu talento quando enfrentarem os melhores jogadores que este planeta tem a oferecer.</p>"},"foreignIds":{"TRLT3":"200000035"},"socialNetworks":{"twitter":"https://twitter.com/SeiyaLoL","twitch":"http://www.twitch.tv/Seeiya","facebook":"https://www.facebook.com/seiyalol/"},"champions":[],"liveGameTeam":191},{"id":1125,"slug":"jirall","name":"Jirall","firstName":"Daniel ","lastName":"del Castillo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jirall-1a2hk96a.png","hometown":null,"region":"LAN","birthdate":null,"createdAt":"2016-01-25T21:10:49.000Z","updatedAt":"2017-05-29T20:51:20.000Z","bios":{"en_US":"<p>Daniel “Jirall” del Castillo is the captain of the dominant Lyon Gaming. Considered the top team in the LAN region, Lyon has dominated their way to yet another championship under Jirall’s command. After beginning his career in the region on Dash9, he made his way to Lyon Gaming who quickly became the team to beat in the region. He offers a steady presence in the top lane, and throughout league play in the 2017 LLN Opening Season he had 14 games where he didn’t die a single time. That’s quite a feat considering how often top laners have to line up as meat shields so that their carries can dice up the enemy team. After their dominant 3-0 thrashing of the Just Toys Havoks, Lyon and Jirall are gearing up to take advantage of their first-ever berth into the Mid-Season Invitational tournament.</p>","es_AR":"<p><strong>Daniel \"Jirall\" Del Castillo</strong> es el capitán del dominante equipo Lyon Gaming. Considerado como el mejor equipo de la región LAN, Lyon no ha encontrado rival en su camino hacia otro campeonato más bajo el mando de Jirall. Después de comenzar su carrera en la región en Dash9, Jirall se abrió paso a Lyon Gaming, que rápidamente se convirtió en el equipo a vencer. Ofrece una presencia estable en el carril superior, y, a lo largo de la temporada de apertura de la LLN 2017, jugó en 14 partidas en donde no murió ni una sola vez. Esto es un verdadero logro considerando la cantidad de veces que los carrileros superiores deben comportarse como escudos de carne para que sus acarreadores puedan acabar con el equipo enemigo. Después de su bien merecido 3-0 contra los Just Toys Havoks, Lyon y Jirall se están preparando para aprovechar su primera aparición en el Mid-Season Invitational.</p>","de_DE":"Daniel „Jirall“ Del Castillo ist Lyon Gamings Teamleiter. Lyon gilt als eine der besten Mannschaft der LAN-Region und konnte sich unter der Führung von Jirall einen weiteren Titel sichern. Jirall begann seine Karriere bei Dash9, wechselte aber bald zu Lyon Gaming, die schnell zum Maß aller Dinge in der Region wurden. Seine Präsenz auf der oberen Lane ist beachtenswert und er schaffte es, zu Beginn der LLN-Saison 2017 14 Spiele lang nicht zu sterben. Das ist eine ziemlich beeindruckende Leistung, wenn man bedenkt, dass die Top-Laner als Schutzschilde für ihre Carrys fungieren müssen. Nach ihrer dominanten Vorstellung beim 3–0 Sieg über Just Toys Havoks bereiten sich Lyon und Jirall darauf vor, ihren Erfolgslauf bei ihrer ersten Teilnahme an einem Mid-Season Invitational fortzusetzen","es_ES":"Daniel ''Jirall'' del Castillo es el capitán del dominante equipo Lyon Gaming. Considerado el mejor equipo de LAN, Lyon ha conseguido asegurarse su participación en otro campeonato gracias al liderazgo de Jirall. Tras comenzar su trayectoria en la región en Dash9, fue fichado por Lyon Gaming, que se convertiría enseguida en el equipo a batir. Proporciona estabilidad en la calle superior, y durante el torneo de la temporada inicial de la LLN 2017 consiguió acumular un total de 14 partidas en las que no murió ni una sola vez. Toda una proeza, considerando la cantidad de veces que los jugadores de la calle superior tienen que servir de escudos humanos para que sus carries hagan pedazos al equipo enemigo. Tras la paliza 3 a 0 que le dieron a Just Toys Havoks, Lyon y Jirall se preparan para aprovechar al máximo su primera visita al Mid-Season Invitational.","fr_FR":"Daniel « Jirall » Del Castillo est le capitaine de l'équipe dominante Lyon Gaming. Considérée comme la meilleure équipe de la région LAN, Lyon a dominé un championnat de plus sous la houlette de Jirall. Après avoir commencé sa carrière dans la région chez Dash9, le joueur s'est frayé un chemin jusqu'à Lyon Gaming qui est vite devenue l'équipe à battre. Il assure une présence stable sur la voie du haut et, lors de la saison d'ouverture de la LLN 2017, il a joué 14 parties sans mourir une seule fois. C'est un véritable exploit quand on considère la fréquence à laquelle les toplaners doivent se sacrifier pour que leurs carrys puissent agresser l'équipe ennemie. Après une victoire écrasante à 3-0 contre Just Toys Havoks, Lyon et Jirall se préparent à présent à tirer profit de leur toute première participation au Mid-Season Invitational.","pl_PL":"aniel „Jirall” Del Castillo jest kapitanem niezłomnych Lyon Gaming. Właśnie do jego komendą Lyon, uważani za najlepszą drużynę regionu LAN, zdobyli kolejny tytuł mistrzowski. Po rozpoczęciu kariery regionalnej w Dash9 Jirall przeszedł do Lyon Gaming, co szybko okazało się strzałem w dziesiątkę. Ten zawodnik zapewnia stałą obecność na górnej alei i w ciągu rozgrywek ligowych w sezonie otwierającym LLN 2017 wziął udział w 14 grach, w których nie zginął ani razu. To spory wyczyn, biorąc pod uwagę, jak często górni muszą przyjmować na siebie rolę żywej tarczy, aby ich prowadzący mogli dobrać się do wrogiej drużyny. Po łomocie (wynik 3-0) spuszczonym Just Toys Havoks, Lyon i Jirall szykują się, by wykorzystać po raz pierwszy zdobyte miejsce na turnieju Mid-Season Invitational.v","pt_BR":"<p>Daniel \"Jirall” Del Castillo é o capitão do jogo dominante da Lyon Gaming. Considerada a melhor equipe na região LAN, Lyon tem sido dominante e conquistou mais um campeonato sob a liderança de Jirall. Após iniciar sua carreira na região com a Dash9, ele subiu de patamar na Lyon Gaming, que logo se tornou a equipe a ser batida. Ele oferece presença constante na rota superior e, durante a Temporada de Abertura da LLN 2017, passou por 14 jogos sem morrer uma vez sequer. É um grande feito se levarmos em conta a frequência com que jogadores na rota superior se apresentam como \"escudo humano” para que os atiradores possam causar estrago na equipe adversária. Após a vitória esmagadora por 3-0 sobre a Just Toys Havoks, Lyon e Jirall estão loucos para fazer e acontecer nesta primeira participação no torneio Mid-Season Invitational.</p>"},"foreignIds":{"TRLT3":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":1131,"slug":"oddie","name":"Oddie","firstName":"Sebastian ","lastName":"Niño","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/oddie-ckwoviyq.png","hometown":null,"region":"LAN","birthdate":null,"createdAt":"2016-01-25T22:06:29.000Z","updatedAt":"2017-05-29T20:44:16.000Z","bios":{"en_US":"<p>Sebastian \"Oddie\" Niño made his way to Lyon Gaming from Dash9 in 2016 with his teammate Daniel “Jirall” Del Castillo. Together they have put together one the most formidable teams in LAN history. In somewhat of an oddity for the region, Oddie has made it to the top ranks of the NA Challenger ladder multiple times, proving that he has the raw skill to hang with some of the best players in the world. He sports 70-100% win rates on his top six most played champions, making him an absolute terror in the jungle when he’s able to get onto one of his comfort picks. Lyon will be relying on Oddie to take his domestic success and translate it into international results as the team travels to Brazil to face off against some of the best teams in the world.</p>","es_AR":"<p><strong>Sebastián \"Oddie\" Niño</strong> también pasó de Dash9 a Lyon en el 2016 con su compañero <strong>Daniel \"Jirall\" Del Castillo</strong>. Juntos son uno de los equipos más formidables en la historia de LAN. <strong>Oddie</strong> llegó a los primeros lugares de la clasificación de Retador NA múltiples veces, demostrando así que tiene la habilidad para estar entre los mejores jugadores del mundo, algo poco común para la región. Tiene una tasa de victorias de entre 70-100% en sus mejores seis campeones, convirtiéndolo en una verdadera pesadilla en la jungla si logra jugar con una de sus elecciones preferidas. Lyon confiará en que <strong>Oddie</strong> pueda tomar su éxito local y llevarlo a la escena internacional cuando su equipo viaje a Brasil para enfrentarse a algunos de los mejores equipos del mundo.</p>","pl_PL":"Sebastián „Oddie” Niño w 2016 roku przeszedł do Lyon Gaming z Dash9 wraz ze swoim kolegą z drużyny, Danielem „Jirall” Del Castillo. Razem stworzyli jedną z najgroźniejszych drużyn w historii LAN. W sposób dość niespodziewany dla tego regionu, Oddie kilkukrotnie zdobywał szczytowe pozycje w rankingu Pretendenta NA, udowadniając, że ma wrodzony talent, który pozwala mu równać się z najlepszymi zawodnikami na świecie. Może pochwalić się wynoszącymi 70-100% wskaźnikami zwycięstw ze swoją szóstką najczęściej wybieranych bohaterów, co sprawia, że staje się prawdziwym koszmarem w dżungli, gdy tylko może wybrać jednego ze swoich ulubieńców. Lyon będą polegali na Oddiem, chcąc wykorzystać sukces lokalny i przekuć go w międzynarodowe osiągnięcia, gdy drużyna wyruszy do Brazylii, by zmierzyć się z kilkoma z najlepszych drużyn na świecie.","fr_FR":"Sebastián « Oddie » Niño est passé de Dash9 à Lyon Gaming en 2016 en même temps que son coéquipier Daniel « Jirall » Del Castillo. Ensemble, ils ont créé l'une des équipes les plus puissantes de l'histoire de l'Amérique latine du Nord. Joueur unique en son genre dans la région, Oddie a déjà atteint le sommet des classements du palier Challenger NA à plusieurs reprises, prouvant qu'il a le talent nécessaire pour se mesurer aux meilleurs joueurs du monde. Il enregistre un taux de victoire de 70-100 % avec ses six champions les plus utilisés, ce qui fait de lui une véritable terreur dans la jungle lorsqu'il parvient à décrocher l'un de ses choix de prédilection. Lyon comptera sur Oddie pour transformer son succès à domicile en une réussite internationale alors que l'équipe se prépare à affronter quelques-unes des meilleures équipes du monde au Brésil.","es_ES":"Sebastián ''Oddie'' Niño se trasladó de Dash9 a Lyon Gaming en 2016 junto a su compañero Daniel ''Jirall'' del Castillo. Juntos han creado uno de los equipos más formidables de la historia de LAN. Oddie ha conseguido ocupar los primeros puestos de la clasificación Aspirante de NA en múltiples ocasiones, algo poco común en su región, y ha demostrado que es lo bastante bueno para enfrentarse a algunos de los mejores jugadores del mundo. Goza de porcentajes de victoria de entre el 70 y el 100 % con sus seis campeones más jugados, lo que lo convierte en un terror en la jungla cuando puede elegir a uno de sus campeones preferidos. Lyon confiará en Oddie para que convierta su éxito local en resultados internacionales en su viaje a Brasil para enfrentarse a algunos de los mejores equipos del mundo.","de_DE":"Sebastián „Oddie“ Niño wechselte zusammen mit seinem Mannschaftskameraden, Daniel „Jirall“ Del Castillo, 2016 von Dash9 zu Lyon Gaming. Zusammen bauten sie eine der beeindruckendsten Mannschaften in der Geschichte der LAN auf. Oddie hat es sogar geschafft, mehrmals die obersten Ränge der nordamerikanischen Herausforderer-Klasse zu erreichen, was beweist, dass er rein vom Können her mit den besten Spielern der Welt mithalten kann. Seine Siegesraten mit seinen sechs meistgespielten Champions liegen zwischen 70 % und 100 %, was ihn zu einer gewaltigen Bedrohung im Dschungel macht, wenn er mit einem seiner Lieblingschampions spielen kann. Lyon wird sich darauf verlassen, dass Oddie seinen regionalen Erfolg auch auf der internationalen Bühne umsetzen kann, wenn die Mannschaft nach Brasilien reist, um sich mit den Besten der Welt zu messen.","pt_BR":"<p>Sebastián \"Oddie\" Niño entrou para a Lyon Gaming vindo da Dash9, em 2016, com seu colega, Daniel \"Jirall” Del Castillo. Juntos, eles montaram uma das equipes mais formidáveis na história de LAN. Em algo atípico para a região, Oddie ficou entre os primeiros lugares no circuito Desafiante da NA diversas vezes, provando que tem habilidade para ficar entre os melhores jogadores do mundo.  Ele apresenta de 70-100% de taxa de vitória com seus seis Campeões mais usados, o que o torna o verdadeiro terror da selva quando tem acesso à suas principais escolhas. Lyon espera que Oddie traduza seu sucesso doméstico em resultados internacionais quando a equipe viajar para enfrentar algumas das melhores equipes do mundo.</p>"},"foreignIds":{"TRLT3":"200000034"},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":1182,"slug":"genthix","name":"Genthix","firstName":"Mariano","lastName":"Polonsky","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/genthix-7iq8zw35.png","hometown":"Argentina","region":"LAN","birthdate":"1990-12-11","createdAt":"2016-03-21T15:59:40.000Z","updatedAt":"2017-05-29T20:50:00.000Z","bios":{"es_AR":"<p><strong>Mariano \"Genthix\" Polonsky</strong> comenzó a jugar LoL profesionalmente en el equipo U Rage Quit. Desde entonces, su carrera lo ha llevado a algunos de los mejores equipos de la región, incluyendo Isurus Gaming y Furious Gaming. Se abrió paso hasta llegar a Lyon Gaming en diciembre de 2016 después de que su soporte principal se retirara de la vida en la Grieta. Su experiencia hizo que se adaptara rápidamente a <strong>Whitelotus</strong> y, juntos, se han convertido en uno de los dúos más imparables de la LLN. Aunque tiene muchísima experiencia en la región, <strong>Genthix</strong> nunca ha asistido a un evento a nivel internacional durante su carrera. La altura de la competencia aumentará en gran medida su nivel, y sus compañeros esperan que pueda guardar la compostura cuando se enfrente a otros dúos de gran categoría en el Mid-Season Invitational 2017 de Brasil.</p>","en_US":"<p>Mariano “Genthix” Polonsky started playing professional League on the team U Rage Quit. Since then his career has taken him to some of the best teams in the region including Isurus Gaming and Furious Gaming. He made his way to Lyon Gaming in December of 2016 after their starting support retired from life on the Rift. His experience made him a quick fit with WhiteLotus, and together they have become one of the most unstoppable duos in the LLN. While his experience in the region is high, he’s never been to an international level event during his career. The level of competition is bound to be a huge level up, and his teammates are going to need him to hold his composure against other top flight duos when they head to the 2017 Mid-Season Invitational in Brazil.</p>","de_DE":"Mariano „Genthix“ Polonsky begann seine professionelle Karriere bei U Rage Quit. Seither hat ihn seine Karriere zu einigen der besten Mannschaften der Region geführt, darunter auch Isurus Gaming und Furious Gaming. Im Dezember 2016 wechselte er schließlich zu Lyon Gaming, nachdem sich deren Supporter aus der Kluft zurückgezogen hatte. Dank seiner Erfahrung gewöhnte er sich schnell an WhiteLotus und zusammen bildeten die beiden ein unaufhaltbares Duo in der LLN. Obwohl er in seiner Region viel Erfahrung gesammelt hat, war er noch nie bei einem internationalen Event. Beim Mid-Season Invitational 2017 in Brasilien wird er es mit ganz anderen Kalibern zu tun bekommen und ihnen die Stirn bieten müssen, wenn er seinen Mannschaftskameraden helfen will.","es_ES":"Mariano ''Genthix'' Polonsky comenzó a jugar profesionalmente a League of Legends en el equipo U Rage Quit. Desde entonces, ha pasado por algunos de los mejores equipos de su región, incluyendo Isurus Gaming y Furious Gaming. Fue fichado por Lyon Gaming en diciembre de 2016, cuando su apoyo titular decidió abandonar la vida en la Grieta. Su experiencia lo convirtió en un apoyo perfecto para WhiteLotus, y juntos se han convertido en uno de los dúos más imparables de la LLN. Aunque cuenta con mucha experiencia en su región, nunca ha asistido a un evento internacional durante su carrera. Todo apunta a que el nivel de esta competición será muy superior, y sus compañeros de equipo necesitarán que mantenga la compostura contra otros grandes dúos que jugarán en el Mid-Season Invitational 2017 de Brasil.","fr_FR":"Mariano « Genthix » Polonsky a fait ses débuts professionnels dans League of Legends avec U Rage Quit. Depuis, sa carrière l'a amené à rejoindre plusieurs des meilleures équipes de la région, dont Isurus Gaming et Furious Gaming. Il est arrivé chez Lyon Gaming en décembre 2016, après que leur support titulaire a pris sa retraite de la Faille. Son expérience aidant, il s'est parfaitement entendu avec WhiteLotus et, ensemble, ils sont devenus l'un des duos les plus implacables de la LLN. Bien que vétéran dans la région, il n'a encore jamais participé à un événement à l'échelle internationale dans toute sa carrière. Au Mid-Season Invitational 2017 au Brésil, le niveau de la compétition sera bien plus élevé, et il devra garder son sang-froid contre d'autres duos de haut vol.","pl_PL":"Mariano „Genthix” Polonsky zaczął grać w profesjonalne League w drużynie U Rage Quit. Od tego czasu drogi jego kariery wiodły przez kilka z najlepszych drużyn regionu, włącznie z Isurus Gaming i Furious Gaming. Przeszedł do Lyon Gaming w grudniu 2016 roku, po tym, jak ich wspierający z pierwszego składu zakończył występy na Summoner’s Rift. Dzięki swojemu doświadczeniu szybko zgrał się z WhiteLotusem i razem stali się jednym z najtrudniejszych do powstrzymania duetów w LLN. Chociaż ma wielkie doświadczenie w regionie, w czasie swojej kariery nigdy nie trafił na wydarzenie w skali międzynarodowej. Teraz poziom rywalizacji znacznie wzrośnie i jego koledzy z drużyny liczą, że zachowa zimne nerwy w walce przeciwko innym doskonałym duetom, gdy wybiorą się na Mid-Season Invitational 2017 w Brazylii.","pt_BR":"<p>Mariano \"Genthix” Polonsky começou a jogar profissionalmente na equipe U Rage Quit. Desde então, sua carreira o levou a algumas das melhores equipes na região, incluindo Isurus Gaming e Furious Gaming. Ele chegou à Lyon Gaming em dezembro de 2016, após o seu primeiro suporte se aposentar do Rift. Sua experiência o ajudou a se encaixar rapidamente com WhiteLotus, e, juntos, eles se tornaram uma dupla implacável na LLN. Apesar de sua grande experiência na região, ele nunca participou de um evento internacional em toda a sua carreira. O nível da competição deve ser ainda mais alto, e seus colegas esperam que ele mantenha o foco contra outras duplas de ponta quando participarem do Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000037"},"socialNetworks":{"facebook":"https://www.facebook.com/Genthixlol","twitch":"https://www.twitch.tv/genthixlol"},"champions":[{"id":255,"playerId":1182,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"},{"id":256,"playerId":1182,"championId":48,"championKey":"Trundle","championName":"Trundle","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"},{"id":257,"playerId":1182,"championId":201,"championKey":"Braum","championName":"Braum","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"}],"liveGameTeam":191},{"id":1855,"slug":"santas","name":"SaNTaS","firstName":"Alexsandr","lastName":"Lifashin","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santas-5a5d410p.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:19:16.000Z","updatedAt":"2017-07-05T18:15:46.000Z","bios":{"en_US":"<p>Aleksandr \"SaNTaS\" Lifashin is the support player for Virtus.pro. After a brief stint with Vaevictis eSports, he joined Virtus.pro before the 2017 season. Alongside his ADC Blasting, the duo held down one of the safest bot lanes in the LCL. SaNTaS deserves some credit for his ADC’s death count being so low; his most played champion in the regular season was Tahm Kench. Having dominated his regional competition, now SaNTaS is moving on to compete with the best at the 2017 Mid-Season Invitational.</p>","es_AR":"<p><strong>Aleksandr \"SaNTaS\" Lifashin</strong> es el soporte de Virtus.pro. Después de un breve periodo con Vaevictis eSports, se unió a Virtus.pro antes de la temporada del 2017. Junto a su tirador <strong>Blasting</strong>, el dúo mantiene uno de los carriles inferiores más seguros de la LCL. <strong>SaNTaS</strong> merece algo de crédito por el conteo de muertes tan bajo de su tirador. Su campeón preferido en la temporada regular fue Tahm Kench. Habiendo dominado la competencia regional, <strong>SaNTaS</strong> competirá con los mejores del mundo en el Mid-Season Invitational 2017.</p>","de_DE":"Aleksandr „SaNTaS“ Lifashin ist Virtus.pros Supporter. Nach einem kurzen Abstecher zu Vaevictis eSports wechselte er kurz vor Beginn der Saison 2017 zu Virtus.pro. Gemeinsam mit seinem AD-Carry Blasting lieferte er auf der unteren Lane eine der stabilsten Leistungen der LCL ab. SaNTaS verdient einiges an Anerkennung dafür, dass sein AD-Carry so selten gestorben ist. Sein Lieblingschampion in der regulären Saison war Tahm Kench. SaNTaS konnte seine Konkurrenten in der Region dominieren, aber jetzt muss er sich beim Mid-Season Invitational 2017 mit den besten Spielern der Welt messen.","fr_FR":"Aleksandr « SaNTaS » Lifashin joue le rôle de support dans l'équipe Virtus.pro. Suite à un bref séjour au sein de Vaevictis eSports, il a rejoint Virtus.pro avant la saison 2017. Associé à Blasting, son ADC, il a formé un des duos les plus solides de la voie du bas lors de la LCL. SaNTaS n'est pas pour rien dans la statistique très faible de morts de son ADC. Son champion le plus joué au cours de la saison régulière est Tahm Kench. Après avoir dominé la compétition dans sa région, SaNTaS veut maintenant se mesurer aux meilleurs lors du Mid-Season Invitational 2017.","pl_PL":"Aleksandr „SaNTaS\" Lifashin gra w Virtus.pro jako wsparcie. Po krótkiej robótce z Vaevictis eSports przed sezonem 2017 dołączył do Virtus.pro. Wraz ze swoim prowadzącym, Blastingiem, tworzy duet, którego dolna aleja jest najbezpieczniejsza w LCL. Niska śmiertelność prowadzącego jest częściowo zasługą SaNTaSa. W sezonie zasadniczym najczęściej grywał Tahmem Kenchem. Po zdominowaniu rozgrywek sezonowych SaNTaS może teraz sprawdzić się wśród najlepszych na Mid-Season Invitational 2017.","es_ES":"Aleksandr ''SaNTaS'' Lifashin es el apoyo de Virtus.pro. Tras un breve paso por Vaevictis eSports, se unió a Virtus.pro antes de que comenzase la temporada 2017. Junto a su ADC, Blasting, el dúo conforma una de las parejas de la calle inferior más seguras de la LCL. SaNTaS se merece parte del reconocimiento por la reducida media de muertes de su ADC; su campeón más jugado durante la temporada regular ha sido Tahm Kench. Tras dominar en la escena regional, ahora SaNTaS tendrá que competir contra los mejores en el Mid-Season Invitational 2017.","pt_BR":"<p>Aleksandr \"SaNTaS\" Lifashin é o suporte da Virtus.pro. Após uma breve participação na Vaevictis eSports, ele entrou na Virtus.pro antes da temporada de 2017. Junto com seu atirador, Blasting, a dupla garantiu uma das rotas inferiores mais seguras do LCL. SaNTaS merece crédito pela baixa média de mortes do atirador. Seu Campeão mais escolhido na temporada regular foi Tahm Kench. Depois de dominar a competição regional, SaNTaS se prepara para competir com os melhores do mundo no Mid-Season Invitational.</p>"},"foreignIds":{"TRLT3":"200000026","ESPORTSTMNT04":"200001608"},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":1857,"slug":"paranoia","name":"Paranoia","firstName":"Ivan","lastName":"Tipukhov","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/paranoia-5iypjq0s.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:18:59.000Z","updatedAt":"2017-07-05T18:16:58.000Z","bios":{"en_US":"<p>Ivan “Paranoia” Tipukhov is Virtus.pro’s reliable mid laner. After joining the team before the 2017 LCL Spring split, Paranoia averaged just 2.08 deaths per match, the lowest among the league’s mid laners. But he’s far from risk averse; he also averaged 4 kills per game, and one of his favorite champions is Ahri. Now he’ll be challenged with avoiding deaths against some of the world’s best mid laners at the 2017 Mid-Season Invitational.</p>","es_AR":"<p><strong>Ivan \"Paranoia\" Tipuhov</strong> es el carrilero central más confiable de Virtus.pro. Después de unirse al equipo antes del torneo de primavera LCL 2017, <strong>Paranoia</strong> promedió 2.08 muertes por partida, la puntuación más baja entre los carrileros centrales de la liga. Pero no se aleja del riesgo; también promedio 4 asesinatos por partida, y uno de sus campeones favoritos es Ahri. Ahora tendrá el desafío de evitar las muertes contra los mejores carrileros centrales del mundo en el Mid-Season Invitational 2017.</p>","de_DE":"Ivan „Paranoia“ Tipuhov ist Virtus.pros verlässlicher Mid-Laner. Paranoia wechselte vor dem Frühjahrs-Split der LCL 2017 zu Virtus.pro und starb durchschnittlich nur 2,08-mal pro Begegnung (der niedrigste Wert aller Mid-Laner dieser Liga). Aber das heißt nicht, dass er das Risiko scheut. Im gelangen pro Spiel durchschnittlich 4 Tötungen und sein Lieblingschampion ist Ahri. Jetzt muss er beim Mid-Season Invitational 2017 versuchen, von den besten Mid-Lanern der Welt nicht getötet zu werden.","fr_FR":"Virtus.pro peut compter sur un mid-laner fiable, Ivan « Paranoia » Tipuhov. Après avoir rejoint l'équipe avant le segment de printemps 2017, Paranoia atteignait une moyenne de 2,08 morts par match seulement, le taux de décès le plus faible des mid-laners du championnat. Et avec une moyenne de 4 éliminations par match, c'est également un vrai danger pour l'adversaire. L'un de ses champions préférés est Ahri. Son défi est maintenant d'éviter la mort face à la crème des mid-laners mondiaux lors du Mid-Season Invitational 2017.","en_PL":"","es_ES":"Ivan ''Paranoia'' Tipuhov es el fiable mid de Virtus.pro. Tras unirse al equipo antes del split de primavera de la LCL 2017, Paranoia tenía una media de tan solo 2,08 muertes por partida, la más baja de todos los mids de la liga. Pero eso no significa que no se ponga en riesgo, ya que también cuenta con una media de 4 asesinatos por partida, y una de sus campeonas favoritas es Ahri. Ahora, le tocará evitar que los mejores mid del mundo lo maten en el Mid-Season Invitational 2017.","pl_PL":"Ivan „Paranoia” Tipuhov to godny zaufania środkowy Virtus.pro. Po dołączeniu do drużyny przed wiosennym splitem LCL 2017 Paranoia ginął średnio 2,08 raza podczas meczu, co było wynikiem najniższym wśród środkowych ligi. Ale to nie znaczy, że jest słabym punktem drużyny: jego średnia zabójstw na mecz wynosi 4, a jednym z ulubionych bohaterów jest Ahri. Teraz będzie musiał unikać śmierci, grając z najlepszymi środkowymi świata na Mid-Season Invitational 2017.","pt_BR":"<p>Ivan \"Paranoia\" Tipukhov é o confiável meio da Virtus.pro. Quando entrou no time, antes da Etapa de Primavera do LCL 2017, a média do Paranoia era de apenas 2,08 abates por jogo, a mais baixa entre os meios da liga. Porém, o jogador não tem medo de assumir riscos: sua média já foi de 4 abates por jogo, e um dos seus Campeões favoritos é Ahri. Agora o seu desafio será evitar abates contra alguns dos melhores meios do mundo no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000024","ESPORTSTMNT04":"200001606"},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":1858,"slug":"kreox","name":"Kreox","firstName":"Ilya","lastName":"Grom","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kreox-23yqzv2p.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:17:14.000Z","updatedAt":"2017-07-05T18:15:14.000Z","bios":{"en_US":"<p>Ilya “Kreox” Grom is Virtus.pro’s standout jungler. In his first split with the team, Kreox led all LCL junglers with a 4.46 KDA during the regular season. He’s at his best when he’s power farming; he also led LCL junglers in CS per minute at 5.61. Reflecting his playstyle, his most picked champions were Graves and Rek’Sai. He might need to sacrifice some farm to make some plays at the 2017 Mid-Season Invitational if he wants to advance.</p>","es_AR":"<p><strong>Ilya \"Kreox\" Grom</strong> es el mejor junglero de Virtus.pro. En su primer torneo con el equipo, <strong>Kreox</strong> lideró a todos los jungleros de la LCL con un KDA de 4.46 durante la temporada regular. Está en su ambiente cuando acumula oro matando súbditos. También lideró a los jungleros de la LCL con una cantidad de súbditos por minuto de 5.61. Como un reflejo de su estilo de juego, sus campeones preferidos son Graves y Rek'Sai. Tendrá que sacrificar algo de esos números para poder hacer unas jugadas en el Mid-Season Invitational 2017 si quiere avanzar.</p>","fr_FR":"Ilya « Kreox » Grom est le talentueux jungler de Virtus.pro. Pour son premier segment avec l'équipe lors de la saison régulière, Kreox a dominé tous les junglers de la LCL avec un KDA de 4,46. Excellent dans le farming de masse, il a également supplanté les junglers de la LCL avec 5,61 sbires tués par minute. Conformément à son style de jeu, les champions qu'il a choisis le plus fréquemment ont été Graves et Rek’Sai. S'il veut progresser, Kreox devra peut-être sacrifier une partie de son activité de farming pour privilégier des actions de jeu exceptionnelles lors du Mid-Season Invitational 2017.","en_PL":"","es_ES":"Ilya ''Kreox'' Grom es el destacado jungla de Virtus.pro. En su primer split con el equipo, Kreox superó a todos los junglas de la LCL con un A/M/A de 4,46 puntos durante la temporada regular. Lo que mejor se le da es farmear al máximo; además, tiene el récord de monstruos y súbditos asesinados por minuto entre los junglas de la LCL (5,61). Como reflejo de su estilo de juego, sus campeones preferidos han sido Graves y Rek’Sai. Puede que en el Mid-Season Invitational 2017 tenga que sacrificar algo de farmeo para marcarse algunas jugadas si quiere progresar.","de_DE":"Ilya „Kreox“ Grom ist der herausragende Jungler von Virtus.pro. In seinem ersten Split mit der Mannschaft war Kreox mit einer TTU von 4,46 der beste Jungler der LCL während der regulären Saison. Seine Stärke ist das Farmen, was er mit beeindruckenden 5,61 VT pro Minute (der beste Wert aller LCL-Jungler) unter Beweis stellte. Passend zu seinem Spielstil wählte er meistens Graves und Rek’Sai aus. Beim Mid-Season Invitational 2017 wird er wahrscheinlich einen Teil seines Farms opfern müssen, wenn er weiterkommen will.","pl_PL":"Ilya „Kreox” Grom to wyróżniający się dżungler Virtus.pro. Po swoim pierwszym splicie z drużyną Kreox prowadził wśród dżunglerów LCL z wynikiem 4,46 Z/Z/A uzyskanym w trakcie sezonu zasadniczego. Najlepiej radzi sobie, gdy zyska siłę dzięki farmieniu. Prowadzi też wśród dżunglerów LCL pod względem stworów zabitych na minutę z wynikiem 5,61. Nie dziwi, że przy takim stylu gry najczęściej wybieranymi przez niego bohaterami są Graves i Rek’Sai. Jeśli zależy mu na awansie podczas Mid-Season Invitational 2017, być może będzie musiał poświęcić farmienie na rzecz intensywniejszej gry.","pt_BR":"<p>Ilya \"Kreox\" Grom é o caçador de destaque da Virtus.pro. Em sua primeira etapa com a equipe, Kreox liderou todos os caçadores da LCL com um AMA de 4,46 durante a temporada regular. Ele também liderou os caçadores da LCL com 5,61 de CM (tropas abatidas) por minuto. Refletindo seu estilo de jogo, os Campeões mais escolhidos por Kreox foram Graves e Rek’Sai. Talvez ele precise sacrificar um pouco da coleta para fazer boas jogadas no Mid-Season Invitational 2017 se quiser avançar.</p>"},"foreignIds":{"TRLT3":"200000023","ESPORTSTMNT04":"200001606"},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":1859,"slug":"doxy","name":"Doxy","firstName":"Rafael","lastName":"Adl Zarabi","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doxy-1fmjnq51.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:17:32.000Z","updatedAt":"2017-07-05T18:13:26.000Z","bios":{"en_US":"<p>Rafael “Doxy” Adl Zarabi plays it all. In 13 games during the LCL 2017 Spring split, he played seven unique champions. On top of his versatility, his 5.05 KDA was second best among LCL top laners. His champion pool will be stretched to its limits at the 2017 Mid-Season Invitational in Rio.</p>","es_AR":"<p><strong>Rafael \"Doxy\" Adl Zarabi</strong> juega con todo. En las 13 partidas durante el torneo de primavera LCL 2017, jugó con siete campeones diferentes. Además de su versatilidad, su KDA de 5.05 fue el segundo mejor entre los carrileros superiores de la LCL. Su poza de campeones llegará hasta su límite en el Mid-Season Invitational 2017.</p>","de_DE":"Rafael „Doxy“ Adl Zarabi kann alles. In den 13 Spielen während des Frühjahrs-Split der LCL 2017 spielte er sieben unterschiedliche Champions. Zusätzlich zu seiner Vielseitigkeit war er mit einer TTU von 5,05 der zweitbeste Top-Laner der LCL. Beim Mid-Season Invitational 2017 in Brasilien wird sich zeigen, ob sein Championpool wirklich groß genug ist","fr_FR":"Rafael « Doxy » Adl Zarabi joue tous les champions. Lors des 13 matchs qu'il a disputés pendant le segment de printemps de la LCL 2017, il a joué sept champions différents. En plus de sa polyvalence, son KDA de 5,05 fait de lui le deuxième meilleur top-laner de la région. Pour le Mid-Season Invitational 2017 au Brésil, il devra exploiter son pool de champions au maximum","es_ES":"Rafael ''Doxy'' Adl Zarabi juega prácticamente todo. En 13 partidas durante el split de primavera de la LCL 2017, ha jugado con siete campeones diferentes. Además de su versatilidad, su A/M/A de 5,05 puntos fue el segundo mejor de entre todos los tops de la LCL. Su gran variedad de campeones será puesta a prueba en el Mid-Season Invitational 2017 de Brasil","en_PL":"","pl_PL":"Rafael „Doxy” Adl Zarabi zagra każdym. Podczas 13 meczów wiosennego splitu LCL 2017 grał 7 różnymi bohaterami. Przy tej zadziwiającej wszechstronności uzyskał Z/Z/A na poziomie 5,05, co dało mu drugie miejsce wśród górnych LCL. Podczas Mid-Season Invitational 2017 w Brazylii będzie musiał wykorzystać swój zestaw bohaterów do jego granic.","pt_BR":"<p>Rafael \"Doxy\" Adl Zarabi joga de tudo. Em 13 jogos durante a Etapa de Primavera da LCL 2017, ele jogou com sete Campeões diferentes. Além de sua versatilidade, seu AMA de 5,05 foi o segundo melhor nas rotas superiores da LCL. A coleção de Campeões de Doxy vai chegar ao limite máximo no Mid-Season Invitational 2017 no Rio de Janeiro.</p>"},"foreignIds":{"TRLT3":"200000022","ESPORTSTMNT04":"200001605"},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":1932,"slug":"mariome","name":"MarioMe","firstName":"Mario","lastName":"Reyes","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":"Liga Latinoamerica Norte","birthdate":null,"createdAt":"2017-05-29T16:23:03.000Z","updatedAt":"2017-05-29T21:03:15.000Z","bios":{"en_US":"","es_AR":"Con apenas 23 años de edad, Mario ‘MarioMe’ Reyes estudiaba Medicina en la Universidad Autónoma de Nuevo León, donde al mismo tiempo se coronó bicampeón del Campeonato Intercolegial Mexicano. Esto lo convierte en el primer jugador salido del torneo Universitario en conseguir la transición a un equipo de la máxima competición. En Lyon Gaming, ‘el doctor’ tendrá la oportunidad de cultivarse como un jugador rodeado del mejor equipo de toda Latinoamérica. "},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":2053,"slug":"bonjour","name":"Bonjour","firstName":"Kirill","lastName":"Nazarov","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":"Rift Rivals","birthdate":null,"createdAt":"2017-07-02T10:35:16.000Z","updatedAt":"2017-07-02T10:35:16.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":311},{"id":2054,"slug":"clover","name":"Clover","firstName":"Nikita","lastName":"Kornyukhin","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"Rift Rivals","birthdate":null,"createdAt":"2017-07-02T10:27:05.000Z","updatedAt":"2017-07-05T18:18:37.000Z","bios":{},"foreignIds":{"ESPORTSTMNT04":"200002903"},"socialNetworks":{},"champions":[],"liveGameTeam":311}],"scheduleItems":[{"id":"AVuhncX_oUG4HPFjOKNq","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:857e98f8-50bc-4076-bb54-d72dfd58b562","scheduledTime":"2017-04-29T18:00:00.406+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:c71dc70f-b5df-41c5-83e1-2ba4d29a1759","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"857e98f8-50bc-4076-bb54-d72dfd58b562","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"c71dc70f-b5df-41c5-83e1-2ba4d29a1759","league":"10"}],"gameIdMappings":[{"id":"39bc191f-6c43-40a5-b69f-00fe7c204e9a","gameHash":"ea72eeea408eb7db"}],"videos":[{"id":6711,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:39bc191f-6c43-40a5-b69f-00fe7c204e9a","source":"https://www.youtube.com/watch?v=lhLqnNPwuXc&wmode=transparent","createdAt":"2017-04-29T19:30:01.000Z","updatedAt":"2017-04-29T19:30:01.000Z","game":"39bc191f-6c43-40a5-b69f-00fe7c204e9a"},{"id":6715,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:39bc191f-6c43-40a5-b69f-00fe7c204e9a","source":"https://www.youtube.com/embed/YnLZL3gr4lY?wmode=transparent","createdAt":"2017-04-29T20:48:14.000Z","updatedAt":"2017-04-29T20:48:14.000Z","game":"39bc191f-6c43-40a5-b69f-00fe7c204e9a"},{"id":6716,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:39bc191f-6c43-40a5-b69f-00fe7c204e9a","source":"https://www.youtube.com/embed/-beY-s29CpU","createdAt":"2017-04-29T21:20:46.000Z","updatedAt":"2017-04-29T21:20:46.000Z","game":"39bc191f-6c43-40a5-b69f-00fe7c204e9a"},{"id":6939,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:39bc191f-6c43-40a5-b69f-00fe7c204e9a","source":"https://www.youtube.com/embed/uRkNR7Ajb9U","createdAt":"2017-05-29T03:33:15.000Z","updatedAt":"2017-05-29T03:33:15.000Z","game":"39bc191f-6c43-40a5-b69f-00fe7c204e9a"}],"htmlBlocks":[],"match":{"id":"857e98f8-50bc-4076-bb54-d72dfd58b562","name":"VP-vs-LYN","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"},{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],"games":{"39bc191f-6c43-40a5-b69f-00fe7c204e9a":{"id":"39bc191f-6c43-40a5-b69f-00fe7c204e9a","name":"G1","generatedName":"LYN|VP|G1|857e98f850bc4076bb54","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"},{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],"standings":{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1496029132940,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493500801984,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493498849457,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493494395782,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493493790524,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120151","gameRealm":"TRLT3","platformId":"TRLT3:120151","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1496029132940,"source":"bestOf","history":[{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493500801984,"source":"bestOf","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493498849457,"source":"bestOf","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493494395783,"source":"bestOf","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"ef9a965b-e5a9-48ee-8512-6e41b06d42e3"}]],"timestamp":1493493790525,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"ef9a965b-e5a9-48ee-8512-6e41b06d42e3":0,"eb64b3e7-aee3-4b7c-929c-c33a11087921":1}}}