{"teams":[{"id":53,"slug":"team-liquid","name":"Team Liquid","guid":"be6cab43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-liquid-3g983dra.png","acronym":"TL","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-08-05T20:07:01.000Z","bios":{"en_US":"<p>Formed in the wake of the Team Liquid and Team Curse organizations merging, Liquid debuted in the NA LCS 2015 Spring Split. After a tumultuous Spring Split, where they lost three of their tested talents and replaced them with rookies Lourlo, Dardoch, and Matt, many players thought that they’d struggle to avoid the bottom of the rankings. Instead, the team stepped up huge and outperformed expectations.</p>\n\n<p>Unfortunately, all good things must come to an end and Liquid released some of their top talent at the end of 2016. The team acquired a couple of new players (including world class jungler Reignover) and a returning world champion in Piglet. With a new outlook and the air successfully cleared after a rough split, Liquid is ready to make a run at playoffs.</p>\n\n<p>Coach: Nu-ri \"Cain\" Jang</p>","fr_FR":"<p>Née de la fusion entre Team Liquid et Team Curse, Liquid a fait ses débuts dans le segment de printemps des LCS NA 2015. Malgré un départ un peu poussif, avec un score de 9 victoires pour 9 défaites lors de la saison, TL est remontée à un score final de 11 victoires après s'être battue bec et ongles pour arracher la 3e place. Le roster de Liquid est resté quasi-intact au fil des péripéties connues par l'équipe depuis ses débuts, et les fans espèrent que les quelques nouveaux éléments intégrés au roster sauront s'adapter rapidement, en particulier leur nouveau top laner, Lourlo, qui doit encore faire ses preuves.</p>","pl_PL":"<p>Ta organizacja założona w 2010 roku w Holandii zrzesza graczy z całego świata. Posiada swoje oddziały w większości gier gdzie istnieje scena esportowa, więc naturalną koleją rzeczy jej pragnieniem było dołączenie do nich League of Legends. Taka okazja nadarzyła się 6 stycznia 2015 roku – drużyna Team Curse dokonała fuzji z organizacją Liquid. W ten sposób zespół sięgający swoimi korzeniami do pierwszego sezonu zmienił nazwę na Team Liquid. Ze względu na integrację kadra pozostała bez zmian, tylko nadzór nad nią i jej wsparcie uległy modyfikacji.</p>\n<p>\nJej właścicielami są Victor \"Nazgul\" Goossens i Steve \"LiQuiD112\" Arhancet, którzy aktywnie biorą udział w życiu drużyny. Victor to założyciel Team Liquid i były profesjonalny gracz strategicznych produkcji. 1 maja 2001 roku powstała strona dotycząca gier tej kategorii. W kolejnych latach jego organizacja rozwijała się o kolejne gry różnych typów. W momencie fuzji była poważaną instytucją zrzeszającą graczy z całego świata. Steve był częścią sceny esportowej League of Legends w pierwszym i drugim sezonie. Uwielbiał grać jako support, w szczególności Soraką. Posiada wykształcenie z zakresu finansów, co po 12 latach pracy w biznesie, zdecydował się połączyć ze swoją pasją. W sierpniu 2011 roku, po tym jak jego drużyna dostała się pod skrzydła Curse Gaming, został Dyrektorem do spraw esportu w Curse Inc. Po fuzji automatycznie stał się współwłaścicielem Team Liquid. Często można go zobaczyć na filmach przedstawiających życie zawodników, jak i również w spotach reklamowych organizacji. Razem z Victorem dbają o wizerunek i potrzeby swojej wspólnej drużyny.</p>\n<p>                                             \nDebiut Team Liquid, jako marki, w NA LCS miał miejsce w piątym sezonie. W okresie wiosennym poradzili sobie przyzwoicie, kończąc na szóstym miejscu z wynikiem 9:9. Biało-niebiescy zawodnicy zdobyli tytuł najbardziej wartościowego gracza aż dwukrotnie w tym okresie. Swoją prawdziwą siłę pokazali dopiero w letnim sezonie NA LCS 2015. Zadziwiające jest to, że udało im się tego dokonać bez żadnych zmian w składzie osobowym.Drużyna Team Liquid skończyła z najlepszym wynikiem – 13:5, zajęła pierwsze miejsce w tabeli ex aequo z Counter Logic Gaming. Jednak w dogrywce nie pozostawiła złudzeń, że to właśnie jej należy się pierwsze miejsce i pokonała CLG. W tym okresie, oprócz kolejnych dwóch laurów MVP, nagrodzony został trener Team Liquid - Peter Zhang. Na zdobyciu szczytu w letnim sezonie NA LCS 2015 skończyła się dobra passa biało-niebieskich. Po rozegraniu meczy kwalifikacyjnych do Mistrzostw Świata, niestety nie udało im się przejść dalej. Jednak Team Liquid pomyślnie wykreował swój wizerunek na scenie esportowej, gdyż po sezonie piątym jej popularność wśród społeczeństwa League of Legends zdecydowanie wzrosła. Przez fanów postrzegana jest jako nowoczesna i prężna organizacja, po której zawsze można się spodziewać czegoś dobrego.</p>\n","de_DE":"Liquid entstand aus der Fusion von Team Liquid und Team Curse, und sie traten zum ersten Mal im Frühjahrs-Split der nordamerikanischen LCS 2015 auf den Plan. Nach einem turbulenten Frühjahrs-Split, in dem sie drei ihrer erfahrenen Talente verloren hatten und sie mit den Nachwuchsspielern Lourlo, Dardoch und Matt ersetzen mussten, dachten viele Spieler, sie würden am Ende der Tabelle landen. Stattdessen machte die Mannschaft einen großen Sprung und übertraf alle Erwartungen.</p>\n<p>\nLeider hat alles Gute einmal ein Ende und Team Liquid musste Ende 2016 ein paar seiner besten Spieler ziehen lassen. Die Mannschaft verpflichtete ein paar neue Spieler (dazu gehört auch der Weltklasse-Jungler Reignover) sowie den Weltmeister Piglet. Dank der neuen Aufstellung und einem sauberen Schnitt nach dem Sommer-Split 2016 ist Team Liquid bereit, um die Krone der LCS mitzuspielen.\n<p>\nCoach: David „Varsix“ Lim\n"},"foreignIds":{"drupalId":"3654"},"players":[44,250,326,372,395,558,626,777,969,2081],"starters":[44,558,626,777,969],"subs":[250,326,372,395,2081]},{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]}],"players":[{"id":44,"slug":"piglet","name":"Piglet","firstName":"Gwang-jin","lastName":"Chae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/piglet-4smmppa.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-05-25T17:21:49.000Z","bios":{"en_US":"<p>Gwang-jin “Piglet” Chae experienced the highest highs a League of Legends pro player can experience when he took home the Summoner’s Cup at the 2014 World Championship. But he has since had to endure some of the lowest lows to get another shot at glory. He struck out into the unknown and joined Liquid. It’s been a rocky road which eventually led to Piglet stepping down to play with Team Liquid Academy.</p>\n\n<p>After opting to play largely with Team Liquid Academy in 2016, Piglet is finally making his return to Team Liquid and the NA LCS. Piglet’s mechanical skill is the stuff of legends, and he’s renown for his ability to make even the most skillful plays look deceptively easy. Quite simply: Piglet is a playmaker that Team Liquid has gone far too long without. The kind of firepower that Piglet is capable of unleashing has the potential to make Team Liquid an instant contender for the NA LCS throne. Bot lane beware -- Piglet is back.</p>","fr_FR":"<p>Gwang-jin « Piglet » Chae a vécu ce qu'un joueur pro de League of Legends peut vivre de plus\n\nfantastique ; il a rapporté chez lui la Coupe de l'invocateur du mondial 2014. Mais depuis, il a dû \n\nsupporter le pire du pire dans l'espoir de revivre cette heure de gloire. Après s'être lancé dans l'inconnu \n\nen rejoignant Team Liquid de l'autre côté de l'océan, Piglet s'est pris un mur. Les choses ne se passaient \n\npas comme prévu. Au lieu de mener son équipe au sommet des LCS, il s'est retrouvé sur le banc de \n\ntouche pendant qu'un jeune n'ayant pratiquement aucune expérience pro jouait son rôle.</p>\n\n<p>Mais Piglet n'a pas été champion du monde par hasard et il a su relever ce nouveau défi. S'entraînant \n\nencore plus qu'avant, donnant tout pour établir une vraie synergie avec ses coéquipiers, Piglet et Liquid \n\nsont finalement parvenus à se fondre dans une entité efficace. Malgré quelques difficultés persistantes, \n\nPiglet retrouve peu à peu sa forme d'antan. Profitant pleinement des compétences techniques qui lui \n\navaient permis de remporter le championnat du monde, Piglet ne vise plus qu'un seul objectif : revenir \n\nune fois encore sur la plus grande scène que l'e-sport de LoL puisse offrir.</p>","pl_PL":"<p>Ten utalentowany AD Carry pojawił się na scenie esportowej League of Legends w lutym 2013 roku. Jako debiutant, doświadczony tylko w solo que, dołączył do SK Telecom T1 2. Ten skład został utworzony wokoło  Lee’a \"Faker\" Sang-hyeoka, jako siostrzana drużyna SK Telecom T1 1. \"Piglet\" wraz z ekipą osiągnęli powodzenie już na pierwszym turnieju, pomimo tego, że w większości byli nowicjuszami. Co prawda zajęli tylko trzecie miejsce, ale dzięki temu zaistnieli wśród najlepszych w Korei, pokonując m.in. CJ Entus Frost. Zaledwie parę miesięcy później pokazali na co naprawdę ich stać, wygrywając HOT6iX Champions Summer 2013. Dzięki zdobytym punktom na tym wydarzeniu, zdecydowane zwycięstwozagwarantowało Chae’owi \" Gwang-jinowi wejście do Mistrzostw Świata 2013 z trzeciego miejsca w Korei. Tam, na arenie międczynarodowej, \"Piglet\" pokazał jak bardzo wybitnym jest AD Carrym. Z grupy SKT T1 wyszło z wynikiem 7:1, tracąc tylko jedną grę przeciwko OMG. W fazie eliminacji tylko Najin Black Swordz powodzeniem stawiło czoła ich potędze, przegrywając z SKT T1 2:3. Tytuł mistrza świata to zdecydowanie największy sukces Chae’a Gwang-jina.</p>\n<p>\nCzwarty sezon w Korei rozpoczął kolejnymi triumfami, lecz wraz z upływem czasu SKT T1 coraz gorzej sobie radziło. Ostatecznie, we wrześniu 2014 roku, \"Piglet\" i jego partner \"PoohManDu\"  pożegnali się z tą organizacją. Wspomnieniem po tej współpracy pozostały skarpetki Chae’a Gwang-jina z Kubusiem Puchatkiem, które nosił podczas meczów ze swoim supportem, ponieważ przynosiły mu szczęście. Taki talent nie mógł zostać wolnym strzelcem zbyt długo, już październiku 2014 roku dostał ofertę od Team Curse. Po przeprowadzce do Stanów Zjednoczonych czekało go dużo pracy – pokonanie bariery językowej, problemy z wizą i zyskanie komunikacji z nowym kolegami. Jednak znany z zaangażowania \"Piglet\" dał z siebie wszystko. W końcu, w letnim sezonie 2015, już pod marką Team Liquid, udało mu się znaleźć na szczycie NA LCS.</p>\n<p> \nDo jego osobistych osiągnięć przede wszystkim należy nagroda za najlepszego AD Carry podczas 2013 Korea e-Sports Awards. Dokonał tego głównie grając swoją ulubioną postacią – Vayne. Poza nią, częściej od innych bohaterów, wybiera Ezreala, Corkiego i Caitlyn.Wspominając swoje najszczęśliwsze momenty w życiu, jako pierwszy przytacza dostanie się do SKT T1, a jako drugi z kolei wygranie OGN Summer 2013. Słynie ze swojego niezmiennego, defensywnego stylu gry i godnej podziwu pozycji w walkach drużynowych. To bardzo dumny zawodnik, poważnie traktujący rywalizację z AD Carry z innych zespołów, w szczególności z Gu’em \"Imp\" Seung-binem. Wśród innych graczy wyróżnia go sumienność i pracowitość. Przez to, że sypiał po 4 do 5 godzin i ćwiczył swoje umiejętności w League of Legends przez kolejne 15 do 16, zyskał przydomek „Practice Worm”. Można również o nim powiedzieć, że jest emocjonalny. Wielokrotnie reagował na krytykę lub porażkę bardzo silnie, w szczególności w kontaktach ze swoimi trenerami i menadżerami.\n</p>","de_DE":"Gwang-jin „Piglet“ Chae hat alle Höhen eines professionellen „League of Legends“-Spieler erlebt, als er die Weltmeisterschaft 2014 gewann und den Beschwörerpokal mit nach Hause nahm. Seither musste er jedoch auch einige Tiefen verkraften, um wieder eine Chance auf Ruhm und Ehre zu bekommen. Er machte sich auf ins Unbekannte und wechselte zu Liquid. Es war ein steiniger Weg, der schließlich dazu führte, dass sich Piglet zurückzog und für Team Liquid Academy spielte. \n</p>\nNachdem Piglet sich entschieden hatte, 2016 hauptsächlich für Team Liquid Academy zu spielen, kehrt er schließlich wieder zu Team Liquid in die NA LCS zurück. Piglets mechanisches Können ist legendär, und er ist bekannt dafür, selbst die schwierigsten Spielzüge ganz einfach aussehen zu lassen. Es ist ganz einfach: Piglet ist der Spielmacher, auf den Team Liquid zu lange verzichten musste. Die Feuerkraft, die in Piglet steckt, kann Team Liquid sofort zu einem Anwärter auf den Thron der NA LCS machen. Die untere Lane sei gewarnt – Piglet ist zurück.\n"},"foreignIds":{"drupalId":"690","TRLH1":"200000244","TRLH2":"200000148"},"socialNetworks":{"twitch":"","twitter":"https://twitter.com/LiquidPiglett"},"champions":[],"liveGameTeam":53},{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":326,"slug":"reignover","name":"Reignover","firstName":"Yeu-Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reignover-cswdikvi.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-29T02:29:09.000Z","bios":{"en_US":"<p>Yeu-jin “Reignover” Kim has left his mark on both the EU and NA LCS. After guiding Fnatic to an INSANE (incredible, amazing, eye-popping) 18-0 record in 2015, Reignover took a flight across the pond to play for the newly-formed Immortals squad. That team was wildly successful during regular seasons, where Reignover earned himself MVP honors in the 2016 NA LCS Spring Split. Their inability to win in the postseason led to most players, including Reignover, to seek opportunities elsewhere.</p>\n\n<p>Reignover became Team Liquid’s biggest acquisition of the offseason after they parted ways with troubled jungler, Dardoch. He’ll look to continue his dominant ways in 2017 as part of the revamped Team Liquid squad. His arrival coupled with the return of powerhouse AD Carry, Piglet, has given Team Liquid fans more than enough reason to get pumped for the upcoming split. Whether he’s cleaving enemies to death as Olaf, or tunneling his way to victory with Rek’Sai, rest assured that Reignover is going to put on one hell of a show.</p>","pl_PL":"Yeu-jin „Reignover” Kim w tym roku odcisnął swoje piętno na NA LCS. Chociaż Immortals nie udało się zakwalifikować do Mistrzostw, występy Reignovera podczas splitów wiosennego i letniego zapadły w pamięci głosujących, którzy przyznali mu 36 procent głosów na dżunglera. Najwyraźniej fani wierzą, że chociaż Reignover nie pojawił się na Mistrzostwach, bez problemów dorówna reszcie najlepszych dżunglerów świata. </p>\n\nPo odejściu z legendarnej europejskiej drużyny, Fnatic, Reignover podbił Amerykę Północną szturmem, gdy poprowadził dopiero co utworzonych Immortals przez zakończony wynikiem 17-1 sezon zasadniczy i zdobył tytuł najlepszego zawodnika wiosennego splitu NA LCS 2016. Utrzymywał dominację podczas letniego splitu, a Immortals przez cały sezon siedzieli na ogonie zdobywców pierwszego miejsca, TSM. Jednak pomimo stałej dominacji w sezonie zasadniczym, Reignover oraz Immortals zawiedli w fazie pucharowej i kwalifikacjach regionalnych. Podczas wydarzenia All-Star 2016 będzie mógł raz jeszcze pokazać, na co go stać i przypomnieć fanom, dlaczego jest uważany za jednego z najlepszych dżunglerów na świecie.\n","fr_FR":"<p>Yeu-jin \"Reignover\" Kim a marqué les LCS NA cette année. Même si Immortals n'a pas réussi à se qualifier pour le Mondial, les performances de Reignover durant les segments de printemps et d'été sont restés gravées dans les esprits, ce qui lui a valu de remporter 36 pour cent du vote jungler. Les fans pensent clairement que même si Reignover n'a pas participé au Mondial, il aurait été à la hauteur des autres meilleurs junglers du monde.</p>\n\n<p>Après avoir quitté Fnatic, l'équipe européenne historique, Reignover a pris d'assaut l'Amérique du Nord lorsqu'il a permis à l'équipe nouvellement créée des Immortals d'établir un record de 17-1 pendant la saison régulière, ce qui lui a valu le titre de MVP du segment de printemps des LCS NA 2016. Il a continué de dominer le segment d'été, permettant aux Immortals d'être toujours dans la course derrière l'équipe TSM, premiers durant toute la saison. Malgré leur domination dans la saison régulière, Reignover et les Immortals ont échoué lors des play-offs et des qualifications régionales. Au cours de l'événement All-Stars 2016, il va devoir de nouveau faire ses preuves et rappeler aux fans pourquoi il est l'un des meilleurs junglers du monde.</p>","de_DE":"Yeu-jin „Reignover“ Kim hat sowohl der EU LCS als auch der NA LCS seinen Stempel aufgedrückt. Nachdem er Fnatic 2015 zu einem Rekord von 18–0 geführt hatte, zog es Reignover über den großen Teich, um für die neu formierten Immortals zu spielen. Die Mannschaft war in der regulären Saison außerordentlich erfolgreich und Reignover wurde zum MVP des Frühjahrs-Split der NA LCS 2016 gewählt. Doch da die Immortals in der Nachsaison kein Spiel mehr gewinnen konnten, suchten die meisten Spieler, inklusive Reignover, ihr Glück bei anderen Mannschaften.\n<p>\nReignover wurde Team Liquids größte Neuverpflichtung in der Nebensaison, nachdem sie sich von ihrem Jungler, Dardoch, aufgrund von Problemen verabschiedet hatten. Als Teil der neuen Aufstellung von Team Liquid wird Reignover 2017 versuchen, seine Dominanz fortzusetzen. Zusammen mit der Rückkehr des AD-Carrys Piglet hat er dafür gesorgt, dass es die Fans von Team Liquid kaum noch erwarten können, bis der Frühjahrs-Split endlich beginnt. Egal, ob er seine Gegner mit Olaf in Stücke hackt oder sich mit Rek’Sai zum Sieg gräbt, Reignover wird eine verdammt gute Vorstellung abliefern.\n","es_ES":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los split de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores junglas del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviese un récord de 17-1 durante la temporada regular. Además, el jungla ganó el premio al mejor jugador del split de primavera de la LCS NA 2016. Durante el split de verano siguió dominando e hizo que Immortals le pisase los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en los playoffs y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores junglas del mundo.</p>","pt_BR":"<p>Yeu-jin “Reignover” Kim deixou sua marca na LCS NA deste ano. Apesar da Immortals não conseguir a vaga no Mundial, o desempenho de Reignover durante as duas etapas da temporada ficou na cabeça dos jogadores, deixando-o com 36% dos votos da Selva. Fãs claramente acreditam que, apesar de não ter aparecido no Mundial, o rapaz teria se saído tão bem quanto o restante dos melhores caçadores do mundo. </p>\n\n<p>Após sair da europeia Fnatic, Reignover tomou a América do Norte de assalto, liderando a recém-formada Immortals a uma temporada regular com um placar de 17 a 1 e recebendo o prêmio de Jogador Mais Valioso da Etapa de Primavera da LCS NA 2016. Ele continuou a dominar na Etapa de Verão, mantendo a Immortals na cola da líder, TSM, por toda a temporada. Apesar de dominar a fase regular, Reignover e a Immortals não conseguiram se dar bem nas Eliminatórias e classificatórias regionais. No Evento All-Star 2016, ele poderá nos mostrar do que é capaz novamente e lembrar seus fãs do porque ele é um dos melhores caçadores do mundo.</p>","cs_CZ":"<p>Yeu-jin „Reignover“ Kim během letošních bojů v severoamerickém LCS rozhodně nestál v koutě. Immortals se sice na MS nekvalifikovali, Reignoverovy výkony z jarního a letního splitu se ovšem do paměti účastníků hlasování vryly natolik, že získal v kategorii džunglerů 36 % hlasů. Fanoušci očividně věří, že i když se nezúčastnil MS, dokáže se bez obav poprat se světovou džunglerskou špičkou.</p>\n\n<p>Po svém odchodu z věhlasného evropského týmu Fnatic vzal Reignover Severní Ameriku útokem. Nově vytvořené Immortals dovedl k bilanci ze základní sezóny 17:1 a sám získal ocenění pro nejužitečnějšího hráče jarního splitu severoamerického LCS 2016. Jeho dominance pokračovala i v letní části soutěže, během níž Immortals neustále šlapali na paty prvním TSM. Navzdory úspěchům ze základní sezóny však Reignover a Immortals při play-off a regionálních kvalifikacích vypadli z formy. Na turnaji All-Star 2016 tak bude moci opět předvést, co umí, a připomenout fanouškům, proč je označován za jednoho z nejlepších džunglerů na světě.</p>","el_GR":"<p>Ο Yeu-jin “Reignover” Kim άφησε το σημάδι του στο φετινό LCS Βόρειας Αμερικής. Παρόλο που οι Immortals δεν κατάφεραν να προκριθούν στο Παγκόσμιο Πρωτάθλημα, η απόδοση του Reignover στο Spring Split και στο Summer Split έμεινε χαραγμένη στη μνήμη των ψηφοφόρων, με αποτέλεσμα να πάρει το 36% των ψήφων για το ρόλο του παίκτη ζούγκλας. Προφανώς, το κοινό πιστεύει ότι, αν τα κατάφερνε να εμφανιστεί στο Παγκόσμιο Πρωτάθλημα, ο Reignover θα τα πήγαινα μια χαρά σε μια αναμέτρηση με τους καλύτερους παίκτες ζούγκλας του κόσμου.</p> \n\n<p>Μετά την αποχώρησή του από τους Fnatic, μιας από τις ποιο ιστορικές ομάδες της Ευρώπης, ο Reignover γνώρισε τεράστια επιτυχία στη Βόρεια Αμερική όταν οδήγησε τους νεοφώτιστους Immortals σε ένα εκπληκτικό σερί 17-1 στην κανονική σεζόν, κατακτώντας στην πορεία και το βραβείο του MVP για το Spring Split 2016 του LCS Βόρειας Αμερικής. Η ασταμάτητη πορεία του συνεχίστηκε και στο Summer Split, με αποτέλεσμα να κρατήσει τους Immortals σε μικρή διαφορά από τους πρώτους TSM σε όλη τη διάρκεια της σεζόν. Παρά την καταπληκτική τους πορεία στην κανονική σεζόν, ο Reignover και οι Immortals δεν κατάφεραν να προχωρήσουν στα πλέι οφ και στους περιφερειακούς προκριματικούς. Στο Τουρνουά All-Star 2016, θα έχει την ευκαιρία να δείξει και πάλι τι αξίζει και να υπενθυμίσει στους φίλους του παιχνιδιού γιατί είναι ένας από τους καλύτερους παίκτες ζούγκλας στον κόσμο.</p>","hu_HU":"Yeu-jin „Reignover” Kim idén fontos szereplője volt az NA LCS-nek. Bár az Immortals nem jutott ki a vb-re, Reignover tavaszi és nyári teljesítménye olyan mély nyomott hagyott a szavazókban, hogy a dzsungelharcosokra leadott szavazatok 36%-a landolt nála. A rajongók szilárdan hisznek abban, hogy bár Reignover nem játszott a vb-n, állta volna a sarat a világ legjobb dzsungelharcosai ellen. \n</p>\nA legendás európai csapat, a Fnatic elhagyása után Reignover bevette Észak-Amerikát, az újonnan alakult Immortals élén 17-1-es eredményt ért el az alapszakaszban, és ő lett az NA LCS 2016-os tavaszi szakaszának legértékesebb játékosa (MVP). A nyári szakaszban is remekül folytatta, az Immortals végig az első helyen álló TSM nyakában loholt. Az alapszakaszbeli kiváló játékuk ellenére Reignover és az Immortals a rájátszásban és a regionális selejtezőkben is rosszul szerepelt. A 2016-os All-Star gálán ismét bizonyíthat, és megmutathatja, hogy ő a világ legjobb dzsungelharcosa.\n","it_IT":"Quest'anno Yeu-jin \"Reignover\" Kim ha davvero lasciato il segno nella LCS NA. Anche se gli Immortals non sono riusciti a qualificarsi per i Mondiali, le sue prestazioni durante lo Spring e il Summer Split hanno fatto decisamente colpo sui votanti, che lo hanno premiato con il 36% dei voti per la categoria Giungla. È evidente per i fan che, nonostante la sua assenza ai Mondiali, Reignover abbia le carte in regola per duellare con i giocatori da giungla più abili al mondo. </p>\n\nDopo aver lasciato lo storico team europeo di Fnatic, Reignover ha fatto furore in Nord America guidando i neonati Immortals a un record stagionale di ben 17-1, guadagnandosi il riconoscimento di MVP nello Spring Split LCS NA 2016. Il suo predominio è proseguito durante il Summer Split, in cui è riuscito a tenere la sua squadra sempre alle calcagna della capolista TSM per l'intera stagione. Nonostante le loro eccellenti prestazioni nella stagione regolare, Reignover e gli Immortals hanno ceduto durante i playoff e le qualificazioni regionali. Nell'All-Star 2016 Reignover potrà mostrare nuovamente le sue abilità e ricordare ai suoi ammiratori che rimane sempre uno dei migliori giocatori di giungla del mondo.\n\n","ro_RO":"Yeu-jin ''Reignover'' Kim și-a pus amprenta anul acesta pe LCS NA. Cu toate că cei din Immortals n-au reușit să se califice la Mondiale, reușitele lui Reignover din etapele de primăvară și de vară au rămas întipărite în mintea celor care l-au votat, obținându-i 36 la sută din voturile pentru junglă. E clar că fanii sunt de părere că, deși nu a participat la Mondiale, s-ar fi descurcat foarte bine împotriva celorlalți jungleri de top ai lumii. </p>\n\nDupă ce a părăsit Fnatic, echipa europeană care a făcut istorie, Reignover a luat cu asalt America de Nord și a reușit să conducă echipa nou-formată Immortals către un record de 17-1 în sezonul normal, obținând titlul de cel mai valoros jucător (MVP) în etapa de primăvară LCS NA 2016. A continuat să domine și în etapa de vară, Immortals rămânând foarte aproape de TSM, echipa de pe primul loc, de-a lungul întregului sezon. Însă chiar dacă și-au distrus adversarii în sezonul normal, cei din Immortals au dat greș în playoff-uri și la calificările regionale. La All-Star 2016, Reignover va avea șansa să demonstreze de ce e în stare și să le reamintească fanilor de ce e unul dintre cei mai buni jungleri din lume.\n","es_AR":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>","es_MX":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>"},"foreignIds":{"drupalId":"885","TRLH1":"200000242","TRLH2":"200000146"},"socialNetworks":{"twitch":"","facebook":"www.facebook.com/pages/Yeujin-Reignover-Kim/1572697482942877","twitter":"https://twitter.com/FnaticReignover"},"champions":[],"liveGameTeam":53},{"id":372,"slug":"inori","name":"Inori","firstName":"Rami","lastName":"Charagh","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inori-1sztspha.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:11.000Z","updatedAt":"2017-08-04T00:04:15.000Z","bios":{"en_US":"<p>Rami \"Inori\" Charagh is Phoenix1's fearless jungler. Phoenix1's 2016 NA LCS Summer Split looked like it was played by two entirely different teams. Before Inori joined, the team looked lost. After he arrived, they found a leader. While it wasn't enough to avoid the 2017 NA LCS Promotion tournament, Inori helped the team easily escape relegation.</p>","de_DE":"Rami „Inori“ Charagh ist der furchtlose Jungler von Phoenix1. Beim Sommer-Split der NA LCS 2016 von Phoenix1 hatte man das Gefühl, dass zwei komplett verschiedene Mannschaften an den Start gingen. Vor Inoris Beitritt wirkte das Team verloren. Aber mit ihm haben sie einen neuen Anführer gefunden. Auch wenn es nicht ganz gereicht hatte, das Aufstiegsturnier der NA LCS 2017 zu verhindern, konnten sie mit Inoris Hilfe dem Abstieg mit Leichtigkeit entgehen.\n<p>\nDamit können Inori und Phoenix1 den gesamten Split 2017 ohne Rückstand in Angriff nehmen. Wenn es die neue Mannschaft schafft, seinen aggressiven Spielstil im Dschungel mit Champions wie Rengar und Hecarim zu unterstützen, werden sie ein harter Gegner für jedes Team der NA LCS. Inori ist für seinen Raubtierinstinkt bekannt, und wenn er sich erst einmal einen Vorteil erarbeitet hat, wird er nicht zögern, seinem Gegner den Todesstoß zu versetzen.\n"},"foreignIds":{"drupalId":"2580","TRLH1":"200000233","TRLH2":"200000137"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":558,"slug":"mickey","name":"Mickey","firstName":"Youngmin","lastName":"Son","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mickey-emcoa162.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-05T21:03:01.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3190","ESPORTSTMNT06":"200000962","TRLH1":"200000719"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":626,"slug":"lourlo","name":"Lourlo","firstName":"Samson","lastName":"Jackson","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lourlo-fmal547y.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-29T02:26:38.000Z","bios":{"en_US":"<p>Samson \"Lourlo\" Jackson made his LCS debut in the 2016 NA LCS Spring Split when he was known as Lourlo. His previous experience with CLG Black prepared him for the jump from semi-pro to pro, and while he didn’t stand out, it’s hard to blame him - with Dardoch and Piglet on your team, it’s hard to get attention.</p>\n\n<p>Yet analysts and fans noticed Lourlo’s rock solid dedication. Even when Liquid had a rough game, Lourlo was playing his heart out. His commitment to constantly bettering himself led to him netting more consistent performances. He may not be the flashiest player on the Rift, but you’d be hard pressed to find anyone that works harder. Team Liquid kept him on board during their roster shuffle, cementing that they believe Lourlo still has heaps of potential that they’re keen to unlock.</p>","fr_FR":"<p>Sam « Lourlo » Jackson fait ses débuts dans les LCS NA en participant à ce segment de printemps 2016. Son expérience passée auprès de CLG Black l'a préparé pour son passage du statut de semi-pro à pro véritable, mais rien ne vaut un premier segment pour réellement faire la distinction entre le bon et la brute (ou le truand). Étant donné que Lourlo est actuellement en 26e place du serveur NA, il devrait à tout le moins être capable de s'affirmer au niveau des mécaniques de jeu.</p>\n<p>Nous n'avons pas vu Lourlo participer à un événement majeur de League of Legends depuis les Challenger Series du printemps 2015. Impossible de prévoir quel genre de nouveauté il pourrait apporter à la méta aujourd'hui ! D'après ses performances en file solo, il maîtrise une multitude de champions, parmi lesquels figurent Riven, Irelia, Nidalee et Rumble.</p>","pl_PL":"<p>\"Lourlo\" zaczął grać w League of Legends w pierwszym sezonie, lecz na grę w profesjonalnym zespole zdecydował się dopiero we wrześniu 2014 roku. Był jednym z założycieli drużyny Storm, wraz z takimi znanymi zawodnikami jak: Zachary \"mancloud\" Allan Hoschar i Terry \"BIG\" Chuong. Planowali zakwalifikować się do wiosennego sezonu NA LCS 2015, lecz Samson jeszcze nie miał wtedy skończonych 17 lat. Dlatego ostatecznie cała drużyna pozostała na scenie Kręgu Pretendenta. Jednak już w lutym 2015 roku zdecydował się grać w Challenger Series dla innej organizacji – Counter Logic Gaming Black. Nie osiągnął za wiele w ich szeregach, gdyż skończył wiosenny okres na 6 pozycji, co było dosyć przeciętnym wynikiem. Jednak \"Lourlo\" dokonał najważniejszej rzeczy dla niego samego – pokazał się wśród profesjonalistów. Swoimi wynikami w Challenger Series zachęcił poważną organizację, Team Liquid, do zaproszenia go do pierwszego składu. Sam powiedział, że gra w CLG Black pozwoliła mu zdobyć doświadczenie na profesjonalnej scenie i rozwinąć swój zasób bohaterów, co było niezbędne dla przejścia do wyższej ligi.</p>\n<p>W wywiadzie dla theScore eSports Samson opowiedział o swoich uczuciach związanych z objęciem tak odpowiedzialnej pozycji. Przyznał, że w tak wczesnym etapie jego kariery, taki „awans” to dla niego olbrzymia nobilitacja. Uważa, że dla debiutanta zastąpienie takiego weterana jak Diego \"Quas\" Ruiz to zaszczyt i jednocześnie wyzwanie. \"Lourlo\" przyznał, że „ma nadzieję, że sprosta tej próbie sił i dowiedzie swoich umiejętności wśród najlepszych zawodników”. Wiele osób opisuje Samsona jako niezwykle agresywnego top-lanera, który zawsze podejmuje próbę carrowania swojej drużyny. Jednak zaraz po dołączeniu do Team Liquid, on sam zaznaczył, że dostosuje się do nowego zespołu i jeśli zajdzie potrzeba zmieni swój styl gry. Wywiad podsumował stwierdzeniem, że w wiosennym sezonie NA LCS 2016 da z siebie wszystko. </p>\n<p>Pseudonim Samsona pochodzi z czasów kiedy grał w inne gry. Spędzał tak czas ze swoim bratem, który jest profesjonalnym zawodnikiem innych komputerowych tytułów. Na swoją pozycję najbardziej lubi wybierać Nidalee i Irelię, ponieważ docenia ich możliwości w agresywnych zagraniach. Wojowniczym postaciom na top-lanie zawdzięcza wejście do Kręgu Pretendenta w Ameryce Północnej. Jednak, gdy pojawia się konieczność, świetnie sobie radzi takimi bohaterami jak Sion czy Maokai. </p>\n","de_DE":"Sam „Lourlo“ Jackson gab sein LCS-Debüt im Frühjahrs-Split der nordamerikanischen LCS 2016. Seine Erfahrungen mit CLG Black haben ihn auf den Sprung vom Halbprofi zum Profi vorbereitet und obwohl er keine überragende Leistung ablieferte, kann man ihm nichts vorwerfen – wenn Dardoch und Piglet in deiner Mannschaft sind, ist es schwer, Aufmerksamkeit zu erregen.\n</p>\nDennoch fiel den Analysten und Fans Lourlos unglaubliches Engagement auf. Selbst in schwierigen Spielen gab Lourlo alles. Seine Hingabe, sich ständig selbst zu verbessern, führte dazu, dass er immer beständigere Leistungen ablieferte. Er ist vielleicht nicht der auffälligste Spieler in der Kluft, aber man muss schon ziemlich lange suchen, um jemanden zu finden, der härter arbeitet als er. Team Liquid hat an Lourlo festgehalten und die Entscheidung damit gerechtfertigt, dass er ihrer Meinung nach noch unglaublich viel Potenzial hat, das sie gerne entfesseln würden.\n"},"foreignIds":{"drupalId":"3814","TRLH1":"200000241","TRLH2":"200000145"},"socialNetworks":{"twitch":"http://www.twitch.tv/lourlo","twitter":"https://twitter.com/LiquidLourlo"},"champions":[],"liveGameTeam":53},{"id":777,"slug":"dardoch","name":"Dardoch","firstName":"Joshua","lastName":"Hartnett","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dardoch-h91p55co.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:26:47.000Z","updatedAt":"2017-08-04T00:04:43.000Z","bios":{"en_US":"Joshua “Dardoch” Hartnett is a true competitor. He demonstrated that in his impressive rookie season that saw him carry and trash talk with the best of them. But his obsession with winning over all else caused problems during a tumultuous Summer Split for Liquid, and he was forced off the team.\n</p>\n<p>Talent has never been a question for Dardoch. If he can work his team, his competitive drive could carry them to new heights.</p>\n\n","de_DE":"Joshua „Dardoch“ Hartnett ist ein echter Wettkämpfer. In seiner beeindruckenden ersten Saison hat er gezeigt, dass er Spiele im Alleingang entscheiden und auch die Besten der Besten gegen die Wand reden kann. Aber seine Versessenheit darauf, um jeden Preis zu gewinnen, hat während des turbulenten Sommer-Splits für Probleme bei Liquid gesorgt, weshalb er auch aus dem Team geworfen wurde.\n</p>\nDie Immortals bieten Dardoch im Jahr 2017 die Chance auf einen Neuanfang. Nach den Umbrüchen in der gesamten NA LCS ist der Titel des Frühjahrs-Splits 2017 reif für die Ernte. Dardochs Talent steht außer Frage. Wenn er mit seinem neuen Team harmoniert, könnte er den Immortals mit seiner wettkampforientierten Einstellung zu neuen Höchstleistungen verhelfen.\n"},"foreignIds":{"drupalId":"3835","TRLH1":"200000216","TRLH2":"200000120"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":969,"slug":"matt","name":"Matt","firstName":"Matt","lastName":"Elento","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/matt-g07k92st.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:10:14.000Z","updatedAt":"2017-01-29T02:27:14.000Z","bios":{"en_US":"<p>Matt \"Matt\" Elento is a Hawaiian who often wears a huge smile and a relaxed attitude. If you saw him out of game, you might not realize that you’re looking at one of the best Bard players around. Stand near a wall? Matt’s going to get you. Group up in a bad location? Ult incoming. Playing a mechanically intensive and unorthodox champion is rough at the best of times -- now imagine you’re doing it in your rookie season, and oh yeah, you’re playing with a World Champion in your lane. Welcome to Matt’s life.</p>\n\n<p>Matt has proven that he has big play potential on the LCS stage, but he has admittedly questioned his own decision making in game which lead to fluctuating performances in the 2016 NA LCS Summer Split. If the first step to fixing yourself is admitting your faults, Matt is well on his way to improving his play. He comes into 2017 with his explosive laning buddy Piglet back by his side and has the chance to make good on his promises to improve. He has the ability to make electric plays -- now it’s time to hit the Rift and prove it.</p>\n\n<p>Learn more about Matt in his <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">Drive documentary.</a></p>","de_DE":"Matt „Matt“ Elento ist ein Hawaiianer, der meistens mit einem breiten Grinsen und einer entspannten Grundhaltung zu sehen ist. Wenn man ihm außerhalb des Spiels begegnet, merkt man nicht, dass man gerade vor einem der besten Bard-Spieler der Welt steht. Du stehst neben einer Mauer? Matt wird dich schnappen. Du hast dich mit deinem Team an einem schlechten Ort versammelt? Schon kommt der Ult. Es ist meistens schwierig, einen mechanisch anspruchsvollen, unkonventionellen Champion zu spielen – und jetzt stell dir vor, du machst das in deiner ersten Saison und dein Partner auf der Lane ist ein Weltmeister. Willkommen in Matts Leben.\n</p>\nMatt hat auf der Bühne der LCS bewiesen, dass er großes Potenzial hat, aber er hat auch seine eigenen Entscheidungen im Spiel hinterfragt, die zu durchwachsenen Leistungen im Sommer-Split der NA LCS 2016 geführt haben. Wenn der erste Schritt zur Besserung die Selbsterkenntnis ist, dann ist Matt auf dem besten Weg, sich als Spieler zu verbessern. 2017 hat er mit Piglet einen explosiven Partner auf der Lane und die Chance, sein Versprechen, sich zu verbessern, in die Tat umzusetzen. Er ist imstande, elektrisierende Spielzüge auszuführen – und jetzt wird es Zeit, sein Können in der Kluft unter Beweis zu stellen.</p>\n<p>Erfahre mehr über Matt in seiner  <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">DRIVE-Geschichte.</a></p>"},"foreignIds":{"TRLH1":"200000245","TRLH2":"200000149"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":2081,"slug":"insanity","name":"Insanity","firstName":"David","lastName":"Challe","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/insanity-5ba0sw13.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-07-28T01:25:57.000Z","updatedAt":"2017-07-28T01:42:26.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":53}],"scheduleItems":[{"id":"AVw2eygqoUG4HPFjOKQh","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:869b6661-e62c-4b14-8d6f-a0aff13ccc19","scheduledTime":"2017-06-16T22:00:00.024+0000","tags":{"blockLabel":"3","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"869b6661-e62c-4b14-8d6f-a0aff13ccc19","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"29390d1a-58c1-42d1-a65f-40222b825936","gameHash":"e0bb8b63d619178b"},{"id":"f9a42b25-0958-44fa-862e-e9d51265c3ae","gameHash":"d5fd95a1a08ea3e5"}],"videos":[{"id":7351,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:f9a42b25-0958-44fa-862e-e9d51265c3ae","source":"https://www.youtube.com/embed/j3MmtdTH2Uc?wmode=transparent&rel=0","createdAt":"2017-06-16T23:33:56.000Z","updatedAt":"2017-06-16T23:33:56.000Z","game":"f9a42b25-0958-44fa-862e-e9d51265c3ae"},{"id":7355,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:29390d1a-58c1-42d1-a65f-40222b825936","source":"https://www.youtube.com/embed/gLkQ0xllS6k?wmode=transparent&rel=0","createdAt":"2017-06-17T00:31:15.000Z","updatedAt":"2017-06-17T00:31:15.000Z","game":"29390d1a-58c1-42d1-a65f-40222b825936"}],"htmlBlocks":[],"match":{"id":"869b6661-e62c-4b14-8d6f-a0aff13ccc19","name":"IMT-vs-TL","position":31,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"games":{"b50ef506-c406-4575-b219-d6c07c390938":{"id":"b50ef506-c406-4575-b219-d6c07c390938","name":"G3","generatedName":"IMT|TL|G3|869b6661e62c4b148d6f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"29390d1a-58c1-42d1-a65f-40222b825936":{"id":"29390d1a-58c1-42d1-a65f-40222b825936","name":"G2","generatedName":"IMT|TL|G2|869b6661e62c4b148d6f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"},{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],"standings":{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497659235215,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497656126807,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002230144","gameRealm":"TRLH1","platformId":"TRLH1:1002230144","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f9a42b25-0958-44fa-862e-e9d51265c3ae":{"id":"f9a42b25-0958-44fa-862e-e9d51265c3ae","name":"G1","generatedName":"IMT|TL|G1|869b6661e62c4b148d6f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"standings":{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497656343349,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497653205759,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002230134","gameRealm":"TRLH1","platformId":"TRLH1:1002230134","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497659235215,"source":"bestOf","history":[{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497656343349,"source":"bestOf","closed":true},{"result":[[{"roster":"a115c007-f1d1-47b2-8d06-d89cc2ec2c33"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1497656126808,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a115c007-f1d1-47b2-8d06-d89cc2ec2c33":1,"96bc625c-e07d-48d2-9fa5-cfbcd5c60659":0}}}