{"teams":[{"id":111,"slug":"mousesports","name":"Mousesports","guid":"be6ef083-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/mousesports-29p77f8y.png","acronym":"MOU","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-27T20:58:17.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"252"},"players":[234,244,320,414,679,1112,1113,1114],"starters":[234,244,320,414,679],"subs":[1112,1113,1114]},{"id":189,"slug":"inspire-esports","name":"Inspire eSports","guid":"be710b8a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/inspire-esports-grtjsvz7.png","acronym":"IE","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2016-01-20T22:33:11.000Z","updatedAt":"2016-05-31T12:24:04.000Z","bios":{},"foreignIds":{},"players":[222,628,660,662,665,686,1111],"starters":[222,660,662,665],"subs":[628,686,1111]}],"players":[{"id":222,"slug":"woolite","name":"Woolite","firstName":"Paweł","lastName":"Pruski","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/woolite-9s090cs8.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:02.000Z","updatedAt":"2017-07-30T14:08:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1471","TRLH3":"1001000106","TRLH4":"200000326","FRA1TMNT1":"375386","TRNA1":"1000445254","TREU":"1000525069","ESPORTSTMNT02":"200001043"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":234,"slug":"zytan","name":"Zytan","firstName":"Niklas","lastName":"Lakaniemi","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/zytan-9whwxgu5.png","hometown":"Finland","region":"EU CS","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2016-02-23T19:43:00.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2499","TRLH3":"1001000137","TRLH4":"1001000137","FRA1TMNT1":"375331"},"socialNetworks":{},"champions":[],"liveGameTeam":111},{"id":244,"slug":"dan","name":"Dan","firstName":"Daniel","lastName":"Hockley","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/dan-ex6b836p.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-07-30T13:55:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2915","FRA1TMNT1":"375391","ESPORTSTMNT02":"200002394","TRLH3":"200000283","TRLH4":"200000481"},"socialNetworks":{},"champions":[],"liveGameTeam":111},{"id":320,"slug":"beansu","name":"Beansu","firstName":"Mauno","lastName":"Tälli","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/beansu-fs41ygqp.png","hometown":"Estonia","region":"EU CS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-01-24T14:39:57.000Z","bios":{"en_US":"Mauno “Beansu” Talli is currently a top laner for Mousesports in the EU Challenger Series."},"foreignIds":{"drupalId":"1407","TRLH3":"1001000135","TRLH4":"1001000135","FRA1TMNT1":"375390","esportstmnt05":"200000892"},"socialNetworks":{"twitter":"https://twitter.com/beansuu"},"champions":[],"liveGameTeam":111},{"id":414,"slug":"nardeus","name":"Nardeus","firstName":"Tomáš","lastName":"Maršálek","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nardeus-cdcxp0w2.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-06-18T19:18:31.000Z","bios":{"en_US":"<p><span>Tomáš \"Nardeus\" Maršálek has been playing League of Legends professionally since 2012 when he joined eSuba, a popular Czech Republic esports organization. After improving his skills in the EU Challenger Series for several years, Nardeus was picked up by Turkish team Aces High Esports Club. Aces were soon acquired by Beşiktaş e-Sports Club, known as the Black Eagles. Nardeus was instrumental in Beşiktaş’ dominant performance at the 2015 TLC Winter Playoffs and the 2015 International Wild Card Invitational, leading his squad to 1st place finishes in both events.</span></p>"},"foreignIds":{"drupalId":"1493","TRLH1":"1001100040","TRLH2":"1001080040","FRA1TMNT1":"375328","TRNA1":"1000435369","ESPORTSTMNT02":"200002457"},"socialNetworks":{},"champions":[],"liveGameTeam":111},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":660,"slug":"cozq","name":"CozQ","firstName":"Sofyan","lastName":"Rechchad","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cozq-7eq65vwu.png","hometown":"Hertogenbosch","region":"EU Challenger Series","birthdate":"1995-05-21","createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-07-06T13:27:23.000Z","bios":{"en_US":"<p>Sofyan \"CozQ\" Rechdad is the mid laner for Mysterious Monkeys. The Dutch mid laner bounced between numerous teams to start his career, which included a brief stint with Turkish team Dark Passage. He found a home on Misfits Academy to start 2017 and helped the team qualify for the EU LCS. He'll remain the starting mid laner for Mysterious Monkeys after the ownership change. He's proven capable on a wide range of mid lane champions, which bodes well for his chances in the LCS.</p>","pl_PL":"Sofyan „CozQ” Rechdad jest środkowym Mysterious Monkeys. Zaczynając karierę, duński środkowy przeskakiwał między wieloma drużynami, zaliczając między innymi krótkie występy w tureckiej drużynie Dark Passage. Na początku 2017 roku znalazł swoje miejsce w Misfits Academy i pomógł drużynie zakwalifikować się do EU LCS. Po zmianie właściciela drużyny pozostanie środkowym w pierwszym składzie Mysterious Monkeys. Pokazał, że świetnie sobie radzi z szerokim wyborem środkowych bohaterów, co dobrze wróży jego szansom w LCS.","fr_FR":"Sofyan « CozQ » Rechdad est le mid laner des Mysterious Monkeys. Le Hollandais a enchaîné les équipes au début de sa carrière, avec notamment un bref séjour chez les Turcs de Dark Passage. Il a finalement trouvé sa place chez Misfits Academy début 2017 et a aidé l'équipe à se qualifier pour les LCS EU. Il conserve sa place de mid laner titulaire des Mysterious Monkeys malgré le changement de propriétaire. CozQ a prouvé son talent avec un large éventail de champions sur la voie du milieu, et les choses se présentent bien pour lui aux LCS, où il devrait avoir toutes ses chances.","es_ES":"Sofyan \"CozQ\" Rechdad es el mid de Mysterious Monkeys. El holandés ha pasado por diversos equipos en el comienzo de su carrera, incluido un breve periodo en el equipo turco Dark Passage. A comienzos de 2017 fue fichado por Misfits Academy y ayudó al equipo a clasificarse para la LCS EU. Seguirá siendo el mid titular de Mysterious Monkeys después del cambio de propietario. Ha demostrado ser capaz de jugar con una gran variedad de campeones, lo que le augura un buen futuro en la LCS.","de_DE":"Sofyan „CozQ“ Rechdad ist der Mid-Laner der Mysterious Monkeys. Der Holländer wechselte zu Beginn seiner Karriere zwischen mehreren Mannschaften hin und her und war für kurze Zeit Teil der türkischen Mannschaft Dark Passage. Zum Jahresbeginn 2017 fand er bei Misfits Academy sein Zuhause und half ihnen bei der Qualifikation zur EU LCS. Auch nach dem Besitzerwechsel behält er seine Position als Mid-Laner für die Mysterious Monkeys. Er hat seine Fähigkeiten mit einer großen Bandbreite an Champions auf der mittleren Lane unter Beweis gestellt, was ihm gute Chancen in der LCS verspricht."},"foreignIds":{"drupalId":"3895","FRA1TMNT1":"375382","TRLH4":"200000300","TRNA1":"1000445250","TREU":"1000565102","TREU1":"1000565102","ESPORTSTMNT02":"200001022","TRLH3":"200000248"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":662,"slug":"wendelbo","name":"Wendelbo","firstName":"Daniel","lastName":"Wendelbo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wendelbo-9lmfix7b.png","hometown":"Danimarka","region":"Turkey Championship League","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-22T01:20:15.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4452","FRA1TMNT1":"375387","TRLH4":"1001240022","TRNA1":"1000445255","TREU":"1000565103","ESPORTSTMNT03":"200001196"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":665,"slug":"satorius","name":"Satorius","firstName":"Max","lastName":"Günther","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/satorius-5k4ftsgq.png","hometown":null,"region":"EU LCS","birthdate":"1994-04-12","createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-19T16:32:22.000Z","bios":{"en_US":"<p>\nMax \"Satorius\" Günther is a long-time veteran of the European Challenger scene. He has spent years in the Challenger circuit, and when xPeke needed to rebuild Origen from the ground up Satorius was a natural choice for the Spanish star. Satorius has shown mastery on everything from Maokai to Gangplank. After being in the Challenger scene for so long, it will be an interesting first foray into the LCS as a part of a completely overhauled Origen. Building a new team from scratch is a daunting task, almost as daunting as the first steps Satorius will take onto the stage as a LCS pro.</p>","fr_FR":"<p>Satorius est un joueur allemand, nouvelle recrue du Melty e-Sport Club habitué au haut niveau. Il a en effet participé plusieurs fois aux qualifications des Challenger Series avec l'équipe Inspire où il a pu emmagasiner un maximum d'expérience. Il entend bien remporter le titre de champion de France avec Melty et ainsi pouvoir atteindre à nouveau le niveau européen.</p>","es_AR":"","de_DE":"<p>Max „Satorius“ Günther ist ein langjähriger Veteran der europäischen Challenger-Szene. Er hat viele Jahre in der Challenger Series verbracht und als xPeke mit Origen komplett neu beginnen musste, stand er ganz oben auf der Wunschliste des Spaniers. Satorius hat gezeigt, dass er alle Champions von Maokai bis Gangplank beherrscht. Nachdem er so lange in der Herausforderer-Szene war, wird es für ihn als Teil von Origen mit einer komplett überarbeiteten Mannschaft bestimmt ein interessanter Ausflug in die LCS. Eine neue Mannschaft von Grund auf aufzubauen, ist eine beängstigende Aufgabe, fast so beängstigend wie die ersten Schritte auf die Bühne der LCS für Satorius.</p>"},"foreignIds":{"drupalId":"4546","TRLH4":"200000190","TRLH3":"200000087"},"socialNetworks":{"twitter":"http://twitter.com/satoriuslol"},"champions":[],"liveGameTeam":189},{"id":679,"slug":"sebekx","name":"Sebekx","firstName":"Sebastian","lastName":"Smejkal","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/sebekx-7o3gi5db.png","hometown":"","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-02-12T02:20:52.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2880","FRA1TMNT1":"375393","TRNA1":"1000445261","TREU":"1000565030","TRLH4":"1001280002","ESPORTSTMNT02":"200001042"},"socialNetworks":{},"champions":[],"liveGameTeam":111},{"id":686,"slug":"michai","name":"Michai","firstName":"Michael","lastName":"Schorr","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/michai-3datewnf.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2016-06-22T00:17:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4462","FRA1TMNT1":"375385","TRLH4":"1001240020","TRNA1":"1000445253","TREU":"1000565100"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":189},{"id":1112,"slug":"endlesss","name":"Endz","firstName":"Lauri","lastName":"Tarkus","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/endlesss-6u0odt6c.png","hometown":"Estonya","region":"Turkey Championship League","birthdate":null,"createdAt":"2016-01-22T18:37:30.000Z","updatedAt":"2017-06-11T11:57:10.000Z","bios":{"en_US":"","tr_TR":"İsmini ilk olarak Çilekler sayesinde duyduğumuz Endz oldukça ilginç bir oyun tarzına sahip. Şampiyon fark etmeksizin agresif oynamayı kendine görev edinmiş olan Estonyalı oyuncu tek başına takım savaşı kazandırabilecek oyunlar sergileyebiliyor.<br><br>\n \nİyi pozisyon almayı başarabildiği tüm savaşlarda bir nişancıdan beklenenlerin çok daha fazlasını yapmaya başaran Endz’den bu mevsim şaşırtıcı oyunlar görebiliriz.\n"},"foreignIds":{"FRA1TMNT1":"375392","ESPORTSTMNT03":"200001463"},"socialNetworks":{},"champions":[],"liveGameTeam":111},{"id":1113,"slug":"rhuckz","name":"rhuckz","firstName":"Rúben ","lastName":"Neves","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rhuckz-h5bx2iqn.png","hometown":"","region":"CBLOL Brazil","birthdate":null,"createdAt":"2016-01-22T18:38:14.000Z","updatedAt":"2017-05-30T22:14:38.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"385024"},"socialNetworks":{"facebook":"https://www.facebook.com/rhuckz/"},"champions":[],"liveGameTeam":111},{"id":1114,"slug":"tarik","name":"Tarik","firstName":"Tarik","lastName":"Holz","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/tarik-ekgtkpvt.png","hometown":null,"region":"EU CS","birthdate":null,"createdAt":"2016-01-22T18:39:34.000Z","updatedAt":"2016-01-28T13:12:42.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375394"},"socialNetworks":{},"champions":[],"liveGameTeam":111}],"scheduleItems":[{"id":"AVJm-383OPWArxM1l4b3","content":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815:match:88451760-5e31-4ce2-b950-ef953e35e41e","scheduledTime":"2016-01-26T17:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:5","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815","blockLabel":"1","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815:bracket:13c38ece-5735-41d7-a2ff-e6e73921956a"},"match":"88451760-5e31-4ce2-b950-ef953e35e41e","tournament":"8e1965ac-44cf-49af-b157-8865add19815","bracket":"13c38ece-5735-41d7-a2ff-e6e73921956a","league":"5"}],"gameIdMappings":[{"id":"23f6cddf-7e59-4d47-a9cc-976f5bdabb3f","gameHash":"4281be1851bb654b"},{"id":"26483aa7-577f-4d93-a791-d7bd87257660","gameHash":"489e9d531fe19974"}],"videos":[{"id":577,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815:game:23f6cddf-7e59-4d47-a9cc-976f5bdabb3f","source":"https://www.youtube.com/embed/NBIUqZvmYq8?wmode=transparent","createdAt":"2016-01-26T19:36:07.000Z","updatedAt":"2016-01-26T19:36:07.000Z","game":"23f6cddf-7e59-4d47-a9cc-976f5bdabb3f"},{"id":578,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815:game:23f6cddf-7e59-4d47-a9cc-976f5bdabb3f","source":null,"createdAt":"2016-01-26T19:34:47.000Z","updatedAt":"2016-01-26T19:34:47.000Z","game":"23f6cddf-7e59-4d47-a9cc-976f5bdabb3f"},{"id":579,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:8e1965ac-44cf-49af-b157-8865add19815:game:26483aa7-577f-4d93-a791-d7bd87257660","source":"https://www.youtube.com/embed/njK44pODFa8?wmode=transparent","createdAt":"2016-01-26T19:36:07.000Z","updatedAt":"2016-01-26T19:36:07.000Z","game":"26483aa7-577f-4d93-a791-d7bd87257660"}],"htmlBlocks":[],"match":{"id":"88451760-5e31-4ce2-b950-ef953e35e41e","name":"IE-vs-MOU","position":5,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"},{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"}],"games":{"23f6cddf-7e59-4d47-a9cc-976f5bdabb3f":{"id":"23f6cddf-7e59-4d47-a9cc-976f5bdabb3f","name":"G1","generatedName":"IE|MOU|G1|884517605e314ce2b950","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"},{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"}],"standings":{"result":[[{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"}],[{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"}]],"timestamp":1453830438535,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"880017","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:880017","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"26483aa7-577f-4d93-a791-d7bd87257660":{"id":"26483aa7-577f-4d93-a791-d7bd87257660","name":"G2","generatedName":"IE|MOU|G2|884517605e314ce2b950","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"},{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"}],"standings":{"result":[[{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"}],[{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"}]],"timestamp":1453833579900,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"880022","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:880022","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"dd9eb271-347a-4b0a-b360-cfdc3266c8ab"}],[{"roster":"774678be-92d7-48cb-824a-f0fb0d4d55b4"}]],"timestamp":1453833579901,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"dd9eb271-347a-4b0a-b360-cfdc3266c8ab":3,"774678be-92d7-48cb-824a-f0fb0d4d55b4":0}}}