{"teams":[{"id":181,"slug":"isurus-gaming","name":"Isurus Gaming","guid":"be70f742-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/isurus-gaming-93mimfv8.png","acronym":"ISG","homeLeague":"urn:rg:lolesports:global:league:league:24","altLogoUrl":null,"createdAt":"2016-01-18T19:09:51.000Z","updatedAt":"2017-07-24T15:37:12.000Z","bios":{"es_AR":"<p>Isurus Gaming nació en Latinoamérica en el 2013 y ha sido una de las organizaciones más exitosas desde entonces. El equipo tiene un exceso de trofeos en la región, incluyendo tres trofeos de primer lugar en los últimos dos años. El equipo entró al 2017 como una de los alineaciones más estables de la región. Solo cambió de jugadores cuando <strong>Claudio \"Clatos\" Navarrete</strong> se retiró de la escena profesional. Los tiburones también hicieron historia como el primer equipo de LAS en dejar su hogar y visitar Corea. La inversión rindió frutos cuando Isurus ganó el primer lugar en la CLS, y ahora tiene la oportunidad de jugar contra algunos de los mejores equipos del mundo. Con una de las alineaciones más consolidadas que América del Sur tiene para ofrecer, Isurus quiere destacar con su primer boleto al Mid-Season Invitational.</p>","en_US":"<p>Isurus Gaming came to power in the Latin American scene in 2013 and they’ve been one of the most successful organizations since. The team has collected a plethora of trophies in the region including three first place finishes over the last two years. The team came into 2017 with one of the steadiest rosters in the region, only changing players in the jungle after Claudio \"Clatos\" Antonio Navarrete Salazar retired from professional play.</p>\n\n<p>The sharks also made history as the first LAS team to leave their homeland and bootcamp in Korea. The investment paid off as Isurus took the first place crown in the CLS and now have a shot to play against some of the best teams in the world. With one of the most star-studded rosters that Latin America South has to offer, Isurus is looking to make a splash with their first-ever ticket to the Mid-Season Invitational.</p>\n\n<p>Coach: Mark “Ukkyr” Leuenberger</p>","de_DE":"Isurus Gaming etablierte sich 2013 als Macht in Lateinamerika und ist seither eine der erfolgreichsten Mannschaften der Region. Die Mannschaft hat in ihrer Region bereits eine Fülle an Trophäen gewonnen, und konnte sich in den letzten zwei Jahren drei erste Plätze sichern. Isurus Gaming hat sich 2017 nur an einer Position verändert (sie mussten einen neuen Jungler suchen, nachdem Claudio „Clatos“ Antonio Navarrete Salazar seine professionelle Karriere beendet hatte) und gehört damit zu den beständigsten Mannschaften der Region. Außerdem schrieben die Haie als erste LAS-Mannschaft, die ihre Heimat verließ und in Korea trainierte, Geschichte. Die Investition machte sich bezahlt, denn Isurus konnte die CLS gewinnen und hat jetzt die Chance, sich mit den besten Mannschaften der Welt zu messen. Isurus hat die meisten Starts Lateinamerikas (Süd) in seiner Aufstellung und wird versuchen, bei ihrem ersten Auftritt beim Mid-Season Invitational überhaupt, für Furore zu sorgen.","cs_CZ":"","fr_FR":"Isurus Gaming a fait son apparition sur la scène latino-américaine en 2013 et n'a cessé d'engranger les réussites depuis. L'équipe a raflé une pléthore de trophées dans la région et a notamment obtenu trois premières places sur ces deux dernières années. Isurus Gaming a abordé 2017 avec une des formations les plus stables de la région. En effet, seul son jungler a changé après que Claudio « Clatos » Antonio Navarrete Salazar s'est retiré de la scène professionnelle. Les requins ont également marqué l'histoire en étant la première équipe LAS à quitter sa terre natale pour aller s'entraîner en Corée. Et l'investissement a payé : Isurus a remporté la CLS et a maintenant l'opportunité d'affronter certaines des meilleures équipes du monde. Dotée des plus grandes stars d'Amérique latine Sud, Isurus compte bien créer la sensation pour sa toute première participation au Mid-Season Invitational.","pl_PL":"Isurus Gaming zdobyli rozgłos na scenie Ameryki Łacińskiej w 2013 roku i od tamtej pory pozostają jedną z najlepiej sobie radzących organizacji. W ciągu ostatnich dwóch lat drużyna zdobyła szereg nagród w regionie, włącznie z trzykrotnym zajęciem pierwszego miejsca. Drużyna rozpoczęła 2017 rok z jednym z najmocniejszych składów w regionie, zmieniając tylko zawodników w dżungli, po tym jak Claudio „Clatos” Antonio Navarrete Salazar zakończył występy profesjonalne. Rekiny przeszły do historii także jako pierwsza drużyna LAS, która wyjechała z ojczyzny na obóz treningowy w Korei. Inwestycja opłaciła się, gdy Isurus zajęli pierwsze miejsce w CLS, a teraz mają szansę zagrać przeciwko kilku najlepszym drużynom na świecie. Mając jeden z najbardziej gwiazdorskich składów w Ameryce Łacińskiej — Południe, Isurus spróbują narobić szumu i zdobyć swój pierwszy bilet na Mid-Season Invitational","es_ES":"Isurus Gaming ganó protagonismo en la escena latinoamericana en 2013 y, desde entonces, se han convertido en una de las organizaciones más exitosas. El equipo acumula múltiples trofeos regionales; entre ellos, tres primeros puestos en los últimos dos años. El equipo inició la temporada 2017 con una de las plantillas más estables de su región. Solo sustituyeron al jungla, dado que Claudio Antonio ''Clatos'' Navarrete Salazar decidió retirarse de la escena profesional. Los tiburones también hicieron historia como el primer equipo de LAS que abandona su tierra para entrenar en Corea. La inversión dio su fruto, pues Isurus se ha hecho con la corona del primer puesto en la CLS y ahora tendrá la oportunidad de jugar contra algunos de los mejores equipos del mundo. Con una de las plantillas más estelares de Sudamérica, Isurus pretende dejar huella en su primera participación en el Mid-Season Invitational.","pt_BR":"<p>A Isurus Gaming nasceu na América Latina em 2013 e, desde então, tem sido uma das organizações mais bem-sucedidas no meio. A equipe colecionou uma série de troféus na região, incluindo três de primeiro lugar nos últimos dois anos. Em 2017, a Isurus Gaming formou uma das equipes mais estáveis da região, tendo mudado de jogador apenas quando Claudio \"Clatos\" Antonio Navarrete Salazar se aposentou do cenário profissional. Os caras também fizeram história como a primeira equipe da América Latina - Sul a deixar sua terra natal e ir treinar na Coreia. O investimento valeu a pena, pois a Isurus levou o primeiro lugar no CLS e agora tem a chance de enfrentar alguns dos melhores times do mundo. Com uma das seleções mais premiadas que o sul da América Latina tem a oferecer, a Isurus vai tentar deixar sua marca com sua primeira participação no Mid-Season Invitational.</p>"},"foreignIds":{},"players":[1189,1191,1192,1257,1368,2018,2020],"starters":[1189,1191,1192,1257,1368],"subs":[2018,2020]},{"id":191,"slug":"lyon-gaming","name":"Lyon Gaming","guid":"be711156-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lyon-gaming-f9fug4e2.png","acronym":"LYN","homeLeague":"urn:rg:lolesports:global:league:league:30","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lyon-gaming-b7fyn18y.png","createdAt":"2016-01-25T20:39:55.000Z","updatedAt":"2017-05-29T20:53:59.000Z","bios":{"en_US":"<p>Lyon Gaming is one of Latin America’s premier League of Legends organizations. Since their inception in 2013, they have become one of the region’s most respected teams because of their consistent success. In 2016 they came within a game of heading to the World Championship but were ousted by the eventual tournament darlings, Albus NoX Luna. Regardless, 2016 was the most successful year in the organization’s history and 2017 is shaping up to be another record breaker. With their tickets to the 2017 Mid-Season Invitational punched, they’re looking to prove that their loss to Albus NoX was an aberration and that they have what it takes to trade punches with the best teams in the world.</p>\n\n<p>Coach: Rodrigo “Yeti” Del Castillo Diaz</p>","pt_BR":"<p>Lyon Gaming é uma das principais organizações de League of Legends da América Latina. Desde sua fundação, em 2013, eles se tornaram uma das equipes mais respeitadas devido ao seu sucesso consistente. Em 2016 eles ficaram a uma partida de entrar para o Campeonato Mundial, mas foram desclassificados por aqueles que se tornaram os queridinhos do torneio, Albus NoX Luna. Ainda assim, 2016 foi o ano de maior sucesso na história da organização, e 2017 parece destinado a mais recordes. Com passaportes carimbados para o Mid-Season Invitational 2017, eles querem provar que a derrota para Albus NoX foi um ponto fora da curva e que são mais do que capazes de competir entre as melhores equipes do mundo.</p>","es_MX":"","es_AR":"Lyon Gaming es el mejor equipo a nivel competitivo de toda latinoamérica. En 2016 se quedaron a una partida de clasificar para el Mundial, pero la escuadra terminó cayendo ante Albus NoX Luna. Aun así, 2016 fue el año más exitoso en la historia de la organización y en 2017 los leones estarán buscando representar a LAN por primera vez en el Mundial de China. Para ello, tendrán que conseguir su novena copa en nuestra región. ","es_ES":"Lyon Gaming es una de las principales organizaciones de League of Legends de Latinoamérica. Desde su fundación en 2013, se ha convertido en uno de los equipos más respetados de la región gracias a su regularidad. En 2016 se quedó a una sola partida de participar en el Campeonato Mundial, pero Albus NoX Luna, el que acabaría siendo la revelación del torneo, consiguió vencerle. Aun así, 2016 fue el año de mayor éxito de la historia de la organización, y 2017 parece que también será un año en el que batirán más de un récord. Con su puesto en el Mid-Season Invitational 2017 garantizado, están dispuestos a demostrar que su derrota contra Albus NoX fue una excepción y que tienen lo que hace falta para enfrentarse a los mejores equipos del mundo.","pl_PL":"Lyon Gaming to jedna z głównych organizacji League of Legends w Ameryce Łacińskiej. Powstali w 2013 roku i dołączyli do najbardziej cenionych w regionie drużyn. Zapewniły im to stale odnoszone sukcesy. W 2016 roku zabrakło im jednej wygranej gry, by dostać się na Mistrzostwa Świata, ale zostali pokonani przez późniejszych beniaminków turnieju, Albus NoX Luna. Tak czy inaczej, 2016 był najbardziej udanym rokiem w historii organizacji, a 2017 ma szansę stać się kolejnym przełomem. Mając bilet na Mid-Season Invitational 2017, zamierzają pokazać, że przegrana z Albus NoX była wypadkiem przy pracy i wystarczy im ikry, by pójść na wymianę ciosów z najlepszymi drużynami świata.","fr_FR":"Lyon Gaming représente l'une des organisations de League of Legends les plus importantes d'Amérique latine. Depuis ses débuts en 2013, elle est devenue l'équipe la plus respectée de la région en raison de son succès constant. En 2016, elle n'était qu'à une partie de participer au Championnat du monde, mais elle a été éliminée par les futures coqueluches du tournoi, Albus NoX Luna. Quoi qu'il en soit, 2016 a été l'année la plus fructueuse dans l'histoire de cette équipe et 2017 s'annonce également riche en succès. Après avoir obtenu sa qualification pour le Mid-Season Invitational 2017, Lyon Gaming espère prouver que sa défaite face à Albus NoX n'était qu'un coup de malchance et que l'équipe sera à la hauteur face aux meilleures formations internationales.","de_DE":"Lyon Gaming ist eine der besten „League of Legends“-Organisationen Lateinamerikas. Seit ihrer Gründung im Jahr 2013 entwickelte sich Lyon Gaming aufgrund ihres anhaltenden Erfolgs zu einer der angesehensten Mannschaften der Region. 2016 waren sie nur ein Spiel davon entfernt, zur Weltmeisterschaft zu fahren, mussten sich schließlich aber den späteren Publikumslieblingen, Albus NoX Luna, geschlagen geben. Trotzdem war 2016 das erfolgreichste Jahr in der Geschichte der Organisation und 2017 scheint ein weiteres Rekordjahr zu werden. Sie konnten ihr Ticket für das Mid-Season Invitational 2017 bereits lösen, wo sie versuchen werden, allen zu beweisen, dass ihre Niederlage gegen Albus NoX nur ein Ausreißer war und sie es sehr wohl mit den besten Mannschaften der Welt aufnehmen können."},"foreignIds":{},"players":[836,909,1125,1131,1182,1932],"starters":[836,909,1125,1131,1182],"subs":[1932]}],"players":[{"id":836,"slug":"whitelotus","name":"Whitelotus","firstName":"Matías","lastName":"Musso","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whitelotus-h5g2aeh1.png","hometown":"Marcos Juárez, Argentina","region":"LAN","birthdate":"1996-08-27","createdAt":"2015-08-25T15:49:03.000Z","updatedAt":"2017-04-27T22:52:32.000Z","bios":{"pt_BR":"<p>Matías \"WhiteLotus\" Musso começou a jogar League of Legends lá na 2a Temporada, antes de começar sua carreira profissional com a RtN Gaming. Ele chegou à Lyon Gaming em maio de 2016, e a equipe tem sido absolutamente dominante desde então. Com a ajuda de WhiteLotus, a Lyon mandou ver na Temporada de Abertura e nas Eliminatórias do LLN 2017, recebendo um convite para o Mid-Season Invitational 2017 no processo. Amplamente considerado o principal atirador na região LAN, ele é conhecido por ser extremamente agressivo, o que tende a ser uma ótima atitude para seus Campeões preferidos: Kalista, Lucian e Vayne. Ele vai partir para cima das barras de vida dos oponentes quando estrear no estágio internacional contra alguns dos melhores jogadores do mundo no MSI.</p>","en_US":"<p>Matías \"Whitelotus\" Musso started playing League of Legends way back in Season 2 before getting his professional start with RtN Gaming. He made his way to Lyon gaming in May of 2016 and the team has been absolutely dominant since. With the help of WhiteLotus, Lyon tore their way through the 2017 LLN Opening Season and Playoffs netting themselves an invite to the 2017 Mid-Season Invitational in the process. Widely considered to be the top AD Carry in the LAN region, he’s known for being extremely aggressive, which tends to pair exceedingly well with his favorite champions Kalista, Lucian, and Vayne. He’ll be looking to tear through the opposition’s health bars when he hits the international stage against some of the best players in the world at MSI.</p>","es_AR":"<p><strong>Matías \"Whitelotus\" Musso</strong> comenzó a jugar LoL hace un tiempo, en la temporada 2, antes de iniciar su carrera como jugador profesional con RtN Gaming. Llegó a Lyon Gaming en mayo de 2016 y, desde entonces, el equipo ha sido completamente invencible. Con la ayuda de <strong>Whitelotus</strong>, Lyon dominó la temporada de apertura y las eliminatorias del LLN 2017, ganándose así un lugar en el Mid-Season Invitational 2017 en el proceso. <strong>Whitelotus</strong>, generalmente considerado como el mejor tirador de la región LAN, es conocido por ser extremadamente agresivo, cualidad que queda excepcionalmente bien con sus campeones favoritos: Kalista, Lucian y Vayne. Espera con muchas ansias drenar las barras de vida de sus oponentes cuando llegue al escenario internacional y se enfrente a algunos de los mejores jugadores del mundo en el MSI.</p>","pl_PL":"Matías „WhiteLotus” Musso zaczął grać w League of Legends już w drugim sezonie, zanim jeszcze wystartował z profesjonalną karierą w RtN Gaming. W maju 2016 roku przeszedł do Lyon Gaming i od tamtego czasu drużyna absolutnie dominowała. Z pomocą WhiteLotusa Lyon przebili się przez sezon otwierający LLN 2017 i play-offy, zdobywając w efekcie zaproszenie na Mid-Season Invitational 2017. Powszechnie jest uważany za najlepszego prowadzącego w regionie LAN i znany z ekstremalnej agresji, świetnie pasującej do jego ulubionych bohaterów: Kalisty, Luciana i Vayne. Spróbuje zdemolować paski zdrowia przeciwników, gdy wkroczy na międzynarodową arenę MSI, by zagrać przeciwko najlepszym zawodnikom na świecie.v","fr_FR":"Matías « WhiteLotus » Musso a commencé à jouer à League of Legends pendant la saison 2 avant de faire ses débuts sur la scène professionnelle avec RtN Gaming. Il est arrivé chez Lyon en mai 2016 et, depuis, l'équipe est en position dominante. Avec l'aide de WhiteLotus, Lyon s'est frayé un chemin à travers la saison d'ouverture de la LLN 2017 et les play-offs, décrochant au passage une place pour le Mid-Season Invitational 2017. Considéré comme le meilleur carry AD de la région LAN, il est connu pour être extrêmement agressif, ce qui correspond parfaitement à ses champions préférés, Kalista, Lucian et Vayne. Débarquant à présent sur la scène internationale à l'occasion du MSI, il tentera sûrement d'annihiler les jauges de PV de ses adversaires, qui ne seront autre que les meilleurs joueurs du monde."},"foreignIds":{"TRLT3":"200000036"},"socialNetworks":{"facebook":"https://www.fb.com/whitelotuslol","twitch":"http://www.twitch.tv/matimusso96"},"champions":[{"id":128,"playerId":836,"championId":429,"championKey":"Kalista","championName":"Kalista","createdAt":"2015-08-26T11:52:46.000Z","updatedAt":"2017-04-27T22:52:31.000Z"},{"id":317,"playerId":836,"championId":236,"championKey":"Lucian","championName":"Lucian","createdAt":"2016-03-21T19:22:44.000Z","updatedAt":"2017-04-27T22:52:31.000Z"},{"id":318,"playerId":836,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-03-21T19:22:44.000Z","updatedAt":"2017-04-27T22:52:31.000Z"}],"liveGameTeam":191},{"id":909,"slug":"seiya","name":"Seiya","firstName":"Ali","lastName":"Bracamontes","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seiya-8q0ls0yw.png","hometown":"Mexico","region":"LAN","birthdate":"1996-08-06","createdAt":"2015-11-26T17:28:18.000Z","updatedAt":"2017-05-29T20:44:03.000Z","bios":{"en_US":"<p>Ali \"Seiya\" Bracamontes is Lyon’s AD Carry turned mid lane star. Seiya is considered by many to be not only the most well-known player in the region, but the best player in the region hands down. If you need convincing, he ended the 2017 LLN Opening Season with an absolutely bonkers 11.2 KDA. During his time with Lyon Gaming he has won a plethora of championships on his way to becoming the region’s brightest star. Seiya and company punched their tickets to the 2017 Mid-Season Invitational with an emphatic 3-0 win over the Just Toys Havoks, and they’ll need to squeeze out every ounce of his talent as they face off against the best players the planet has to offer.</p>","es_AR":"<p><strong>Ali \"Seiya\" Bracamontes</strong> es la estrella del carril medio. Muchos consideran a <strong>Seiya</strong> no solo el jugador más conocido de la región, sino también el mejor jugador de esta. Si no nos crees, terminó la temporada de apertura del LLN 2017 con un insano 11.2 de KDA. Durante su tiempo con Lyon Gaming ha ganado una gran cantidad de campeonatos en su camino a convertirse en la estrella más brillante de la región. <strong>Seiya</strong> y compañía sellaron su pase al Mid-Season Invitational 2017 con una enfática victoria 3-0 sobre Just Toys Havoks y tendrán que utilizar hasta la última gota de su talento al enfrentarse a los mejores jugadores del planeta.</p>","de_DE":"Der ehemalige AD-Carry, Ali „Seiya“ Bracamontes, ist Lyons neuer Star auf der mittleren Lane. Seiya ist für viele nicht nur der bekannteste Spieler, sondern auch der mit Abstand beste Spieler der Region. Und falls du mir nicht glaubst: Am Ende des Frühjahrs-Splits der LLN 2017 hatte er eine unglaubliche TTU von 11,2. Während seiner Zeit bei Lyon Gaming hat er eine Vielzahl von Meisterschaften gewonnen und wurde zu einem der größten Stars der Region. Seiya und seine Kameraden lösten ihr Ticket für das Mid-Season Invitational 2017 mit einem eindrucksvollen 3–0 Sieg über Just Toys Havoks. Sie werden ihr Talent wieder unter Beweis stellen müssen, wenn sie es mit den besten Spielern des Planeten zu tun bekommen.","es_ES":"Ali ''Seiya'' Bracamontes es el ADC de Lyon convertido en estrella de la calle central. Muchos consideran a Seiya no solo uno de los jugadores más conocidos de la región, sino también el mejor. Por si teníais dudas al respecto, ha conseguido acabar la temporada inicial de la LLN 2017 con un aplastante A/M/A de 11,2 puntos. Durante su etapa con Lyon Gaming ha ganado múltiples campeonatos y se ha convertido en la mayor estrella de su región. Seiya y sus compañeros han logrado asegurarse un puesto en el Mid-Season Invitational 2017 con una asombrosa victoria 3 a 0 contra Just Toys Havoks. Ahora, tendrán que exprimir cada gota de su talento para enfrentarse a los mejores jugadores del planeta.v","fr_FR":"Ali « Seiya » Bracamontes, le carry AD de Lyon, est devenu une star de la voie du milieu. Seiya est considéré par beaucoup comme le joueur le plus célèbre, mais aussi comme le joueur le plus talentueux de la région. Si vous avez besoin d'être convaincu, sachez qu'il a terminé la saison d'ouverture de la LLN 2017 avec un KDA hallucinant de 11,2. Pendant sa carrière chez Lyon Gaming, il a remporté une tonne de championnats jusqu'à devenir la plus grande star de sa région. Seiya et sa formation ont décroché leur ticket pour le Mid-Season Invitational 2017 avec une victoire catégorique de 3-0 contre Just Toys Havoks. Lyon Gaming va devoir exploiter tout le talent de son prodige pour affronter les meilleurs joueurs du monde.","pl_PL":"Ali „Seiya” Bracamontes to prowadzący Lyon, który stał się gwiazdorem środkowej alei. Seiya przez wielu uważany jest nie tylko za jednego z najlepiej znanych zawodników w regionie, ale także wprost za najlepszego zawodnika regionu. Potwierdzeniem tej opinii jest absolutnie obłędny wynik 11,2 Z/Z/A, z którym zakończył sezon otwierający LLN 2017 z. Podczas czasu spędzonego z Lyon Gaming wygrał szereg mistrzostw, by po drodze stać się najjaśniejszą gwiazdą regionu. Seiya i koledzy zdobyli bilety na Mid-Season Invitational 2017 po zdecydowanym zwycięstwie 3−0 z Just Toys Havoks. Ale mierząc się z najlepszymi zawodnikami na świecie, będą musieli maksymalnie wykorzystać jego talent.","pt_BR":"<p>Ali \"Seiya” Bracamontes é o atirador da Lyon que se transformou em estrela do meio. Seiya é considerado por muitos não só o jogador mais conhecido, mas também o melhor jogador da região. Se quiser uma prova, ele acabou a Temporada de Abertura da LLN 2017 com incríveis 11,2 de AMA. No seu período com a Lyon Gaming, ele venceu muitos campeonatos até se tornar a maior estrela da região. Seiya e companhia carimbaram os passaportes para ao Mid-Season Invitational de 2017 com uma vitória devastadora por 3-0 sobre a Just Toys Havoks e terão de usar todo o seu talento quando enfrentarem os melhores jogadores que este planeta tem a oferecer.</p>"},"foreignIds":{"TRLT3":"200000035"},"socialNetworks":{"twitter":"https://twitter.com/SeiyaLoL","twitch":"http://www.twitch.tv/Seeiya","facebook":"https://www.facebook.com/seiyalol/"},"champions":[],"liveGameTeam":191},{"id":1125,"slug":"jirall","name":"Jirall","firstName":"Daniel ","lastName":"del Castillo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jirall-1a2hk96a.png","hometown":null,"region":"LAN","birthdate":null,"createdAt":"2016-01-25T21:10:49.000Z","updatedAt":"2017-05-29T20:51:20.000Z","bios":{"en_US":"<p>Daniel “Jirall” del Castillo is the captain of the dominant Lyon Gaming. Considered the top team in the LAN region, Lyon has dominated their way to yet another championship under Jirall’s command. After beginning his career in the region on Dash9, he made his way to Lyon Gaming who quickly became the team to beat in the region. He offers a steady presence in the top lane, and throughout league play in the 2017 LLN Opening Season he had 14 games where he didn’t die a single time. That’s quite a feat considering how often top laners have to line up as meat shields so that their carries can dice up the enemy team. After their dominant 3-0 thrashing of the Just Toys Havoks, Lyon and Jirall are gearing up to take advantage of their first-ever berth into the Mid-Season Invitational tournament.</p>","es_AR":"<p><strong>Daniel \"Jirall\" Del Castillo</strong> es el capitán del dominante equipo Lyon Gaming. Considerado como el mejor equipo de la región LAN, Lyon no ha encontrado rival en su camino hacia otro campeonato más bajo el mando de Jirall. Después de comenzar su carrera en la región en Dash9, Jirall se abrió paso a Lyon Gaming, que rápidamente se convirtió en el equipo a vencer. Ofrece una presencia estable en el carril superior, y, a lo largo de la temporada de apertura de la LLN 2017, jugó en 14 partidas en donde no murió ni una sola vez. Esto es un verdadero logro considerando la cantidad de veces que los carrileros superiores deben comportarse como escudos de carne para que sus acarreadores puedan acabar con el equipo enemigo. Después de su bien merecido 3-0 contra los Just Toys Havoks, Lyon y Jirall se están preparando para aprovechar su primera aparición en el Mid-Season Invitational.</p>","de_DE":"Daniel „Jirall“ Del Castillo ist Lyon Gamings Teamleiter. Lyon gilt als eine der besten Mannschaft der LAN-Region und konnte sich unter der Führung von Jirall einen weiteren Titel sichern. Jirall begann seine Karriere bei Dash9, wechselte aber bald zu Lyon Gaming, die schnell zum Maß aller Dinge in der Region wurden. Seine Präsenz auf der oberen Lane ist beachtenswert und er schaffte es, zu Beginn der LLN-Saison 2017 14 Spiele lang nicht zu sterben. Das ist eine ziemlich beeindruckende Leistung, wenn man bedenkt, dass die Top-Laner als Schutzschilde für ihre Carrys fungieren müssen. Nach ihrer dominanten Vorstellung beim 3–0 Sieg über Just Toys Havoks bereiten sich Lyon und Jirall darauf vor, ihren Erfolgslauf bei ihrer ersten Teilnahme an einem Mid-Season Invitational fortzusetzen","es_ES":"Daniel ''Jirall'' del Castillo es el capitán del dominante equipo Lyon Gaming. Considerado el mejor equipo de LAN, Lyon ha conseguido asegurarse su participación en otro campeonato gracias al liderazgo de Jirall. Tras comenzar su trayectoria en la región en Dash9, fue fichado por Lyon Gaming, que se convertiría enseguida en el equipo a batir. Proporciona estabilidad en la calle superior, y durante el torneo de la temporada inicial de la LLN 2017 consiguió acumular un total de 14 partidas en las que no murió ni una sola vez. Toda una proeza, considerando la cantidad de veces que los jugadores de la calle superior tienen que servir de escudos humanos para que sus carries hagan pedazos al equipo enemigo. Tras la paliza 3 a 0 que le dieron a Just Toys Havoks, Lyon y Jirall se preparan para aprovechar al máximo su primera visita al Mid-Season Invitational.","fr_FR":"Daniel « Jirall » Del Castillo est le capitaine de l'équipe dominante Lyon Gaming. Considérée comme la meilleure équipe de la région LAN, Lyon a dominé un championnat de plus sous la houlette de Jirall. Après avoir commencé sa carrière dans la région chez Dash9, le joueur s'est frayé un chemin jusqu'à Lyon Gaming qui est vite devenue l'équipe à battre. Il assure une présence stable sur la voie du haut et, lors de la saison d'ouverture de la LLN 2017, il a joué 14 parties sans mourir une seule fois. C'est un véritable exploit quand on considère la fréquence à laquelle les toplaners doivent se sacrifier pour que leurs carrys puissent agresser l'équipe ennemie. Après une victoire écrasante à 3-0 contre Just Toys Havoks, Lyon et Jirall se préparent à présent à tirer profit de leur toute première participation au Mid-Season Invitational.","pl_PL":"aniel „Jirall” Del Castillo jest kapitanem niezłomnych Lyon Gaming. Właśnie do jego komendą Lyon, uważani za najlepszą drużynę regionu LAN, zdobyli kolejny tytuł mistrzowski. Po rozpoczęciu kariery regionalnej w Dash9 Jirall przeszedł do Lyon Gaming, co szybko okazało się strzałem w dziesiątkę. Ten zawodnik zapewnia stałą obecność na górnej alei i w ciągu rozgrywek ligowych w sezonie otwierającym LLN 2017 wziął udział w 14 grach, w których nie zginął ani razu. To spory wyczyn, biorąc pod uwagę, jak często górni muszą przyjmować na siebie rolę żywej tarczy, aby ich prowadzący mogli dobrać się do wrogiej drużyny. Po łomocie (wynik 3-0) spuszczonym Just Toys Havoks, Lyon i Jirall szykują się, by wykorzystać po raz pierwszy zdobyte miejsce na turnieju Mid-Season Invitational.v","pt_BR":"<p>Daniel \"Jirall” Del Castillo é o capitão do jogo dominante da Lyon Gaming. Considerada a melhor equipe na região LAN, Lyon tem sido dominante e conquistou mais um campeonato sob a liderança de Jirall. Após iniciar sua carreira na região com a Dash9, ele subiu de patamar na Lyon Gaming, que logo se tornou a equipe a ser batida. Ele oferece presença constante na rota superior e, durante a Temporada de Abertura da LLN 2017, passou por 14 jogos sem morrer uma vez sequer. É um grande feito se levarmos em conta a frequência com que jogadores na rota superior se apresentam como \"escudo humano” para que os atiradores possam causar estrago na equipe adversária. Após a vitória esmagadora por 3-0 sobre a Just Toys Havoks, Lyon e Jirall estão loucos para fazer e acontecer nesta primeira participação no torneio Mid-Season Invitational.</p>"},"foreignIds":{"TRLT3":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":1131,"slug":"oddie","name":"Oddie","firstName":"Sebastian ","lastName":"Niño","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/oddie-ckwoviyq.png","hometown":null,"region":"LAN","birthdate":null,"createdAt":"2016-01-25T22:06:29.000Z","updatedAt":"2017-05-29T20:44:16.000Z","bios":{"en_US":"<p>Sebastian \"Oddie\" Niño made his way to Lyon Gaming from Dash9 in 2016 with his teammate Daniel “Jirall” Del Castillo. Together they have put together one the most formidable teams in LAN history. In somewhat of an oddity for the region, Oddie has made it to the top ranks of the NA Challenger ladder multiple times, proving that he has the raw skill to hang with some of the best players in the world. He sports 70-100% win rates on his top six most played champions, making him an absolute terror in the jungle when he’s able to get onto one of his comfort picks. Lyon will be relying on Oddie to take his domestic success and translate it into international results as the team travels to Brazil to face off against some of the best teams in the world.</p>","es_AR":"<p><strong>Sebastián \"Oddie\" Niño</strong> también pasó de Dash9 a Lyon en el 2016 con su compañero <strong>Daniel \"Jirall\" Del Castillo</strong>. Juntos son uno de los equipos más formidables en la historia de LAN. <strong>Oddie</strong> llegó a los primeros lugares de la clasificación de Retador NA múltiples veces, demostrando así que tiene la habilidad para estar entre los mejores jugadores del mundo, algo poco común para la región. Tiene una tasa de victorias de entre 70-100% en sus mejores seis campeones, convirtiéndolo en una verdadera pesadilla en la jungla si logra jugar con una de sus elecciones preferidas. Lyon confiará en que <strong>Oddie</strong> pueda tomar su éxito local y llevarlo a la escena internacional cuando su equipo viaje a Brasil para enfrentarse a algunos de los mejores equipos del mundo.</p>","pl_PL":"Sebastián „Oddie” Niño w 2016 roku przeszedł do Lyon Gaming z Dash9 wraz ze swoim kolegą z drużyny, Danielem „Jirall” Del Castillo. Razem stworzyli jedną z najgroźniejszych drużyn w historii LAN. W sposób dość niespodziewany dla tego regionu, Oddie kilkukrotnie zdobywał szczytowe pozycje w rankingu Pretendenta NA, udowadniając, że ma wrodzony talent, który pozwala mu równać się z najlepszymi zawodnikami na świecie. Może pochwalić się wynoszącymi 70-100% wskaźnikami zwycięstw ze swoją szóstką najczęściej wybieranych bohaterów, co sprawia, że staje się prawdziwym koszmarem w dżungli, gdy tylko może wybrać jednego ze swoich ulubieńców. Lyon będą polegali na Oddiem, chcąc wykorzystać sukces lokalny i przekuć go w międzynarodowe osiągnięcia, gdy drużyna wyruszy do Brazylii, by zmierzyć się z kilkoma z najlepszych drużyn na świecie.","fr_FR":"Sebastián « Oddie » Niño est passé de Dash9 à Lyon Gaming en 2016 en même temps que son coéquipier Daniel « Jirall » Del Castillo. Ensemble, ils ont créé l'une des équipes les plus puissantes de l'histoire de l'Amérique latine du Nord. Joueur unique en son genre dans la région, Oddie a déjà atteint le sommet des classements du palier Challenger NA à plusieurs reprises, prouvant qu'il a le talent nécessaire pour se mesurer aux meilleurs joueurs du monde. Il enregistre un taux de victoire de 70-100 % avec ses six champions les plus utilisés, ce qui fait de lui une véritable terreur dans la jungle lorsqu'il parvient à décrocher l'un de ses choix de prédilection. Lyon comptera sur Oddie pour transformer son succès à domicile en une réussite internationale alors que l'équipe se prépare à affronter quelques-unes des meilleures équipes du monde au Brésil.","es_ES":"Sebastián ''Oddie'' Niño se trasladó de Dash9 a Lyon Gaming en 2016 junto a su compañero Daniel ''Jirall'' del Castillo. Juntos han creado uno de los equipos más formidables de la historia de LAN. Oddie ha conseguido ocupar los primeros puestos de la clasificación Aspirante de NA en múltiples ocasiones, algo poco común en su región, y ha demostrado que es lo bastante bueno para enfrentarse a algunos de los mejores jugadores del mundo. Goza de porcentajes de victoria de entre el 70 y el 100 % con sus seis campeones más jugados, lo que lo convierte en un terror en la jungla cuando puede elegir a uno de sus campeones preferidos. Lyon confiará en Oddie para que convierta su éxito local en resultados internacionales en su viaje a Brasil para enfrentarse a algunos de los mejores equipos del mundo.","de_DE":"Sebastián „Oddie“ Niño wechselte zusammen mit seinem Mannschaftskameraden, Daniel „Jirall“ Del Castillo, 2016 von Dash9 zu Lyon Gaming. Zusammen bauten sie eine der beeindruckendsten Mannschaften in der Geschichte der LAN auf. Oddie hat es sogar geschafft, mehrmals die obersten Ränge der nordamerikanischen Herausforderer-Klasse zu erreichen, was beweist, dass er rein vom Können her mit den besten Spielern der Welt mithalten kann. Seine Siegesraten mit seinen sechs meistgespielten Champions liegen zwischen 70 % und 100 %, was ihn zu einer gewaltigen Bedrohung im Dschungel macht, wenn er mit einem seiner Lieblingschampions spielen kann. Lyon wird sich darauf verlassen, dass Oddie seinen regionalen Erfolg auch auf der internationalen Bühne umsetzen kann, wenn die Mannschaft nach Brasilien reist, um sich mit den Besten der Welt zu messen.","pt_BR":"<p>Sebastián \"Oddie\" Niño entrou para a Lyon Gaming vindo da Dash9, em 2016, com seu colega, Daniel \"Jirall” Del Castillo. Juntos, eles montaram uma das equipes mais formidáveis na história de LAN. Em algo atípico para a região, Oddie ficou entre os primeiros lugares no circuito Desafiante da NA diversas vezes, provando que tem habilidade para ficar entre os melhores jogadores do mundo.  Ele apresenta de 70-100% de taxa de vitória com seus seis Campeões mais usados, o que o torna o verdadeiro terror da selva quando tem acesso à suas principais escolhas. Lyon espera que Oddie traduza seu sucesso doméstico em resultados internacionais quando a equipe viajar para enfrentar algumas das melhores equipes do mundo.</p>"},"foreignIds":{"TRLT3":"200000034"},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":1182,"slug":"genthix","name":"Genthix","firstName":"Mariano","lastName":"Polonsky","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/genthix-7iq8zw35.png","hometown":"Argentina","region":"LAN","birthdate":"1990-12-11","createdAt":"2016-03-21T15:59:40.000Z","updatedAt":"2017-05-29T20:50:00.000Z","bios":{"es_AR":"<p><strong>Mariano \"Genthix\" Polonsky</strong> comenzó a jugar LoL profesionalmente en el equipo U Rage Quit. Desde entonces, su carrera lo ha llevado a algunos de los mejores equipos de la región, incluyendo Isurus Gaming y Furious Gaming. Se abrió paso hasta llegar a Lyon Gaming en diciembre de 2016 después de que su soporte principal se retirara de la vida en la Grieta. Su experiencia hizo que se adaptara rápidamente a <strong>Whitelotus</strong> y, juntos, se han convertido en uno de los dúos más imparables de la LLN. Aunque tiene muchísima experiencia en la región, <strong>Genthix</strong> nunca ha asistido a un evento a nivel internacional durante su carrera. La altura de la competencia aumentará en gran medida su nivel, y sus compañeros esperan que pueda guardar la compostura cuando se enfrente a otros dúos de gran categoría en el Mid-Season Invitational 2017 de Brasil.</p>","en_US":"<p>Mariano “Genthix” Polonsky started playing professional League on the team U Rage Quit. Since then his career has taken him to some of the best teams in the region including Isurus Gaming and Furious Gaming. He made his way to Lyon Gaming in December of 2016 after their starting support retired from life on the Rift. His experience made him a quick fit with WhiteLotus, and together they have become one of the most unstoppable duos in the LLN. While his experience in the region is high, he’s never been to an international level event during his career. The level of competition is bound to be a huge level up, and his teammates are going to need him to hold his composure against other top flight duos when they head to the 2017 Mid-Season Invitational in Brazil.</p>","de_DE":"Mariano „Genthix“ Polonsky begann seine professionelle Karriere bei U Rage Quit. Seither hat ihn seine Karriere zu einigen der besten Mannschaften der Region geführt, darunter auch Isurus Gaming und Furious Gaming. Im Dezember 2016 wechselte er schließlich zu Lyon Gaming, nachdem sich deren Supporter aus der Kluft zurückgezogen hatte. Dank seiner Erfahrung gewöhnte er sich schnell an WhiteLotus und zusammen bildeten die beiden ein unaufhaltbares Duo in der LLN. Obwohl er in seiner Region viel Erfahrung gesammelt hat, war er noch nie bei einem internationalen Event. Beim Mid-Season Invitational 2017 in Brasilien wird er es mit ganz anderen Kalibern zu tun bekommen und ihnen die Stirn bieten müssen, wenn er seinen Mannschaftskameraden helfen will.","es_ES":"Mariano ''Genthix'' Polonsky comenzó a jugar profesionalmente a League of Legends en el equipo U Rage Quit. Desde entonces, ha pasado por algunos de los mejores equipos de su región, incluyendo Isurus Gaming y Furious Gaming. Fue fichado por Lyon Gaming en diciembre de 2016, cuando su apoyo titular decidió abandonar la vida en la Grieta. Su experiencia lo convirtió en un apoyo perfecto para WhiteLotus, y juntos se han convertido en uno de los dúos más imparables de la LLN. Aunque cuenta con mucha experiencia en su región, nunca ha asistido a un evento internacional durante su carrera. Todo apunta a que el nivel de esta competición será muy superior, y sus compañeros de equipo necesitarán que mantenga la compostura contra otros grandes dúos que jugarán en el Mid-Season Invitational 2017 de Brasil.","fr_FR":"Mariano « Genthix » Polonsky a fait ses débuts professionnels dans League of Legends avec U Rage Quit. Depuis, sa carrière l'a amené à rejoindre plusieurs des meilleures équipes de la région, dont Isurus Gaming et Furious Gaming. Il est arrivé chez Lyon Gaming en décembre 2016, après que leur support titulaire a pris sa retraite de la Faille. Son expérience aidant, il s'est parfaitement entendu avec WhiteLotus et, ensemble, ils sont devenus l'un des duos les plus implacables de la LLN. Bien que vétéran dans la région, il n'a encore jamais participé à un événement à l'échelle internationale dans toute sa carrière. Au Mid-Season Invitational 2017 au Brésil, le niveau de la compétition sera bien plus élevé, et il devra garder son sang-froid contre d'autres duos de haut vol.","pl_PL":"Mariano „Genthix” Polonsky zaczął grać w profesjonalne League w drużynie U Rage Quit. Od tego czasu drogi jego kariery wiodły przez kilka z najlepszych drużyn regionu, włącznie z Isurus Gaming i Furious Gaming. Przeszedł do Lyon Gaming w grudniu 2016 roku, po tym, jak ich wspierający z pierwszego składu zakończył występy na Summoner’s Rift. Dzięki swojemu doświadczeniu szybko zgrał się z WhiteLotusem i razem stali się jednym z najtrudniejszych do powstrzymania duetów w LLN. Chociaż ma wielkie doświadczenie w regionie, w czasie swojej kariery nigdy nie trafił na wydarzenie w skali międzynarodowej. Teraz poziom rywalizacji znacznie wzrośnie i jego koledzy z drużyny liczą, że zachowa zimne nerwy w walce przeciwko innym doskonałym duetom, gdy wybiorą się na Mid-Season Invitational 2017 w Brazylii.","pt_BR":"<p>Mariano \"Genthix” Polonsky começou a jogar profissionalmente na equipe U Rage Quit. Desde então, sua carreira o levou a algumas das melhores equipes na região, incluindo Isurus Gaming e Furious Gaming. Ele chegou à Lyon Gaming em dezembro de 2016, após o seu primeiro suporte se aposentar do Rift. Sua experiência o ajudou a se encaixar rapidamente com WhiteLotus, e, juntos, eles se tornaram uma dupla implacável na LLN. Apesar de sua grande experiência na região, ele nunca participou de um evento internacional em toda a sua carreira. O nível da competição deve ser ainda mais alto, e seus colegas esperam que ele mantenha o foco contra outras duplas de ponta quando participarem do Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000037"},"socialNetworks":{"facebook":"https://www.facebook.com/Genthixlol","twitch":"https://www.twitch.tv/genthixlol"},"champions":[{"id":255,"playerId":1182,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"},{"id":256,"playerId":1182,"championId":48,"championKey":"Trundle","championName":"Trundle","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"},{"id":257,"playerId":1182,"championId":201,"championKey":"Braum","championName":"Braum","createdAt":"2016-03-21T16:00:53.000Z","updatedAt":"2017-05-29T20:50:00.000Z"}],"liveGameTeam":191},{"id":1189,"slug":"pride","name":"Pride","firstName":"Franco","lastName":"Sanzana","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pride-3wvs6u0n.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1996-05-19","createdAt":"2016-03-21T17:02:40.000Z","updatedAt":"2017-06-19T14:26:31.000Z","bios":{"es_AR":"<p><strong>Franco \"Pride\" Sanzana</strong> comenzó su carrera a finales del 2013, y con el tiempo llegó a Isurus Gaming en el 2015, en donde ha estado desde entonces. Su debut en la CLS no fue exactamente destacado, le llovieron críticas mientras se posicionaba en el carril superior. Pronto se estabilizó y se volvió famoso por su poza de campeones extremadamente amplia. En la temporada regular, <strong>Pride</strong> jugó con 14 campeones diferentes, lo cual le dio a Isurus la flexibilidad que necesitaba para poder quedar en primer lugar en las eliminatorias de la CLS. Su equipo cuenta con su flexibilidad mientras busca la oportunidad de pelear contra los mejores equipos del mundo en el evento principal del Mid-Season Invitational 2017.</p>","en_US":"<p>Franco “Pride” Sanzana started his career in late 2013 and eventually made his way to Isurus Gaming in 2015, where he’s been ever since. His debut in the CLS wasn’t exactly explosive, and he was the subject of criticism as he found his footing in the top lane. He would soon steady out and become renowned for his extremely deep champion pool. Over the regular season, Pride played 14 unique champions which gave Isurus the draft flexibility they needed in order to take home first place in the CLS playoffs. His team will rely on his flexibility as they fight for a chance to play against the best teams in the world at the 2017 Mid-Season Invitational Main Event.</p>","de_DE":"Franco “Pride” Jesús Sanzana Villarroel begann seine Karriere Ende 2013 und wechselte 2015 zu Isurus Gaming, wo er seither spielt. Sein Debüt in der CLS war nicht gerade erfolgreich und er musste sich viel Kritik gefallen lassen, während er sich an seine Rolle als Top-Laner gewöhnte. Dennoch konnte er schnell mit guten Leistungen aufzeigen und ist für seinen extrem umfangreichen Championpool bekannt. Im Verlauf der regulären Saison spielte Pride 14 unterschiedliche Champions und verleiht Isurus dadurch genug Flexibilität, um die Entscheidungsspiele der CLS auf dem ersten Platz zu beenden. Seine Mannschaft wird auch beim Mid-Season Invitational 2017 auf seine Flexibilität setzen, wo sie in der Vorrunde um einen Platz beim Haupt-Event kämpfen.","fr_FR":"Franco « Pride » Jesús Sanzana Villarroel a débuté sa carrière fin 2013 pour finalement intégrer en 2015 Isurus Gaming, où il évolue actuellement. Après des débuts relativement ternes en CLS, il a fait l'objet de nombreuses critiques avant de trouver ses marques sur la voie du haut. Pride a ensuite stabilisé son jeu et est devenu célèbre pour son pool de champions très varié. Lors de la saison régulière, Pride a joué 14 champions différents, donnant ainsi à Isurus une flexibilité qui s'est révélée décisive pour prendre la première place des play-offs de la CLS. Son équipe s'appuiera sans aucun doute sur sa polyvalence dans la lutte qui lui permettra peut-être d'affronter les meilleures équipes du monde lors du Mid-Season Invitational 2017.","es_ES":"Franco Jesús ''Pride'' Sanzana Villarroel comenzó su carrera deportiva al final de 2013 y, finalmente, fue fichado por Isurus Gaming en 2015, donde ha permanecido desde entonces. Su debut en la CLS no fue precisamente explosivo, y tuvo que enfrentarse a las críticas mientras se adaptaba a la calle superior. No obstante, no tardaría en aclimatarse y en hacerse famoso por su gran repertorio de campeones. Durante la temporada regular, Pride jugó con 14 campeones diferentes, lo que proporcionó a Isurus la flexibilidad que necesitaba para hacerse con el primer puesto en los playoffs de la CLS. Su equipo confiará en su flexibilidad cuando compitan por poder enfrentarse contra los mejores equipos del mundo en el evento principal del Mid-Season Invitational 2017.","pl_PL":"Franco „Pride” Jesús Sanzana Villarroel rozpoczął karierę pod koniec 2013 r. i ostatecznie trafił do Isurus Gaming w 2015 r., gdzie gra do tej pory. Jego debiut w CLS nie był szczególnie porywający i zawodnik spotykał się z krytyką, gdy szukał swojego miejsca na górnej alei. Wkrótce nabrał pewności siebie i stał się znany ze swojej niezwykle rozległej puli bohaterów. W toku sezonu zasadniczego Pride grał 14 różnymi bohaterami, co zapewniło Isurus elastyczność wyboru, której potrzebowali, by zabrać do domu nagrodę za zdobycie pierwszego miejsca w play-offach CLS. Drużyna będzie polegała na jego wszechstronności, walcząc o szansę gry przeciwko najlepszym drużynom na świecie podczas głównego wydarzenia na Mid-Season Invitational.","pt_BR":"<p>Franco \"Pride\" Jesús Sanzana Villarroel começou sua carreira no final de 2013 e terminou na Isurus Gaming em 2015, onde está desde então. Sua estreia na CLS não foi exatamente bem-vinda, e ele foi alvo de críticas à medida que se desenvolvia na rota superior. Logo ele se estabeleceu e ficou renomado por sua grande variedade de Campeões. Ao longo da temporada regular, Pride jogou com 14 Campeões diferentes, o que deu à Isurus a flexibilidade de combinações de que precisava para levar para casa o primeiro lugar na CLS. Sua equipe vai confiar em sua flexibilidade enquanto luta por uma chance de jogar contra os melhores do mundo no grande evento do Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLT3":"200000080"},"socialNetworks":{"twitch":"http://www.twitch.tv/frannkiitoo","facebook":"https://www.facebook.com/Frannkiitooop"},"champions":[{"id":273,"playerId":1189,"championId":111,"championKey":"Nautilus","championName":"Nautilus","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"},{"id":274,"playerId":1189,"championId":78,"championKey":"Poppy","championName":"Poppy","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"},{"id":275,"playerId":1189,"championId":33,"championKey":"Rammus","championName":"Rammus","createdAt":"2016-03-21T17:12:15.000Z","updatedAt":"2017-06-19T14:26:31.000Z"}],"liveGameTeam":181},{"id":1191,"slug":"emp","name":"emp","firstName":"Benjamín","lastName":"Ramírez","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/emp-8oj6hyco.png","hometown":"Copiapó, Chile","region":"Copa Latinoamérica Sur","birthdate":"1996-09-17","createdAt":"2016-03-21T17:20:48.000Z","updatedAt":"2017-06-19T14:28:29.000Z","bios":{"es_AR":"<p><strong>Benjamin \"emp\" Ramírez</strong> jugó como tirador antes de pasar al carril central en el 2015. Esa fue la mejor jugada de su carrera, ya que se le considera el mejor carrilero central y hasta el mejor jugador de la CLS. Punto. Su estrategia perfecta junto a su inmensa poza de campeones lo convierten en un letal oponente en cualquier partida. Su amplio conocimiento es considerado como el mejor de la región de Latinoamérica Sur. <strong>Emp</strong> podrá ser el mejor en la CLS, pero está a punto de encontrarse con otro nivel de competencia cuando llegue al escenario internacional del MSI. Dependerá de él guiar a Isurus Gaming mientras pelean por estar en el evento principal en Río.</p>","en_US":"<p>Benjamin “emp” Ramírez played ADC before making the jump to the mid lane in 2015. The move ended up being the best of his career, as he’s widely considered the best mid laner, if not the best player in the CLS -- period. His rock solid mechanics coupled with his ocean-deep champion pool makes him a lethal opponent in any game. His macro knowledge is also applauded as some of the best in the Latin America South region. Emp may be the best in the CLS, but he’s about to find a new level of competition as he hits the international stage at MSI. It’ll be up to him to lead Isurus Gaming as they fight their way to the main event in Rio.</p>","de_DE":"Benjamin „Emp“ Ramírez war AD-Carry, bevor er 2015 auf die mittlere Lane wechselte. Diese Entscheidung erwies sich als die beste seiner Karriere und er gilt heute als einer der besten Mid-Laner, wenn nicht sogar als der beste Spieler der CLS – Punkt. Seine soliden Mechaniken und sein unglaublich großer Championpool machen ihn in jedem Spiel zu einem tödlichen Gegner. Außerdem hat er mit das umfangreichste „Makro“-Wissen aller Spieler Lateinamerikas (Süd). Emp gehört vielleicht zu den besten Spielern der CLS, aber auf der internationalen Bühne des MSI wird er es mit ganz neuen Gegnern zu tun bekommen. Es wird an ihm liegen, Isurus Gaming ins Haupt-Event von Brasilien zu führen.","fr_FR":"Benjamin « Emp » Ramírez jouait Carry AD avant de se lancer sur la voie du milieu en 2015. Ce choix s'est révélé être le meilleur de sa carrière car il est désormais considéré par beaucoup comme le meilleur mid-laner, si ce n'est le meilleur joueur, de la CLS. Ses mécaniques de jeu irréprochables, associées à un pool de champions extrêmement vaste, font de lui un adversaire redoutable en toute situation. Sa connaissance du jeu est, selon certains, sans égale dans la région Amérique latine Sud. Emp est peut-être le meilleur joueur de la CLS, mais il est sur le point de découvrir un niveau de compétition inédit sur la scène internationale du MSI. Isurus Gaming attend beaucoup de lui lors de la phase qualificative de l'événement qui se tiendra au Brésil.","es_ES":"Benjamín ''Emp'' Ramírez jugaba de AD carry antes de trasladarse a la calle central en 2015. Este cambio resultó ser un hito en su carrera, ya que ahora se le considera uno de los mejores mid, si no jugadores, de la CLS. Sus sólidas mecánicas, así como su gran variedad de campeones, lo convierten en un rival letal en cualquier partida. Su conocimiento de la macroestrategia también es aplaudido como uno de los mejores de la región sudamericana. Puede que Emp sea el mejor de la CLS, pero ahora tendrá que enfrentarse a un nuevo nivel competitivo en el escenario internacional del MSI. En sus manos está liderar a Isurus Gaming hasta el evento principal en Río.","pl_PL":"Benjamin „Emp” Ramírez grał jako prowadzący, zanim w 2015 roku przeskoczył na środkową aleję. Ten skok okazał się najlepszym w jego karierze, ponieważ jest powszechnie uważany za najlepszego środkowego, jeśli nie najlepszego zawodnika w CLS. Kropka. Jego doskonałe umiejętności mechaniczne w połączeniu z rozległą jak ocean pulą bohaterów sprawiają, że jest zabójczym przeciwnikiem w każdej grze. Także jego znajomość gry makro chwalona jest jako jedna z najlepszych w regionie Ameryki Łacińskiej — Południe. Emp być może jest najlepszy w CLS, ale wkrótce zasmakuje rywalizacji na nowym poziomie, wchodząc na międzynarodową arenę MSI. To do niego będzie należało prowadzenie Isurus Gaming podczas walki na drodze do najważniejszego starcia w Rio.","pt_BR":"<p>Benjamin \"Emp\" Ramírez jogou como Atirador antes de mudar para a rota do meio em 2015. A mudança acabou sendo a melhor da sua carreira, pois ele é amplamente considerado o melhor meio, se não o melhor jogador de todos, na CLS e ponto. Sua mecânica extremamente sólida junto com sua seleção de Campeões bastante ampla faz dele um adversário letal em qualquer jogo. Seu conhecimento global também é tido como um dos melhores na região sul da América Latina. Emp pode ser o melhor da CLS, mas está prestes a se deparar com um novo nível de competição no palco internacional do MSI. Ele será o responsável por liderar a Isurus Gaming enquanto lutam por uma vaga no grande evento no Rio.</p>"},"foreignIds":{"TRLT3":"200000081"},"socialNetworks":{"twitch":"http://www.twitch.tv/empl0l","facebook":"https://www.facebook.com/Empl0l"},"champions":[{"id":279,"playerId":1191,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"},{"id":280,"playerId":1191,"championId":7,"championKey":"Leblanc","championName":"LeBlanc","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"},{"id":281,"playerId":1191,"championId":42,"championKey":"Corki","championName":"Corki","createdAt":"2016-03-21T17:23:22.000Z","updatedAt":"2017-06-19T14:28:29.000Z"}],"liveGameTeam":181},{"id":1192,"slug":"newbie","name":"Newbie","firstName":"Leandro","lastName":"Marcos","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/newbie-40l0fj6e.png","hometown":"La Rioja, Argentina","region":"Copa Latinoamérica Sur","birthdate":"1997-01-16","createdAt":"2016-03-21T17:27:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z","bios":{"es_AR":"<p><strong>Leandro \"Newbie\" Marcos</strong> no es ningún novato, aunque su apodo lo sugiera. De hecho, fue el primer jugador latinoamericano en legar al nivel de Retador en el famoso e implacable servidor coreano. Como la mayoría de los jugadores en su equipo, tiene una amplia poza de campeones que le otorga una enorme flexibilidad en la fase de bloqueos. Aunque se siente cómodo con casi todo, destaca cuando cosecha almas con Thresh. Su absurda tasa de victorias del 89% con el Carcelero Implacable lo vuelve una fuerza que temer cuando se encuentra entre la espada y la pared. El entrenamiento de <strong>Newbie</strong> en Corea del Sur lo volvió el mejor soporte de la CLS. Quiere llevar su Sentencia de Muerte a la competencia mientras Isurus Gaming viaja a Brasil para enfrentar su más grande desafío contra los mejores oponentes internacionales en el MSI.</p>","en_US":"<p>Leandro “Newbie” Marcos is about as far from a “newbie” as it gets. In fact, he was the first Latin American player to climb to Challenger Tier on the notoriously ruthless Korean server. Like most players on his team, he sports a deep champion pool that has given them huge amounts of flexibility in the drafting phase. While he feels comfortable on almost anything, he excels at reaping souls on Thresh. His ludicrous 89% win rate on the Chain Warden makes him a force to be reckoned with every time it's locked in for him. Newbie’s training in South Korea has led to him being called the clear cut best support in the CLS. He’s looking to give a Death Sentence to the competition as Isurus Gaming travel to Brazil and face their biggest challenge yet against top-flight international competition at MSI.</p>","de_DE":"Leandro „Newbie“ Marcos ist alles andere als ein Neuling. Er war der erste lateinamerikanische Spieler, der auf dem erbarmungslosen koreanischen Server die Herausforderer-Klasse erreichte. Wie die meisten Spieler aus seiner Mannschaft kann auch er auf einen umfangreichen Championpool zurückgreifen, dank dem er bei der Championauswahl sehr flexibel ist. Obwohl er mit so gut wie jedem Champion zurechtkommt, liefert er mit Thresh überragende Leistungen ab. Seine unglaubliche Siegesrate von 89 % mit dem Kettenwächter macht ihn zu einer Urgewalt, wenn er ihn auswählen kann. Newbies Training in Südkorea hat dazu geführt, dass er als bester Supporter der CLS gilt. Er wird versuchen, das Todesurteil für seine Gegner zu sein, wenn Isurus Gaming nach Brasilien reist und sich dort auf der internationalen Bühne des MSI seiner bisher größten Herausforderung stellt.","fr_FR":"Leandro « Newbie » Marcos n'a en réalité pas grand-chose à voir avec un « newbie ». En fait, c'est même le premier joueur latino-américain à avoir atteint le palier Challenger sur l'impitoyable serveur coréen. Comme la plupart des joueurs de son équipe, il peut se targuer d'un vaste pool de champions qui donne à son équipe une grande flexibilité lors de la sélection. S'il est à l'aise avec quasiment tous les champions, il excelle dans le fauchage d'âmes avec Thresh. Son incroyable taux de victoires de 89 % avec le Garde aux chaînes fait de lui un adversaire mortel chaque fois qu'il joue ce personnage. L'entraînement de Newbie en Corée du Sud l'a conduit à être considéré comme le meilleur support de la CLS. Newbie aimerait bien être un acteur décisif de la victoire de son équipe au Brésil, là où Isurus Gaming devra relever son plus grand défi face à la crème de la compétition internationale, lors du MSI.","es_ES":"Leandro ''Newbie'' Marcos no es tan novato como su nombre sugiere. De hecho, fue el primer jugador latinoamericano que subió al nivel Aspirante en el famoso y despiadado servidor coreano. Como la mayoría de los jugadores de su equipo, es capaz de jugar con campeones muy dispares, lo que le aporta una gran flexibilidad a la hora de crear la composición del equipo. Aunque se siente cómodo con casi cualquier campeón, su habilidad para cosechar almas con Thresh es inmejorable. Su ridículo porcentaje de victorias del 89 % con el Carcelero Implacable lo convierte en un rival a tener en cuenta cada vez que selecciona. Los entrenamientos de Newbie en Corea del Sur han hecho que se convierta, sin lugar a dudas, en el mejor apoyo de la CLS. Ya está preparado para sentenciar a muerte a sus rivales en el viaje a Río de Isurus Gaming, donde se enfrentará a su mayor reto hasta la fecha contra los mejores rivales internacionales en el MSI.","pl_PL":"Leandro „Newbie” Marcos pod żadnym względem nie jest „żółtodziobem”. Prawdę mówiąc, był pierwszym latynoamerykańskim zawodnikiem, który dotarł do Kręgu Pretendenta na bezlitosnym serwerze koreańskim. Podobnie jak większość zawodników w jego drużynie dysponuje szeroką pulą bohaterów, co zapewnia zespołowi dużą elastyczność w fazie wyboru. Chociaż czuje się pewnie niemal z dowolnym bohaterem, najlepiej mu idzie koszenie dusz z Threshem. Ze względu na jego obłędny, wynoszący 89% wskaźnik zwycięstw ze Strażnikiem Łańcuchów, trzeba się z nim liczyć za każdym razem, gdy wybierze tego bohatera. Po treningu w Korei Południowej Newbie zaczął być nazywany zdecydowanie najlepszym wspierającym w CLS. Zamierza wydać Wyrok Śmierci na rywali, gdy Isurus Gaming wyruszą do Brazylii, by zmierzyć się ze swoim największym jak dotąd wyzwaniem w walce przeciwko najlepszym międzynarodowym przeciwnikom na MSI.","pt_BR":"<p>Conheça Leandro \"Newbie\" Marcos, que de newbie não tem nada. De fato, ele foi o primeiro jogador latino-americano a chegar no nível Desafiante no infame e brutal servidor coreano. Assim como a maioria dos jogadores de sua equipe, ele controla uma ampla variedade de Campeões, o que lhe dá imensa flexibilidade na fase de seleção. Embora fique confortável com quase tudo, ele se destaca mesmo ao ceifar almas com o Thresh. Sua inacreditável taxa de vitórias de 89% com o Guardião das Correntes faz dele uma força implacável sempre que é sua vez em jogo. O treinamento de Newbie na Coreia do Sul lhe rendeu o indisputado título de melhor suporte na CLS. Ele vai tentar Sentenciar a concorrência com a Isurus Gaming, enfrentando seu maior desafio contra competidores internacionais de primeira categoria no MSI.</p>"},"foreignIds":{"TRLT3":"200000082"},"socialNetworks":{"facebook":"https://www.facebook.com/GGnewbie","twitch":"https://www.twitch.tv/newbiesupp"},"champions":[{"id":285,"playerId":1192,"championId":40,"championKey":"Janna","championName":"Janna","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"},{"id":286,"playerId":1192,"championId":201,"championKey":"Braum","championName":"Braum","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"},{"id":287,"playerId":1192,"championId":48,"championKey":"Trundle","championName":"Trundle","createdAt":"2016-03-21T17:29:41.000Z","updatedAt":"2017-06-19T14:21:47.000Z"}],"liveGameTeam":181},{"id":1257,"slug":"qqmore","name":"QQmore","firstName":"Diego","lastName":"Apablaza","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/qqmore-fpnz3ic2.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1999-05-03","createdAt":"2016-05-17T20:38:02.000Z","updatedAt":"2017-06-19T14:27:29.000Z","bios":{"es_AR":"<p><strong>Diego \"QQmore\" Apablaza</strong> es uno de los jugadores más jóvenes de la CLS con tan solo 17 años de edad. Comenzó su carrera a mediados del 2016, se unió a Isurus Gaming como sustituto, pero después de la partida del junglero estrella <strong>Claudio \"Clatos\" Navarrete</strong>, QQmore llegó al estrellato... y estaba preparado para ello. En la temporada de Apertura de la CLS del 2017, se volvió famoso por su agresivo estilo de juego, lo cual le consiguió el mejor promedio de asesinatos y muertes y oro por minuto que cualquier otro junglero en la liga. Al parecer, el joven tenía cosas que enseñarles a sus mayores. Lo más impresionante es que aún le quedan años para que mejore su estrategia. ¡Isurus confiará en su agresiva y joven arma para que los lleve a la victoria en el Mid-Season Invitational 2017 de Brasil!</p>","en_US":"<p>Diego \"QQMore\" Apablaza is one of the youngest players in the CLS at just 17 years old. He started his career in mid-2016, joining Isurus Gaming as a substitute, but after the departure of starting jungler Claudio \"Clatos\" Antonio Navarrete Salazar, QQMore was thrust into the spotlight -- and he was ready for it. In the 2017 CLS Opening Season he became notorious for his aggressive style of jungling, which lead to him having the best KDA and GPM of any jungler in the league. It seemed that the youngster had a thing or two to teach his elders. The most impressive part is that he’s still got years left to grow his game. Isurus will be relying on their aggressive young gun to help carry them to victory at the 2017 Mid-Season Invitational in Brazil!</p>","de_DE":"Diego „QQMore“ Apablaza Abarzúa ist mit seinen 17 Jahren einer der jüngsten Spieler der CLS. QQMore begann seine Karriere Mitte 2016 als Ersatzspieler bei Isurus Gaming, aber nach dem Abgang von Claudio „Clatos“ Antonio Navarrete Salazar rückte er plötzlich ins Rampenlicht – und er war mehr als nur bereit. Zu Beginn der Saison 2017 machte er sich mit seinem aggressiven Spielstil im Dschungel einen Namen und hatte die beste TTU und das meiste GPM aller Jungler der Liga. Es hatte den Anschein, als könnten die erfahrenen Spieler noch das ein oder andere von ihm lernen. Und das Beeindruckendste daran ist, dass er sich in den nächsten Jahren noch weiter verbessern kann. Isurus verlässt sich darauf, dass ihr aggressiver, junger Jungler sie beim Mid-Season Invitational 2017 in Brasilien von einem Sieg zum nächsten führen wird!","fr_FR":"Âgé de 17 ans à peine, Diego « QQMore » Apablaza Abarzúa est l'un des plus jeunes joueurs des CLS. Il a débuté sa carrière courant 2016 comme remplaçant au sein d'Isurus Gaming. Suite au départ du jungler titulaire Claudio « Clatos » Antonio Navarrete Salazar, QQMore s'est vu propulsé sur le devant de la scène, une opportunité à laquelle il était préparé. Lors de la saison d'ouverture des CLS 2017, il s'est fait remarquer pour son style de jungler agressif, une qualité de jeu qui lui a valu les meilleures statistiques de KDA et de PO par minute du championnat. Visiblement, le jeunot avait deux ou trois choses à apprendre à ses aînés. Mais ce qui impressionne surtout, c'est qu'il a encore des années devant lui pour développer son jeu. Isurus pourra compter sur la fougue et l'agressivité de ce jeune joueur pour tenter de triompher lors du Mid-Season Invitational 2017 au Brésil !","pl_PL":"Diego „QQMore” Apablaza Abarzúa jest jednym z najmłodszych zawodników CLS. Ma zaledwie 17 lat. Rozpoczął karierę w połowie 2016 roku, dołączając do Isurus Gaming jako rezerwowy, ale po odejściu dżunglera pierwszego składu, Claudio „Clatos” Antonio Navarrete Salazara, QQMore wkroczył w światła jupiterów — i był na to gotowy. W sezonie otwierającym CLS 2017 zasłynął ze swojego agresywnego stylu dżunglowania, dzięki któremu uzyskał najlepsze Z/Z/A i wskaźnik złota na minutę wśród wszystkich dżunglerów w lidze. Wydaje się, że młodzik może nauczyć starszych tego i owego. Najbardziej imponujące jest to, że wciąż ma przed sobą wiele lat na rozwój umiejętności w grze. Isurus będą polegali na swoim agresywnym młodym zawadiace, licząc na to, że pomoże im osiągnąć zwycięstwo na Mid-Season Invitational 2017 w Brazylii!","es_ES":"Diego ''QQMore'' Apablaza Abarzúa, con tan solo 17 años de edad, es uno de los jugadores más jóvenes de la CLS. Comenzó su trayectoria profesional a mitad de 2016, cuando se unió a Isurus Gaming como suplente. No obstante, no sería hasta la retirada del jungla titular, Claudio Antonio ''Clatos'' Navarrete Salazar, que QQMore se convertiría en el protagonista. Y estaba más que preparado para serlo. En la temporada inicial de la CLS 2017, se ha hecho notar por su estilo agresivo en la jungla, lo que le ha permitido conseguir el mejor A/M/A y la mejor media de oro por minuto de todos los junglas de la liga. Parece que el más joven tiene un par de cosas que enseñarles a los más veteranos. Lo más impresionante es que aún le quedan años para seguir mejorando. Isurus confiará en el estilo agresivo de su jugador más joven para hacerse con la victoria en el Mid-Season Invitational 2017 en Brasil.","pt_BR":"<p>Diego \"QQMore\" Apablaza Abarzúa é um dos jogadores mais jovens no CLS, com apenas 17 anos. Ele iniciou sua carreira na metade de 2016, juntando-se à Isurus Gaming como substituo. Porém, depois da partida do caçador inicial, Claudio \"Clatos\" Antonio Navarrete Salazar, QQMore foi lançado sob os holofotes - e estava preparado para isso. Na Temporada de Abertura do CLS 2017, ele ficou em destaque por seu estilo agressivo de jogo na selva, o que o levou a ter as melhores médias de AMA e OPM de todos os caçadores na liga. Parece que o jovem tinha algo a ensinar aos mais velhos. O mais impressionante é que ele ainda tem vários anos para se desenvolver no jogo. Em todo caso, a Isurus acredita que essa força jovem e agressiva possa levá-los à vitória no Mid-Season Invitational 2017 no Rio!</p>"},"foreignIds":{"TRLT3":"200000018"},"socialNetworks":{"facebook":"https://www.facebook.com/qqamor/"},"champions":[{"id":381,"playerId":1257,"championId":203,"championKey":"Kindred","championName":"Kindred","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"},{"id":382,"playerId":1257,"championId":76,"championKey":"Nidalee","championName":"Nidalee","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"},{"id":383,"playerId":1257,"championId":60,"championKey":"Elise","championName":"Elise","createdAt":"2016-05-17T20:42:41.000Z","updatedAt":"2017-06-19T14:27:29.000Z"}],"liveGameTeam":181},{"id":1368,"slug":"kindless","name":"Kindless","firstName":"Benjamín","lastName":"Fuenzalida","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kindless-cgp6i7ju.png","hometown":"Santiago, Chile","region":"Copa Latinoamérica Sur","birthdate":"1998-07-17","createdAt":"2016-06-13T19:10:32.000Z","updatedAt":"2017-06-19T14:27:25.000Z","bios":{"en_US":"<p>Benjamín \"Kindless\" Fuenzalida is Isurus Gaming’s newest addition to the roster. This addition proved to be fruitful, as Kindless has quickly become one of the best marksmen in the CLS. He can switch up his style in order to meet the demands of the draft while still dishing out consistent damage on whatever champion he happens to get. Need some long range initiation? Pick up the artsy murderer, Jhin. How about consistent damage throughout sustained teamfights? Grab him Ezreal and those Mystic Shots chunk enemy health bars. Kindless will face his biggest test yet, as he faces off against some of the best marksmen on the planet. He’ll have his work cut out for him, but there’s few better ways to test your mettle than at the Mid-Season Invitational. Will he step up? We’re about to find out.</p>","es_AR":"<p><strong>Benjamín \"Kindless\" Fuenzalida</strong> es el nuevo miembro de la alineación de Isurus Gaming. Rindió frutos, ya que <strong>Kindless</strong> se convirtió rápidamente en uno de los mejores tiradores de la CLS. Puede cambiar su estilo para lidiar con las demandas de la batalla mientras inflige un daño consistente con cualquier campeón que utiliza. ¿Necesitas una iniciación a distancia? Utilizará al artista sanguinario Jhin. ¿Qué hay del daño consistente para peleas en equipo prolongadas? Usa a Ezreal y a esos Disparos Místicos para masacrar las barras de vida del enemigo. <strong>Kindless</strong> enfrentará su mayor reto al pelear contra los mejores tiradores del planeta. No le será sencillo, pero no hay mejor forma de demostrar la valía que en el Mid-Season Invitational. ¿Lo logrará? Vamos a averiguarlo.</p>","de_DE":"Benjamín „Kindless“ Fuenzalida Barrera ist das neueste Mitglied von Isurus Gaming. Und dieser Neuzugang erwies sich als äußerst ergiebig, denn Kindless wurde schnell zu einem der besten Schützen der CLS. Er kann seinen Stil ändern, um sich an die Anforderungen der Auswahl anzupassen und gleichzeitig mit jedem Champion, den er in die Finger bekommt, Schaden verursachen. Fehlt ein Initiator aus der Ferne? Dann spielt er den künstlerischen Mörder Jhin. Wie wäre es mit regelmäßigem Schaden in langanhaltenden Teamkämpfen? Überlass ihm Ezreal und er wird die Lebensbalken der Gegner mit „Mystischer Schuss“ bearbeiten. Kindless steht vor seiner größten Herausforderung, denn er bekommt es mit ein paar der besten Schützen des Planeten zu tun. Er wird alle Hände voll zu tun haben, aber es gibt kaum eine bessere Möglichkeit, um sein Können unter Beweis zu stellen, als das Mid-Season Invitational. Wird er sich in den Vordergrund spielen? Wir werden es bald herausfinden.","fr_FR":"Benjamín « Kindless » Fuenzalida Barrera est le dernier joueur à avoir rejoint la formation d'Isurus Gaming. Ce nouvel élément s'est révélé précieux, car Kindless est rapidement devenu l'un des meilleurs tireurs de la CLS. Capable de changer de style pour répondre aux contraintes de la sélection, il parvient toujours à infliger des dégâts constants, quel que soit le champion avec lequel il joue. Vous avez besoin d'engager le combat à distance ? Il prendra l'assassin virtuose, Jhin. Vous voulez infliger des dégâts constants dans des combats d'équipes prolongés ? Il prendra Ezreal pour saper la jauge de PV de l'ennemi avec des Tirs mystiques. Kindless se retrouve aujourd'hui face à son plus grand test, un défi qui l'opposera aux meilleurs tireurs de la planète. La tâche sera difficile, mais il existe peu de meilleures opportunités que le Mid-Season Invitational pour prouver son talent. Sera-t-il à la hauteur ? Nous sommes sur le point de le découvrir.","pl_PL":"Benjamín „Kindless” Fuenzalida Barrera to najnowszy nabytek w składzie Isurus Gaming. Ten nabytek okazał się strzałem w dziesiątkę, ponieważ Kindless szybko stał się jednym z najlepszych strzelców w CLS. Potrafi dostosować swój styl gry do wymogów wyboru, wciąż zadając konkretne obrażenia dowolnym bohaterem, który mu się trafi. Potrzeba inicjacji z dystansu? Wybierzcie dla niego artystycznego mordercę, Jhina. A co ze stałymi obrażeniami w ciągu długotrwałej walki drużynowej? Dajcie mu Ezreala, a Mistyczne Strzały nadszarpną zdrowie na paskach wrogów. Kindlessa czeka największa próba jak do tej pory, ponieważ zmierzy się z kilkoma najlepszymi strzelcami na świecie. Czeka go sporo roboty, ale trudno o lepszą próbę umiejętności niż Mid-Season Invitational. Czy da sobie radę? Niedługo się przekonamy.","es_ES":"Benjamín ''Kindless'' Fuenzalida Barrera es el fichaje más reciente de Isurus Gaming. Este fichaje ha dado sus frutos, pues Kindless se ha convertido rápidamente en uno de los mejores tiradores de la CLS. Es capaz de adaptar su estilo según las necesidades del equipo, al mismo tiempo que inflige daño constante con cualquier campeón con el que juegue. ¿Hace falta iniciar combates a distancia? Para eso está el artístico asesino Jhin. ¿Hace falta infligir daño constante en combates de equipo prolongados? Dadle a Ezreal y él se encargará de que sus Disparos místicos acaben con la barra de vida de los enemigos. A Kindless le toca superar su prueba más difícil hasta la fecha, pues tendrá que verse las caras con algunos de los mejores tiradores del planeta. No será una tarea fácil, pero existen pocos escenarios mejores para poner a prueba su destreza que el del Mid-Season Invitational. ¿Superará la prueba? Pronto lo descubriremos.","pt_BR":"<p>Benjamín \"Kindless\" Fuenzalida Barrera é o mais novo integrante da Isurus Gaming. Este acréscimo acabou sendo frutífero, pois Kindless rapidamente virou um dos melhores atiradores na CLS. Ele muda o estilo de jogo para se adaptar às demandas da composição das equipes ao mesmo tempo em que causa danos consistentes com o campeão que vier. Precisa de uma iniciação à distância? Pegue o assassino artista, Jhin. E que tal danos consistentes nos longos confrontos de equipe? Vá de Ezreal, que aqueles Disparos Místicos acabam com a barra de vida dos inimigos. Kindless vai enfrentar seu maior desafio até agora, pois vai competir com alguns dos melhores atiradores do mundo. Não vai ser uma tarefa fácil, mas há poucas maneiras melhores de testar sua coragem do que no Mid-Season Invitational. Será que ele vai ficar à altura? É o que vamos descobrir.</p>"},"foreignIds":{"TRLT3":"200000019"},"socialNetworks":{},"champions":[],"liveGameTeam":181},{"id":1932,"slug":"mariome","name":"MarioMe","firstName":"Mario","lastName":"Reyes","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":"Liga Latinoamerica Norte","birthdate":null,"createdAt":"2017-05-29T16:23:03.000Z","updatedAt":"2017-05-29T21:03:15.000Z","bios":{"en_US":"","es_AR":"Con apenas 23 años de edad, Mario ‘MarioMe’ Reyes estudiaba Medicina en la Universidad Autónoma de Nuevo León, donde al mismo tiempo se coronó bicampeón del Campeonato Intercolegial Mexicano. Esto lo convierte en el primer jugador salido del torneo Universitario en conseguir la transición a un equipo de la máxima competición. En Lyon Gaming, ‘el doctor’ tendrá la oportunidad de cultivarse como un jugador rodeado del mejor equipo de toda Latinoamérica. "},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":191},{"id":2018,"slug":"aioros","name":"Aioros","firstName":"Bruno","lastName":"Romero","roleSlug":"support","photoUrl":null,"hometown":null,"region":"Copa Latinoamérica Sur","birthdate":null,"createdAt":"2017-06-19T14:30:47.000Z","updatedAt":"2017-06-19T14:30:47.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":181},{"id":2020,"slug":"ankor","name":"Ankor","firstName":"Gabriel","lastName":"Toro","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"Copa Latinoamérica Sur","birthdate":null,"createdAt":"2017-06-19T16:02:49.000Z","updatedAt":"2017-06-19T16:02:49.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":181}],"scheduleItems":[{"id":"AVuhncYAoUG4HPFjOKNv","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:891bd1c6-0151-4a33-92ae-f84cee8b7e24","scheduledTime":"2017-04-29T22:00:00.238+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:c71dc70f-b5df-41c5-83e1-2ba4d29a1759","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"891bd1c6-0151-4a33-92ae-f84cee8b7e24","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"c71dc70f-b5df-41c5-83e1-2ba4d29a1759","league":"10"}],"gameIdMappings":[{"id":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01","gameHash":"5ae0bd3be1754236"}],"videos":[{"id":6726,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:822e60ed-fd57-42cc-bfc5-d396a7b4ca01","source":"https://www.youtube.com/embed/gznjfDBA7nc","createdAt":"2017-04-30T00:31:11.000Z","updatedAt":"2017-04-30T00:31:11.000Z","game":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01"},{"id":6728,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:822e60ed-fd57-42cc-bfc5-d396a7b4ca01","source":"https://www.youtube.com/watch?v=D9IIODj3uqQ&wmode=transparent","createdAt":"2017-04-30T01:16:45.000Z","updatedAt":"2017-04-30T01:16:45.000Z","game":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01"},{"id":6730,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:822e60ed-fd57-42cc-bfc5-d396a7b4ca01","source":"https://www.youtube.com/embed/VYplZ7zqIg8?wmode=transparent","createdAt":"2017-04-30T01:21:17.000Z","updatedAt":"2017-04-30T01:21:17.000Z","game":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01"},{"id":6943,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:822e60ed-fd57-42cc-bfc5-d396a7b4ca01","source":"https://www.youtube.com/embed/yvxd3jqCaX0","createdAt":"2017-05-29T03:34:43.000Z","updatedAt":"2017-05-29T03:34:43.000Z","game":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01"}],"htmlBlocks":[],"match":{"id":"891bd1c6-0151-4a33-92ae-f84cee8b7e24","name":"LYN-vs-ISG","position":2,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"},{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}],"games":{"822e60ed-fd57-42cc-bfc5-d396a7b4ca01":{"id":"822e60ed-fd57-42cc-bfc5-d396a7b4ca01","name":"G1","generatedName":"ISG|LYN|G1|891bd1c601514a3392a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"},{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}],"standings":{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1496029086744,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493515196435,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493512481778,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493509107110,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"130180","gameRealm":"TRLT3","platformId":"TRLT3:130180","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1496029086744,"source":"bestOf","history":[{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493515196436,"source":"bestOf","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493512481779,"source":"bestOf","closed":true},{"result":[[{"roster":"eb64b3e7-aee3-4b7c-929c-c33a11087921"}],[{"roster":"6b377edd-527d-4e1f-897c-1cafe2373a5c"}]],"timestamp":1493509107111,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"eb64b3e7-aee3-4b7c-929c-c33a11087921":1,"6b377edd-527d-4e1f-897c-1cafe2373a5c":0}}}