{"teams":[{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]},{"id":167,"slug":"nrg-esports","name":"NRG Esports","guid":"be704c38-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/nrg-esports-2hxi3sw4.png","acronym":"NRG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:14:08.000Z","updatedAt":"2016-09-17T19:38:10.000Z","bios":{"de_DE":"<p>„NRG“ ist ein sogenanntes Gramogramm, eine Verkettung aus Buchstaben, die einzeln ausgesprochen zusammen wie ein Wort klingen – In diesem Fall ist dies das englische Wort Energy. Energiegeladen ist das Team allemal, wenn man sich dessen fünf Spieler anschaut. Ende 2015 wurde das Team unter der Führung von Gerard Kelly, Mark Mastrov, und Andy Miller gegründet, mit dem Ziel die Spitze der NA LCS zu erreichen und schließlich zur Weltmeisterschaft 2016 zu fahren. NRG ist keine Organisation, welche sich mithilfe von jungen Einzelranglistentalenten durch die NA Challenger Series gekämpft hat. Vielmehr besteht das Team aus altbackenen Veteranen, wilden Grünschnabel und etwas mittendrin. </p>\t\n\n<p>Eon-Young “Impact” Jeong und Changseok „GBM“ Lee sind zum einen die gebürtigen Koreaner und zum anderen die alten Herren unter den fünf Freunden. Sie haben viele Jahre Erfahrung auf dem Buckel und weisen den Schülern ihren Weg durch ihre eSports-Karriere. Johnny „Altec“ Ru spielte seit 2012 bereits unter vielen Bannern, doch einen internationalen Namen konnte er sich bisher noch nicht machen. An der Seite der zweieinhalb Veteranen stehen Galen „Moon“ Holgate und Kevin „KonKwon“ Kwon, welche noch im LCS-Rampenlicht zu stehen haben, zumindest mehr als vier Spiele. </p>\n\n<p>Auch das Team ist der Community nicht unbekannt. Tadayoshi \"Hermit\" Littleton war im Sommer 2015 noch der Analyst und Trainer Origens und ist nun der Strategiechef bei seinem neuen Zuhause. Charlie „Charlie“ Lipsie, ehemaliger Cloud9-Analyst besetzt die Cheftrainerstelle und Chad \"HISTORY TEACHER\" Smeltz hat seine Streaming-Persönlichkeit aufgegeben, um nun als NRGs Geschäftsführer zu fungieren. </p>\n\n<p>Die Frage ist wie bei vielen Mannschaften verschiedener Sprachen: Wie kommunizieren die Spieler eigentlich untereinander? Impact besitzt nach seinem einjährigen Aufenthalt in Nordamerika bereits über angemessene Englischkenntnisse, welche wiederum nur die nötigsten Wörter und Begriffe abdecken. GBMs Englisch lässt (noch) zu wünschen übrig und weder Altec noch Moon können koreanisch. Doch KonKwon macht das Team möglich. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat. Entweder sprachen alle Spieler eine gemeinsame oder die Kommunikation vereinfachte sich auf simple Ping-Signale. Da KonKwon als Kind in Seoul, Korea, aufgewachsen ist und mit acht Jahren in die USA zog, ist er bilingual und bildet so eine Brücke zwischen den zwei Sprachgruppen im Team. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat.  Wie der Knoten in der Mitte einer Fliege. </p>\n\n<p>Ganz im Ernst: Schaut doch mal auf die Uniformen NRGs. Die sind doch verdammt niedlich, oder? Wie kann man dieses Team und ihre bunten Fliegen nicht mögen? </p>\n","fr_FR":"<p>NRG fait son entrée dans les LCS avec une composition qui a de quoi faire peur. L'équipe a rassemblé certains des meilleurs vétérans et plusieurs des étoiles montantes les plus prometteuses de Corée et d'Amérique du Nord. D'anciens joueurs des LCK comme Chang-suk « GankedByMom » Lee et Eon-young « Impact » Jeong se retrouvent ainsi aux côtés de talents locaux comme Jonny « Altec » Ru. En fin de compte, leurs plus terribles adversaires pourraient bien être... eux-mêmes ! Composer une équipe qui mélange plusieurs cultures et langues différentes n'est pas un mince exploit. Toutefois, avec un tel niveau de maîtrise des mécaniques de jeu dans une seule équipe, on peut s'attendre à ce que RNG fasse sensation.</p>","pl_PL":"<p>Udział w wiosennym sezonie 2016 to debiut organizacji NRG Esports. Została założona, przez Andy’iego Millera i Marka Mastrova, dwóch współwłaścicieli Sacramento King’s – drużyny NBA. Ogłoszenie o powstaniu tej drużyny miało miejsce wkrótce po zakończeniu Mistrzostw Świata - 16 listopada 2015. Założyciele zdecydowali się przenieść swoje doświadczenie ze świata sportów klasycznych do profesjonalnych rozgrywek w League of Legends. Na swojej stronie NRG Esports zapowiedziało, że po debiucie będą dążyć do zdobycia podium NA LCS. Potem ich cel jest tylko jeden – Mistrzostwa Świata 2016.</p>\n<p>\nJak do tego doszło? W wywiadzie Andy Miller udzielił odpowiedzi na wiele nurtujących pytań dotyczących powstania NRG Esports. Opowiadał o tym jak dowiedział się o League of Legends: dwójka jego synów zainteresowała się League of Legends, a on, przysłuchując się im, stwierdził „Wow, to naprawdę interesujące i mainstreamowe!” Akurat wtedy skończył budowę nowego obiektu dla swojej drużyny NBA i zaczął się zastanawiać, dlaczego miałby się ograniczać tylko do klasycznych sportów. Od myśli do czynów, po 6 miesiącach poszukiwań Andy Miller zakupił drużynę Team Coast \ni założył organizację, która zajęła jej miejsce. Całość odbyła się dzięki pomocy Gerarda Kelliego, właściciela Team Imagine, który podzielił się z nim swoją wiedzą na temat gry, zespołów i organizacji. Współwłaściciel NRG Esports wyraził chęć zaangażowania się w marketing związany z League of Legends i zawodnikami, jako przykład podając swoje dotychczasowe sukcesy w świecie sportu. Zapowiedział również, że zamierza użyć doświadczenia zdobytego podczas zarządzania drużyną NBA, do promowania zawodników. Marzy o tym żeby zobaczyć tłumy fanów w koszulkach NRG Esports. Andy Miller już pokochał swoją drużynę. </p>\n<p>\nKolejna cecha charakterystyczna NRG Esports to jej załoga. Członkowie organizacji mają niesamowite zaplecze i wprawę w prowadzeniu profesjonalnej drużyny. Andy Miller i Mark Mastrov nie oszczędzali - wybrali najlepszych dostępnych specjalistów we wszystkich dziedzinach związanych z League of Legends. Dyrektorem generalnym jest Gerard Kelly, założyciel Team Imagine, który prawie dostał się do NA LCS. Jego doświadczenie będzie podstawą dla działań całej organizacji. Menadżerem został Chad “HISTORY TEACHER” Smeltz, dobrze wszystkim znany z opieki nad Team8. Dołączą do niego sławy takie jak: Tadayoshi “Hermit” Littleton, były instruktor Origen i Charlie “Charlie” Lipsie, były trener Cloud9. Wpływ wyżej wymienionych panów widać na występie ich byłych zespołów na Mistrzostwach Świata 2015. Drużyna Origen dostała się aż do półfinału, a Cloud9 pokazało klasę w pierwszym tygodniu meczy grupowych. Taka obsada personelu ma zapewnić graczom możliwie najlepszą kuratelę, żeby mieli pierwszorzędne warunki do rozwoju. Nic tylko pozazdrościć takiej kadry.</p>\n<p>\nNajważniejszym elementem nowej drużyny, z którym fani będą mieli najwięcej do czynienia, są oczywiście zawodnicy. Współzałożyciele NRG Esports wyszli z założenia, że ich perfekcjonizm musi również mieć odniesienie do graczy. Gerard Kelly odpowiada za wybór i zajmuje się rekrutacją najlepszych ze e-sportowców. Wraz z Andym Millerem rozważają nawet rozszerzenie organizacji o oddziały zajmujące się innymi grami. NRG Esports jako organizacja ma wszystko czego potrzeba do stania się potęgą w NA LCS – kochających właścicieli i troskliwą załogę. \n</p>","en_US":"<p>\nNRG entered the NA LCS 2016 Spring Split with a bang, going 3-0 in their first games. Unfortunately, while the roster they put together was jam packed with mechanical talent, they weren’t able to keep their success going. They’re taking a new approach for Summer: only Chang-suk “GankedByMom” Lee remains (along with his bowtie and shade wearing aesthetic), while the rest of the team has been replaced with some of the most dynamic personalities and fan favourites in North America. Quas? Check. Kiwikid? Check. Santorin? Check. Will they be able to translate the likability factor into results? Only time will tell. But at the very least they’ll be a blast to cheer for.\n</p>\n<p>\nCoach: Tadayoshi \"Hermit\" Littleton\n</p>"},"foreignIds":{},"players":[117,121,150,159,169,185,759],"starters":[121,150,159,185,759],"subs":[117,169]}],"players":[{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":117,"slug":"otter","name":"Otter","firstName":"Brian","lastName":"Thomas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/otter-diqco9ek.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2016-05-23T19:16:51.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"341","TRLH2":"1001090004","TRLH1":"1001090008","FRA1TMNT1":"375280"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":150,"slug":"kiwikid","name":"Kiwikid","firstName":"Alan","lastName":"Nguyen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kiwikid-hrcovlc7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2016-06-09T21:08:33.000Z","bios":{"en_US":"<p>\nSome legends are remembered for their epic plays, some legends are remembered for their trophies, and others are remembered because well... they’re just so likable! Say hello to Alan “KiWiKiD’ Nguyen, but if you’ve watched nearly any NA LCS broadcast, you’ve already met him. He’s the support for Team Dignitas, or he was until they were knocked out of the NA LCS during the 2016 NA LCS Summer Promotion Tournament. For a sad while, it looked like we might be without our beloved KiWiKiD, but NRG brought him aboard. It wasn’t just because he’s a great chum, he’s also capable of great plays. He’s well known for locking down enemy teams with champions like Annie and Alistar. Sometimes he goes too aggressive or makes a misplay, but he’s always a delight to watch.\n</p>","fr_FR":"<p>Alan « KiWiKiD » Nguyen sera le support de Dignitas pour la saison 6 des LCS. Tout sauf une surprise tant le joueur est un pilier de l'équipe. Il y est en effet depuis 2012, d'abord comme top laner tout au long de la saison 3 puis au poste de support depuis.</p>\n\n<p>Très controversé comme top laner (il détient l'honneur douteux d'être le joueur le plus souvent mort en saison 3, tous postes confondus) le joueur américain a continué d'être sous le feu des critiques lors de sa transition vers son nouveau poste au début de la saison 4. Malgré tout, il a su faire le dos rond et continuer de se concentrer sur son jeu. Alors que d'autres joueurs ont été poussés à la retraite anticipée, incapables de gérer la pression du public, KiWiKiD a toujours semblé imperméable aux remarques et a continué de s'améliorer à son rythme. Bien lui en a pris puisque s'il n'est toujours pas considéré comme un joueur de classe mondiale, loin s'en faut, l'opinion générale s'accorde aujourd'hui sur le fait qu'il a largement le niveau pour jouer dans les LCS NA.</p>\n\n<p>Véritable roc de Dignitas du haut de ses 22 ans, il parvient bien souvent à imposer sa pression sur toute la carte depuis la voie du bas, notamment lorsqu’il peut incarner des supports ayant une forte capacité à engager le combat. Il aime particulièrement prendre l'initiative avec des personnages comme Nautilus ou Tresh qui peuvent se jeter au cœur de la bataille et résister aux assauts de la ligne de front adverse. Cette année encore et cette fois au côté de Apollo « Apollo » Price en voie du bas, ce sera à lui de porter son équipe par son expérience. Dans l'espoir de peut-être enfin côtoyer les sommets et donner à nouveau tort à toutes les critiques.</p>\n","pl_PL":"<p>Zawodnik powszechnie utożsamiany z Team Dignitas, dzięki jego długiemu stażowi w tej organizacji. Przed uzupełnieniem szeregów tej drużyny grał tylko przez ponad rok w UT Austin, uczelnianej drużynie z Texasu. Pochodzi z Austin, w Texasie, więc po prostu brał udział w lokalnych rozgrywkach. W tamtych czasach \"KiWiKiD\" był znany z agresywnego stylu gry. Został zwerbowany do Team Dignitas w grudniu 2012 roku, ze względu na ban ówczesnego junglera. „Crumbzz” przeniósł się do jungli, a Alan Nguyen zastąpił go na top-lanie. </p>\n<p>\nPo wejściu Alana w jego skład, Team Dignitas automatycznie zakwalifikował się do wiosennego sezonu NA LCS 2013. \"KiWiKiD\" brał udział w 3,4 i 5 sezonie NA LCS, co jest niezwykłym osiągnięciem. Na dodatek cały ten czas był w jednej drużynie, co świadczy o niezmienności i stabilności tego zawodnika. Jedyną poważną zmianą było przeniesienie się z pozycji na top-lanie na rolę supporta pod koniec sezonu trzeciego. Dobrze czuje się jako wspierający, aczkolwiek jego ulubionymi postaciami pozostał Renekton i Rumble, co przypomina o jego starej miłości do górnej linii. Na bot-lanie najchętniej gra bohaterami, którzy mają znaczne możliwości kontrolowania przeciwników, jak Thresh, Alistar i Annie. Zyskał znaczącą sławę, dokonując pięcioosobowego podbicia Minotaurem w grze przeciwko Team Fusion. Ponadto jego rozpoznawalność wzrosła kiedy był gościem wśród analityków.</p>\n<p>\nAlan pytany przez rodziców kim zostanie jak dorośnie odpowiadał: profesjonalnym graczem. Gdy wtedy żartował w ten sposób, nie wiedział jak dobrze trafił. Cały czas uważa to za zabawne, jak się potoczył jego los. Kiedy dostał smsa od Williama \"scarra\" Li’a ucieszył się, ale też bał się, że zostanie oszukany. Tym bardziej, że miał się przeprowadzić do Kaliforni. Od razu pochwalił się wszystkim swoim bliskim i okazało się, że rodzice Alana są bardzo zawiedzeni tą wiadomością. Na początku byli bardzo przeciwni, ale to się na szczęście zmieniło z czasem. Pomimo ich opinii na ten temat, \"KiWiKiD\" spakował się w ciągu 30 minut, wsiadł w auto i pojechał na spotkanie przygody z esportową sceną. Teraz uważa, że to co zrobił było trochę szalone, ale bez tego nie osiągnąłby sukcesu.</p>\n"},"foreignIds":{"drupalId":"21","TRLH1":"1001220077","TRLH2":"1001160127"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":169,"slug":"mancloud","name":"mancloud","firstName":"Zachary","lastName":"Hoschar","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/mancloud-6o5eeywa.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2016-08-04T18:26:08.000Z","bios":{"en_US":"Zachary \"mancloud\" Hoschar has showcased his skills as XDG's Mid Lane since the foundation of mTw.NA. Maintaining a varied champion pool, mancloud frequently breaks from convention. His style is a versatile one, playing aggressively, passively, pushing and roaming, all with the intent to counter his opponents’ tactics. When left to his own devices, he often defaults to his excellent Karthus play to carry his team to victory."},"foreignIds":{"drupalId":"36","TRLH1":"1001060001","TRLH2":"1001050002"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":167},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":759,"slug":"gbm","name":"GBM","firstName":"Chang-suk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gbm-o8g887p.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-28T01:24:16.000Z","bios":{"en_US":"","fr_FR":"<p>Ne lui donnez surtout pas Orianna. S'il y a une leçon que tous ceux qui affrontent GBM finissent par \n\nretenir, c'est qu'il ne faut jamais, <em>au grand jamais</em> donner à Chang-seok « GBM » Lee son \n\nchampion préféré, la Demoiselle mécanique. Certaines équipes ont commis cette erreur lors du segment \n\nd'été des LCK 2015, et elles se sont retrouvées face à un monstre avec un KDA de 22. Si GBM parvient à \n\nmaîtriser quelques autres champions aussi bien qu'Orianna, il sera à n'en pas douter un joueur des plus \n\nredoutables sur la voie du milieu.</p>\n\n<p>GBM aura peut-être une nouvelle chance d'exceller avec son champion de prédilection maintenant qu'il \n\nest passé aux LCS NA pendant l'intersaison 2015. C'est un tout autre monde, rempli de mid laners qui ne \n\nsavent pas encore ce dont GBM est capable.</p>","pl_PL":"<p>Mid-laner NRG Esports nie był bardzo popularny poza Koreą – swoją legendę w Ameryce zaczął pisać 16.11.2015, w momencie dołączenia do drużyny Gerarda Kelliego. Jego debiut w NA LCS to wiosenny sezon 2016. W swojej ojczyźnie był uważany za jednego z najlepszych graczy na środkowej alei. Lee \"GBM\" Chang-seok był członkiem dobrze znanych zespołów: CJ Entus Frost i Jin Air Green Wings, więc nie można odmówić mu doświadczenia w grze na najwyższym poziomie. Olbrzymi wpływ na jego rozwój mieli Kang \"Ambition\" Chan-yong i Jung \"RapidStar\" Min-sung. Jungler CJ Entus zainspirował „GBM” do nauki gry Orianną, do wejścia na sam szczyt w pierwszym sezonie. Motywacja była tak silna, że do dzisiaj jest powszechnie uważany za jedną z najlepszych Mechanicznych Baletnic na świecie. Z tego też powodu często jest nazywany „mistrzem Orianny”. Z kolei, emerytowany już, legendarny \"RapidStar\" był jednym z bliższych przyjaciół Lee’a Chang-seoka. Wzajemnie się uczyli, razem ćwiczyli nowe zagrania i dzielili rolę mid-lanera w CJ Entus. Takiego kolegi pozazdrościłby każdy gracz.</p>\n<p>\nWiele osób może się zastanawiać co oznacza przydomek mid-lanera NRG Esports, który na pierwszy rzut oka przypomina przypadkowy zlepek liter. Tymczasem on ma długą i zabawną historię. „GBM” to pierwsze litery oryginalnego nicka Lee’a Chang-seoka – „Ganked By Mom”. Młody Koreańczyk zdecydował się na taki pseudonim, ze względu na to, że został wielokrotnie przyłapany w środku nocy przez swoją matkę na grze w League of Legends. Pierwotnie brzmiał on „mom critical”, ale ze względu liczną publikę z zachodu został zmieniony na „zgankowany przez matkę”. Jak widać troska kochających matek koliduje z planami również wielkich graczy.</p>\n<p>\nJego zasób bohaterów poraża swoim rozmiarem. W piątym sezonie grał ponad 10 różnymi postaciami, a tylko tyloma prawdopodobnie ze względu na ich siłę w obecnej mecie. Oprócz zjawiskowej gry Orianną, wyróżnił się niezwykle skuteczną grą Viktorem i Lulu. Można śmiało powiedzieć, że „GBM” był w lidze koreańskiej jednym z poważanych i uniwersalnych mid-lanerów. Wykształcił swój talent wśród najlepszych i z takim nastawieniem przyjechał do Ameryki. Organizacja NRG, zaraz po ogłoszeniu swojego istnienia, umieściła na stronie jego słowa: „Moim celem jest zawsze być numerem jeden”. W nastawieniu Lee’a \"GBM\" Chang-seoka nie ma niedopowiedzeń.\n</p>","de_DE":"<p>Chang-suk „GBM“ Lee geht 2017 neue Wege. Er hat eine neue Mannschaft, nennt eine neue Region sein Zuhause und spielt auf einer neuen Position. Als seine ehemalige Mannschaft, NRG Esports, aus der NA LCS abstieg, begab sich der langjährige Mid-Laner auf die Reise über den großen Teich, um sich Team Vitality anzuschließen und dort um die Junglerposition zu kämpfen.\n\nEr mutet sich viel zu, denn er will in kürzester Zeit eine neue Rolle lernen und sich auf die LCS vorbereiten, aber GBM sucht im neuen Jahr die Herausforderung. Aber egal, ob er oder Djoko schlussendlich als Jungler eingesetzt wird, der Gewinner ist in jedem Fall Team Vitality.</p>"},"foreignIds":{"drupalId":"2160","TRLH3":"200000129","TRLH4":"200000227","ESPORTSTMNT02":"200002218","TRLH1":"200000714"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166}],"scheduleItems":[{"id":"AVTfrUSsQMQFcjhwbQjI","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:8ad5a66c-9687-4be6-ac1e-d589f34bbf90","scheduledTime":"2016-06-11T00:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"2","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"8ad5a66c-9687-4be6-ac1e-d589f34bbf90","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"a64f709b-32c2-45f8-88b7-4c9e82a40a2a","gameHash":"b9d3eb305b671378"},{"id":"8e62ddd8-cb76-4684-b677-ec4b66ebb883","gameHash":"aa8c411318d67a9c"},{"id":"a82051ba-91a8-43a1-9b32-15597cb904cc","gameHash":"80d74cc3683eba13"}],"videos":[{"id":3068,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:8e62ddd8-cb76-4684-b677-ec4b66ebb883","source":"https://www.youtube.com/embed/TiQHPMcIRmg?wmode=transparent","createdAt":"2016-06-11T03:19:03.000Z","updatedAt":"2016-06-11T03:19:03.000Z","game":"8e62ddd8-cb76-4684-b677-ec4b66ebb883"},{"id":3069,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:a82051ba-91a8-43a1-9b32-15597cb904cc","source":"https://www.youtube.com/embed/8ocipGf1ASA?wmode=transparent","createdAt":"2016-06-11T03:28:56.000Z","updatedAt":"2016-06-11T03:28:56.000Z","game":"a82051ba-91a8-43a1-9b32-15597cb904cc"},{"id":3070,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:a64f709b-32c2-45f8-88b7-4c9e82a40a2a","source":"https://www.youtube.com/embed/K11e9_Qtj3o?wmode=transparent","createdAt":"2016-06-11T04:21:52.000Z","updatedAt":"2016-06-11T04:21:52.000Z","game":"a64f709b-32c2-45f8-88b7-4c9e82a40a2a"}],"htmlBlocks":[],"match":{"id":"8ad5a66c-9687-4be6-ac1e-d589f34bbf90","name":"NRG-vs-IMT","position":20,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"},{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],"games":{"a64f709b-32c2-45f8-88b7-4c9e82a40a2a":{"id":"a64f709b-32c2-45f8-88b7-4c9e82a40a2a","name":"G3","generatedName":"IMT|NRG|G3|8ad5a66c96874be6ac1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"},{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],"standings":{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465618738704,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465614545323,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740013","gameRealm":"TRLH1","platformId":"TRLH1:1001740013","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"a82051ba-91a8-43a1-9b32-15597cb904cc":{"id":"a82051ba-91a8-43a1-9b32-15597cb904cc","name":"G1","generatedName":"IMT|NRG|G1|8ad5a66c96874be6ac1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"},{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],"standings":{"result":[[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1465615144728,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1465613083178,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1465607148892,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740004","gameRealm":"TRLH1","platformId":"TRLH1:1001740004","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8e62ddd8-cb76-4684-b677-ec4b66ebb883":{"id":"8e62ddd8-cb76-4684-b677-ec4b66ebb883","name":"G2","generatedName":"IMT|NRG|G2|8ad5a66c96874be6ac1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"},{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}],"standings":{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465614551097,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465610753911,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001740012","gameRealm":"TRLH1","platformId":"TRLH1:1001740012","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465618738705,"source":"bestOf","history":[{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465615144728,"source":"bestOf","closed":true},{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465614551098,"source":"bestOf","closed":true},{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1465614545323,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"9f260d15-d5b1-4363-bdd7-e71a3d832656":0,"6e67fcdb-1153-4940-9714-37914386f367":1}}}