{"teams":[{"id":21,"slug":"team-dignitas","name":"Team Dignitas","guid":"be6c8d0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-dignitas-c5j84saq.png","acronym":"DIG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-21T21:17:20.000Z","bios":{"en_US":"<p>From the ashes they rise (Phoenix1, is that you?). Dignitas looked all but lost to the NA LCS after they failed to re-qualify for the LCS, and consequently sold their Challenger spot to Apex Pride. But the League gods had other plans for the organization. In September of 2016 it was announced that both Dignitas and Apex had been bought by the Philadelphia 76ers. .</p>\n\n<p>The two entities were merged in order to play under a unified Dignitas banner, and thus a legendary League of Legends team was reborn. Sporting a roster mixed with domestic and international stars, Dignitas got off to a slow start but picked up steam near the end of the 2017 NA LCS Spring Split. Heading into summmer, Dignitas will look to build on their late-season success from spring -- let’s just hope they fare better than their basketball counterparts.</p>\n\n<p>Coach: David \"Cop\" Roberson</p>","fr_FR":"<p>Dignitas est un nom que tous les fans de League of Legends et d'e-sport en général connaissent au moins de réputation. Il faut dire qu'il s'agit d'une des plus vieilles organisations présentes sur le jeu, depuis l'acquisition en septembre 2011 de Rock Solid, l'équipe de Joedat « Voyboy » Esfahani, William « scarra » Li et Joshua « Jatt » Leesman (oui, le même Jatt qui est aujourd'hui l'un des commentateurs des LCS). Une entrée remarquée sur une scène qui n'était alors que bourgeonnante et surtout le début d'une belle aventure avec des joueurs qui, comme Michael « Imaqtpie » Santana sont aujourd'hui considérés comme des figures historiques de l'e-sport nord-américain.</p>\n\n<p>Malheureusement pour Dignitas, cette popularité a depuis longtemps du mal à être suivie de titres. L'organisation a tenté divers changements au fil des saisons, que ce soit au niveau de l'encadrement ou des joueurs, mais en vain. Si l'équipe américaine peut se targuer d'avoir toujours su maintenir sa place dans les LCS depuis la création de cette ligue, ils n'y ont jamais vu ne serait-ce qu'une finale des play-offs, sans même parler d'une qualification au Championnat du monde. Pire, lors du segment de printemps de la saison 5 l'équipe a terminé à la 9e place et a donc dû participer aux relégations. Certes, ils l'ont emporté avec 3 victoires pour 2 défaites contre Team Fusion, l'équipe de Choi « Huhi » Jae-hyun, à présent mid laner de Counter Logic Gaming, et ont conservé leur place dans les LCS. Mais ce n'est pas avec des performances pareilles que Dignitas allait satisfaire ses fans. Le segment d'été a bien mieux débuté pour l'équipe qui a culminé à 6 victoires pour seulement 2 défaites à l'issue de la 4e semaine de compétition.</p>\n\n<p>Mais, comme souvent avec ceux que leurs fans surnomment affectueusement « Dignitoss » pour leur capacité à jeter leur avance aux orties, le retour à la réalité fut rude. Après une deuxième partie de segment médiocre, l’équipe de Danny « Shiphtur » Le a terminé la saison régulière à la 4e place seulement avant d'être envoyée prématurément en vacances par Team Impulse dès le 4e tour des play-offs.</p>\n\n<p>Aujourd'hui, avec une équipe remaniée à coup de sang neuf européen, Dignitas entend bien faire taire, enfin, toutes les critiques.</p>","pl_PL":"<p>Team Dignitas stanowi jedną z najstarszych organizacji na światowej scenie esportowej. Jej powstanie miało miejsce 9 września 2003 roku w efekcie fuzji dwóch innych stowarzyszeń z gier FPS. Świetnie się rozwijała, więc po zainteresowaniu się i dodaniu kolejnych gier, w czerwcu 2004 roku została zarejestrowana jako spółka z o.o. Od tego czasu Team Dignitas ciągle się rozrasta, nabywając oddziały w kolejnych grach o bogatej scenie esportowej. Dywizja League of Legends powstała 22 września 2011 roku, poprzez nabycie graczy z zespołu Rock Solid. Pierwszym wpisem w długiej historii organizacji było pierwsze miejsce na IGN ProLeague, gdzie pokonali dobrze znane drużyny: Counter Logic Gaming i Curse Gaming. Od tego czasu często plasowali się w okolicy trzeciego miejsca w różnych turniejach. Ich największym osiągnięciem z pierwszych sezonów jest zostanie najlepszym zespołem po Moscow Five na 6 Mistrzostwach Świata IEM. Drużyna Team Dignitas miała również okazję zaprezentować się na Mistrzostwach Świata drugiego sezonu, lecz niestety nie udało się jej się wyjść z fazy grupowej.</p>\n<p>\nZe względu na stale rosnącą konkurencję po trzecim sezonie Team Dignitas dużo częściej znajdował się w okolicach 5 miejsca w różnej rangi rozgrywkach. Jednak ich były AD Carry „CoreJJ” podsumował ideologię Team Dignitas w krótkim zdaniu: „Naszym celem zawsze będzie znalezienie się na podium i kwalifikacja do Mistrzostw Świata, nie uważamy tego za zamiar nie do osiągnięcia.” Te słowa podkreślają świadomość organizacji w kwestii ostatnich niepowodzeń. Raz nawet zmierzyła się z groźbą relegacji, lecz wyszła z tej próby zwycięsko. Jednak cel Team Dignitas pozostaje jeden – szczyt NA LCS. </p>\n<p>\nSama organizacja jest znana z poświęcania uwagi portalom społecznościowym. Często wydaje różnego rodzaju poradniki, które mają być pomocą we wszystkich grach, które wspiera. Dba też o kadrę dla swoich drużyn. Do ich oddziału League of Legends 30 października 2015 roku jako menadżer dołączył Joe \"InnerFlame\" Elouassi, znanym z prowadzenia spraw SK Gaming, a potem Gamers2. Wraz z nim Team Dignitas podpisało kontrakt z Ramem \"Brokenshard\" Djemalem, powszechnie popularnym i bardzo doświadczonym zawodnikiem. Sama organizacja stara się też zakontraktować możliwie najlepszych graczy. Wielu światowej sławy zawodników i nie tylko wyszło właśnie spod skrzydeł Team Dignitas. Joshua \"Jatt\" Leesman, Joedat \"Voyboy\" Esfahani, William \"scarra\" Li i Alberto \"Crumbz\" Rengifo to tylko niektórzy z tłumu, który wyszedł z tej kuźni talentów.</p>\n","de_DE":"Sie erheben sich aus der Asche. Team Dignitas schien für immer aus der NA LCS auszuscheiden, nachdem sie sich zum ersten Mal nicht für die LCS qualifizieren konnten und ihren Platz in der Challenger Series an Apex Pride verkauft hatten. Aber die Götter von League hatten andere Pläne für die Organisation und im September 2016 verkündeten die Philadelphia 76ers, dass sie sowohl Dignitas als auch Apex gekauft hatten. \n</p>\nDie beiden Mannschaften wurden zusammengelegt, um unter dem Namen Dignitas zu spielen. Und so wurde die legendäre „League of Legends“-Mannschaft wiedergeboren. Mit einer Aufstellung aus heimischen und internationalen Stars will Dignitas versuchen, den Frühjahrs-Split der NA LCS 2017 zu gewinnen. Dank der neuen Führung und Aufstellung hat Dignitas eine Chance, die Liga im Sturm zu erobern – bleibt nur zu hoffen, dass sie sich besser schlagen als ihr Gegenstück im Basketball.\n</p>\nCoach: Jung Su Kim\n"},"foreignIds":{"drupalId":"3"},"players":[168,266,325,333,399,751,967],"starters":[168,266,325,399,751],"subs":[333,967]},{"id":264,"slug":"flyquest","name":"FlyQuest","guid":"be7244a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flyquest-89bnqpyh.png","acronym":"FLY","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2017-01-05T18:49:16.000Z","updatedAt":"2017-06-23T01:31:34.000Z","bios":{"en_US":"<p>Formerly Cloud9 Challenger, FlyQuest is about to reap the rewards of its Challenger Series success. The team’s mix of ex-Cloud9 veterans and fresh talent saw them rampage their way through to the 2017 NA LCS Spring Promotion Tournament, earning a spot in the NA LCS.</p>\n\n<p>Behind veteran mid laner Hai’s leadership, the team found unexpected success in the 2017 NA LCS Spring Split. LemonNation played the mastermind with his signature notebook, and Balls served as the team’s muscle in the top lane. Maybe you can teach old dogs new tricks.</p>\n\n<p>Coach: Thomas \"ThinkCard\" Slotkin</p>","de_DE":"FlyQuest, ehemals Cloud9 Challenger, ist drauf und dran, für ihren Erfolg in der Challenger Series belohnt zu werden. Mit einer Mischung aus alten Cloud9-Veteranen und neuen Talenten marschierten sie durch das Frühjahrs-Aufstiegsturnier der NA LCS 2017 und haben sich damit einen Platz in der NA LCS gesichert.\n</p>\nTrotz des neuen Besitzers bleibt die Mannschaft größtenteils unverändert. Unter der Führung des Mid-Laner-Veteranen Hai hat das Team hohe Erwartungen für 2017. LemonNation ist mit seinem unverkennbaren Notizblock zurück und Balls ist bereit, als treibende Kraft in der oberen Lane zu fungieren. Sollte FlyQuest Erfolg haben, sind sie der Beweis dafür, dass man auch einem alten Fuchs neue Tricks beibringen kann.\n"},"foreignIds":{},"players":[57,112,114,116,354,500,549],"starters":[57,112,114,116,549],"subs":[354,500]}],"players":[{"id":57,"slug":"wildturtle","name":"WildTurtle","firstName":"Jason","lastName":"Tran","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wildturtle-3siezu72.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-02T18:43:29.000Z","bios":{"en_US":"<p>Jason “WildTurtle” Tran has earned the \"wild\" part of his name through intense aggression in games. Whereas other AD carries excel at the delicate dance of staying out of reach, firing away, WildTurtle goes full aggro and can be found in melee range as often as not. When it backfires, he looks over-eager... but when it succeeds, the fans go crazy.</p>\n\n<p>After finding little playoff success with Immortals in 2016, WildTurtle made his way back to TSM for the start of 2017. Sporting his trademark all-in style, WildTurtle helped TSM to another title in the spring split. He finally shook off his playoff woes in the 2017 NA LCS Spring Finals, taking down Cloud9 in a close five game series. After Doublelift's return, WildTurtle heads to FlyQuest, where he should fit right in with Hai's aggressive shotcalls.</p>","fr_FR":"La partie « wild » (« sauvage ») du surnom de Jason « WildTurtle » Tran vient de son style de jeu particulièrement agressif. Alors que d'autres carrys AD excellent dans l'art délicat de rester hors de portée et d'attaquer à distance, WildTurtle aime aller au contact et se retrouve bien souvent à portée de mêlée. Quand la situation se retourne contre lui, il donne l'impression d'être trop zélé... mais quand il réussit, ses fans se déchaînent.\n\nAprès avoir connu un succès timide lors des play-offs avec les Immortals en 2016, WildTurtle est revenu chez TSM début 2017. Avec son style agressif caractéristique, il apporte à TSM le mordant qui lui manquait depuis le départ de Doublelift. Il a fini par oublier ses déboires lors de la finale du segment de printemps des LCS NA 2017, en éliminant Cloud9 lors d'un match serré en cinq manches. WildTurtle compte bien tout donner pour connaître un succès similaire au Brésil, lors du Mid-Season Invitational 2017.\n","pl_PL":"Jason „WildTurtle” Tran zawdzięcza „dziką” część swojego przydomka („wild” — z ang. „dziki”) niesamowitej agresji w grze. Podczas gdy inni prowadzący doskonalą delikatny taniec polegający na trzymaniu się poza zasięgiem i atakowaniu z daleka, WildTurtle idzie na całość i dość często można go zobaczyć walczącego w zwarciu. Gdy to się źle skończy, zarzuca się mu nadgorliwość... ale gdy się uda, fani szaleją.\n\nPonieważ nie osiągnął wielkich sukcesów z Immortals w 2016 roku, WildTurtle powrócił do TSM z początkiem 2017 roku. Prezentując swój firmowy, brawurowy styl gry, WildTurtle przywróci TSM agresję, której im brakowało po odejściu Doublelifta. Nareszcie otrząsnął się z problemów w play-offach, pokonując podczas finału wiosny NA LCS 2017 Cloud9 w wyrównanej serii pięciu gier. Wyruszając w podróż do Brazylii na Mid-Season Invitational 2017, zamierza kontynuować ten sukces\n","de_DE":"Jason „WildTurtle“ Tran verdankt das „Wild“ in seinem Namen seiner unglaublichen Aggressivität in den Spielen. Während andere AD-Carrys außerhalb der Reichweite bleiben und dennoch Schaden verursachen, geht WildTurtle immer volles Risiko und ist mindestens genauso häufig in Nahkampfreichweite. Wenn das nach hinten losgeht, wirkt er übereifrig, aber wenn er Erfolg hat, drehen seine Fans durch.\n</p>\nDa er mit den Immortals im Jahr 2016 keinen Erfolg in den Entscheidungsspielen hatte, wechselte WildTurtle Anfang 2017 wieder zu TSM zurück. Mit seinem „Alles oder nichts“-Stil bringt WildTurtle die Aggressivität nach Doublelifts Abgang zu TSM zurück. Er hofft, seine Probleme mit Entscheidungsspielen hinter sich lassen zu können, während er die Lebensleisten seiner Gegner leert, um TSM dabei zu helfen, die Krone im Frühjahrs-Split der NA LCS zu verteidigen.\n","es_ES":"Jason ''WildTurtle'' Tran se ha ganado la parte wild (salvaje) de su nombre gracias a su agresividad en las partidas. Si otros ADC destacan por sus ágiles movimientos, que los hacen inalcanzables y escurridizos, WildTurtle se lanza a tope y a menudo se le puede ver a distancia cuerpo a cuerpo. Cuando le sale el tiro por la culata, queda demasiado impaciente; si le sale bien, el público enloquece.\n\nTras quedarse a dos velas en los playoffs con Immortals en 2016, WildTurtle ha vuelto a TSM al comienzo de 2017. Gracias a su distintivo estilo de darlo todo, WildTurtle volverá a aportar un toque de agresividad a TSM tras la retirada de Doublelift. Logró acabar con su miedo a los playoffs en la final de primavera de la LCS NA 2017, en la que consiguió vencer a Cloud9 en una serie de cinco partidas. Intentará tener el mismo éxito en su viaje a Brasil para jugar en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Jason \"WildTurtle\" Tran ganhou a parte do “wild” do seu nome por causa da suas agressões intensas nos jogos. Enquanto outros carregadores mandam bem na delicada dança de ficar fora de alcance, atirando, WildTurtle ataca agressivamente e pode ser encontrado no combate corpo a corpo frequentemente. Quando isso não dá certo, ele parece muito afobado... mas quando dá, os fãs vão à loucura.</p>\n\n<p>Depois de ter um pouco de sucesso nas eliminatórias com a Immortals em 2016, o WildTurtle voltou para a TSM no início de 2017. Exibindo sua marca registrada de ir com tudo, WildTurtle traz a agressividade de volta à TSM depois da saída do Doublelift. Ele finalmente esqueceu o desgosto das eliminatórias nas Finais de Primavera da LCS NA 2017, derrotando a Cloud9 em cinco partidas acirradas. Ele tentará carregar esse sucesso consigo na viagem ao Brasil para o Mid-Season Invitational 2017.\n\n</p>"},"foreignIds":{"drupalId":"178","TRLH1":"200000251","TRLH2":"200000155","TRLT3":"200000235"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/WILDTURTLEX","twitter":"https://twitter.com/tsmwildturtle"},"champions":[],"liveGameTeam":264},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":264},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":264},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":264},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":325,"slug":"adrian","name":"Adrian","firstName":"Adrian","lastName":"Ma","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/adrian-d97sgu2b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-08-04T00:05:38.000Z","bios":{"en_US":"<p>Adrian \"Adrian\" Ma might not be known for his playmaking. But that doesn't mean he isn't a vital part to his team's successes. As a member of Immortals, he was the yin to Huni's yang, balancing his top laner's aggression with his own methodical, thoughtful playstyle. He's always ready to save his teammates and focuses heavily on warding, map movements and strategizing. He pioneered a trend in the 2016 NA LCS Summer Split of playing ranged supports like Karma and Soraka over the favoured melee champions.</p>","fr_FR":"<p>À 18 ans, Adrian « Adrian » Ma s'apprête à entamer sa deuxième année en tant que joueur professionnel de League of Legends, au poste de support pour l'équipe Immortals.</p>\n\n<p>Auparavant, il a passé un peu plus d'un an comme support de LMQ en remplacement de Zhang « Mor » Hong-Wei, retourné jouer en Chine. Recruté par une équipe alors en pleine restructuration et qui a d'ailleurs changé de nom pour l'actuel, Team Impulse, quelques semaines seulement après l'arrivée d'Adrian, le jeune joueur américain a pris un risque en signant son contrat. Un pari qui s'est vite révélé gagnant puisque Team Impulse a su, après quelques semaines d'adaptation, trouver les clés pour s'imposer comme l'une des principales menaces des LCS NA. Ils n'ont en revanche pas su concrétiser leur domination lors des play-offs, terminant à la quatrième place lors du segment de printemps puis d'été. Pire, ils n'ont pas réussi à se qualifier pour les championnats du monde, malgré un rang de tête de série numéro 2, lors du tournoi de qualification régional pour la troisième place nord-américaine de la compétition la plus importante de l'année.</p>\n\n<p>Au niveau individuel, Adrian a malgré tout prouvé lors de sa première année au plus haut niveau qu'il est un joueur versatile, capable d’incarner des champions différents en fonction des besoins de l'équipe. Il a aussi montré qu'il savait réagir rapidement et protéger ses coéquipiers même dans des situations inattendues. Une qualité forcément utile pour soutenir un carry AD tel que Jason « WildTurtle » Tran, son nouveau comparse chez Immortals, connu pour être parfois trop agressif lors des combats d’équipes.</p>\n\n<p>Au sein d'une équipe ayant l'expérience de la scène compétitive, le support américain bénéficie en tout cas d’une occasion en or pour passer du statut de jeune joueur prometteur à celui de star titrée au plus haut niveau.</p>\n","pl_PL":"<p>Adrian poznał dzieło Riot Games grając z przyjaciółmi, wkrótce prześcignął ich i znalazł się w akademickim zespole. Jako członek amatorskiej drużyny, brał udział w Challenger League, skąd było bardzo blisko do Challenger Series. Jednak jego zainteresowanie League of Legends zbiegło się w czasie z pójściem na studia. Miał świadomość, że profesjonalna gra pochłania naprawdę dużo codziennego czasu na ćwiczenia, podobnie jak nauka na poziomie uniwersyteckim. Przez to miał wiele wątpliwości, m.in. czy warto porzucić naukę na rzecz esportowej kariery i czy w ogóle ma szanse się wybić. W podjęciu decyzji pomógł mu trener drużyny esportowej, który dał ogłoszenie w sieci o college’u przyjaznym zawodowym graczom. Adrian na początku nie chciał w to uwierzyć. Kiedy się przekonał, że to prawda, podjął decyzję o zaangażowaniu się w scenę League of Legends. Został jednym z pierwszych graczy wspieranych przez uczelnię - Robert Morris University w Illinois.</p>\n<p>\nChociaż \"Adrian\" grał w profesjonalnych drużynach od marca 2014 roku, pokazał się dopiero w Team Impulse w grudniu tego roku. Wraz z tą organizacją zaistniał jako solidny zawodnik, jeden z najlepszych. Niestety zarówno w wiosennym sezonie NA LCS 2015, jak i w letnim skończył na czwartej pozycji, tuż przed podium. Wiązało się to z licznymi problemami, które na swojej drodze po zwycięstwo napotkała jego drużyna. Był blisko dostania się do Mistrzostw Świata, lecz ostatecznie nie udało mu się do nich zakwalifikować. Jednak występy Adriana zrobiły wrażenie na właścicielach organizacji Immortals, której szeregi zasilił w grudniu 2015 roku, a następnie, wraz z nimi zawalczył o więcej w wiosennym sezonie NA LCS 2016.</p>\n<p>\nAdrian to osoba lubiana w środowisku League of Legends, pierwotnie znany jako „10q”, ponieważ fonetycznie brzmiało jak „thank you”. Pochodzący z Texasu support jest znany z doskonałej kontroli wizji na mapie. Przepada za graniem bohaterami, którzy potrafią przyciągnąć nie tylko uwagę przeciwnika, ale także jego postać. Ulubionymi wyborami Adriana są Thresh i Blitzcrank. Dzięki występom w NA LCS i wysokiej pozycji w Kręgu Pretendenta zdobył skromne grono wielbicieli. Na pytania fanów „jak sobie radzi” odpowiada: „Nie pozwalam żeby cokolwiek poza grą mnie rozpraszało, skupiam się na meczu. Po prostu daję z siebie wszystko i nie martwię się co sądzą inni. \nW ogóle w takich sytuacjach się nie denerwuję.” Z takim nastawieniem ma zamiar spełnić swoje marzenie – znaleźć się w drużynie, która zajmuje czołowe miejsce w NA LCS.\n</p>","de_DE":"Adrian „Adrian“ Ma wäre der Erste, der dir sagen würde, dass er kein Spielmacher ist. Aber das bedeutet nicht, dass er keine tragende Rolle für den Erfolg seines Teams spielt. Als Mitglied der Immortals war er das Yin zu Hunis Yang. Die Aggressivität seines Top-Laners konnte er mit seinem methodischen, durchdachten Spielstil ausgleichen. Er ist stets bereit, seinen Teamkollegen zu helfen, und legt großen Wert auf die Platzierung von Augen, Bewegungen auf der Karte und das Entwickeln von Strategien. Er war es, der im Sommer-Split der NA LCS 2016 den Trend zu Fernkampf-Supportern wie Karma und Soraka gesetzt und die zu diesem Zeitpunkt beliebteren Nahkampf-Champions abgelöst hat.</p>\n\nObwohl er sich mit Phoenix1 einem neuen Team anschließt, sollte sich Adrians Spielstil 2017 kaum verändern. Dieses Mal muss er der Gegenpol seines aggressiven Junglers Inori sein. Adrian sorgt vielleicht nicht für Spiele-Highlights, aber er wird auf jeden Fall eine Schlüsselrolle in Phoenix1s neuer Mannschaft spielen.\n"},"foreignIds":{"drupalId":"3041","TRLH1":"200000236","TRLH2":"200000140"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":354,"slug":"bigfatlp","name":"bigfatlp","firstName":"Michael","lastName":"Tang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bigfatlp-fvccyz4y.png","hometown":"Canada","region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2017-01-09T18:10:57.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"320"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":500,"slug":"remilia","name":"Remilia","firstName":"Maria","lastName":"Creveling","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/remilia-2xae9ut5.png","hometown":"USA","region":"NA LCS","birthdate":"1995-02-02","createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-09T22:17:03.000Z","bios":{"en_US":"<p>\nMaria \"Remi\" Creveling is one of the most mechanically skilled up-and-coming supports in North America. Commonly known as \"MadWife\" due to her <a href=\"https://www.youtube.com/watch?v=Ju3VybZ3HY8\" target=\"_blank\">impeccable Thresh hooks</a>, Remi can (and has) single-handedly turned the tides of a game due to her individual skill.\n</p>","fr_FR":"<p>Maria « Remilia » Creveling est l'un des supports les plus prometteurs d'Amérique du Nord en termes de\n\nmécaniques de jeu. Également surnommée « MadWife » grâce à ses lancers de grappin impeccables \n\navec Thresh, Remilia peut renverser la tendance d'une partie à elle toute seule grâce à son talent \n\nindividuel (ce qu'elle ne se gêne pas pour faire). Bien qu'elle fasse ses débuts aux LCS NA, Remilia a \n\naccompli suffisamment d'exploits durant les Challenger Series NA et en file solo pour qu'on puisse avoir \n\nla certitude qu'elle saura terroriser son adversaire.</p>","pl_PL":"<p>To absolutnie unikatowy członek LA Renegades. Patrząc na jej mało znaną przeszłość, nikt się nie spodziewał, że w sezonie 6 to właśnie ona zapisze się na stałe w kartach historii League of Legends. Jest pierwszą kobietą, która wzięła udział w rozgrywkach LCS. Jednak dużo ciekawsza od tego faktu jest jej droga do tego celu. Podróż Marii do NA LCS rozpoczęła się bardzo wcześnie - chociaż pasjonuje się dziełem Riot Games od wczesnego pierwszego sezonu, to do trzeciego nie brała udziału w konkursowych rozgrywkach. W lipcu 2013 na miesiąc dołączyła do Curse Academy i miała okazję zagrać w MOBAFire Challenger Series. Przez kolejne 2 lata szukała swojego miejsca na profesjonalnej scenie League of Legends. Maria miała okazję grać z wieloma znanymi zawodnikami, jak np. \"Chaox”. Kompetencje zdobyte podczas tych poszukiwań, sprawiły, że stała się powszechnie znana i poważana wśród profesjonalnych graczy. W marcu 2015 roku dołączyła do Misfits i od tego momentu zaczęły się jej sukcesy.</p>\n<p>Pierwszym znaczącym wyczynem była wygrana w AlphaDraft Challenger League na przełomie kwietnia i maja 2015 roku. Maria i jej zespół przegrali tylko jeden mecz podczas całego wydarzenia. Następnie skończyła Challenger Series z rewelacyjnym wynikiem 8:2, jednak w dogrywce ulegli Team Coast. Ostatecznie w meczach barażowych pokonali Team Imagine 2:1, a następnie Team Coast 3:2. W ten sposób \"Remilia\" stała się pierwszą kobietą, która została zakwalifikowana do rozgrywek LCS. </p>\n<p>Doskonale widać jak Maria rozwijała swoje umiejętności podczas kolejnych sezonów – zaczynała od złota w pierwszym sezonie, a w każdym kolejnym była o szczebel wyżej. W społeczeństwie League of Legends często jest nazywana „Madwife”, ze względu na wyjątkowe umiejętności w grze swoim ulubionym bohaterem – Threshem. Jednak żaden bohater nadający się jako suport nie jest jej obcy. Grając w szeregach LA Renegades wielokrotnie pokazywała, że również potrafi grać na najwyższym poziomie Morganą, Nautilusem oraz Janną. Dużo można się dowiedzieć o jej preferencjach z portali społecznościowych, gdyż jest wyjątkowo aktywna m.in. na Twitterze. Już po pierwszym rzucie oka na profil Marii widać, że uwielbia anime, co też przysporzyło jej wielu wielbicieli.</p>\n"},"foreignIds":{"drupalId":"1327","TRLH1":"1001220129","TRLH2":"1001160179"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":751,"slug":"ssumday","name":"Ssumday","firstName":"Chan-ho","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssumday-h9yau0jj.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-27T01:00:31.000Z","bios":{"en_US":"<p>Chan-ho \"Ssumday\" Kim is a feared top laner -- and justifiably so. Widely regarded as one of the world’s premier top laners, Ssumday spent a majority of his career with KT Rolster before becoming one of the most sought after free agents of 2016 and moving to North America to join up in the rebirth of Team Dignitas.</p>\n\n<p>Ssumday’s insanely deep champion pool gives the opposition no chance to shut him down in picks and bans. He poses a serious threat no matter the champion. Need him to tear apart the enemy with magic? Give him Ryze. Oh, you needed a tank to help lock down those pesky damage dealers? Gift him Maokai. Need to cut tanks down to size? Let him slice and dice with Fiora. Sometimes, it feels like Ssumday leaves you with just one option: lose.</p>","fr_FR":"<p>Sur la voie du haut, KT Rolster dispose de Chan-ho « ssumday » Kim, l'un des jeunes loups coréens, tout juste âgé de 19 ans. En dépit de sa jeunesse, ssumday est redouté, et à juste titre. Ssumday a été élu meilleur joueur du Segment d'été des LCK 2015 avec un ratio KDA de 5,22 qui le place en tête du Segment. Concédez-lui un mètre, il vous prend un kilomètre. Essayez, si vous ne me croyez pas.\n</p>\n<p>\nSsumday est efficace avec les mages et les combattants, mais au cours du Segment d'été des LCK c2015, il a surtout dominé avec des tanks. À plusieurs reprises, il a pris KT Rolster sur ses épaules et l'a portée jusqu'à la ligne d'arrivée. S'il met les mains sur Maokai ou Shen, vous devez préparer de quoi vous désengager, parce que ssumday vous poursuivra jusqu'aux extrémités de la carte pour réussir une élimination.\n</p>","pl_PL":"<p>Górny KT Rolster, Chan-ho „ssumday” jest jednym z najmłodszych Koreańczyków – ma Tylko 19 lat. Pomimo młodego wieku ssumday jest niezwykle przerażającym górnym – i całkiem słusznie. Został on wybrany najlepszym graczem letniego splitu LCK 2015, zajmując 1. miejsce ze stosunkiem zabić do zgonów wynoszącym 5,22. Jeżeli dacie mu dłoń, weźmie całą rękę. I to nie jest przesada.\n</p>\n<p>\nSsumday gra niezwykle skutecznie magami i wojownikami, ale większość meczów podczas letniego splitu LCK 2015 rozegrał obrońcami. Wiele razy ciągnął ze sobą całe KT Rolster i doprowadzał ich do linii mety. Jeżeli uda mu się dorwać Maokaia lub Shena, lepiej, żeby wasza drużyna miała jakiś sposób na przerwanie walki, ponieważ ssumday będzie was ścigał na kraniec świata, aby zagwarantować zabójstwo.\n</p>","de_DE":"Chan-ho „Ssumday“ Kim ist ein gefürchteter Top-Laner – und das zu Recht. Ssumday gilt als einer der besten Top-Laner der Welt und hat den Großteil seiner Karriere bei KT Rolster verbracht, bevor er 2016 zu einem der begehrtesten mannschaftslosen Spieler wurde und nach Nordamerika zog, um Teil der Wiedergeburt von Team Dignitas zu werden.\n</p>\nSsumdays unglaublich umfangreicher Championpool macht es seinen Gegnern nahezu unmöglich, ihn aufzuhalten. Er ist immer eine Gefahr, egal, mit welchem Champion er spielt. Soll er die gegnerische Mannschaft mit Magie vernichten? Gib ihm einfach Ryze. Oh, du brauchst einen Tank, der die lästigen Schadensverursacher ausschaltet? Gib ihm Maokai. Brauchst du jemanden, der die Tanks unschädlich macht? Gib ihm Fiora und sieh dabei zu, wie er sie in Stücke schneidet. Wenn du ihn nicht mit Bannen unschädlich machst, bleibt dir meistens nur noch eine Option: verlieren.\n","es_ES":"<p>Chanho \"ssumday\" Kim es uno de los jugadores más jóvenes del panorama competitivo de Corea del Sur, con sólo 19 años. A pesar de su juventud, es un top temido por sus enemigos -- y con razón. Ssumday fue elegido mejor jugador del Split de verano de 2015 con un KDA de 5.22 a lo largo de la temporada. </p>\n\n<p>Ssumday rinde tanto con magos como luchadores, pero en el Split de verano de la LCK 2015 donde mejor ha rendido ha sido con tanques. No han sido pocas las veces en las que se ha echado el equipo a la espalda y lo ha llevado a la victoria. Si consigue jugar con Maokai o Shen, más vale que escojas campeones que puedan quitártelo de encima, porque ssumday te perseguirá hasta el fin del mundo si hace falta para acabar contigo. </p>\n","pt_BR":"<p>O topo da KT Rolster, Chan-ho \"ssumday\" Kim, é uma das jovens armas da Coreia, com apenas 19 anos de idade. Apesar de novo, ssumday é um topo muito temido - e isso é justificável. Ele foi votado como o Melhor Jogador da LCK de Verão 2015, sendo campeão de A/M/A com 5.22 durante a etapa. Dê um centímetro de espaço, e ele pegará um quilômetro. E não, não foi uma piada.\n</p>\n<p>\nSsumday é competente com magos e lutadores, mas a maioria de suas atuações dominantes na LCK de Verão em 2015 foi com tanques. Em múltiplas ocasiões ele colocou a KT Rolster nas costas e carregou até a linha final. Se ele colocar as mãos no Maokai ou no Shen, tenha a certeza de que você vai trazer um pouco de contra-iniciação, porque Ssumday vai te caçar até o fim do mundo.\n</p>"},"foreignIds":{"drupalId":"2147","TRLH1":"200000192","TRLH2":"200000096"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":967,"slug":"big","name":"Big","firstName":"Terry","lastName":"Chuong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/big-9eh6ixp9.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:09:32.000Z","updatedAt":"2017-06-14T20:10:51.000Z","bios":{"fr_FR":"<p>Terry « BIG » Chuong, connaît déjà les LCS NA, mais seulement en tant que remplaçant.</p> \n\n<p>Celui qui se faisait auparavant appeler « Baby » a découvert les studios des LCS lors de la 11e semaine du segment d'été de la saison 2014 au sein de CLG, en remplacement des joueurs de l'équipe première partis s’entraîner en Corée du Sud. Il est ensuite retourné acquérir de l'expérience au sein de la scène challenger nord-américaine chez Storm, au côté de Samson « Lourlo » Jackson, à présent top laner de Team Liquid, et Zachary « Mandatorycloud » Allan, ancien mid laner de XDG. Puis retour en LCS en 2015 lors des trois premiers matchs du segment d'été en tant que support de Team Dragon Knight. Une expérience difficile pour le joueur dans une équipe réunie à la va-vite en raison de l'impossibilité pour l'organisation de faire venir ses titulaires en NA à temps pour le début de la saison.</p>\n\n<p>Pas dégoûté du monde professionnel pour autant, Big est derechef retourné sur la scène challenger, cette fois au sein d'Imagine. Equipe dans laquelle le joueur s'est retrouvé support d'un carry AD français, Pierre « Steeelback » Medjald, fraîchement débarqué en NA après la fin de son contrat chez Fnatic. Une opportunité sans nulle doute formatrice pour le joueur, même s'il n'a pas réussi à se qualifier en LCS avec cette équipe, défaite 3 victoires à 1 par Team 8 lors du tournoi de promotion. </p>\n\n<p>Qu'à cela ne tienne, Baby est aujourd'hui de retour en LCS NA, enfin en tant que titulaire. Il est certes une fois de plus dans un effectif qui pose plus de questions qu'il n'apporte de certitudes, mais ça n'en reste pas moins une occasion en or pour lui de montrer quel est véritablement son niveau. </p>\n","en_US":"<p>\nYou may know Terry “Big” Chuong from his time spent on Team Dragon Knights. While the organized LCS competition tore TDK apart, Big’s presence in the bot lane did not go unnoticed. He caught the eye of Echo Fox, and was brought on board for the 2016 NA LCS Spring Split.\n</p>\n<p>\nBig has proven to be a protector down to his very bones -- Alistar, Janna, and Braum were his supports of choice. But FOX had their fair share of struggles in spring. Now with a new shot in Dignitas's bot lane, he'll have to prove he's up to the challenge.\n</p>","pl_PL":"<p>Terry bardzo wcześnie zaczął swoją przygodę w wirtualnym świecie, ponieważ w wieku 8 lat już czuł się tam jak ryba w wodzie. Był zafascynowany League of Legends od wydania wczesnej bety, w szczególności uwielbiał grać Heimerdingerem. Sceną esportową zainteresował się dopiero za sprawą prośby przyjaciela żeby zajął pozycję junglera w jego drużynie. „BIG” doskonale się wtedy sprawdził w profesjonalnych meczach, w związku z czym podjął wyzwanie osiągnięcia czegoś w tej dziedzinie. Od października 2013 roku do stycznia 2016 roku starał się znaleźć drużynę, wraz z którą dostanie się do NA LCS. Nie powiodło mu się, ale wielokrotnie był o włos od tego wyczynu. Jednak szczęście mu dopisało i został zauważony przez swoich przeszłych przeciwników – Team Dragon Knights. Dzięki temu miał okazję zostać substytutem dla ich supporta w pierwszych tygodniach letniego sezonu NA LCS 2015. Zyskał bezcenne doświadczenie w profesjonalnej lidze, lecz nie udało mu się spełnić marzeń. Kolejny raz los uśmiechnął się do niego w styczniu 2016 roku kiedy został zaproszony do głównego składu nowo utworzonej drużyny Echo Fox. Pod lisim sztandarem zadebiutował w rozgrywkach NA LCS 2016 w okresie wiosennym.</p>\n<p>Urodzony w Los Angeles, w Kaliforni, wcześniej w karierze znany jako „Baby”, Terry nie jest dedykowanym supportem. Lubi zajmować rolę wspierającego w drużynie, lecz na początku swojej kariery doskonale odnalazł się w jungli. Ponadto oświadczył, że aktualnie, jeśli by nie grał na bot-lanie to zdecydowałby się na objęcie pozycji mid-lanera. Póki co „BIG” dobrze się czuje w roli wspierającego, w szczególności jeżeli kompozycja drużyny pozwala mu na wybór bohatera o olbrzymiej ilości punktów zdrowia. Gustuje w postaciach takich jak Thresh, Braum i Nautilus. Styl gry Terry’ego najlepiej charakteryzuje zawrotna ilość asyst podczas rankingowych meczów – jak na prawdziwego supporta przystało.</p>\n"},"foreignIds":{"ESPORTSTMNT02":"200000673","TRLH1":"200000614"},"socialNetworks":{},"champions":[],"liveGameTeam":21}],"scheduleItems":[{"id":"AVmEyNQ0oUG4HPFjOKG8","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:9179903b-a6e5-477c-8303-0b13bd80ef3e","scheduledTime":"2017-02-17T23:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4","blockLabel":"5","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:95ada0b9-bece-48cc-bd48-d9ee5bde901e"},"match":"9179903b-a6e5-477c-8303-0b13bd80ef3e","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"95ada0b9-bece-48cc-bd48-d9ee5bde901e","league":"2"}],"gameIdMappings":[{"id":"c7b58061-4d13-45c2-aaef-07b45c30f405","gameHash":"a692e15a8d74282c"},{"id":"a6cbd67e-97a0-44c6-a87e-d5151812fbc9","gameHash":"4d4afe5f3f79f859"}],"videos":[{"id":5657,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:c7b58061-4d13-45c2-aaef-07b45c30f405","source":"https://www.youtube.com/embed/P0AYId2eoQg?wmode=transparent","createdAt":"2017-02-18T01:41:00.000Z","updatedAt":"2017-02-18T01:41:00.000Z","game":"c7b58061-4d13-45c2-aaef-07b45c30f405"},{"id":5659,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:a6cbd67e-97a0-44c6-a87e-d5151812fbc9","source":"https://www.youtube.com/embed/sH9wUTelCo0?wmode=transparent","createdAt":"2017-02-18T02:10:27.000Z","updatedAt":"2017-02-18T02:10:27.000Z","game":"a6cbd67e-97a0-44c6-a87e-d5151812fbc9"}],"htmlBlocks":[],"match":{"id":"9179903b-a6e5-477c-8303-0b13bd80ef3e","name":"DIG-vs-FLY","position":13,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"games":{"c7b58061-4d13-45c2-aaef-07b45c30f405":{"id":"c7b58061-4d13-45c2-aaef-07b45c30f405","name":"G1","generatedName":"DIG|FLY|G1|9179903ba6e5477c830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487381919043,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487375250319,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002090004","gameRealm":"TRLH1","platformId":"TRLH1:1002090004","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"a6cbd67e-97a0-44c6-a87e-d5151812fbc9":{"id":"a6cbd67e-97a0-44c6-a87e-d5151812fbc9","name":"G2","generatedName":"DIG|FLY|G2|9179903ba6e5477c830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"},{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487383685181,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487378592238,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002090025","gameRealm":"TRLH1","platformId":"TRLH1:1002090025","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5c3d1900-4d63-4eb3-959e-a0da1f9ba16a":{"id":"5c3d1900-4d63-4eb3-959e-a0da1f9ba16a","name":"G3","generatedName":"DIG|FLY|G3|9179903ba6e5477c830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487383685181,"source":"bestOf","history":[{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487381919044,"source":"bestOf","closed":true},{"result":[[{"roster":"7a645a6c-d674-4273-96e3-9c2ec980c59f"}],[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}]],"timestamp":1487378592238,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"aa51266a-790a-41e9-8b71-9912e41a3c22":0,"7a645a6c-d674-4273-96e3-9c2ec980c59f":1}}}