{"teams":[{"id":122,"slug":"renegades","name":"Renegades","guid":"be6eff04-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/renegades-11rbdlso.png","acronym":"REN","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-05-31T12:19:31.000Z","bios":{"en_US":"<p>\nA band of former Misfits, Renegades stormed through the 2015 NA Challenger Series and into the NA LCS within a year of their founding. Their success in the NACS was largely attributed to superior map and objective control, not individual laning talent, but don't let that fool you. Former Moscow 5 star Alexey \"Alex Ich\" Ichetovkin and former Team Dignitas star (and prophet) Alberto \"Crumbz\" Rengifo bring their fair share of experience and mechanical skill to the REN lineup. Combined with the stellar bot lane duo of Aleš \"Freeze\" Kněžínek and support Maria \"Remi\" Creveling, the Renegades ongoing success seems almost inevitable.\n</p>\n<p>\nCoach: David Tu\n</p>","fr_FR":"<p>Anciennement connus sous le nom de Misfits, les Renegades ont balayé leurs adversaires lors des Challenger Series NA 2015 et se sont qualifiés pour les LCS NA seulement un an après leur fondation. Leur succès lors des CS NA a été largement attribué à leur meilleur contrôle de la carte et des objectifs, et non à leur talent individuel en phase de laning, mais ne vous laissez pas abuser. L'ancienne star de Moscow 5, Alexy « Alex Ich » Ichetovkin et l'ancienne star (et prophète) de Team Dignitas, Alberto « Crumbz » Rengifo, ont apporté leur lot d'expérience et de maîtrise des mécaniques de jeu à l'équipe. Si l'on combine ces atouts certains au talentueux duo formé par Aleš « Freeze » Kněžínek et son support Maria « Remi » Creveling en voie du bas, le succès des Renegades semble assuré.</p>","pl_PL":"<p>Renegaci z Los Angeles wywodzą się z zespołu Misfits, który został założony na początku marca 2015. Twórcą był Chris \"Doombang\" Badawi, były prawnik patentowy z Nowego Jorku. W wywiadzie dla the Score e-sports wyjawił co przekonało go do takiego kroku. Pewnego dnia miał wypadek samochodowy, tak poważny, że z trudem udało mu się pozostać przy życiu. To skłoniło go do weryfikacji swojego życia – „Doombang” stwierdził, że nie chce być prawnikiem, bo w głębi duszy zawsze był graczem. Pierwotnie chciał kupić Curse Academy, ale skończyło się to tylko zdobyciem wielu przydatnych kontaktów w społeczeństwie League of Legends. </p>\n<p>\nWkrótce potem Chris Badawi zaprosił do rozmów Alberta \"Crumbz\" Rengifa, przyszłego kapitana LA Renegades, żeby podyskutować o stworzeniu nowej organizacji. Okazało się, że doskonale się rozumieją w kategorii idei, jak ma taki zespół wyglądać. Według filozofii Chrisa LA Renegades ma być drużyną, którą nie jest odbierana jako firma, tylko rodzina. To ma być miejsce gdzie każdy członek kocha i jest dumny z tego co robi, zamiast czuć nieustającą presję. \"Crumbz\" zaproponował Alexeya \"Alex Ich\" Ichetovkina jako kolejnego uczestnika tego projektu, którego \"Doombang\" przyjął z olbrzymim entuzjazmem. Tych trzech pasjonatów, połączonych wspólnym celem, zaczęło współpracę żeby niebawem ogłosić utworzenie Misfits. <p/>\n<p>\nPierwsza połowa 2015 roku przyniosła zespołowi wiele zmian. Przede wszystkim udało mu się dostać do 2015 NA Challenger Series, po trzech zwycięskich spotkaniach o wyniku 2:0. Zbiegło się to  w czasie ze zmianami w samej organizacji. Drużyna została przemianowana z Misfits na LA Renegades. Powszechnie znany prezenter, Christopher \"MonteCristo\" Mykles, dołączył do drużyny jako współwłaściciel. Pojawienie się kolejnej bardzo dobrze znanej twarzy zasiliło powiększające się, olbrzymie już grono kibiców tej drużyny. W międzyczasie Chris \"Doombang\" Badawi wywołał aferę w społeczeństwie League of Legends, w efekcie czego został wykluczony z uczestnictwa w LCS do końca sezonu 2016. </p>\n<p>\nPomimo tego, że na pierwszy rzut oka gracze z LA Renegades wydawali się przypadkową zbieranią, osiągnęli już swoje pierwsze sukcesy. Skończyli 2015 NA Challenger Series na drugim miejscu, po przegraniu dogrywki z Team Coast, z wynikiem 8:2. Jednak najważniejszym triumfem dla nich były rozgrywki kwalifikacjyjne do NA LCS. Renegaci zmierzyli się z najpoważniejszymi konkurentami z Challenger series. Najpierw wygrali z Team Imagine 2 do 1, a następnie w żazartej walce z Team Coast 3 do 2. Dzięki temu udało im się zrealizować ich najważniejszy cel – dostać się do wiosennego sezonu NA LCS 2016.</p>\n"},"foreignIds":{"drupalId":"4429"},"players":[144,160,272,323,501,680,784],"starters":[144,160,501,680],"subs":[272,323,784]},{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]}],"players":[{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":501,"slug":"ninja","name":"Ninja","firstName":"Geon-woo","lastName":"Noh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ninja-4csesuls.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-30T02:20:51.000Z","bios":{"en_US":"<p>Geon-woo \"Ninja\" Noh was originally meant to be a loan from to the Dragon Knights, but North America seems to agree with him. These days Ninja is most often found with his partner in fun Seraph, and the two solo laners have built up a great dynamic. Team Envy snapped up the duo in 2016 with the hope that giving the old friends a fresh start would propel their new team to victory. Their gamble paid off in the form of Team Envy making the playoffs in their inaugural split together. The team will bank on Ninja and Seraph’s chemistry growing and landing them right back where they want to be -- the playoffs.</p>","de_DE":"Geon-woo „Ninja“ Noh war ursprünglich eine Leihgabe der Dragon Knights, aber Nordamerika scheint ihm zu liegen. Heutzutage trifft man Ninja meistens mit seinem Freund Seraph zusammen an und die beiden Solo-Laner harmonieren großartig. Team Envy verpflichtete das Duo 2016 in der Hoffnung, dass die beiden Freunde ihre neue Mannschaft zum Sieg führen würden. Und ihr Wagnis machte sich bezahlt, als Team Envy gleich im ersten Split die Entscheidungsspiele erreichte. Die Mannschaft hofft darauf, dass Ninjas und Seraphs Harmonie noch besser geworden ist und sie wieder dorthin führen wird, wo sie sein wollen: in die Entscheidungsspiele."},"foreignIds":{"drupalId":"2143","TRLH1":"200000226","TRLH2":"200000130"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":784,"slug":"leonyx","name":"Leonyx","firstName":"Rob","lastName":"Lee","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/leonyx-86twbq9h.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:47.000Z","updatedAt":"2017-01-19T22:25:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4563","TRLH1":"200000223","TRLH2":"200000127"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166}],"scheduleItems":[{"id":"AVIUtHJ5OPWArxM1l4ZV","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:940c9846-3cb7-46f9-bd18-71da52b3ccb9","scheduledTime":"2016-02-20T21:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"6","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"940c9846-3cb7-46f9-bd18-71da52b3ccb9","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"c219fc77-e03a-4db7-91e6-731c6fc2603f","gameHash":"17fd9c177050cf02"}],"videos":[{"id":1001,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:c219fc77-e03a-4db7-91e6-731c6fc2603f","source":"https://www.youtube.com/embed/0UddQOTMIpE?wmode=transparent","createdAt":"2016-02-20T23:12:35.000Z","updatedAt":"2016-02-20T23:12:35.000Z","game":"c219fc77-e03a-4db7-91e6-731c6fc2603f"}],"htmlBlocks":[],"match":{"id":"940c9846-3cb7-46f9-bd18-71da52b3ccb9","name":"REN-vs-IMT","position":25,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],"games":{"c219fc77-e03a-4db7-91e6-731c6fc2603f":{"id":"c219fc77-e03a-4db7-91e6-731c6fc2603f","name":"G1","generatedName":"IMT|REN|G1|940c98463cb746f9bd1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"},{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}]],"timestamp":1456005138332,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001570026","gameRealm":"TRLH1","platformId":"TRLH1:1001570026","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}]],"timestamp":1456005138332,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}