{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AVmEyNMZoUG4HPFjOKGs","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:947e1068-2728-48f2-b977-083ecbf399fd","scheduledTime":"2017-02-05T20:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4","blockLabel":"3","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:95ada0b9-bece-48cc-bd48-d9ee5bde901e"},"match":"947e1068-2728-48f2-b977-083ecbf399fd","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"95ada0b9-bece-48cc-bd48-d9ee5bde901e","league":"2"}],"gameIdMappings":[{"id":"cf26d3e1-eb87-45cc-abfe-afa1428e1acb","gameHash":"dd33ffcf9e219e90"},{"id":"21a1e5b4-00e3-4ba0-ac7f-dd22b8e041c5","gameHash":"7039e555b8821108"},{"id":"6cb562b9-b249-484b-88c2-cc1b30acc80e","gameHash":"4584ef0d5c0d1a28"}],"videos":[{"id":5383,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:cf26d3e1-eb87-45cc-abfe-afa1428e1acb","source":"https://www.youtube.com/embed/ohlLj2sC6NQ?wmode=transparent","createdAt":"2017-02-05T22:22:57.000Z","updatedAt":"2017-02-05T22:22:57.000Z","game":"cf26d3e1-eb87-45cc-abfe-afa1428e1acb"},{"id":5385,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:21a1e5b4-00e3-4ba0-ac7f-dd22b8e041c5","source":"https://www.youtube.com/embed/J-AvFD7uTFA?wmode=transparent","createdAt":"2017-02-05T23:53:23.000Z","updatedAt":"2017-02-05T23:53:23.000Z","game":"21a1e5b4-00e3-4ba0-ac7f-dd22b8e041c5"},{"id":5393,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:6cb562b9-b249-484b-88c2-cc1b30acc80e","source":"https://www.youtube.com/embed/Qi66C5-Yd8Y?wmode=transparent","createdAt":"2017-02-06T01:09:27.000Z","updatedAt":"2017-02-06T01:09:27.000Z","game":"6cb562b9-b249-484b-88c2-cc1b30acc80e"}],"htmlBlocks":[],"match":{"id":"947e1068-2728-48f2-b977-083ecbf399fd","name":"P1-vs-TSM","position":6,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"},{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],"games":{"cf26d3e1-eb87-45cc-abfe-afa1428e1acb":{"id":"cf26d3e1-eb87-45cc-abfe-afa1428e1acb","name":"G1","generatedName":"P1|TSM|G1|947e1068272848f2b977","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"},{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],"standings":{"result":[[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}],[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}]],"timestamp":1486333249054,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}],[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}]],"timestamp":1486327958725,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002060104","gameRealm":"TRLH1","platformId":"TRLH1:1002060104","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"21a1e5b4-00e3-4ba0-ac7f-dd22b8e041c5":{"id":"21a1e5b4-00e3-4ba0-ac7f-dd22b8e041c5","name":"G2","generatedName":"P1|TSM|G2|947e1068272848f2b977","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"},{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}],"standings":{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486338675081,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486332156763,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002060125","gameRealm":"TRLH1","platformId":"TRLH1:1002060125","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6cb562b9-b249-484b-88c2-cc1b30acc80e":{"id":"6cb562b9-b249-484b-88c2-cc1b30acc80e","name":"G3","generatedName":"P1|TSM|G3|947e1068272848f2b977","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"},{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],"standings":{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486343238578,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486336089386,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002060127","gameRealm":"TRLH1","platformId":"TRLH1:1002060127","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486343238579,"source":"bestOf","history":[{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486338675081,"source":"bestOf","closed":true},{"result":[[{"roster":"b3743059-2a49-4999-913c-e2dc394aaef5"}],[{"roster":"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0"}]],"timestamp":1486336089386,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b3743059-2a49-4999-913c-e2dc394aaef5":1,"e6ff0b70-f6e1-4730-bdbb-ec8a6e9e39f0":0}}}