{"teams":[{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]},{"id":264,"slug":"flyquest","name":"FlyQuest","guid":"be7244a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flyquest-89bnqpyh.png","acronym":"FLY","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2017-01-05T18:49:16.000Z","updatedAt":"2017-06-23T01:31:34.000Z","bios":{"en_US":"<p>Formerly Cloud9 Challenger, FlyQuest is about to reap the rewards of its Challenger Series success. The team’s mix of ex-Cloud9 veterans and fresh talent saw them rampage their way through to the 2017 NA LCS Spring Promotion Tournament, earning a spot in the NA LCS.</p>\n\n<p>Behind veteran mid laner Hai’s leadership, the team found unexpected success in the 2017 NA LCS Spring Split. LemonNation played the mastermind with his signature notebook, and Balls served as the team’s muscle in the top lane. Maybe you can teach old dogs new tricks.</p>\n\n<p>Coach: Thomas \"ThinkCard\" Slotkin</p>","de_DE":"FlyQuest, ehemals Cloud9 Challenger, ist drauf und dran, für ihren Erfolg in der Challenger Series belohnt zu werden. Mit einer Mischung aus alten Cloud9-Veteranen und neuen Talenten marschierten sie durch das Frühjahrs-Aufstiegsturnier der NA LCS 2017 und haben sich damit einen Platz in der NA LCS gesichert.\n</p>\nTrotz des neuen Besitzers bleibt die Mannschaft größtenteils unverändert. Unter der Führung des Mid-Laner-Veteranen Hai hat das Team hohe Erwartungen für 2017. LemonNation ist mit seinem unverkennbaren Notizblock zurück und Balls ist bereit, als treibende Kraft in der oberen Lane zu fungieren. Sollte FlyQuest Erfolg haben, sind sie der Beweis dafür, dass man auch einem alten Fuchs neue Tricks beibringen kann.\n"},"foreignIds":{},"players":[57,112,114,116,354,500,549],"starters":[57,112,114,116,549],"subs":[354,500]}],"players":[{"id":57,"slug":"wildturtle","name":"WildTurtle","firstName":"Jason","lastName":"Tran","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wildturtle-3siezu72.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-02T18:43:29.000Z","bios":{"en_US":"<p>Jason “WildTurtle” Tran has earned the \"wild\" part of his name through intense aggression in games. Whereas other AD carries excel at the delicate dance of staying out of reach, firing away, WildTurtle goes full aggro and can be found in melee range as often as not. When it backfires, he looks over-eager... but when it succeeds, the fans go crazy.</p>\n\n<p>After finding little playoff success with Immortals in 2016, WildTurtle made his way back to TSM for the start of 2017. Sporting his trademark all-in style, WildTurtle helped TSM to another title in the spring split. He finally shook off his playoff woes in the 2017 NA LCS Spring Finals, taking down Cloud9 in a close five game series. After Doublelift's return, WildTurtle heads to FlyQuest, where he should fit right in with Hai's aggressive shotcalls.</p>","fr_FR":"La partie « wild » (« sauvage ») du surnom de Jason « WildTurtle » Tran vient de son style de jeu particulièrement agressif. Alors que d'autres carrys AD excellent dans l'art délicat de rester hors de portée et d'attaquer à distance, WildTurtle aime aller au contact et se retrouve bien souvent à portée de mêlée. Quand la situation se retourne contre lui, il donne l'impression d'être trop zélé... mais quand il réussit, ses fans se déchaînent.\n\nAprès avoir connu un succès timide lors des play-offs avec les Immortals en 2016, WildTurtle est revenu chez TSM début 2017. Avec son style agressif caractéristique, il apporte à TSM le mordant qui lui manquait depuis le départ de Doublelift. Il a fini par oublier ses déboires lors de la finale du segment de printemps des LCS NA 2017, en éliminant Cloud9 lors d'un match serré en cinq manches. WildTurtle compte bien tout donner pour connaître un succès similaire au Brésil, lors du Mid-Season Invitational 2017.\n","pl_PL":"Jason „WildTurtle” Tran zawdzięcza „dziką” część swojego przydomka („wild” — z ang. „dziki”) niesamowitej agresji w grze. Podczas gdy inni prowadzący doskonalą delikatny taniec polegający na trzymaniu się poza zasięgiem i atakowaniu z daleka, WildTurtle idzie na całość i dość często można go zobaczyć walczącego w zwarciu. Gdy to się źle skończy, zarzuca się mu nadgorliwość... ale gdy się uda, fani szaleją.\n\nPonieważ nie osiągnął wielkich sukcesów z Immortals w 2016 roku, WildTurtle powrócił do TSM z początkiem 2017 roku. Prezentując swój firmowy, brawurowy styl gry, WildTurtle przywróci TSM agresję, której im brakowało po odejściu Doublelifta. Nareszcie otrząsnął się z problemów w play-offach, pokonując podczas finału wiosny NA LCS 2017 Cloud9 w wyrównanej serii pięciu gier. Wyruszając w podróż do Brazylii na Mid-Season Invitational 2017, zamierza kontynuować ten sukces\n","de_DE":"Jason „WildTurtle“ Tran verdankt das „Wild“ in seinem Namen seiner unglaublichen Aggressivität in den Spielen. Während andere AD-Carrys außerhalb der Reichweite bleiben und dennoch Schaden verursachen, geht WildTurtle immer volles Risiko und ist mindestens genauso häufig in Nahkampfreichweite. Wenn das nach hinten losgeht, wirkt er übereifrig, aber wenn er Erfolg hat, drehen seine Fans durch.\n</p>\nDa er mit den Immortals im Jahr 2016 keinen Erfolg in den Entscheidungsspielen hatte, wechselte WildTurtle Anfang 2017 wieder zu TSM zurück. Mit seinem „Alles oder nichts“-Stil bringt WildTurtle die Aggressivität nach Doublelifts Abgang zu TSM zurück. Er hofft, seine Probleme mit Entscheidungsspielen hinter sich lassen zu können, während er die Lebensleisten seiner Gegner leert, um TSM dabei zu helfen, die Krone im Frühjahrs-Split der NA LCS zu verteidigen.\n","es_ES":"Jason ''WildTurtle'' Tran se ha ganado la parte wild (salvaje) de su nombre gracias a su agresividad en las partidas. Si otros ADC destacan por sus ágiles movimientos, que los hacen inalcanzables y escurridizos, WildTurtle se lanza a tope y a menudo se le puede ver a distancia cuerpo a cuerpo. Cuando le sale el tiro por la culata, queda demasiado impaciente; si le sale bien, el público enloquece.\n\nTras quedarse a dos velas en los playoffs con Immortals en 2016, WildTurtle ha vuelto a TSM al comienzo de 2017. Gracias a su distintivo estilo de darlo todo, WildTurtle volverá a aportar un toque de agresividad a TSM tras la retirada de Doublelift. Logró acabar con su miedo a los playoffs en la final de primavera de la LCS NA 2017, en la que consiguió vencer a Cloud9 en una serie de cinco partidas. Intentará tener el mismo éxito en su viaje a Brasil para jugar en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Jason \"WildTurtle\" Tran ganhou a parte do “wild” do seu nome por causa da suas agressões intensas nos jogos. Enquanto outros carregadores mandam bem na delicada dança de ficar fora de alcance, atirando, WildTurtle ataca agressivamente e pode ser encontrado no combate corpo a corpo frequentemente. Quando isso não dá certo, ele parece muito afobado... mas quando dá, os fãs vão à loucura.</p>\n\n<p>Depois de ter um pouco de sucesso nas eliminatórias com a Immortals em 2016, o WildTurtle voltou para a TSM no início de 2017. Exibindo sua marca registrada de ir com tudo, WildTurtle traz a agressividade de volta à TSM depois da saída do Doublelift. Ele finalmente esqueceu o desgosto das eliminatórias nas Finais de Primavera da LCS NA 2017, derrotando a Cloud9 em cinco partidas acirradas. Ele tentará carregar esse sucesso consigo na viagem ao Brasil para o Mid-Season Invitational 2017.\n\n</p>"},"foreignIds":{"drupalId":"178","TRLH1":"200000251","TRLH2":"200000155","TRLT3":"200000235"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/WILDTURTLEX","twitter":"https://twitter.com/tsmwildturtle"},"champions":[],"liveGameTeam":264},{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":264},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":264},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":264},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":354,"slug":"bigfatlp","name":"bigfatlp","firstName":"Michael","lastName":"Tang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bigfatlp-fvccyz4y.png","hometown":"Canada","region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2017-01-09T18:10:57.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"320"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":500,"slug":"remilia","name":"Remilia","firstName":"Maria","lastName":"Creveling","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/remilia-2xae9ut5.png","hometown":"USA","region":"NA LCS","birthdate":"1995-02-02","createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-09T22:17:03.000Z","bios":{"en_US":"<p>\nMaria \"Remi\" Creveling is one of the most mechanically skilled up-and-coming supports in North America. Commonly known as \"MadWife\" due to her <a href=\"https://www.youtube.com/watch?v=Ju3VybZ3HY8\" target=\"_blank\">impeccable Thresh hooks</a>, Remi can (and has) single-handedly turned the tides of a game due to her individual skill.\n</p>","fr_FR":"<p>Maria « Remilia » Creveling est l'un des supports les plus prometteurs d'Amérique du Nord en termes de\n\nmécaniques de jeu. Également surnommée « MadWife » grâce à ses lancers de grappin impeccables \n\navec Thresh, Remilia peut renverser la tendance d'une partie à elle toute seule grâce à son talent \n\nindividuel (ce qu'elle ne se gêne pas pour faire). Bien qu'elle fasse ses débuts aux LCS NA, Remilia a \n\naccompli suffisamment d'exploits durant les Challenger Series NA et en file solo pour qu'on puisse avoir \n\nla certitude qu'elle saura terroriser son adversaire.</p>","pl_PL":"<p>To absolutnie unikatowy członek LA Renegades. Patrząc na jej mało znaną przeszłość, nikt się nie spodziewał, że w sezonie 6 to właśnie ona zapisze się na stałe w kartach historii League of Legends. Jest pierwszą kobietą, która wzięła udział w rozgrywkach LCS. Jednak dużo ciekawsza od tego faktu jest jej droga do tego celu. Podróż Marii do NA LCS rozpoczęła się bardzo wcześnie - chociaż pasjonuje się dziełem Riot Games od wczesnego pierwszego sezonu, to do trzeciego nie brała udziału w konkursowych rozgrywkach. W lipcu 2013 na miesiąc dołączyła do Curse Academy i miała okazję zagrać w MOBAFire Challenger Series. Przez kolejne 2 lata szukała swojego miejsca na profesjonalnej scenie League of Legends. Maria miała okazję grać z wieloma znanymi zawodnikami, jak np. \"Chaox”. Kompetencje zdobyte podczas tych poszukiwań, sprawiły, że stała się powszechnie znana i poważana wśród profesjonalnych graczy. W marcu 2015 roku dołączyła do Misfits i od tego momentu zaczęły się jej sukcesy.</p>\n<p>Pierwszym znaczącym wyczynem była wygrana w AlphaDraft Challenger League na przełomie kwietnia i maja 2015 roku. Maria i jej zespół przegrali tylko jeden mecz podczas całego wydarzenia. Następnie skończyła Challenger Series z rewelacyjnym wynikiem 8:2, jednak w dogrywce ulegli Team Coast. Ostatecznie w meczach barażowych pokonali Team Imagine 2:1, a następnie Team Coast 3:2. W ten sposób \"Remilia\" stała się pierwszą kobietą, która została zakwalifikowana do rozgrywek LCS. </p>\n<p>Doskonale widać jak Maria rozwijała swoje umiejętności podczas kolejnych sezonów – zaczynała od złota w pierwszym sezonie, a w każdym kolejnym była o szczebel wyżej. W społeczeństwie League of Legends często jest nazywana „Madwife”, ze względu na wyjątkowe umiejętności w grze swoim ulubionym bohaterem – Threshem. Jednak żaden bohater nadający się jako suport nie jest jej obcy. Grając w szeregach LA Renegades wielokrotnie pokazywała, że również potrafi grać na najwyższym poziomie Morganą, Nautilusem oraz Janną. Dużo można się dowiedzieć o jej preferencjach z portali społecznościowych, gdyż jest wyjątkowo aktywna m.in. na Twitterze. Już po pierwszym rzucie oka na profil Marii widać, że uwielbia anime, co też przysporzyło jej wielu wielbicieli.</p>\n"},"foreignIds":{"drupalId":"1327","TRLH1":"1001220129","TRLH2":"1001160179"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166}],"scheduleItems":[{"id":"AVmEyNOXoUG4HPFjOKGz","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:95cd9949-5529-4a7b-88d0-c2ceddc0f650","scheduledTime":"2017-02-05T23:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4","blockLabel":"3","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:95ada0b9-bece-48cc-bd48-d9ee5bde901e"},"match":"95cd9949-5529-4a7b-88d0-c2ceddc0f650","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"95ada0b9-bece-48cc-bd48-d9ee5bde901e","league":"2"}],"gameIdMappings":[{"id":"ddbfedc0-d84d-427c-8701-7c7996819622","gameHash":"2a852b09c150a94e"},{"id":"40133a39-cc13-4a08-97e6-31af8d4d3a76","gameHash":"3081f75ffacd0ca4"}],"videos":[{"id":5394,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:ddbfedc0-d84d-427c-8701-7c7996819622","source":"https://www.youtube.com/embed/4vhDO3YPJVg?wmode=transparent","createdAt":"2017-02-06T01:32:17.000Z","updatedAt":"2017-02-06T01:32:17.000Z","game":"ddbfedc0-d84d-427c-8701-7c7996819622"},{"id":5396,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:40133a39-cc13-4a08-97e6-31af8d4d3a76","source":"https://www.youtube.com/embed/2BIF5SaNjcw?wmode=transparent","createdAt":"2017-02-06T02:23:28.000Z","updatedAt":"2017-02-06T02:23:28.000Z","game":"40133a39-cc13-4a08-97e6-31af8d4d3a76"}],"htmlBlocks":[],"match":{"id":"95cd9949-5529-4a7b-88d0-c2ceddc0f650","name":"IMT-vs-FLY","position":16,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"games":{"ddbfedc0-d84d-427c-8701-7c7996819622":{"id":"ddbfedc0-d84d-427c-8701-7c7996819622","name":"G1","generatedName":"FLY|IMT|G1|95cd994955294a7b88d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"standings":{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486344831099,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486339741871,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002060135","gameRealm":"TRLH1","platformId":"TRLH1:1002060135","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b2ccf5ba-b628-45b0-9283-fe3b59798060":{"id":"b2ccf5ba-b628-45b0-9283-fe3b59798060","name":"G3","generatedName":"FLY|IMT|G3|95cd994955294a7b88d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"},{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"40133a39-cc13-4a08-97e6-31af8d4d3a76":{"id":"40133a39-cc13-4a08-97e6-31af8d4d3a76","name":"G2","generatedName":"FLY|IMT|G2|95cd994955294a7b88d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"},{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}],"standings":{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486347680292,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486342706727,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1002060141","gameRealm":"TRLH1","platformId":"TRLH1:1002060141","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486347680293,"source":"bestOf","history":[{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486344831100,"source":"bestOf","closed":true},{"result":[[{"roster":"aa51266a-790a-41e9-8b71-9912e41a3c22"}],[{"roster":"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2"}]],"timestamp":1486342706727,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"dbe2ee31-aba6-47f3-a262-c2f7c832f8f2":0,"aa51266a-790a-41e9-8b71-9912e41a3c22":1}}}