{"teams":[{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]},{"id":271,"slug":"gold-coin-united","name":"Gold Coin United","guid":"be724e56-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/gold-coin-united-iwq6t55n.png","acronym":"GCU","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:13:17.000Z","updatedAt":"2017-08-12T21:17:46.000Z","bios":{"en_US":"<p>Coach: Yoonsup \"Locodoco\" Choi</p>"},"foreignIds":{},"players":[185,366,529,747,1035,1172,1317,1666],"starters":[185,529,747,1035,1317],"subs":[366,1172,1666]}],"players":[{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":271},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":366,"slug":"fenix","name":"Fenix","firstName":"Jaehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fenix-38i6egfj.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-07T21:31:21.000Z","bios":{"en_US":"<p>\nYou've probably seen Fenix's <a href=”https://youtu.be/Z9D9o4GJv0w?t=36m06s” target=”_blank”>1v4 Azir Quadra</a> highlight more times than you can count, but that's only one of the dozens of memorable moments Jae-hun “Fenix” Kim put up in his debut year in the LCS. An ex-Jin Air Falcon from Korea, the player formerly known as Miso burst onto the scene and into our hearts when he joined Liquid at the start of the 2015 season. With a variety of stylish, colourful hairdos and clips that can ignite promo reels, Fenix is a player who demands attention.\n</p>","fr_FR":"<p>Vous avez sans doute vu son grand moment, le quadruplé à 1 contre 4 avec Azir, plus souvent que vous \n\nn'êtes capable de le dire, mais ce n'était là que l'un des nombreux grands moments de Jae-hun « Fenix » \n\nKim depuis ses débuts aux LCS. Ancien Jin Air Falcon en Corée, ce joueur autrefois connu sous le nom de \n\nMiso a débarqué en force sur la scène et s'est fait une popularité en rejoignant Liquid au début de la \n\nsaison 2015. Confrontés à des combats aussi bouillants que le rouge de sa chevelure, les adversaires de \n\nFenix passent beaucoup de temps à méditer sur Shurima.</p>\n\n<p>Et si l'Empereur est devenu son champion attitré, il lui a fallu bien plus qu'un coup flamboyant pour être \n\nnommé meilleur mid laner des LCS NA 2015. Capable de mettre en permanence la pression, qu'il joue \n\nassassin, tireur ou mage de contrôle, Fenix a enfin trouvé l'occasion de briller en Amérique du Nord. \n\nQuand Fenix arpente la Faille, laissez passer. Ou il vous en coûtera.</p>","pl_PL":"<p>To jeden z najbardziej doświadczonych graczy na świecie, gdyż gra w League of Legends profesjonalnie od 2010 roku. Zaczynał w drużynach Haters i compLexity Gaming. Później, jak stał się bardziej rozpoznawalny na scenie esportowej, został zaproszony do współpracy z Team Dignitas. W tej organizacji zyskał sławę grając Renektonem na top-lanie, zanim, wraz z kolejną zmianą drużyny, przeniósł się do jungli. Ponadto było to jego pierwsze spotkanie z NA LCS. W Team Dignitas spędził prawie okrągły rok, opuszczając go w grudniu 2012 roku. </p>\n<p>\nPoczątkowo miał duże problemy z opanowaniem emocji, w szczególności tych negatywnych. Na przykład, pomijając kwestie słownictwa, zniszczył swoje słuchawki z radości po wygranej grze na 2012 MLG Pro Circuit. Ostatecznie, 4 grudnia 2012 roku, to doprowadziło do wykluczenia jego wszystkich kont z rozgrywki na prawie cały rok. \"IWillDominate\" zrozumiał swoje błędne zachowanie i rozpoczął proces rehabilitacji w oczach środowiska League of Legends. Przede wszystkim dołączył do organizacji Curse Gaming w styczniu 2013 roku. Dalej udzielał się w życiu zawodników - grał w Curse Academy i występował w formie trenera. Jednocześnie zawzięcie pracował nad swoimi reakcjami w obliczu wielkich emocji. Cała historia miała szczęśliwe zakończenie, gdyż Christian nareszcie w październiku 2013 roku mógł wrócić na scenę esportową. Dołączył wtedy oficjalnie do Team Curse jako jungler i spędził tam kolejne dwa niecałe lata. </p>\n<p>\nFuzja i przejście pod opiekuńcze skrzydła Team Liquid wyszła Christianowi na dobre. W pierwszym tygodniu wiosennego sezonu NA LCS 2015 \"IWillDominate\" wygrał nagrodę najbardziej wartościowego gracza. Osiągnął to fenomenalnymi grami Nunu i Jarvanem IV, w których jego łączne KDA wyniosło ponad 13. Później meczom jego drużyny często brakowało komunikacji, która ze względu na dwóch nowych graczy z Korei, była bardzo utrudniona. Jednak z czasem robili postępy, ostatecznie kończąc z wynikiem 9:9 w tym okresie. Największy sukces w karierze Christiana Rivera to letni sezon NA LCS 2015. Wraz z Team Liquid wszedł na wyżyny swoich możliwości. Po zaciętej walce z CLG, TiP i Gravity udało mu się skończyć ten okres na pierwszym miejscu w Ameryce. Niestety wkrótce potem miała miejsce jego największa porażka, a ostatnie osiągnięcia tylko spotęgowały odczucie upadku. Pomimo takich wyników pod koniec sezonu Christianowi nie udało się zakwalifikować do Mistrzostw Świata 2015. Jego marzeniem jest zagranie w MŚ swoimi ulubionymi bohaterami – Shaco i Xin’zhao.\n</p>"},"foreignIds":{"drupalId":"3663","ESPORTSTMNT02":"200000754","TRLH1":"200000301"},"socialNetworks":{"twitch":"http://www.twitch.tv/fenixl0l","facebook":"https://www.facebook.com/fenixl0l","twitter":"https://twitter.com/LiquidFeniX"},"champions":[],"liveGameTeam":271},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":747,"slug":"madlife","name":"Madlife","firstName":"Mingi","lastName":"Hong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/madlife-4tps9t22.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T23:24:25.000Z","bios":{"en_US":"<p>Mingi \"Madlife\" Hong, also referred to as \"god\", is one of the most popular League of Legends players in global esports. He earned the \"god\" moniker due to his ability to see into the future and manipulate his opponents on the Rift in such a way that they always walk into his traps. How else can we explain his Blitzcrank grabs landing successfully when an opponent is Flashing away? And don’t get us started on Thresh. Once the Chain Warden was introduced, Madlife's legend only grew. His uncanny hooks and flays drive the crowd into a joyous frenzy, and leave his opponent’s befuddled and staring at grey screens.</p>","fr_FR":"<p>Min-gi « MadLife » Hong, aussi appelé « god », est l'un des joueurs les plus populaires de l'e-sport international de League of Legends. Son surnom de « god » (« dieu » en français) est dû à sa capacité à prédire l'avenir et à manipuler ses adversaires sur la Faille pour qu'ils tombent dans ses pièges. Sinon, comment expliquer ses Grappins de Blitzcrank réussis lorsque son adversaire fait un Saut éclair ? Et ne parlons même pas de Thresh. Avec l'arrivée du Garde aux chaînes, la légende de MadLife n'a fait que s'amplifier. Ses coups de crochet et son adresse au jeu du Fauchage mettent la foule en délire et ses adversaires se retrouvent à fixer leur écran gris sans même comprendre ce qui leur est arrivé.</p>\n\n<p>Les compétences mécaniques de MadLife font de lui un excellent support et lui valent d'être reconnu comme l'un des meilleurs joueurs au monde dans sa catégorie. CJ Entus ayant été reléguée des LCK, c'est uniquement grâce à son talent que MadLife a été invité à Barcelone. Indépendamment de ce qui s'est passé pendant le segment d'été, MadLife a une chance se mesurer avec brio aux meilleurs joueurs du monde à l'événement All-Stars 2016. Qu'il assène un crochet aveugle dans le brouillard de guerre ou qu'il pulvérise l'ADC adverse, on peut compter sur MadLife pour semer le chaos.</p>","pl_PL":"Min-gi „MadLife” Hong, zwany także „bogiem”, jest jednym z najpopularniejszych zawodników League of Legends w światowym e-sporcie. Zasłużył sobie na przezwisko „boga” swoją zdolnością przewidywania przyszłości i manipulowania rywalami na Summoner’s Rift w taki sposób, że zawsze wpadają w jego pułapki. Bo jak inaczej można wyjaśnić to, że jego Blitzcrank zawsze trafia, gdy przeciwnik odskakuje Błyskiem? I nawet nie wspominajcie o Threshu. Po wprowadzeniu Strażnika Łańcuchów legenda MadLife’a jeszcze się umocniła. Jego niesamowite haki i młynki wprowadzają widownię w szał radości, a przeciwników pozostawiają zdezorientowanych i gapiących się w szary ekran.</p>\n\nUmiejętności mechaniczne MadLife’a przekładają się na oszałamiającą grę w roli wsparcia, co zapewnia mu pozycję jednego z najlepszych wspierających na świecie. To właśnie ta umiejętność przyniosła MadLifowi zaproszenie do Barcelony, szczególnie biorąc pod uwagę odejście CJ Entus z LCK. Bez względu na to, co stało się podczas letniego splitu, MadLife ma szansę zaprezentować na All-Star 2016 swój styl na tle kilku z najlepszych zawodników świata. Obojętnie, czy trafi wyrzuconym na ślepo hakiem przez mgłę wojny, czy zdemoluje prowadzącego rywali, można liczyć na to, że MadLife narobi sporo zamieszania.\n","es_ES":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\" (dios), es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo de \"god\" gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de apoyo deslumbrante y en el reconocimiento como uno de los mejores apoyos del mundo. No es ni más ni menos que por esta habilidad que MadLife ha sido invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus ha quedado relegado en la LCK. Al margen de lo que ocurriese en el split de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al ADC enemigo, podéis contar con que MadLife sembrará el caos.</p>","de_DE":"<p>Min-gi „MadLife“ Hong, auch bekannt als „Gott“, ist einer der bekanntesten „League of Legends“-Spieler der gesamten E-Sport-Szene. Er trägt den Spitznamen „Gott“, weil er in die Zukunft schauen und seine Gegner in der Kluft so manipulieren kann, dass sie immer in seine Fallen tappen. Wir sonst könnte man erklären, dass er mit Blitzcrank auch dann trifft, wenn der Gegner gerade Blitz benutzt? Und mit Thresh wollen wir erst gar nicht anfangen. Als der Kettenwächter vorgestellt wurde, wurde die Legende um MadLife nur noch größer. Seine verblüffenden Haken- und Peitschenangriffe verzücken das Publikum und lassen seine Gegner mit verdutzten Gesichtern vor den Bildschirmen zurück.</p>\n\n<p>MadLife nutzt seine mechanischen Fähigkeiten für überwältigende Unterstützungsspielzüge, die ihn zu einem der besten Supporter der Welt machen. Diese Fähigkeiten allein haben ausgereicht, dass MadLife nach Barcelona eingeladen wurde, vor allem wenn man CJ Entus’ Abstieg aus der LCK bedenkt. Unabhängig davon, was beim Sommer-Split passiert ist, hat MadLife beim All-Stars-Event 2016 die Chance, sich gegen die besten Spieler der Welt zu behaupten. Egal, ob er gerade einen Gegner im Nebel des Krieges mit seinem Haken trifft oder den gegnerischen AD-Carry in Stücke reißt, MadLife wird ordentlich Chaos stiften.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"MadLife\" 홍민기 선수는 전세계 리그 오브 레전드 선수 중 최고의 인기를 누리는 선수 중 하나이며, ‘신’으로 불리까지 합니다. 전장에서 미래를 내다보고 상대의 움직임을 조종해 함정에 빠져들게 하는 능력이 있기 때문이죠. 그런 능력이 아니고서는 점멸로 도망치는 적을 블리츠크랭크 그랩으로 붙잡아오는 이 선수의 플레이를 설명할 수가 없습니다. 쓰레쉬는 말할 것도 없죠. 쓰레쉬가 출시되자마자 MadLife 선수의 전설은 더욱 확고해졌습니다. 이해할 수 없을 만큼 절묘한 사형 선고와 사슬 채찍 활용으로 관객들을 열광시키고, 상대 선수들은 멍하니 회색 화면을 쳐다보게 만들었죠. </p>\n<p style=”font-family:”나눔고딕”;\">Madlife 선수의 뛰어난 피지컬은 서포터로서 빛나는 명장면들을 만들어내며 세계 최고의 서포터 중 하나로 인정받을 수 있었던 밑바탕입니다. 이 선수는 CJ Entus를 승리로 이끌기 위해 집념을 불태우고 있습니다. 어떤 난관을 통과해야 하더라도 말이죠. </p>\n","cs_CZ":"<p>Min-gi „MadLife“ Hong, taktéž známý jako „bůh“, patří mezi nejoblíbenější profesionální hráče League of Legends na světě. Svou přezdívku „bůh“ si vysloužil schopností nahlížet do budoucnosti a manipulovat svými soupeři ve Žlebu tak, aby vždy nakráčeli do jeho pastí. Jak jinak vysvětlit, že se svým Blitzcrankem dokáže pokaždé zachytit protivníka, který se právě stahuje pomocí Skoku? A to ani nemluvíme o Threshovi. Poté, co se hra rozrostla o Řetězového strážce, se MadLife stal doslova legendou. Jeho zákeřné zachytávání a odhazování nepřátel nutí davy diváků řičet nadšením a zmatené soupeře sledovat šedou obrazovku.</p>\n\n<p>Své úžasné mechanické dovednosti využívá MadLife k provádění skvěle načasovaných akcí, pro které je označován za jednoho z nejnadanějších podpůrných hráčů světa. A vzhledem k tomu, že tým CJ Entus sestoupil z LCK, to jsou právě jen a jen jeho schopnosti, jimž MadLife vděčí za pozvánku do Barcelony. Bez ohledu na výsledek letního splitu bude mít MadLife na turnaji All-Star 2016 šanci zařádit si ve Žlebu s těmi nejlepšími z nejlepších. A ať už zrovna bude naslepo střílet hák skrz opar neznáma nebo drtit soupeřova ADC, můžete vzít jed na to, že MadLife ve hře rozpoutá pořádný masakr.</p>","el_GR":"<p>Ο Min-gi \"MadLife\" Hong, γνωστός επίσης απλά ως «θεός», είναι ένας από τους πιο δημοφιλείς παίκτες του League of Legends στη διεθνή σκηνή των esports. Του έδωσαν το ψευδώνυμο «θεός», επειδή μπορεί να προβλέπει τις επόμενες κινήσεις των αντιπάλων και να τις εκμεταλλεύεται με τέτοιο τρόπο, ώστε να πέφτουν στις παγίδες του. Πώς αλλιώς μπορεί να εξηγήσει κανείς ότι καταφέρνει να αρπάξει τον αντίπαλό του με τον Μπλίτζκρανκ, ακόμα και όταν αυτός κάνει Φλας για να ξεφύγει; Για να μην πούμε και για τον Θρες. Όταν ο Δεσμοφύλακας των Ψυχών μπήκε στο παιχνίδι, ο θρύλος του MadLife ενισχύθηκε ακόμη περισσότερο. Η τρομερή ακρίβεια με την οποία χρησιμοποιεί το φανάρι και το μαστίγωμα προκαλεί αμόκ στο ακροατήριο, ενώ οι αντίπαλοί του δεν μπορούν να κάνουν κάτι άλλο από το να κοιτάνε απορημένοι τη γκρίζα οθόνη.</p>\n\n<p>Ο Madlife ξέρει να χειρίζεται τους μηχανισμούς του παιχνιδιού με καταπληκτική μαεστρία. Δεν είναι καθόλου περίεργο που θεωρείται ένας από τους καλύτερους υποστηρικτές στον κόσμο. Το εκπληκτικό του παιχνίδι είναι ο λόγος που ο MadLife κέρδισε αυτήν την πρόσκληση για τη Βαρκελώνη, παρά τον υποβιβασμό των CJ Entus από το LCK. Πέρα από τα όσα συνέβησαν στο Summer Split, ο MadLife θα έχει μια ευκαιρία να μαγέψει το κοινό ενάντια στους καλύτερους παίκτες του κόσμου στο Τουρνουά All-Star 2016. Μπορεί να τον δείτε να πετάει στα τυφλά ένα φανάρι μέσα στην ομίχλη πολέμου ή να κάνει σκόνη τον ADC της άλλης ομάδας. Σε κάθε περίπτωση, ο MadLife θα σπείρει τον τρόμο στους αντιπάλους του.</p>","hu_HU":"Min-gi „MadLife” Hong (aki az „isten” névre is hallgat) az egyik legnépszerűbb League of Legends-játékos a nemzetközi e-sport színterén. Azért kezdték „istennek” hívni, mert valahogy mindig a jövőbe lát, és úgy manipulálja az ellenfeleit a Szurdokban, hogy belesétáljanak a csapdáiba. Hogy máshogy magyarázhatnánk, hogy Blitzcrankkel elkapja az Átvillanással menekülő ellenfeleket? És akkor a Thresh-féle mutatványairól ne is beszéljünk. A Láncok őrének megjelenése óta MadLife még veszélyesebbé vált. Az elképesztő elkapások és nyúzások őrjöngő éljenzést váltanak ki a nézők körében, az ellenfeleknél meg általában szürke képernyőket.</p>\n\nMadlife játékbeli képességei lenyűgöző támogatói teljesítményt eredményeznek, és egyértelműen ő az egyik legjobb támogató a világon. MadLife a saját képességei jogán került a barcelonai fellépők közé, különösen, hogy a CJ Entus kibukott az LCK-ből. A nyári szakaszban történtek ellenére MadLife a 2016-os All-Star gálán a világ néhány legjobbjával játszhat. A háború ködébe kilőtt horgok, porrá zúzott lövészek: MadLife elemében lesz.\n","it_IT":"<p>Min-gi \"MadLife\" Hong, anche conosciuto come \"dio\", è uno dei giocatori di LoL più popolari nel mondo degli eSport. Si è guadagnato il nomignolo di \"dio\" per la sua abilità di prevedere il futuro e manovrare i suoi avversari in Landa in modo da farli sempre finire nelle sue trappole. Come altro spiegare il fatto che riesca a mettere a segno le sue prese con Blitzcrank mentre l'avversario usa Flash? Per non parlare di Thresh. Dopo l'arrivo del carceriere, la leggenda di MadLife è diventata ancora più... leggendaria. I suoi ganci e le sue sferzate impossibili fanno impazzire il pubblico e lasciano i suoi avversari impotenti davanti a una schermata grigia.</p>\n\nLe abilità meccaniche di MadLife si traducono in un'incredibile capacità di supporto e gli sono valse l'ingresso nell'élite dei supporti. È solo grazie a questa abilità che MadLife è riuscito a ottenere un biglietto per Barcellona, soprattutto alla luce della retrocessione dei CJ Entus in LCK. A prescindere da quanto accaduto al Summer Split, MadLife ha ora una nuova opportunità per scontrarsi con alcuni dei più grandi giocatori del mondo all'All-Star 2016. Sia che si prepari a lanciare i suoi uncini alla cieca nella nebbia di guerra o a polverizzare gli ADC avversari, MadLife porterà sicuramente altro caos nella Landa.\n","ro_RO":"Min-gi \"MadLife\" Hong, cunoscut și ca ''zeul'', este unul dintre cei mai populari jucători de League of Legends din lumea eSports. Porecla ''zeul'' a primit-o datorită abilității de a prezice viitorul și de a-și manipula adversarii din Rift în așa fel încât să-i cadă mereu în capcane. Cum altfel se poate explica faptul că-și trage cu succes adversarii cu Blitzcrank, fix când aceștia folosesc ''Flash''? Asta ca să nu vorbim de jocul lui cu Thresh. Când l-am lansat pe temnicerul blestemat, legenda lui MadLife a luat proporții. Mulțimea e în delir când își folosește lanțul și ''Tortura'' în mod creativ, iar adversarul rămâne cu ecranul gri și tot nu se prinde ce-a pățit.</p>\n\nAbilitățile mecanice ale lui Madlife se transpun în momente impresionante de suport și i-au adus un renume mondial. Pe baza îndemânării sale, MadLife a obținut invitația la Barcelona în ciuda faptului că CJ Entus a fost retrogradată din LCK. Indiferent de ceea ce s-a întâmplat în etapa de vară, MadLife are acum ocazia de a-i copleși pe unii dintre cei mai buni jucători din lume la All-Star Event 2016. Fie că nimerește prin negura războiului cu un cârlig sau că pulverizează ADC-ul advers, puteți conta pe MadLife să creeze haos.\n","es_AR":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","es_MX":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","pt_BR":"<p>Min-gi \"MadLife\" Hong, também conhecido por alguns como “god” (deus), é um dos jogadores mais populares de League of Legends do mundo. Ele recebeu o título de “deus” devido à sua habilidade de prever o futuro e manipular seus oponentes em Summoner’s Rift, de modo que eles sempre caíam em suas armadilhas. De que outra forma podemos explicar os puxões de Blitzcrank acertando, mesmo quando um oponente deu Flash? E nem vamos entrar no mérito do Thresh. Quando o Guardião das Correntes entrou no jogo, a lenda do MadLife só cresceu mais. Seus ganchos e Esfolar “mentirosos” deixaram o público maluco e os oponentes boquiabertos enquanto olhavam para suas telas cinzas.</p>\n\n<p>A habilidade mecânica de MadLife se transforma em jogadas incríveis de suporte e o reconhecimento como um dos melhores do mundo. É contando com essa habilidade que MadLife conseguiu garantir sua ida para Barcelona, especialmente considerando que a CJ Entus foi rebaixada na LCK. Apesar do que aconteceu na Etapa de Verão, MadLife tem uma chance de mostrar novamente as melhores jogadas do mundo no Evento All-Star 2016. Seja acertando um gancho na névoa de guerra ou acabando com os atiradores adversários, você pode contar com MadLife para trazer o caos.</p>"},"foreignIds":{"drupalId":"370","TRLH1":"200000303","TRLH2":"1001140041","TRKR1":"225038","TRLH3":"1001360055","TRLH4":"1001310055","ESPORTSTMNT02":"200000756"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1035,"slug":"fly","name":"Fly","firstName":"Yongjun","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fly-f96z2al7.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:08:52.000Z","updatedAt":"2017-07-20T21:11:42.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT06":"200000439","ESPORTSTMNT02":"200000767","TRLH1":"200000709"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1172,"slug":"qwerm","name":"BonQuish","firstName":"Alec","lastName":"Warren","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/qwerm-9fij28rx.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-03-08T01:37:03.000Z","updatedAt":"2017-06-14T23:25:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000766"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1317,"slug":"rikara","name":"Rikara","firstName":"Richard","lastName":"Oh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rikara-eu8jm8ll.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-06-03T00:18:15.000Z","updatedAt":"2017-06-14T23:10:26.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000755","TRLH1":"200000302"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1666,"slug":"whyin","name":"Whyin","firstName":"Ryan","lastName":"Karaszkiewicz","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whyin-3fapjeh2.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-11T00:17:14.000Z","updatedAt":"2017-06-14T23:04:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000757","TRLH1":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AV2kZqIbQMQFcjhwbQ-G","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:96fd353f-222f-4a99-abe5-aca2cd1c2ca3","scheduledTime":"2017-08-11T19:00:00.999+0000","tags":{"blockLabel":"Spring Promotion","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:b15da728-7e6f-4e81-b44e-953596cf49e1","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"96fd353f-222f-4a99-abe5-aca2cd1c2ca3","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"b15da728-7e6f-4e81-b44e-953596cf49e1","league":"2"}],"gameIdMappings":[{"id":"76ac81b4-1cf5-48ec-9e01-df7a12cd20ae","gameHash":"89056e0e99252c06"},{"id":"31003a61-fe0f-452d-9309-5f760ec813e9","gameHash":"5a0b4706fe4ec996"},{"id":"6e0cefe6-9139-40ca-b7d5-a28c492b0664","gameHash":"ea469a7ce51b658c"},{"id":"90a4b8bf-7a70-491c-8078-7c6184eef321","gameHash":"9a638257ef89a44d"},{"id":"16e75f1e-0e0b-4813-afcc-8539838a8a32","gameHash":"3d75211a3f839c4c"}],"videos":[{"id":8472,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:6e0cefe6-9139-40ca-b7d5-a28c492b0664","source":"https://www.youtube.com/embed/NHX5tpq-QSY?wmode=transparent&rel=0","createdAt":"2017-08-11T21:27:16.000Z","updatedAt":"2017-08-11T21:27:16.000Z","game":"6e0cefe6-9139-40ca-b7d5-a28c492b0664"},{"id":8473,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:16e75f1e-0e0b-4813-afcc-8539838a8a32","source":"https://www.youtube.com/embed/7DocXqnwJeU?wmode=transparent&rel=0","createdAt":"2017-08-11T21:54:08.000Z","updatedAt":"2017-08-11T21:54:08.000Z","game":"16e75f1e-0e0b-4813-afcc-8539838a8a32"},{"id":8475,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:76ac81b4-1cf5-48ec-9e01-df7a12cd20ae","source":"https://www.youtube.com/embed/3WTXrpDy2qw?wmode=transparent&rel=0","createdAt":"2017-08-11T22:36:04.000Z","updatedAt":"2017-08-11T22:36:04.000Z","game":"76ac81b4-1cf5-48ec-9e01-df7a12cd20ae"},{"id":8481,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:31003a61-fe0f-452d-9309-5f760ec813e9","source":"https://www.youtube.com/embed/V7tTqPeFEys?wmode=transparenthttps://www.youtube.com/embed/V7tTqPeFEys?wmode=transparent&rel=0","createdAt":"2017-08-11T23:39:27.000Z","updatedAt":"2017-08-11T23:39:27.000Z","game":"31003a61-fe0f-452d-9309-5f760ec813e9"},{"id":8482,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:90a4b8bf-7a70-491c-8078-7c6184eef321","source":"https://www.youtube.com/embed/CjNn-b6bROs?wmode=transparent&rel=0","createdAt":"2017-08-12T01:10:37.000Z","updatedAt":"2017-08-12T01:10:37.000Z","game":"90a4b8bf-7a70-491c-8078-7c6184eef321"}],"htmlBlocks":[],"match":{"id":"96fd353f-222f-4a99-abe5-aca2cd1c2ca3","name":"match-b","position":1,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1},{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],"games":{"6e0cefe6-9139-40ca-b7d5-a28c492b0664":{"id":"6e0cefe6-9139-40ca-b7d5-a28c492b0664","name":"G1","generatedName":"GCU|P1|G1|96fd353f222f4a99abe5","input":[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1},{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],"standings":{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502486663673,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502482240666,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002310165","gameRealm":"TRLH1","platformId":"TRLH1:1002310165","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"90a4b8bf-7a70-491c-8078-7c6184eef321":{"id":"90a4b8bf-7a70-491c-8078-7c6184eef321","name":"G5","generatedName":"GCU|P1|G5|96fd353f222f4a99abe5","input":[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1},{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],"standings":{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502500075642,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502496020195,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002310179","gameRealm":"TRLH1","platformId":"TRLH1:1002310179","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"16e75f1e-0e0b-4813-afcc-8539838a8a32":{"id":"16e75f1e-0e0b-4813-afcc-8539838a8a32","name":"G2","generatedName":"GCU|P1|G2|96fd353f222f4a99abe5","input":[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2},{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],"standings":{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502488810977,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}]],"timestamp":1502485599483,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002310173","gameRealm":"TRLH1","platformId":"TRLH1:1002310173","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"76ac81b4-1cf5-48ec-9e01-df7a12cd20ae":{"id":"76ac81b4-1cf5-48ec-9e01-df7a12cd20ae","name":"G3","generatedName":"GCU|P1|G3|96fd353f222f4a99abe5","input":[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1},{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],"standings":{"result":[[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}]],"timestamp":1502491326924,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}]],"timestamp":1502488890141,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002310175","gameRealm":"TRLH1","platformId":"TRLH1:1002310175","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"31003a61-fe0f-452d-9309-5f760ec813e9":{"id":"31003a61-fe0f-452d-9309-5f760ec813e9","name":"G4","generatedName":"GCU|P1|G4|96fd353f222f4a99abe5","input":[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2},{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}],"standings":{"result":[[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}]],"timestamp":1502495121211,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":2}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42","breakpoint":"04fc7d81-f625-43c5-8683-ec294340b8d0","standing":1}]],"timestamp":1502492189635,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002310177","gameRealm":"TRLH1","platformId":"TRLH1:1002310177","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c"}]],"timestamp":1502500075643,"source":"bestOf","history":[{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],[{"roster":"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c"}]],"timestamp":1502496020195,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"73c58ccc-48a4-4fc4-add2-97bbb39f9c8c":0,"2b9954bf-3f2a-4802-8feb-c987b12d1f42":1}}}