{"teams":[{"id":46,"slug":"najin-e-mfire","name":"Kongdoo Monster","guid":"be6ca5b1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/najin-e-mfire-3zqwbtbv.png","acronym":"KDM","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-09-16T22:35:59.000Z","updatedAt":"2017-02-28T19:31:09.000Z","bios":{"en_US":"<p>The members of Kongdoo Monster are a resilient bunch. After they were knocked out of the LCK by MVP following Champions Spring 2016, the team rallied and earned a spot in Champions Spring 2017. With a new season ahead of them, Kongdoo will look to avoid their past mistakes and prove they belong among the best Korean teams in the world.</p>"},"foreignIds":{"drupalId":"895"},"players":[741,794,1048,1049,1050,1425],"starters":[794,1048,1049,1050,1425],"subs":[741]},{"id":174,"slug":"afreeca-freecs","name":"Afreeca Freecs","guid":"be70e9f1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/afreeca-freecs-4melt1cj.png","acronym":"AFS","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2016-01-06T20:53:09.000Z","updatedAt":"2017-01-12T19:50:44.000Z","bios":{"en_US":"<p>The Afreeca Freecs will be looking for consistency in 2017. During Champions Summer 2016, the team managed a 2-0 record against superpower SK telecom T1. They snuck into the playoffs after finishing 8-10, but were quickly defeated by Samsung Galaxy. The Freecs went on to play in the Regional Qualifier, where they took down Jin Air Green Wings in the first round. Unfortunately, Samsung Galaxy knocked them out of contention in a rematch.</p>"},"foreignIds":{},"players":[120,308,401,767,800,1688],"starters":[120,401,767,800,1688],"subs":[308]}],"players":[{"id":120,"slug":"kuro","name":"Kuro","firstName":"Seohaeng","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kuro-1f1b5va0.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-05-31T00:37:36.000Z","bios":{"en_US":"<p>Seohaeng \"Kuro\" Lee first entered the esports scene in 2013 when he joined Incredible Miracle in the LCK. However, it wasn’t until 2014 with the ROX Tigers that Kuro started to crush his competition. Ever the team player, Kuro has shown an aptitude to pick up whatever champions are meta and consequently sports an absolutely massive champion pool.\n</p>\n<p>\nKuro’s deep reservoir of champions has allowed him to continually evolve as a player and his enemies are often left guessing at what he’s going to play. This helped the ROX Tigers take their first-ever LCK trophy home this summer, but they fell in the semifinals at the 2016 World Championship. He'll take up the mid lane for the Afreeca Freecs in 2017.\n</p>","fr_FR":"<p>Seo-haeng « Kuro » Lee a fait son apparition sur la scène e-sport en 2013 lorsqu'il s'est joint à Incredible Miracle au cours des LCK. Cependant, c'est en 2014, avec KOO Tigers, que Kuro a commencé à affirmer sa supériorité sur la concurrence. Avec un taux de victoires de 100% avec LeBlanc, Viktor et Lissandra pendant le Segment de printemps des LCK 2015, Kuro a montré qu'il pouvait concourir pour le titre de meilleur mid laner des LCK. Et n'oublions pas qu'il a obtenu ces scores contre quelques-uns des meilleurs mid laners du monde (y compris Faker et CoCo).\n</p>\n<p>\nCependant, Kuro et KOO n'ont pas encore traduit leurs exploits locaux en trophées internationaux. Ils ont témoigné de faiblesses sur le plan mental et émotionnel dans les matchs tendus. S'agirait-il du CLG coréen ?\n</p>","pl_PL":"<p>Seo-haeng „Kuro” Lee po raz pierwszy pojawił się na scenie e-sportowej w 2013 r., gdy dołączył do Incredible Miracle w LCK. Jednakże swoim przeciwnikom dał się we znaki dopiero w 2014 r. w szeregach KOO Tigers. Dzięki zdobytemu podczas wiosennego splitu LCK 2015 współczynnikowi zwycięstw wynoszącemu 100%, ilekroć grał LeBlankiem, Viktorem i Lissandrą, Kuro udowodnił, że jest jednym z najlepszych środkowych w LCK. Nie zapominajmy też, że konkurencję stanowili najlepsi zawodnicy ze środkowej alei na świecie, tacy jak Faker i CoCo.\n</p>\n<p>\nJednakże Kuro i KOO muszą jeszcze nauczyć się sprawiać, by ich krajowe sukcesy przekładały się na międzynarodowe trofea. Gdy dochodziło do samych meczów, zdarzało im się okazywać słabość mentalną i emocjonalną. Czyżbyśmy znaleźli koreański odpowiednik CLG?\n</p>","de_DE":"<p>Seo-haeng „KurO“ Lee betrat die E-Sport-Szene im Jahr 2013, als er bei Incredible Miracle in der LCK anheuerte. Aber erst ein Jahr und einen Wechsel zu den ROX Tigers später begann KurO, seine Gegner dem Erdboden gleichzumachen. KurO war von Anfang an ein Teamspieler, konzentrierte sich seit jeher auf die Champions des Metaspiels und konnte infolgedessen schon immer auf einen großen Champion-Pool zurückgreifen.</p>\n\n<p>Dank seines großen Champion-Vorrats konnte sich KurO ständig spielerisch weiterentwickeln. Seine Gegner können oft nur raten, welchen Champion er spielen wird. Das war mit ein Grund dafür, dass die ROX Tigers in diesem Sommer erstmals die LCK gewinnen konnten. Während KurO und seine Kameraden die Weltmeisterschaft 2016 dominieren wollen, ist eines sicher: Keiner weiß, was KurO alles aus dem Ärmel zaubern wird.</p>","es_ES":"<p>Seo-haeng ''KurO'' Lee comenzó su carrera profesional en 2013 al unirse a Incredible Miracle en la LCK. Sin embargo, no fue hasta 2014 cuando comenzó a demostrar su verdadero potencial junto a los ROX Tigers. Además de ser un gran jugador en equipo, KurO ha demostrado ser capaz de seleccionar cualquier campeón que esté en el metajuego, y por consiguiente maneja un repertorio enorme de campeones.</p>\n\n<p>La gran reserva de campeones de KurO le ha permitido evolucionar constantemente como jugador y sus enemigos no suelen poder adivinar con quién va a jugar. Esto ha ayudado a ROX Tigers a llevarse a casa este verano su primer trofeo de la LCK. KurO y sus compañeros buscan conquistar el Campeonato Mundial 2016, pero una cosa está clara: nunca sabrás qué as guarda KurO bajo la manga.</p>","pt_BR":"<p>A primeira aparição de Seo-haeng \"Kuro\" Lee no cenário de eSports foi em 2013 quando ele se juntou à Incredible Miracle para a LCK, mas só foi no ano de 2014 junto com a ROX Tigers que Kuro começou a esmagar a competição. Como um forte jogador de equipe, Kuro mostrou sua aptidão em escolher qualquer campeão necessário para o meta e consequentemente formou uma gama enorme de campeões.</p>\n\n<p>O grande elenco de campeões de Kuro permitiu que ele continuasse a evoluir como jogador e seus inimigos quase nunca sabem com quem ele vai jogar. Isso ajudou a ROX Tigers a levar para casa seu primeiro troféu da LCK esse verão. Enquanto Kuro e companhia tentam dominar o Campeonato Mundial 2016, uma coisa é certa: você nunca sabe o que Kuro pode estar escondendo em suas mangas.</p>","ko_KR":"<p>\"Kuro\" 이서행 선수는 2013년 Incredible Miracle에 입단하며 e스포츠 무대에 첫발을 들여놓았습니다. 하지만 2014년에 ROX Tigers로 이적하고 나서야 본격적으로 압도적인 기량을 보이기 시작했죠. 2015 LCK 스프링에서 르블랑, 빅토르, 리산드라로 100% 승률을 기록했던 Kuro 선수는 LCK 수위급 미드 라이너다운 실력을 여실히 드러냈습니다. 게다가 Faker 선수와 CoCo 선수를 비롯한 세계 최고의 미드 라이너들과 맞서 강력한 모습을 보여주었죠.</p>\n</p>Kuro 선수를 비롯한 ROX Tigers는 2015년 월드 챔피언십 4강에 올랐을 만큼 대단한 실력을 보여주고 있죠.</p>\n","es_AR":"<p>La primera participación de Seo-haeng «KurO\" Lee en la escena de esports fue en el 2013, cuando se unió a Incredible Miracle en la LCK. Sin embargo, no fue sino hasta el 2014 con ROX Tigers que KurO empezó a arrasar en la competencia. Como gran jugador del equipo, KurO ha demostrado su capacidad para lograr todas las metas de campeones que se propuso, lo que le permitió tener un grupo de campeones increíblemente poderoso.</p>\n\n<p>La amplia reserva de campeones de KurO le ha permitido evolucionar constantemente como jugador, y sus enemigos se preguntan siempre cuál será su próxima jugada. De esta forma, los ROX Tigers lograron llevar el primer trofeo de LCK de su historia a casa este verano. Ante el deseo de KurO y compañía de dominar el Campeonato Mundial 2016, una cosa es segura: uno nunca sabe qué se trae KurO bajo la manga.</p>"},"foreignIds":{"drupalId":"886","ESPORTSTMNT06":"200000382"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":308,"slug":"spirit","name":"Spirit","firstName":"Dayun","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/spirit-11wuu9ni.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-05-31T00:31:17.000Z","bios":{"en_US":"<p>\nDa-yun \"Spirit\" Lee is one of the most hyped players to enter the EU LCS in the past several years (or possibly <em>ever</em>). While the power of his spirit faded somewhat during the year he spent getting (mostly) crushed with Team WE in the LPL, Spirit is still one of the best junglers in the game. He was a key member of the highly-rated 2014 Samsung Blue squad and held his own when surrounded by names like dade and Deft. \n</p>\n<p>\nSpirit had an underwhelming 2016 EU LCS season by his astronomical standards, but throughout the year he had flashes of brilliance with his ultra-aggressive jungling style. Back in the LCK, he now has a chance to bring his aggression to a new level.\n</p>","de_DE":"<p>Er ist nicht nur einer der besten Jungler der Geschichte, sondern hat auch das liebreizendste Lächeln in League of Legends. Da-yoon „Spirit“ Lee ist einer der drei Neuzugängen Fnatics für 2016, nachdem er für seine Verhältnisse ein ziemlich ernüchterndes Jahr in China verbrachte. In der Uniform von Team WE hielt der ehemalige Samsung Blue-Jungler seine Mannschaft im Alleingang in der chinesischen Erstliga LPL. Kaum ein anderer Spieler kann bis heute eine solche Tat vorweisen, bis vielleicht auf Sang-hyeok „Faker“ Lee während der enttäuschenden Phase SKTelecom T1 Ks im Jahr 2014. Trotz dessen ließ er sich niemals unterkriegen und hielt stets den Kopf oben. Wenn man ihn danach fragte, wie er sich fühlte, verteidigte er seine Kameraden und sprach vom gemeinsamen Scheitern und Gewinnen. </p>\n\n<p><h2> Spirits Pechsträhne</p></h2>\n<p>Es scheint, als wäre 2015 ein Jahr gewesen, welches Spirit nicht gerecht geworden ist, denn immerhin gehörte er einer Mannschaft an, welche im Vorjahr zu den besten der Welt gehörte. Mit dem Samsung Blue-Logo auf der Brust hat er seit Ende 2013 mit seinem Schwesterteam die koreanische Liga OGN Champions dominiert. In seinem ersten Split überhaupt gewann der damals achtzehnjährige Spieler den Frühlingstitel 2014 gegen ein überraschend gut spielendes Najin White Shield. Im darauffolgenden Sommer schliff er nur knapp am Pokal vorbei, als er wieder einmal das Finale bestritt, jedoch im fünften Spiel der Serie KT Rolster Arrows unterlag.  </p>\n\n<p>Zu dieser Zeit zog er viel Aufmerksamkeit des Publikums auf sich, da er der Spielmacher seiner Mannschaft war und schnell zum Top 3-Jungler in Korea aufwuchs. Er war einer der wenigen Jungler, welche die Fertigkeit hatten, mithilfe ihres aggressiven Spielstils ihren individuellen Vorteil in einen Vorteil für die gesamte Mannschaft zu konvertieren. So verhalf er in vielen Spielen seinen Star-Carries Uh-jin „dade“ Bae und Hyuk-kyu „Deft“ Kim zu einer komfortablen Position, um schließlich das Spiel an sich zu reißen. Mit ihnen formte Spirit einen Kader, der exzellent im Team kämpfen konnte und ebenso in Lategame-Manövern glänzte.  </p>\n\n<p>Im Herbst 2014 kämpfte er sich fast mühelos in die KO-Phase der Weltmeisterschaft und ließ sein heutiges Team Fnatic ausscheiden. Mit leuchtenden blauen Haaren besiegte er Cloud9 in einem zerstörerischen 3-1 und stand vor seinen Freunden und Titelfavoriten Samsung Galaxy White. Trotz der Geschichte zwischen den beiden Schwestermannschaften, welche Spirits Samsung Blue bevorteilte, hatte er nicht den Hauch einer Chance. In drei kurzen Partien war sein Schicksal besiegelt und er ließ sich mit einem bittersüßen Geschmack im Mund von seinen Teamkollegen umarmen.  </p>\n\n<p>„Das war das erste Mal, dass ich in auf einer offenen Bühne gespielt habe. Ich konnte die gleiche Luft so vieler ausländischer Menschen atmen und mit ihnen an einem Ort verbunden sein, was wirklich eine aufregende Erfahrung ist“ – Spirit während der Gruppenphase in Singapur.  </p>\n\n<p><h2> Zeit in China</p></h2>\n<p>Wenige Monate später wurde der mittlerweile erfahrene Koreaner in der LPL unter Vertrag genommen. Die chinesische Mannschaft Team WE erhoffte sich mit einem außergewöhnlichen Talent wie Spirit, wieder zu altem Glanz zurückzufinden. Schnell war den WE-Fans klar, ihr Import war tatsächlich ihre einzige Hoffnung. Team WE hatte nicht nur mangelhafte Spieler, sondern fanden die Spieler ebenso nicht auf die gleiche Ebene, um zusammenarbeiten zu können. Spirit war deutlich in einer Liga über seinen Kameraden und gewann mit eigener Kraft für sein Team Begegnung um Begegnung.  </p>\n\n<p>In seiner Karriere hat Spirit einen enorm aggressiven Spielstil entwickelt. Mithilfe von unkonventionellen Pfaden durch den Jungle überrascht er seine Gegner, wenn er vor ihrer Nase auftaucht, wo andere Jungler zu diesem Zeitpunkt ganz woanders sein sollten. Als Mittel zum Zweck dienen zum übermäßig größten Teil Nidalee und Gragas, öfters auch Elise und Rek’Sai. Was ihn aber von anderen Junglern in diesem Aspekt abhebt ist, dass er Fizz relativ oft auswählt. Der Grund dafür wurde bereits genannt: Er war der Star von Team WE und musste seine Kameraden ohne jegliche Hilfe stützen. Fizz ist ein Champion, welcher ein Spiel an sich reißen kann und war daher passend für Spirits Situation. Im Jahr 2015 konnte Fnatic zeigen, dass sie trotz Sprachbarrieren mühelos Koreaner in ihr Team einbinden konnte, wird ihnen dieser Coup auch für 2016 gelingen? </p>","pl_PL":"<p>Pomimo koreańskiego pochodzenia \"Spirit\" jest bardzo dobrze znany na całym świecie. Swoją karierę profesjonalnego gracza zaczął w swojej ojczyźnie, Korei, w czerwcu 2013 roku. Jeszcze niedoświadczony Lee Da-yoon dołączył wtedy do MVP Blue, parę miesięcy później przemianowanego na Samsung Blue. W tym zespole osiągnął swoje największe sukcesy i zaistniał na esportowej scenie. W zimowym PANDORA.TV Champions Winter jego nadzieje na podium zostały przekreślone w ćwierćfinałach przez niepokonane SKT T1. Zupełnie inaczej potoczyły się losy jego drużyny w kolejnym sezonie koreańskiej ligi. Rozgrywki podsumowujące ten okres rozpoczęła od zemsty na SKT T1 również w ćwierćfinałach. Później pokonała siostrzaną drużynę Samsung Ozone w półfinałach, a następnie zdominowała Najin White Shield w finałach. Lee Da-yoon wraz z mid-lanerem, „dade”, mieli olbrzymi wpływ na wynik tych rozgrywek. Kolejnym wielkim sukcesem junglera Samsung Blue jest udział w Mistrzostwach Świata 2014, gdzie jego drużyna była głównym faworytem. Ze swojej grupy wyszedł na pierwszym miejscu z wynikiem 5:1. Potem pokazał jak prowadzić zespół do zwycięstwa Lee Sinem w ćwierćfinałach przeciwko Cloud9 – \"Spirit\" miał najwięcej zabójstw i najmniej śmierci w trzecim meczu. Pechowo na drodze po tytuł w półfinałach, spotkał się z dobrze znaną drużyną – Samsung White, która również był faworytem tego wydarzenia. Niestety siostrzana ekipa spod skrzydeł Samsunga lepiej wykorzystała nietypową znajomość swoich przeciwników i wygrała z Samsung Blue. Nie umniejsza to osiągnięcia Lee’a Da-yoona, ponieważ mało który zawodnik może się pochwalić dojściem do półfinału w Mistrzostwach Świata.</p>\n\n<p>Wkrótce po tym epizodzie, obie wyżej wymienione drużyny zostały rozwiązane. Jednak \"Spirit\" nie zamierzał kończyć swojej kariery profesjonalnego gracza. W grudniu 2014 roku dołączył do chińskiego najstarszego klubu esportowego – World Elite. Pierwsze tygodnie w nowej organizacji były dla niego udane, gdyż zajął drugą pozycję w Demacia Cup, przegrywając w finale z EDG wynikiem 2 do 3. Dzięki świetnemu występowi WE podczas pierwszej odsłony 9 sezonu IEM w Shenzhen, cała drużyna została zaproszona na Mistrzostwa Świata IEM odbywające się w Katowicach wiosną 2015 roku. Na tym wydarzeniu Lee Da-yoon powtórnie pokazał, że dalej jest światowej klasy junglerem. Kiedy grał swoimi ulubionymi postaciami - Jarvanem IV, Rek’sai i Lee Sinem, robił wrażenie, że samotnie ustawia mecz na korzyść swojego zespołu. Dzięki jego fenomenalnej grze World Elite wygrał między innymi z: GE Tigers, Gambit Gaming i CJ Entus – weteranami takich imprez. Uległ dopiero w walce z Team SoloMid, zajmując drugie miejsce na tym prestiżowym spotkaniu. </p>\n\n<p>Pomimo doskonałego początku członkostwa w World Elite, cały skład nie radził sobie w regularnej chińskiej lidze. Na pewno w pewnym stopniu problemem dla Lee’a Da-yoona była bariera językowa, a wiadomo jak ważną rolę pełni komunikacja w League of Legends. Ostatecznie WE niewiele osiągnęło podczas reszty 2015 roku, z czego najbardziej dotkliwa była porażka w kwalifikacjach do Mistrzostw Świata 2015. W związku z tym w listopadzie 2015 roku \"Spirit\" pożegnał się z chińską elitą, przed opuszczeniem WE zdążył jeszcze podziękować swoim fanom, że wciąż są z nim pomimo zmian zespołów. W wiosennym sezonie 2016 spróbował sił w trzecim regionie, w szeregach jednej z najstarszych europejskich organizacji – Fnatic. Swoje przenosiny skomentował zwięźle: „Wcześniej wybrałem dobrą pensję, teraz wybieram doskonałą drużynę ze świetnymi zawodnikami. Poza tym i tak chciałem się nauczyć angielskiego.”</p>\n","fr_FR":"<p>Da-yun « Spirit » Lee est peut-être l'un des joueurs les plus attendus aux LCS EU de ces dernières années (voire <em>de tous les temps</em>). Bien qu'il ait passé l'année à se faire démolir avec Team WE en LPL, Spirit reste l'un des meilleurs junglers du jeu. C'était un membre clé de la fameuse équipe de Samsung Blue en 2014 et il avait su se faire une place aux côtés de grands noms, comme dade et Deft. Chez Fnatic, où pratiquement chaque poste est occupé par un joueur de talent à l'aube des LCS EU 2016, Spirit a une chance fantastique de retrouver le sommet de la compétition.</p>","es_ES":"<p>Para muchos aficionados occidentales Spirit Lee ‘Spirit’ Da-yoon es un jungla agresivo pero orientado a hacer crecer a un compañero a su lado, como pasó con Bae ‘Reignover’ Eo-Jin en el pasado. Y probablemente, esta definición es la que respeta más la filosofía de Fnatic del año pasado a causa del gran nivel mostrado por Fabian ‘Febiven’ Diepstraten, que podría ser una de las principales armas del equipo. Pero decir esto de Spirit es como no decir nada.</p>\n\n<p>Spirit creció en Corea como uno de los mejores junglas en el mundo, primero con MVP Blue y luego bajo la organización de Samsung. Tras la sombra de varios de los junglas más agresivos y con más presencia en el mapa, el nuevo coreano de Fnatic no se quedaba atrás. Él no destacó sobre sus compañeros, sino que constantemente hizo que sus compañeros destacasen sobre sus enemigos. Pero esto no lo convierte en un jugador de equipo pasivo: Spirit es la definición de proactivo. Su año acabó perfecto hasta que en el Campeonato Mundial 2014 se tuvieron que ver las caras con su equipo gemelo, Samsung White.</p>\n\n<p>Al final, el dinero mueve a las personas y Spirit vió su oportunidad en China bajo la marca de Team World Elite. El equipo que en otra hora lideró la escena china ya no es en absoluto el campeón en el juego aunque todavía mantenga su amplia comunidad de seguidores. A excepción de la IEM de Katowice en la que Team World Elite fue capaz de llegar a la final tras sorprender a todo el mundo con un jungla de escándalo, la temporada fue nefasta. Hasta los últimos partidos de la fase regular en la LPL Team World Elite no despertaba y Spirit vagaba sin rumbo intentando conseguir las victorias él sólo.</p>\n\n<p>Con esto despertó la segunda cara de la moneda que provocó su consideración como uno de los mejores junglas del momento a pesar de haber cambiado a un equipo notablemente inferior. Spirit se convirtió a un juego extremadamente agresivo, con invasiones a la jungla enemiga constantes y con posibilidad de él sólo acaparar los recursos necesarios para ganar partidas. Spirit provocó un bloqueo hacia Nidalee por los equipos enemigos incluso en los peores momentos de la Cazadora Salvaje, y su Rek’Sai también les otorgó muchas partidas.</p>\n\n<p>Fnatic ha encontrado en Spirit un jungla bidimensional: desde un punto de vista más de apoyo agresivo hasta uno totalmente demolador. Puede ejercerlo en cualquier momento del metajuego como bien ha demostrado con campeones como Jarvan IV, Elise o Lee Sin, así como adaptarse a las necesidades de su equipo para poder enfocarse a la victoria. Además de mecánicamente ser un prodigio, Spirit es uno de los jugadores más inteligentes en la jungla a la hora de localizar dónde está el enemigo y qué línea es la más apetecible en cada momento. Un perfecto cazador.</p>\n\n<p>La gran mayoría de rumores en China llegaron alrededor de sus actuaciones fuera del juego, pero las intenciones de Spirit hasta ahora se han mostrado las adecuadas. Admite que en el pasado el dinero era su prioridad, pero que prefiere mejorar su valor como jugador a la vez que ha mostrado la intención de mejorar su nivel de inglés a lo largo de la temporada. La comunicación es una de las grandes dudas en el nuevo Fnatic y Spirit ha asegurado que no será un problema. Spirit ha venido a Europa a reclamar el trono de mejor jungla de Occidente, y tendrá que demostrarlo.</p>"},"foreignIds":{"drupalId":"982","ESPORTSTMNT06":"200000380"},"socialNetworks":{"twitter":"https://twitter.com/fnc_spirit"},"champions":[],"liveGameTeam":174},{"id":401,"slug":"marin","name":"Marin","firstName":"Gyeonghwan","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/marin-fs373908.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-05-31T00:30:50.000Z","bios":{"en_US":"<p>Gyeong-hwan \"Marin\" Jang dove directly into the deep end of Korean esports when he signed with SK Telecom T1 S in 2013. A top laner by trade,  Marin’s confidence is unshakable -- and deservedly so, considering he won the 2015 World Championship with SKT. He has a reputation for disrupting enemy teams by any means necessary -- and from what we can see, he loves every second of it. If Marin gets his hands on Rumble or Fiora, keep an eye on your health bar. You might already be dead. That's what happens when a Worlds MVP shows up.</p>\n\n<p>While most top laners are content living on an island, <a href=\"http://na.lolesports.com/articles/mint-look-marin%E2%80%99s-golden-play\" target=\"_blank\">Marin is the opposite</a>. “Push your lane against your opponent’s tower and force the jungler to help top lane,” Marin says. After all, the more pressure he is absorbing top, the more freedom his team has to control key objectives. The problem with this style of play it leaves Marin 1v2 against the enemy top laner and jungle. Oh wait, did we say that was a problem? 1v2 just means more champions for Marin to farm.</p>","fr_FR":"<p>Gyeong-hwan « MaRin » Jang a tout de suite été mis dans le bain de l'e-sport coréen quand il a signé chez SK Telecom T1 S en 2013. Top-laner de profession, MaRin arbore une confiance inébranlable, ce qui peut se comprendre quand on sait qu'il a gagné le mondial 2015 avec SKT. Il a la réputation de chercher à contrer les plans de l'ennemi par tous les moyens, et à ce qu'on peut observer il a l'air d'adorer ça. Si MaRin met la main sur Rumble ou Fiora, surveillez bien votre jauge de PV, car vous pourriez être déjà mort. C'est assez fréquent si vous tombez nez à nez avec un MVP du mondial.</p>\n\n<p>La plupart des top-laners sont heureux dans leur petit monde, mais pas MaRin. « Il faut pousser sur votre voie jusqu'à la tourelle ennemie et forcer le jungler à venir aider », explique MaRin. Après tout, plus la voie du haut absorbe de pression, plus SKT a de liberté pour contrôler les objectifs clés. Le problème avec ce style de jeu est que MaRin affronte seul deux ennemis sur sa voie : le top-laner et le jungler. Enfin, quand on dit que c'est un problème... Pour lui, c'est davantage de champions à farmer.</p>","pl_PL":"<p>\nKyung-hwan „MaRin” Jang rzucił się od razu na głębokie wody koreańskiego e-sportu, gdy dołączył do SK Telecom T1 S w 2013 r. Pewność siebie MaRina jest niezachwiana – i słusznie, biorąc pod uwagę, że wygrał mistrzostwa świata 2015 z SKT. Słynie z przeszkadzania wrogiej drużynie na wszelkie możliwe sposoby i z tego, co można zauważyć, uwielbia to. Jeżeli Rumble lub Fiora wpadną w ręce MaRina, uważnie przyglądajcie się swoim paskom zdrowia. Możliwe, że już będziecie martwi. Takie rzeczy się dzieją, gdy najlepszy gracz mistrzostw świata rusza do walki.\n</p>\n<p>\nPodczas gdy większość górnych lubi spędzać czas w samotności, Marin jest całkowitym przeciwieństwem. „Przepchnij stwory pod wieżę przeciwnika i zmuś dżunglera do przyjścia na górę”, mówi Marin. Im więcej uwagi przyciąga na górze, tym więcej swobody SKT ma przy kontrolowaniu kluczowych celów. Problemem z tym stylem gry jest to, że Marin często musi walczyć 1 na 2 przeciwko wrogiemu górnemu i dżunglerowi. Chwila, powiedzieliśmy, że to problem? 1 na 2 oznacza tylko więcej bohaterów do farmienia dla Marina.\n</p>","de_DE":"<p>\nKyung-hwan „MaRin“ Jang unterschrieb 2013 bei SK Telecom T1 S und wurde auch gleich ins kalte Wasser geworfen. MaRin, seines Zeichens Toplaner, verfügt über ein unerschütterliches Selbstvertrauen. Und das zu Recht, denn schließlich hat er mit SKT die Weltmeisterschaft 2015 gewonnen. Er ist bekannt dafür, dass er gegnerische Teams mit allen Mitteln stört, und es macht den Anschein, dass er jede Sekunde davon genießt. Wenn MaRin Rumble oder Fiora spielt, behaltet besser eure Lebensanzeige im Auge. Vielleicht seid ihr ja schon tot. Das kann passieren, wenn ein MVP der WM auftaucht.\n</p>\n<p>\nDie meisten Toplaner stört es nicht, von den anderen Spielern abgeschnitten zu sein, MaRin sieht das jedoch anders. „Drück deine Lane an den gegnerischen Turm und zwinge den Jungler, in der oberen Lane auszuhelfen“, rät MaRin. Je mehr Druck er nämlich in der oberen Lane abfängt, desto freier können SKT wichtige Ziele kontrollieren. Problematisch an diesem Spielstil ist, dass MaRin sich alleine gegen den Toplaner und den Jungler des Gegners behaupten muss. Moment, sagten wir „problematisch“? Einer-gegen-Zwei heißt einfach nur, dass MaRin mehr Champions zum Farmen hat.\n</p>","es_ES":"<p>\nKyung-hwan ''MaRin'' Jang aterrizó directamente en el centro de los deportes electrónicos coreanos al fichar por SK Telecom T1 S en 2013. La principal característica de este calle superior es una confianza a toda prueba... seguramente merecida, si tenemos en cuenta que en 2015 ha ganado el Campeonato Mundial con SKT. Se ha hecho famoso por su capacidad de desorganizar a los equipos enemigos por cualquier medio... y a juzgar por lo que hemos podido ver, disfruta como un enano haciéndolo. Si MaRin consigue echar mano a Rumble o a Fiora, más te vale vigilar tu barra de Vida, porque puede que ya estés muerto. Es lo que pasa cuando te enfrentas a un MVP del Mundial.\n</p>\n<p>\nMientras que la mayoría de los jugadores de la calle superior se contentan con vivir en una isla, a MaRin le pasa justo lo contrario. ''Tienes que avanzar contra la torre del rival y obligar a su jungla a ayudar en la calle superior'', dice. A fin de cuentas, cuanta más presión tenga que absorber en la superior, más libertad dejará a SKT para controlar los objetivos importantes. El problema de este estilo de juego es que deja a MaRin solo contra el calle superior y el jungla rivales. Alto, ¿he dicho que eso era un problema? No debería, porque en el caso de MaRin, dos campeones en contra significa el doble de posibilidades de asesinar campeones.\n</p>","pt_BR":"<p>Marin estreou no cenário profissional direto no olho do furacão: assinou com a SK Telecom T1 S em 2013. Ele é um jogador de rota do topo por natureza, muito confiante no que faz. Marin ficou famoso por obliterar adversários a qualquer custo. Se ele pegar Rumble ou Maokai, é melhor você sair correndo. Se der tempo.</p>\n\n<p>Enquanto a maioria dos jogadores no topo gosta de viver isolado em uma ilha, Marin busca o contrário. \"Empurre sua rota para sufocar o adversário, e force o caçador a ajudar no topo\", é o que ele diz. Afinal, quanto mais pressão ele exercer na rota, mais liberdade a SKT tem para controlar os principais objetivos. O problema é que ele geralmente se vê em confrontos 1x2. Ou talvez isso seja bom: é um Campeão a mais para ele eliminar. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">MaRin\" 장경환은 2013년 SK Telecom T1 S와 계약하면서 한국 e스포츠의 핵심에 바로 합류했습니다. 탑 라이너인 MaRin의 자신감은 좀처럼 흔들리지 않습니다. 2015년 SKT의 일원으로 월드 챔피언십을 차지한 걸 생각하면 그럴 만도 하죠. MaRin은 어떤 수를 써서라도 적 팀을 혼란에 빠뜨리는 것으로 유명합니다. 그리고 그 모든 순간을 진정 즐기는 것처럼 보이죠. MaRin이 럼블이나 피오라를 선택했다면 적은 체력 게이지를 주시해야 합니다. 이미 죽어있을 수도 있거든요. 세계적인 MVP 선수가 등장하면 흔히 벌어지는 일이죠.</p>\n<p style=”font-family:”나눔고딕”;\">대부분의 탑 라이너들은 혼자 지내는 것에 만족하지만 MaRin은 정반대입니다. \"적 타워까지 라인을 밀고 적 정글러가 탑 라인을 돕게 만들어요\"라고 그는 말하죠. 어찌됐든 그가 탑에서 더 많은 일을 해낼수록 SKT가 주요 목표물을 확보할 여지도 많아집니다. 이런 플레이 스타일의 문제는 MaRin이 적팀의 탑 라이너와 정글러를 상대로 1:2 상황에 맞닥뜨릴 수 있다는 건데요. 아, 잠깐만요. 지금 '문제'라고 했나요? 여기서 말하는 1:2 상황은 MaRin이 파밍할 챔피언이 하나 더 있다는 뜻입니다. </p>\n"},"foreignIds":{"drupalId":"877","ESPORTSTMNT06":"200000379"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":741,"slug":"secret","name":"Secret","firstName":"Kiseon","lastName":"Park","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/secret-a8e3sqp0.png","hometown":null,"region":"LCK","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-02-28T19:33:56.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4348","TRKR1":"225088"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":767,"slug":"tusin","name":"Tusin","firstName":"Jong-ik","lastName":"Park","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tusin-d92elfiv.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-31T00:38:28.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2803","ESPORTSTMNT06":"200000446"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":794,"slug":"edge","name":"Edge","firstName":"Hosung","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edge-dnet26ow.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:30:02.000Z","updatedAt":"2017-02-09T01:40:33.000Z","bios":{"en_US":null,"de_DE":"<p>Oft wenn KT in der Bredouille steckt, greifen sie auf Ersatz-Mid-Laner Ho-seong \"Edge\" Lee zurück. Leider ist damit die Serie noch schneller verloren, als es mit Nagne der Fall wäre. Während Edges Technik annehmbar gut ist, lassen seine Entscheidungsfindung und Zusammenarbeit zu wünschen übrig. </p>"},"foreignIds":{"drupalId":"4643","ESPORTSTMNT06":"200000365"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":800,"slug":"kkramer","name":"Kramer","firstName":"Jonghoon","lastName":"Ha","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kkramer-gwv88ej5.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-22T22:18:16.000Z","updatedAt":"2017-05-31T00:35:38.000Z","bios":{"en_US":"","fr_FR":"<p>\nJong-hoon « Kkramer » Ha est nouveau dans l'organigramme de Flash Wolves, ayant joint ses forces à l'équipe en 2015. Connu en Corée pour sa manière de jouer Vayne, Kkramer a souvent évoqué son désir de devenir le meilleur Vayne de la planète en détrônant des maîtres comme Uzi et Piglet.\n</p>","es_ES":"<p>\nJong-hoon ''Kkramer'' Ha es la última incorporación a la plantilla de Flash Wolves, a la que llegó en verano del 2015. Conocido hasta entonces por la pericia demostrada con Vayne en Corea, ha afirmado en repetidas ocasiones que su deseo es llegar a convertirse en el mejor especialista del mundo con este campeón, en detrimento de estrellas tan rutilantes como Uzi o Piglet.\n</p>","pl_PL":"<p>\nJong-hoon „Kkramer” Ha jest nowym nabytkiem wśród członków Flash Wolves. Dołączył do drużyny latem 2015 r. Choć wcześniej zasłynął w Korei z gry Vayne, Kkramer nierzadko oświadczał, że pragnie się stać najlepszym graczem tą postacią, bijącym na głowę dawnych mistrzów, takich jak Uzi czy Piglet.\n</p>","de_DE":"<p>\nJong-hoon „Kkramer“ Ha ist der Neuzugang bei Flash Wolves, er kam im Sommer 2015 ins Team. In Südkorea war er bekannt für sein Spiel mit Vayne, und er hat schon oft erwähnt, dass es sein Wunsch ist, der beste Vayne-Spieler der Welt zu werden, und dass er alte Meister wie Uzi und Piglet vom Thron stürzen will.\n</p>","pt_BR":"<p>O mais novo integrante da Flash Wolves chegou no verão de 2015. Kkramer ficou famoso na Coreia com sua Vayne, e já declarou o desejo de se tornar o melhor no mundo com ela, desafiando mestres como Uzi e Piglet.</p>"},"foreignIds":{"drupalId":"4654","ESPORTSTMNT06":"200000383"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":1048,"slug":"ssol","name":"SSol","firstName":"Jin-sol","lastName":"Seo","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssol-32aqe6vs.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:18:56.000Z","updatedAt":"2017-02-09T01:44:41.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":1049,"slug":"guger","name":"GuGer","firstName":"Doyeop","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/guger-eh49n651.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:17:33.000Z","updatedAt":"2017-02-09T01:42:42.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000367"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":1050,"slug":"roach","name":"Roach","firstName":"Kang-hee","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/roach-1ze1qgaa.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:17:59.000Z","updatedAt":"2017-02-09T01:43:57.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000364"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":1425,"slug":"punch","name":"Punch","firstName":"Minhyeok","lastName":"Son","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/punch-6kb5m2kt.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-08-22T20:59:14.000Z","updatedAt":"2017-02-09T01:43:28.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000438"},"socialNetworks":{},"champions":[],"liveGameTeam":46},{"id":1688,"slug":"mowgli","name":"Mowgli","firstName":"Jaeha","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mowgli-arq84t54.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-12T19:02:12.000Z","updatedAt":"2017-05-31T00:37:59.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000381"},"socialNetworks":{},"champions":[],"liveGameTeam":174}],"scheduleItems":[{"id":"AVMfgDW6OPWArxM1l4dE","content":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:match:9745f7d0-62b2-4883-9cb3-464266cdcc55","scheduledTime":"2016-03-16T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda","blockLabel":"10","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:bracket:9342e2fe-50d2-41dd-bb72-bb12c42fb5c6"},"match":"9745f7d0-62b2-4883-9cb3-464266cdcc55","tournament":"0a5fb908-70c8-411b-81e0-27a83c167eda","bracket":"9342e2fe-50d2-41dd-bb72-bb12c42fb5c6","league":"6"}],"gameIdMappings":[{"id":"469df231-ed86-4787-a2c1-33480dd1d7cd","gameHash":"954b61df4e545234"},{"id":"6f49b9bc-267a-464c-b364-8f3eb222752d","gameHash":"ccdd37f030d6b5b8"},{"id":"ad321d17-c69c-4928-b795-f7254b773a27","gameHash":"3a4db184e1016c2b"}],"videos":[{"id":2175,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:6f49b9bc-267a-464c-b364-8f3eb222752d","source":"https://www.youtube.com/watch?v=PvwpYxGE5RE?wmode=transparent&start=12039","createdAt":"2016-03-16T18:09:46.000Z","updatedAt":"2016-03-16T18:09:46.000Z","game":"6f49b9bc-267a-464c-b364-8f3eb222752d"},{"id":2176,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:469df231-ed86-4787-a2c1-33480dd1d7cd","source":"https://www.youtube.com/watch?v=PvwpYxGE5RE?wmode=transparent&start=15345","createdAt":"2016-03-16T18:11:39.000Z","updatedAt":"2016-03-16T18:11:39.000Z","game":"469df231-ed86-4787-a2c1-33480dd1d7cd"},{"id":2177,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:ad321d17-c69c-4928-b795-f7254b773a27","source":"https://www.youtube.com/embed/PvwpYxGE5RE?wmode=transparent&start=8511","createdAt":"2016-03-16T18:09:46.000Z","updatedAt":"2016-03-16T18:09:46.000Z","game":"ad321d17-c69c-4928-b795-f7254b773a27"}],"htmlBlocks":[],"match":{"id":"9745f7d0-62b2-4883-9cb3-464266cdcc55","name":"AFS-vs-EMF","position":21,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"},{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}],"games":{"469df231-ed86-4787-a2c1-33480dd1d7cd":{"id":"469df231-ed86-4787-a2c1-33480dd1d7cd","name":"G3","generatedName":"AFS|EMF|G3|9745f7d062b248839cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"},{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}],"standings":{"result":[[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"}],[{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}]],"timestamp":1458136131575,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1010056","gameRealm":"TRKR1","platformId":"TRKR1:1010056","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"6f49b9bc-267a-464c-b364-8f3eb222752d":{"id":"6f49b9bc-267a-464c-b364-8f3eb222752d","name":"G2","generatedName":"AFS|EMF|G2|9745f7d062b248839cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"},{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}],"standings":{"result":[[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"}],[{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}]],"timestamp":1458136083933,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1010053","gameRealm":"TRKR1","platformId":"TRKR1:1010053","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"ad321d17-c69c-4928-b795-f7254b773a27":{"id":"ad321d17-c69c-4928-b795-f7254b773a27","name":"G1","generatedName":"AFS|EMF|G1|9745f7d062b248839cb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"},{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}],"standings":{"result":[[{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}],[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"}]],"timestamp":1458136001086,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1010043","gameRealm":"TRKR1","platformId":"TRKR1:1010043","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"0cc3ec0a-5cdd-41f9-ba9a-fdc1e00ed1b7"}],[{"roster":"f25eb87b-3a0f-46b6-ada5-4b4fc064212f"}]],"timestamp":1458136131576,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}