{"teams":[{"id":266,"slug":"tempo-storm","name":"Tempo Storm","guid":"be72468d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/tempo-storm-ixatzlou.png","acronym":"TS","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:04:32.000Z","updatedAt":"2017-07-21T02:34:49.000Z","bios":{"en_US":"<p>Coach: Seung-pyo \"Cella\" Hong</p>"},"foreignIds":{},"players":[159,199,253,323,1673,1676,1677,1996],"starters":[159,199,253,1673,1996],"subs":[323,1676,1677]},{"id":271,"slug":"gold-coin-united","name":"Gold Coin United","guid":"be724e56-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/gold-coin-united-iwq6t55n.png","acronym":"GCU","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:13:17.000Z","updatedAt":"2017-08-12T21:17:46.000Z","bios":{"en_US":"<p>Coach: Yoonsup \"Locodoco\" Choi</p>"},"foreignIds":{},"players":[185,366,529,747,1035,1172,1317,1666],"starters":[185,529,747,1035,1317],"subs":[366,1172,1666]}],"players":[{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":271},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":253,"slug":"sheep","name":"Sheep","firstName":"Jamie","lastName":"Gallagher","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sheep-bobcjvad.png","hometown":"USA","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:12.000Z","updatedAt":"2017-06-14T21:08:08.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1313","ESPORTSTMNT02":"200000685","TRLH1":"200000311"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":366,"slug":"fenix","name":"Fenix","firstName":"Jaehoon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fenix-38i6egfj.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-07T21:31:21.000Z","bios":{"en_US":"<p>\nYou've probably seen Fenix's <a href=”https://youtu.be/Z9D9o4GJv0w?t=36m06s” target=”_blank”>1v4 Azir Quadra</a> highlight more times than you can count, but that's only one of the dozens of memorable moments Jae-hun “Fenix” Kim put up in his debut year in the LCS. An ex-Jin Air Falcon from Korea, the player formerly known as Miso burst onto the scene and into our hearts when he joined Liquid at the start of the 2015 season. With a variety of stylish, colourful hairdos and clips that can ignite promo reels, Fenix is a player who demands attention.\n</p>","fr_FR":"<p>Vous avez sans doute vu son grand moment, le quadruplé à 1 contre 4 avec Azir, plus souvent que vous \n\nn'êtes capable de le dire, mais ce n'était là que l'un des nombreux grands moments de Jae-hun « Fenix » \n\nKim depuis ses débuts aux LCS. Ancien Jin Air Falcon en Corée, ce joueur autrefois connu sous le nom de \n\nMiso a débarqué en force sur la scène et s'est fait une popularité en rejoignant Liquid au début de la \n\nsaison 2015. Confrontés à des combats aussi bouillants que le rouge de sa chevelure, les adversaires de \n\nFenix passent beaucoup de temps à méditer sur Shurima.</p>\n\n<p>Et si l'Empereur est devenu son champion attitré, il lui a fallu bien plus qu'un coup flamboyant pour être \n\nnommé meilleur mid laner des LCS NA 2015. Capable de mettre en permanence la pression, qu'il joue \n\nassassin, tireur ou mage de contrôle, Fenix a enfin trouvé l'occasion de briller en Amérique du Nord. \n\nQuand Fenix arpente la Faille, laissez passer. Ou il vous en coûtera.</p>","pl_PL":"<p>To jeden z najbardziej doświadczonych graczy na świecie, gdyż gra w League of Legends profesjonalnie od 2010 roku. Zaczynał w drużynach Haters i compLexity Gaming. Później, jak stał się bardziej rozpoznawalny na scenie esportowej, został zaproszony do współpracy z Team Dignitas. W tej organizacji zyskał sławę grając Renektonem na top-lanie, zanim, wraz z kolejną zmianą drużyny, przeniósł się do jungli. Ponadto było to jego pierwsze spotkanie z NA LCS. W Team Dignitas spędził prawie okrągły rok, opuszczając go w grudniu 2012 roku. </p>\n<p>\nPoczątkowo miał duże problemy z opanowaniem emocji, w szczególności tych negatywnych. Na przykład, pomijając kwestie słownictwa, zniszczył swoje słuchawki z radości po wygranej grze na 2012 MLG Pro Circuit. Ostatecznie, 4 grudnia 2012 roku, to doprowadziło do wykluczenia jego wszystkich kont z rozgrywki na prawie cały rok. \"IWillDominate\" zrozumiał swoje błędne zachowanie i rozpoczął proces rehabilitacji w oczach środowiska League of Legends. Przede wszystkim dołączył do organizacji Curse Gaming w styczniu 2013 roku. Dalej udzielał się w życiu zawodników - grał w Curse Academy i występował w formie trenera. Jednocześnie zawzięcie pracował nad swoimi reakcjami w obliczu wielkich emocji. Cała historia miała szczęśliwe zakończenie, gdyż Christian nareszcie w październiku 2013 roku mógł wrócić na scenę esportową. Dołączył wtedy oficjalnie do Team Curse jako jungler i spędził tam kolejne dwa niecałe lata. </p>\n<p>\nFuzja i przejście pod opiekuńcze skrzydła Team Liquid wyszła Christianowi na dobre. W pierwszym tygodniu wiosennego sezonu NA LCS 2015 \"IWillDominate\" wygrał nagrodę najbardziej wartościowego gracza. Osiągnął to fenomenalnymi grami Nunu i Jarvanem IV, w których jego łączne KDA wyniosło ponad 13. Później meczom jego drużyny często brakowało komunikacji, która ze względu na dwóch nowych graczy z Korei, była bardzo utrudniona. Jednak z czasem robili postępy, ostatecznie kończąc z wynikiem 9:9 w tym okresie. Największy sukces w karierze Christiana Rivera to letni sezon NA LCS 2015. Wraz z Team Liquid wszedł na wyżyny swoich możliwości. Po zaciętej walce z CLG, TiP i Gravity udało mu się skończyć ten okres na pierwszym miejscu w Ameryce. Niestety wkrótce potem miała miejsce jego największa porażka, a ostatnie osiągnięcia tylko spotęgowały odczucie upadku. Pomimo takich wyników pod koniec sezonu Christianowi nie udało się zakwalifikować do Mistrzostw Świata 2015. Jego marzeniem jest zagranie w MŚ swoimi ulubionymi bohaterami – Shaco i Xin’zhao.\n</p>"},"foreignIds":{"drupalId":"3663","ESPORTSTMNT02":"200000754","TRLH1":"200000301"},"socialNetworks":{"twitch":"http://www.twitch.tv/fenixl0l","facebook":"https://www.facebook.com/fenixl0l","twitter":"https://twitter.com/LiquidFeniX"},"champions":[],"liveGameTeam":271},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":747,"slug":"madlife","name":"Madlife","firstName":"Mingi","lastName":"Hong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/madlife-4tps9t22.png","hometown":"South Korea","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T23:24:25.000Z","bios":{"en_US":"<p>Mingi \"Madlife\" Hong, also referred to as \"god\", is one of the most popular League of Legends players in global esports. He earned the \"god\" moniker due to his ability to see into the future and manipulate his opponents on the Rift in such a way that they always walk into his traps. How else can we explain his Blitzcrank grabs landing successfully when an opponent is Flashing away? And don’t get us started on Thresh. Once the Chain Warden was introduced, Madlife's legend only grew. His uncanny hooks and flays drive the crowd into a joyous frenzy, and leave his opponent’s befuddled and staring at grey screens.</p>","fr_FR":"<p>Min-gi « MadLife » Hong, aussi appelé « god », est l'un des joueurs les plus populaires de l'e-sport international de League of Legends. Son surnom de « god » (« dieu » en français) est dû à sa capacité à prédire l'avenir et à manipuler ses adversaires sur la Faille pour qu'ils tombent dans ses pièges. Sinon, comment expliquer ses Grappins de Blitzcrank réussis lorsque son adversaire fait un Saut éclair ? Et ne parlons même pas de Thresh. Avec l'arrivée du Garde aux chaînes, la légende de MadLife n'a fait que s'amplifier. Ses coups de crochet et son adresse au jeu du Fauchage mettent la foule en délire et ses adversaires se retrouvent à fixer leur écran gris sans même comprendre ce qui leur est arrivé.</p>\n\n<p>Les compétences mécaniques de MadLife font de lui un excellent support et lui valent d'être reconnu comme l'un des meilleurs joueurs au monde dans sa catégorie. CJ Entus ayant été reléguée des LCK, c'est uniquement grâce à son talent que MadLife a été invité à Barcelone. Indépendamment de ce qui s'est passé pendant le segment d'été, MadLife a une chance se mesurer avec brio aux meilleurs joueurs du monde à l'événement All-Stars 2016. Qu'il assène un crochet aveugle dans le brouillard de guerre ou qu'il pulvérise l'ADC adverse, on peut compter sur MadLife pour semer le chaos.</p>","pl_PL":"Min-gi „MadLife” Hong, zwany także „bogiem”, jest jednym z najpopularniejszych zawodników League of Legends w światowym e-sporcie. Zasłużył sobie na przezwisko „boga” swoją zdolnością przewidywania przyszłości i manipulowania rywalami na Summoner’s Rift w taki sposób, że zawsze wpadają w jego pułapki. Bo jak inaczej można wyjaśnić to, że jego Blitzcrank zawsze trafia, gdy przeciwnik odskakuje Błyskiem? I nawet nie wspominajcie o Threshu. Po wprowadzeniu Strażnika Łańcuchów legenda MadLife’a jeszcze się umocniła. Jego niesamowite haki i młynki wprowadzają widownię w szał radości, a przeciwników pozostawiają zdezorientowanych i gapiących się w szary ekran.</p>\n\nUmiejętności mechaniczne MadLife’a przekładają się na oszałamiającą grę w roli wsparcia, co zapewnia mu pozycję jednego z najlepszych wspierających na świecie. To właśnie ta umiejętność przyniosła MadLifowi zaproszenie do Barcelony, szczególnie biorąc pod uwagę odejście CJ Entus z LCK. Bez względu na to, co stało się podczas letniego splitu, MadLife ma szansę zaprezentować na All-Star 2016 swój styl na tle kilku z najlepszych zawodników świata. Obojętnie, czy trafi wyrzuconym na ślepo hakiem przez mgłę wojny, czy zdemoluje prowadzącego rywali, można liczyć na to, że MadLife narobi sporo zamieszania.\n","es_ES":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\" (dios), es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo de \"god\" gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de apoyo deslumbrante y en el reconocimiento como uno de los mejores apoyos del mundo. No es ni más ni menos que por esta habilidad que MadLife ha sido invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus ha quedado relegado en la LCK. Al margen de lo que ocurriese en el split de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al ADC enemigo, podéis contar con que MadLife sembrará el caos.</p>","de_DE":"<p>Min-gi „MadLife“ Hong, auch bekannt als „Gott“, ist einer der bekanntesten „League of Legends“-Spieler der gesamten E-Sport-Szene. Er trägt den Spitznamen „Gott“, weil er in die Zukunft schauen und seine Gegner in der Kluft so manipulieren kann, dass sie immer in seine Fallen tappen. Wir sonst könnte man erklären, dass er mit Blitzcrank auch dann trifft, wenn der Gegner gerade Blitz benutzt? Und mit Thresh wollen wir erst gar nicht anfangen. Als der Kettenwächter vorgestellt wurde, wurde die Legende um MadLife nur noch größer. Seine verblüffenden Haken- und Peitschenangriffe verzücken das Publikum und lassen seine Gegner mit verdutzten Gesichtern vor den Bildschirmen zurück.</p>\n\n<p>MadLife nutzt seine mechanischen Fähigkeiten für überwältigende Unterstützungsspielzüge, die ihn zu einem der besten Supporter der Welt machen. Diese Fähigkeiten allein haben ausgereicht, dass MadLife nach Barcelona eingeladen wurde, vor allem wenn man CJ Entus’ Abstieg aus der LCK bedenkt. Unabhängig davon, was beim Sommer-Split passiert ist, hat MadLife beim All-Stars-Event 2016 die Chance, sich gegen die besten Spieler der Welt zu behaupten. Egal, ob er gerade einen Gegner im Nebel des Krieges mit seinem Haken trifft oder den gegnerischen AD-Carry in Stücke reißt, MadLife wird ordentlich Chaos stiften.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"MadLife\" 홍민기 선수는 전세계 리그 오브 레전드 선수 중 최고의 인기를 누리는 선수 중 하나이며, ‘신’으로 불리까지 합니다. 전장에서 미래를 내다보고 상대의 움직임을 조종해 함정에 빠져들게 하는 능력이 있기 때문이죠. 그런 능력이 아니고서는 점멸로 도망치는 적을 블리츠크랭크 그랩으로 붙잡아오는 이 선수의 플레이를 설명할 수가 없습니다. 쓰레쉬는 말할 것도 없죠. 쓰레쉬가 출시되자마자 MadLife 선수의 전설은 더욱 확고해졌습니다. 이해할 수 없을 만큼 절묘한 사형 선고와 사슬 채찍 활용으로 관객들을 열광시키고, 상대 선수들은 멍하니 회색 화면을 쳐다보게 만들었죠. </p>\n<p style=”font-family:”나눔고딕”;\">Madlife 선수의 뛰어난 피지컬은 서포터로서 빛나는 명장면들을 만들어내며 세계 최고의 서포터 중 하나로 인정받을 수 있었던 밑바탕입니다. 이 선수는 CJ Entus를 승리로 이끌기 위해 집념을 불태우고 있습니다. 어떤 난관을 통과해야 하더라도 말이죠. </p>\n","cs_CZ":"<p>Min-gi „MadLife“ Hong, taktéž známý jako „bůh“, patří mezi nejoblíbenější profesionální hráče League of Legends na světě. Svou přezdívku „bůh“ si vysloužil schopností nahlížet do budoucnosti a manipulovat svými soupeři ve Žlebu tak, aby vždy nakráčeli do jeho pastí. Jak jinak vysvětlit, že se svým Blitzcrankem dokáže pokaždé zachytit protivníka, který se právě stahuje pomocí Skoku? A to ani nemluvíme o Threshovi. Poté, co se hra rozrostla o Řetězového strážce, se MadLife stal doslova legendou. Jeho zákeřné zachytávání a odhazování nepřátel nutí davy diváků řičet nadšením a zmatené soupeře sledovat šedou obrazovku.</p>\n\n<p>Své úžasné mechanické dovednosti využívá MadLife k provádění skvěle načasovaných akcí, pro které je označován za jednoho z nejnadanějších podpůrných hráčů světa. A vzhledem k tomu, že tým CJ Entus sestoupil z LCK, to jsou právě jen a jen jeho schopnosti, jimž MadLife vděčí za pozvánku do Barcelony. Bez ohledu na výsledek letního splitu bude mít MadLife na turnaji All-Star 2016 šanci zařádit si ve Žlebu s těmi nejlepšími z nejlepších. A ať už zrovna bude naslepo střílet hák skrz opar neznáma nebo drtit soupeřova ADC, můžete vzít jed na to, že MadLife ve hře rozpoutá pořádný masakr.</p>","el_GR":"<p>Ο Min-gi \"MadLife\" Hong, γνωστός επίσης απλά ως «θεός», είναι ένας από τους πιο δημοφιλείς παίκτες του League of Legends στη διεθνή σκηνή των esports. Του έδωσαν το ψευδώνυμο «θεός», επειδή μπορεί να προβλέπει τις επόμενες κινήσεις των αντιπάλων και να τις εκμεταλλεύεται με τέτοιο τρόπο, ώστε να πέφτουν στις παγίδες του. Πώς αλλιώς μπορεί να εξηγήσει κανείς ότι καταφέρνει να αρπάξει τον αντίπαλό του με τον Μπλίτζκρανκ, ακόμα και όταν αυτός κάνει Φλας για να ξεφύγει; Για να μην πούμε και για τον Θρες. Όταν ο Δεσμοφύλακας των Ψυχών μπήκε στο παιχνίδι, ο θρύλος του MadLife ενισχύθηκε ακόμη περισσότερο. Η τρομερή ακρίβεια με την οποία χρησιμοποιεί το φανάρι και το μαστίγωμα προκαλεί αμόκ στο ακροατήριο, ενώ οι αντίπαλοί του δεν μπορούν να κάνουν κάτι άλλο από το να κοιτάνε απορημένοι τη γκρίζα οθόνη.</p>\n\n<p>Ο Madlife ξέρει να χειρίζεται τους μηχανισμούς του παιχνιδιού με καταπληκτική μαεστρία. Δεν είναι καθόλου περίεργο που θεωρείται ένας από τους καλύτερους υποστηρικτές στον κόσμο. Το εκπληκτικό του παιχνίδι είναι ο λόγος που ο MadLife κέρδισε αυτήν την πρόσκληση για τη Βαρκελώνη, παρά τον υποβιβασμό των CJ Entus από το LCK. Πέρα από τα όσα συνέβησαν στο Summer Split, ο MadLife θα έχει μια ευκαιρία να μαγέψει το κοινό ενάντια στους καλύτερους παίκτες του κόσμου στο Τουρνουά All-Star 2016. Μπορεί να τον δείτε να πετάει στα τυφλά ένα φανάρι μέσα στην ομίχλη πολέμου ή να κάνει σκόνη τον ADC της άλλης ομάδας. Σε κάθε περίπτωση, ο MadLife θα σπείρει τον τρόμο στους αντιπάλους του.</p>","hu_HU":"Min-gi „MadLife” Hong (aki az „isten” névre is hallgat) az egyik legnépszerűbb League of Legends-játékos a nemzetközi e-sport színterén. Azért kezdték „istennek” hívni, mert valahogy mindig a jövőbe lát, és úgy manipulálja az ellenfeleit a Szurdokban, hogy belesétáljanak a csapdáiba. Hogy máshogy magyarázhatnánk, hogy Blitzcrankkel elkapja az Átvillanással menekülő ellenfeleket? És akkor a Thresh-féle mutatványairól ne is beszéljünk. A Láncok őrének megjelenése óta MadLife még veszélyesebbé vált. Az elképesztő elkapások és nyúzások őrjöngő éljenzést váltanak ki a nézők körében, az ellenfeleknél meg általában szürke képernyőket.</p>\n\nMadlife játékbeli képességei lenyűgöző támogatói teljesítményt eredményeznek, és egyértelműen ő az egyik legjobb támogató a világon. MadLife a saját képességei jogán került a barcelonai fellépők közé, különösen, hogy a CJ Entus kibukott az LCK-ből. A nyári szakaszban történtek ellenére MadLife a 2016-os All-Star gálán a világ néhány legjobbjával játszhat. A háború ködébe kilőtt horgok, porrá zúzott lövészek: MadLife elemében lesz.\n","it_IT":"<p>Min-gi \"MadLife\" Hong, anche conosciuto come \"dio\", è uno dei giocatori di LoL più popolari nel mondo degli eSport. Si è guadagnato il nomignolo di \"dio\" per la sua abilità di prevedere il futuro e manovrare i suoi avversari in Landa in modo da farli sempre finire nelle sue trappole. Come altro spiegare il fatto che riesca a mettere a segno le sue prese con Blitzcrank mentre l'avversario usa Flash? Per non parlare di Thresh. Dopo l'arrivo del carceriere, la leggenda di MadLife è diventata ancora più... leggendaria. I suoi ganci e le sue sferzate impossibili fanno impazzire il pubblico e lasciano i suoi avversari impotenti davanti a una schermata grigia.</p>\n\nLe abilità meccaniche di MadLife si traducono in un'incredibile capacità di supporto e gli sono valse l'ingresso nell'élite dei supporti. È solo grazie a questa abilità che MadLife è riuscito a ottenere un biglietto per Barcellona, soprattutto alla luce della retrocessione dei CJ Entus in LCK. A prescindere da quanto accaduto al Summer Split, MadLife ha ora una nuova opportunità per scontrarsi con alcuni dei più grandi giocatori del mondo all'All-Star 2016. Sia che si prepari a lanciare i suoi uncini alla cieca nella nebbia di guerra o a polverizzare gli ADC avversari, MadLife porterà sicuramente altro caos nella Landa.\n","ro_RO":"Min-gi \"MadLife\" Hong, cunoscut și ca ''zeul'', este unul dintre cei mai populari jucători de League of Legends din lumea eSports. Porecla ''zeul'' a primit-o datorită abilității de a prezice viitorul și de a-și manipula adversarii din Rift în așa fel încât să-i cadă mereu în capcane. Cum altfel se poate explica faptul că-și trage cu succes adversarii cu Blitzcrank, fix când aceștia folosesc ''Flash''? Asta ca să nu vorbim de jocul lui cu Thresh. Când l-am lansat pe temnicerul blestemat, legenda lui MadLife a luat proporții. Mulțimea e în delir când își folosește lanțul și ''Tortura'' în mod creativ, iar adversarul rămâne cu ecranul gri și tot nu se prinde ce-a pățit.</p>\n\nAbilitățile mecanice ale lui Madlife se transpun în momente impresionante de suport și i-au adus un renume mondial. Pe baza îndemânării sale, MadLife a obținut invitația la Barcelona în ciuda faptului că CJ Entus a fost retrogradată din LCK. Indiferent de ceea ce s-a întâmplat în etapa de vară, MadLife are acum ocazia de a-i copleși pe unii dintre cei mai buni jucători din lume la All-Star Event 2016. Fie că nimerește prin negura războiului cu un cârlig sau că pulverizează ADC-ul advers, puteți conta pe MadLife să creeze haos.\n","es_AR":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","es_MX":"<p>Ming-gi \"MadLife\" Hong, también conocido como \"god\", es uno de los jugadores más populares de League of Legends en los esports globales. Se ganó el apodo divino gracias a su habilidad de predecir el futuro y manipular a sus oponentes en la Grieta de tal modo que siempre caen en sus trampas. ¿Cómo podríamos explicar si no que acierte sus ganchos de Blitzcrank cuando el oponente usa Destello para escapar? Por no hablar de sus jugadas con Thresh. Cuando lanzamos al Carcelero Implacable, la leyenda de MadLife no hizo sino crecer. Sus sorprendentes usos de Sentencia de Muerte y Despellejar despiertan el alegre frenesí de la audiencia y dejan a sus oponentes confundidos y mirando perplejos a las pantallas grises.</p>\n\n<p>Las habilidades mecánicas de MadLife se traducen en un estilo de juego de soporte deslumbrante y en el reconocimiento como uno de los mejores carrileros inferiores del mundo. No es ni más ni menos que por esta habilidad que MadLife fue invitado a Barcelona, especialmente si tenemos en cuenta que CJ Entus quedó relegado en la LCK. Al margen de lo que ocurriera en el torneo de verano, MadLife tiene otra oportunidad para mostrar su estilo personal junto a algunos de los mejores jugadores del mundo en el All-Star Event 2016. Tanto si acierta un gancho a ciegas a través de la niebla de guerra como si pulveriza al tirador enemigo, es seguro que MadLife sembrará el caos.</p>","pt_BR":"<p>Min-gi \"MadLife\" Hong, também conhecido por alguns como “god” (deus), é um dos jogadores mais populares de League of Legends do mundo. Ele recebeu o título de “deus” devido à sua habilidade de prever o futuro e manipular seus oponentes em Summoner’s Rift, de modo que eles sempre caíam em suas armadilhas. De que outra forma podemos explicar os puxões de Blitzcrank acertando, mesmo quando um oponente deu Flash? E nem vamos entrar no mérito do Thresh. Quando o Guardião das Correntes entrou no jogo, a lenda do MadLife só cresceu mais. Seus ganchos e Esfolar “mentirosos” deixaram o público maluco e os oponentes boquiabertos enquanto olhavam para suas telas cinzas.</p>\n\n<p>A habilidade mecânica de MadLife se transforma em jogadas incríveis de suporte e o reconhecimento como um dos melhores do mundo. É contando com essa habilidade que MadLife conseguiu garantir sua ida para Barcelona, especialmente considerando que a CJ Entus foi rebaixada na LCK. Apesar do que aconteceu na Etapa de Verão, MadLife tem uma chance de mostrar novamente as melhores jogadas do mundo no Evento All-Star 2016. Seja acertando um gancho na névoa de guerra ou acabando com os atiradores adversários, você pode contar com MadLife para trazer o caos.</p>"},"foreignIds":{"drupalId":"370","TRLH1":"200000303","TRLH2":"1001140041","TRKR1":"225038","TRLH3":"1001360055","TRLH4":"1001310055","ESPORTSTMNT02":"200000756"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1035,"slug":"fly","name":"Fly","firstName":"Yongjun","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fly-f96z2al7.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:08:52.000Z","updatedAt":"2017-07-20T21:11:42.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT06":"200000439","ESPORTSTMNT02":"200000767","TRLH1":"200000709"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1172,"slug":"qwerm","name":"BonQuish","firstName":"Alec","lastName":"Warren","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/qwerm-9fij28rx.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-03-08T01:37:03.000Z","updatedAt":"2017-06-14T23:25:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000766"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1317,"slug":"rikara","name":"Rikara","firstName":"Richard","lastName":"Oh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rikara-eu8jm8ll.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-06-03T00:18:15.000Z","updatedAt":"2017-06-14T23:10:26.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000755","TRLH1":"200000302"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1666,"slug":"whyin","name":"Whyin","firstName":"Ryan","lastName":"Karaszkiewicz","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whyin-3fapjeh2.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-11T00:17:14.000Z","updatedAt":"2017-06-14T23:04:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000757","TRLH1":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":271},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1676,"slug":"saber","name":"Saber","firstName":"Allen","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-11T02:20:03.000Z","updatedAt":"2017-03-08T19:46:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000763","TRLH1":"200000312"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1677,"slug":"maxtrobo","name":"Maxtrobo","firstName":"Maxime","lastName":"Delangis Gallichand","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxtrobo-ausozhqb.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T02:19:57.000Z","updatedAt":"2017-03-08T19:46:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000764","TRLH1":"200000313"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1996,"slug":"reven","name":"Reven","firstName":"Sang-hyun","lastName":"Sung","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reven-ads3kdma.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T17:34:53.000Z","updatedAt":"2017-07-20T21:18:17.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001702","TRLH1":"200000710"},"socialNetworks":{},"champions":[],"liveGameTeam":266}],"scheduleItems":[{"id":"AVx_dGQUoUG4HPFjOKVd","content":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:match:97d2e88b-527f-4142-8d48-2feccceda9c8","scheduledTime":"2017-06-07T21:00:00.903+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:bracket:0b471bd2-8c29-42c1-b21e-b6c89f25b55e","leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec"},"match":"97d2e88b-527f-4142-8d48-2feccceda9c8","tournament":"885be032-14f9-45bc-bfae-71eecd0213ec","bracket":"0b471bd2-8c29-42c1-b21e-b6c89f25b55e","league":"4"}],"gameIdMappings":[{"id":"68a3979a-7054-4141-aca9-1bf0efd1a219","gameHash":"00a6094fbe48e55b"},{"id":"94ee95dc-ef1b-4c51-9959-0f27f55b1e3b","gameHash":"7cd8430ab7ac9ec6"}],"videos":[],"htmlBlocks":[],"match":{"id":"97d2e88b-527f-4142-8d48-2feccceda9c8","name":"GCU-vs-TS","position":5,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"games":{"68a3979a-7054-4141-aca9-1bf0efd1a219":{"id":"68a3979a-7054-4141-aca9-1bf0efd1a219","name":"G2","generatedName":"GCU|TS|G2|97d2e88b527f41428d48","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"}]],"timestamp":1496878502500,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"200050","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:200050","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"2bdae700-a17e-43d2-8f57-c95801a145ee":{"id":"2bdae700-a17e-43d2-8f57-c95801a145ee","name":"G3","generatedName":"GCU|TS|G3|97d2e88b527f41428d48","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"94ee95dc-ef1b-4c51-9959-0f27f55b1e3b":{"id":"94ee95dc-ef1b-4c51-9959-0f27f55b1e3b","name":"G1","generatedName":"GCU|TS|G1|97d2e88b527f41428d48","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"}]],"timestamp":1496878402827,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"200039","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:200039","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"6cbaa6ba-7e6f-4621-9834-2d0809d7449f"}]],"timestamp":1496878502500,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"6cbaa6ba-7e6f-4621-9834-2d0809d7449f":0,"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49":1}}}