{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11}],"scheduleItems":[{"id":"AVTfrUPsQMQFcjhwbQjC","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:98e358ff-2153-453a-92d1-2f1bfee4afae","scheduledTime":"2016-06-04T00:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"1","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"98e358ff-2153-453a-92d1-2f1bfee4afae","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"4d985748-066a-4ea1-9a16-db0612d08b10","gameHash":"e147296c928da5b4"},{"id":"0045fb8f-0272-4a84-8500-240d69c33f7b","gameHash":"55109b5a7a91ae87"}],"videos":[{"id":2923,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:0045fb8f-0272-4a84-8500-240d69c33f7b","source":"https://www.youtube.com/embed/geGlkI9lVpk?wmode=transparent","createdAt":"2016-06-04T02:42:03.000Z","updatedAt":"2016-06-04T02:42:03.000Z","game":"0045fb8f-0272-4a84-8500-240d69c33f7b"},{"id":2924,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:4d985748-066a-4ea1-9a16-db0612d08b10","source":"https://www.youtube.com/embed/6bAUiO5QYQ0?wmode=transparent","createdAt":"2016-06-04T03:36:59.000Z","updatedAt":"2016-06-04T03:36:59.000Z","game":"4d985748-066a-4ea1-9a16-db0612d08b10"}],"htmlBlocks":[],"match":{"id":"98e358ff-2153-453a-92d1-2f1bfee4afae","name":"TSM-vs-CLG","position":36,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"games":{"514af31a-c14f-48fa-a4d5-3522de3b563d":{"id":"514af31a-c14f-48fa-a4d5-3522de3b563d","name":"G3","generatedName":"CLG|TSM|G3|98e358ff2153453a92d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4d985748-066a-4ea1-9a16-db0612d08b10":{"id":"4d985748-066a-4ea1-9a16-db0612d08b10","name":"G2","generatedName":"CLG|TSM|G2|98e358ff2153453a92d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"},{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],"standings":{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465011081791,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465005800007,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001720119","gameRealm":"TRLH1","platformId":"TRLH1:1001720119","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0045fb8f-0272-4a84-8500-240d69c33f7b":{"id":"0045fb8f-0272-4a84-8500-240d69c33f7b","name":"G1","generatedName":"CLG|TSM|G1|98e358ff2153453a92d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"},{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}],"standings":{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465007552035,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465002243461,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001720111","gameRealm":"TRLH1","platformId":"TRLH1:1001720111","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465011081791,"source":"bestOf","history":[{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465007552035,"source":"bestOf","closed":true},{"result":[[{"roster":"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b"}],[{"roster":"0dd99862-70d4-49c3-b7cb-91f1a273cd7a"}]],"timestamp":1465005800007,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"d1eef7ea-1fc9-4656-bd45-b4fba4abbf5b":1,"0dd99862-70d4-49c3-b7cb-91f1a273cd7a":0}}}