{"teams":[{"id":9,"slug":"sktelecom-t1","name":"SK telecom T1","guid":"be6c808b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/sktelecom-t1-3mpugoym.png","acronym":"SKT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-08-01T18:16:40.000Z","updatedAt":"2017-05-26T23:47:44.000Z","bios":{"en_US":"<p>SK telecom T1 is the best team in the history of League of Legends. With three World Championships under their belt from 2013, 2015 and 2016, no team comes close to their level of dominance. After a stellar run in 2015 that ended in their second title, SKT struggled to start 2016. They righted the ship by IEM Katowice, finishing first in Champions Spring 2016 and winning the 2016 Mid-Season Invitational.</p> \n\n<p>They hit another snag when they failed to reach the finals in Champions Summer 2016, falling to kt Rolster. But the SKT of old showed up right away at the 2016 World Championship, and Faker led the team to its second straight Worlds win. Entering 2017 with a roster somehow even more packed with talent, anything short of another World Championship would be a disappointment for SKT.</p>\n\n<p>Coach: Jeonggyun “KkOma” Kim</p>","fr_FR":"SK Telecom T1 est la meilleure équipe de l'histoire de League of Legends. Avec trois Championnats du monde à son palmarès en 2013, 2015 et 2016, aucune équipe n'approche de son niveau de domination. Suite à une performance sans faute en 2015 qui s'est soldée par un deuxième titre, SKT a commencé l'année 2016 plus difficilement. L'équipe est finalement parvenue à redresser la barre lors des IEM de Katowice, décrochant la première place du Champions Spring 2016 et remportant le Mid-Season Invitational 2016.\n\nElle s'est ensuite à nouveau retrouvée dans l'impasse en manquant de se qualifier pour la finale du Champions Summer 2016 contre KT Rolster. Mais SKT s'est vite remise sur pied au Championnat du monde et Faker lui a valu sa deuxième victoire consécutive au Mondial. Après avoir dominé la LCK ce printemps, SKT s'apprête à présent à participer au Mid-Season Invitational 2017, au Brésil, en tant que favorite incontestable. Les champions en titre aspirent à la première place et ils ne se contenteront de rien de moins.\n\nEntraîneur : Jeonggyun « KkOma » Kim\n","pl_PL":"SK Telecom T1 to najlepsza drużyna w historii League of Legends. Trzy razy wygrała Mistrzostwa Świata ― w 2013, 2015 i 2016 roku. Żadna inna drużyna nie zbliżyła się nawet do tego poziomu dominacji. Po rewelacyjnych występach w 2015 roku, które zakończyli zdobyciem drugiego tytułu, SKT z trudem zaczynali 2016 rok. Podwyższyli poziom lotów na IEM w Katowicach, kończąc na pierwszym miejscu Champions Spring 2016 i wygrywając Mid-Season Invitational 2016.\n\nKolejne spowolnienie nastąpiło, gdy nie zdołali dotrzeć do finałów Champions Summer 2016, przegrywając z KT Rolster. Ale dawne SKT wkrótce powróciło na Mistrzostwa Świata 2016, a Faker doprowadził drużynę do drugiej z rzędu wygranej na Mistrzostwach. Po zdominowaniu LCK tej wiosny SKT jadą na Mid-Season Invitational 2017 w Brazylii jako zdecydowani faworyci. Cokolwiek poniżej pierwszego miejsca będzie rozczarowaniem dla obecnych czempionów.\n\nTrener: Jeonggyun „KkOma” Kim\n","de_DE":"SK Telecom T1 ist die beste Mannschaft in der Geschichte von League of Legends. Keine andere Mannschaft ist so dominant wie der dreimalige Weltmeister, der sich diesen Titel in den Jahren 2013, 2015 und 2016 sichern konnte. Nach einer überragenden Vorstellung im Jahr 2015, die die Mannschaft mit ihrem zweiten Weltmeistertitel krönte, hatte SKT 2016 Startschwierigkeiten. Beim IEM Katowice konnten sie jedoch das Ruder wieder herumreißen, woraufhin sie den Frühjahrs-Split der LCK 2016 und das Mid-Season Invitational 2016 gewannen.\n\nIm Sommer-Split der LCK 2016 folgte jedoch der nächste Dämpfer, als sie von KT Rolster besiegt wurden und das Finale nicht erreichten. Doch SKT fand vor der Weltmeisterschaft 2016 wieder zu alter Stärke zurück und Faker führte die Mannschaft zu ihrem zweiten WM-Titel hintereinander. Nach einer dominanten Vorstellung im diesjährigen Frühjahrs-Split der LCK kommt SKT als Favorit zum Mid-Season Invitational 2017 in Brasilien. Alles andere als der erste Platz wäre für die regierenden Champions eine Enttäuschung.\n\nTrainer: Jeonggyun „KkOma“ Kim\n","es_ES":"SK telecom T1 es el mejor equipo de la historia de League of Legends. Ganadores de tres Campeonatos Mundiales (en 2013, 2015 y 2016), ningún equipo se acerca a su nivel de superioridad. Tras un año estelar en 2015 que les hizo ganarse su segundo título, el comienzo de 2016 no fue tan sencillo para SKT. Recobraron la fuerza a partir del IEM Katowice, acabaron primeros en el Champions Spring de 2016 y ganaron el Mid-Season Invitational 2016.\n\nSe encontraron con un nuevo obstáculo cuando no lograron llegar a la final del Champions Summer 2016, tras perder contra KT Rolster. No obstante, el SKT al que estábamos acostumbrados volvió a dar la cara en el Campeonato Mundial de 2016, y Faker lideró al equipo hasta su tercer título de campeón mundial. Tras dominar en la LCK esta primavera, SKT llega al Mid-Season Invitational 2017 en Brasil como el máximo favorito. Solo el primer puesto estaría a la altura de las expectativas de los actuales campeones.\n\nEntrenador: Jeonggyun ''KkOma'' Kim\n","pt_BR":"<p>SK Telecom T1 é a melhor equipe da história de League of Legends. Com três Campeonatos Mundiais conquistados em 2013, 2015 e 2016, nenhuma equipe se aproxima da sua soberania. Depois de um jogo excelente em 2015 que resultou no seu segundo título, a SKT começou 2016 com dificuldades. Mas eles conseguiram virar o jogo na IEM Katowice, terminando em primeiro no Champions Spring 2016 e vencendo o Mid-Season Invitational 2016.</p>\n\n<p>Eles encontraram outro problema quando não conseguiram chegar à final no Champions Summer 2016, perdendo para KT Rolster. Mas a velha SKT se mostrou imediatamente no Campeonato Mundial 2016, e Faker liderou a equipe à sua segunda vitória mundial consecutiva. Depois de dominar a LCK desta primavera, a SKT avança para o Mid-Season Invitational 2017, no Brasil, como uma das grandes favoritas. Qualquer coisa menos que o primeiro lutar seria uma decepção para os campeões reinantes.</p>\n\n<p>Técnico: Jeonggyun \"KkOma\" Kim</p>\n","es_AR":"<p>Muchos consideran que SKT T1 es uno de los mejores equipos de League of Legends del mundo, con un primer lugar en los Campeonatos Mundiales 2013 y 2015, y varias finales en la OGN Champions. Su dominio en el 2015 era motivo de gran admiración. SKT se llevó a casa el primer lugar en la Champions de primavera y verano, y luego cerró el año con una actuación casi invicta que le mereció el primer lugar en el Campeonato Mundial 2016.</p>\n\n<p>Luego de su participación estelar en el 2015 y de pasar por varios cambios en el plantel, SKTelecom no tuvo un buen inicio del 2016. Sin embargo, brillarían luego en la competencia con una actuación invicta en el IEM Katowice. Después de eso, todo fue un trámite para SKTelecom. Obtuvieron un primer lugar en la Champions Spring 2016 y nuevamente en el torneo por invitación de mitad de temporada. Sin embargo, el equipo se vio en dificultades y no llegó a la final del torneo de clausura de la LCK 2016. Incluso después de terminar tan mal, SKTelecom siguió siendo uno de los mejores equipos del mundo, y está determinado a limpiar su imagen con otro trofeo mundial.</p>\n\n<p><strong>Entrenador: Kim \"KkOma\" Jeong-gyun</strong></p>","ko_KR":"<p>SKT T1은 전 세계에서 리그 오브 레전드 최강 팀 중 하나로 명성이 자자합니다. 시즌 3 월드 챔피언십 및 2015 월드 챔피언십뿐만 아니라 OGN 챔피언스에서 여러 차례 수위에 올랐죠. SKT T1이 2015년에 보여준 포스는 그야말로 어마어마했습니다. 2015 챔피언스 스프링과 서머에서 연달아 우승한 SKT T1은 2015 월드 챔피언십에서는 통틀어 단 한 경기만을 내주고 월드 챔피언으로 등극하며 한 해를 마무리했죠.</p>\n\n<p>영광의 2015년이 끝난 후 로스터 변경으로 인해 SKT T1는 2016년 시즌 초반 힘겨운 시기를 보냈습니다. 하지만 그것도 잠시, IEM Katowice에서 무패의 기록으로 적을 박살내며 포스가 다시 살아났죠. 그 이후 SKT T1은 여느 때처럼 다시 2016 챔피언스 스프링에서 정상에 섰습니다. 결승에서 ROX Tigers를 꺾은 것은 시작일 뿐입니다. MSI에서 SKT T1은 또 다른 국제 대회 트로피를 쟁취하기 위해 다시 전장에 나설 것입니다.</p>"},"foreignIds":{"drupalId":"684"},"players":[46,327,403,404,715,1025,1026,1033],"starters":[46,327,403,404,715],"subs":[1025,1026,1033]},{"id":23,"slug":"counter-logic-gaming","name":"Counter Logic Gaming","guid":"be6c8ee0-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-7wsrm3cc.png","acronym":"CLG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/counter-logic-gaming-90l92qpi.png","createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-26T18:29:01.000Z","bios":{"en_US":"<p>The original League of Legends powerhouse, Counter Logic Gaming crushed all competition during the infancy of LoL esports. However, CLG failed to build on their foundation of success and their performances paled in comparison to those of their rivals during the 2012-2014 seasons. But you can't keep the Counter Logic down.</p>\n\n</p>CLG roared back to life during the Faith Age, scoring their first NA LCS Championship in the Summer of 2015. The team rallied and scored their second Championship in the 2016 NA LCS Spring Playoffs, and headed to the 2016 Mid-Season Invitational in Shanghai, where they made the finals and won the hearts of North America. Even though they were knocked out of the 2016 World Championship early, they stuck together to start 2017. After a shaky spring by their standards, CLG are looking to take home their third NA LCS trophy this summer.</p>\n\n<p>Coach: Anthony \"Zikzlol\" Gray</p>","fr_FR":"<p>Counter Logic Gaming, la toute première machine de guerre de l'histoire de League of Legends, a su écraser ses adversaires alors que la scène de l'e-sport n'en était qu'à ses premiers balbutiements. Malgré tout, CLG n'a pas su capitaliser sur ses premiers succès et ses performances pendant les saisons 2012-2014 font pâle figure auprès de celles de ses rivaux. Heureusement pour l'équipe, les champions de l'e-sport sont davantage ancrés dans le présent que dans le passé. Après une démonstration de pur talent lors des play-offs d'été des LCS NA 2015, CLG a réussi à finir en première place d'un événement majeur, ce qui ne lui était plus arrivé depuis 2011. Même si le départ de Doublelift pour TSM a pu choquer certains fans de CLG, ceux qui avaient gardé la foi ont de nouveau été récompensés lorsque leur ADC débutant Stixxay a aidé l'équipe à atteindre la première place lors des play-offs des LCS NA 2016.</p>","pl_PL":"<p>Najstarsza dotąd działająca, aktywna organizacja zrzeszająca graczy League of Legends. To mówi samo za siebie. Została założona przez George \"HotshotGG\" Georgallidis 16 kwietnia 2010 roku. Natomiast już w sezonie pierwszym brała udział w podrzędnych zawodach ze pełnym składem osobowym. Jeszcze w tym samym roku zespół CLG zdobył czołowe miejsce na World Cyber Games i Newegg Winter Wanfest. Od tego czasu drużyna George’a pojawiała się na większości turniejów, zarówno organizowanych przez Riot Games, jak i tych przez zewnętrzne stowarzyszenia. Do największych osiągnięć CLG należy zaliczyć występy na IEM i Mistrzostwach Świata. Najlepiej, bo skończyli na szczycie podium, czarno-białym poszło 21 sierpnia 2011 roku na Global Challenge Cologne w szóstym sezonie IEM. W pozostałych wydarzeniach zajmowali od drugiego do czwartego miejsca, co dalej stawia ich w dobrym świetle na tle innych drużyn. W pierwszym sezonie na Mistrzostwach Riot Games zajęli piąte miejsce na osiem reprezentacji, co jak wtedy podkreślał \"HotshotGG\" nie zaspokajało ambicji zespołu. Podobnie poszło zawodnikom CLG na Mistrzostwach Świata 2012 – uplasowali się na dziewiątej pozycji ex aequo z Saigon Jokers. Złota era Counter Logic Gaming miała dopiero nadejść w 2015 roku. Drużyna po letnim sezonie NA LCS 2015 znalazła się na drugim miejscu. Jednak w rozgrywkach barażowych, ekipie George’a udało się polepszyć ten wynik, pokonując swoich odwiecznych rywali – Team SoloMid. Niestety pierwsze miejsce w Ameryce nie zapewniło im sukcesu na Mistrzostwach Świata 2015. Pomimo wyniku 2:4 w grupie A, nie powiodła im się próba wejścia do fazy eliminacji.</p>\n<p> \nGeorge \"HotshotGG\" Georgallidis jest jednym z niewielu, tak dobrze znanych przez społeczeństwo League of Legends, właścicieli profesjonalnego zespołu. To wynik jego osobistego uczestnictwa w składzie CLG– do czasu zostania trenerem zagrał aż na trzech różnych liniach. Poza tym kiedy zespół stawiał pierwsze kroki, stream George’a jako pierwszy przyciągnął wielotysięczne tłumy widzów. Porzucił szkołę dla kariery w esportcie, żeby móc się w 100% skupić na dziele życia. Organizacja Counter Logic Gaming jest niezwykle uporządkowana i pozytywnie nastawiona na kontakt z kibicami. Wiedzie bardzo aktywne życie na wszystkich portalach społecznościowych. Wśród swoich wielbicieli jest również znana ze świetnej kadry.</p>\n<p>\nChociaż Counter Logic Gaming zostało pierwotnie stworzone z myślą o konkurowaniu w League of Legends, to wraz z rozwojem nabyło oddziały do innych gier. W swojej historii, oprócz główniej drużyny sponsorowała też zespoły w NA Challenger Series i EU LCS, lecz do początku sezonu trzeciego te projekty porzucono. CLG zasłynęło także z odwiecznej konkurencji z inną długowieczną drużyną – Team SoloMid. Ich mecze często są porównywane przez społeczność League of Legends do El Classico w piłce nożnej.</p>\n","de_DE":"Counter Logic Gaming zählt zu den Schwergewichten in League of Legends, die in den Anfängen des E-Sports alle Konkurrenten aus dem Weg räumten. Allerdings hat es CLG nicht geschafft, auf ihrem anfänglichen Erfolg aufzubauen, und in den Saisons 2012–2014 ließen ihre Leistungen im Vergleich zu ihren Rivalen stark nach.\nAber man darf Counter Logic nie abschreiben.</p>\n<p>\nIm Sommer 2015 fand CLG zu alter Stärke zurück und konnte erstmals die NA LCS gewinnen. Die Mannschaft fing sich wieder und gewann in den Frühjahrsentscheidungsspielen der NA LCS 2016 ihren zweiten Titel, woraufhin sie zum Mid-Season Invitational nach Shanghai fuhren, wo sie das Finale erreichten und Nordamerika im Sturm eroberten. Obwohl sie bereits früh aus der Weltmeisterschaft 2016 ausschieden, blieben sie zusammen und kehren dieses Jahr mit einer unveränderten Aufstellung zurück. Mit den Erfolgen von 2016 im Rückspiegel wird CLG versuchen, die NA LCS in diesem Frühjahr zum dritten Mal zu gewinnen.\n<p>\nCoach: Anthony „Zikzlol“ Gray\n","es_ES":"<p>Originalmente uno de los equipos por excelencia de League of League of Legends, Counter Logic Gaming aplastó a todos sus contrincantes durante las etapas iniciales de LoL como esport. Sin embargo, CLG no consiguió mantenerse en lo más alto y durante las temporadas 2012-2014 vieron cómo su actuación palidecía ante la de equipos rivales. Por suerte para CLG, los campeones de los esports se deciden en el presente, no en el pasado. Con una verdadera demostración de habilidad en los playoffs de verano de la LCS NA 2015, CLG se llevó el primer puesto, un logro que no había obtenido en eventos de tal magnitud desde 2011. A esta increíble actuación en casa le siguió un segundo puesto en el MSI 2016. Con CLG siempre hay que tener fe.</p>","pt_BR":"Sendo a primeira potência do League of Legends, a Counter Logic Gaming devastou todos os adversários nos primórdios do LoL e-Sports. No entanto, a CLG não conseguiu manter sua base de sucesso e suas performances não ficaram à altura da concorrência nas temporadas 2012 a 2014. Mas para a sorte da CLG, os campeões dos e-Sports são decididos no presente e não no passado. Uma incrível demonstração de habilidade nas Eliminatórias de Verão da LCS NA 2015 deu o primeiro lugar à equipe em um grande evento pela primeira vez desde 2011. Eles conseguiram manter as grandes atuações com um segundo lugar no MSI 2016. ","es_AR":"<p>Como una potencia histórica de League of Legends, Counter Logic Gaming arrasó en toda la competencia durante los primeros días de los eSports de LoL. Sin embargo, CLG no logró afianzarse luego de sus momentos de gloria y sus actuaciones no estuvieron a la altura de sus rivales durante las temporadas del 2012 a 2014. Por suerte para ellos, los campeones de los eSports se determinan en el presente, no en el pasado. Ante una maravillosa muestra de habilidad en las eliminatorias de verano de la LCS NA 2015, CLG logró por primera vez un puesto número uno desde el 2011. Para continuar con su excelente desempeño en casa, lograron un segundo lugar en el torneo por invitación de mitad de temporada en el 2016.</p>\n\n<p><strong>Entrenador: Tony \"Zikzlol\" Gray</strong></p>"},"foreignIds":{"drupalId":"2"},"players":[147,154,489,618,1627,1628,1629,1630,1631],"starters":[147,154,489,618,1628],"subs":[1627,1629,1630,1631]}],"players":[{"id":46,"slug":"faker","name":"Faker","firstName":"Sanghyeok","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/faker-euaqlz0c.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2017-07-06T14:24:48.000Z","bios":{"en_US":"<p>Sanghyeok \"Faker\" Lee is an icon of modern esports. Known as “The Demon King” in his homeland of South Korea, Faker’s quiet and respectful demeanor in person does little to alert bystanders to his dominance on the Rift. But then he steps onto the stage and shatters the limits of what we thought was possible with just a mouse and a keyboard. Faker was so untouchable in Korea for so long that his opponents started saying he had a 3rd Summoner Spell -- how else could he be so strong?</p>\n\n<p>Faker has already raised the bar for what a mid laner is expected to deliver, lifting the Summoner's Cup at three World Championships, once in 2013, again in 2015, and the third time in 2016. He has also netted his team trophies at Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016, and the 2016 Mid-Season Invitational (whew). After winning every international event that League of Legends offered in 2016, Faker and SKT are looking to sweep the international stage once again in 2017.</p>","fr_FR":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pl_PL":"Sanghyeok „Faker” Lee jest ikoną nowoczesnego e-sportu. Znany w swojej ojczystej Korei Południowej jako „Demoniczny Król”, Faker sprawia wrażenie osoby spokojnej i uprzejmej. Nic nie zdradza tego, że potrafi absolutnie dominować na Rifcie. A potem wchodzi na scenę i przekracza granice wszystkiego, co wydawało się możliwe do osiągnięcia za pomocą zwykłej myszy i klawiatury. Faker był w Korei niepokonany od tak dawna, że przeciwnicy zaczęli posądzać go o stosowanie trzeciego czaru przywoływacza — jak inaczej mógłby być tak silny?\n\nFaker znacznie podniósł poprzeczkę oczekiwań wobec zawodnika środkowej alei, trzykrotnie zdobywając Puchar Przywoływacza na Mistrzostwach Świata — po raz pierwszy w 2013 roku, potem w 2015 roku, a po raz trzeci w 2016 roku. Zdobył także trofea dla swojej drużyny podczas Champions Summer 2013, Champions Winter 2013−2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 i Mid-Season Invitational 2016 (uff!). Po wygraniu każdego międzynarodowego turnieju, jaki League of Legends oferowało w 2016 roku, Faker i SKT zamierzają zabrać do domu kolejny międzynarodowy tytuł zdobyty na Mid-Season Invitational 2017.\n","de_DE":"Sanghyeok „Faker“ Lee ist eine Ikone des modernen E-Sports. In seinem Heimatland Südkorea als der „Dämonenkönig“ bekannt, alarmiert sein ruhiges und stets höfliches Verhalten Zuschauende nur sehr selten über seine absolute Dominanz in der Kluft. Aber dann betritt er die Bühne und beweist uns, dass seine Fähigkeiten mit Maus und Tastatur keine Grenzen kennen. Faker war in Korea so lange unantastbar, dass seine Gegner schon glaubten, er hätte einen dritten Beschwörerzauber – wie hätte er sonst so stark sein können?\n\nFaker konnte den Beschwörerpokal bereits in den Jahren 2013, 2015 und jetzt auch 2016 in die Höhe stemmen und hat die Messlatte für Mid-Laner hoch gelegt. Außerdem sicherte er seiner Mannschaft Titel beim Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 und beim Mid-Season Invitational 2016 (uff!). Nachdem Faker 2016 jedes internationale Event, das League of Legends zu bieten hat, gewinnen konnte, wird er zusammen mit SKT versuchen, sich beim Mid-Season Invitational 2017 den nächsten internationalen Titel zu sichern.\n","es_ES":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pt_BR":"<p>Sanghyeok \"Faker\" Lee é um ícone do dos e-sports moderno. Conhecido como \"O Rei Demônio\" em sua terra natal na Coreia do Sul, sua personalidade calma e respeitosa pode acabar enganando os espectadores de plantão sobre as sua soberania no Rift. Quando ele entra no palco, ultrapassa todo os limites do que achávamos possível com apenas mouse e teclado. Faker ficou invicto na Coreia por tanto tempo que seus oponentes diziam que ele tinha um terceiro Feitiço de Invocador. Afinal como ele poderia ser tão forte?</p>\n\n<p>Faker já elevou as expectativas para jogadores do meio e já pôs as mãos em três Copas do Invocador nos Campeonatos Mundiais, uma em 2013, outra em 2015 e agora uma terceira em 2016. Ele também conseguiu outros troféus para sua equipe na Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e no Mid-Season Invitational 2016 (ufa!). Depois de vencerem todos os eventos internacionais oferecidos por League of Legends em 2016, Faker e a SKT procuram levar para casa outro título internacional no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한국에서 '마왕'이라 불리는 \"Faker\" 이상혁은 현대 e스포츠의 아이콘입니다. Faker의 조용하고 공손한 행동거지와 그가 소환사의 협곡에서 누리는 지배력을 연관짓기는 힘듭니다. 하지만 그가 전장에 들어서면 지금까지 사람들이 마우스와 키보드로 가능하다 생각했던 그 모든 한계들을 깨뜨려버리죠. 한국에서는 Faker가 너무 오랫동안 최강자의 지위를 누린 탓에 그가 세 번째 소환사 주문을 쓸 수 있는 게 아니냐는 말까지 나왔습니다. Faker는 어떻게 그렇게 강할 수 있을까요? </p>\n<p style=”font-family:”나눔고딕”;\">Faker는 미드 라이너에게 기대되는 수준을 이미 끌어올렸고, 2013년과 2015년 월드 챔피언십에서 두 번이나 소환사 컵을 거머쥐었습니다. 2013 챔피언스 서머 시즌, 2013-2014 챔피언스 윈터 시즌, 2015 챔피언스 스프링 시즌, 2015 챔피언스 서머 시즌에도 팀에게 우승컵을 안겨줬죠. 하지만 그의 경쟁력은 전혀 시들지 않은 것처럼 보입니다. Faker는 계속해서 SK Telecom T1의 다른 팀원들과 자기자신을 밀어붙여 새로운 전략을 개발하고 챔피언 풀을 넓힙니다. Faker가 리그 오브 레전드 사상 최고의 선수일까요? 아마도요. 하지만 한 가지만은 분명합니다. 그건 바로 Faker가 최초의 세계 e스포츠 슈퍼스타 중 하나로 역사에 남을 거라는 사실이죠. </p>\n","es_AR":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>","cs_CZ":"<p>Sanghyeok „Faker“ Lee je živoucí legendou moderních esportů. Při osobním setkání s ním by jen málokdo tušil, že tento tichý a uctivý mladík je vládcem Žlebu, kterému v jeho rodné Jižní Koreji přezdívají „Král démonů“. Pak ovšem vkročí na pódium a s pouhou klávesnicí a myší zboří všechny naše představy o tom, co všechno je v lidských silách. Faker byl v Koreji tak dlouho nedotknutelný, až o něm začali jeho soupeři říkat, že má k dispozici 3. vyvolávačovo kouzlo – jak jinak by mohl být tak silný?</p>\n\n<p>Faker zcela změnil standard toho, co se od středového lajnaře ve hře očekává, a třikrát pozvedl nad hlavu Vyvolávačův pohár z mistrovství světa: poprvé roku 2013, poté roku 2015 a potřetí roku 2016. Také se svým týmem získal trofeje z Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 a Mid-Season Invitational 2016 (uf). Poté, co roku 2016 vyhrál všechny mezinárodní turnaje League of Legends, se Faker zúčastní i All-Star 2016 v Barceloně jako absolutní král Žlebu. Jeho bohatá kariéra skvěle odolává zkoušce času a letošní All-Star bude dalším z mnoha úspěchů na jeho kontě. Opět je na čase, abychom byli svědky toho, jak se píše historie.</p>","el_GR":"<p>Ο Sanghyeok \"Faker\" Lee είναι ένας από τους πιο εμβληματικούς παίκτες στα σύγχρονα esports. Στην πατρίδα του, τη Νότια Κορέα, είναι γνωστός ως «Ο Βασιλιάς των Δαιμόνων», αλλά η συγκρατημένη και ευγενική συμπεριφορά δεν προδίδει καθόλου την ηγετική του παρουσία στο Φαράγγι των Επικαλεστών. Όταν όμως ανεβαίνει στη σκηνή, δεν είναι λίγες οι φορές που μας έχει αφήσει με το στόμα ανοιχτό. Απλά δεν πιστεύεις ότι γίνονται αυτά με ποντίκι και πληκτρολόγιο. Ο Faker ήταν τόσο εκτός συναγωνισμού στην Κορέα, για τόσο μεγάλο χρονικό διάστημα που οι αντίπαλοί του άρχισαν να λένε ότι είχε και 3ο Ξόρκι Επικαλεστή. Πώς αλλιώς θα μπορούσε να είναι τόσο ανίκητος;</p>\n\n<p>Ο Faker έχει ήδη θέσει ψηλά τον πήχη όσον αφορά τις προσδοκίες που μπορεί να έχει μια ομάδα από έναν παίκτη μεσαίας λωρίδας. Έχει ήδη σηκώσει το Κύπελλο του Επικαλεστή σε τρία Παγκόσμια Πρωταθλήματα, πρώτη φορά το 2013, μετά πάλι το 2015 και για τρίτη φορά το 2016. Επίσης, έχει οδηγήσει την ομάδα του στην κατάκτηση τροπαίων στα τουρνουά Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 και στο Mid-Season Invitational 2016 (ουφ!). Αφού κέρδισε όλα τα διεθνή τουρνουά του League of Legends για το 2016, ο Faker έρχεται στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη με τον αέρα του αδιαμφισβήτητου κυρίαρχου του παιχνιδιού. Η λαμπρή καριέρα του δεν δείχνει σημάδια κόπωσης και αυτό το Τουρνουά All-Star θα είναι άλλη μια επιτυχία που μπορεί να προσθέσει στο ήδη απίστευτο ενεργητικό του. Είναι έτοιμος να γράψει ιστορία, για ακόμη μια φορά.</p>\n","hu_HU":"Sanghyeok „Faker” Lee a modern e-sport egyik ikonja. A szülőhazájában, Dél-Koreában „Démonkirályként” emlegetett Faker élőben csendes és tisztelettudó ember, de a Szurdokban egészen más arcát mutatja. Teljesen újraírta az elvárásokat azzal kapcsolatban, hogy mit lehet megtenni egy egérrel és egy billentyűzettel. Fakerrel nem bírtak el Koreában, olyannyira, hogy egyesek szerint van egy harmadik idézői varázslata. Máskülönben hogy lehetne ennyire erős?</p>\n\nFaker eleve magasabbra tette a lécet minden középső ösvényes számára, három világbajnokságon emelhette magasba az Idézők Kupáját, 2013-ban, majd 2015-ben és 2016-ban. Ezenkívül a következő trófeákat zsebelte be: Champions 2013-os nyári szakasz, Champions 2013-2014-es téli szakasz, Champions 2015-ös tavaszi szakasz, Champions 2015-ös nyári szakasz, Champions 2016-os tavaszi szakasz, és a 2016-os szezonközi meghívásos verseny (végig se lehet mondani egy levegővel). Faker 2016-ban megnyert minden League of Legends-versenyt, és Barcelonában a Szurdok egyértelmű királyaként lép a 2016-os All-Star gála színpadára. Játéktudásán nem fog az idő vasfoga, és az All-Star gálán tovább gyarapíthatja győzelmeinek hosszú sorát. Bajnoki címből sosem lehet túl sok.\n\n","it_IT":"Sanghyeok \"Faker\" Lee è uno dei simboli degli eSport moderni. Faker, soprannominato \"Re demone\" nella sua natia Corea del Sud, ha un carattere taciturno e rispettoso che non fa minimamente trasparire la sua immensa abilità. Tuttavia, non appena sale sul palcoscenico è in grado di fare letteralmente l'impossibile con un mouse e una tastiera. Faker è rimasto imbattuto per così tanto tempo in Corea che i suoi avversari hanno iniziato a sospettare che avesse accesso a un terzo incantesimo dell'evocatore: come spiegare altrimenti la sua abilità?</p>\n\nFaker ha già scritto una nuova pagina nella storia dei centrali alzando la Coppa degli evocatori per ben tre volte, nel 2013, nel 2015 e poi nel 2016. Si è anche portato a casa parecchi trofei di squadra: Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e il Mid-Season Invitational 2016 (wow!). Dopo aver vinto tutti gli eventi internazionali organizzati da League of Legends nel 2016, Faker sale sul palco dell'All-Star 2016 a Barcellona come re indiscusso della Landa. La sua incredibile carriera resiste a ogni assalto del tempo e questo All-Star rappresenterà un'ulteriore voce da aggiungere alla sua impressionante lista di successi. Stiamo per assistere a un evento storico... di nuovo.\n","ru_RU":"","ro_RO":"Sanghyeok ''Faker'' Lee a devenit reprezentantul competiției de top în lumea eSports. În Coreea de Sud, acolo unde locuiește, este cunoscut ca ''Regele Demon'', iar atitudinea lui tăcută și respectuoasă când e întâlnit pe viu nu-i trădează deloc dominanța în Rift. Dar apoi, urcă pe scenă și distruge orice așteptare pe care am putea s-o avem de la cineva cu un mouse și o tastatură. Faker e atât de intangibil în Coreea de atât de multă vreme încât adversarii lui au început să spună că ar avea o a treia vrajă de invocator – cum altcumva ar putea fi atât de puternic?\n</p>\nFaker a ridicat deja standardele pentru jucătorii de pe culoarul de mijloc, ridicând Cupa Invocatorului la trei Campionate Mondiale, unul în 2013, altul în 2015, iar cel mai recent, în 2016. A reușit să obțină trofee pentru echipa lui și la Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 și Mid-Season Invitational 2016. După ce a câștigat toate evenimentele internaționale posibile de League of Legends din 2016, Faker vine pe scena All-Star Event 2016 din Barcelona ca rege necontestat al Riftului. Cariera sa impresionantă nu e deloc afectată de trecerea timpului, iar acest All-Star Event va putea fi o altă reușită pe care s-o adauge în palmaresul său deja terifiant. E momentul să asistăm din nou la scrierea istoriei.\n","es_MX":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>"},"foreignIds":{"drupalId":"692","ESPORTSTMNT06":"200000357","TRLH1":"200000410","TRLH2":"200000310","TRLT3":"200000208"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":147,"slug":"zionspartan","name":"Darshan","firstName":"Darshan","lastName":"Upadhyaya","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zionspartan-2cran9xi.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-27T00:36:23.000Z","bios":{"en_US":"<p>Darshan \"Darshan\" Upadhyaha is one of Counter Logic Gaming's veterans, originally coming to the team to bring stability to the team’s top lane. He’s gone through his own share of changes, switching from ZionSpartan to Darshan, and adapting to the many metas that have rolled by. While Darshan is capable of playing a tank like Gnar or Maokai when called for, he shines when he can bust out a Fiora or Jax and just go off. Darshan also has a fantastic level of game knowledge, allowing him to pick champions that blow open the weaknesses in his opponents’ team composition.</p>\n\n<p>But no matter what champion he is playing, Darshan is going to have fun if he is in the top lane. His aggressive, cocky approach has led to some of the most hype moments in the LCS, like split pushing and taking the Immortals down for the very first time on Fiora. Whether he’s playing the utility tank or the split push carry, Darshan is always prepared to take on additional pressure.</p>","fr_FR":"<p>\nDarshan Upadhyaya a rejoint Counter Logic Gaming en 2015 pour que l'équipe dispose enfin d'un top laner stable. Ou pour être plus clair, d'un puissant carry. Quand il ne nous fait pas l'honneur de sa voix, Darshan est le top laner attitré de CLG. Il se montre très dominateur avec des champions comme Jax et Riven, mais n'hésite pas à choisir des options plus orientées tank, comme Gnar et Maokai, quand CLG a besoin d'une première ligne.</p>\n\n<p>Darshan profite également d'une incroyable connaissance du jeu, qui lui permet de choisir des champions capables d'exploiter les faiblesses de la composition d'équipe adverse. Mais quel que soit le champion qu'il joue, Darshan va s'amuser s'il est sur la voie du haut. « Auparavant, jouer top n'était pas très drôle. Mais je trouve que ça n'a jamais été plus passionnant qu'aujourd'hui depuis la Saison 2. En général, maintenant, c'est sur la voie du haut que ça se joue », explique Darshan. Et s'il peut jouer Riven, eh bien, c'est la cerise sur le gâteau.</p>","pl_PL":"<p>Taki talent jak Darshan nie mógł pozostać długo niezauważony. Poszukiwania swojego miejsca w świecie esportu rozpoczął w lutym 2012 roku od zespołu JYAJ. Gościł tam tylko miesiąc, podobnie jak w kolejnej drużynie – Monomaniac eSports. Zatrzymał się na dłużej dopiero w Team Dynamic, którego był członkiem aż do zarejestrowania swojej własnej drużyny w styczniu 2013 roku. \"Darshan\" to jeden z założycieli Good Game University, później przemianowanego na Team Coast w związku z pojawieniem się nowego sponsora. Wraz ze swoim nowym zespołem zakwalifikował się do wiosennego sezonu NA LCS 2013. Tam miał okazję nabrać doświadczenia na scenie esportowej, jak i wykazać się swoimi umiejętnościami. Niestety relegacja Team Coast z NA LCS, skłoniły go do zmiany zespołu w maju 2014 roku. Jego nadzwyczajne umiejętności zostały już dostrzeżone i docenione przez Team Dignitas, dla którego grał na top-lanie, aż do października tego roku. Już dwa tygodnie później, 7 listopada, został ogłoszony nowym członkiem organizacji Counter Logic Gaming. Z tym zespołem wiążą się jego największe dokonania w League of Legends. Za swój czołowy sukces uważa zdobycie amerykańskiego szczytu, wygrywając z Team SoloMid w letnim finale NA LCS 2015. </p>\n<p>\nW wywiadzie dla LoL Esports wyjawił, że jest szczęśliwy, ponieważ jest dobry w tym co naprawdę kocha – graniu w League of Legends.  Dlatego zdecydował się poświęcić swoją edukację na rzecz stania się najlepszym graczem – dla top-lanera CLG to wykorzystanie szansy, którą dał mu los. Wcześniej był znany pod pseudonimem „ZionSpartan”, tak też zwracali się do niego nawet nauczyciele, jak dowiedzieli się o sławie Darshana. Kiedy ludzie w szkole dowiedzieli się sukcesach ich kolegi na scenie esportowej zaczęli go lepiej traktować, a on sam zyskał sporo pewności siebie.\nDo ostatecznego efektu przyczyniła się jego matka, która też wypowiedziała się podczas tego wywiadu. Zapewniła, że stara się być podporą dla Darshana w pogoni za pasją. Wielu jego znajomych zauważyło, że dzieło Riot Games pozytywnie go zmieniło. Otrzymał olbrzymie wsparcie nie tylko od najbliższych, ale również od pedagogów, którzy wspierali go w realizacji marzeń. </p>\n<p>\n\"Darshan\" uwielbia grać Rumblem, lecz o dziwo to nie on przysporzył mu takiej popularności. Stał się słynny z powodu swojej wybitnej gry Jaycem – w pewnym momencie doprowadziło to do banów Obrońcy Jutra przeciwko Team Coast, w którym był wtedy Darshan. Siał też postrach Fizzem i Nidalee, co tylko potwierdziło jego umiłowanie do postaci, które zadają naprawdę duże obrażenia. Część swojej sławy zasługuje zaproszeniom do grona analityków, np. podczas Mistrzostw Świata 2013. Jadąc na 3 edycję 10 sezonu IEM w San Jose zmienił swój pseudonim na \"Darshan\", ponieważ wszyscy w organizacji i tak mówili mu po imieniu.\n</p>","de_DE":"Darshan „Darshan“ Upadhyaha sollte ursprünglich die Stabilität der Mannschaft auf der oberen Lane verbessern und gehört seither zu den Veteranen von Counter Logic Gaming. Im Laufe der Zeit musste er sich selbst häufig verändern. So wechselte er seinen Namen von ZionSpartan zu Darshan und passte sich immer wieder dem neuen Metaspiel an. Obwohl Darshan wenn nötig auch mit Tanks wie Gnar oder Maokai spielen kann, ist er doch mit Fiora oder Jax am effektivsten. Darshan verfügt auch über ein fantastisches Spielwissen, wodurch er Champions wählen kann, mit denen er Schwächen des gegnerischen Teams offenlegt.\n<p>\nAber egal, welchen Champion er spielt, Darshan hat Spaß, wenn er in der oberen Lane ist. Sein aggressiver, großspuriger Zugang zum Spiel hat die Fans in der LCS immer wieder jubeln lassen (als er beispielsweise unbehelligt seine Lane vorantrieb und die Immortals zum ersten Mal mit Fiora besiegte). Egal, ob er einen unterstützenden Tank oder einen Carry auf einer unbehelligten Lane spielt, Darshan ist immer bereit, den zusätzlichen Druck auf sich zu nehmen.\n","es_ES":"<p>Incluso Lolesports.com le llama Darshan. O algo así. Darshan “ZionSpartan” Upadhyaya se unió a Counter Logic Gaming en 2015 para traer estabilidad en el top del equipo, y por estabilidad queremos decir un estilo de juego agresivo. Cuando no está bendiciendo a la tierra con su voz, ZionSpartan es el inestable top conocido por arrollar a sus enemigos. Es una fuerza imponente en campeones como Jax o Riven, pero también puede optar por tanques como Gnar y Maokai cuando el equipo lo necesita. </p>\n\n<p>Además ZionSpartan tiene un conocimiento profundo del juego, permitiéndole escoger campeones que expongan los puntos débiles del equipo enemigo. Pero da igual con qué campeón está jugando, ZionSpartan va a pasárselo bien si está en la calle superior. “Antes, jugar top no era muy divertido. Ahora, sin embargo, es una de los mejores roles para pasarlo bien, es un rol decisivo”, dice ZionSpartan. ¿La guinda del pastel? Que le dejen jugar a Riven. </p>\n","pt_BR":"<p>Darshan Upadhyay entrou na Counter Logic Gaming em 2015 para finalmente trazer estabilidade para a rota do topo da equipe. E por estabilidade, nós queremos dizer carregar o jogo. Quando não está encantando o mundo com sua cantoria, Darshan é o jogador de topo titular da CLG. Ele domina campeões como Jax e Riven, mas também aprendeu a jogar rapidamente com tanques como Gnar e Maokai quando a CLG precisou de uma linha de frente.</p>\n\n<p>Darshan também tem um <a href=\"http://na.lolesports.com/articles/zionspartan-leads-charge-against-c9\" target=\"_blank\">fantástico conhecimento do jogo</a>, o que o permite escolher campeões que expõem os pontos fracos da composição da equipe adversária. Mas não importa com que campeão ele esteja jogando, Darshan vai <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=\"_blank\">se divertir</a> se estiver na rota do topo. “Antes, jogar de topo não era muito divertido. Mas agora é o mais divertido que já esteve desde a 2º Temporada. No geral, a rota do topo está em um bom lugar agora”, disse Darshan. Se ele conseguir <a href=\"http://na.lolesports.com/articles/ask-pros-clgs-zionspartan\" target=”_blank”>jogar de Riven</a>, bem, será a cereja que faltava no bolo.</p>","es_AR":"<p>Hasta Lolesports.com lo llama Darshan. O algo así. Darshan Upadhyaya se unió a Counter Logic Gaming en el 2015 para terminar de dar estabilidad al carril superior del equipo. Y por estabilidad nos referimos a un estilo de juego de acarreo a la máxima potencia. Los días que no está encantando los oídos del mundo con su peculiar voz de cantante, Darshan se desempeña como un sobresaliente carrilera superior en CLG. Es dominante con campeones como Jax y Riven, pero también escogió opciones más de tipo tanque como Gnar y Maokai cuando CLG necesitaba una línea en el frente.</p>\n\n<p>Darshan también tiene un fantástico nivel de conocimiento del juego, que le permite escoger campeones que explotan las debilidades de sus oponentes. Pero no importa que campeón esté usando, Darshan se va a divertir si está en el carril superior. <i>\"Antes, el superior no era muy divertido. Pero ha sido lo más divertido desde la temporada 2. El carril superior es donde está la diversión ahora, en general\"</i>, dice Darshan. Si llega a usar a Riven, bueno, eso es la cereza del pastel.</p>","en_AU":"","en_GB":"","en_PL":""},"foreignIds":{"drupalId":"35","TRLH1":"200000181","TRLH2":"200000085"},"socialNetworks":{"facebook":"facebook.com/CSTZionSpartan","twitter":"https://twitter.com/ZionSpartan","twitch":"twitch.tv/zionspartan"},"champions":[],"liveGameTeam":23},{"id":154,"slug":"aphromoo","name":"aphromoo","firstName":"Zaqueri","lastName":"Black","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aphromoo-dzxe15v2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-03-26T21:36:58.000Z","bios":{"en_US":"<p>Zaqueri “aphromoo” Black is everything a team could ask for in a support player. The shot-calling playmaker of Counter Logic Gaming is always just a skillshot away from some of the flashiest plays you’ll see from a support. His incredible synergy with the rest of CLG helped the team win the Spring Split, finish second at the Mid-Season Invitational, and earn a spot at Worlds.</p>\n\n<p>aphromoo is often hailed as North America’s most complete support player. Having played AD Carry in a former life, he understands the dynamics of bot lane thoroughly. His approachable demeanor and consistently stunning play have made him a fan favorite across the globe. The dreams of CLG rest largely on his shoulders in 2017, as his shot calling and sensational support play will be essential to victory. It’s not every day we get to see a support carry quite like aphromoo -- so sit back, relax, and enjoy some epic plays.</p>","fr_FR":"<p>Zaqueri \"aphromoo\" Black offre tout ce dont une équipe a besoin chez un support. Le meneur de jeu et décideur de Counter Logic Gaming offre toujours un jeu des plus spectaculaires pour un support. Son incroyable synergie avec les autres joueurs de CLG a permis à l'équipe de remporter le segment de printemps, de finir second lors du Mid-Season Invitational et de se qualifier pour le Mondial. Une grande majorité des fans l'a choisi comme le support représentant l'Amérique du Nord avec un vote massif de 55,3 pour cent.</p>\n\n<p>aphromoo a joué un rôle essentiel dans les victoires de CLG au Mondial, motivant son équipe quand ils se faisaient distancer et les ralliant pour viser la victoire. Malheureusement, CLG n'a pas pu se rassembler face à Albus NoX Luna, qui a pris tout le groupe par surprise et s'est qualifié pour les quarts de finale. Le leadership d'aphromoo fera sans aucun doute une apparition à l'événement All-Stars 2016. Alors que toutes les équipes ont des joueurs compétents, aphromoo peut être le ciment qui consolide le travail d'équipe en Amérique du Nord et permettre à l'équipe de dominer la compétition.</p>","pl_PL":"Zaqueri „aphromoo” Black reprezentuje sobą wszystko, czego drużyna może oczekiwać od zawodnika wsparcia. Odpowiedzialnego za podejmowanie decyzji rozgrywającego Counter Logic Gaming zawsze dzieli tylko jedna dobrze wykonana umiejętność od najwspanialszych zagrywek, jakie można zobaczyć w wykonaniu zawodnika wsparcia. Jego niesamowita synergia z resztą CLG pomogła drużynie wygrać wiosenny split, zdobyć drugie miejsce na Mid-Season Invitational i dostać się na Mistrzostwa. Fani gremialnie wybrali go na reprezentanta wsparcia NA, dając mu całe 55,3 procenta głosów.</p>\n\naphromoo odegrał kluczową rolę w zwycięstwach CLG na Mistrzostwach, motywując swoją drużynę, gdy traciła impet i pchając ją ku zwycięstwu. Niestety CLG nie zdołali pokonać Albus NoX Luna, którzy wzięli całą grupę z zaskoczenia i zdobyli miejsce w ćwierćfinałach. aphromoo bez wątpienia wykaże się swoimi zdolnościami przywódczymi także podczas wydarzenia All-Star 2016. Chociaż każda drużyna ma zdolnych zawodników, aphromoo może być spoiwem, które umocni współpracę drużyny NA i zapewni składowi przewagę nad rywalami.\n\n","de_DE":"Zaqueri „aphromoo“ Black ist ein Bilderbuch-Supporter, wie ihn sich jede Mannschaft wünscht. Der Spielmacher von Counter Logic Gaming ist immer nur einen Skillshot davon entfernt, die auffälligsten Spielzüge zu machen, die ein Supporter nur machen kann. Dank der unglaublich guten Harmonie zwischen ihm und seinen Teamkameraden von CLG konnte die Mannschaft den Frühjahrs-Split gewinnen, im Mid-Season Invitational den zweiten Platz erobern und sich die Teilnahme an der WM sichern. \n</p>\nAphromoo wird häufig als Nordamerikas bester Support-Spieler bezeichnet. Da er in einem früheren Leben als AD-Carry spielte, versteht er die Dynamiken der unteren Lane voll und ganz. Sein aufgeschlossenes Auftreten und seine immer wieder beeindruckenden Spielzüge haben ihn zu einem Liebling der Fans auf der ganzen Welt gemacht. 2017 ruhen CLGs Träume zu einem Großteil auf seinen Schultern, da seine Ansagen und seine unglaublichen Spielzüge als Supporter für jeden Sieg entscheidend sind. Man bekommt nicht jeden Tag einen Carry-Supporter wie Aphromoo zu sehen – lehn dich also zurück, entspann dich und genieße ein paar epische Spielzüge.\n","es_ES":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de apoyo. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de apoyo que jamás hayáis visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganase el split de primavera, acabase segundo en el Mid-Season Invitational y se reservase un puesto en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los apoyos de NA.</p> <p>aphromoo jugó un papel clave en las victorias de CLG en el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","pt_BR":"<p>Zaqueri “aphromoo” Black é tudo o que uma equipe sonha em um jogador de suporte. O estrategista da Counter Logic Gaming sempre está a uma habilidade de uma jogada épica. Sua sinergia incrível com o restante da CLG ajudou a equipe a vencer a Etapa de Primavera, acabar o Mid-Season Invitational em segundo lugar e lhe rendeu uma vaga no Mundial. A maioria dos fãs o escolheu como o Suporte representante do NA, com 55,3% dos votos.</p> <p>Aphromoo teve um papel fundamental nas vitórias da CLG no Mundial, mantendo a equipe motivada quando ficavam para trás e os levando à vitória. Infelizmente, a CLG não conseguiu passar da Albus NoX Luna, que tomou o grupo todo de surpresa e conseguiu uma vaga nas quartas de final. A liderança de aphromoo certamente fará uma aparição no Evento All-Star 2016. Apesar de todas as equipe terem jogadores habilidosos, aphromoo pode ser a cola que solidificará o trabalho em equipe da equipe de NA e deixará o esquadrão em vantagem.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Zaqueri “aphromoo” Black은 북미 LCS에서 가장 훌륭한 서포터 중 하나입니다. 쓰레쉬, 블리츠크랭크를 활용한 공격적 플레이로 알려진 aphromoo는 종종 팀원들에게 별로 애쓰지 않고도 킬을 선사합니다. 그는 \"제가 스킬들을 잘 준비해놓으면 우리 팀이 그 뒤를 따라 들어와 경기에서 앞서갈 수 있죠\"라고 말합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 aphromoo는 서포터 이상의 플레이어입니다. CLG의 메인 오더를 담당했던 그는 목표물에서 목표물로 팀을 이끌며 상황이 안 좋아질 때 팀의 사기를 높이는 존재입니다. 다른 모든 것이 실패하더라도 aphromoo는 그냥 솔로큐에 뛰어들어 모두 웃어넘길 수 있죠. 또는 적 팀으로 다이브해 해치워버릴 수도 있고요. aphromoo에게 잘 맞는 것이라면 뭐든지 상관없습니다. 경험, 스킬을 사용하는 피지컬, S급 웃음을 모두 갖춘 aphromoo는 앞으로도 CLG의 성공에서 중요한 역할을 맡게 될 확률이 큽니다.\n<p style=”font-family:”나눔고딕”;\">그의 이야기가 담긴 Drive 페이지에서 aphromoo를 움직이게 하는 것이 무엇인지 알아보세요. </p>\n","es_AR":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>","cs_CZ":"<p>Zaqueri „aphromoo“ Black je kvintesencí všeho, co si jen tým může přát od hráče v roli podpory. Tohoto stratéga Counter Logic Gaming vždy dělí jen jediná ručně mířená střela od těch nejefektivnějších akcí, jaké jste u podpory kdy viděli. Jeho neuvěřitelná synergie se zbytkem týmu pomohla CLG vyhrát jarní split, obsadit druhé místo na turnaji Mid-Season Invitational a získat pozvánku na mistrovství světa. Při hlasování o tom, kdo pojede na All-Star jako podpora za Severní Ameriku, se fanoušci vyjádřili naprosto jasně a udělili mu přesvědčivých 55,3 % hlasů.</p>\n\n<p>Aphromoo se lvím podílem zasadil o výhry, které si CLG na MS připsalo, motivoval své spoluhráče ve chvílích, kdy se jim nedařilo, a dokázal je dotáhnout až k vítězství. CLG se bohužel nedostalo přes tým Albus NoX Luna, který zaskočil celou skupinu a probojoval se do čtvrtfinále. Aphromooův vůdčí talent dozajista najde uplatnění i na turnaji All-Star 2016. Zkušené hráče má totiž každý tým, ale aphromoo by mohl být oním lepidlem, jež upevní týmovou práci a poskytne jeho celku výhodu nad soupeři.</p>","el_GR":"<p>Ο Zaqueri “aphromoo” Black είναι ο καλύτερος υποστηρικτής που θα μπορούσε να ζητήσει οποιαδήποτε ομάδα. Ο οργανωτής και συντονιστής των Counter Logic Gaming είναι πάντα έτοιμος να κάνει τις πιο θεαματικές κινήσεις που θα δείτε ποτέ από έναν παίκτη υποστήριξης. Η εκπληκτική του συνέργεια με τα υπόλοιπα μέλη των CLG βοήθησε την ομάδα να τερματίσει πρώτη στο Spring Split, δεύτερη στο Mid-Season Invitational και να προκριθεί στο Παγκόσμιο Πρωτάθλημα. Η συντριπτική πλειοψηφία του κοινού τον επέλεξε να εκπροσωπήσει τη Βόρεια Αμερική στη θέση του υποστηρικτή με ένα τρομερό ποσοστό 55,3% επί των συνολικών ψήφων.</p>\n\n<p>Ο aphromoo έπαιξε σημαντικό ρόλο στις νίκες που σημείωσαν οι CLG στο Παγκόσμιο Πρωτάθλημα, ενθαρρύνοντας την ομάδα του όταν έμενε πίσω και οδηγώντας την στη νίκη. Δυστυχώς, η ομαδικότητα των CLG δεν ήταν αρκετή για να ξεπεράσουν το εμπόδιο των Albus NoX Luna που ήταν η μεγάλη έκπληξη του ομίλου και κέρδισαν με το σπαθί τους μια από τις θέσεις που οδηγούσαν στους προημιτελικούς. Δεν υπάρχει αμφιβολία ότι οι ηγετικές ικανότητες του aphromoo θα παίξουν σημαντικό ρόλο και στο Τουρνουά All-Star 2016. Όλες οι ομάδες έχουν πολύ ικανούς παίκτες, αλλά ο aphromoo μπορεί να είναι ο καταλύτης που θα δέσει την ομάδα της Βόρειας Αμερικής και θα της δώσει ένα πολύ σημαντικό πλεονέκτημα.</p>","hu_HU":"Zaqueri „aphromoo” Black az ideális támogató játékos. A Counter Logic Gaming irányítója az egyik leglátványosabban játszó támogató. Példásan együtt tud működni a CLG többi játékosával, aminek köszönhetően megnyerték a tavaszi szakaszt, másodikok lettek a szezonközi meghívásos versenyen, és kijutottak a vb-re. A rajongók elsöprő többséggel őt akarták az NA-csapat támogatójának, a szavazatok 55,3%-át kapta.</p>\n\naphromoo kulcsszerepet játszott a CLG vb-s sikereiben, lelkesítette őket, amikor hátrányba kerültek, és győzelemre vezette őket. Sajnos a CLG elbukott az Albus NoX Luna előtt, akik az egész csoportjukat meglepve a negyeddöntőig meneteltek. aphromoo a 2016-os All-Star gálán is bizonyíthatja vezetői képességeit. Bár tehetséges játékosok minden csapatban vannak, aphromoo lehet az, aki összefogja az NA-csapatot, és jobb helyzetbe hozza őket a versenyhelyzetben.\n","it_IT":"Zaqueri \"aphromoo\" Black è il supporto dei sogni che ogni squadra vorrebbe. Il regista dei Counter Logic Gaming è autore di alcune fra le giocate più strabilianti che si siano mai viste da parte di un supporto. La sua incredibile sinergia con il resto dei CLG ha permesso alla squadra di conquistare lo Spring Split, arrivare secondi al Mid-Season Invitational e guadagnarsi un posto ai Mondiali. I fan lo hanno reclamato a gran voce come rappresentante del Nord America nella categoria Supporto con addirittura il 55,3% dei voti.\n</p>\naphromoo ha giocato un ruolo chiave nelle vittorie dei CLG ai Mondiali, ha tenuto alto il morale della squadra nei momenti difficili e li ha traghettati verso ogni trionfo. Purtroppo i CLG non sono stati in grado di trionfare contro gli Albus NoX Luna, che hanno colto l'intero gruppo di sorpresa e si sono assicurati la qualificazione ai quarti di finale. Di sicuro vedremo in azione le eccellenti qualità di leader di aphromoo anche durante questo All-Star. Ogni team vanta giocatori di talento, ma aphromoo può rappresentare il collante in grado di compattare il gioco di squadra del Nord America e dare alla sua formazione un vantaggio importante in questa competizione.\n\n","ro_RO":"Zaqueri ''aphromoo'' Black reprezintă tot ce și-ar putea dori o echipă de la un jucător de suport. Playmaker-ul care ia deciziile din Counter Logic Gaming este mereu la o lovitură de îndemânare distanță de unele dintre cele mai spectaculoase manevre pe care le poate face cineva în rolul de suport. Sinergia sa incredibilă cu restul celor din CLG a ajutat echipa să câștige etapa de primăvară, să termine Mid-Season Invitational pe locul al doilea și să obțină un loc la Mondiale. Fanii l-au votat în număr covârșitor ca reprezentant al NA în rolul de suport, dăruindu-i 55,3 la sută din voturi.\n</p>\naphromoo a jucat un rol esențial în victoriile CLG de la Mondiale, ridicând moralul echipei când aceasta rămânea în urmă și conducând-o spre victorie. Din păcate, CLG nu a reușit să treacă de Albus NoX Luna, care a surprins întreaga grupă și a câștigat un loc în sferturile de finală. Spiritul de lider al lui aphromoo se va face simțit cu siguranță și la All-Star 2016. Deși toate echipele au jucători talentați, aphromoo ar putea fi cel care că unească echipa din NA, s-o ajute că colaboreze și să-i ofere un avantaj în competiție.\n","es_MX":"<p>Zaqueri \"aphromoo\" Black es todo lo que un equipo podría pedir de un jugador de soporte. El líder estratega de Counter Logic Gaming siempre está a una habilidad de distancia de algunas de las jugadas más llamativas de soporte que jamás se hayan visto. Su increíble sinergia con el resto de los jugadores de CLG ayudó a que el equipo ganara el torneo de primavera, acabara en segundo puesto en el Mid-Season Invitational y se reservara un lugar en el Mundial. Una avalancha de votos de los fans ha servido para elegirlo con un apabullante 55,3 % para representar a los soportes norteamericanos.</p>\n\n<p>aphromoo jugó un papel clave en las victorias de CLG durante el Mundial, ya que mantuvo a su equipo motivado siempre que flaqueaban y los condujo hasta la victoria. Por desgracia, CLG no fue capaz de superar a Albus NoX Luna, que sorprendió a todo su grupo y se ganó un puesto en los cuartos de final. Aun así, no cabe duda de que el liderazgo de aphromoo también se pondrá de manifiesto en el All-Star Event 2016. Aunque todos los equipos tienen jugadores excepcionales, aphromoo puede ser el pegamento que solidifique el trabajo en equipo de NA y haga destacar al grupo por encima del resto.</p>"},"foreignIds":{"drupalId":"33","TRLH1":"200000185","TRLH2":"200000089"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":327,"slug":"huni","name":"Huni","firstName":"Seung-hoon","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huni-3vra4c68.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-07-06T14:21:58.000Z","bios":{"en_US":"<p>\nSeung-hoon “Huni” Heo proved himself a dominant force in the NA LCS. He's heading to the LCK with some hard earned wisdom under his belt and a drive to prove he can compete with the best. He may look happy and harmless, but don’t underestimate him. Give him an inch, and he’ll take a quadrakill on Riven.\n</p>\n<p>\nHuni is one of the most confident players you'll find, but it’s hidden underneath a jolly layer. While his previous goal was to defeat the three-time World Champs, he's decided that if you can't beat them, join them.\n</p>","fr_FR":"Seung-hoon « Huni » Heo a prouvé être une force dominante des LCS NA. Cette saison, il est arrivé dans la LCK avec des connaissances durement acquises et la volonté de démontrer qu'il est à la hauteur des meilleurs. Il a l'air heureux et inoffensif, mais ne le sous-estimez pas. Cédez ne serait-ce que d'un pouce et il signera un quadruplé sur Riven.\n\nHuni est l'un des joueurs les plus confiants qui soient, mais il le cache bien sous son air jovial. Son objectif précédent était de vaincre les triples champions du monde, mais il s'est finalement dit, qu'à défaut de les battre, autant les rejoindre. Le Mid-Season Invitational 2017 est sa première opportunité de remporter un événement international avec sa nouvelle équipe et, s'il y parvient, ça risque d'être le début d'une longue série.\n","pl_PL":"<p>\"Huni\" jest nowością, która zaskoczyła całą społeczność League of Legends w sezonie piątym. Zaistniał na scenie dopiero po dołączeniu do dobrze wszystkim znanego zespołu Fnatic w styczniu 2015 roku. Jego wybór był szczęśliwym trafem dla europejskiej drużyny, gdyż wcześniej był tylko partnerem sparingowym dla profesjonalnych zawodników w koreańskiej organizacji Samsung. Czarno-żółci wiele zaryzykowali przyjmując debiutanta do podstawowego składu, lecz wkrótce okazało się to strzałem w dziesiątkę. Heo Seung-hoon, swoim agresywnym stylem gry, podniósł poprzeczkę pozostałym top-lanerom w Europie. W wiosennym sezonie członkowie Fnatic wciąż się poznawali, ale i tak konkurowali o czołową pozycję w EU LCS. Ostatecznie uplasowali się na drugim miejscu, tracąc tylko dwa zwycięstwa do przodującego SK Gaming. Jednak w rozgrywkach barażowych pokazali, że to właśnie oni zasługują na szczyt podium – pokonując wszystkich przeciwników na swojej drodze. \"Huni\" wśród innych graczy wyróżnił się w tak dużym stopniu, że został nagrodzony laurem najbardziej wartościowego zawodnika. Osiągnięcia poprawił w kolejnym sezonie, ponieważ w lecie pobił światowy rekord w regularnych rozgrywkach. Przez cały ten okres nie przegrał ani jednego meczu - takiego wyczynu nawet nie da się porównywać, ponieważ jest absolutnie unikalny.</p>\n<p> \nKiedy \"Huni\" dostał się do Mistrzostw Świata 2015 był już powszechnie znany i niesłychanie popularny. Jego występ na tej imprezie tylko przysporzył mu sławy, gdyż nie zawiódł swoich fanów i wyszedł z grupy na pierwszym miejscu. Zwycięstwem z potężnym zespołem EDG w ćwierćfinale przełamał wraz z Fnatic długą passę azjatyckich drużyn. Uległ dopiero w półfinale walcząc z KOO Tigers, koreańską potęgą, jednak te osiągnięcia dla europejskich kibiców były w pełni satysfakcjonujące. Po tym wydarzeniu w wywiadzie dla Redbulla powiedział: „Po Mistrzostwach byłem trochę skołowany, bo nie wiedziałem co dalej robić. Jednocześnie chciałem zdobyć nowe doświadczenie w Ameryce.” Tak \"Huni\" tłumaczył odejście z szeregów Fnatic w listopadzie 2015 roku i dołączenie miesiąc później do nowopowstałej wtedy organizacji Immortals. Później jeszcze wspomniał, że chciałby do kolekcji swoich osiągnięć dodać pierwsze miejsce w NA LCS.</p>\n<p>\n\"Huni\" to zdecydowanie najbardziej przebojowy gracz sezonu 5. Z zupełnie nieznanego nabytku Fnatic w ciągu mniej niż roku stał się jednym z najpopularniejszych zawodników. To zasługa jego rozśmieszającego stylu bycia i braku oporu przed wygłupianiem się na oczach tysięcy widzów. W przeciwieństwie do czasu wolnego, w trakcie meczy Heo Seung-hoon to śmiertelnie poważny przeciwnik. Zasłynął z wyborów agresywnych bohaterów na top-lanie i przez to bycia trzecim carry w zespole. Postaciami, takimi jak Ekko, Riven czy Rumble, wielokrotnie dominował przeciwników i zapierał dech w piersiach wszystkich widzów.\n</p>","de_DE":"Seung-hoon „Huni“ Heo mauserte sich zu einer dominanten Macht in der NA LCS. In dieser Saison wechselte er mit jeder Menge Erfahrung in die LCK, um allen zu beweisen, dass er mit den Besten der Welt mithalten kann. Er mag glücklich und harmlos aussehen, aber man darf ihn nie unterschätzen. Wenn man ihm mit Riven zu viel Platz lässt, ist er immer für eine Vierfachtötung gut.\n\nUnter seiner fröhlichen Fassade ist Huni einer der selbstbewusstesten Spieler, die es gibt. Früher wollte er den dreimaligen Weltmeister unbedingt besiegen, doch dann dachte er sich: „Wenn ich sie nicht besiegen kann, dann schließe ich mich ihnen eben an.“ Das Mid-Season Invitational 2017 ist seine erste Chance, mit seiner neuen Mannschaft einen internationalen Titel zu gewinnen, und wenn es nach ihm geht, wird das der erste von vielen.\n","es_ES":"Seung-hoon \"Huni\" Heo ha demostrado ser una fuerza dominante en la LCS NA. Esta temporada se ha trasladado a la LCK con toda la sabiduría que ha cosechado hasta ahora y viene decidido a demostrar que es capaz de competir contra los mejores. Que no os engañe su cara alegre de no haber matado ni a una mosca. Le basta un pequeño descuido para conseguir un asesinato cuádruple con Riven.\n\nHuni es uno de los jugadores más seguros de sí mismos, pero lo esconde bajo una capa de jovialidad. Aunque su meta anterior era vencer a los tres veces campeones del mundo, ha aplicado la lógica: si no puedes vencerlos, únete a ellos. El Mid-Season Invitational 2017 es su primera oportunidad para ganar un evento internacional con su nuevo equipo. Si se sale con la suya, este será el primer título de muchos.\n","pt_BR":"<p>Seung-hoon \"Huni\" Heo se provou ser uma força dominante na LCS NA. Ele vai para a LCK nesta temporada com uma nova lição arduamente aprendida e a vontade de provar que pode competir com os melhores. Ele pode parecer feliz e inofensivo, mas não o subestimem. Deem uma chance e ele conseguirá um quadrakill em Riven.</p>\n\n<p>Huni é um dos jogadores mais confiantes que você encontrará, mas esconde isso sob uma camada de alegria. Seu objetivo anterior era derrotar os tricampeões mundiais, mas ele decidiu que se você não pode vencê-los, é melhor juntar-se a eles. O Mid-Season Invitational 2017 é sua primeira chance de ganhar um evento internacional com sua nova equipe. E, se a sua vontade se concretizar, será o primeiro de muitos.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “Huni” 허승훈은 탑 라인에서 지배적인 존재입니다. 유럽 LCS에 비교적 최근에 합류한 Huni는 2015년 Fnatic 리빌딩 프로젝트의 일환으로 팀에 입단했습니다. 그의 영향은 즉시 나타났습니다. 2015 유럽 LCS 서머 스플릿에서 Fnatic을 18승 무패 기록으로 이끌었기 때문이죠. Huni는 2015 유럽 LCS 서머 스플릿에서 Outstanding Rookie 상을 수상하기도 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">소환사의 협곡 바깥에서도 Huni의 영향력이 나타났죠. 그가 만든 감탄사 “HoloHoloHolo\"는 누구라도 빠져들 수밖에 없고, 그의 장난스러운 마이크 체킹은 전설적입니다. Huni는 겉으로는 귀여워 보일지 모르지만 게임에서는 적을 깨부수는 데 거리낌이 없죠. Huni는 그의 자신감을 한줄로 이렇게 요약했습니다. \"저희에게 대적할 라이벌은 없습니다.\" 궁금해 하실까봐 말씀드리지만 저 말은 국제 경기까지 포함시킨 겁니다. 그리고 그는 이렇게 말했죠. \"SKT와 다시 한번 싸워서 박살내고 싶어요.\" </p>\n<p style=”font-family:”나눔고딕”;\">정말 대담한 친구죠. 2015 올스타전에서 과연 그가 라이벌들을 박살낼 수 있을지 지켜봅시다. </p>\n"},"foreignIds":{"drupalId":"3675","ESPORTSTMNT06":"200000354","TRLH1":"200000408","TRLH2":"200000308","TRLT3":"200000206"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":9},{"id":403,"slug":"bang","name":"Bang","firstName":"Junsik","lastName":"Bae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bang-5ln60860.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:04.000Z","bios":{"en_US":"<p>\nJunsik \"Bang\" Bae is an incredibly dedicated AD carry. Bang committed himself to a rigorous play schedule, and has the results to prove it -- he was the first Korean player to reach 1400 Challenger points in Solo Queue. But he isn’t just getting good at Solo Queue. When SKT T1 S secured 3rd place in the 2014 Summer OGN Champions League, Bang had officially arrived on the Korean esports scene. He went on to take 1st place at the 2015 World Championship with SKT, etching his name in LoL history.\n</p>\n<p>\nHe didn’t stop there, though, and like the rest of SK telecom, he struggled through the initial growing pains of roster changes in 2016 before winning the 2016 World Championship. The team adjusted quickly to its new roster this year, dominating the LCK Spring Split and taking victory at the 2017 Mid-Season Invitational in Brazil.\n</p>","fr_FR":"Junsik « Bang » Bae est un carry AD extrêmement impliqué. Bang s'est astreint de lui-même à un programme de jeu très strict, et ses résultats sont là pour lui donner raison : il a été le premier joueur coréen à atteindre les 1400 points en Challenger en file solo. Mais il ne se contente pas de briller en file solo. Quand SKT T1 S à décroché la troisième place dans la Ligue OGN Champions Summer 2014, Bang venait d'arriver officiellement sur la scène de l'e-sport coréen. Il a enchaîné avec une première place lors du Championnat du monde 2015 avec SKT, gravant pour toujours son nom dans l'histoire de LoL.\n\nIl ne s'est pourtant pas arrêté là, et comme le reste de SK Telecom, il a souffert des changements de formation en 2016 avant de remporter le Championnat du monde 2016. Cette année, l'équipe s'est rapidement adaptée à sa nouvelle formation, dominant sans mal le segment de printemps de la LCK. Ils vont maintenant tenter d'enregistrer leur premier victoire internationale de 2017 lors du Mid-Season Invitational au Brésil.\n","pl_PL":"Junsik „Bang” Bae jest niesamowicie zaciętym prowadzącym. Bang narzucił sobie bardzo rygorystyczny harmonogram rozgrywek, czego rezultaty są widoczne — był pierwszym koreańskim zawodnikiem, który osiągnął 1400 punktów Pretendenta w kolejce solo. Ale staje się coraz lepszy nie tylko w kolejce solo. Gdy SKT T1 S zdobyli trzecie miejsce w Summer OGN Champions League 2014, Bang oficjalnie pojawił się na koreańskiej scenie e-sportowej. Zdobył wraz z SKT pierwsze miejsce na Mistrzostwach Świata 2015, zapisując swoje imię w historii LoL.\n\nJednak nie zamierzał na tym poprzestać, dlatego podobnie jak reszta SK Telecom musiał przebrnąć przez trudne zmiany w składzie w 2016 roku, zanim drużyna zwyciężyła na Mistrzostwach Świata 2016. Drużyna szybko dostosowała się do tegorocznego, nowego składu, dominując podczas wiosennego splitu LCK. Teraz będzie chciała zdobyć swoje pierwsze międzynarodowe zwycięstwo w 2017 roku na Mid-Season Invitational w Brazylii.\n","de_DE":"Junsik „Bang“ Bae ist ein unglaublich engagierter AD-Carry. Bang unterwarf sich einem sehr strikten Spielplan und hat als Folge dessen auch Resultate vorzuweisen – er war der erste koreanische Spieler, der jemals 1400 Challenger-Punkte in der Einzelwarteschlange erreicht hat. Aber natürlich ist er nicht nur als Einzelspieler überragend. Als SKT T1 sich den dritten Platz beim OGN Champions im Sommer 2014 sicherten, war Bangs Debut in der Esports-Szene offiziell. Kurz danach gewann er zusammen mit seinem Team SKT die Weltmeisterschaft 2015 und verewigte seinen Namen in der Geschichte von LoL.\n\nAber damit war noch lange nicht Schluss, und genau wie der Rest von SK Telecom hatte er zu Beginn des Jahres 2016 Probleme mit den Änderungen der Aufstellung, bevor er schließlich die Weltmeisterschaft 2016 gewann. In diesem Jahr konnte sich die Mannschaft schnell auf die neue Aufstellung einstellen und den Frühjahrs-Split der LCK dominieren. Jetzt werden sie beim Mid-Season Invitational in Brasilien versuchen, sich den ersten internationalen Titel im Jahr 2017 zu sichern.\n","es_ES":"Junsik ''Bang'' Bae es un AD carry con una dedicación admirable. Su riguroso programa de entrenamiento ha demostrado su eficacia: es el primer jugador coreano en alcanzar los 1400 puntos en la cola en solitario. Y eso no es lo único que se le da bien. Cuando SKT T1 consiguió el tercer puesto en la OGN Champions League de verano de 2014, Bang ya había llegado al panorama coreano de los esports. Junto al resto de miembros de su equipo, contribuyó al triunfo de SKT en el Campeonato Mundial 2015 y su nombre pasó a la historia de League.\n\nLejos de quedarse ahí, luchó junto a SK telecom para superar el mal trago inicial de 2016 causado por el ajuste de plantilla, justo antes de ganar el Campeonato Mundial de 2016. El equipo se ha adaptado rápidamente a su plantilla este año y ha dominado el split de primavera de la LCK. Ahora intentará conseguir su primera victoria internacional de 2017 en el Mid-Season Invitational en Brasil.\n","pt_BR":"<p>Junsik \"Bang\" Bae é um carregadorregador incrivelmente dedicado. Bang se comprometeu a um treinamento rigoroso e tem os resultados para provar: foi o primeiro jogador coreano a alcançar 1400 pontos no nível Desafiante na fila solo. Mas ele não é bom só na fila solo. Quando a SKT T1 conseguiu o 3º lugar na Summer OGN Champions League 2014, Bang fez sua entrada oficial para o cenário coreano de e-Sports. Ele então continuou sua jornada e alcançou o 1º lugar no Campeonato Mundial 2015 com a SKT, gravando seu nome na história do League of Legends.</p>\n\n<p>Mas ele não parou por aí e, assim como o resto da SK Telecom, ele teve dificuldades em se adaptar às mudanças constantes de escalação antes de vencer o Campeonato Mundial 2016. A equipe se ajustou rapidamente à sua nova composição neste ano, dominando a Etapa de Primavera da LCK. Agora eles querem que sua primeira vitória internacional de 2017 seja no Mid-Season Invitational no Brasil.\n</p>","es_AR":"<p>Jun-sik \"Bang\" Bae es un ADC totalmente aplicado. Bang se comprometió a cumplir un riguroso programa de juego, y los resultados lo demuestran. Fue el primer jugador coreano en alcanzar 1400 puntos de Challenger en la cola individual. Pero no es solo en la cola individual donde está mejorando. Cuando SKT T1 S se aseguró el tercer lugar en la OGN Champions League de verano del 2014, Bang quedó oficialmente instalado en la escena de esports coreana. Llegó al primer lugar en el Campeonato Mundial 2015 con SKT, y grabó su nombre en la historia de LoL.</p>\n\n<p>Pero no se detuvo allí y, como el resto de los miembros de SKTelecom, pasó por los insoportables cambios de plantel en el 2016. Después de recibir otro título de LCK en el torneo de apertura del 2016, Bang y SKTelecom fueron derrotados durante el comienzo del torneo de clausura, lo que dejó boquiabiertos a los simpatizantes de todo el mundo. Bang tomará la pérdida como combustible para su fuego competitivo y sabe que solo hace falta una pequeña chispa para hacer que SKTelecom vuelva a tener el dominio del Campeonato Mundial 2016.</p>"},"foreignIds":{"drupalId":"881","ESPORTSTMNT06":"200000358","TRLH1":"200000411","TRLH2":"200000311","TRLT3":"200000209"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":404,"slug":"wolf","name":"Wolf","firstName":"Jaewan","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolf-82h5ft4p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:22.000Z","bios":{"en_US":"<p>Jaewan \"Wolf\" Lee is a dedicated communicator and practices constantly with his duo partner Bang. Their bond in the bot lane has proven itself, as Wolf achieved one of the highest KDAs in the 2015 LCK Summer Split. His chemistry with Bang led SK Telecom to become world champions in 2015 after they rampaged through the entire tournament nearly unbeaten.</p>\n\n<p>In 2016, the chemistry seemed to have waned as Bang and Wolf struggled along with the entirety of SKT, but after MSI their trademark chemistry was back with a vengeance. Even though SKT came up short in the Summer Split playoffs, Wolf and Bang showed up huge at the 2016 World Championship and again at the 2017 Mid-Season Invitational. Next up? Worlds.</p>","fr_FR":"Jaewan « Wolf » Lee est un excellent communiquant qui s'entraîne constamment avec son partenaire Bang. Leur lien sur la voie du bas a fait ses preuves : Wolf a enregistré l'un des plus hauts KDA du segment d'été des LCK 2015. L'alchimie entre Bang et lui a permis à SK Telecom de devenir championne du monde en 2015 après avoir fait des ravages durant tout le tournoi, presque sans subir la moindre défaite.\n\nEn 2016, cette synergie semble s'être dégradée : Bang et Wolf ont eu un peu de mal, comme l'ensemble de leur équipe, mais après le tournoi MSI, leur alchimie légendaire était de retour en beauté. Bien que SKT ait manqué de peu les play-offs du segment d'été, Wolf et Bang ont fait des étincelles au Championnat du monde 2016. À présent, ils se préparent à participer au Mid-Season Invitational 2017 et convoitent leur deuxième titre du MSI.\n","pl_PL":"Jaewan „Wolf” Lee ma świetne umiejętności komunikacyjne i nieustannie ćwiczy ze swoim partnerem z duetu, Bangiem. Ich zgrania na dolnej alei dowodzi fakt, że Wolf zdobył jeden z najwyższych wyników Z/Z/A podczas letniego splitu LCK 2015. Świetna chemia między nim a Bangiem doprowadziła SK Telecom do zdobycia mistrzostwa świata w 2015 roku, po przebiciu się przez cały turniej niemal bez porażki.\n\nW 2016 roku ta chemia jakby uleciała, gdy Bang i Wolf borykali się z problemami, które dotknęły całego SKT, ale po MSI ich charakterystyczne zgranie się powróciło jeszcze bardziej wzmocnione. Chociaż SKT odpadli w fazie pucharowej letniego splitu, Wolf i Bang pokazali się ze świetnej strony na Mistrzostwach Świata 2016. Teraz zmierzają na Mid-Season Invitational 2017, mając oko na drugi tytuł na MSI.\n","de_DE":"Jaewan „Wolf“ Lee ist ein engagierter Kommunikator und ständig damit beschäftigt, sich mit seinem Duo-Partner Bang zu verbessern. Ihre Verbindung ist stark und ihr Erfolg auf der unteren Lane spiegelt sich deutlich in Wolfs TTUs im Sommer-Split der LCK 2015 wider. Seine gute Harmonie mit Bang führte SK Telecom zum Sieg bei der Weltmeisterschaft 2015, nachdem sie im ganzen Turnier nahezu ungeschlagen geblieben waren.\n\n2016 war es mit der Harmonie plötzlich vorbei, als Bang und Wolf, genau wie der Rest der Mannschaft, große Probleme hatten. Aber nach dem MSI war ihre Harmonie wieder zurück. Obwohl SKT in den Entscheidungsspielen des Sommer-Splits scheiterte, konnten Wolf und Bang der Weltmeisterschaft 2016 ihren Stempel aufdrücken. Jetzt sind sie zum Mid-Season Invitational 2017 unterwegs, wo sie ihren zweiten MSI-Titel gewinnen wollen.\n","es_ES":"Jaewan ''Wolf'' destaca por lo bien que se comunica, y practica constantemente con su compañero de la calle inferior, Bang. Este dúo ya ha demostrado su valía, ya que Wolf consiguió uno de los marcadores A/M/A más altos del split de verano de la LCK 2015. Su química con Bang contribuyó en gran medida a que SK telecom se proclamase campeón del mundo en 2015, pues en su paso por el campeonato casi terminan invictos.\n\nEn 2016, su química comenzó a decaer cuando Bang y Wolf experimentaron los mismos problemas que el resto del equipo, pero con la victoria en el MSI todo volvió a la normalidad. Aunque SKT no dio la talla en los playoffs del split de verano, Wolf y Bang se mostraron como un potente dúo en el Campeonato Mundial de 2016. Ahora se dirigen al Mid-Season Invitational 2017 con esperanzas de obtener su segundo título del MSI.\n","pt_BR":"<p>Jaewan \"Wolf” Lee é um comunicador dedicado e pratica constantemente com seu parceiro de rota, Bang. Sua sintonia na rota inferior já provou o que tinha que provar quando Wolf alcançou um dos AMAs mais altos da Etapa de Verão da LCK 2015. Sua química com Bang levou a SK Telecom a se tornar a campeã mundial em 2015 depois de destruírem no torneio, saindo praticamente invictos.</p>\n\n<p>Em 2016, essa química parecia ter sumido quando Bang e Wolf passaram por muitas dificuldades, juntamente com toda a SKT. Mas, depois do MSI, sua tão famosa sintonia voltou com tudo. Mesmo a SKT tendo decepcionado nas eliminatórias da Etapa de Verão, Wolf e Bang impressionaram no Campeonato Mundial 2016. Agora, eles vão para o Mid-Season Invitational 2017 de olho no seu segundo título MSI.\n</p>","es_AR":"<p>Jae-wan \"Wolf\" se destaca por su dedicación a las comunicaciones y practica constantemente con su dupla Bang. Su vínculo en el carril inferior se ha mostrado fuerte, y Wolf logró uno de los más altos KDA en el torneo de clausura de la LCK 2015. Su química con Bang hizo que SKTelecom se convirtiera en campeón mundial en el 2015 luego de arrasar durante todo el torneo sin derrotas.</p>\n\n<p>En el 2016, la química pareció menguar un poco, ya que Bang y Wolf pasaron una mala racha junto a SKTelecom, pero luego de la MSI, su complementación volvió a ser la misma y estuvo cargada de venganza. Aunque SKTelecom quedó afuera rápido de las eliminatorias del torneo de clausura, Wolf y Bang siguen siendo una impresionante dupla de carrileros inferiores. Está por llegar al Mundial como uno de los soportes más temibles del planeta. Si alguien quiere meterse con Bang, tendrá que pasar por una pesadilla al cruzarse con Wolf.</p>"},"foreignIds":{"drupalId":"882","ESPORTSTMNT06":"200000435","TRLH1":"200000412","TRLH2":"200000312","TRLT3":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":489,"slug":"huhi","name":"Huhi","firstName":"Jaehyun","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huhi-3lhy1i2q.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-20T14:49:06.000Z","updatedAt":"2017-05-24T20:54:10.000Z","bios":{"en_US":"<p>Jaehyun “Huhi” Choi joined Counter Logic Gaming prior to the 2015 NA LCS Summer Split to help shore up their options in the mid lane. Huhi’s experience in Korea and the NA Challenger Series brought a new perspective to CLG, despite the fact that he never donned the CLG uniform for an LCS match in his first year with the team. After a year on the sidelines, Huhi has stepped up to serve as CLG’s mid laner, helping the team take their second NA LCS championship and 2nd place finish at MSI.</p>\n\n<p>Huhi was often considered the weakest link of the team, but when CLG is running at their best, he’s more than able to step up to the plate. He excels when controlling the mid lane on mages like Aurelion Sol, Azir, and Cassiopeia. He showed flashes of brilliance last year, especially while forging galaxies as everyone’s favorite cosmic dragon. His performance at the 2016 World Championship left a lot to be desired, but Huhi turned things around in the spring. It will be up to Huhi to build on his experience and start making good on his potential. All it takes is one spark to light a flame.</p>","fr_FR":"<p>Jae-Hyun « HuHi » Choi a rejoint Counter Logic Gaming avant le segment d'été des LCS NA 2015 pour \n\nétendre l'éventail des options disponibles sur la voie du milieu. L'expérience de HuHi en Corée et dans \n\nles Challenger Series NA a offert de nouvelles perspectives à CLG, bien qu'il n'ait jamais revêtu \n\nl'uniforme de CLG pour un match des LCS au cours de sa première année avec l'équipe. HuHi a par \n\ncontre participé à de nombreux matchs d'entraînement. C'est dans les coulisses qu'il a aidé CLG à \n\naméliorer son jeu et ses performances.</p>\n\n<p>Après un an sur le banc de touche, HuHi est entré dans l'arène des LCS NA en tant que mid laner titulaire \n\nde CLG. Son entraînement et ses analyses ont sans doute été une aubaine pour CLG pendant la saison \n\nrégulière, mais jouer effectivement sur la scène des LCS NA est une tout autre histoire. HuHi devra \n\npuiser dans toute son expérience pour rendre à CLG tout son lustre.</p>","es_ES":"<p>Jae-hyun \"HuHi\" Choi se unió a Counter Logic Gaming antes del split de verano de la LCS NA 2015 para ayudar al equipo con más opciones en la calle central. La experiencia de HuHi en Corea y en la Challenger Series NA dotaron a CLG de una nueva perspectiva, a pesar de que el jugador no participó en un solo enfrentamiento de la LCS durante su primer año en el equipo. En cambio, el impacto de HuHi se reflejó a través de los ensayos y las prácticas con el equipo. Contribuyó en gran medida a pulir y mejorar el estilo de juego de CLG.</p>\n\n<p>Después de ese año, HuHi entró en la LCS norteamericana como el mid titular de CLG. Sus análisis de los entrenamientos fueron de gran valor para CLG durante la temporada regular, pero él sabía que podía hacer más por ellos. Sus gestas en la calle central ayudaron a asegurar de nuevo el primer puesto para CLG, con una victoria por 3 a 2 contra TSM en los playoffs de primavera de 2016, y un segundo puesto en el MSI 2016.</p>","pl_PL":"<p>Swoją przygodę z profesjonalną sceną League of Legends zaczął od najwyższego szczebla – ligi Koreańskiej. \"Huhi\"  brał udział w HOT6iX Champions Summer 2014, lecz niestety bez sukcesów. Po tym wydarzeniu jego zespół, Bigfile Miracle, został rozwiązany. Poszukiwanie drużyny ostatecznie zaprowadziło go do Ameryki, gdzie każdy przysłowiowy pucybut może zostać milionerem. Olbrzymią trudnością okazała się dla niego bariera językowa, gdyż umiał mówić tylko po francusku i koreańsku, jednak każdego kolejnego dnia od przyjazdu do Ameryki widać efekty jego ciężkiej pracy. W październiku 2014 roku dołączył do świeżo założonego Team Fusion. W wywiadzie dla Cloth5 padło pytanie czy czuje presję w związku ze swoją anonimowością na scenie CLG. Najwyraźniej odporny na negatywne opinie innych  odpowiedział, że przejmuje się tylko kiedy zdarzy mu się słabo zagrać. Spytany o różnice w jego mniemaniu między amerykańską, a koreańską ligą, odparł krótko: „Solo que w Ameryce jest dużo bardziej ekscytujące”. Wraz z Team Fusion \"Huhi\" wziął udział w wiosennym i letnim sezonie Challenger Series 2014, w obu przypadkach bez triumfu. Za pierwszym razem na drodze stanął im Team Coast, a w pół roku później udało im się wejść do rozgrywek promocyjnych, ale nie podołali Team Dignitas. Po rozwiązaniu Team Fusion w maju 2015 roku, od razu został przygarnięty pod opiekuńcze skrzydła Counter Logic Gaming. </p>\n<p>\nNarodowość Jae-hyuna  budzi spore kontrowersje - urodził się we Francji, lecz nie dostał obywatelstwa tego kraju, a na dodatek posiada koreańskie korzenie. Jego największym osiągnięciem jest drugie miejsce na 3 edycji IEM 10 sezonu w San Jose i wejście do Kręgu Pretendenta – zarówno w Korei jak i w Ameryce. Patrząc na historię jego meczy można odnieść wrażenie, że lubi grać praktycznie każdą postacią. \"Huhi\" nie pozostawia najmniejszych wątpliwości, co do nabytych wszechstronnych umiejętności. Jednak sam wypowiedział się na temat swoich preferencji krótko, jako ulubionych bohaterów wskazując Zeda i Yasuo. Aczkolwiek trzeba pamiętać, że as w rękawie Jae-hyuna to nieprzewidywalność – jest zdolny do zagrania nawet Kindredem na mid-lanie podczas poważnych turniejów.\n</p>","de_DE":"Jae-hyun „HuHi“ Choi ist Counter Logic Gaming vor dem Sommer-Split der NA LCS 2015 beigetreten, um ihre Möglichkeiten in der mittleren Lane zu verbessern. HuHis Erfahrung in Korea und in der Challenger Series der NA brachte CLG neue Perspektiven, obwohl er in seinem ersten Jahr im Team seine CLG-Uniform nie für ein LCS-Match anzog. Nach einem Jahr auf der Ersatzbank trat HuHi vor, um als CLGs Mid-Laner zu spielen und der Mannschaft beim Erreichen des ersten Platzes in der NA LCS sowie des zweiten Platzes beim MSI zu helfen.\n\nHuHi galt häufig als das schwächste Mitglied der Mannschaft, aber wenn CLG zur Höchstform aufläuft, steht er den anderen um nichts nach. Er ist überragend, wenn er die mittlere Lane mit Magiern wie Aurelion Sol, Azir und Cassiopeia kontrolliert. Im letzten Jahr ließ er sein Können immer wieder aufblitzen, wenn er mit dem kosmischen Drachen neue Galaxien schmiedete. Seine Vorstellung bei der Weltmeisterschaft 2016 ließ zwar zu wünschen übrig, aber in diesem Frühjahr hat HuHi die Chance, Wiedergutmachung zu leisten. Es liegt an HuHi, seine Erfahrung zu nutzen und endlich sein volles Potenzial abzurufen. Schließlich braucht es nur einen Funken, um eine Flamme zu entzünden.\n","pt_BR":"<p>Jae-hyun “HuHi” Choi entrou para a Counter Logic Gaming antes da Etapa de Verão da LCS NA 2015 para ampliar as opções na rota do meio. A experiência de HuHi na Coreia e no Circuito Desafiante da NA trouxe uma nova perspectiva para a CLG, apesar do fato de ele nunca ter usado o uniforme da CLG em uma partida da LCS no seu primeiro ano na equipe. Em vez disso, o impacto de HuHi foi sentido nos amistosos e nos treinos. Ele trabalhou nos bastidores para melhorar o estilo de jogo e o desempenho da CLG.</p>\n\n<p>Agora, depois de um ano nas laterais, HuHi entra na arena da LCS NA como meio titular da CLG. Embora suas análises de treinos e amistosos tenham sido uma vantagem para a CLG na temporada regular, HuHi sabia que ele tinha mais para oferecer. Suas façanhas na rota do meio asseguraram um primeiro lugar para a CLG, que venceu a TSM por 3 a 2 nas Eliminatórias de Primavera e um segundo lugar no MSI 2016.\n </p>","es_AR":"<p>Jae-hyun “HuHi” Choi se unió a Counter Logic Gaming antes del torneo de clausura LCS NA 2015 para ayudar sus posibilidades en el carril central. La experiencia de HuHi en Corea y el Challenger Series NA trajo una nueva perspectiva a CLG, a pesar del hecho de que nunca usó el uniforme de CLG para un combate LCS en su primer año con el equipo. En vez de eso, la influencia de HuHi se sintió en las prácticas y rutinas. Trabajó detrás del escenario para mejorar el estilo y desempeño de CLG.</p>\n\n<p>Ahora, después de estar en la banca un año, HuHi entra a la arena LCS NA como un carrilero central inicial. Aunque su análisis de las prácticas y rutinas haya sido una gran ventaja para CLG en la temporada regular, HuHi sabía que tenía más por ofrecer. Sus logros en el carril central aseguraron nuevamente el primer lugar para CLG, triunfando 3-2 sobre TSM en las eliminatorias de primavera en el 2016, y un segundo lugar en el torneo por invitación de mitad de temporada.</p>"},"foreignIds":{"drupalId":"2793","TRLH1":"200000183","TRLH2":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":618,"slug":"stixxay","name":"Stixxay","firstName":"Trevor","lastName":"Hayes","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stixxay-a699c7o2.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-19T21:40:56.000Z","bios":{"en_US":"<p>Trevor \"Stixxay\" Hayes served Counter Logic Gaming as a sub for almost a year before working his way up the ranks to start at the ADC position. His debut as a starting player at IEM San Jose in November of 2015 was remarkably solid, and marked the beginning of his professional career. He hit the ground running in the 2016 NA LCS Spring Split with a 4.2 KDA and respectable 70% kill participation. Stixxay wasn’t content with being a “serviceable” ADC, however, and he stepped up to a new level at the 2016 Mid-Season Invitational in Shanghai, pulling in compliments and notice from the world’s elite.</p>\n\n<p>Stixxay quickly became famous for his ability to completely take over a game and single-handedly will CLG to wins. He earned comparisons to North American greats like Doublelift practically overnight. While his consistency is still an issue, Stixxay is undeniably talented and has the chance to become one of the most-feared AD Carries in all of North America. He has proven that he can slug with the heavyweights, but this year Stixxay will be going for knockouts.</p>","fr_FR":"<p>Trevor « Stixxay » Hayes a été remplaçant pour Counter Logic Gaming pendant pratiquement un an \n\navant de devenir titulaire au poste de carry AD. Lors de ses débuts aux IEM San Jose en novembre 2015, \n\nil s'est montré remarquablement solide. Il a joué dès le début sans se montrer inquiet, complétant bien \n\nAphromoo et obtenant un KDA respectable de 4,1 même dans la défaite. CLG a fini par s'incliner face à \n\nOrigen en finale, mais les performances de Stixxay ont été une lueur d'espoir pour l'avenir de CLG aux \n\nLCS NA. Nous n'en sommes pas encore à avaliser le #FaithAge, mais c'est un point de départ.</p>","pl_PL":"<p>Ten młody AD carry nie posiada dużego doświadczenia na profesjonalnej scenie, ale i tak zaskakuje wszystkich umiejętnościami. Counter Logic Gaming to czwarta poważna drużyna w życiu Trevora. Pierwszą była Denial eSports, do której dołączył w sierpniu 2014 roku. Jednak po uczestnictwie w drugiej edycji 2014 NA Challenger Series, zdecydował się poszukać szczęścia gdzie indziej. Kolejnym zespołem był Cloud9 Tempest, gdzie na miesiąc wcielił się rolę supporta. Jednak po tym czasie został zrekrutowany do CLG Black. Tam miał okazję nabrać wprawy i zabłysnąć w Challenger Series. \"Stixxay\", pomimo wysokiego poziomu gry, nie zakwalifikował się wtedy ze swoją drużyną do NA LCS. Natomiast jego niebywała wartość jako gracza sprawiła, że w czerwcu 2015 roku został zaproszony do głównego składu Counter Logic Gaming jako AD Carry. </p>\n<p>\nPoprzednik Trevora podniósł mu poprzeczkę bardzo wysoko. Mowa oczywiście o Yiliangu \"Doublelift\" Pengu, jednym z najbardziej rozpoznawalnych graczy na świecie. Sławę można nabyć z czasem, więc organizacja Counter Logic Gaming patrzyła na Trevora tylko z perspektywy umiejętności na pozycji AD carrego. \"Stixxay\", pomimo różnic doświadczenia, pozytywnie wszystkich zaskoczył. Jego pierwszym znaczącym występem było trzecia edycja 10 sezonu IEM w San Jose. Udało mu się wejść w rolę Yilianga z zadziwiającą łatwością. CLG pokonało Unicorns of Love i Jin Air Green Wings, ulegając w finale zespołowi Origen. To zarazem największe, dotychczasowe osiągnięcie Trevora w karierze profesjonalnego gracza.</p>\n<p>\nPo tym sukcesie \"Stixxay\" wraz z Zaquerim \"Aphromoo\" Blackiem udzielił wywiadu dla theScore eSports. Na starcie zaznaczył, że bardzo cieszy się z drugiego miejsca, gdyż przed tym wydarzeniem miał czas na zaledwie tydzień treningu ze swoim nowym supportem. Zwrócił też uwagę na pewną korelację co do stylu swojego poprzednika, ale w odróżnieniu od niego potrafi także być wsparciem w drużynie, a nie tylko przodownikiem. Trevor zapytany o swoje umiejętności przed sezonem szóstym, odpowiadał niezwykle skromnie. Stwierdził, że nie wyróżnia się wśród innych graczy, jednak jest w stanie sprostać stawianym mu oczekiwaniom. To z kolei nie wpłynie na wyniki CLG, gdyż 90% meczu to gra drużynowa. Kocha Vayne, lecz przyznaje: „Lucian i Miss Fortune to najciekawsze wybory w szóstym sezonie.” </p>\n","es_AR":"<p>Trevor \"Stixxay\" Hayes sirvió a Counter Logic Gaming como substituto por un año antes de subir de rango hasta una posición titular ADC. Su debut como titular en el IEM de San José en noviembre del 2015 fue muy sólido. Jugó con confianza desde el principio, complementando a aphromoo y teniendo un respetable 4.1 de KDA durante el evento. Aunque CLG fue derrotado por Origen en las finales, el desempeño de Stixxay encendió un destello de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>La historia de Stixxay no había terminado. Empezó corriendo en el torneo de apertura de la LCS NA 2016 con un 4.2 de KDA y un respetable 70% de participación en asesinatos. Y bueno, a nadie se lo olvida esa quinta partida de Tristana en la que consiguió el primer lugar en las eliminatorias de primavera NA 2016. Parece que la #EraDeFe está aquí para quedarse.</p>","es_ES":"<p>Trevor \"Stixxay\" Hayes fue sustituto de Counter Logic Gaming durante casi un año antes de ser ascendido a AD Carry titular. Su debut como jugador titular en el IEM San Jose en noviembre de 2015 fue notablemente sólido. Jugó con confianza desde el primer momento, se combinó bien con Aphromoo y se hizo con un respetable marcador A/M/A de 4,1 durante el evento. A pesar de que CLG cayó ante Origen en la final, la actuación de Stixxay fue un rayo de esperanza para el futuro de CLG en la LCS NA.</p>\n\n<p>Y la historia de Stixxay no terminó ahí. Su paso por el split de primavera de la LCS NA 2016 dejó un marcador de 4,1 y una participación en asesinatos nada desdeñable de un 70 %. Además, su actuación con Tristana en la quinta partida, que selló el primer puesto de CLG en los playoffs de primavera de NA 2016, no caerá en el olvido. Parece que la famosa #FaithAge (época de la fe) no acabará todavía.</p>","de_DE":"Trevor „Stixxay“ Hayes hat Counter Logic Gaming für knapp ein Jahr als Ersatzspieler gedient, bevor er sich seinen festen Startplatz als AD-Carry erarbeitete. Sein Debüt als Stammspieler beim IEM San Jose im November 2015 war erstaunlich solide und markierte den Beginn seiner professionellen Karriere. Beim Frühjahrs-Split der NA LCS 2016 hatte er mit einer TTU-Wertung von 4,2 und einer respektablen Tötungsteilnahme von 70 % alles fest im Griff. Stixxay war jedoch nicht damit zufrieden, ein „brauchbarer“ AD-Carry zu sein, weshalb er beim Mid-Season Invitational 2016 in Shanghai noch einmal eins drauflegte und selbst von den besten Spielern der Welt gelobt wurde.\n<p>\nStixxay wurde schnell dafür bekannt, das Spiel komplett an sich reißen und CLG im Alleingang zum Sieg führen zu können. Über Nacht wurde er plötzlich mit den besten Spielern Nordamerikas verglichen. Stixxays Beständigkeit ist zwar immer noch ein Problem, aber er ist ein unglaubliches Talent und hat die Chance, zu einem der gefürchtetsten AD-Carrys in ganz Nordamerika zu werden. Er hat bewiesen, dass er sich mit den Schwergewichten der Szene messen kann und wird in diesem Jahr versuchen, sie in die Schranken zu weisen.\n","pt_BR":"<p>Trevor \"Stixxay\" Hayes foi reserva na Counter Logic Gaming por quase um ano antes de conseguir chegar à uma colocação que o deixaria ser o atirador titular. Sua estreia como jogador titular no IEM San Jose em novembro de 2015 foi muito contundente. Ele jogou com confiança desde o início, apoiando Aphromoo e acumulando um respeitável AMA de 4,1 durante o evento. Apesar da CLG ter caído diante da Origen nas finais, a atuação de Stixxay acendeu as esperanças no futuro da CLG na LCS NA.</p>\n\n<p>Mas a história de Stixxay ainda não tinha terminado. Ele caiu em pé na Etapa de Primavera 2016 da LCS NA com um AMA de 4,2 e uma respeitável participação em abates de 70%. Ah, e ninguém se esquecerá daquele 5º jogo com Tristana, que selou o primeiro lugar da CLG nas Eliminatórias de Primavera 2016 da NA. Parece que #FaithAge chegou para ficar.</p>"},"foreignIds":{"drupalId":"1317","TRLH1":"200000184","TRLH2":"200000088"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":715,"slug":"peanut","name":"Peanut","firstName":"Wangho","lastName":"Han","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/peanut-izmrqd1y.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:15:00.000Z","bios":{"en_US":"<p>\nWangho “Peanut” Han is the most aggressive jungler in Korea - bar none. He is a master of controlled mayhem who routinely takes over games single-handedly. After getting his professional start with the thoroughly underwhelming NaJin e-mFire, Peanut made his way to the ROX Tigers in 2016.\n</p>\n<p>\nPeanut melds chaos and calm in a way seldom seen on the Rift. One moment he’s systematically stealing the enemy’s jungle and the next he’s diving headfirst into a tower to clean up a double kill. It’s this unpredictability that sets Peanut apart from other elite level junglers. After losing a close battle to SK telecom T1 at the 2016 World Championship, Peanut joined the team that sent him packing. He earned his first international title with his new team at the 2017 Mid-Season Invitational; now, his sights are set on Worlds.\n</p>","de_DE":"Wangho „Peanut“ Han ist zweifellos der aggressivste Jungler in Korea. Er ist ein Meister des kontrollierten Chaos und kann Spiele alleine entscheiden. Nachdem seine Karriere bei den sehr enttäuschenden NaJin e-mFire begonnen hatte, wechselte Peanut im Jahr 2016 zu den ROX Tigers.\n\nPeanut vereint Chaos und Ruhe, wie man es in der Kluft nur selten sieht. In einem Moment grast er systematisch den gegnerischen Dschungel ab und im nächsten stürmt er kopfüber zu einem Turm, um eine Doppeltötung einzufahren. Es ist diese Unberechenbarkeit, die Peanut von den anderen Junglern auf diesem Niveau unterscheidet. Nachdem er sich bei der Weltmeisterschaft 2016 SK Telecom T1 knapp geschlagen geben musste, wechselte Peanut zu der Mannschaft, die ihn nach Hause geschickt hatte. Jetzt wird er beim Mid-Season Invitational 2017 versuchen, mit seiner neuen Mannschaft seinen ersten internationalen Titel zu gewinnen.\n","es_AR":"<p>Wang-ho \"Peanut\" Yun es, sin la menor duda, el junglero más agresivo de Corea. Es experto en generar un caos controlado que casi siempre le permite tener el dominio de las partidas en sus propias manos. Después de hacer su debut profesional con el absolutamente abrumador equipo NaJin e-mFire, Peanut pasó a formar parte de ROX Tigers a comienzos de año y no ha vuelto la vista atrás desde entonces.</p>\n\n<p>Peanut combina caos y calma de una forma pocas veces vista en la Grieta. En un momento se encuentra robando de forma sistemática la jungla del enemigo, y al siguiente se lanza de cabeza a una torre pera ejecutar un asesinato doble. Es el componente sorpresa lo que hace que Peanut se destaque de otros jungleros de élite. Era la última pieza que faltaba en ROX Tigers, y su juego ayudó a catapultar el equipo al estrellato internacional. Peanut y compañía son grandes favoritos para el Campeonato Mundial 2016, y hay solo una cosa para decir a los equipos que se crucen en su camino: buena suerte.</p>","es_ES":"Wangho ''Peanut'' Han es el jungla más agresivo de Corea. Es un maestro del caos controlado y suele dominar en solitario las partidas. Tras comenzar profesionalmente con el decepcionante NaJin e-mFire, se unió a ROX Tigers en 2016.\n\nPeanut combina el caos y la calma de una forma que rara vez se ha visto en la Grieta. Un segundo está robando de forma sistemática la jungla enemiga, y al siguiente se está lanzando de cabeza bajo la torre para conseguir un asesinato doble. Que sea tan impredecible es lo que lo hace destacar frente a otros junglas de élite. Tras perder una disputada batalla contra SK telecom T1 en el Campeonato Mundial de 2016, Peanut se unió al equipo que lo mandó a casa. Ahora, intentará ganar su primer título internacional con su nuevo equipo en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Wangho \"Peanut\" Han é o caçador mais agressivo da Coreia, ponto. Ele é um mestre em controlar o caos que frequentemente causa nos seus jogos. Depois de ter sua estreia no cenário profissional com a decepcionante NaJin e-mFire, Peanut encontrou seu caminho na ROX Tigers em 2016.</p>\n\n<p>Peanut consegue juntar caos e tranquilidade de uma forma raramente vista no Rift. Em um momento ele pode estar roubando sistematicamente a selva do inimigo e no outro, mergulhando de cabeça em uma torre para pegar um abate duplo. É essa imprevisibilidade que diferencia Peanut dos outros caçadores de elite. Depois de perder uma batalha acirrada para a SK Telecom T1 no Campeonato Mundial 2016, Peanut entrou para a equipe que o fez fazer as malas. Agora, ele tentará ganhar seu primeiro título internacional com sua nova equipe no Mid-Season Invitational 2017.\n</p>","pl_PL":"Wangho „Peanut” Han jest najagresywniejszym dżunglerem w Korei — bezdyskusyjnie. To mistrz kontrolowanego chaosu, który regularnie zdobywa zwycięstwa w meczach praktycznie na własną rękę. Po swoim profesjonalnym starcie w bardzo przeciętnym NaJin e-mFire Peanut przeniósł się na początku 2016 roku do ROX Tigers.\n\nPeanut łączy chaos i opanowanie w sposób rzadko widywany na Summoner’s Rift. W jednej chwili systematycznie wykrada dżunglę przeciwnikowi, a w następnej szturmuje wieżę, by zgarnąć podwójne zabójstwo. To ta nieprzewidywalność odróżnia Peanuta od pozostałych elitarnych dżunglerów. Po przegraniu zaciekłej bitwy z SK Telecom T1 na Mistrzostwach Świata 2016 Peanut dołączył do drużyny, która była przyczyną jego porażki. Teraz ze swoją nową drużyną zamierza zdobyć swój pierwszy międzynarodowy tytuł na Mid-Season Invitational 2017.\n","fr_FR":"Wangho « Peanut » Han est le jungler le plus agressif de Corée, sans exception. Il est passé maître dans l'art du chaos contrôlé, et a pour habitude de dominer les matchs seul. Suite à des débuts professionnels avec les très décevants NaJin e-mFire, Peanut a rejoint les ROX Tigers en 2016.\n\nPeanut mélange chaos et calme d'une façon rarement vue sur la Faille. Un moment, il vole systématiquement la jungle ennemie et l'instant d'après, il fonce tête la première sous une tour pour réaliser un doublé. C'est son caractère imprévisible qui distingue Peanut des autres junglers d'élite. Après avoir perdu un combat serré contre SK Telecom T1 lors du Championnat du monde 2016, Peanut a finalement rejoint l'équipe qui l'avait disqualifié. Il va maintenant tenter de remporter son premier titre international avec sa nouvelle équipe au Mid-Season Invitational 2017.\n"},"foreignIds":{"drupalId":"4062","TRLH1":"200000409","TRLH2":"200000309","ESPORTSTMNT06":"200000355","TRLT3":"200000207"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1025,"slug":"untara","name":"Untara","firstName":"Ui-jin","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/untara-72qfuy9u.png","hometown":"Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:02:38.000Z","updatedAt":"2017-05-31T00:54:38.000Z","bios":{},"foreignIds":{"TRKR1":"225031","ESPORTSTMNT06":"200000353"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1026,"slug":"sky","name":"Sky","firstName":"Haneul","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sky-2m0pzkna.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:03:37.000Z","updatedAt":"2017-05-31T00:49:05.000Z","bios":{},"foreignIds":{"TRKR1":"225033","ESPORTSTMNT06":"200000356"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1033,"slug":"blank","name":"Blank","firstName":"Sungu","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blank-7ie205tv.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:19.000Z","updatedAt":"2017-07-06T14:24:22.000Z","bios":{"en_US":"<p>Sungu “Blank” Kang started his career in China in late 2014. After being relegated from the LPL as a member of Star Horn Royal Club, Blank left the team to join SK telecom T1 in late 2015. He didn’t exactly impress with his first few games in the LCK, but when the team took him to IEM he excelled, and the team finished the tournament unbeaten. Just like that, Blank added his first trophy to his resume.</p>\n\n<p>His performances seem to be consistently improving, and SKT opted to keep playing him over the struggling veteran, Bengi. In his first split as an LCK jungler, he took first in Champions Spring, yet in the Summer Split it was clear that he was still learning how to control vision across the map. He took a back seat to Bengi during SKT's third World Championship run. While Bengi has departed, now Blank has to compete with superstar jungler Peanut for playing time.</p>","es_AR":"<p>Sun-gu \"Blank\" Kang inició su carrera en China a finales del 2014. Después de sufrir un descenso de la LPL como miembro de Star Horn Royal Club, Blank se fue del equipo para unirse a SKTelecom a finales del 2015. No tuvo una actuación muy impresionante en sus primeras partidas en la LCK, pero cuando el equipo lo llevó a la EIM, se destacó y su grupo acabó el torneo invicto. De esta forma, Blank agregó el primer trofeo a su historial.</p>\n\n<p>Sus actuaciones parecen mejorar constantemente, y SKTelecom optó por seguir jugando con él en lugar del veterano Bengi, quien no está teniendo una buena racha. En su primer torneo como junglero de la LCK, salió primero en la Champions Spring, pero en el torneo de clausura quedó claro que aún debía aprender a controlar la visión del mapa. Como resultado, SKTelecom no tuvo unas buenas eliminatorias, y cayó en la semifinal. Blank deberá refinar su control del mapa si quiere que SKTelecom tenga una buena actuación que le permita ganar el trofeo del Campeonato Mundial.</p>","fr_FR":"Sungu « Blank » Kang a débuté sa carrière en Chine fin 2014. Après avoir été relégué des LPL en tant que membre de Star Horn Royal Club, Blank a quitté l'équipe pour rejoindre SK Telecom T1 à la fin de l'année 2015. Il ne s'est pas exactement montré impressionnant lors de ses premiers matchs des LCK, mais quand l'équipe l'a emmené avec elle à l'IEM, il a révélé tout son talent et SKT a terminé le tournoi invaincue. Aussi simplement que ça, Blank a ajouté son premier trophée à son C.V.\n\nSes performances semblent s'améliorer régulièrement, aussi SKT a préféré le conserver en lieu et place de leur vétéran quelque peu affaibli, Bengi. Lors de son premier segment en tant que jungler au sein des LCK, il a remporté sa première victoire au tournoi Champions Spring. Mais lors du segment d'été il était clair qu'il apprenait encore à contrôler sa vision de l'ensemble de la carte. Il s'est ensuite effacé au profit de Bengi au cours du troisième Championnat du monde de SKT. Mais suite au départ de Bengi, c'est maintenant à Blank de se disputer du temps de jeu avec le jungler vedette qu'est Peanut\n","es_ES":"Sungu ''Blank'' Kang comenzó su carrera en China a finales de 2014. Tras ser relegado de la LPL como miembro de Star Horn Royal Club, Blank dejó el equipo y se unió a SK telecom T1 a finales de 2015. Sus primeras partidas en la LCK no fueron impresionantes, pero su actuación en el IEM fue excelente y el equipo terminó el torneo invicto. Y así fue como Blank añadió el primer trofeo a su currículum.\n\nSu rendimiento no dejaba de mejorar, así que SKT optó por darle prioridad frente al veterano Bengi. En su primer split como jungla de la LCK obtuvo el primer puesto en el Champions Spring, pero en el split de verano fue evidente que todavía estaba aprendiendo a controlar la visión del mapa. En el tercer Campeonato Mundial de SKT, Blank tuvo que ser suplente de Bengi. Ahora que Bengi se ha marchado del equipo, Blank tendrá que competir contra Peanut, el jungla superestrella, para ganarse tiempo de juego.\n","de_DE":"Sungu „Blank“ Kang begann seine Karriere Ende 2014 in China. Nachdem er mit dem Star Horn Royal Club aus der LPL abgestiegen war, verließ er die Mannschaft und wechselte Ende 2015 zu SK Telecom T1. In den ersten paar Spielen in der LCK konnte er nicht wirklich überzeugen, aber beim IEM lieferte er eine überragende Vorstellung ab und half seiner Mannschaft, das Turnier ungeschlagen zu beenden. Und mir nichts, dir nichts konnte Blank seine erste Trophäe in die Höhe stemmen.\n\nSeine Leistung scheint immer besser zu werden und SKT entschied sich, ihn dem erfahrenen Bengi vorzuziehen. In seinem ersten Split als LCK-Jungler holte er sich den ersten Platz beim Champions Spring, doch beim Sommer-Split wurde klar, dass er immer noch lernen musste, wie man die Sicht auf der Karte sicherstellt. Bei der Weltmeisterschaft musste er jedoch Bengi den Vortritt lassen. Seit dem Abgang von Bengi muss Blank mit dem Superstar im Dschungel, Peanut, um Spielzeit kämpfen.\n","pl_PL":"Kariera Sungu „Blank” Kanga zaczęła się w Chinach pod koniec 2014 roku. Po relegowaniu z LPL wraz ze wszystkimi pozostałymi członkami Star Horn Royal Club Bank opuścił drużynę, aby pod koniec 2015 roku dołączyć do SK Telecom T1. Nie zaimponował specjalnie podczas swoich pierwszych meczów w LCK, ale gdy drużyna zabrała go na IEM, pokazał, na co go stać i zespół wygrał turniej bez porażki. W ten sposób Blank dodał do swojego resume pierwsze trofeum.\n\nJego występy wydają się coraz lepsze i SKT postanowili zatrzymać go w składzie w miejsce zmagającego się z problemami weterana, Bengiego. Podczas swojego pierwszego splitu w roli dżunglera w LCK Blank zajął pierwsze miejsce w Champions Spring, jednak w toku letniego splitu stało się jasne, że wciąż uczy się kontroli wizji na całej mapie. Ustąpił miejsca Bengiemu podczas trzeciego podejścia SKT do Mistrzostw Świata. Odkąd Bengi odszedł, Blank musi rywalizować o udział w grze z supergwiazdą, dżunglerem Peanutem.\n","pt_BR":"<p>Sungu \"Blank\" Kang iniciou sua carreira na China no fim de 2014. Depois de ser rebaixado na LPL quando ainda era um membro da Star Horn Royal Club, Blank saiu da equipe e entrou para a SK Telecom T1 no final de 2015. Ele não impressionou muito com seus primeiros jogos na LCK, mas quando sua equipe o levou para a IEM, ele se destacou e a equipe terminou o torneio invicta. E simples assim, Blank acrescentou seu primeiro troféu em seu currículo.</p>\n\n<p>Seu desempenho parecia estar melhorando consistentemente, então a SKT optou por continuar jogando com ele em vez do veterano, Bengi, que parecia estar com dificuldades. Em sua primeira Etapa como caçador na LCK, ele ficou em primeiro lugar na Champions de Primavera, mas ficou claro na Etapa de Verão de que ele ainda precisava melhorar seu controle de visão do mapa. Ele ficou na reserva do Bengi durante o terceiro Campeonato Mundial da SKT. Agora que Bengi saiu da equipe, Blank precisa competir com o caçador estrela Peanut para jogar.\n</p>"},"foreignIds":{"ESPORTSTMNT06":"200000434","TRLH1":"200000413","TRLH2":"200000313","TRLT3":"200000211"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1627,"slug":"fallenbandit","name":"Fallenbandit","firstName":"Kevin","lastName":"Wu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fallenbandit-a9bwgrn6.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:18:22.000Z","updatedAt":"2017-06-14T22:28:26.000Z","bios":{},"foreignIds":{"TRLH1":"200000189","TRLH2":"200000093","ESPORTSTMNT02":"200000611"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1628,"slug":"omargod","name":"Omargod","firstName":"Omar","lastName":"Amin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/omargod-6xhi51pa.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:10.000Z","updatedAt":"2017-06-14T22:33:37.000Z","bios":{},"foreignIds":{"TRLH1":"200000191","TRLH2":"200000095","ESPORTSTMNT02":"200000613"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1629,"slug":"tuesday","name":"Tuesday","firstName":"Jean","lastName":"Sebastien","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tuesday-7kg529hw.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:20:06.000Z","updatedAt":"2017-06-07T21:48:24.000Z","bios":{},"foreignIds":{"TRLH1":"200000190","TRLH2":"200000094","ESPORTSTMNT02":"200000612"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1630,"slug":"zag","name":"Zag","firstName":"Osama","lastName":"Alkhalaileh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zag-7tna3fwi.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:47.000Z","updatedAt":"2017-06-14T22:26:54.000Z","bios":{},"foreignIds":{"TRLH1":"200000187","TRLH2":"200000091","ESPORTSTMNT02":"200000609"},"socialNetworks":{},"champions":[],"liveGameTeam":23},{"id":1631,"slug":"fill","name":"Fill","firstName":"Hyowon","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fill-cyf1ri9o.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-01-09T19:21:42.000Z","updatedAt":"2017-06-14T22:34:09.000Z","bios":{},"foreignIds":{"TRLH1":"200000188","TRLH2":"200000092","ESPORTSTMNT02":"200000610"},"socialNetworks":{},"champions":[],"liveGameTeam":23}],"scheduleItems":[{"id":"AVRUIAKuoUG4HPFjOJ8c","content":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:match:9e0d1636-b19b-4d7e-b46a-8f4633f2d52d","scheduledTime":"2016-05-06T06:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb","blockLabel":"3","subBlockLabel":"Live Broadcast","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:bracket:3d469dc6-3409-4b0c-a4d4-201b1aa99a7a"},"match":"9e0d1636-b19b-4d7e-b46a-8f4633f2d52d","tournament":"69298c0c-16ae-490a-8e9c-cfe4620a6bfb","bracket":"3d469dc6-3409-4b0c-a4d4-201b1aa99a7a","league":"10"}],"gameIdMappings":[{"id":"95121eb9-a4bf-40cf-ade3-fa503789518e","gameHash":"759f5744da9c0f02"}],"videos":[{"id":2697,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:95121eb9-a4bf-40cf-ade3-fa503789518e","source":"https://www.youtube.com/embed/0SGnikirsKA?wmode=transparent","createdAt":"2016-05-06T09:22:34.000Z","updatedAt":"2016-05-06T09:22:34.000Z","game":"95121eb9-a4bf-40cf-ade3-fa503789518e"},{"id":2699,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:95121eb9-a4bf-40cf-ade3-fa503789518e","source":"https://www.youtube.com/watch?v=z-lI3uJC_vM","createdAt":"2016-05-06T09:42:27.000Z","updatedAt":"2016-05-06T09:42:27.000Z","game":"95121eb9-a4bf-40cf-ade3-fa503789518e"},{"id":2703,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:69298c0c-16ae-490a-8e9c-cfe4620a6bfb:game:95121eb9-a4bf-40cf-ade3-fa503789518e","source":"https://www.youtube.com/embed/3Ln1YYiQnTk","createdAt":"2016-05-06T12:09:36.000Z","updatedAt":"2016-05-06T12:09:36.000Z","game":"95121eb9-a4bf-40cf-ade3-fa503789518e"}],"htmlBlocks":[],"match":{"id":"9e0d1636-b19b-4d7e-b46a-8f4633f2d52d","name":"CLG-vs-SKT","position":8,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"},{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}],"games":{"95121eb9-a4bf-40cf-ade3-fa503789518e":{"id":"95121eb9-a4bf-40cf-ade3-fa503789518e","name":"G1","generatedName":"CLG|SKT|G1|9e0d1636b19b4d7eb46","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"},{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}],"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}]],"timestamp":1462521260851,"source":"manual","note":"Set in esports HQ","history":[{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}]],"timestamp":1462520752148,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"60240","gameRealm":"TRLT3","platformId":"TRLT3:60240","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}]],"timestamp":1462521260851,"source":"manual","note":"Set in esports HQ","history":[{"result":[[{"roster":"da4ffa8f-2beb-46e8-9a20-6c962685435c"}],[{"roster":"44ee4571-7911-44d6-96d9-981f56c7e6b3"}]],"timestamp":1462520752148,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"44ee4571-7911-44d6-96d9-981f56c7e6b3":0,"da4ffa8f-2beb-46e8-9a20-6c962685435c":1}}}