{"teams":[{"id":47,"slug":"team-impulse","name":"Team Impulse","guid":"be6ca6ae-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/team-impulse-dsq48km.png","acronym":"TIP","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-01-19T23:39:44.000Z","updatedAt":"2016-02-04T22:21:28.000Z","bios":{"en_US":"<p>\nBorn from the ashes of LMQ, Team Impulse entered the NA LCS in 2015 with a mixture of imported and local talent. However, molding a team of individual stars into a cohesive unit took longer than TIP anticipated, and they were unable to replicate LMQ’s 2nd place finish in their debut split. To say that the seasons since have been chaotic for TIP might be an understatement. Regardless, TIP is back for 2016 sporting an almost unrecognizable roster. Gate alone remains a familiar face. This new squad has their work cut out for them if they want to live up to the legends of Rush and Company.\n</p>\n<p>\nCoach: Jun-yao Pan\n</p>","fr_FR":"<p>Team Impulse est une organisation qui semble manquer de chance. Arrivée en LCS sous le nom LMQ en 2014, la structure a pourtant débuté sous les meilleurs auspices. LMQ a écrasé toute la concurrence en Challenger Series et s’est qualifiée sans accrocs pour le segment d’été des LCS NA 2014. Un segment terminé à la troisième place des play-offs, synonyme d’une qualification pour les championnats du monde. Si l’équipe n’a pas eu le succès espéré lors de ces derniers, le futur s’annonçait pourtant radieux fin 2014 quand LMQ a pris son nom actuel de Team Impulse. </p>\n\n<p>Malheureusement pour eux, le destin est parfois cruel. Malgré une équipe renouvelée, avec notamment le sud-coréen Lee « Rush » Yoon-jae qui s’est vite révélé comme la nouvelle superstar de la jungle en NA, Team Impulse n’a pu faire mieux qu’une décevante 4ème place lors des play-offs du segment de printemps des LCS NA 2015. Mais c’est le segment d’été de la même année qui a sans aucun doute le plus brisé le cœur des fans de la franchise.  Peu de temps avant les play-offs et alors que l’équipe avait su se montrer un prétendant sérieux au titre son midlaner star, Yu « XiaoWeiXiao » Xian a été banni de toutes compétitions. Un premier coup dur suivi d’un deuxième quand Team Impulse, avec  Austin « Gate » Yu comme remplaçant en midlane, a non seulement à nouveau terminé à la 4ème place des play-off, mais surtout a été éliminée par Cloud 9 lors du tournoi régional pour la 3ème place qualificative aux championnats du monde. </p>\n\n<p>Les malheurs de Team Impulse ont continué lors de l’intersaison, puisque la structure a tenté en vain de vendre sa place en LCS et a donc dû recruter une équipe en catastrophe pour les LCS NA 2016. Une équipe qui sur le papier ne fait pas peur à grand monde. Team Impulse n’a plus qu’à espérer un retournement de son karma si elle veut éviter de sombrer dans les tréfonds du classement des LCS NA.</p>","pl_PL":"<p>Organizacja powstała w grudniu 2014 roku. Przejmując spot należący poprzednio do fenomenu NA LCS, LMQ, od razu otrzymała szansę, by wystartować w najważniejszym turnieju za Oceanem. Z poprzedniego zespołu, który rozpadł się dość niespodziewanie po bardzo udanym sezonie, pozostał tylko jeden zawodnik – mid-laner Yu „XiaoWeiXiao” Xian. Wokół niego została zbudowana drużyna, w skład której weszli top-laner Jung „Impact” Eon-yeong, dżungler Lee „Rush” Yoon-ja, strzelec Apollo „Apollo” Price oraz wspierający Adrian „Adrian” Ma. Formacja nie należała do faworytów rozpoczynającego się wiosennego splitu 2015, ale przez wielu ekspertów uważana była za czarnego konia zmagań. I faktycznie – po dość przeciętnym starcie, kiedy w pierwszych dwóch meczach TiP musiał korzystać z usług Keenana „Rhuxa” Santosa zastępującego Impacta, ekipa spisywała się coraz lepiej. W efekcie sezon zasadniczy udało się zakończyć na wysokiej, czwartej pozycji, a w play-offach finiszować nawet na ostatnim stopniu podium. </p>\n<p>W przerwie między splitami obyło się bez zmian w składzie i do letniego turnieju Team Impulse przystępował jako jeden z faworytów do wyjazdu na Mistrzostwa Świata sezonu 2015. Ponownie drużyna zaczęła dość spokojnie, przez pierwsze kolejki utrzymując się w okolicach środka tabeli. Niemniej piorunujący okres od 6 do 8 tygodnia, w którym zespół zanotował sześć zwycięstw i nie odniósł żadnej porażki wywindował TiP do pierwszej trójki. W zajęciu miejsca na podium nie przeszkodziły formacji nawet problemy kadrowe – pod koniec splitu drużyna zdecydowała się zmienić supporta a Adriana na Austina „Gate’a” Yu. Ostatecznie plany te pokrzyżowało zawieszenie XiaoWeiXiao, w związku z czym w drużynie pozostał Adrian, a Gate powędrował na środkową aleję.</p>\n<p>Team Impulse sezon zasadniczy zakończył na wysokim, trzecim miejscu i do rywalizacji w play-offach przystępował jako poważny gracz w rywalizacji o bilety na Mistrzostwa Świata. Tym bardziej, że aż dwójki zawodników tej ekipy (Rush i Impact) znalazła się w dream teamie letniego splitu, a Rush został nawet uznany za najbardziej wartościowego gracza w stawce. Ostatecznie drużyna spisała się poniżej oczekiwań i przegrała półfinał z CLG (0-3) oraz mecz o trzecie miejsce z Teamem Liquid (1-3), a później także szybko odpadła z turnieju kwalifikacyjnego (porażka 2-3 z Cloud9), żegnając się z marzeniami o wyjeździe na najważniejszy turniej w sezonie.</p>\n<p>Po letnim splicie drużyna zapowiedziała sprzedanie swojego miejsca w NA LCS, co jednak zakończyło się fiaskiem. Niemniej większość graczy opuściła organizację i jedynym zawodnikiem, który pozostał ze starego składu jest Gate, który ponownie przeniósł się na dolną aleję, gdzie w wiosennym splicie 2016 pełnić będzierolę supporta. Jego partnerem został doświadczony strzelec Brandon \"DontMashMe\" Phan. Skład uzupełnią trzej mniej znani gracze: koreański dżungler Kim „Procxin” Se-yeong, który ostatnio występował przez moment w japońskim DetonatioN FocusMe oraz dwaj utalentowani zawodnicy wypatrzeni w kolejce solowej: top-laner Wang „Feng” Xiao Feng oraz mid-laner Kim “Pirean” Se-yeong. </p>"},"foreignIds":{"drupalId":"3657"},"players":[246,274,574,820,970,971,972],"starters":[246,820,970,971,972],"subs":[274,574]},{"id":122,"slug":"renegades","name":"Renegades","guid":"be6eff04-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/renegades-11rbdlso.png","acronym":"REN","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-05-31T12:19:31.000Z","bios":{"en_US":"<p>\nA band of former Misfits, Renegades stormed through the 2015 NA Challenger Series and into the NA LCS within a year of their founding. Their success in the NACS was largely attributed to superior map and objective control, not individual laning talent, but don't let that fool you. Former Moscow 5 star Alexey \"Alex Ich\" Ichetovkin and former Team Dignitas star (and prophet) Alberto \"Crumbz\" Rengifo bring their fair share of experience and mechanical skill to the REN lineup. Combined with the stellar bot lane duo of Aleš \"Freeze\" Kněžínek and support Maria \"Remi\" Creveling, the Renegades ongoing success seems almost inevitable.\n</p>\n<p>\nCoach: David Tu\n</p>","fr_FR":"<p>Anciennement connus sous le nom de Misfits, les Renegades ont balayé leurs adversaires lors des Challenger Series NA 2015 et se sont qualifiés pour les LCS NA seulement un an après leur fondation. Leur succès lors des CS NA a été largement attribué à leur meilleur contrôle de la carte et des objectifs, et non à leur talent individuel en phase de laning, mais ne vous laissez pas abuser. L'ancienne star de Moscow 5, Alexy « Alex Ich » Ichetovkin et l'ancienne star (et prophète) de Team Dignitas, Alberto « Crumbz » Rengifo, ont apporté leur lot d'expérience et de maîtrise des mécaniques de jeu à l'équipe. Si l'on combine ces atouts certains au talentueux duo formé par Aleš « Freeze » Kněžínek et son support Maria « Remi » Creveling en voie du bas, le succès des Renegades semble assuré.</p>","pl_PL":"<p>Renegaci z Los Angeles wywodzą się z zespołu Misfits, który został założony na początku marca 2015. Twórcą był Chris \"Doombang\" Badawi, były prawnik patentowy z Nowego Jorku. W wywiadzie dla the Score e-sports wyjawił co przekonało go do takiego kroku. Pewnego dnia miał wypadek samochodowy, tak poważny, że z trudem udało mu się pozostać przy życiu. To skłoniło go do weryfikacji swojego życia – „Doombang” stwierdził, że nie chce być prawnikiem, bo w głębi duszy zawsze był graczem. Pierwotnie chciał kupić Curse Academy, ale skończyło się to tylko zdobyciem wielu przydatnych kontaktów w społeczeństwie League of Legends. </p>\n<p>\nWkrótce potem Chris Badawi zaprosił do rozmów Alberta \"Crumbz\" Rengifa, przyszłego kapitana LA Renegades, żeby podyskutować o stworzeniu nowej organizacji. Okazało się, że doskonale się rozumieją w kategorii idei, jak ma taki zespół wyglądać. Według filozofii Chrisa LA Renegades ma być drużyną, którą nie jest odbierana jako firma, tylko rodzina. To ma być miejsce gdzie każdy członek kocha i jest dumny z tego co robi, zamiast czuć nieustającą presję. \"Crumbz\" zaproponował Alexeya \"Alex Ich\" Ichetovkina jako kolejnego uczestnika tego projektu, którego \"Doombang\" przyjął z olbrzymim entuzjazmem. Tych trzech pasjonatów, połączonych wspólnym celem, zaczęło współpracę żeby niebawem ogłosić utworzenie Misfits. <p/>\n<p>\nPierwsza połowa 2015 roku przyniosła zespołowi wiele zmian. Przede wszystkim udało mu się dostać do 2015 NA Challenger Series, po trzech zwycięskich spotkaniach o wyniku 2:0. Zbiegło się to  w czasie ze zmianami w samej organizacji. Drużyna została przemianowana z Misfits na LA Renegades. Powszechnie znany prezenter, Christopher \"MonteCristo\" Mykles, dołączył do drużyny jako współwłaściciel. Pojawienie się kolejnej bardzo dobrze znanej twarzy zasiliło powiększające się, olbrzymie już grono kibiców tej drużyny. W międzyczasie Chris \"Doombang\" Badawi wywołał aferę w społeczeństwie League of Legends, w efekcie czego został wykluczony z uczestnictwa w LCS do końca sezonu 2016. </p>\n<p>\nPomimo tego, że na pierwszy rzut oka gracze z LA Renegades wydawali się przypadkową zbieranią, osiągnęli już swoje pierwsze sukcesy. Skończyli 2015 NA Challenger Series na drugim miejscu, po przegraniu dogrywki z Team Coast, z wynikiem 8:2. Jednak najważniejszym triumfem dla nich były rozgrywki kwalifikacjyjne do NA LCS. Renegaci zmierzyli się z najpoważniejszymi konkurentami z Challenger series. Najpierw wygrali z Team Imagine 2 do 1, a następnie w żazartej walce z Team Coast 3 do 2. Dzięki temu udało im się zrealizować ich najważniejszy cel – dostać się do wiosennego sezonu NA LCS 2016.</p>\n"},"foreignIds":{"drupalId":"4429"},"players":[144,160,272,323,501,680,784],"starters":[144,160,501,680],"subs":[272,323,784]}],"players":[{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":274,"slug":"ken","name":"Ken","firstName":"Kenneth","lastName":"Tang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/ken-geyigfij.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-07-13T17:55:14.000Z","bios":{"en_US":"Kenneth \"Ken\" Tang is currently a substitute support for Nova."},"foreignIds":{"drupalId":"2525","TRLH1":"1001220142","TRLH2":"1001160192","FRA1TMNT1":"375162"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":501,"slug":"ninja","name":"Ninja","firstName":"Geon-woo","lastName":"Noh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ninja-4csesuls.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-30T02:20:51.000Z","bios":{"en_US":"<p>Geon-woo \"Ninja\" Noh was originally meant to be a loan from to the Dragon Knights, but North America seems to agree with him. These days Ninja is most often found with his partner in fun Seraph, and the two solo laners have built up a great dynamic. Team Envy snapped up the duo in 2016 with the hope that giving the old friends a fresh start would propel their new team to victory. Their gamble paid off in the form of Team Envy making the playoffs in their inaugural split together. The team will bank on Ninja and Seraph’s chemistry growing and landing them right back where they want to be -- the playoffs.</p>","de_DE":"Geon-woo „Ninja“ Noh war ursprünglich eine Leihgabe der Dragon Knights, aber Nordamerika scheint ihm zu liegen. Heutzutage trifft man Ninja meistens mit seinem Freund Seraph zusammen an und die beiden Solo-Laner harmonieren großartig. Team Envy verpflichtete das Duo 2016 in der Hoffnung, dass die beiden Freunde ihre neue Mannschaft zum Sieg führen würden. Und ihr Wagnis machte sich bezahlt, als Team Envy gleich im ersten Split die Entscheidungsspiele erreichte. Die Mannschaft hofft darauf, dass Ninjas und Seraphs Harmonie noch besser geworden ist und sie wieder dorthin führen wird, wo sie sein wollen: in die Entscheidungsspiele."},"foreignIds":{"drupalId":"2143","TRLH1":"200000226","TRLH2":"200000130"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":574,"slug":"beibei","name":"beibei","firstName":"Meng","lastName":"Zhang","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/beibei-8o0z1gzp.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-01-14T05:50:04.000Z","bios":{"en_US":"Meng \"beibei\" Zhang is currently a substitute jungler for Team Impulse."},"foreignIds":{"drupalId":"3805","TRLH1":"1001220141","TRLH2":"1001160191"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":784,"slug":"leonyx","name":"Leonyx","firstName":"Rob","lastName":"Lee","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/leonyx-86twbq9h.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:47.000Z","updatedAt":"2017-01-19T22:25:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4563","TRLH1":"200000223","TRLH2":"200000127"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":970,"slug":"feng","name":"Feng","firstName":"Wang","lastName":"Xiao Feng","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/feng-ealfuafn.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:13:29.000Z","updatedAt":"2016-01-25T09:26:58.000Z","bios":{"fr_FR":"<p>Nul ne sait grand-chose sur Wang « Feng » Xiao-Feng. Il faut dire que le joueur était un illustre inconnu jusqu’au moment où il a été annoncé comme le nouveau toplaner de Team Impulse pour les LCS NA 2016. Tout ce qu’on sait de lui c’est qu’il est un joueur de la file solo, classé challenger sur le serveur nord-américain, il oscille aux alentours de la 120ème place du classement, et qu’il n’a aucune expérience compétitive antérieure. Il est en conséquence très difficile de pronostiquer la façon dont il tiendra son rang sur la file du haut face à des joueurs comme Heo « Huni » Seung-hoon ou Darshan « Darshan » Upadhyaya. D’autant moins que le joueur n’est initialement…. même pas vraiment un toplaner ! À en croire son historique des matchs, son champion le plus joué en 2015 serait en effet Bard. Néanmoins le joueur ne semble plus utiliser son compte principal et peut-être saura-t-il surprendre une fois en LCS. C’est le moment de faire ses preuves.</p>","en_US":"<p>\nXiao-feng \"Feng\" Wang is a wildcard. Known as a Solo Queue talent on the North America server,  Feng joined Team Impulse headed into the 2016 NA LCS Spring Split as their starting top laner. \n</p>","pl_PL":"<p>Feng to dość anonimowy, pochodzący z Kanady zawodnik, którego dołączenie do Teamu Impulse na wiosenny split NA LCS 2016 jest ogromnym zaskoczeniem. Top-laner w przeszłości posługiwał się także innymi nickami – „xwind, „windking”, „windking6” czy „windking66”.</p>\n<p>Do tej pory gracz zaliczył jedynie epizod w Team Liquid Academy, z którym wziął udział w kwalifikacjach do wiosennej edycji NA Challenger Series 2015, w dwóch pierwszych meczach turnieju zastępując na pozycji strzelca Yuriego „KEITHMCBRIEF’a” Jew. Feng spisał się nieźle – dwukrotnie wybierał Caitlyn i zakończył Bo3 przeciwko Infinity Esports z KDA na poziomie 9/4/19.\nWang brał także udział w turnieju HTC Ascension, w którym wystąpił w barwach Teamu Ares, również na pozycji strzelca. Jego zespół zakończył zmagania na fazie grupowej, zajmując 5. pozycję w grupie B – pierwszą, która nie dawała awansu do następnej rundy.</p>\n<p>W ostatnim czasie Feng dobrze radził sobie w amerykańskiej kolejce solowej, gdzie dostrzegł go TiP. Na stan z początku stycznia 2016 roku top-laner miał dwa konta w Challengerze, gdzie zajmował 86. I 122. pozycję. Niemniej wśród najczęściej wybieranych przez niego bohaterów próżno szukać typowych postaci górnej alei.</p>\n"},"foreignIds":{"TRLH1":"1001220136","TRLH2":"1001160186"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":971,"slug":"procxin","name":"Procxin","firstName":"Se-young","lastName":"Kim","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/procxin-4cjkz2ew.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:15:41.000Z","updatedAt":"2016-06-09T23:13:22.000Z","bios":{"fr_FR":"<p>Kim « Procxin » Se-Young est le nom du nouveau jungler de Team Impulse. Le joueur sud-coréen n’a qu’une très faible expérience du jeu compétitif, mais il a pour lui d’être un joueur voyageur. En effet, après des débuts difficiles en Corée du Sud au sein de l’équipe MKZ – avec qui il a perdu tous ses matchs – le joueur de 20 ans a brièvement rejoint Xenics Storms de mars à juin 2015 puis s’est envolé pour le Japon ! Au pays du soleil levant il a été intégré comme remplaçant à l’équipe de LJL DetonatioN FocusMe. Malheureusement pour lui, l’expérience n’a été que de très courte durée : le joueur n’a joué que deux matchs, perdus, avec sa nouvelle équipe avant d’en être débarqué dès juillet 2015. L’annonce de l’arrivée du joueur en Amérique du Nord et, qui plus est, directement en LCS a donc été une énorme surprise pour les quelques personnes qui avaient entendu parler de lui. Le fait qu’il ait déjà joué à l’étranger laisse penser que le joueur parler peut-être suffisamment bien anglais pour éviter les problèmes de communication avec ses coéquipiers – et encore, rien n’est moins sur – mais c’est sans doute le seul point en faveur de Procxin sur le papier. </p>","en_US":"<p>\nWhen Se-young \"Procxin\" Kim first joined the LCS, the predominant response was: “?” With his debut behind him though, he’s started to really make his mark on the league. Procxin emerged as a surprise power player at the tail end of the 2016 NA LCS Spring Split, and his hot run of form carried over to the 2016 Promotion Tournament. Procxin is a terror on Graves and Kindred, and he loves to channel his inner Phreak to deal tons of damage. As we head into the 2016 NA LCS Summer Split, Procxin will be looking to prove that he can continue his strong performances\n</p>","pl_PL":"<p>Urodzony w 1995 roku Koreańczyk to zawodnik, który na profesjonalnej scenie znajduje się od maja 2014 roku i w tym czasie miał już okazję grać zarówno na najwyższym krajowym poziomie – w OGN, na tym nieco niższym, czyli w rozgrywkach Challenger, a także w japońskim LJL.</p>\n<p>Procxin swoją karierę zaczynał od występów w drużynie MKZ, z którą to bardzo szybko udało mu się awansować do letniego splitu OGN 2014, osiągając tym samym marzenie każdego koreańskiego gracza. Niestety zespół nie utrzymał się tam długo, przegrywając wszystkie sześć spotkań w fazie grupowej i odpadając z rywalizacji. Dżungler, który preferował w tym czasie Elise oraz Evelyn, również nie pokazał się z najlepszej strony. </p>\n<p>Procxin wraz z kolegami przeniósł się do organizacji Xenics Storm i od razu otrzymał szansę, żeby się wykazać na drugim szczeblu rozgrywek – NLB, gdzie rywalizowały drużyny, które odpadły z OGN. Niestety ekipa dżunglera bardzo szybko pożegnała się ze zmaganiami, przegrywając z mało znanym w tym czasie zespołem Anarchy. Okres spędzony w Xenics w ogóle nie był dla Procxina zbyt udany, bowiem drużyna, która po zmianach w systemie rozgrywek rywalizowała w serii Challenger, nie odniosła żadnych znaczących sukcesów. Pierwszy turniej wiosennego splitu zakończyła na pierwszej rundzie i pożegnała się ze zmaganiami i z organizacją. Proxcin i jego kompani wrócili do MKZ i w letniej edycji rozgrywek zajęli nawet niezłe trzecie miejsce, zapewniając sobie udział w decydującym turnieju. W tym czasie dżungler otrzymał jednak propozycję dołączenia do potentata japońskich rozgrywek – DetonatioN FocusMe i skuszony ofertą, odszedł z MKZ. </p>\n<p>Jednak przygoda w egzotycznej lidze zakończyła się dla Koreańczyka niemal równie szybko jak się zaczęła. Procxin rozegrał w barwach nowego zespołu zaledwie dwa spotkania (jedno Gragasem i jedno Nidalee)i nie wyróżnił się niczym szczególnym. Stracił miejsce w składzie i odszedł z ekipy po tygodniu od dołączenia do niej. Od tego czasu, czyli od początku sierpnia 2015 roku pozostawał bez drużyny, ale los uśmiechnął się do niego na przełomie 2015 i 2016 roku, kiedy to otrzymał ofertę od Teamu Impulse, któremu nie udało się sprzedać swojego miejsca w NA LCS. Wobec tego formacja kompletowała skład gotowy wystąpić w wiosennym splicie rozgrywek 2016, przyjmując w swoje szeregi Proxcina, który miał zostać podstawowym dżunglerem.</p>\n"},"foreignIds":{"TRLH1":"1001220137","TRLH2":"1001160187"},"socialNetworks":{},"champions":[],"liveGameTeam":47},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":47}],"scheduleItems":[{"id":"AVOWQVV0JTrHluSI14RQ","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:9f4651cd-85b2-4f16-b94b-cac2994b899c","scheduledTime":"2016-03-21T00:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"9f4651cd-85b2-4f16-b94b-cac2994b899c","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"3e90e2e5-23b7-4692-b1f5-f8c9087c2fc1","gameHash":"3bac45bbc85aa71f"}],"videos":[{"id":2277,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:3e90e2e5-23b7-4692-b1f5-f8c9087c2fc1","source":"https://www.youtube.com/embed/OKpx1MnlCOc?wmode=transparent","createdAt":"2016-03-21T03:11:03.000Z","updatedAt":"2016-03-21T03:11:03.000Z","game":"3e90e2e5-23b7-4692-b1f5-f8c9087c2fc1"}],"htmlBlocks":[],"match":{"id":"9f4651cd-85b2-4f16-b94b-cac2994b899c","name":"TIP-vs-REN-tb","position":0,"state":"resolved","groupPosition":0,"matchType":{"identifier":"single_elim"},"input":[{"roster":"775d62d1-d20b-432d-a032-2e31cf9243ef"},{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],"games":{"3e90e2e5-23b7-4692-b1f5-f8c9087c2fc1":{"id":"3e90e2e5-23b7-4692-b1f5-f8c9087c2fc1","name":"G1","generatedName":"REN|TIP|G1|9f4651cd85b24f16b94","input":[{"roster":"775d62d1-d20b-432d-a032-2e31cf9243ef"},{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"775d62d1-d20b-432d-a032-2e31cf9243ef"}]],"timestamp":1458521671662,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001650093","gameRealm":"TRLH1","platformId":"TRLH1:1001650093","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"775d62d1-d20b-432d-a032-2e31cf9243ef"}]],"timestamp":1458521671662,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}