{"teams":[{"id":9,"slug":"sktelecom-t1","name":"SK telecom T1","guid":"be6c808b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/sktelecom-t1-3mpugoym.png","acronym":"SKT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-08-01T18:16:40.000Z","updatedAt":"2017-05-26T23:47:44.000Z","bios":{"en_US":"<p>SK telecom T1 is the best team in the history of League of Legends. With three World Championships under their belt from 2013, 2015 and 2016, no team comes close to their level of dominance. After a stellar run in 2015 that ended in their second title, SKT struggled to start 2016. They righted the ship by IEM Katowice, finishing first in Champions Spring 2016 and winning the 2016 Mid-Season Invitational.</p> \n\n<p>They hit another snag when they failed to reach the finals in Champions Summer 2016, falling to kt Rolster. But the SKT of old showed up right away at the 2016 World Championship, and Faker led the team to its second straight Worlds win. Entering 2017 with a roster somehow even more packed with talent, anything short of another World Championship would be a disappointment for SKT.</p>\n\n<p>Coach: Jeonggyun “KkOma” Kim</p>","fr_FR":"SK Telecom T1 est la meilleure équipe de l'histoire de League of Legends. Avec trois Championnats du monde à son palmarès en 2013, 2015 et 2016, aucune équipe n'approche de son niveau de domination. Suite à une performance sans faute en 2015 qui s'est soldée par un deuxième titre, SKT a commencé l'année 2016 plus difficilement. L'équipe est finalement parvenue à redresser la barre lors des IEM de Katowice, décrochant la première place du Champions Spring 2016 et remportant le Mid-Season Invitational 2016.\n\nElle s'est ensuite à nouveau retrouvée dans l'impasse en manquant de se qualifier pour la finale du Champions Summer 2016 contre KT Rolster. Mais SKT s'est vite remise sur pied au Championnat du monde et Faker lui a valu sa deuxième victoire consécutive au Mondial. Après avoir dominé la LCK ce printemps, SKT s'apprête à présent à participer au Mid-Season Invitational 2017, au Brésil, en tant que favorite incontestable. Les champions en titre aspirent à la première place et ils ne se contenteront de rien de moins.\n\nEntraîneur : Jeonggyun « KkOma » Kim\n","pl_PL":"SK Telecom T1 to najlepsza drużyna w historii League of Legends. Trzy razy wygrała Mistrzostwa Świata ― w 2013, 2015 i 2016 roku. Żadna inna drużyna nie zbliżyła się nawet do tego poziomu dominacji. Po rewelacyjnych występach w 2015 roku, które zakończyli zdobyciem drugiego tytułu, SKT z trudem zaczynali 2016 rok. Podwyższyli poziom lotów na IEM w Katowicach, kończąc na pierwszym miejscu Champions Spring 2016 i wygrywając Mid-Season Invitational 2016.\n\nKolejne spowolnienie nastąpiło, gdy nie zdołali dotrzeć do finałów Champions Summer 2016, przegrywając z KT Rolster. Ale dawne SKT wkrótce powróciło na Mistrzostwa Świata 2016, a Faker doprowadził drużynę do drugiej z rzędu wygranej na Mistrzostwach. Po zdominowaniu LCK tej wiosny SKT jadą na Mid-Season Invitational 2017 w Brazylii jako zdecydowani faworyci. Cokolwiek poniżej pierwszego miejsca będzie rozczarowaniem dla obecnych czempionów.\n\nTrener: Jeonggyun „KkOma” Kim\n","de_DE":"SK Telecom T1 ist die beste Mannschaft in der Geschichte von League of Legends. Keine andere Mannschaft ist so dominant wie der dreimalige Weltmeister, der sich diesen Titel in den Jahren 2013, 2015 und 2016 sichern konnte. Nach einer überragenden Vorstellung im Jahr 2015, die die Mannschaft mit ihrem zweiten Weltmeistertitel krönte, hatte SKT 2016 Startschwierigkeiten. Beim IEM Katowice konnten sie jedoch das Ruder wieder herumreißen, woraufhin sie den Frühjahrs-Split der LCK 2016 und das Mid-Season Invitational 2016 gewannen.\n\nIm Sommer-Split der LCK 2016 folgte jedoch der nächste Dämpfer, als sie von KT Rolster besiegt wurden und das Finale nicht erreichten. Doch SKT fand vor der Weltmeisterschaft 2016 wieder zu alter Stärke zurück und Faker führte die Mannschaft zu ihrem zweiten WM-Titel hintereinander. Nach einer dominanten Vorstellung im diesjährigen Frühjahrs-Split der LCK kommt SKT als Favorit zum Mid-Season Invitational 2017 in Brasilien. Alles andere als der erste Platz wäre für die regierenden Champions eine Enttäuschung.\n\nTrainer: Jeonggyun „KkOma“ Kim\n","es_ES":"SK telecom T1 es el mejor equipo de la historia de League of Legends. Ganadores de tres Campeonatos Mundiales (en 2013, 2015 y 2016), ningún equipo se acerca a su nivel de superioridad. Tras un año estelar en 2015 que les hizo ganarse su segundo título, el comienzo de 2016 no fue tan sencillo para SKT. Recobraron la fuerza a partir del IEM Katowice, acabaron primeros en el Champions Spring de 2016 y ganaron el Mid-Season Invitational 2016.\n\nSe encontraron con un nuevo obstáculo cuando no lograron llegar a la final del Champions Summer 2016, tras perder contra KT Rolster. No obstante, el SKT al que estábamos acostumbrados volvió a dar la cara en el Campeonato Mundial de 2016, y Faker lideró al equipo hasta su tercer título de campeón mundial. Tras dominar en la LCK esta primavera, SKT llega al Mid-Season Invitational 2017 en Brasil como el máximo favorito. Solo el primer puesto estaría a la altura de las expectativas de los actuales campeones.\n\nEntrenador: Jeonggyun ''KkOma'' Kim\n","pt_BR":"<p>SK Telecom T1 é a melhor equipe da história de League of Legends. Com três Campeonatos Mundiais conquistados em 2013, 2015 e 2016, nenhuma equipe se aproxima da sua soberania. Depois de um jogo excelente em 2015 que resultou no seu segundo título, a SKT começou 2016 com dificuldades. Mas eles conseguiram virar o jogo na IEM Katowice, terminando em primeiro no Champions Spring 2016 e vencendo o Mid-Season Invitational 2016.</p>\n\n<p>Eles encontraram outro problema quando não conseguiram chegar à final no Champions Summer 2016, perdendo para KT Rolster. Mas a velha SKT se mostrou imediatamente no Campeonato Mundial 2016, e Faker liderou a equipe à sua segunda vitória mundial consecutiva. Depois de dominar a LCK desta primavera, a SKT avança para o Mid-Season Invitational 2017, no Brasil, como uma das grandes favoritas. Qualquer coisa menos que o primeiro lutar seria uma decepção para os campeões reinantes.</p>\n\n<p>Técnico: Jeonggyun \"KkOma\" Kim</p>\n","es_AR":"<p>Muchos consideran que SKT T1 es uno de los mejores equipos de League of Legends del mundo, con un primer lugar en los Campeonatos Mundiales 2013 y 2015, y varias finales en la OGN Champions. Su dominio en el 2015 era motivo de gran admiración. SKT se llevó a casa el primer lugar en la Champions de primavera y verano, y luego cerró el año con una actuación casi invicta que le mereció el primer lugar en el Campeonato Mundial 2016.</p>\n\n<p>Luego de su participación estelar en el 2015 y de pasar por varios cambios en el plantel, SKTelecom no tuvo un buen inicio del 2016. Sin embargo, brillarían luego en la competencia con una actuación invicta en el IEM Katowice. Después de eso, todo fue un trámite para SKTelecom. Obtuvieron un primer lugar en la Champions Spring 2016 y nuevamente en el torneo por invitación de mitad de temporada. Sin embargo, el equipo se vio en dificultades y no llegó a la final del torneo de clausura de la LCK 2016. Incluso después de terminar tan mal, SKTelecom siguió siendo uno de los mejores equipos del mundo, y está determinado a limpiar su imagen con otro trofeo mundial.</p>\n\n<p><strong>Entrenador: Kim \"KkOma\" Jeong-gyun</strong></p>","ko_KR":"<p>SKT T1은 전 세계에서 리그 오브 레전드 최강 팀 중 하나로 명성이 자자합니다. 시즌 3 월드 챔피언십 및 2015 월드 챔피언십뿐만 아니라 OGN 챔피언스에서 여러 차례 수위에 올랐죠. SKT T1이 2015년에 보여준 포스는 그야말로 어마어마했습니다. 2015 챔피언스 스프링과 서머에서 연달아 우승한 SKT T1은 2015 월드 챔피언십에서는 통틀어 단 한 경기만을 내주고 월드 챔피언으로 등극하며 한 해를 마무리했죠.</p>\n\n<p>영광의 2015년이 끝난 후 로스터 변경으로 인해 SKT T1는 2016년 시즌 초반 힘겨운 시기를 보냈습니다. 하지만 그것도 잠시, IEM Katowice에서 무패의 기록으로 적을 박살내며 포스가 다시 살아났죠. 그 이후 SKT T1은 여느 때처럼 다시 2016 챔피언스 스프링에서 정상에 섰습니다. 결승에서 ROX Tigers를 꺾은 것은 시작일 뿐입니다. MSI에서 SKT T1은 또 다른 국제 대회 트로피를 쟁취하기 위해 다시 전장에 나설 것입니다.</p>"},"foreignIds":{"drupalId":"684"},"players":[46,327,403,404,715,1025,1026,1033],"starters":[46,327,403,404,715],"subs":[1025,1026,1033]},{"id":105,"slug":"kt-rolster","name":"kt Rolster","guid":"be6e39bf-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/kt-rolster-8rh5ukll.png","acronym":"KT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:44.000Z","bios":{"en_US":"<p>KT Rolster built a name for themselves in Korea through their strong objective control and individual laning talent. If their lanes went poorly, KT relied on their star junglers inSec and KaKAO to bail them out. Unfortunately for KT, their strategy faltered in the wake of inSec and KaKAO leaving to join teams in the LPL.</p>\n\n<p>After years of playing second fiddle to SK telecom T1, KT Rolster knocked their rivals out of the 2016 LCK Summer Playoffs. However, KT lost to ROX in a closely contested LCK Finals match, forcing them to play in the Regional Qualifier, where they were knocked out by Samsung Galaxy. Entering 2017 with a rebuilt roster packed with star power, they'll be sure to compete for the top spot in the LCK.</p>","fr_FR":"KT Rolster s'est fait un nom en Corée avec sa maîtrise des contrôles d'objectifs et l'habileté de ses membres sur les voies. Si la phase de voie se présentait mal, KT pouvait toujours compter sur les junglers inSec et KaKAO pour les sortir du pétrin. Malheureusement pour KT, cette stratégie est entrée dans une impasse quand inSec et KaKAO les ont quittés pour une autre équipe. Cela dit, quand une étoile est passée, une autre monte. Les espoirs de KT Rolster aux LCK reposent désormais sur les épaules des très capables ssumday, Arrow et Nagne.","pl_PL":"KT Rolster zyskało sławę w Korei dzięki swojej niezwykle skutecznej kontroli celów oraz talentowi do walki w alejach. Jeżeli gracze w alejach się nie popisali, KT polegało na swoich dżunglerach, inSecu i KaKAO, aby zaprowadzili porządek. Niestety dla KT strategia ta przestała działać w wyniku odejścia inSeca i KaKAO, którzy dołączyli do drużyn w LPL. Jednakże gdy jedna gwiazda znika, na jej miejscu pojawia się nowa. Marzenia KT Rolster o LCK spoczywają teraz w rękach ssumdaya, Arrowa i Nagne.","de_DE":"KT Rolster haben sich in Korea einen Namen durch ihre starke Objective-Kontrolle und individuellem Talent gemacht. Ssumday ist der Superstar-Top-Laner in Korea und lässt nicht mehr los, sobald er sich einen Vorteil verschaffen kann. Die ersten Minuten der Spiele mit KT zeichnen sich stets durch den immensen Druck des Jungle/Support-Duos aus. Es ist zu erwarten, dass der gegnerische Jungler bei ihrem Anblick in Angstschweiß ausbricht, wenn er nicht weiß, sein Territorium zu verteidigen.","es_ES":"KT Rolster se ha ganado una reputación en Corea por méritos propios gracias a un control férreo de sus objetivos y el talento de sus jugadores. Si en las calles la cosa no iba bien ahí estaba su jungla estrella para solucionar la partida, primero inSec y luego KaKAO. Desafortunadamente para KT, su estrategia falló cuando tanto inSec primero como KaKAO después abandonaron Corea para probar suerte en la LPL china. Pero cuando una estrella se va, otra se alza. Los sueños de KT Rolster residen ahora en ssumday, Arrow y Picaboo, que harán todo lo posible por llevar a su equipo a lo más alto.","pt_BR":"A KT Rolster construiu seu nome na Coreia com um estilo de jogo baseado em forte controle de objetivos e muito talento individual nas rotas. Se eles perdessem na rota, podiam confiar nos caçadores inSec e KaKAO para salvar o dia. Infelizmente, ambos deixaram o time para ir jogar na LPL. Mas quando uma estrela se apaga, outra surge no lugar. Os sonhos da KT agora estão depositados em Ssumday, Arrow e Piccaboo.\n","ko_KR":"<p>KT Rolster는 강력한 오브젝트 관리와 라인전 경기력으로 유명세를 탔습니다. 라인전에서 적팀에 밀리게 돼도 스타 정글러 inSec 선수와 KaKAO 선수가 팀을 승리로 이끌어주었죠. 하지만 두 정글러가 LPL에 진출하며 팀을 떠나자 팀 전략에 구멍이 났습니다. 하지만 별이 떠난 자리에는 다른 별이 뜨기 마련. 이제 KT Rolster는 ssumday 선수와 Arrow 선수를 선두에 내세워 전장에 나서고 있습니다.</p>"},"foreignIds":{"drupalId":"642"},"players":[69,72,304,749,769,2050],"starters":[69,72,304,749,769],"subs":[2050]}],"players":[{"id":46,"slug":"faker","name":"Faker","firstName":"Sanghyeok","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/faker-euaqlz0c.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2017-07-06T14:24:48.000Z","bios":{"en_US":"<p>Sanghyeok \"Faker\" Lee is an icon of modern esports. Known as “The Demon King” in his homeland of South Korea, Faker’s quiet and respectful demeanor in person does little to alert bystanders to his dominance on the Rift. But then he steps onto the stage and shatters the limits of what we thought was possible with just a mouse and a keyboard. Faker was so untouchable in Korea for so long that his opponents started saying he had a 3rd Summoner Spell -- how else could he be so strong?</p>\n\n<p>Faker has already raised the bar for what a mid laner is expected to deliver, lifting the Summoner's Cup at three World Championships, once in 2013, again in 2015, and the third time in 2016. He has also netted his team trophies at Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016, and the 2016 Mid-Season Invitational (whew). After winning every international event that League of Legends offered in 2016, Faker and SKT are looking to sweep the international stage once again in 2017.</p>","fr_FR":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pl_PL":"Sanghyeok „Faker” Lee jest ikoną nowoczesnego e-sportu. Znany w swojej ojczystej Korei Południowej jako „Demoniczny Król”, Faker sprawia wrażenie osoby spokojnej i uprzejmej. Nic nie zdradza tego, że potrafi absolutnie dominować na Rifcie. A potem wchodzi na scenę i przekracza granice wszystkiego, co wydawało się możliwe do osiągnięcia za pomocą zwykłej myszy i klawiatury. Faker był w Korei niepokonany od tak dawna, że przeciwnicy zaczęli posądzać go o stosowanie trzeciego czaru przywoływacza — jak inaczej mógłby być tak silny?\n\nFaker znacznie podniósł poprzeczkę oczekiwań wobec zawodnika środkowej alei, trzykrotnie zdobywając Puchar Przywoływacza na Mistrzostwach Świata — po raz pierwszy w 2013 roku, potem w 2015 roku, a po raz trzeci w 2016 roku. Zdobył także trofea dla swojej drużyny podczas Champions Summer 2013, Champions Winter 2013−2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 i Mid-Season Invitational 2016 (uff!). Po wygraniu każdego międzynarodowego turnieju, jaki League of Legends oferowało w 2016 roku, Faker i SKT zamierzają zabrać do domu kolejny międzynarodowy tytuł zdobyty na Mid-Season Invitational 2017.\n","de_DE":"Sanghyeok „Faker“ Lee ist eine Ikone des modernen E-Sports. In seinem Heimatland Südkorea als der „Dämonenkönig“ bekannt, alarmiert sein ruhiges und stets höfliches Verhalten Zuschauende nur sehr selten über seine absolute Dominanz in der Kluft. Aber dann betritt er die Bühne und beweist uns, dass seine Fähigkeiten mit Maus und Tastatur keine Grenzen kennen. Faker war in Korea so lange unantastbar, dass seine Gegner schon glaubten, er hätte einen dritten Beschwörerzauber – wie hätte er sonst so stark sein können?\n\nFaker konnte den Beschwörerpokal bereits in den Jahren 2013, 2015 und jetzt auch 2016 in die Höhe stemmen und hat die Messlatte für Mid-Laner hoch gelegt. Außerdem sicherte er seiner Mannschaft Titel beim Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 und beim Mid-Season Invitational 2016 (uff!). Nachdem Faker 2016 jedes internationale Event, das League of Legends zu bieten hat, gewinnen konnte, wird er zusammen mit SKT versuchen, sich beim Mid-Season Invitational 2017 den nächsten internationalen Titel zu sichern.\n","es_ES":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pt_BR":"<p>Sanghyeok \"Faker\" Lee é um ícone do dos e-sports moderno. Conhecido como \"O Rei Demônio\" em sua terra natal na Coreia do Sul, sua personalidade calma e respeitosa pode acabar enganando os espectadores de plantão sobre as sua soberania no Rift. Quando ele entra no palco, ultrapassa todo os limites do que achávamos possível com apenas mouse e teclado. Faker ficou invicto na Coreia por tanto tempo que seus oponentes diziam que ele tinha um terceiro Feitiço de Invocador. Afinal como ele poderia ser tão forte?</p>\n\n<p>Faker já elevou as expectativas para jogadores do meio e já pôs as mãos em três Copas do Invocador nos Campeonatos Mundiais, uma em 2013, outra em 2015 e agora uma terceira em 2016. Ele também conseguiu outros troféus para sua equipe na Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e no Mid-Season Invitational 2016 (ufa!). Depois de vencerem todos os eventos internacionais oferecidos por League of Legends em 2016, Faker e a SKT procuram levar para casa outro título internacional no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한국에서 '마왕'이라 불리는 \"Faker\" 이상혁은 현대 e스포츠의 아이콘입니다. Faker의 조용하고 공손한 행동거지와 그가 소환사의 협곡에서 누리는 지배력을 연관짓기는 힘듭니다. 하지만 그가 전장에 들어서면 지금까지 사람들이 마우스와 키보드로 가능하다 생각했던 그 모든 한계들을 깨뜨려버리죠. 한국에서는 Faker가 너무 오랫동안 최강자의 지위를 누린 탓에 그가 세 번째 소환사 주문을 쓸 수 있는 게 아니냐는 말까지 나왔습니다. Faker는 어떻게 그렇게 강할 수 있을까요? </p>\n<p style=”font-family:”나눔고딕”;\">Faker는 미드 라이너에게 기대되는 수준을 이미 끌어올렸고, 2013년과 2015년 월드 챔피언십에서 두 번이나 소환사 컵을 거머쥐었습니다. 2013 챔피언스 서머 시즌, 2013-2014 챔피언스 윈터 시즌, 2015 챔피언스 스프링 시즌, 2015 챔피언스 서머 시즌에도 팀에게 우승컵을 안겨줬죠. 하지만 그의 경쟁력은 전혀 시들지 않은 것처럼 보입니다. Faker는 계속해서 SK Telecom T1의 다른 팀원들과 자기자신을 밀어붙여 새로운 전략을 개발하고 챔피언 풀을 넓힙니다. Faker가 리그 오브 레전드 사상 최고의 선수일까요? 아마도요. 하지만 한 가지만은 분명합니다. 그건 바로 Faker가 최초의 세계 e스포츠 슈퍼스타 중 하나로 역사에 남을 거라는 사실이죠. </p>\n","es_AR":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>","cs_CZ":"<p>Sanghyeok „Faker“ Lee je živoucí legendou moderních esportů. Při osobním setkání s ním by jen málokdo tušil, že tento tichý a uctivý mladík je vládcem Žlebu, kterému v jeho rodné Jižní Koreji přezdívají „Král démonů“. Pak ovšem vkročí na pódium a s pouhou klávesnicí a myší zboří všechny naše představy o tom, co všechno je v lidských silách. Faker byl v Koreji tak dlouho nedotknutelný, až o něm začali jeho soupeři říkat, že má k dispozici 3. vyvolávačovo kouzlo – jak jinak by mohl být tak silný?</p>\n\n<p>Faker zcela změnil standard toho, co se od středového lajnaře ve hře očekává, a třikrát pozvedl nad hlavu Vyvolávačův pohár z mistrovství světa: poprvé roku 2013, poté roku 2015 a potřetí roku 2016. Také se svým týmem získal trofeje z Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 a Mid-Season Invitational 2016 (uf). Poté, co roku 2016 vyhrál všechny mezinárodní turnaje League of Legends, se Faker zúčastní i All-Star 2016 v Barceloně jako absolutní král Žlebu. Jeho bohatá kariéra skvěle odolává zkoušce času a letošní All-Star bude dalším z mnoha úspěchů na jeho kontě. Opět je na čase, abychom byli svědky toho, jak se píše historie.</p>","el_GR":"<p>Ο Sanghyeok \"Faker\" Lee είναι ένας από τους πιο εμβληματικούς παίκτες στα σύγχρονα esports. Στην πατρίδα του, τη Νότια Κορέα, είναι γνωστός ως «Ο Βασιλιάς των Δαιμόνων», αλλά η συγκρατημένη και ευγενική συμπεριφορά δεν προδίδει καθόλου την ηγετική του παρουσία στο Φαράγγι των Επικαλεστών. Όταν όμως ανεβαίνει στη σκηνή, δεν είναι λίγες οι φορές που μας έχει αφήσει με το στόμα ανοιχτό. Απλά δεν πιστεύεις ότι γίνονται αυτά με ποντίκι και πληκτρολόγιο. Ο Faker ήταν τόσο εκτός συναγωνισμού στην Κορέα, για τόσο μεγάλο χρονικό διάστημα που οι αντίπαλοί του άρχισαν να λένε ότι είχε και 3ο Ξόρκι Επικαλεστή. Πώς αλλιώς θα μπορούσε να είναι τόσο ανίκητος;</p>\n\n<p>Ο Faker έχει ήδη θέσει ψηλά τον πήχη όσον αφορά τις προσδοκίες που μπορεί να έχει μια ομάδα από έναν παίκτη μεσαίας λωρίδας. Έχει ήδη σηκώσει το Κύπελλο του Επικαλεστή σε τρία Παγκόσμια Πρωταθλήματα, πρώτη φορά το 2013, μετά πάλι το 2015 και για τρίτη φορά το 2016. Επίσης, έχει οδηγήσει την ομάδα του στην κατάκτηση τροπαίων στα τουρνουά Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 και στο Mid-Season Invitational 2016 (ουφ!). Αφού κέρδισε όλα τα διεθνή τουρνουά του League of Legends για το 2016, ο Faker έρχεται στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη με τον αέρα του αδιαμφισβήτητου κυρίαρχου του παιχνιδιού. Η λαμπρή καριέρα του δεν δείχνει σημάδια κόπωσης και αυτό το Τουρνουά All-Star θα είναι άλλη μια επιτυχία που μπορεί να προσθέσει στο ήδη απίστευτο ενεργητικό του. Είναι έτοιμος να γράψει ιστορία, για ακόμη μια φορά.</p>\n","hu_HU":"Sanghyeok „Faker” Lee a modern e-sport egyik ikonja. A szülőhazájában, Dél-Koreában „Démonkirályként” emlegetett Faker élőben csendes és tisztelettudó ember, de a Szurdokban egészen más arcát mutatja. Teljesen újraírta az elvárásokat azzal kapcsolatban, hogy mit lehet megtenni egy egérrel és egy billentyűzettel. Fakerrel nem bírtak el Koreában, olyannyira, hogy egyesek szerint van egy harmadik idézői varázslata. Máskülönben hogy lehetne ennyire erős?</p>\n\nFaker eleve magasabbra tette a lécet minden középső ösvényes számára, három világbajnokságon emelhette magasba az Idézők Kupáját, 2013-ban, majd 2015-ben és 2016-ban. Ezenkívül a következő trófeákat zsebelte be: Champions 2013-os nyári szakasz, Champions 2013-2014-es téli szakasz, Champions 2015-ös tavaszi szakasz, Champions 2015-ös nyári szakasz, Champions 2016-os tavaszi szakasz, és a 2016-os szezonközi meghívásos verseny (végig se lehet mondani egy levegővel). Faker 2016-ban megnyert minden League of Legends-versenyt, és Barcelonában a Szurdok egyértelmű királyaként lép a 2016-os All-Star gála színpadára. Játéktudásán nem fog az idő vasfoga, és az All-Star gálán tovább gyarapíthatja győzelmeinek hosszú sorát. Bajnoki címből sosem lehet túl sok.\n\n","it_IT":"Sanghyeok \"Faker\" Lee è uno dei simboli degli eSport moderni. Faker, soprannominato \"Re demone\" nella sua natia Corea del Sud, ha un carattere taciturno e rispettoso che non fa minimamente trasparire la sua immensa abilità. Tuttavia, non appena sale sul palcoscenico è in grado di fare letteralmente l'impossibile con un mouse e una tastiera. Faker è rimasto imbattuto per così tanto tempo in Corea che i suoi avversari hanno iniziato a sospettare che avesse accesso a un terzo incantesimo dell'evocatore: come spiegare altrimenti la sua abilità?</p>\n\nFaker ha già scritto una nuova pagina nella storia dei centrali alzando la Coppa degli evocatori per ben tre volte, nel 2013, nel 2015 e poi nel 2016. Si è anche portato a casa parecchi trofei di squadra: Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e il Mid-Season Invitational 2016 (wow!). Dopo aver vinto tutti gli eventi internazionali organizzati da League of Legends nel 2016, Faker sale sul palco dell'All-Star 2016 a Barcellona come re indiscusso della Landa. La sua incredibile carriera resiste a ogni assalto del tempo e questo All-Star rappresenterà un'ulteriore voce da aggiungere alla sua impressionante lista di successi. Stiamo per assistere a un evento storico... di nuovo.\n","ru_RU":"","ro_RO":"Sanghyeok ''Faker'' Lee a devenit reprezentantul competiției de top în lumea eSports. În Coreea de Sud, acolo unde locuiește, este cunoscut ca ''Regele Demon'', iar atitudinea lui tăcută și respectuoasă când e întâlnit pe viu nu-i trădează deloc dominanța în Rift. Dar apoi, urcă pe scenă și distruge orice așteptare pe care am putea s-o avem de la cineva cu un mouse și o tastatură. Faker e atât de intangibil în Coreea de atât de multă vreme încât adversarii lui au început să spună că ar avea o a treia vrajă de invocator – cum altcumva ar putea fi atât de puternic?\n</p>\nFaker a ridicat deja standardele pentru jucătorii de pe culoarul de mijloc, ridicând Cupa Invocatorului la trei Campionate Mondiale, unul în 2013, altul în 2015, iar cel mai recent, în 2016. A reușit să obțină trofee pentru echipa lui și la Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 și Mid-Season Invitational 2016. După ce a câștigat toate evenimentele internaționale posibile de League of Legends din 2016, Faker vine pe scena All-Star Event 2016 din Barcelona ca rege necontestat al Riftului. Cariera sa impresionantă nu e deloc afectată de trecerea timpului, iar acest All-Star Event va putea fi o altă reușită pe care s-o adauge în palmaresul său deja terifiant. E momentul să asistăm din nou la scrierea istoriei.\n","es_MX":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>"},"foreignIds":{"drupalId":"692","ESPORTSTMNT06":"200000357","TRLH1":"200000410","TRLH2":"200000310","TRLT3":"200000208"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":69,"slug":"mata","name":"Mata","firstName":"Sehyoung","lastName":"Cho","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mata-7wmee6cg.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-06T14:11:34.000Z","bios":{"en_US":"<p>Sehyoung \"Mata\" Cho is one of the few League players who hardly needs an introduction. Mata is not just a World Champion, but the MVP of the series that won Samsung White the 2014 world title and Summoner's Cup. He’s one of the most well known Thresh players in the world, and his tactical mind is legendary.</p>\n\n<p>On the Rift, Mata is an invaluable addition to Royal Never Give Up, and has achieved an incredible synergy with his hot-headed, wildly-aggressive ADC partner Uzi. Unfortunately, his stellar play wasn’t enough to carve out a win against the eventual World champions, SK Telecom T1. Mata will have a chance to flash hook his way to some redemption in 2017.</p>","es_AR":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","fr_FR":"<p>Se-hyeong « Mata » Cho est l'un des rares joueurs de League of Legends qu'on ne présente plus. Mata n'est pas seulement champion du monde, il est aussi le MVP de la série qui a valu à Samsung White le titre de championne du monde 2014 et la Coupe de l'invocateur. Il est l'un des joueurs de Thresh les plus connus au monde, et son esprit tactique est légendaire.</p>\n\n<p>Sur la Faille, Mata est un ajout de taille pour Royal Never Give Up, et il a établi une synergie extraordinaire avec Uzi, son partenaire ADC impétueux et agressif. Malheureusement, son jeu exemplaire n'a pas suffi à vaincre les futurs champions du monde de SK Telecom T1. Mata trouvera peut-être la rédemption à coups de Saut éclair et de Grappin grâce à sa nomination à l'événement All-Stars 2016 de Barcelone. Accompagné de son partenaire de voie Uzi, la plus grande contribution de Mata se jouera dans sa façon de superviser le champ de bataille de la Faille de l'invocateur. Avec le commandant Mata à la barre, le vaisseau All-Stars de la Chine a une chance de se maintenir à flot, même si les probabilités ne jouent pas en leur faveur.</p>","es_ES":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de League que casi no necesita una presentación. No solo es un campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White ganase el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia increíble con su impulsivo e increíblemente agresivo ADC, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de calle Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","de_DE":"<p>Se-hyeong „Mata“ Cho gehört zu den wenigen League-Spielern, die man nicht groß vorstellen muss. Mata ist nicht nur ein Weltmeister, er wurde auch noch zum wertvollsten Spieler gewählt, als Samsung White 2014 Weltmeister wurde und den Beschwörerpokal gewann. Er ist einer der bekanntesten Thresh-Spieler der Welt und seine Taktiken sind legendär.</p>\n\n<p>In der Kluft ist Mata für Royal Never Give Up unbezahlbar und harmoniert unglaublich gut mit seinem hitzköpfigen, extrem aggressiven AD-Carry-Partner Uzi. Leider reichte seine überragende Leistung nicht, um die späteren Weltmeister, SK Telecom T1, zu besiegen. Doch Mata hat genug Stimmen bekommen, um am All-Stars-Event 2016 in Barcelona teilzunehmen, wo er die Chance auf Wiedergutmachung bekommt. Zusammen mit seinem Lane-Partner Uzi wird Matas größter Beitrag seine Übersicht in der Kluft der Beschwörer sein. Wenn Mata das Kommando übernimmt, stehen die Chancen gut, dass Chinas All-Stars-Schiff nicht kentern wird, selbst wenn alles gegen sie sprechen sollte.</p>","pl_PL":"Sehyeong „Mata” Cho jest jednym z kilku zawodników League of Legend, których nie trzeba przedstawiać. Mata to nie tylko mistrz świata — był także najlepszym zawodnikiem serii, podczas której zdobył dla Samsung White mistrzostwo i Puchar Przywoływacza w 2014 roku. To jeden z najlepiej znanych na świecie zawodników grających Threshem, a jego taktyczny umysł jest legendarny.</p>\n\nNa Summoner’s Rift Mata stanowi bezcenne uzupełnienie Royal Never Give Up i osiągnął niebywałe zgranie ze swoim porywczym, szaleńczo agresywnym prowadzącym partnerem, Uzim. Niestety jego znakomita gra nie wystarczyła, by zdobyć zwycięstwo przeciwko ostatecznym Mistrzom Świata, SK Telecom T1. Mata będzie miał okazję wyhaczyć swoje odkupienie dzięki nominacji do gry na wydarzeniu All-Star 2016 w Barcelonie. Mając za sobą kolegę z alei, Uziego, największą odpowiedzialnością Maty będzie nadzorowanie przebiegu walki na polu bitwy Summoner’s Rift. Gdy u steru stoi kapitan Mata, chiński okręt na All-Star zawsze będzie miał szanse utrzymać się na powierzchni, nawet w niesprzyjających okolicznościach.\n","pt_BR":"<p>Sehyeong \"Mata\" Cho é um dos poucos jogadores do League que nem precisa de apresentações. Mata não é apenas um Campeão Mundial. Ele é o MVP da série que deu o Campeonato à Samsung White. Ele é um dos jogadores de Thresh mais conhecidos do mundo e seu raciocínio tático é lendário.</p>\n\n<p>Mata é uma adição inestimável para a Royal Never Give Up e alcançou uma incrível sinergia com seu parceiro cabeça-quente e altamente agressivo, o atirador Uzi. Infelizmente, sua mecânica incrível não foi suficiente para arrancar uma vitória contra a campeã do Mundial, a SK Telecom T1. Mata terá uma chance de dar aquele Flash com gancho e agarrar sua redenção após ser eleito para participar do Evento All-Star 2016 em Barcelona. Com Uzi também eleito, a maior contribuição de Mata será em como ele cuida do campo de batalha que é Summoner’s Rift. Com o comandante Mata no manche, o navio All-Star da China tem uma chance de continuar navegando, mesmo se a sorte estiver contra eles.</p>","cs_CZ":"<p>Sehyeong „Mata“ Cho je jedním z mála hráčů League of Legends, kteří nepotřebují žádné zdlouhavé představování. Mata není jen mistr světa, ale také držitel ocenění pro nejužitečnějšího hráče za sérii, ve které Samsung White v roce 2014 vyhrál MS a Vyvolávačův pohár. Je jedním z nejslavnějších hráčů Threshe na světě a o jeho taktických dovednostech se vyprávějí legendy.</p>\n\n<p>Ve Žlebu je Mata nedocenitelnou oporou týmu Royal Never Give Up, s jehož horkokrevným a divoce agresivním ADC Uzim si vybudoval neuvěřitelně dokonalou synergii. Bohužel ani jeho hvězdné výkony nestačily na překonání SK Telecom T1, kteří nakonec letošní mistrovství světa vyhráli. Mata bude mít ještě šanci se se svým hákem pomstít, jelikož byl nominován na turnaj All-Star 2016 v Barceloně. S lajnovým parťákem Uzim v závěsu bude největším Matovým příspěvkem to, jak si dokáže udržovat přehled o celkovém dění na bojišti. Když bude mít na All-Star čínská loď u kormidla kapitána Matu, bude šanci udržet se na vodě, i když nepatří mezi favority.</p>","el_GR":"<p>Ο Sehyeong \"Mata\" Cho ανήκει στην ελίτ των παικτών του League που δεν χρειάζονται συστάσεις. Ο Mata δεν είναι μόνο Παγκόσμιος Πρωταθλητής, αλλά και ο MVP των αγώνων με τους οποίους οι Samsung White κατάκτησαν το Παγκόσμιο Πρωτάθλημα 2014 και το Κύπελλο Επικαλεστή. Είναι ένας από τους πιο διάσημους παίκτες του Θρες στον κόσμο και φημίζεται για τη στρατηγική του σκέψη.</p>\n\n<p>Σε αγωνιστικό επίπεδο, ο Mata είναι μια πολύτιμη προσθήκη στους Royal Never Give Up και έχει καταφέρει να συντονιστεί τέλεια με τον θερμόαιμο και εξαιρετικά επιθετικό ADC της ομάδας, τον Uzi. Δυστυχώς, η καταπληκτική του εμφάνιση δεν ήταν αρκετή για να δώσει τη νίκη στην ομάδα του στον αγώνα με τους SK Telecom T1 που στη συνέχεια θα έπαιρναν το Παγκόσμιο Πρωτάθλημα. Ο Mata θα έχει πάλι μια ευκαιρία να δείξει τι αξίζει, αφού επιλέχθηκε για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Ήδη γυαλίζει το φανάρι και το Φλας του. Μαζί με τον Uzi, τον συμπαίκτη του στη λωρίδα, ο Mata θα είναι ακόμη πιο πολύτιμος στην ομάδα του επειδή γνωρίζει καλύτερα από τον καθένα τη στρατηγική που απαιτεί το Φαράγγι των Επικαλεστών. Με καπετάνιο τον Mata, το πλήρωμα της Κίνας που θα ταξιδέψει στο All-Star έχει καλές πιθανότητες να μην ναυαγήσει, παρόλο που τα στατιστικά δεν είναι με το μέρος του.</p>","hu_HU":"Sehyeong „Mata” Cho a kevés LoL-játékos egyike, aki nem igazán szorul bemutatásra. Mata nem csupán világbajnok, hanem MVP volt egy olyan versenyen, ahol a Samsung White 2014-ben világbajnok lett, és elnyerte az Idézők Kupáját. A világ egyik legismertebb Thresh-játékosának taktikai érzéke legendás.</p>\n\nA Szurdokban Mata a Royal Never Give Up csodafegyvere, és meglepően jól működik együtt a forrófejű, rendkívül agresszív partnerével, Uzival. Sajnos az emberfeletti teljesítménye is kevés volt ahhoz, hogy megverjék a későbbi világbajnok SK Telecom T1-t. Mata most visszavághat, mert beszavazták őt a 2016-os All-Star gála játékosai közé. Állandó társa, Uzi is vele tart, így Mata stratégiai gondolkodása is jobban érvényesülhet az Idézők szurdokában. Mata parancsnokkal a hídon Kína All-Star-hajója akkor sem fog felborulni, ha az esélyek nem nekik kedveznek.\n","it_IT":"Sehyeong \"Mata\" Cho è uno dei pochi giocatori di LoL a non aver bisogno di presentazioni. Mata non è semplicemente un campione del mondo, ma anche il MVP della serie che ha visto i Samsung White conquistare i Mondiali 2014 e la Coppa degli evocatori. È uno dei più celebri giocatori di Thresh al mondo e la sua abilità tattica è leggendaria.</p>\n\nIn Landa, è una risorsa insostituibile dei Royal Never Give Up, tra i quali ha costruito un'incredibile sinergia con il suo aggressivo compagno ADC Uzi. Purtroppo le sue giocate stellari non sono bastate a strappare una vittoria contro i futuri campioni del mondo, gli SK Telecom T1. Mata avrà la possibilità di rifarsi e \"agganciare\" la vittoria all'All-Star 2016 di Barcellona. In compagnia del suo compagno di corsia Uzi, Mata potrebbe contribuire al successo della squadra soprattutto grazie alla sua visione del campo di battaglia. Con il comandante Mata al timone, la squadra cinese avrà sempre una possibilità di rimanere a galla, anche quando sembra che non ci sia via di scampo.\n","ro_RO":"Sehyeong ''Mata'' Cho este unul dintre puținii jucători de LoL care nu mai au nevoie de vreo prezentare. Mata nu este doar Campion Mondial, ci și MVP-ul Campionatului Mondial în care Samsung White a câștigat Cupa Invocatorului în 2014. Este unul dintre cei mai cunoscuți jucători de Thresh din lume, iar manevrele sale tactice sunt legendare.</p>\n\nÎn Rift, Mata este o piesă inestimabilă a echipei Royal Never Give Up și a dezvoltat o sinergie incredibilă cu partenerul său ADC temperamental și foarte agresiv, Uzi. Din păcate, manevrele sale uimitoare nu au fost de ajuns pentru a obține o victorie în fața viitorilor campioni mondiali, SK Telecom T1. Acum că a fost nominalizat să joace la evenimentul All-Star 2016 din Barcelona, Mata va avea ocazia să-și ia revanșa. Avându-l alături de colegul său de culoar, Uzi, cea mai importantă contribuție a lui Mata va fi controlul asupra câmpului de luptă. Cu comandantul Mata la cârmă, vasul All-Star al Chinei se va putea menține la suprafață chiar și atunci când șansele nu sunt favorabile.\n","es_MX":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>"},"foreignIds":{"drupalId":"682","ESPORTSTMNT06":"200000344","TRLT3":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":72,"slug":"pawn","name":"Pawn","firstName":"Wonseok","lastName":"Heo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pawn-bwchpx6p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:29.000Z","updatedAt":"2017-07-06T14:11:08.000Z","bios":{"en_US":"<p>\nWonseok “Pawn\" Heo is one of the best known mid laners in the world, with a career dating back to 2013. Pawn is a battle hardened veteran, with some truly impressive games under his belt. Pawn shocked the world when he solo killed Faker in the 2013 WCG Qualifiers, and he hasn’t stopped since. From there, he found himself on Samsung White during one of the most competitive and closely-matched periods in Korea’s history.\n</p>\n<p>\nSSW turned in a dominant performance during the 2014 World Championship, taking the cup home in almost unrivaled fashion. However, the team disintegrated in the aftermath of their success, and Pawn joined Edward Gaming at the end of 2014. Now rejoining the LCK, he'll once again take on Faker in the mid lane.\n</p>","fr_FR":"<p>Won-seok « PawN » Heo est l'un des meilleurs mid laners du monde. Point. Au nombre de ses trophées, on retrouve les play-offs des LPL, le Mid-Season Invitational et le Championnat du monde de League of Legends. Il a également battu Faker et SKT à de nombreuses occasions, notamment lors de la finale du MSI 2015. Et malgré son surnom (qui signifie « pion » en anglais), PawN nous rappelle plutôt une reine, capable de se déplacer où elle veut et semant la destruction dans les rangs ennemis.</p>\n<p>\nPawN a été recruté par Edward Gaming fin 2014, quand toute une vague de vedettes coréennes a migré vers les LPL. PawN a aidé à propulser EDG jusqu'à la 1re place de la Demacia Cup Spring Season 2015 et des play-offs printaniers des LPL 2015. Mais PawN sait que la route est encore longue. « Je trouve que Samsung White était une équipe parfaite », dit PawN, et EDG a encore beaucoup de travail à faire pour parvenir à ce niveau de performance. En attendant, PawN continuera à semer la peur chez ses adversaires chaque fois qu'il arrivera dans la Faille.\n</p>","pl_PL":"<p>\nHeo „PawN” Won-seok jest jednym z najlepszych graczy w środkowej alei na całym świecie. Czemu? Cóż, wygrał parę „drobnych” turniejów, takich jak choćby rozgrywki play-off LPL, turniej Mid-Season InvitationaL i mistrzostwa świata w League of Legends. Wielokrotnie też pokonywał Fakera i SKT – także podczas finałów 2015 MSI. Choć jego ksywka oznacza „pionek”, jego styl gry może bardziej kojarzyć się z królową, która porusza się po planszy w dowolnym kierunku, niszcząc każdego napotkanego przeciwnika.\n</p>\n<p>\nPawN został zwerbowany przez Edward Gaming pod koniec 2014 r. Był jedną z wielu koreańskich gwiazd, które przeszły do LPL. Pomógł EDG wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek play-off 2015 LPL. Pawn wie jednak, że przed nim trudne zadanie. „Wydaje mi się, że Samsung White było drużyną idealną” przyznaje PawN, a EDG czeka dużo pracy, jeżeli zamierzają osiągnąć podobny poziom. W międzyczasie PawN nadal będzie siał postrach w sercach wrogów za każdym razem, gdy wkroczy na Rift.\n</p>","de_DE":"<p>Won-seok „PawN“ Heo, dessen Karriere 2013 begann, ist einer der bekanntesten Mid-Laner der Welt. Obwohl PawN erst 19 Jahre alt ist, ist er bereits ein abgehärteter Veteran, der schon ein paar wirklich beeindruckende Spiele abgeliefert hat. PawN schockierte die Welt, als er Faker bei der Qualifikationsrunde für das WCG 2013 alleine besiegte, und hat seither nicht mehr nachgelassen. Kurz darauf wechselte er in einer der umkämpftesten und knappsten Phasen in Koreas Geschichte zu Samsung White.</p>\n\n<p>SSW lieferte bei der Weltmeisterschaft 2014 eine dominante Leistung ab und konnte sich den Titel beinahe widerstandslos sichern. Nach dem Erfolg brach die Mannschaft jedoch auseinander und PawN wechselte Ende 2014 zu Edward Gaming. Seither hat er EDG zu ein paar ihrer dominantesten Siege geführt. Doch der junge Spieler hat immer wieder mit Krankheiten zu kämpfen. Aber trotz dieser Rückschläge ist er immer noch ein Teil der Mannschaft und fest entschlossen, ihr zu dienen.</p>","es_ES":"<p>Won-seok \"PawN\" Heo es uno de los jugadores de la calle central más conocidos del mundo, con una carrera que data del año 2013. A pesar de tener solo 19 años, PawN es un veterano curtido en batalla que tiene en su haber unas partidas increíbles. Sorprendió a todo el mundo cuando acabó él solo con Faker en el clasificatorio del WCG 2013 y no ha parado desde entonces. Desde aquel momento, se encontraba en Samsung White durante uno de los periodos más competitivos y reñidos en la historia de Corea.</p>\n\n<p>SSW hizo gala de una actuación dominante durante el Campeonato Mundial 2014, hasta el punto de llevarse a casa el trofeo sin que casi nadie les plantase cara. No obstante, el equipo se deshizo como resultado de su éxito y PawN se unió a Edward Gaming a finales de 2014. Desde entonces, ha liderado a EDG en algunas de sus victorias más aplastantes. Aunque el joven jugador ha tenido que enfrentarse a alguna enfermedad. Y, a pesar de esto, sigue en el equipo, dispuesto a actuar.</p>","pt_BR":"<p>Won-seok “PawN” Heo é um dos jogadores do meio mais conhecidos do mundo, com uma carreira iniciada em 2013. Apesar de ter apenas 19 anos, PawN é um veterano experiente na batalha e tem alguns jogos realmente impressionantes no currículo. PawN chocou o mundo quando abateu Faker sozinho nas Classificatórias da WCG 2013 e desde então não parou mais. A partir dali, entrou para a Samsung White durante um dos períodos mais competitivos e disputados na história da Coreia.</p>\n\n<p>A SSW teve uma atuação dominante durante o Campeonato Mundial 2014 e levou a copa para casa de maneira incontestável. No entanto, a equipe se desfez em resultado a todo esse sucesso e PawN foi para a Edward Gaming no final de 2014. Desde então, ele liderou a EDG em algumas de suas vitórias mais sólidas. Porém, o jovem jogador está lutando contra uma doença. Mas apesar das adversidades, ele ainda está na equipe e está determinado a contribuir.</p>","es_AR":"<p>Won-seok “PawN” Heo es uno de los mejores carrileros centrales del mundo, con una carrera que se inició en el 2013. Con tan solo 19 años, PawN es un veterano endurecido por los enfrentamientos, con partidas realmente impresionantes bajo la manga. PawN deslumbró al mundo cuando derrotó a Faker en WCG 2013 y no para desde entonces. A partir de allí, se encontró en Samsung White durante uno de los juegos más competitivos y cerrados en la historia de Corea.</p>\n\n<p>SSW logró un desempeño deslumbrante durante el Campeonato Mundial 2015 y se llevó la copa a casa de una manera inigualable. Sin embargo, el equipo se desintegró después de todo este éxito y PawN se unió a Edward Gaming a finales del 2014. Desde entonces, condujo a EDG a algunas de las victorias más contundentes. Lamentablemente, el joven jugador tiene que hacer frente a una enfermedad. A pesar de esta adversidad, sigue formando parte del equipo y está determinado a seguir adelante.</p>"},"foreignIds":{"drupalId":"983","ESPORTSTMNT06":"200000342","TRLT3":"200000214"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":304,"slug":"deft","name":"Deft","firstName":"Hyeokgyu","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deft-4s8iwywa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-07-06T14:18:47.000Z","bios":{"en_US":"<p>\nThere are many ways to introduce Hyeokgyu “Deft” Kim: Ezreal fanatic, world class AD carry, veteran, hypercarry... Deft has been playing since 2013, earning accolades as a player who could pump out absurd amounts of damage thanks to his ability to duck, dodge, and weave through teamfights.\n</p>\n<p>\nAfter the 2014 World Championship, Deft joined up with Edward Gaming, beginning an era of dominance where the team picked up a series of convincing victories. It started with the 2015 Demacia Cup Spring, and then continued into the 2015 LPL Spring Split, where EDG only dropped six games in total. From there, EDG picked up the top prize at the 2015 Mid-Season Invitational, winning a thrilling Bo5 series against SKTelecom T1, 3-2. Yet through it all, something has eluded Deft...he has yet to take home the greatest prize of all: the World Championship.\n</p>","fr_FR":"<p>Hyuk-kyu « Deft » Kim est réputé pour être l'un des carrys AD les plus agressifs du monde, ce qui nous change de ses débuts professionnels chez Samsung Blue, où il avait plus tendance à fuir un combat qu'à tenter l'affrontement. Mais depuis qu'il a rejoint les LPL, Deft tend à repousser les limites de ses champions (pour ne pas dire qu'il les dépasse de temps en temps). De façon générale, Deft fait preuve de force et de confiance dès qu'il arrive sur la Faille.</p>\n\n<p>Par contraste, Deft, en personne, est plutôt discret, voire effacé. Il suit souvent ses coéquipiers dans la maison d'EDG, ne sachant visiblement pas trop quoi faire par lui-même. Peut-être espère-t-il que la voix douce de Meiko, son partenaire sur la voie du bas, le ramènera à bon port.</p>","pl_PL":"<p>Hyuk-kyu „Deft” Kim uważany jest powszechnie za jednego z najagresywniejszych prowadzących na świecie. Wiele się zmieniło, odkąd zaczynał karierę w Samsung Blue. Wówczas prędzej był gotów uciekać niż nawiązać walkę z przeciwnikiem. Odkąd jednak Deft przeniósł się do LPL, coraz częściej zdarza mu się w pełni wykorzystywać zalety swoich bohaterów (a także podejmować ryzykowne decyzje). Ilekroć Deft wyrusza na Rift, wykazuje się siłą i pewnością siebie.</p>\n\n<p>Z kolei w życiu prywatnym jest osobą cichą, wręcz potulną. Często zdarza mu się chodzić po domu drużynowym za pozostałymi członkami EDG, jakby nie wiedział, co robić, gdy zostaje sam. Być może wyczekuje kojącego głosu Meiko, partnera z dolnej alejki.</p>","de_DE":"<p>Man kann Hyuk-kyu „Deft“ Kim auf viele Arten vorstellen: Als Ezreal-Freak, als Weltklasse-AD-Carry, als Veteran, als Hypercarry … Deft spielt schon seit 2013 und hat als Spieler, der dank seiner schnellen Reflexe in Teamkämpfen unglaublichen Schaden austeilen kann, einige Auszeichnungen gewonnen.\nNach der Weltmeisterschaft 2014 wechselte Deft zu Edward Gaming und leitete damit eine Ära ein, in der die Mannschaft im Frühjahr beim Demacia Cup 2015 und kurz darauf beim Frühjahrs-Split der LPL 2015 einen überzeugenden Sieg nach dem anderen feierte und insgesamt nur sechs Spiele verlor. Danach gewann EDG das spannende Finale des Mid-Season Invitational 2015 gegen SKTelecom T1 mit 3–2. Deft war schon bei vielen internationalen Turnieren, aber eines fehlt ihm immer noch: der Weltmeistertitel. Deft hat bewiesen, dass er immer alles tut, um sein Ziel zu töten. Während sich EDG auf die Weltmeisterschaft vorbereitet, müssen sich die anderen Mannschaften vor seinem beweglichen und riskanten, aber lohnenden Spielstil in Acht nehmen. Eines ist jedenfalls sicher: Solange Deft in der Kluft ist, darf man EDG niemals abschreiben.</p>","es_ES":"<p>Hay muchas maneras de presentar a Hyuk-kyu \"Deft\" Kim: fanático de Ezreal, AD carry de talla mundial, veterano, hypercarry... Deft lleva jugando desde 2013 y ha conseguido elogios como jugador capaz de infligir cantidades ingentes de daño gracias a su capacidad de eludir, esquivar y moverse en los combates de equipo.</p>\n\n<p>Después del Campeonato Mundial 2014, Deft se unió a Edward Gaming, lo que dio comienzo a una era de dominio en la que el equipo se hizo con una serie de victorias convincentes en la 2015 Demacia Cup Spring y en la fase de primavera de la LPL de 2015, donde solo perdieron seis partidas. Después EDG consiguió subir a lo más alto del MSI 2015, tras una emocionante victoria por 3 a 2 en una serie al mejor de 5 contra SK Telecom T1. </p>\n\n<p>Deft ha participado en muchos torneos internacionales, pero todavía le falta por llevarse a casa el mayor premio de todos: el título del Campeonato Mundial. Ha demostrado que cuando tiene un asesinato a la vista, hará todo lo que haga falta para conseguirlo. Con EDG en el Mundial, los rivales tendrán que tener cuidado con su estilo de juego de gran movilidad, gran riesgo y gran recompensa. Una cosa está clara: mientras Deft esté en la Grieta, no se puede dar a EDG por muerto.</p>","pt_BR":"<p>Podemos apresentar Hyuk-kyu “Deft” Kim de várias formas: Fanático por Ezreal, atirador de nível internacional, veterano, hipercarregador... Deft joga desde 2013 e é tido como um jogador que consegue causar quantidades absurdas de dano graças a sua habilidade de se esconder, desviar e driblar em confrontos de equipe.</p>\n<p>Depois do Campeonato Mundial 2014, Deft entrou para a Edward Gaming, iniciando uma era de domínio em que a equipe conquistou uma série de vitórias convincentes na Etapa de Primavera da Demacia Cup 2015 e depois a Série de Primavera da LPL 2015, onde a EDG só perdeu seis jogos no total. Depois disso, a EDG levou o primeiro lugar no MSI 2015, ganhando uma série de melhor de cinco contra a SKTelecom T1 por 3 a 2. Deft já participou de inúmeros torneios internacionais, mas ainda não levou para casa o grande prêmio: o Campeonato Mundial. Mas já demonstrou que quando coloca uma presa na mira, ele faz de tudo para abatê-la. Com a EDG no Mundial, os oponentes precisarão tomar cuidado com seu estilo de jogo de alta mobilidade, alto risco e alta recompensa. Uma coisa é certa: enquanto Deft continuar no Rift, a EDG continua na parada.</p>","es_AR":"<p>Existen muchas maneras de presentar a Hyuk-kyu “Deft” Kim: fanático de Ezreal, ADC de primera categoría, veterano, hiperacarreador... Deft no deja de jugar desde el 2013, consagrándose como un jugador capaz de infligir absurdas cantidades de daño gracias a su habilidad para agacharse, esquivar y eludir peleas en equipo.</p>\n\n<p>Después del Campeonato Mundial 2015, Deft se unió a Edward Gaming y comenzó una era de dominio en la que el equipo consiguió una serie de victorias en la Copa de Verano de Demacia 2015 y luego en la Serie de Primavera de LPL 2015, donde EDG solo perdió seis partidas en total. Después, EDG consiguió el primer premio en el Torneo por Invitación de Mitad de Temporada 2015, ganando por 3-2, una increíble serie al mejor de 5 contra SKTelecom T1. Deft participó en un montón de torneos internacionales, pero aún le falta llevarse a casa el premio más importante de todos: el Campeonato Mundial. Deft demostró que consigue lo que se propone y hará todo lo que esté a su alcance para lograrlo. Cuando EDG llegue al Mundial, los oponentes tendrán que cuidarse de su estilo de juego sumamente ágil, de alto riesgo y altura. Una cosa es segura: siempre que Deft esté parado en la Grieta, no podrás contra EDG.</p>"},"foreignIds":{"drupalId":"985","ESPORTSTMNT06":"200000343","TRLT3":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":327,"slug":"huni","name":"Huni","firstName":"Seung-hoon","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huni-3vra4c68.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-07-06T14:21:58.000Z","bios":{"en_US":"<p>\nSeung-hoon “Huni” Heo proved himself a dominant force in the NA LCS. He's heading to the LCK with some hard earned wisdom under his belt and a drive to prove he can compete with the best. He may look happy and harmless, but don’t underestimate him. Give him an inch, and he’ll take a quadrakill on Riven.\n</p>\n<p>\nHuni is one of the most confident players you'll find, but it’s hidden underneath a jolly layer. While his previous goal was to defeat the three-time World Champs, he's decided that if you can't beat them, join them.\n</p>","fr_FR":"Seung-hoon « Huni » Heo a prouvé être une force dominante des LCS NA. Cette saison, il est arrivé dans la LCK avec des connaissances durement acquises et la volonté de démontrer qu'il est à la hauteur des meilleurs. Il a l'air heureux et inoffensif, mais ne le sous-estimez pas. Cédez ne serait-ce que d'un pouce et il signera un quadruplé sur Riven.\n\nHuni est l'un des joueurs les plus confiants qui soient, mais il le cache bien sous son air jovial. Son objectif précédent était de vaincre les triples champions du monde, mais il s'est finalement dit, qu'à défaut de les battre, autant les rejoindre. Le Mid-Season Invitational 2017 est sa première opportunité de remporter un événement international avec sa nouvelle équipe et, s'il y parvient, ça risque d'être le début d'une longue série.\n","pl_PL":"<p>\"Huni\" jest nowością, która zaskoczyła całą społeczność League of Legends w sezonie piątym. Zaistniał na scenie dopiero po dołączeniu do dobrze wszystkim znanego zespołu Fnatic w styczniu 2015 roku. Jego wybór był szczęśliwym trafem dla europejskiej drużyny, gdyż wcześniej był tylko partnerem sparingowym dla profesjonalnych zawodników w koreańskiej organizacji Samsung. Czarno-żółci wiele zaryzykowali przyjmując debiutanta do podstawowego składu, lecz wkrótce okazało się to strzałem w dziesiątkę. Heo Seung-hoon, swoim agresywnym stylem gry, podniósł poprzeczkę pozostałym top-lanerom w Europie. W wiosennym sezonie członkowie Fnatic wciąż się poznawali, ale i tak konkurowali o czołową pozycję w EU LCS. Ostatecznie uplasowali się na drugim miejscu, tracąc tylko dwa zwycięstwa do przodującego SK Gaming. Jednak w rozgrywkach barażowych pokazali, że to właśnie oni zasługują na szczyt podium – pokonując wszystkich przeciwników na swojej drodze. \"Huni\" wśród innych graczy wyróżnił się w tak dużym stopniu, że został nagrodzony laurem najbardziej wartościowego zawodnika. Osiągnięcia poprawił w kolejnym sezonie, ponieważ w lecie pobił światowy rekord w regularnych rozgrywkach. Przez cały ten okres nie przegrał ani jednego meczu - takiego wyczynu nawet nie da się porównywać, ponieważ jest absolutnie unikalny.</p>\n<p> \nKiedy \"Huni\" dostał się do Mistrzostw Świata 2015 był już powszechnie znany i niesłychanie popularny. Jego występ na tej imprezie tylko przysporzył mu sławy, gdyż nie zawiódł swoich fanów i wyszedł z grupy na pierwszym miejscu. Zwycięstwem z potężnym zespołem EDG w ćwierćfinale przełamał wraz z Fnatic długą passę azjatyckich drużyn. Uległ dopiero w półfinale walcząc z KOO Tigers, koreańską potęgą, jednak te osiągnięcia dla europejskich kibiców były w pełni satysfakcjonujące. Po tym wydarzeniu w wywiadzie dla Redbulla powiedział: „Po Mistrzostwach byłem trochę skołowany, bo nie wiedziałem co dalej robić. Jednocześnie chciałem zdobyć nowe doświadczenie w Ameryce.” Tak \"Huni\" tłumaczył odejście z szeregów Fnatic w listopadzie 2015 roku i dołączenie miesiąc później do nowopowstałej wtedy organizacji Immortals. Później jeszcze wspomniał, że chciałby do kolekcji swoich osiągnięć dodać pierwsze miejsce w NA LCS.</p>\n<p>\n\"Huni\" to zdecydowanie najbardziej przebojowy gracz sezonu 5. Z zupełnie nieznanego nabytku Fnatic w ciągu mniej niż roku stał się jednym z najpopularniejszych zawodników. To zasługa jego rozśmieszającego stylu bycia i braku oporu przed wygłupianiem się na oczach tysięcy widzów. W przeciwieństwie do czasu wolnego, w trakcie meczy Heo Seung-hoon to śmiertelnie poważny przeciwnik. Zasłynął z wyborów agresywnych bohaterów na top-lanie i przez to bycia trzecim carry w zespole. Postaciami, takimi jak Ekko, Riven czy Rumble, wielokrotnie dominował przeciwników i zapierał dech w piersiach wszystkich widzów.\n</p>","de_DE":"Seung-hoon „Huni“ Heo mauserte sich zu einer dominanten Macht in der NA LCS. In dieser Saison wechselte er mit jeder Menge Erfahrung in die LCK, um allen zu beweisen, dass er mit den Besten der Welt mithalten kann. Er mag glücklich und harmlos aussehen, aber man darf ihn nie unterschätzen. Wenn man ihm mit Riven zu viel Platz lässt, ist er immer für eine Vierfachtötung gut.\n\nUnter seiner fröhlichen Fassade ist Huni einer der selbstbewusstesten Spieler, die es gibt. Früher wollte er den dreimaligen Weltmeister unbedingt besiegen, doch dann dachte er sich: „Wenn ich sie nicht besiegen kann, dann schließe ich mich ihnen eben an.“ Das Mid-Season Invitational 2017 ist seine erste Chance, mit seiner neuen Mannschaft einen internationalen Titel zu gewinnen, und wenn es nach ihm geht, wird das der erste von vielen.\n","es_ES":"Seung-hoon \"Huni\" Heo ha demostrado ser una fuerza dominante en la LCS NA. Esta temporada se ha trasladado a la LCK con toda la sabiduría que ha cosechado hasta ahora y viene decidido a demostrar que es capaz de competir contra los mejores. Que no os engañe su cara alegre de no haber matado ni a una mosca. Le basta un pequeño descuido para conseguir un asesinato cuádruple con Riven.\n\nHuni es uno de los jugadores más seguros de sí mismos, pero lo esconde bajo una capa de jovialidad. Aunque su meta anterior era vencer a los tres veces campeones del mundo, ha aplicado la lógica: si no puedes vencerlos, únete a ellos. El Mid-Season Invitational 2017 es su primera oportunidad para ganar un evento internacional con su nuevo equipo. Si se sale con la suya, este será el primer título de muchos.\n","pt_BR":"<p>Seung-hoon \"Huni\" Heo se provou ser uma força dominante na LCS NA. Ele vai para a LCK nesta temporada com uma nova lição arduamente aprendida e a vontade de provar que pode competir com os melhores. Ele pode parecer feliz e inofensivo, mas não o subestimem. Deem uma chance e ele conseguirá um quadrakill em Riven.</p>\n\n<p>Huni é um dos jogadores mais confiantes que você encontrará, mas esconde isso sob uma camada de alegria. Seu objetivo anterior era derrotar os tricampeões mundiais, mas ele decidiu que se você não pode vencê-los, é melhor juntar-se a eles. O Mid-Season Invitational 2017 é sua primeira chance de ganhar um evento internacional com sua nova equipe. E, se a sua vontade se concretizar, será o primeiro de muitos.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “Huni” 허승훈은 탑 라인에서 지배적인 존재입니다. 유럽 LCS에 비교적 최근에 합류한 Huni는 2015년 Fnatic 리빌딩 프로젝트의 일환으로 팀에 입단했습니다. 그의 영향은 즉시 나타났습니다. 2015 유럽 LCS 서머 스플릿에서 Fnatic을 18승 무패 기록으로 이끌었기 때문이죠. Huni는 2015 유럽 LCS 서머 스플릿에서 Outstanding Rookie 상을 수상하기도 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">소환사의 협곡 바깥에서도 Huni의 영향력이 나타났죠. 그가 만든 감탄사 “HoloHoloHolo\"는 누구라도 빠져들 수밖에 없고, 그의 장난스러운 마이크 체킹은 전설적입니다. Huni는 겉으로는 귀여워 보일지 모르지만 게임에서는 적을 깨부수는 데 거리낌이 없죠. Huni는 그의 자신감을 한줄로 이렇게 요약했습니다. \"저희에게 대적할 라이벌은 없습니다.\" 궁금해 하실까봐 말씀드리지만 저 말은 국제 경기까지 포함시킨 겁니다. 그리고 그는 이렇게 말했죠. \"SKT와 다시 한번 싸워서 박살내고 싶어요.\" </p>\n<p style=”font-family:”나눔고딕”;\">정말 대담한 친구죠. 2015 올스타전에서 과연 그가 라이벌들을 박살낼 수 있을지 지켜봅시다. </p>\n"},"foreignIds":{"drupalId":"3675","ESPORTSTMNT06":"200000354","TRLH1":"200000408","TRLH2":"200000308","TRLT3":"200000206"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":9},{"id":403,"slug":"bang","name":"Bang","firstName":"Junsik","lastName":"Bae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bang-5ln60860.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:04.000Z","bios":{"en_US":"<p>\nJunsik \"Bang\" Bae is an incredibly dedicated AD carry. Bang committed himself to a rigorous play schedule, and has the results to prove it -- he was the first Korean player to reach 1400 Challenger points in Solo Queue. But he isn’t just getting good at Solo Queue. When SKT T1 S secured 3rd place in the 2014 Summer OGN Champions League, Bang had officially arrived on the Korean esports scene. He went on to take 1st place at the 2015 World Championship with SKT, etching his name in LoL history.\n</p>\n<p>\nHe didn’t stop there, though, and like the rest of SK telecom, he struggled through the initial growing pains of roster changes in 2016 before winning the 2016 World Championship. The team adjusted quickly to its new roster this year, dominating the LCK Spring Split and taking victory at the 2017 Mid-Season Invitational in Brazil.\n</p>","fr_FR":"Junsik « Bang » Bae est un carry AD extrêmement impliqué. Bang s'est astreint de lui-même à un programme de jeu très strict, et ses résultats sont là pour lui donner raison : il a été le premier joueur coréen à atteindre les 1400 points en Challenger en file solo. Mais il ne se contente pas de briller en file solo. Quand SKT T1 S à décroché la troisième place dans la Ligue OGN Champions Summer 2014, Bang venait d'arriver officiellement sur la scène de l'e-sport coréen. Il a enchaîné avec une première place lors du Championnat du monde 2015 avec SKT, gravant pour toujours son nom dans l'histoire de LoL.\n\nIl ne s'est pourtant pas arrêté là, et comme le reste de SK Telecom, il a souffert des changements de formation en 2016 avant de remporter le Championnat du monde 2016. Cette année, l'équipe s'est rapidement adaptée à sa nouvelle formation, dominant sans mal le segment de printemps de la LCK. Ils vont maintenant tenter d'enregistrer leur premier victoire internationale de 2017 lors du Mid-Season Invitational au Brésil.\n","pl_PL":"Junsik „Bang” Bae jest niesamowicie zaciętym prowadzącym. Bang narzucił sobie bardzo rygorystyczny harmonogram rozgrywek, czego rezultaty są widoczne — był pierwszym koreańskim zawodnikiem, który osiągnął 1400 punktów Pretendenta w kolejce solo. Ale staje się coraz lepszy nie tylko w kolejce solo. Gdy SKT T1 S zdobyli trzecie miejsce w Summer OGN Champions League 2014, Bang oficjalnie pojawił się na koreańskiej scenie e-sportowej. Zdobył wraz z SKT pierwsze miejsce na Mistrzostwach Świata 2015, zapisując swoje imię w historii LoL.\n\nJednak nie zamierzał na tym poprzestać, dlatego podobnie jak reszta SK Telecom musiał przebrnąć przez trudne zmiany w składzie w 2016 roku, zanim drużyna zwyciężyła na Mistrzostwach Świata 2016. Drużyna szybko dostosowała się do tegorocznego, nowego składu, dominując podczas wiosennego splitu LCK. Teraz będzie chciała zdobyć swoje pierwsze międzynarodowe zwycięstwo w 2017 roku na Mid-Season Invitational w Brazylii.\n","de_DE":"Junsik „Bang“ Bae ist ein unglaublich engagierter AD-Carry. Bang unterwarf sich einem sehr strikten Spielplan und hat als Folge dessen auch Resultate vorzuweisen – er war der erste koreanische Spieler, der jemals 1400 Challenger-Punkte in der Einzelwarteschlange erreicht hat. Aber natürlich ist er nicht nur als Einzelspieler überragend. Als SKT T1 sich den dritten Platz beim OGN Champions im Sommer 2014 sicherten, war Bangs Debut in der Esports-Szene offiziell. Kurz danach gewann er zusammen mit seinem Team SKT die Weltmeisterschaft 2015 und verewigte seinen Namen in der Geschichte von LoL.\n\nAber damit war noch lange nicht Schluss, und genau wie der Rest von SK Telecom hatte er zu Beginn des Jahres 2016 Probleme mit den Änderungen der Aufstellung, bevor er schließlich die Weltmeisterschaft 2016 gewann. In diesem Jahr konnte sich die Mannschaft schnell auf die neue Aufstellung einstellen und den Frühjahrs-Split der LCK dominieren. Jetzt werden sie beim Mid-Season Invitational in Brasilien versuchen, sich den ersten internationalen Titel im Jahr 2017 zu sichern.\n","es_ES":"Junsik ''Bang'' Bae es un AD carry con una dedicación admirable. Su riguroso programa de entrenamiento ha demostrado su eficacia: es el primer jugador coreano en alcanzar los 1400 puntos en la cola en solitario. Y eso no es lo único que se le da bien. Cuando SKT T1 consiguió el tercer puesto en la OGN Champions League de verano de 2014, Bang ya había llegado al panorama coreano de los esports. Junto al resto de miembros de su equipo, contribuyó al triunfo de SKT en el Campeonato Mundial 2015 y su nombre pasó a la historia de League.\n\nLejos de quedarse ahí, luchó junto a SK telecom para superar el mal trago inicial de 2016 causado por el ajuste de plantilla, justo antes de ganar el Campeonato Mundial de 2016. El equipo se ha adaptado rápidamente a su plantilla este año y ha dominado el split de primavera de la LCK. Ahora intentará conseguir su primera victoria internacional de 2017 en el Mid-Season Invitational en Brasil.\n","pt_BR":"<p>Junsik \"Bang\" Bae é um carregadorregador incrivelmente dedicado. Bang se comprometeu a um treinamento rigoroso e tem os resultados para provar: foi o primeiro jogador coreano a alcançar 1400 pontos no nível Desafiante na fila solo. Mas ele não é bom só na fila solo. Quando a SKT T1 conseguiu o 3º lugar na Summer OGN Champions League 2014, Bang fez sua entrada oficial para o cenário coreano de e-Sports. Ele então continuou sua jornada e alcançou o 1º lugar no Campeonato Mundial 2015 com a SKT, gravando seu nome na história do League of Legends.</p>\n\n<p>Mas ele não parou por aí e, assim como o resto da SK Telecom, ele teve dificuldades em se adaptar às mudanças constantes de escalação antes de vencer o Campeonato Mundial 2016. A equipe se ajustou rapidamente à sua nova composição neste ano, dominando a Etapa de Primavera da LCK. Agora eles querem que sua primeira vitória internacional de 2017 seja no Mid-Season Invitational no Brasil.\n</p>","es_AR":"<p>Jun-sik \"Bang\" Bae es un ADC totalmente aplicado. Bang se comprometió a cumplir un riguroso programa de juego, y los resultados lo demuestran. Fue el primer jugador coreano en alcanzar 1400 puntos de Challenger en la cola individual. Pero no es solo en la cola individual donde está mejorando. Cuando SKT T1 S se aseguró el tercer lugar en la OGN Champions League de verano del 2014, Bang quedó oficialmente instalado en la escena de esports coreana. Llegó al primer lugar en el Campeonato Mundial 2015 con SKT, y grabó su nombre en la historia de LoL.</p>\n\n<p>Pero no se detuvo allí y, como el resto de los miembros de SKTelecom, pasó por los insoportables cambios de plantel en el 2016. Después de recibir otro título de LCK en el torneo de apertura del 2016, Bang y SKTelecom fueron derrotados durante el comienzo del torneo de clausura, lo que dejó boquiabiertos a los simpatizantes de todo el mundo. Bang tomará la pérdida como combustible para su fuego competitivo y sabe que solo hace falta una pequeña chispa para hacer que SKTelecom vuelva a tener el dominio del Campeonato Mundial 2016.</p>"},"foreignIds":{"drupalId":"881","ESPORTSTMNT06":"200000358","TRLH1":"200000411","TRLH2":"200000311","TRLT3":"200000209"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":404,"slug":"wolf","name":"Wolf","firstName":"Jaewan","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolf-82h5ft4p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:22.000Z","bios":{"en_US":"<p>Jaewan \"Wolf\" Lee is a dedicated communicator and practices constantly with his duo partner Bang. Their bond in the bot lane has proven itself, as Wolf achieved one of the highest KDAs in the 2015 LCK Summer Split. His chemistry with Bang led SK Telecom to become world champions in 2015 after they rampaged through the entire tournament nearly unbeaten.</p>\n\n<p>In 2016, the chemistry seemed to have waned as Bang and Wolf struggled along with the entirety of SKT, but after MSI their trademark chemistry was back with a vengeance. Even though SKT came up short in the Summer Split playoffs, Wolf and Bang showed up huge at the 2016 World Championship and again at the 2017 Mid-Season Invitational. Next up? Worlds.</p>","fr_FR":"Jaewan « Wolf » Lee est un excellent communiquant qui s'entraîne constamment avec son partenaire Bang. Leur lien sur la voie du bas a fait ses preuves : Wolf a enregistré l'un des plus hauts KDA du segment d'été des LCK 2015. L'alchimie entre Bang et lui a permis à SK Telecom de devenir championne du monde en 2015 après avoir fait des ravages durant tout le tournoi, presque sans subir la moindre défaite.\n\nEn 2016, cette synergie semble s'être dégradée : Bang et Wolf ont eu un peu de mal, comme l'ensemble de leur équipe, mais après le tournoi MSI, leur alchimie légendaire était de retour en beauté. Bien que SKT ait manqué de peu les play-offs du segment d'été, Wolf et Bang ont fait des étincelles au Championnat du monde 2016. À présent, ils se préparent à participer au Mid-Season Invitational 2017 et convoitent leur deuxième titre du MSI.\n","pl_PL":"Jaewan „Wolf” Lee ma świetne umiejętności komunikacyjne i nieustannie ćwiczy ze swoim partnerem z duetu, Bangiem. Ich zgrania na dolnej alei dowodzi fakt, że Wolf zdobył jeden z najwyższych wyników Z/Z/A podczas letniego splitu LCK 2015. Świetna chemia między nim a Bangiem doprowadziła SK Telecom do zdobycia mistrzostwa świata w 2015 roku, po przebiciu się przez cały turniej niemal bez porażki.\n\nW 2016 roku ta chemia jakby uleciała, gdy Bang i Wolf borykali się z problemami, które dotknęły całego SKT, ale po MSI ich charakterystyczne zgranie się powróciło jeszcze bardziej wzmocnione. Chociaż SKT odpadli w fazie pucharowej letniego splitu, Wolf i Bang pokazali się ze świetnej strony na Mistrzostwach Świata 2016. Teraz zmierzają na Mid-Season Invitational 2017, mając oko na drugi tytuł na MSI.\n","de_DE":"Jaewan „Wolf“ Lee ist ein engagierter Kommunikator und ständig damit beschäftigt, sich mit seinem Duo-Partner Bang zu verbessern. Ihre Verbindung ist stark und ihr Erfolg auf der unteren Lane spiegelt sich deutlich in Wolfs TTUs im Sommer-Split der LCK 2015 wider. Seine gute Harmonie mit Bang führte SK Telecom zum Sieg bei der Weltmeisterschaft 2015, nachdem sie im ganzen Turnier nahezu ungeschlagen geblieben waren.\n\n2016 war es mit der Harmonie plötzlich vorbei, als Bang und Wolf, genau wie der Rest der Mannschaft, große Probleme hatten. Aber nach dem MSI war ihre Harmonie wieder zurück. Obwohl SKT in den Entscheidungsspielen des Sommer-Splits scheiterte, konnten Wolf und Bang der Weltmeisterschaft 2016 ihren Stempel aufdrücken. Jetzt sind sie zum Mid-Season Invitational 2017 unterwegs, wo sie ihren zweiten MSI-Titel gewinnen wollen.\n","es_ES":"Jaewan ''Wolf'' destaca por lo bien que se comunica, y practica constantemente con su compañero de la calle inferior, Bang. Este dúo ya ha demostrado su valía, ya que Wolf consiguió uno de los marcadores A/M/A más altos del split de verano de la LCK 2015. Su química con Bang contribuyó en gran medida a que SK telecom se proclamase campeón del mundo en 2015, pues en su paso por el campeonato casi terminan invictos.\n\nEn 2016, su química comenzó a decaer cuando Bang y Wolf experimentaron los mismos problemas que el resto del equipo, pero con la victoria en el MSI todo volvió a la normalidad. Aunque SKT no dio la talla en los playoffs del split de verano, Wolf y Bang se mostraron como un potente dúo en el Campeonato Mundial de 2016. Ahora se dirigen al Mid-Season Invitational 2017 con esperanzas de obtener su segundo título del MSI.\n","pt_BR":"<p>Jaewan \"Wolf” Lee é um comunicador dedicado e pratica constantemente com seu parceiro de rota, Bang. Sua sintonia na rota inferior já provou o que tinha que provar quando Wolf alcançou um dos AMAs mais altos da Etapa de Verão da LCK 2015. Sua química com Bang levou a SK Telecom a se tornar a campeã mundial em 2015 depois de destruírem no torneio, saindo praticamente invictos.</p>\n\n<p>Em 2016, essa química parecia ter sumido quando Bang e Wolf passaram por muitas dificuldades, juntamente com toda a SKT. Mas, depois do MSI, sua tão famosa sintonia voltou com tudo. Mesmo a SKT tendo decepcionado nas eliminatórias da Etapa de Verão, Wolf e Bang impressionaram no Campeonato Mundial 2016. Agora, eles vão para o Mid-Season Invitational 2017 de olho no seu segundo título MSI.\n</p>","es_AR":"<p>Jae-wan \"Wolf\" se destaca por su dedicación a las comunicaciones y practica constantemente con su dupla Bang. Su vínculo en el carril inferior se ha mostrado fuerte, y Wolf logró uno de los más altos KDA en el torneo de clausura de la LCK 2015. Su química con Bang hizo que SKTelecom se convirtiera en campeón mundial en el 2015 luego de arrasar durante todo el torneo sin derrotas.</p>\n\n<p>En el 2016, la química pareció menguar un poco, ya que Bang y Wolf pasaron una mala racha junto a SKTelecom, pero luego de la MSI, su complementación volvió a ser la misma y estuvo cargada de venganza. Aunque SKTelecom quedó afuera rápido de las eliminatorias del torneo de clausura, Wolf y Bang siguen siendo una impresionante dupla de carrileros inferiores. Está por llegar al Mundial como uno de los soportes más temibles del planeta. Si alguien quiere meterse con Bang, tendrá que pasar por una pesadilla al cruzarse con Wolf.</p>"},"foreignIds":{"drupalId":"882","ESPORTSTMNT06":"200000435","TRLH1":"200000412","TRLH2":"200000312","TRLT3":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":715,"slug":"peanut","name":"Peanut","firstName":"Wangho","lastName":"Han","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/peanut-izmrqd1y.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:15:00.000Z","bios":{"en_US":"<p>\nWangho “Peanut” Han is the most aggressive jungler in Korea - bar none. He is a master of controlled mayhem who routinely takes over games single-handedly. After getting his professional start with the thoroughly underwhelming NaJin e-mFire, Peanut made his way to the ROX Tigers in 2016.\n</p>\n<p>\nPeanut melds chaos and calm in a way seldom seen on the Rift. One moment he’s systematically stealing the enemy’s jungle and the next he’s diving headfirst into a tower to clean up a double kill. It’s this unpredictability that sets Peanut apart from other elite level junglers. After losing a close battle to SK telecom T1 at the 2016 World Championship, Peanut joined the team that sent him packing. He earned his first international title with his new team at the 2017 Mid-Season Invitational; now, his sights are set on Worlds.\n</p>","de_DE":"Wangho „Peanut“ Han ist zweifellos der aggressivste Jungler in Korea. Er ist ein Meister des kontrollierten Chaos und kann Spiele alleine entscheiden. Nachdem seine Karriere bei den sehr enttäuschenden NaJin e-mFire begonnen hatte, wechselte Peanut im Jahr 2016 zu den ROX Tigers.\n\nPeanut vereint Chaos und Ruhe, wie man es in der Kluft nur selten sieht. In einem Moment grast er systematisch den gegnerischen Dschungel ab und im nächsten stürmt er kopfüber zu einem Turm, um eine Doppeltötung einzufahren. Es ist diese Unberechenbarkeit, die Peanut von den anderen Junglern auf diesem Niveau unterscheidet. Nachdem er sich bei der Weltmeisterschaft 2016 SK Telecom T1 knapp geschlagen geben musste, wechselte Peanut zu der Mannschaft, die ihn nach Hause geschickt hatte. Jetzt wird er beim Mid-Season Invitational 2017 versuchen, mit seiner neuen Mannschaft seinen ersten internationalen Titel zu gewinnen.\n","es_AR":"<p>Wang-ho \"Peanut\" Yun es, sin la menor duda, el junglero más agresivo de Corea. Es experto en generar un caos controlado que casi siempre le permite tener el dominio de las partidas en sus propias manos. Después de hacer su debut profesional con el absolutamente abrumador equipo NaJin e-mFire, Peanut pasó a formar parte de ROX Tigers a comienzos de año y no ha vuelto la vista atrás desde entonces.</p>\n\n<p>Peanut combina caos y calma de una forma pocas veces vista en la Grieta. En un momento se encuentra robando de forma sistemática la jungla del enemigo, y al siguiente se lanza de cabeza a una torre pera ejecutar un asesinato doble. Es el componente sorpresa lo que hace que Peanut se destaque de otros jungleros de élite. Era la última pieza que faltaba en ROX Tigers, y su juego ayudó a catapultar el equipo al estrellato internacional. Peanut y compañía son grandes favoritos para el Campeonato Mundial 2016, y hay solo una cosa para decir a los equipos que se crucen en su camino: buena suerte.</p>","es_ES":"Wangho ''Peanut'' Han es el jungla más agresivo de Corea. Es un maestro del caos controlado y suele dominar en solitario las partidas. Tras comenzar profesionalmente con el decepcionante NaJin e-mFire, se unió a ROX Tigers en 2016.\n\nPeanut combina el caos y la calma de una forma que rara vez se ha visto en la Grieta. Un segundo está robando de forma sistemática la jungla enemiga, y al siguiente se está lanzando de cabeza bajo la torre para conseguir un asesinato doble. Que sea tan impredecible es lo que lo hace destacar frente a otros junglas de élite. Tras perder una disputada batalla contra SK telecom T1 en el Campeonato Mundial de 2016, Peanut se unió al equipo que lo mandó a casa. Ahora, intentará ganar su primer título internacional con su nuevo equipo en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Wangho \"Peanut\" Han é o caçador mais agressivo da Coreia, ponto. Ele é um mestre em controlar o caos que frequentemente causa nos seus jogos. Depois de ter sua estreia no cenário profissional com a decepcionante NaJin e-mFire, Peanut encontrou seu caminho na ROX Tigers em 2016.</p>\n\n<p>Peanut consegue juntar caos e tranquilidade de uma forma raramente vista no Rift. Em um momento ele pode estar roubando sistematicamente a selva do inimigo e no outro, mergulhando de cabeça em uma torre para pegar um abate duplo. É essa imprevisibilidade que diferencia Peanut dos outros caçadores de elite. Depois de perder uma batalha acirrada para a SK Telecom T1 no Campeonato Mundial 2016, Peanut entrou para a equipe que o fez fazer as malas. Agora, ele tentará ganhar seu primeiro título internacional com sua nova equipe no Mid-Season Invitational 2017.\n</p>","pl_PL":"Wangho „Peanut” Han jest najagresywniejszym dżunglerem w Korei — bezdyskusyjnie. To mistrz kontrolowanego chaosu, który regularnie zdobywa zwycięstwa w meczach praktycznie na własną rękę. Po swoim profesjonalnym starcie w bardzo przeciętnym NaJin e-mFire Peanut przeniósł się na początku 2016 roku do ROX Tigers.\n\nPeanut łączy chaos i opanowanie w sposób rzadko widywany na Summoner’s Rift. W jednej chwili systematycznie wykrada dżunglę przeciwnikowi, a w następnej szturmuje wieżę, by zgarnąć podwójne zabójstwo. To ta nieprzewidywalność odróżnia Peanuta od pozostałych elitarnych dżunglerów. Po przegraniu zaciekłej bitwy z SK Telecom T1 na Mistrzostwach Świata 2016 Peanut dołączył do drużyny, która była przyczyną jego porażki. Teraz ze swoją nową drużyną zamierza zdobyć swój pierwszy międzynarodowy tytuł na Mid-Season Invitational 2017.\n","fr_FR":"Wangho « Peanut » Han est le jungler le plus agressif de Corée, sans exception. Il est passé maître dans l'art du chaos contrôlé, et a pour habitude de dominer les matchs seul. Suite à des débuts professionnels avec les très décevants NaJin e-mFire, Peanut a rejoint les ROX Tigers en 2016.\n\nPeanut mélange chaos et calme d'une façon rarement vue sur la Faille. Un moment, il vole systématiquement la jungle ennemie et l'instant d'après, il fonce tête la première sous une tour pour réaliser un doublé. C'est son caractère imprévisible qui distingue Peanut des autres junglers d'élite. Après avoir perdu un combat serré contre SK Telecom T1 lors du Championnat du monde 2016, Peanut a finalement rejoint l'équipe qui l'avait disqualifié. Il va maintenant tenter de remporter son premier titre international avec sa nouvelle équipe au Mid-Season Invitational 2017.\n"},"foreignIds":{"drupalId":"4062","TRLH1":"200000409","TRLH2":"200000309","ESPORTSTMNT06":"200000355","TRLT3":"200000207"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":749,"slug":"score","name":"Score","firstName":"Dong-bin","lastName":"Ko","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/score-gtlz6pjd.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:20:25.000Z","bios":{"en_US":"<p>Dong-bin \"Score\" Ko, once known as “The Immortal Score,” is one of a select few Korean pros to transition smoothly from playing one role to another. Originally the pre-eminent ADC for KT Rolster, Score had a knack for surviving team fights due to his excellent positioning.\n</p>\n<p>\nScore traded in his guns and rockets for a flask and burrowing kit and moved into the jungle in 2015. Now working with a new roster, he'll have to build synergy with his new all-star laners to find success in 2017.\n</p>","fr_FR":"<p>Dong-bin « Score » Go, naguère surnommé l'« Immortel Score », est un des rares professionnels coréens à avoir su passer de façon fluide d'un rôle à un autre. Quand il était le carry AD par excellence de KT Rolster, Score avait le don pour survivre aux combats d'équipes grâce à son excellent sens du positionnement.\n</p>\n<p>\nScore opéra une reconversion vers la jungle en 2015. Pour l'heure, ce choix a l'air de sourire à KT Rolster. Les ganks de Score sur la voie du haut donnent constamment à ssumday un avantage crucial. Il fut un temps où Score amassait les éliminations sur la voie du bas, mais aujourd'hui je pense qu'on peut dire\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...que son score ne l'intéresse plus. (Phreak par pitié, ne touche pas à mon clavier).</p>","pl_PL":"<p>Dongbin „Score” Go, znany kiedyś jako „The Immortal Score” jest jednym z niewielu koreańskich zawodowców, którzy gładko przeszli z jednej roli w inną. Niegdyś był prowadzącym w KT Rolster i często przeżywał walki drużynowe ze względu na idealne ustawienie.\n</p>\n<p>\nScore przesiadł się z rakiet i broni na mikstury i przeszedł do dżungli w 2015 roku. Chwilowo ruch ten wydaje się służyć KT Rolster. Ganki Score'a na górnej alei zapewniają ssumdayowi przewagę. Chociaż Score niegdyś sam zdobywał zabójstwa na dole, teraz można powiedzieć,..\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...że Score'a nie obchodzi już jego score (wynik). (Phreak, daj spokój, zostaw mój komputer).\n</p>","de_DE":"<p>Dongbin \"Score\" Ko war wie heute schon zu Zeiten von KT Rolster Bullets der Teamkapitän und hat die Kommandos gegeben. Das Bemerkenswerte ist, dass er dies damals als Schütze, also einer sehr mikrolastigen Rolle, machte, was zu dieser Zeit keiner anderer zu diesem Maße mit Erfolg nachmachen konnte. Als Anfang 2015 die beiden Schwesterteams KTA und KTB sich zusammentaten, hat Score seine Rolle zum Jungler gewechselt. Sehr schnell nahm dieser Wechsel eine solide Form an, wobei auch die langjährige Erfahrung eine große Rolle spielte. Score wandelt diese in kluge Jungle-Pfade und Manöver um seine Gegner herum um. Zusammen mit seinem Support Piccaboo bilden diese beiden das beste Jungle/Support-Duo in Korea, das dem Gegner immer und immer wieder klar macht, dass sie keine Führung so leicht aus den Händen geben.</p>","es_ES":"<p>Dong-bin \"Score\" Go, una vez conocido como “El inmortal Score”, es uno de los pocos elegidos coreanos que ha cambiado con éxito su rol dentro del juego. Originalmente en el puesto de tirador para KT Rolster, Score tiene un truco para sobrevivir en todas las peleas gracias a su extraordinario posicionamiento. </p>\n\n<p>Score cambió sus pistolas y cohetes por la mochila de explorador y se fue a la jungla en 2015. Hasta ahora el cambio parece haber funcionado para KT Rolster. Las emboscadas de Score en la calle superior suelen darle ventaja a su compañero ssumday. Hubo un tiempo en el que Score acaparaba los asesinatos de su equipo, aquellos maravillosos años…</p>\n","pt_BR":"<p>Dong-bin \"Score\" Go, uma vez conhecido como \"O Imortal Score\", é um dos poucos jogadores coreanos a transitar tranquilamente de uma posição para outra. Originalmente um proeminente atirador para a KT Rolster, Score era conhecido por sobreviver às lutas com seu excelente posicionamento.\n</p>\n<p>\nScore trocou suas armas e foguetes por um machete e repelentes, e mudou-se para a selva em 2015. Até agora tudo tem dado certo para a KT Rolster. As emboscadas de Score na rota do topo regularmente colocam Ssumday em uma vantagem crucial para a equipe. Enquanto Score antigamente era conhecido por conquistar abates para si próprio na rota de baixo, hoje em dia você pode até dizer que...\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n...ele não se importa muito com seu score (placar). (Phreak pfv, deixe meu computador em paz).\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한때 생존왕이라고 불리기도 했던 \"Score\" 고동빈은 포지션 전향이 순탄하게 이루어진 몇 안 되는 한국 프로게이머들 중 하나입니다. KT Rolster의 탁월한 원거리 딜러였던 Score는 훌륭한 위치 선정으로 팀 전투에서 생존하는 능력이 좋았습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 Score는 총과 로켓 대신 술통과 매복 스킬을 들고 정글로 들어갔습니다. 그의 포지션 전향은 KT Rolster에게 도움이 되고 있는 듯합니다. Score의 탑 라인 갱킹은 Ssumday가 계속해서 우위에 설 수 있게 해줍니다. 한때 Score는 봇 라인에서 킬을 독식했을지 몰라도 요즘은 자기 스코어에 신경 쓰지 않습니다. </p>\n"},"foreignIds":{"drupalId":"2163","ESPORTSTMNT06":"200000341","TRLT3":"200000213"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":769,"slug":"smeb","name":"Smeb","firstName":"Kyungho","lastName":"Song","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smeb-afu7c8ds.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-07-06T14:10:36.000Z","bios":{"en_US":"<p>Kyungho \"Smeb\" Song is the most feared top laner in the world; but it wasn’t always that way. His professional debut with Incredible Miracle in 2013 was disastrous, and he was crushed repeatedly by the LCK’s top lane heavyweights. After Smeb made the move to the ROX Tigers (previously KOO Tigers) in late 2014, he defied his critics, and his play skyrocketed under the tutelage of ROX coach NoFe. Smeb’s endearing ascension gained him fans and respect as one of the most formidable foes on the Rift.</p>\n\n<p>Smeb has continually reached new heights as a player, collecting his second straight LCK MVP award in the 2016 LCK Summer Split, when he led a resilient ROX squad to their first-ever LCK crown. The hype behind Smeb was at a fever pitch heading into Worlds until the Tigers met their bitter rivals, SK Telecom T1, in the Semifinals. Even though Smeb and company fell to SKT in a hardfought battle, his admirable performances left an impression on viewers.</p>","fr_FR":"<p>Kyung-ho « Smeb » Song est aujourd'hui le top laner le plus craint au monde, mais cela n'a pas toujours été le cas. Ses débuts en tant que professionnel avec Incredible Miracle en 2013 ont été désastreux et se sont soldés par de nombreux échecs face aux poids lourds top laners des LCK. Après avoir rejoint les ROX Tigers (anciennement KOO Tigers) fin 2014, il a défié ses détracteurs et ses performances explosèrent sous la houlette de l'entraîneur des ROX, NoFe. Avec son ascension, Smeb a conquis les fans et le respect de ses pairs comme l'un des ennemis les plus imposants de la Faille.</p>\n\n<p>Smeb n'a jamais cessé d'évoluer en tant que joueur, remportant sa deuxième récompense de MVP LCK lors du segment d'été des LCK 2016 quand, grâce à la ténacité de l'équipe, ROX a pu y décrocher sa première couronne. L'engouement derrière Smeb était encore à son comble lors du Mondial jusqu'à la rencontre entre les Tigers et leurs adversaires cinglants, SK Telecom T1, lors de la demi-finale. Même si Smeb et son équipe ont perdu face à SKT après un combat acharné, ses performances incroyables ont fait forte impression sur les spectateurs qui l'ont propulsé sur la scène de l'événement All-Stars 2016 à Barcelone.</p>","pl_PL":"<p>Kyungho „Smeb” Song to budzący największą grozę na świecie gracz górnej alei — ale nie zawsze tak było. Jego profesjonalny debiut w Incredible Miracle w 2013 okazał się katastrofalny. Smeb był raz za razem miażdżony przez weteranów górnej alei z LCK. Gdy Smeb przeniósł się do ROX Tigers (dawniej KOO Tigers) pod koniec 2014 roku, rzucił rękawicę krytykom, a jego gra osiągnęła niebotyczny pułap dzięki opiece trenera ROX, NoFe. Śmiały awans Smeba przysporzył mu fanów oraz zapewnił szacunek należny jednemu z najgroźniejszych przeciwników na Summoner’s Rift.</p>\n<p>\nSmeb nieustannie osiągał nowe wyżyny jako zawodnik, zdobywając drugą z rzędu nagrodę dla Najlepszego Zawodnika LCK, gdy doprowadził mocny skład ROX do ich pierwszego wielkiego zwycięstwa w LCK. Gorączka zachwytów nad Smebem rosła w toku Mistrzostw, aż Tigers spotkali się w półfinałach ze swoimi zaciętymi rywalami, SK Telecom T1. Chociaż Smeb i koledzy ulegli SKT w zażartym boju, jego godny podziwu występ zrobił wrażenie na widzach, którzy wysłali go na wydarzenie All-Star 2016 w Barcelonie.\n","de_DE":"<p>Kyung-ho „Smeb“ Song ist der gefürchtetste Top-Laner der Welt, aber das war nicht immer der Fall. 2013 gab er ein katastrophales Debüt in der professionellen E-Sport-Szene für Incredible Miracle und wurde außerdem immer wieder von anderen Top-Lanern der LCK vernichtet. Nachdem Smeb Ende 2014 zu den ROX Tigers (ehemals KOO Tigers) gewechselt hatte, ließ er seine Kritiker verstummen und verbesserte seine Spielweise unter der Anleitung von ROX’ Coach NoFe ungemein. Smebs Aufstieg brachte ihm Fans und den Respekt der besten Spieler der Kluft ein.</p>\n\n<p>Smeb hat als Spieler immer wieder neue Höhen erreicht und nachdem er beim Sommer-Split 2016 seinen zweiten Titel als MVP der LCK erhalten hatte, führte er ROX zum ersten Sieg in der LCK. Der Hype um Smeb erreichte bei der Weltmeisterschaft seinen Höhepunkt, bis die Tigers im Halbfinale auf ihren größten Rivalen trafen: SK Telecom T1. Obwohl sich Smeb und seine Kameraden SKT nach einem harten Kampf beugen mussten, hinterließ seine Vorstellung bleibenden Eindruck bei den Zuschauern, die ihn jetzt auf der Bühne des All-Stars-Events 2016 in Barcelona sehen wollen.</p>","es_ES":"<p>Kyungho \"Smeb\" Song es considerado el top más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el split de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","pt_BR":"<p>Kyung-ho \"Smeb\" Song é um dos topos mais temidos do mundo, mas nem sempre foi assim. Sua estreia profissional na Incredible Miracle em 2013 foi um desastre e ele era constantemente destruído pelos pesos-pesados da rota do topo na LCK.  Depois de ter entrado para a ROX Tigers (antiga KOO/GE Tigers) no final de 2014, ele desafiou todos os críticos e seu desempenho explodiu sob a tutela do técnico da ROX, NoFe. A ascensão cativante de Smeb ganhou a ele fãs e respeito como um dos inimigos mais formidáveis no Rift.</p>\n\n<p>Smeb continuiu a atingir novos patamares como jogador, conquistando seu segundo prêmio consecutivo como MVP da LCK. O topo liderou a equipe resiliente da ROX a sua primeira coroa na LCK. A animação por trás de Smeb estava altíssima ao entrar no Mundial, até a Tigers encontrar sua rival, a SK Telecom T1, nas Semifinal. Apesar de Smeb e companhia terem perdido para a SKT em uma batalha difícil, seu desempenho admirável deixou uma impressão nos jogadores que os levou a votar nele para o Evento All-Star 2016.</p>","ko_KR":"<p>\"Smeb\" 송경호 선수는 LCK의 최강 탑 라이너 중 한 명입니다. 2013년 Incredible Miracle에서 e스포츠 경력을 시작했지만 별다른 모습을 보여주지 못했던 Smeb 선수는 2014년 말 ROX Tigers에 입단한 후 달라진 모습을 보여주기 시작했습니다. NoFe 코치의 지도를 받아 나르, 럼블, 헤카림을 마스터해 누구보다도 더 능수능란하게 다루는 모습을 보여주었죠. 특히 나르로 뛰어난 모습을 보여 2015 LCK 스프링에서는 나르로 6승 1패를 기록하기도 했습니다.</p>\n<p>ROX Tigers는 카토비체에서 개최된 IEM 시즌 IX 월드 챔피언십에서 World Elite에게 패하기는 했지만, 꾸준히 세계 최강급 팀으로서의 면모를 보여 왔습니다. LCK의 상위권 팀들과 자주 맞붙어야 하는 ROX Tigers에게 있어 Smeb 선수가 탑에서 럼블과 나르로 잠재력을 발휘할 수 있느냐는 팀의 성패와 직결되죠. Smeb 선수가 제 기량만 발휘할 수 있다면 ROX Tigers의 앞날을 밝을 것입니다. </p>\n","es_AR":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","cs_CZ":"<p>Kyungho „Smeb“ je nejobávanějším horním lajnařem na světě, ale nebylo tomu tak vždy. Jeho profesionální debut s Incredible Miracle roku 2013 skončil katastrofou a špičkoví horní lajnaři z LCK si z něj opakovaně dělali fackovacího panáka. Když však koncem roku 2014 přestoupil do ROX Tigers (dříve KOO Tigers), vzal svým kritiků vítr z plachet a pod vedením trenéra NoFea z ROXu se jeho herní schopnosti ohromným tempem zlepšovaly. Svou cílevědomostí a odhodláním si Smeb vysloužil davy fanoušků a pověst jednoho z nejtěžších nepřátel, na jaké lze ve Žlebu narazit.</p>\n\n<p>Smebova hvězda na herním nebi září čím dál jasněji. Během letního splitu LCK 2016 získal podruhé po sobě ocenění pro nejužitečnějšího hráče ligy, a to zcela zaslouženě, neboť dovedl nezdolný tým ROX k jeho historicky prvnímu titulu z LCK. Nadšení jeho fanoušků dosáhlo s příchodem MS neuvěřitelných výšin, studená sprcha však přišla v semifinále, kde Tigers narazili na své úhlavní nepřátele z SK Telecom T1. Smeb a jeho tým sice SKT podlehli, avšak byla to tvrdá bitva a jeho výkony zanechaly v divácích takový dojem, že se rozhodli jej vyslat do Barcelony na turnaj All-Star 2016.</p>","el_GR":"<p>Ο Kyungho \"Smeb\" Song θεωρείται ο πιο επικίνδυνος παίκτης επάνω λωρίδας στον κόσμο. Δεν ήταν πάντα έτσι, όμως. Έκανε το ντεμπούτο του στην επαγγελματική σκηνή με τους Incredible Miracle του 2013 και γνώρισε την απόλυτη αποτυχία, καθώς τον τσαλαπάτησαν όλοι οι δυνατοί παίκτες επάνω λωρίδας του LCK. Όταν ο Smeb πήρε μεταγραφή στους ROX Tigers (προηγουμένως KOO Tigers) στα τέλη του 2014, όχι μόνο διέψευσε τους κριτικούς του, αλλά βελτίωσε θεαματικά το παιχνίδι του με την καθοδήγηση του προπονητή των ROX, NoFe. Η άνοδος του Smeb κέρδισε τη συμπάθεια και το σεβασμό του κόσμου και τον έκανε έναν από τους πιο τρομακτικούς αντιπάλους στο παιχνίδι.</p>\n\n<p>Ο Smeb κατακτά διαρκώς νέες κορυφές ως παίκτης και πρόσφατα κέρδισε το δεύτερό του βραβείο MVP στο Summer Split 2016 του LCK, όπου οδήγησε τους εξαιρετικά ανθεκτικούς ROX στην πρώτη τους κατάκτηση του πρωταθλήματος. Η πορεία του Smeb είχε δημιουργήσει τρομακτικό ενθουσιασμό, μέχρι που οι Tigers συνάντησαν τους αιώνιους αντιπάλους τους, SK Telecom T1, στους Ημιτελικούς. Παρόλο που ο Smeb και η παρέα του ηττήθηκαν μετά από σκληρό αγώνα, οι εκπληκτικές εμφανίσεις του έκαναν θετική εντύπωση στους θεατές, με αποτέλεσμα να κερδίσει μια θέση στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη.</p>","hu_HU":"Kyungho „Smeb” Song ma a világ legrettegettebb felső ösvényese, de ez nem mindig volt így. 2013-as bemutatkozása az Incredible Miracle tagjaként katasztrofálisra sikeredett, és az LCK felső ösvényes nehézsúlyú játékosai sorra kiütötték. Smeb átigazolt a ROX Tigershez (korábban KOO Tigers) 2014 végén. A ROX edzője, NoFe irányítása alatt hatalmasat fejlődött. Smeb üstökösszerű felemelkedése sok rajongót és rengeteg tiszteletet hozott neki, és ma már a Szurdok egyik legkeményebb harcosának számít.\n</p>\nSmeb egyre magasabbra jut játékosként, zsinórban kétszer lett MVP az LCK 2016-os nyári szakaszában, majd megnyerte a ROX csapatával együtt az első LCK-s bajnoki címüket. Smeb menetelése a vb-n is folytatódott, amíg a Tigers nem találkozott legnagyobb riválisával, az SK Telecom T1-nal az elődöntőben. Bár Smeb és csapata kemény küzdelem után elesett az SKT ellen, így is elég népszerűvé vált ahhoz, hogy kijusson a 2016-os All-Star gálára.\n","it_IT":"Oggi Kyungho \"Smeb\" Song è il superiore più temuto al mondo, ma non è stato sempre così. Il suo debutto professionale con gli Incredible Miracle nel 2013 fu disastroso e lui stesso fu schiacciato ripetutamente in corsia superiore dai pesi massimi della LCK. Dopo essere passato ai ROX Tigers (ex KOO Tigers) alla fine del 2014, ha smentito ogni critica portando il suo gioco a livelli stellari sotto la guida del coach dei ROX, NoFe. L'affascinante ascesa di Smeb gli è valsa l'affetto di numerosi fan e il rispetto degli avversari, che lo considerano uno dei più formidabili guerrieri della Landa.\n</p>\nSmeb ha continuato a raggiungere nuove vette come giocatore, ottenendo il secondo premio consecutivo come MVP nella LCK durante il Summer Split 2016, quando ha guidato i ROX al loro primo trofeo LCK. Gli occhi del mondo erano puntati su Smeb durante i Mondiali, soprattutto durante la battaglia in semifinale contro gli acerrimi rivali degli SK Telecom T1. Anche se Smeb e i suoi compagni si sono dovuti arrendere davanti agli SKT dopo un'intensa battaglia, le sue notevoli prestazioni hanno impressionato il pubblico, che ha deciso di mandarlo dritto a Barcellona per l'All-Star.\n","ro_RO":"Kyungho ''Smeb'' Song este unul dintre cei mai temuți jucători de pe culoarul de sus din lume; dar nu a fost mereu așa. Debutul său pe scena profesionistă alături de Incredibile Miracle în 2013 a fost unul dezastruos, iar el a fost învins în repetate rânduri de legendele de pe culoarul de sus din LCK. După ce Smeb a venit la ROX Tigers (cunoscuți anterior drept KOO Tigers) la finalul lui 2014, și-a sfidat criticii și și-a îmbunătățit stilul de joc sub tutela lui NoFe, antrenorul echipei. Ascensiunea lui incredibilă i-a adus fani și respect, fiind considerat acum unul dintre cei mai formidabili adversari din Rift.</p>\n\nSmeb a atins în mod constant noi culmi ca jucător, câștigând al doilea titlu consecutiv de MVP în LCK în etapa de vară LCK 2016, când a condus echipa ROX către primul ei titlu din LCK. Speranțele și entuziasmul fanilor au atins apogeul la începutul Campionatului Mondial, când cei din Tigers și-au întâlnit adversarii înverșunați, SK Telecom T1, în semifinale. Chiar dacă Smeb și echipa lui au fost învinși de SKT într-un meci extrem de dificil, reușitele sale admirabile le-au lăsat spectatorilor o impresie plăcută, care-l aduce pe scena All-Star Event 2016 din Barcelona.\n\n","es_MX":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>"},"foreignIds":{"drupalId":"2151","ESPORTSTMNT06":"200000340","TRLT3":"200000212"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":1025,"slug":"untara","name":"Untara","firstName":"Ui-jin","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/untara-72qfuy9u.png","hometown":"Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:02:38.000Z","updatedAt":"2017-05-31T00:54:38.000Z","bios":{},"foreignIds":{"TRKR1":"225031","ESPORTSTMNT06":"200000353"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1026,"slug":"sky","name":"Sky","firstName":"Haneul","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sky-2m0pzkna.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:03:37.000Z","updatedAt":"2017-05-31T00:49:05.000Z","bios":{},"foreignIds":{"TRKR1":"225033","ESPORTSTMNT06":"200000356"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1033,"slug":"blank","name":"Blank","firstName":"Sungu","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blank-7ie205tv.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:19.000Z","updatedAt":"2017-07-06T14:24:22.000Z","bios":{"en_US":"<p>Sungu “Blank” Kang started his career in China in late 2014. After being relegated from the LPL as a member of Star Horn Royal Club, Blank left the team to join SK telecom T1 in late 2015. He didn’t exactly impress with his first few games in the LCK, but when the team took him to IEM he excelled, and the team finished the tournament unbeaten. Just like that, Blank added his first trophy to his resume.</p>\n\n<p>His performances seem to be consistently improving, and SKT opted to keep playing him over the struggling veteran, Bengi. In his first split as an LCK jungler, he took first in Champions Spring, yet in the Summer Split it was clear that he was still learning how to control vision across the map. He took a back seat to Bengi during SKT's third World Championship run. While Bengi has departed, now Blank has to compete with superstar jungler Peanut for playing time.</p>","es_AR":"<p>Sun-gu \"Blank\" Kang inició su carrera en China a finales del 2014. Después de sufrir un descenso de la LPL como miembro de Star Horn Royal Club, Blank se fue del equipo para unirse a SKTelecom a finales del 2015. No tuvo una actuación muy impresionante en sus primeras partidas en la LCK, pero cuando el equipo lo llevó a la EIM, se destacó y su grupo acabó el torneo invicto. De esta forma, Blank agregó el primer trofeo a su historial.</p>\n\n<p>Sus actuaciones parecen mejorar constantemente, y SKTelecom optó por seguir jugando con él en lugar del veterano Bengi, quien no está teniendo una buena racha. En su primer torneo como junglero de la LCK, salió primero en la Champions Spring, pero en el torneo de clausura quedó claro que aún debía aprender a controlar la visión del mapa. Como resultado, SKTelecom no tuvo unas buenas eliminatorias, y cayó en la semifinal. Blank deberá refinar su control del mapa si quiere que SKTelecom tenga una buena actuación que le permita ganar el trofeo del Campeonato Mundial.</p>","fr_FR":"Sungu « Blank » Kang a débuté sa carrière en Chine fin 2014. Après avoir été relégué des LPL en tant que membre de Star Horn Royal Club, Blank a quitté l'équipe pour rejoindre SK Telecom T1 à la fin de l'année 2015. Il ne s'est pas exactement montré impressionnant lors de ses premiers matchs des LCK, mais quand l'équipe l'a emmené avec elle à l'IEM, il a révélé tout son talent et SKT a terminé le tournoi invaincue. Aussi simplement que ça, Blank a ajouté son premier trophée à son C.V.\n\nSes performances semblent s'améliorer régulièrement, aussi SKT a préféré le conserver en lieu et place de leur vétéran quelque peu affaibli, Bengi. Lors de son premier segment en tant que jungler au sein des LCK, il a remporté sa première victoire au tournoi Champions Spring. Mais lors du segment d'été il était clair qu'il apprenait encore à contrôler sa vision de l'ensemble de la carte. Il s'est ensuite effacé au profit de Bengi au cours du troisième Championnat du monde de SKT. Mais suite au départ de Bengi, c'est maintenant à Blank de se disputer du temps de jeu avec le jungler vedette qu'est Peanut\n","es_ES":"Sungu ''Blank'' Kang comenzó su carrera en China a finales de 2014. Tras ser relegado de la LPL como miembro de Star Horn Royal Club, Blank dejó el equipo y se unió a SK telecom T1 a finales de 2015. Sus primeras partidas en la LCK no fueron impresionantes, pero su actuación en el IEM fue excelente y el equipo terminó el torneo invicto. Y así fue como Blank añadió el primer trofeo a su currículum.\n\nSu rendimiento no dejaba de mejorar, así que SKT optó por darle prioridad frente al veterano Bengi. En su primer split como jungla de la LCK obtuvo el primer puesto en el Champions Spring, pero en el split de verano fue evidente que todavía estaba aprendiendo a controlar la visión del mapa. En el tercer Campeonato Mundial de SKT, Blank tuvo que ser suplente de Bengi. Ahora que Bengi se ha marchado del equipo, Blank tendrá que competir contra Peanut, el jungla superestrella, para ganarse tiempo de juego.\n","de_DE":"Sungu „Blank“ Kang begann seine Karriere Ende 2014 in China. Nachdem er mit dem Star Horn Royal Club aus der LPL abgestiegen war, verließ er die Mannschaft und wechselte Ende 2015 zu SK Telecom T1. In den ersten paar Spielen in der LCK konnte er nicht wirklich überzeugen, aber beim IEM lieferte er eine überragende Vorstellung ab und half seiner Mannschaft, das Turnier ungeschlagen zu beenden. Und mir nichts, dir nichts konnte Blank seine erste Trophäe in die Höhe stemmen.\n\nSeine Leistung scheint immer besser zu werden und SKT entschied sich, ihn dem erfahrenen Bengi vorzuziehen. In seinem ersten Split als LCK-Jungler holte er sich den ersten Platz beim Champions Spring, doch beim Sommer-Split wurde klar, dass er immer noch lernen musste, wie man die Sicht auf der Karte sicherstellt. Bei der Weltmeisterschaft musste er jedoch Bengi den Vortritt lassen. Seit dem Abgang von Bengi muss Blank mit dem Superstar im Dschungel, Peanut, um Spielzeit kämpfen.\n","pl_PL":"Kariera Sungu „Blank” Kanga zaczęła się w Chinach pod koniec 2014 roku. Po relegowaniu z LPL wraz ze wszystkimi pozostałymi członkami Star Horn Royal Club Bank opuścił drużynę, aby pod koniec 2015 roku dołączyć do SK Telecom T1. Nie zaimponował specjalnie podczas swoich pierwszych meczów w LCK, ale gdy drużyna zabrała go na IEM, pokazał, na co go stać i zespół wygrał turniej bez porażki. W ten sposób Blank dodał do swojego resume pierwsze trofeum.\n\nJego występy wydają się coraz lepsze i SKT postanowili zatrzymać go w składzie w miejsce zmagającego się z problemami weterana, Bengiego. Podczas swojego pierwszego splitu w roli dżunglera w LCK Blank zajął pierwsze miejsce w Champions Spring, jednak w toku letniego splitu stało się jasne, że wciąż uczy się kontroli wizji na całej mapie. Ustąpił miejsca Bengiemu podczas trzeciego podejścia SKT do Mistrzostw Świata. Odkąd Bengi odszedł, Blank musi rywalizować o udział w grze z supergwiazdą, dżunglerem Peanutem.\n","pt_BR":"<p>Sungu \"Blank\" Kang iniciou sua carreira na China no fim de 2014. Depois de ser rebaixado na LPL quando ainda era um membro da Star Horn Royal Club, Blank saiu da equipe e entrou para a SK Telecom T1 no final de 2015. Ele não impressionou muito com seus primeiros jogos na LCK, mas quando sua equipe o levou para a IEM, ele se destacou e a equipe terminou o torneio invicta. E simples assim, Blank acrescentou seu primeiro troféu em seu currículo.</p>\n\n<p>Seu desempenho parecia estar melhorando consistentemente, então a SKT optou por continuar jogando com ele em vez do veterano, Bengi, que parecia estar com dificuldades. Em sua primeira Etapa como caçador na LCK, ele ficou em primeiro lugar na Champions de Primavera, mas ficou claro na Etapa de Verão de que ele ainda precisava melhorar seu controle de visão do mapa. Ele ficou na reserva do Bengi durante o terceiro Campeonato Mundial da SKT. Agora que Bengi saiu da equipe, Blank precisa competir com o caçador estrela Peanut para jogar.\n</p>"},"foreignIds":{"ESPORTSTMNT06":"200000434","TRLH1":"200000413","TRLH2":"200000313","TRLT3":"200000211"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":2050,"slug":"ssun","name":"Ssun","firstName":"Taeyang","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:19:56.000Z","updatedAt":"2017-07-06T14:11:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001523","TRLT3":"200000200"},"socialNetworks":{},"champions":[],"liveGameTeam":105}],"scheduleItems":[{"id":"AVTGAP_2oUG4HPFjOJ9Q","content":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:match:a26a5096-f1a3-4cc2-9ff2-4af9ade591e0","scheduledTime":"2016-06-04T05:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db","blockLabel":"2","subBlockLabel":"6","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:bracket:2819fc4e-457f-4242-96ad-0d9137aa9222"},"match":"a26a5096-f1a3-4cc2-9ff2-4af9ade591e0","tournament":"a9a19798-6c5b-4383-ab27-e2bd08e224db","bracket":"2819fc4e-457f-4242-96ad-0d9137aa9222","league":"6"}],"gameIdMappings":[{"id":"1739d434-7b7f-4c7f-b509-7bc1d2f08079","gameHash":"b2c86ef12aad5eb1"},{"id":"1b22f891-1d09-4bbf-bb80-cbb8e4bd22bb","gameHash":"466b3bf394a71052"}],"videos":[{"id":2957,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:1739d434-7b7f-4c7f-b509-7bc1d2f08079","source":"https://www.youtube.com/embed/Wj_Ub1oLR7U?wmode=transparent&start=1372","createdAt":"2016-06-05T00:07:29.000Z","updatedAt":"2016-06-05T00:07:29.000Z","game":"1739d434-7b7f-4c7f-b509-7bc1d2f08079"},{"id":2958,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:1b22f891-1d09-4bbf-bb80-cbb8e4bd22bb","source":"https://www.youtube.com/embed/Wj_Ub1oLR7U?wmode=transparent&start=4880","createdAt":"2016-06-05T00:10:36.000Z","updatedAt":"2016-06-05T00:10:36.000Z","game":"1b22f891-1d09-4bbf-bb80-cbb8e4bd22bb"}],"htmlBlocks":[],"match":{"id":"a26a5096-f1a3-4cc2-9ff2-4af9ade591e0","name":"KT-vs-SKT","position":19,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],"games":{"1739d434-7b7f-4c7f-b509-7bc1d2f08079":{"id":"1739d434-7b7f-4c7f-b509-7bc1d2f08079","name":"G1","generatedName":"KT|SKT|G1|a26a5096f1a34cc29ff2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],"standings":{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465085070536,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465065881654,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1080590","gameRealm":"TRKR1","platformId":"TRKR1:1080590","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5e3343a1-3387-4646-b3bf-972c7faa956e":{"id":"5e3343a1-3387-4646-b3bf-972c7faa956e","name":"G3","generatedName":"KT|SKT|G3|a26a5096f1a34cc29ff2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"1b22f891-1d09-4bbf-bb80-cbb8e4bd22bb":{"id":"1b22f891-1d09-4bbf-bb80-cbb8e4bd22bb","name":"G2","generatedName":"KT|SKT|G2|a26a5096f1a34cc29ff2","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],"standings":{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465085098937,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465065898588,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1080595","gameRealm":"TRKR1","platformId":"TRKR1:1080595","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465085098937,"source":"bestOf","history":[{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465085070537,"source":"bestOf","closed":true},{"result":[[{"roster":"b5f5bb3d-c746-4505-972f-eacbe7096312"}],[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}]],"timestamp":1465065898597,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b5f5bb3d-c746-4505-972f-eacbe7096312":1,"9c98ab8b-2469-4a99-90de-a393f4d75d82":0}}}