{"teams":[{"id":21,"slug":"team-dignitas","name":"Team Dignitas","guid":"be6c8d0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-dignitas-c5j84saq.png","acronym":"DIG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-21T21:17:20.000Z","bios":{"en_US":"<p>From the ashes they rise (Phoenix1, is that you?). Dignitas looked all but lost to the NA LCS after they failed to re-qualify for the LCS, and consequently sold their Challenger spot to Apex Pride. But the League gods had other plans for the organization. In September of 2016 it was announced that both Dignitas and Apex had been bought by the Philadelphia 76ers. .</p>\n\n<p>The two entities were merged in order to play under a unified Dignitas banner, and thus a legendary League of Legends team was reborn. Sporting a roster mixed with domestic and international stars, Dignitas got off to a slow start but picked up steam near the end of the 2017 NA LCS Spring Split. Heading into summmer, Dignitas will look to build on their late-season success from spring -- let’s just hope they fare better than their basketball counterparts.</p>\n\n<p>Coach: David \"Cop\" Roberson</p>","fr_FR":"<p>Dignitas est un nom que tous les fans de League of Legends et d'e-sport en général connaissent au moins de réputation. Il faut dire qu'il s'agit d'une des plus vieilles organisations présentes sur le jeu, depuis l'acquisition en septembre 2011 de Rock Solid, l'équipe de Joedat « Voyboy » Esfahani, William « scarra » Li et Joshua « Jatt » Leesman (oui, le même Jatt qui est aujourd'hui l'un des commentateurs des LCS). Une entrée remarquée sur une scène qui n'était alors que bourgeonnante et surtout le début d'une belle aventure avec des joueurs qui, comme Michael « Imaqtpie » Santana sont aujourd'hui considérés comme des figures historiques de l'e-sport nord-américain.</p>\n\n<p>Malheureusement pour Dignitas, cette popularité a depuis longtemps du mal à être suivie de titres. L'organisation a tenté divers changements au fil des saisons, que ce soit au niveau de l'encadrement ou des joueurs, mais en vain. Si l'équipe américaine peut se targuer d'avoir toujours su maintenir sa place dans les LCS depuis la création de cette ligue, ils n'y ont jamais vu ne serait-ce qu'une finale des play-offs, sans même parler d'une qualification au Championnat du monde. Pire, lors du segment de printemps de la saison 5 l'équipe a terminé à la 9e place et a donc dû participer aux relégations. Certes, ils l'ont emporté avec 3 victoires pour 2 défaites contre Team Fusion, l'équipe de Choi « Huhi » Jae-hyun, à présent mid laner de Counter Logic Gaming, et ont conservé leur place dans les LCS. Mais ce n'est pas avec des performances pareilles que Dignitas allait satisfaire ses fans. Le segment d'été a bien mieux débuté pour l'équipe qui a culminé à 6 victoires pour seulement 2 défaites à l'issue de la 4e semaine de compétition.</p>\n\n<p>Mais, comme souvent avec ceux que leurs fans surnomment affectueusement « Dignitoss » pour leur capacité à jeter leur avance aux orties, le retour à la réalité fut rude. Après une deuxième partie de segment médiocre, l’équipe de Danny « Shiphtur » Le a terminé la saison régulière à la 4e place seulement avant d'être envoyée prématurément en vacances par Team Impulse dès le 4e tour des play-offs.</p>\n\n<p>Aujourd'hui, avec une équipe remaniée à coup de sang neuf européen, Dignitas entend bien faire taire, enfin, toutes les critiques.</p>","pl_PL":"<p>Team Dignitas stanowi jedną z najstarszych organizacji na światowej scenie esportowej. Jej powstanie miało miejsce 9 września 2003 roku w efekcie fuzji dwóch innych stowarzyszeń z gier FPS. Świetnie się rozwijała, więc po zainteresowaniu się i dodaniu kolejnych gier, w czerwcu 2004 roku została zarejestrowana jako spółka z o.o. Od tego czasu Team Dignitas ciągle się rozrasta, nabywając oddziały w kolejnych grach o bogatej scenie esportowej. Dywizja League of Legends powstała 22 września 2011 roku, poprzez nabycie graczy z zespołu Rock Solid. Pierwszym wpisem w długiej historii organizacji było pierwsze miejsce na IGN ProLeague, gdzie pokonali dobrze znane drużyny: Counter Logic Gaming i Curse Gaming. Od tego czasu często plasowali się w okolicy trzeciego miejsca w różnych turniejach. Ich największym osiągnięciem z pierwszych sezonów jest zostanie najlepszym zespołem po Moscow Five na 6 Mistrzostwach Świata IEM. Drużyna Team Dignitas miała również okazję zaprezentować się na Mistrzostwach Świata drugiego sezonu, lecz niestety nie udało się jej się wyjść z fazy grupowej.</p>\n<p>\nZe względu na stale rosnącą konkurencję po trzecim sezonie Team Dignitas dużo częściej znajdował się w okolicach 5 miejsca w różnej rangi rozgrywkach. Jednak ich były AD Carry „CoreJJ” podsumował ideologię Team Dignitas w krótkim zdaniu: „Naszym celem zawsze będzie znalezienie się na podium i kwalifikacja do Mistrzostw Świata, nie uważamy tego za zamiar nie do osiągnięcia.” Te słowa podkreślają świadomość organizacji w kwestii ostatnich niepowodzeń. Raz nawet zmierzyła się z groźbą relegacji, lecz wyszła z tej próby zwycięsko. Jednak cel Team Dignitas pozostaje jeden – szczyt NA LCS. </p>\n<p>\nSama organizacja jest znana z poświęcania uwagi portalom społecznościowym. Często wydaje różnego rodzaju poradniki, które mają być pomocą we wszystkich grach, które wspiera. Dba też o kadrę dla swoich drużyn. Do ich oddziału League of Legends 30 października 2015 roku jako menadżer dołączył Joe \"InnerFlame\" Elouassi, znanym z prowadzenia spraw SK Gaming, a potem Gamers2. Wraz z nim Team Dignitas podpisało kontrakt z Ramem \"Brokenshard\" Djemalem, powszechnie popularnym i bardzo doświadczonym zawodnikiem. Sama organizacja stara się też zakontraktować możliwie najlepszych graczy. Wielu światowej sławy zawodników i nie tylko wyszło właśnie spod skrzydeł Team Dignitas. Joshua \"Jatt\" Leesman, Joedat \"Voyboy\" Esfahani, William \"scarra\" Li i Alberto \"Crumbz\" Rengifo to tylko niektórzy z tłumu, który wyszedł z tej kuźni talentów.</p>\n","de_DE":"Sie erheben sich aus der Asche. Team Dignitas schien für immer aus der NA LCS auszuscheiden, nachdem sie sich zum ersten Mal nicht für die LCS qualifizieren konnten und ihren Platz in der Challenger Series an Apex Pride verkauft hatten. Aber die Götter von League hatten andere Pläne für die Organisation und im September 2016 verkündeten die Philadelphia 76ers, dass sie sowohl Dignitas als auch Apex gekauft hatten. \n</p>\nDie beiden Mannschaften wurden zusammengelegt, um unter dem Namen Dignitas zu spielen. Und so wurde die legendäre „League of Legends“-Mannschaft wiedergeboren. Mit einer Aufstellung aus heimischen und internationalen Stars will Dignitas versuchen, den Frühjahrs-Split der NA LCS 2017 zu gewinnen. Dank der neuen Führung und Aufstellung hat Dignitas eine Chance, die Liga im Sturm zu erobern – bleibt nur zu hoffen, dass sie sich besser schlagen als ihr Gegenstück im Basketball.\n</p>\nCoach: Jung Su Kim\n"},"foreignIds":{"drupalId":"3"},"players":[168,266,325,333,399,751,967],"starters":[168,266,325,399,751],"subs":[333,967]},{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]}],"players":[{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":168,"slug":"keane","name":"Keane","firstName":"Lae-young","lastName":"Jang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keane-480q377x.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2017-01-27T01:02:28.000Z","bios":{"en_US":"<p>Lae-young “Keane” Jang got his competitive start in New Zealand and eventually made his way to North America where he has played for multiple Challenger and LCS caliber teams. In 2016 Keane joined up with Apex Gaming as they worked their way up from the Challenger scene all the way into the NA LCS. They started off their first professional split at a blazing pace, but eventually wrapped up their year with a seventh place finish in the summer.</p>\n\n<p>Keane may not be the flashiest player to ever touch down on the Rift, but he might be exactly what’s needed as a member of the new-look Dignitas. He’s a consistent presence in the mid lane, akin to players like Fly and Kuro from the LCK. He’s more than happy to play his part and whether that’s lending the team some utility or crushing the enemy underfoot, he feels equally at home. Whatever team Dignitas needs from a mid laner, they can get from Keane.</p>","de_DE":"Lae-Young „Keane“ Jang begann seine professionelle Karriere in Neuseeland, bevor er nach Nordamerika zog, um dort für einige Mannschaften in der Challenger Series und der LCS zu spielen. 2016 wechselte Keane zu Apex Gaming, die sich daraufhin durch die Challenger Series kämpften und sich einen Platz in der NA LCS sicherten. Sie legten in ihrem ersten professionellen Split einen fulminanten Start hin, beendeten das Jahr aber mit einem siebenten Platz im Sommer-Split.\n</p>\nKeane ist zwar nicht der auffälligste Spieler, der jemals die Kluft betreten hat, aber er könnte genau das sein, was das neue Dignitas braucht. Durch seine Beständigkeit auf der mittleren Lane ähnelt er Spielern wie Fly und KurO in der LCK. Er ist immer bereit, seinen Teil beizutragen, egal, ob er dafür seine Mannschaft unterstützen oder seine Gegner vernichten muss. Was auch immer Team Dignitas von einem Mid-Laner erwartet, Keane wird den Anforderungen gerecht.\n"},"foreignIds":{"drupalId":"2440","TRLH1":"200000194","TRLH2":"200000098"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":325,"slug":"adrian","name":"Adrian","firstName":"Adrian","lastName":"Ma","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/adrian-d97sgu2b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-08-04T00:05:38.000Z","bios":{"en_US":"<p>Adrian \"Adrian\" Ma might not be known for his playmaking. But that doesn't mean he isn't a vital part to his team's successes. As a member of Immortals, he was the yin to Huni's yang, balancing his top laner's aggression with his own methodical, thoughtful playstyle. He's always ready to save his teammates and focuses heavily on warding, map movements and strategizing. He pioneered a trend in the 2016 NA LCS Summer Split of playing ranged supports like Karma and Soraka over the favoured melee champions.</p>","fr_FR":"<p>À 18 ans, Adrian « Adrian » Ma s'apprête à entamer sa deuxième année en tant que joueur professionnel de League of Legends, au poste de support pour l'équipe Immortals.</p>\n\n<p>Auparavant, il a passé un peu plus d'un an comme support de LMQ en remplacement de Zhang « Mor » Hong-Wei, retourné jouer en Chine. Recruté par une équipe alors en pleine restructuration et qui a d'ailleurs changé de nom pour l'actuel, Team Impulse, quelques semaines seulement après l'arrivée d'Adrian, le jeune joueur américain a pris un risque en signant son contrat. Un pari qui s'est vite révélé gagnant puisque Team Impulse a su, après quelques semaines d'adaptation, trouver les clés pour s'imposer comme l'une des principales menaces des LCS NA. Ils n'ont en revanche pas su concrétiser leur domination lors des play-offs, terminant à la quatrième place lors du segment de printemps puis d'été. Pire, ils n'ont pas réussi à se qualifier pour les championnats du monde, malgré un rang de tête de série numéro 2, lors du tournoi de qualification régional pour la troisième place nord-américaine de la compétition la plus importante de l'année.</p>\n\n<p>Au niveau individuel, Adrian a malgré tout prouvé lors de sa première année au plus haut niveau qu'il est un joueur versatile, capable d’incarner des champions différents en fonction des besoins de l'équipe. Il a aussi montré qu'il savait réagir rapidement et protéger ses coéquipiers même dans des situations inattendues. Une qualité forcément utile pour soutenir un carry AD tel que Jason « WildTurtle » Tran, son nouveau comparse chez Immortals, connu pour être parfois trop agressif lors des combats d’équipes.</p>\n\n<p>Au sein d'une équipe ayant l'expérience de la scène compétitive, le support américain bénéficie en tout cas d’une occasion en or pour passer du statut de jeune joueur prometteur à celui de star titrée au plus haut niveau.</p>\n","pl_PL":"<p>Adrian poznał dzieło Riot Games grając z przyjaciółmi, wkrótce prześcignął ich i znalazł się w akademickim zespole. Jako członek amatorskiej drużyny, brał udział w Challenger League, skąd było bardzo blisko do Challenger Series. Jednak jego zainteresowanie League of Legends zbiegło się w czasie z pójściem na studia. Miał świadomość, że profesjonalna gra pochłania naprawdę dużo codziennego czasu na ćwiczenia, podobnie jak nauka na poziomie uniwersyteckim. Przez to miał wiele wątpliwości, m.in. czy warto porzucić naukę na rzecz esportowej kariery i czy w ogóle ma szanse się wybić. W podjęciu decyzji pomógł mu trener drużyny esportowej, który dał ogłoszenie w sieci o college’u przyjaznym zawodowym graczom. Adrian na początku nie chciał w to uwierzyć. Kiedy się przekonał, że to prawda, podjął decyzję o zaangażowaniu się w scenę League of Legends. Został jednym z pierwszych graczy wspieranych przez uczelnię - Robert Morris University w Illinois.</p>\n<p>\nChociaż \"Adrian\" grał w profesjonalnych drużynach od marca 2014 roku, pokazał się dopiero w Team Impulse w grudniu tego roku. Wraz z tą organizacją zaistniał jako solidny zawodnik, jeden z najlepszych. Niestety zarówno w wiosennym sezonie NA LCS 2015, jak i w letnim skończył na czwartej pozycji, tuż przed podium. Wiązało się to z licznymi problemami, które na swojej drodze po zwycięstwo napotkała jego drużyna. Był blisko dostania się do Mistrzostw Świata, lecz ostatecznie nie udało mu się do nich zakwalifikować. Jednak występy Adriana zrobiły wrażenie na właścicielach organizacji Immortals, której szeregi zasilił w grudniu 2015 roku, a następnie, wraz z nimi zawalczył o więcej w wiosennym sezonie NA LCS 2016.</p>\n<p>\nAdrian to osoba lubiana w środowisku League of Legends, pierwotnie znany jako „10q”, ponieważ fonetycznie brzmiało jak „thank you”. Pochodzący z Texasu support jest znany z doskonałej kontroli wizji na mapie. Przepada za graniem bohaterami, którzy potrafią przyciągnąć nie tylko uwagę przeciwnika, ale także jego postać. Ulubionymi wyborami Adriana są Thresh i Blitzcrank. Dzięki występom w NA LCS i wysokiej pozycji w Kręgu Pretendenta zdobył skromne grono wielbicieli. Na pytania fanów „jak sobie radzi” odpowiada: „Nie pozwalam żeby cokolwiek poza grą mnie rozpraszało, skupiam się na meczu. Po prostu daję z siebie wszystko i nie martwię się co sądzą inni. \nW ogóle w takich sytuacjach się nie denerwuję.” Z takim nastawieniem ma zamiar spełnić swoje marzenie – znaleźć się w drużynie, która zajmuje czołowe miejsce w NA LCS.\n</p>","de_DE":"Adrian „Adrian“ Ma wäre der Erste, der dir sagen würde, dass er kein Spielmacher ist. Aber das bedeutet nicht, dass er keine tragende Rolle für den Erfolg seines Teams spielt. Als Mitglied der Immortals war er das Yin zu Hunis Yang. Die Aggressivität seines Top-Laners konnte er mit seinem methodischen, durchdachten Spielstil ausgleichen. Er ist stets bereit, seinen Teamkollegen zu helfen, und legt großen Wert auf die Platzierung von Augen, Bewegungen auf der Karte und das Entwickeln von Strategien. Er war es, der im Sommer-Split der NA LCS 2016 den Trend zu Fernkampf-Supportern wie Karma und Soraka gesetzt und die zu diesem Zeitpunkt beliebteren Nahkampf-Champions abgelöst hat.</p>\n\nObwohl er sich mit Phoenix1 einem neuen Team anschließt, sollte sich Adrians Spielstil 2017 kaum verändern. Dieses Mal muss er der Gegenpol seines aggressiven Junglers Inori sein. Adrian sorgt vielleicht nicht für Spiele-Highlights, aber er wird auf jeden Fall eine Schlüsselrolle in Phoenix1s neuer Mannschaft spielen.\n"},"foreignIds":{"drupalId":"3041","TRLH1":"200000236","TRLH2":"200000140"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":399,"slug":"shrimp","name":"Shrimp","firstName":"Byeong-hoon","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shrimp-6ae7ilh0.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-05-01T21:33:04.000Z","updatedAt":"2017-06-14T20:10:55.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4297","TRLH1":"200000615","TRLH2":"200000532","FRA1TMNT1":"375130"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":751,"slug":"ssumday","name":"Ssumday","firstName":"Chan-ho","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ssumday-h9yau0jj.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-27T01:00:31.000Z","bios":{"en_US":"<p>Chan-ho \"Ssumday\" Kim is a feared top laner -- and justifiably so. Widely regarded as one of the world’s premier top laners, Ssumday spent a majority of his career with KT Rolster before becoming one of the most sought after free agents of 2016 and moving to North America to join up in the rebirth of Team Dignitas.</p>\n\n<p>Ssumday’s insanely deep champion pool gives the opposition no chance to shut him down in picks and bans. He poses a serious threat no matter the champion. Need him to tear apart the enemy with magic? Give him Ryze. Oh, you needed a tank to help lock down those pesky damage dealers? Gift him Maokai. Need to cut tanks down to size? Let him slice and dice with Fiora. Sometimes, it feels like Ssumday leaves you with just one option: lose.</p>","fr_FR":"<p>Sur la voie du haut, KT Rolster dispose de Chan-ho « ssumday » Kim, l'un des jeunes loups coréens, tout juste âgé de 19 ans. En dépit de sa jeunesse, ssumday est redouté, et à juste titre. Ssumday a été élu meilleur joueur du Segment d'été des LCK 2015 avec un ratio KDA de 5,22 qui le place en tête du Segment. Concédez-lui un mètre, il vous prend un kilomètre. Essayez, si vous ne me croyez pas.\n</p>\n<p>\nSsumday est efficace avec les mages et les combattants, mais au cours du Segment d'été des LCK c2015, il a surtout dominé avec des tanks. À plusieurs reprises, il a pris KT Rolster sur ses épaules et l'a portée jusqu'à la ligne d'arrivée. S'il met les mains sur Maokai ou Shen, vous devez préparer de quoi vous désengager, parce que ssumday vous poursuivra jusqu'aux extrémités de la carte pour réussir une élimination.\n</p>","pl_PL":"<p>Górny KT Rolster, Chan-ho „ssumday” jest jednym z najmłodszych Koreańczyków – ma Tylko 19 lat. Pomimo młodego wieku ssumday jest niezwykle przerażającym górnym – i całkiem słusznie. Został on wybrany najlepszym graczem letniego splitu LCK 2015, zajmując 1. miejsce ze stosunkiem zabić do zgonów wynoszącym 5,22. Jeżeli dacie mu dłoń, weźmie całą rękę. I to nie jest przesada.\n</p>\n<p>\nSsumday gra niezwykle skutecznie magami i wojownikami, ale większość meczów podczas letniego splitu LCK 2015 rozegrał obrońcami. Wiele razy ciągnął ze sobą całe KT Rolster i doprowadzał ich do linii mety. Jeżeli uda mu się dorwać Maokaia lub Shena, lepiej, żeby wasza drużyna miała jakiś sposób na przerwanie walki, ponieważ ssumday będzie was ścigał na kraniec świata, aby zagwarantować zabójstwo.\n</p>","de_DE":"Chan-ho „Ssumday“ Kim ist ein gefürchteter Top-Laner – und das zu Recht. Ssumday gilt als einer der besten Top-Laner der Welt und hat den Großteil seiner Karriere bei KT Rolster verbracht, bevor er 2016 zu einem der begehrtesten mannschaftslosen Spieler wurde und nach Nordamerika zog, um Teil der Wiedergeburt von Team Dignitas zu werden.\n</p>\nSsumdays unglaublich umfangreicher Championpool macht es seinen Gegnern nahezu unmöglich, ihn aufzuhalten. Er ist immer eine Gefahr, egal, mit welchem Champion er spielt. Soll er die gegnerische Mannschaft mit Magie vernichten? Gib ihm einfach Ryze. Oh, du brauchst einen Tank, der die lästigen Schadensverursacher ausschaltet? Gib ihm Maokai. Brauchst du jemanden, der die Tanks unschädlich macht? Gib ihm Fiora und sieh dabei zu, wie er sie in Stücke schneidet. Wenn du ihn nicht mit Bannen unschädlich machst, bleibt dir meistens nur noch eine Option: verlieren.\n","es_ES":"<p>Chanho \"ssumday\" Kim es uno de los jugadores más jóvenes del panorama competitivo de Corea del Sur, con sólo 19 años. A pesar de su juventud, es un top temido por sus enemigos -- y con razón. Ssumday fue elegido mejor jugador del Split de verano de 2015 con un KDA de 5.22 a lo largo de la temporada. </p>\n\n<p>Ssumday rinde tanto con magos como luchadores, pero en el Split de verano de la LCK 2015 donde mejor ha rendido ha sido con tanques. No han sido pocas las veces en las que se ha echado el equipo a la espalda y lo ha llevado a la victoria. Si consigue jugar con Maokai o Shen, más vale que escojas campeones que puedan quitártelo de encima, porque ssumday te perseguirá hasta el fin del mundo si hace falta para acabar contigo. </p>\n","pt_BR":"<p>O topo da KT Rolster, Chan-ho \"ssumday\" Kim, é uma das jovens armas da Coreia, com apenas 19 anos de idade. Apesar de novo, ssumday é um topo muito temido - e isso é justificável. Ele foi votado como o Melhor Jogador da LCK de Verão 2015, sendo campeão de A/M/A com 5.22 durante a etapa. Dê um centímetro de espaço, e ele pegará um quilômetro. E não, não foi uma piada.\n</p>\n<p>\nSsumday é competente com magos e lutadores, mas a maioria de suas atuações dominantes na LCK de Verão em 2015 foi com tanques. Em múltiplas ocasiões ele colocou a KT Rolster nas costas e carregou até a linha final. Se ele colocar as mãos no Maokai ou no Shen, tenha a certeza de que você vai trazer um pouco de contra-iniciação, porque Ssumday vai te caçar até o fim do mundo.\n</p>"},"foreignIds":{"drupalId":"2147","TRLH1":"200000192","TRLH2":"200000096"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":967,"slug":"big","name":"Big","firstName":"Terry","lastName":"Chuong","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/big-9eh6ixp9.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:09:32.000Z","updatedAt":"2017-06-14T20:10:51.000Z","bios":{"fr_FR":"<p>Terry « BIG » Chuong, connaît déjà les LCS NA, mais seulement en tant que remplaçant.</p> \n\n<p>Celui qui se faisait auparavant appeler « Baby » a découvert les studios des LCS lors de la 11e semaine du segment d'été de la saison 2014 au sein de CLG, en remplacement des joueurs de l'équipe première partis s’entraîner en Corée du Sud. Il est ensuite retourné acquérir de l'expérience au sein de la scène challenger nord-américaine chez Storm, au côté de Samson « Lourlo » Jackson, à présent top laner de Team Liquid, et Zachary « Mandatorycloud » Allan, ancien mid laner de XDG. Puis retour en LCS en 2015 lors des trois premiers matchs du segment d'été en tant que support de Team Dragon Knight. Une expérience difficile pour le joueur dans une équipe réunie à la va-vite en raison de l'impossibilité pour l'organisation de faire venir ses titulaires en NA à temps pour le début de la saison.</p>\n\n<p>Pas dégoûté du monde professionnel pour autant, Big est derechef retourné sur la scène challenger, cette fois au sein d'Imagine. Equipe dans laquelle le joueur s'est retrouvé support d'un carry AD français, Pierre « Steeelback » Medjald, fraîchement débarqué en NA après la fin de son contrat chez Fnatic. Une opportunité sans nulle doute formatrice pour le joueur, même s'il n'a pas réussi à se qualifier en LCS avec cette équipe, défaite 3 victoires à 1 par Team 8 lors du tournoi de promotion. </p>\n\n<p>Qu'à cela ne tienne, Baby est aujourd'hui de retour en LCS NA, enfin en tant que titulaire. Il est certes une fois de plus dans un effectif qui pose plus de questions qu'il n'apporte de certitudes, mais ça n'en reste pas moins une occasion en or pour lui de montrer quel est véritablement son niveau. </p>\n","en_US":"<p>\nYou may know Terry “Big” Chuong from his time spent on Team Dragon Knights. While the organized LCS competition tore TDK apart, Big’s presence in the bot lane did not go unnoticed. He caught the eye of Echo Fox, and was brought on board for the 2016 NA LCS Spring Split.\n</p>\n<p>\nBig has proven to be a protector down to his very bones -- Alistar, Janna, and Braum were his supports of choice. But FOX had their fair share of struggles in spring. Now with a new shot in Dignitas's bot lane, he'll have to prove he's up to the challenge.\n</p>","pl_PL":"<p>Terry bardzo wcześnie zaczął swoją przygodę w wirtualnym świecie, ponieważ w wieku 8 lat już czuł się tam jak ryba w wodzie. Był zafascynowany League of Legends od wydania wczesnej bety, w szczególności uwielbiał grać Heimerdingerem. Sceną esportową zainteresował się dopiero za sprawą prośby przyjaciela żeby zajął pozycję junglera w jego drużynie. „BIG” doskonale się wtedy sprawdził w profesjonalnych meczach, w związku z czym podjął wyzwanie osiągnięcia czegoś w tej dziedzinie. Od października 2013 roku do stycznia 2016 roku starał się znaleźć drużynę, wraz z którą dostanie się do NA LCS. Nie powiodło mu się, ale wielokrotnie był o włos od tego wyczynu. Jednak szczęście mu dopisało i został zauważony przez swoich przeszłych przeciwników – Team Dragon Knights. Dzięki temu miał okazję zostać substytutem dla ich supporta w pierwszych tygodniach letniego sezonu NA LCS 2015. Zyskał bezcenne doświadczenie w profesjonalnej lidze, lecz nie udało mu się spełnić marzeń. Kolejny raz los uśmiechnął się do niego w styczniu 2016 roku kiedy został zaproszony do głównego składu nowo utworzonej drużyny Echo Fox. Pod lisim sztandarem zadebiutował w rozgrywkach NA LCS 2016 w okresie wiosennym.</p>\n<p>Urodzony w Los Angeles, w Kaliforni, wcześniej w karierze znany jako „Baby”, Terry nie jest dedykowanym supportem. Lubi zajmować rolę wspierającego w drużynie, lecz na początku swojej kariery doskonale odnalazł się w jungli. Ponadto oświadczył, że aktualnie, jeśli by nie grał na bot-lanie to zdecydowałby się na objęcie pozycji mid-lanera. Póki co „BIG” dobrze się czuje w roli wspierającego, w szczególności jeżeli kompozycja drużyny pozwala mu na wybór bohatera o olbrzymiej ilości punktów zdrowia. Gustuje w postaciach takich jak Thresh, Braum i Nautilus. Styl gry Terry’ego najlepiej charakteryzuje zawrotna ilość asyst podczas rankingowych meczów – jak na prawdziwego supporta przystało.</p>\n"},"foreignIds":{"ESPORTSTMNT02":"200000673","TRLH1":"200000614"},"socialNetworks":{},"champions":[],"liveGameTeam":21},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166}],"scheduleItems":[{"id":"AVIUnyA7OPWArxM1l4ZP","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:a2b124d3-2d1e-4277-9eb6-b20c961758d9","scheduledTime":"2016-02-14T00:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"5","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:91e640c7-e259-4706-9654-3807bf15f2a4"},"match":"a2b124d3-2d1e-4277-9eb6-b20c961758d9","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"91e640c7-e259-4706-9654-3807bf15f2a4","league":"2"}],"gameIdMappings":[{"id":"6eda6902-440b-421a-8435-476bbb253932","gameHash":"62285d98f8bc13cf"}],"videos":[{"id":890,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:6eda6902-440b-421a-8435-476bbb253932","source":"https://www.youtube.com/embed/C6JkRe-SHsY?wmode=transparent","createdAt":"2016-02-14T01:37:32.000Z","updatedAt":"2016-02-14T01:37:32.000Z","game":"6eda6902-440b-421a-8435-476bbb253932"}],"htmlBlocks":[],"match":{"id":"a2b124d3-2d1e-4277-9eb6-b20c961758d9","name":"IMT-vs-DIG","position":30,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"},{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}],"games":{"6eda6902-440b-421a-8435-476bbb253932":{"id":"6eda6902-440b-421a-8435-476bbb253932","name":"G1","generatedName":"DIG|IMT|G1|a2b124d32d1e42779eb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"},{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}],"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}]],"timestamp":1455410429577,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001550189","gameRealm":"TRLH1","platformId":"TRLH1:1001550189","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"908ca28c-5695-4f78-ac1f-232d402298e8"}],[{"roster":"a2ee8561-f4d4-4e7a-a9a7-368d9289a4e6"}]],"timestamp":1455410429577,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}