{"teams":[{"id":215,"slug":"team-envy","name":"Team Envy","guid":"be713b5f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-1tyrikdl.png","acronym":"NV","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-i4es8cq5.png","createdAt":"2016-05-18T22:11:40.000Z","updatedAt":"2017-07-19T23:33:05.000Z","bios":{"en_US":"<p>Team Envy burst into the NA LCS in 2016 after acquiring the slot of Renegades. Their team fared well, gaining a playoff berth in their first split as an organization. The honeymoon period quickly ended though, and the team switched up their roster ahead of the 2017 Spring Split, adding veterans Lira and Apollo into the mix. After narrowly avoiding relegation, Envy will build around their breakout jungler Lira as they head into the summer split.</p>\n<p>Coach: Dong Hwan \"Violet\" Kim</p>","de_DE":"Team Envy stürmte 2016 in die NA LCS, nachdem sie den Platz der Renegades ergattert hatten. Die Mannschaft präsentierte sich gut und schaffte es gleich in ihrem ersten Split, in die Entscheidungsspiele einzuziehen. Kurz darauf endete die Hochphase jedoch und die Mannschaft ergänzte ihre Aufstellung für den Frühjahrs-Split 2017 um die Veteranen Lira und Apollo. Die beiden stoßen gerade noch rechtzeitig zum Rest der Mannschaft, um vor dem Beginn des Frühjahrs-Splits, in dem sie wieder die Entscheidungsspiele erreichen wollen, trainieren zu können."},"foreignIds":{},"players":[149,160,247,347,545,680,1449],"starters":[160,247,545,680,1449],"subs":[149,347]},{"id":264,"slug":"flyquest","name":"FlyQuest","guid":"be7244a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flyquest-89bnqpyh.png","acronym":"FLY","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2017-01-05T18:49:16.000Z","updatedAt":"2017-06-23T01:31:34.000Z","bios":{"en_US":"<p>Formerly Cloud9 Challenger, FlyQuest is about to reap the rewards of its Challenger Series success. The team’s mix of ex-Cloud9 veterans and fresh talent saw them rampage their way through to the 2017 NA LCS Spring Promotion Tournament, earning a spot in the NA LCS.</p>\n\n<p>Behind veteran mid laner Hai’s leadership, the team found unexpected success in the 2017 NA LCS Spring Split. LemonNation played the mastermind with his signature notebook, and Balls served as the team’s muscle in the top lane. Maybe you can teach old dogs new tricks.</p>\n\n<p>Coach: Thomas \"ThinkCard\" Slotkin</p>","de_DE":"FlyQuest, ehemals Cloud9 Challenger, ist drauf und dran, für ihren Erfolg in der Challenger Series belohnt zu werden. Mit einer Mischung aus alten Cloud9-Veteranen und neuen Talenten marschierten sie durch das Frühjahrs-Aufstiegsturnier der NA LCS 2017 und haben sich damit einen Platz in der NA LCS gesichert.\n</p>\nTrotz des neuen Besitzers bleibt die Mannschaft größtenteils unverändert. Unter der Führung des Mid-Laner-Veteranen Hai hat das Team hohe Erwartungen für 2017. LemonNation ist mit seinem unverkennbaren Notizblock zurück und Balls ist bereit, als treibende Kraft in der oberen Lane zu fungieren. Sollte FlyQuest Erfolg haben, sind sie der Beweis dafür, dass man auch einem alten Fuchs neue Tricks beibringen kann.\n"},"foreignIds":{},"players":[57,112,114,116,354,500,549],"starters":[57,112,114,116,549],"subs":[354,500]}],"players":[{"id":57,"slug":"wildturtle","name":"WildTurtle","firstName":"Jason","lastName":"Tran","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wildturtle-3siezu72.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-02T18:43:29.000Z","bios":{"en_US":"<p>Jason “WildTurtle” Tran has earned the \"wild\" part of his name through intense aggression in games. Whereas other AD carries excel at the delicate dance of staying out of reach, firing away, WildTurtle goes full aggro and can be found in melee range as often as not. When it backfires, he looks over-eager... but when it succeeds, the fans go crazy.</p>\n\n<p>After finding little playoff success with Immortals in 2016, WildTurtle made his way back to TSM for the start of 2017. Sporting his trademark all-in style, WildTurtle helped TSM to another title in the spring split. He finally shook off his playoff woes in the 2017 NA LCS Spring Finals, taking down Cloud9 in a close five game series. After Doublelift's return, WildTurtle heads to FlyQuest, where he should fit right in with Hai's aggressive shotcalls.</p>","fr_FR":"La partie « wild » (« sauvage ») du surnom de Jason « WildTurtle » Tran vient de son style de jeu particulièrement agressif. Alors que d'autres carrys AD excellent dans l'art délicat de rester hors de portée et d'attaquer à distance, WildTurtle aime aller au contact et se retrouve bien souvent à portée de mêlée. Quand la situation se retourne contre lui, il donne l'impression d'être trop zélé... mais quand il réussit, ses fans se déchaînent.\n\nAprès avoir connu un succès timide lors des play-offs avec les Immortals en 2016, WildTurtle est revenu chez TSM début 2017. Avec son style agressif caractéristique, il apporte à TSM le mordant qui lui manquait depuis le départ de Doublelift. Il a fini par oublier ses déboires lors de la finale du segment de printemps des LCS NA 2017, en éliminant Cloud9 lors d'un match serré en cinq manches. WildTurtle compte bien tout donner pour connaître un succès similaire au Brésil, lors du Mid-Season Invitational 2017.\n","pl_PL":"Jason „WildTurtle” Tran zawdzięcza „dziką” część swojego przydomka („wild” — z ang. „dziki”) niesamowitej agresji w grze. Podczas gdy inni prowadzący doskonalą delikatny taniec polegający na trzymaniu się poza zasięgiem i atakowaniu z daleka, WildTurtle idzie na całość i dość często można go zobaczyć walczącego w zwarciu. Gdy to się źle skończy, zarzuca się mu nadgorliwość... ale gdy się uda, fani szaleją.\n\nPonieważ nie osiągnął wielkich sukcesów z Immortals w 2016 roku, WildTurtle powrócił do TSM z początkiem 2017 roku. Prezentując swój firmowy, brawurowy styl gry, WildTurtle przywróci TSM agresję, której im brakowało po odejściu Doublelifta. Nareszcie otrząsnął się z problemów w play-offach, pokonując podczas finału wiosny NA LCS 2017 Cloud9 w wyrównanej serii pięciu gier. Wyruszając w podróż do Brazylii na Mid-Season Invitational 2017, zamierza kontynuować ten sukces\n","de_DE":"Jason „WildTurtle“ Tran verdankt das „Wild“ in seinem Namen seiner unglaublichen Aggressivität in den Spielen. Während andere AD-Carrys außerhalb der Reichweite bleiben und dennoch Schaden verursachen, geht WildTurtle immer volles Risiko und ist mindestens genauso häufig in Nahkampfreichweite. Wenn das nach hinten losgeht, wirkt er übereifrig, aber wenn er Erfolg hat, drehen seine Fans durch.\n</p>\nDa er mit den Immortals im Jahr 2016 keinen Erfolg in den Entscheidungsspielen hatte, wechselte WildTurtle Anfang 2017 wieder zu TSM zurück. Mit seinem „Alles oder nichts“-Stil bringt WildTurtle die Aggressivität nach Doublelifts Abgang zu TSM zurück. Er hofft, seine Probleme mit Entscheidungsspielen hinter sich lassen zu können, während er die Lebensleisten seiner Gegner leert, um TSM dabei zu helfen, die Krone im Frühjahrs-Split der NA LCS zu verteidigen.\n","es_ES":"Jason ''WildTurtle'' Tran se ha ganado la parte wild (salvaje) de su nombre gracias a su agresividad en las partidas. Si otros ADC destacan por sus ágiles movimientos, que los hacen inalcanzables y escurridizos, WildTurtle se lanza a tope y a menudo se le puede ver a distancia cuerpo a cuerpo. Cuando le sale el tiro por la culata, queda demasiado impaciente; si le sale bien, el público enloquece.\n\nTras quedarse a dos velas en los playoffs con Immortals en 2016, WildTurtle ha vuelto a TSM al comienzo de 2017. Gracias a su distintivo estilo de darlo todo, WildTurtle volverá a aportar un toque de agresividad a TSM tras la retirada de Doublelift. Logró acabar con su miedo a los playoffs en la final de primavera de la LCS NA 2017, en la que consiguió vencer a Cloud9 en una serie de cinco partidas. Intentará tener el mismo éxito en su viaje a Brasil para jugar en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Jason \"WildTurtle\" Tran ganhou a parte do “wild” do seu nome por causa da suas agressões intensas nos jogos. Enquanto outros carregadores mandam bem na delicada dança de ficar fora de alcance, atirando, WildTurtle ataca agressivamente e pode ser encontrado no combate corpo a corpo frequentemente. Quando isso não dá certo, ele parece muito afobado... mas quando dá, os fãs vão à loucura.</p>\n\n<p>Depois de ter um pouco de sucesso nas eliminatórias com a Immortals em 2016, o WildTurtle voltou para a TSM no início de 2017. Exibindo sua marca registrada de ir com tudo, WildTurtle traz a agressividade de volta à TSM depois da saída do Doublelift. Ele finalmente esqueceu o desgosto das eliminatórias nas Finais de Primavera da LCS NA 2017, derrotando a Cloud9 em cinco partidas acirradas. Ele tentará carregar esse sucesso consigo na viagem ao Brasil para o Mid-Season Invitational 2017.\n\n</p>"},"foreignIds":{"drupalId":"178","TRLH1":"200000251","TRLH2":"200000155","TRLT3":"200000235"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/WILDTURTLEX","twitter":"https://twitter.com/tsmwildturtle"},"champions":[],"liveGameTeam":264},{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":264},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":264},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":264},{"id":149,"slug":"nien8","name":"Nientonsoh","firstName":"Zach","lastName":"Malhas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nien8-cf8vutwb.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-19T22:31:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"176","TRLH1":"200000231","TRLH2":"200000135"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":354,"slug":"bigfatlp","name":"bigfatlp","firstName":"Michael","lastName":"Tang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bigfatlp-fvccyz4y.png","hometown":"Canada","region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:39:52.000Z","updatedAt":"2017-01-09T18:10:57.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"320"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":500,"slug":"remilia","name":"Remilia","firstName":"Maria","lastName":"Creveling","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/remilia-2xae9ut5.png","hometown":"USA","region":"NA LCS","birthdate":"1995-02-02","createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-09T22:17:03.000Z","bios":{"en_US":"<p>\nMaria \"Remi\" Creveling is one of the most mechanically skilled up-and-coming supports in North America. Commonly known as \"MadWife\" due to her <a href=\"https://www.youtube.com/watch?v=Ju3VybZ3HY8\" target=\"_blank\">impeccable Thresh hooks</a>, Remi can (and has) single-handedly turned the tides of a game due to her individual skill.\n</p>","fr_FR":"<p>Maria « Remilia » Creveling est l'un des supports les plus prometteurs d'Amérique du Nord en termes de\n\nmécaniques de jeu. Également surnommée « MadWife » grâce à ses lancers de grappin impeccables \n\navec Thresh, Remilia peut renverser la tendance d'une partie à elle toute seule grâce à son talent \n\nindividuel (ce qu'elle ne se gêne pas pour faire). Bien qu'elle fasse ses débuts aux LCS NA, Remilia a \n\naccompli suffisamment d'exploits durant les Challenger Series NA et en file solo pour qu'on puisse avoir \n\nla certitude qu'elle saura terroriser son adversaire.</p>","pl_PL":"<p>To absolutnie unikatowy członek LA Renegades. Patrząc na jej mało znaną przeszłość, nikt się nie spodziewał, że w sezonie 6 to właśnie ona zapisze się na stałe w kartach historii League of Legends. Jest pierwszą kobietą, która wzięła udział w rozgrywkach LCS. Jednak dużo ciekawsza od tego faktu jest jej droga do tego celu. Podróż Marii do NA LCS rozpoczęła się bardzo wcześnie - chociaż pasjonuje się dziełem Riot Games od wczesnego pierwszego sezonu, to do trzeciego nie brała udziału w konkursowych rozgrywkach. W lipcu 2013 na miesiąc dołączyła do Curse Academy i miała okazję zagrać w MOBAFire Challenger Series. Przez kolejne 2 lata szukała swojego miejsca na profesjonalnej scenie League of Legends. Maria miała okazję grać z wieloma znanymi zawodnikami, jak np. \"Chaox”. Kompetencje zdobyte podczas tych poszukiwań, sprawiły, że stała się powszechnie znana i poważana wśród profesjonalnych graczy. W marcu 2015 roku dołączyła do Misfits i od tego momentu zaczęły się jej sukcesy.</p>\n<p>Pierwszym znaczącym wyczynem była wygrana w AlphaDraft Challenger League na przełomie kwietnia i maja 2015 roku. Maria i jej zespół przegrali tylko jeden mecz podczas całego wydarzenia. Następnie skończyła Challenger Series z rewelacyjnym wynikiem 8:2, jednak w dogrywce ulegli Team Coast. Ostatecznie w meczach barażowych pokonali Team Imagine 2:1, a następnie Team Coast 3:2. W ten sposób \"Remilia\" stała się pierwszą kobietą, która została zakwalifikowana do rozgrywek LCS. </p>\n<p>Doskonale widać jak Maria rozwijała swoje umiejętności podczas kolejnych sezonów – zaczynała od złota w pierwszym sezonie, a w każdym kolejnym była o szczebel wyżej. W społeczeństwie League of Legends często jest nazywana „Madwife”, ze względu na wyjątkowe umiejętności w grze swoim ulubionym bohaterem – Threshem. Jednak żaden bohater nadający się jako suport nie jest jej obcy. Grając w szeregach LA Renegades wielokrotnie pokazywała, że również potrafi grać na najwyższym poziomie Morganą, Nautilusem oraz Janną. Dużo można się dowiedzieć o jej preferencjach z portali społecznościowych, gdyż jest wyjątkowo aktywna m.in. na Twitterze. Już po pierwszym rzucie oka na profil Marii widać, że uwielbia anime, co też przysporzyło jej wielu wielbicieli.</p>\n"},"foreignIds":{"drupalId":"1327","TRLH1":"1001220129","TRLH2":"1001160179"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":545,"slug":"lira","name":"LirA","firstName":"Taeyou","lastName":"Nam","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lira-8wdoxm79.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-25T23:33:32.000Z","bios":{"en_US":"<p>Tae-yoo \"LirA\" Nam has been on his jungle game ever since 2013. A veteran of Korea’s LCK, he’s played for teams like CJ Entus, KT Rolster, and the Afreeca Freecs. LirA has impressed while on the Rift, and he’s only gotten better with age. Even though his play improved over time, he began sharing his role with SeongHwan while on the Afreeca Freecs.</p>\n\n<p>The uncertainty with his role going forward lead LirA to look for opportunities elsewhere and soon enough he was on a flight headed to Los Angeles. He joined up with Team Envy as their new starting jungler and looks like a star. Despite a disappointing record, Lira's play in the jungle earned his team leads early in many games. If he can help convert just some of those early leads to late-game ones, LirA and Team Envy can run with the best of them.</p>","de_DE":"Tae-yoo „Lira“ Nam dominiert schon seit 2013 im Dschungel. Als Veteran der koreanischen LCK hat er schon bei CJ Entus, KT Rolster und Afreeca Freecs gespielt. Lira hat in der Kluft beeindruckende Leistungen abgeliefert und er wurde mit dem Alter nur besser. Obwohl er mit der Zeit immer besser wurde, teilte er sich seinen Platz bei den Afreeca Freecs mit SeongHwan.\n</p>\nDa er sich seines Arbeitsplatzes nicht mehr sicher sein konnte, schaute er sich nach anderen Möglichkeiten um, und nur kurze Zeit später saß er in einem Flugzeug Richtung Los Angeles. Er hat sich Team Envy angeschlossen und wie es scheint, ist er eine unmittelbare Verbesserung im Dschungel. Er beherrscht jeden Champion von Lee Sin bis Kindred, es geht nur darum, was sein Team gerade braucht. Liras Reichtum an Wissen und Erfahrung wird es dem neuen Team Envy ermöglichen, im Frühjahrs-Split 2017 wieder um den Einzug in die Entscheidungsspiele zu kämpfen.\n"},"foreignIds":{"drupalId":"4332","TRLH1":"200000225","TRLH2":"200000129"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":264},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":215}],"scheduleItems":[{"id":"AVw2gJNxQMQFcjhwbQ16","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:a5cb773b-fc3e-42fd-9d36-3e570265fa36","scheduledTime":"2017-07-23T22:00:01.060+0000","tags":{"blockLabel":"7","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"a5cb773b-fc3e-42fd-9d36-3e570265fa36","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"eaa8973e-e28d-4d57-8d7c-65395d3c46b4","gameHash":"c0c79c519a724fb7"},{"id":"42f7a5ef-921d-4e33-9408-4eb8ee6004b9","gameHash":"d0ff12cba63ff762"},{"id":"eaafd5bc-b30a-45c8-be5f-9e4a5e178b82","gameHash":"b847c0b13d053324"}],"videos":[{"id":8121,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:42f7a5ef-921d-4e33-9408-4eb8ee6004b9","source":"https://www.youtube.com/embed/uj4yMybRpYY?wmode=transparent&rel=0","createdAt":"2017-07-23T23:43:50.000Z","updatedAt":"2017-07-23T23:43:50.000Z","game":"42f7a5ef-921d-4e33-9408-4eb8ee6004b9"},{"id":8133,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:eaa8973e-e28d-4d57-8d7c-65395d3c46b4","source":"https://www.youtube.com/embed/Xlmaeb9IYVs?wmode=transparent&rel=0","createdAt":"2017-07-24T00:56:21.000Z","updatedAt":"2017-07-24T00:56:21.000Z","game":"eaa8973e-e28d-4d57-8d7c-65395d3c46b4"},{"id":8146,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:eaafd5bc-b30a-45c8-be5f-9e4a5e178b82","source":"https://www.youtube.com/embed/-SazItimV08?wmode=transparent&rel=0","createdAt":"2017-07-24T02:15:48.000Z","updatedAt":"2017-07-24T02:15:48.000Z","game":"eaafd5bc-b30a-45c8-be5f-9e4a5e178b82"}],"htmlBlocks":[],"match":{"id":"a5cb773b-fc3e-42fd-9d36-3e570265fa36","name":"NV-vs-FLY","position":14,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"},{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],"games":{"eaa8973e-e28d-4d57-8d7c-65395d3c46b4":{"id":"eaa8973e-e28d-4d57-8d7c-65395d3c46b4","name":"G2","generatedName":"FLY|NV|G2|a5cb773bfc3e42fd9d36","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"},{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],"standings":{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500857608140,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500853971122,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002290169","gameRealm":"TRLH1","platformId":"TRLH1:1002290169","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"42f7a5ef-921d-4e33-9408-4eb8ee6004b9":{"id":"42f7a5ef-921d-4e33-9408-4eb8ee6004b9","name":"G1","generatedName":"FLY|NV|G1|a5cb773bfc3e42fd9d36","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"},{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],"standings":{"result":[[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1500853237180,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}]],"timestamp":1500849635914,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002290156","gameRealm":"TRLH1","platformId":"TRLH1:1002290156","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"eaafd5bc-b30a-45c8-be5f-9e4a5e178b82":{"id":"eaafd5bc-b30a-45c8-be5f-9e4a5e178b82","name":"G3","generatedName":"FLY|NV|G3|a5cb773bfc3e42fd9d36","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"},{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}],"standings":{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500862900340,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500857517387,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002290172","gameRealm":"TRLH1","platformId":"TRLH1:1002290172","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500862900340,"source":"bestOf","history":[{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500857608140,"source":"bestOf","closed":true},{"result":[[{"roster":"295cd840-d1b2-4fda-8a23-af9d1fd24340"}],[{"roster":"366948fe-89b4-4353-9e46-bb0f86107a6e"}]],"timestamp":1500857517388,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"295cd840-d1b2-4fda-8a23-af9d1fd24340":1,"366948fe-89b4-4353-9e46-bb0f86107a6e":0}}}