{"teams":[{"id":169,"slug":"echo-fox","name":"Echo Fox","guid":"be70e203-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/echo-fox-ejngzoa3.png","acronym":"FOX","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-01-04T23:27:05.000Z","updatedAt":"2017-08-06T19:57:02.000Z","bios":{"fr_FR":"<p>Que se passe-t-il quand une figure médiatique du basketball nord-américain s'intéresse aux LCS ? Ça donne Echo Fox. </p>\n\n<p>L'idée pourrait sembler saugrenue et l'aurait sans aucun doute été il y a deux ans. Oui mais voilà, l'e-sport continue de se développer, notamment grâce à League of Legends, et Echo Fox en est une preuve éclatante. Cette nouvelle équipe qui vient remplacer Gravity Gaming dans les LCS NA est en effet la propriété de Rick Fox, ancien joueur de la NBA notamment pour les Los Angeles Lakers, et acteur à ses heures perdues. Rien que ça ! </p>\n\n<p>Acheter une place en LCS c'est bien, mais ça ne suffit pas. Encore faut-il aligner une équipe compétitive et donc attirer des joueurs de haut niveau. C'est ce qu'a tenté de faire Echo Fox, avec un résultat qui soulève sans doute autant de questions que d'espoirs circonspects chez les fans d'e-sport en général et de League of Legends en particulier. Echo Fox est charpentée autour de son mid laner Henrik « Froggen » Hansen, légende du jeu et un nom qui attirera sans aucun doute le public. Mais le joueur européen a-t-il encore le niveau pour porter son équipe ? Et ses coéquipiers ont-ils les reins assez solides pour l'épauler efficacement ? Que ce soit le joueur coréen de file solo Jeong-hun « kfo » Park en voie du haut ou les trois nord-américains qui complètent l'effectif, les nouveaux compagnons de Froggen manquent pour le moment d'expérience. </p>\n\n<p>Cela peut signifier l'arrivée d'une nouvelle vague de jeunes joueurs bien décidés à faire des étincelles. Cela peut aussi être une saison d'apprentissage difficile qui aboutira à un nouveau passage dans les tréfonds du classement des LCS pour Froggen. Quoiqu'il en soit, les dés sont jetés et Rick Fox va pouvoir regarder ses joueurs depuis le banc tout au long des LCS NA. </p>","en_US":"<p>You'd have trouble finding an easier team to root for than Echo Fox. Given the team's many struggles since joining the league in 2016, including narrowly avoiding relegation in the 2017 NA LCS Spring Promotion tournament, another owner might have jumped ship. But former NBA star Rick Fox isn't just any other owner. His belief in his players is unwavering.</p>\n\n<p>In 2017, Fox is supplementing that belief with some new talent. Former RNG top laner Looper headlines the new additions, along with ex-P1 support Gate. Former Challenger scene jungler Akaadian also joins the team. Nobody has more faith in Echo Fox than its owner; now it's time for the players to prove that faith isn't misplaced.</p>\n\n<p>Coach: Nick \"Inero\" Smith</p>","pl_PL":"<p>Pojawienie się Echo Fox w wiosennym sezonie NA LCS 2016 to powiew świeżości wśród organizacji. Nowo powstała drużyna zastąpiła Gravity w elitarnych rozgrywkach NA LCS, więc śmiało można stwierdził, że od razu skoczyła na głęboką wodę. Ogłoszenie istnienia Echo Fox, a następnie jego składu, wzbudziło wiele emocji wśród społeczeństwa League of Legends. Wynikało to z bardzo małej ilości przecieków na temat powstającego zespołu i ujawnienia atrakcyjnych faktów tuż przed rozpoczynającym się sezonem 6. Dlatego wszyscy zainteresowani dosłownie wychodzili z siebie próbując zaspokoić swoją ciekawość.</p>\n<p>Jednak najbardziej zaskakującymi informacjami dotyczącymi zespołu Echo Fox, były wiadomości o jego właścicielu. Nabywcą miejsca Gravity w NA LCS była powszechnie znana w Ameryce Północnej gwiazda NBA – Rick Fox. Wielu graczy od razu zadało sobie pytanie: jak to się stało, że znana w skali światowej osobistość, tak się zainteresowała grą komputerową. Wyjaśnienia można się doszukać w wielkim uczuciu jego syna, Kyle’a Foxa, do drużyny Counter Logic Gaming. Wkrótce młodemu fanowi udało się zarazić pasją swojego sławnego ojca. W ten sposób trzykrotny mistrz NBA dowiedział się o League of Legends i bardzo szybko również pokochał tą rozrywkę. Można było spotkać Ricka Foxa wśród widzów na wielu wydarzeniach związanych z League of Legends, jak na przykład rozgrywki NA LCS. Rozmawiał z zawodnikami, w szczególności dużo z graczami Counter Logic Gaming, dodając im otuchy przed meczami. Te czynniki doprowadziły sławę do kroku, którego nikt się nie spodziewał – wykupił drużynę Gravity i przemianował ją na Echo Fox. W wywiadzie dla Breitbart powiedział: „Pragnienie, skupienie, poświęcenie i etyka, które widziałem u esportowych atletów przypominają mi presję rywalizacji kiedy ja goniłem za swoją karierą w koszykówkę. Moja pasja została wsparta przez społeczeństwo, jako właściciel drużyny Echo Fox zamierzam popierać jej zawodników w taki sam sposób.”</p>\n<p>Rick Fox zadbał żeby jego drużyna nie została na wstępie zdominowana przez zahartowanych weteranów. Oprócz młodych i obiecujących talentów znalazł w składzie miejsce dla poważanego weterana - Henrika \"Froggen\" Hansena. W wizji właściciela Echo Fox połączenie świeżych pomysłów w wydaniu debiutantów i doświadczenia starych wyjadaczy to przepis na sukces. Uwagę przyciąga także nazwa organizacji – wiadomo, że lisia część pochodzi od nazwiska założyciela, lecz pojawiło się wiele teorii na temat dodatku w postaci słowa „Echo”. Wiele osób doszukało się w tej chwytliwej nazwie nawiązania do międzynarodowego alfabetu lotniczego. Według tej teorii „Echo Fox” to skrócona nazwa fonetyczna dwóch następujących po sobie liter – E i F, czyli w rozwinięciu „Echo Foxtrot”.</p>\n","de_DE":"Es gibt kaum ein Team, das man lieber anfeuert als Echo Fox. Das Team hat seit dem Ligabeitritt 2016 schwer zu kämpfen. Der knapp verhinderte Abstieg im Aufstiegsturnier für die NA LCS 2017 ist nur ein Beispiel dafür, und ein anderer Besitzer hätte das sinkende Schiff sicher verlassen. Aber der ehemalige NBA-Star Rick Fox ist kein Besitzer wie jeder andere. Der Glaube an seine Spieler ist unerschütterlich.\n</p>\n2017 untermauert er diese Einstellung mit einigen neuen Talenten. Looper, der ehemalige Top-Laner von RNG, führt die Neuzugänge an, gemeinsam mit Gate, dem Ex-Supporter von P1. Akaadian, der früher in der Challenger Series als Jungler tätig war, schließt sich ebenfalls dem Team an. Niemand glaubt mehr an Echo Fox als ihr Besitzer, und jetzt liegt es an den Spielern, zu beweisen, dass sein Vertrauen nicht ungerechtfertigt ist.\n</p>\nCoach: Tim „Timkiro“ Cho\n"},"foreignIds":{},"players":[70,191,246,363,607,774,820,1096,1359],"starters":[191,363,774,820,1359],"subs":[70,246,607,1096]},{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]}],"players":[{"id":70,"slug":"looper","name":"Looper","firstName":"Hyeongseok","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/looper-agve6x52.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-01-19T22:02:44.000Z","bios":{"en_US":"<p>Hyeongseok \"Looper\" Jang is the latest Korean top laner to make his LCS debut. The ex-Royal Never Give Up starter is a veteran of the scene, with a career that began back in 2013. Originally known for an aggressive playstyle, Looper has evolved into a multi-faceted laner. The former LPL champion is just as capable of tanking on Maokai as he is carrying on Irelia.</p>\n\n<p>Looper brings his many talents to Echo Fox in 2017. The team hopes to have more success with a Korean import this time around after another one, KFO, struggled as their top laner. Looper has the track record of success that Echo Fox sorely needed. At 23, he's one of the older players in the LCS -- but don't let his age fool you. He's still got plenty in the tank, and just one destination in mind: victory.</p>","es_AR":"<p>Hyeong-seok \"Looper\" Jang se posiciona en la cima como el carrilero superior de RNG y, mientras que otros carrileros superiores son alabados por su estabilidad y consistencia, Looper tiene una historia de ser un poco más agresivo. Fue originalmente conocido por su Singed en el 2013, pero Looper ha evolucionado y ahora es un carrilero multifacético. Eligió a Trundle y Rumble durante la temporada de verano de la LPL, pero es más que capaz de ramificarse, como fue demostrado con su habilidad para resistir con Moakai o acarrear con Irelia cuando es necesario. Con 23 años y con una carrera que data desde el 2013, Looper es uno de los jugadores más veteranos en el Mundial, pero no permitas que su vasta carrera te engañe. Es un maestro al que hace ya tiempo se le quitaron los nervios. Su objetivo está en la victoria.</p>","fr_FR":"<p>Hyeong-seok « Looper » Jang est un vétéran d'élite de la voie du haut. Ayant affronté la crème des joueurs d'Asie et remporté des championnats en Corée et en Chine, il est tout à fait capable d'écraser ses adversaires avec des champions tankys comme Poppy et Nautilus.</p>\n\n<p>Looper est bien souvent en première ligne pour RNG : il possède un réel talent pour utiliser la Téléportation et créer des situations favorables à son équipe, qui peut alors écraser ses adversaires lors d'un combat d'équipes ou contrer une rotation adverse en prenant les bonnes décisions.</p>\n\n<p>Alors qu'il jouait à l'origine un rôle de soutien avec Samsung White, il a su s'adapter au fil des différents patchs et constitue désormais un pilier central du line-up de RNG. C'est lui qui porte la lourde charge d'être un carry et une menace majeure au sein de l'équipe, et il est parfaitement synchronisé avec Mata. Vu le danger permanent qu'il incarne grâce à sa maîtrise de la Téléportation, ses adversaires réfléchiront toujours à deux fois avant de s'élancer hors de leur base.</p>\n\n<p>Ses performances ne sont d'ailleurs pas passées inaperçues : il a été nommé huit fois pour le titre de MVP lors du segment de printemps des LPL.\n</p>","es_ES":"<p>Hyeong-seok \"Looper\" Jang va con la cabeza bien alta como el jugador de la calle superior de RNG y, aunque otros de sus análogos son elogiados por la estabilidad y la regularidad, Looper tiene fama de ser un poco más agresivo. Era conocido inicialmente por su Singed, allá por 2013, pero desde entonces se ha transformado en un jugador polifacético. Añadió a Trundle y Rumble a su plantel durante la temporada de verano de la LPL, pero es más que capaz de expandirse, ya que ha demostrado su capacidad de hacer de tanque con Maokai o de ganar la partida con Irelia cuando haga falta.</p>\n\n<p>Con 23 años y una carrera que data de 2013, Looper es uno de los jugadores más adultos del Mundial, pero no dejéis que su larga trayectoria os engañe. Es un maestro que se deshizo de los nervios hace tiempo. Y ahora se concentra en la victoria.</p>","de_DE":"Hyeongseok „Looper“ Jang ist der neueste koreanische Top-Laner, der sein LCS-Debüt gibt. Das ehemalige Mitglied von Royal Never Give Up ist ein Veteran der Szene, der seine Karriere 2013 startete. Er wurde für seinen aggressiven Spielstil bekannt, aber seither hat sich Looper zu einem facettenreichen Top-Laner entwickelt. Der ehemalige Champion der LPL beherrscht es genauso gut, mit Maokai Schaden aufzusaugen wie mit Irelia Spiele im Alleingang zu entscheiden.\n</p>\nLooper unterstützt 2017 Echo Fox mit seinen vielen Talenten. Das Team hofft, dass sie mit diesem koreanischen Import mehr Erfolg haben, nachdem sich der letzte Koreaner, KFO, als Top-Laner nicht durchsetzen konnte. Loopers Erfolgsbilanz ist genau das, was Echo Fox so dringend braucht. Mit 23 Jahren ist er einer der älteren Spieler der LCS – aber man sollte sich nicht von seinem Alter täuschen lassen. Er hat noch immer genug Reserven und nur ein Ziel vor Augen: den Sieg.\n","pl_PL":"<p>Hyeong-seok „Looper” Jang jest doświadczonym weteranem górnej alei. Mając na koncie walki z najlepszymi zawodnikami z Azji, wygrywając mistrzostwa w Korei i Chinach, doskonale odnajduje się w tłuczeniu swoich przeciwników wytrzymałymi bohaterami, takimi jak Poppy czy Nautilus.</p>\n\n<p>Looper z reguły przewodzi RNG, ponieważ jest jednym z najlepszych graczy pod względem używania Teleportacji, aby tworzyć korzystne sytuacje dla swojej drużyny podczas walk drużynowych, lub przechytrzyć przeciwników w grach skupiających się na macro.</p>\n\n<p>Z początku miał bardziej wspierającą rolę podczas gry w Samsung White, ale przyzwyczajał się do zmian w różnych patchach i teraz jest głównym filarem składu RNG. Jego zadaniem w drużynie jest stanowienie zagrożenia dla wrogich prowadzących. Doskonale zgrywa się z Matą, a jego mistrzowskie stosowanie Teleportacji sprawia, że jego przeciwnicy muszą poważnie się zastanowić, zanim opuszczą swoją bazę.</p>\n\n<p>Jego wyniki nie zostały niezauważone, ponieważ był ośmiokrotnie nominowany na najlepszego gracza podczas wiosennego splitu LPL.</p>\n","pt_BR":"<p>Hyeong-seok \"Looper\" Jang marca presença como jogador do topo da RNG e enquanto outros topos são elogiados pela consistência e estabilidade, Looper tem um histórico de ser um pouco mais agressivo. Ele ficou conhecido inicialmente por seu Singed em 2013, mas Looper evoluiu muito desde então e agora é um jogador muito versátil. Ele escolheu Trundle e Rumble na etapa de verão da LPL, mas pode perfeitamente ampliar seu leque, pois já mostrou suas habilidades de tanque com Maokai e de carregador com Irelia quando foi preciso. Com 23 anos e uma carreira que remonta a 2013, Looper é um dos jogadores mais velhos do Mundial, mas não deixe que sua longa carreira o engane. Ele é um mestre que não se abala facilmente. Seu foco está apenas na vitória.</p>"},"foreignIds":{"drupalId":"683","TRLH1":"200000207","TRLH2":"200000111"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":191,"slug":"froggen","name":"Froggen","firstName":"Henrik","lastName":"Hansen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/froggen-ecvbey01.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-01-19T22:02:25.000Z","bios":{"en_US":"<p>One of the strongest control mage players in the world, Henrik “Froggen” Hansen is legendary in the mid lane on his favorite bird, Anivia. After rising to fame with CLG.eu utilizing a slow and methodical playstyle, Froggen and his squad went through a flurry of team and roster changes. From Evil Geniuses to Alliance, and then from Alliance to Elements, Froggen has had a tumultuous few years.</p>\n\n<p>After keeping Echo Fox from relegation by sheer force of will, Froggen has a new opportunity with 2017's retooled roster. With a former LPL champion in the top lane and a new jungler to gank his lane, the LCS icon is in a great spot to succeed. Now he just has to prove he's still got it after all these years. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">전장 장악형 마법사를 세계에서 가장 잘하는 선수 중 하나인 Henrik “Froggen” Hansen은, 애니비아 플레이로 오래 전부터 전설이 된 선수입니다. CLG.eu 시절 느리지만 정교한 플레이 스타일로 명성을 얻은 Froggen 선수는, 동료들과 함께 여러 번 팀을 바꾸었습니다. Evil Geniuses에서 Alliance로, 그리고 다시 Elements로, 지난 몇 년 간 평탄치 않은 시간을 보냈죠. </p>\n<p style=”font-family:”나눔고딕”;\">2015 유럽 LCS 스프링, 서머 스플릿에서 연속해서 7위를 기록한 Froggen 선수와 Elements가 세계 최고 수준의 팀들과 경쟁하려면 뭔가 근본적인 문제를 해결해야 한다는 사실은 자명해 보입니다. 하지만 Froggen 선수의 과거 활약을 생각해보면 아직 그에 대한 기대를 내려놓을 때는 아닙니다. 이번 올스타 대회가 부활의 신호탄을 올릴 수 있는 절호의 기회일지도 모르죠. </p>\n","fr_FR":"<p>Anivia le pigeon bleu. Est-il vraiment besoin de présenter Henrik « Froggen » Hansen ? Le Danois fait partie des quelques légendes de League of Legends encore en activité. Membre de la trilogie originale des dieux européens de la voie du milieu en saison 2, il déchaîne les foules depuis près de 4 ans. Considéré aujourd'hui encore comme le meilleur joueur d'Anivia au monde, Froggen porte avec lui le mythe de CLG.EU et des affrontements mythiques qu'il a menés contre Moscow 5 tout au long de la saison 2.</p>\n\n<p>Mais depuis, l'eau a coulé sous les ponts et le sort n'a pas été favorable au joueur. Dès la saison 3 et l'apparition des LCS, les anciens de CLG.EU ont souffert et laissé d'autres joueurs remporter titres et participation aux championnats du monde. Sentant que des changements étaient nécessaires, le joueur a alors construit autour de lui une équipe annoncée avant le début des LCS EU 2014 comme la première « superteam » de League of Legends. Malheureusement cette équipe construite pour tout gagner a enchaîné l'excellent et le bien moins bon, aussi bien capable de remporter un titre de champion des LCS EU lors du segment d'été que d'être la première équipe européenne à perdre contre des brésiliens lors du Championnat du monde 2014.</p>\n\n<p>La situation du Danois ne s'est pas arrangée en 2015 : il s'est retrouvé bien malgré lui à lutter non pas pour les titres mais pour éviter de se retrouver en tournoi de relégation des LCS EU. Pour la première fois de sa carrière, les critiques d'une partie du public ont été aussi sonores que l'enthousiasme de ses fans. L'ancien recordman du nombre de minions tués en un minimum de temps en compétitif s'est retrouvé considéré par certains comme un joueur trop passif et incapable de prises de décisions. Pire, l'arrivée en fanfare d'une nouvelle génération de joueurs professionnels a bousculé un peu plus chaque jour son statut de mid laner de classe mondiale.</p>\n\n<p>Alors Froggen a fait le grand saut, il est parti en NA, découvrir encore une nouvelle équipe et un nouvel environnement. Un nouveau défi, même s'il ne sera pas dépaysé de retrouver son vieil adversaire Alexey « Alex Ich » Ichetovkin dans les LCS NA. Un dernier défi peut-être aussi, pour celui qui doit plus que jamais prouver qu'il est toujours un monstre du jeu et pas seulement une ancienne gloire dépassée par la concurrence.</p>\n","pl_PL":"<p>Mało kto z europejskich graczy nie słyszał o Henriku \"Froggen\" Hansenie. Duńska ostoja doskonałości na mid-lanie imponuje fanom od pierwszego sezonu. Do grudnia 2011 próbował swojego szczęścia w różnych drużynach, z czego najcieplej wspomina poznanie przyjaciela – Mike’a \"Wickd\" Petersena. Wraz z nim pod koniec 2011 roku trafił do zespołu, gdzie spełniło się wiele z jego marzeń. W Counter Logic Gaming Europe Henrik spędził swój najbardziej owocny okres, konkurując na arenie światowej z najlepszymi ówczesnymi drużynami. W 2012 roku wygrał szereg poważnych i mniejszych międzynarodowych turniejów, lecz największym osiągnięciem było dostanie się na Mistrzostwa Świata drugiego sezonu. W związku z wejściem na arenę azjatyckich zespołów, drużyna CLG EU nie była faworytem, lecz udało im się wszystkich zaskoczyć. Nie tylko podołała wyjściu z grupy, ale również rozgromiła najstarszy chiński zespół Team WE w ćwierćfinale. W półfinale ekipie Henrika nie powiodło się tak dobrze, chociaż wygrali jeden mecz z trzech. Trzecia pozycja ex aequo na takim wydarzeniu była bardzo nobilitująca dla całego CLG EU. </p>\n<p>Wkrótce po tej imprezie drużyna została przemianowana na Evil Geniouses, lecz skład pozostał ten sam. Jednak w międzyczasie na profesjonalnej scenie pojawiło się wiele nowych talentów i konkurencja radykalnie urosła w siłę. W związku z czym „Froggen” nie odniósł tak oszałamiających sukcesów jak w poprzednim sezonie, nawet wiele osób nazwało wyniki EG w tym okresie przeciętnymi. Dlatego Henrik w grudniu 2013 roku opuścił wraz z przyjacielem Mike’iem bezpieczną przystań i w poszukiwaniu sukcesu stał się częścią nowej organizacji – Alliance. W niej osiągnął zdecydowanie więcej niż w poprzedniej drużynie, ponieważ po poznaniu własnych możliwości, w wiosennym sezonie EU LCS 2014, Alliance sięgnęło po złoto. W okresie letnim 2014 roku zajęła pierwsze miejsce w regularnych rozgrywkach, a następnie potwierdziła swoją dominację wygrywając również baraże. W ten sposób „Froggen” zagwarantował sobie udział w kolejnych Mistrzostwach Świata, tym razem sezonu 4. Niestety Alliance nie udało się wyjść z grupy, więc wyczyn z 2012 roku nie został powtórzony. Po tym wydarzeniu organizacja została przemianowana na Elements i zmieniła skład personalny zespołu. Jednak zmiany tylko pogorszyły sytuację Henrika, ponieważ jego drużyna w całym piątym sezonie wypadła przeciętnie, dwukrotnie zajmując 7 miejsce. Jak większość profesjonalnych graczy marzy o pokazaniu się na Mistrzostwach Świata, więc doszedł do wniosku, że musi podjąć radykalne kroki. Pod koniec roku 2015 przeniósł się do Ameryki Północnej żeby dołączyć do nowo powstałego zespołu Echo Fox – biorącego udział w wiosennym sezonie NA LCS 2016.</p>\n<p>„Froggen” osiągnął absolutne mistrzostwo w grze Anivią. W ciągu paru lat na scenie esportowej zyskał reputację najlepszego gracza tą postacią. Dlatego został wybrany do uczestnictwa w imprezie All-Stars Paris przez fanów po to, żeby zagrał Kriofeniksem. Osobistym wyczynem Henrika potwierdzającym jego masterię jest zwycięstwo z powszechnie znanym Lee’iem \"Faker\" Sang-hyeokiem. Zwyciężył z nim w pojedynku 1 vs 1 na wydarzeniu All-Stars Los Angeles 2015. Na tym nie kończą się prywatne sukcesy duńskiego mid-lanera – przez długi okres czasu był rekordzistą w zdobytej farmie w regularnych rozgrywkach. Pobił go Karthusem, zabijając 300 stworów w 23 minuty i 10 sekund.</p>","de_DE":"Mit seinem Lieblingsvögelchen Anivia hat sich Henrik „Froggen“ Hansen zu einem legendären Mid-Laner gemausert, der zu den stärksten Spielern der Welt gehört, die Magier mit Massenkontrolleffekten spielen. Nachdem er mit CLG.eu durch seinen langsamen und methodischen Spielstil zu Ruhm gekommen war, haben Froggen und seine Truppe eine Reihe an Mannschafts- und Aufstellungsänderungen durchgemacht. Froggen hat zwischen den Evil Geniuses, Alliance und Elements ein paar turbulente Jahre erlebt.\n</p>\nNachdem er Echo Fox durch reine Willenskraft vor dem Abstieg bewahren konnte, bietet sich 2017 mit der neuen Aufstellung eine neue Chance für ihn. Mit einem ehemaligen Champion der LPL auf der oberen Lane und einem neuen Jungler, der ihn auf der Lane unterstützt, befindet sich die LCS-Legende in einer guten Ausgangsposition. Jetzt muss er nur noch zeigen, dass er es nach all den Jahren immer noch drauf hat. \n","es_ES":"<p>\nHenrik “Froggen” Hansen es uno de los mejores jugadores del mundo con magos de control, y su Anivia mid es legendaria. Froggen dio el salto a la fama en CLG.eu gracias a su estilo de juego lento y metódico, y después de aquello tanto él como sus compañeros sufrieron una gran cantidad de cambios de equipo y plantilla. De Evil Geniuses a Alliance, y después a Elements. Froggen ha tenido unos años ajetreados. \n</p>\n<p>\nTras quedar en séptimo puesto en los splits de la LCS de 2015 de primavera y verano, está claro que Froggen y el resto de EL tienen que solucionar ciertos aspectos fundamentales antes de estar preparados para vencer a los mejores oponentes. Sin embargo, visto el rendimiento de Froggen, pensamos que no todo está perdido. El evento All-Star 2015 puede ser la ocasión perfecta para el resurgimiento de Froggen. \n</p>"},"foreignIds":{"drupalId":"80","TRLH1":"200000209","TRLH2":"200000113"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":246,"slug":"mash","name":"Mash","firstName":"Brandon","lastName":"Phan","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mash-409ix2z3.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-03-08T19:40:34.000Z","bios":{"en_US":"<p>\nBrandon \"Mash\" Phan might be the most veteran non-star player in the 2016 NA LCS Spring Split. There's really no other way to describe a player who has flirted with -- or fallen out with -- greatness since 2011. There are pros playing now who didn't even know LoL was a game back then. Regardless, Mash isn't one to give up -- every time he gets knocked down, he keeps fighting back to his feet and diving back into the fray. \n</p>\n<p>\nMash joined the wildcard Team Impulse squad in the wake of Team Coast selling their LCS spot, and now he's the AD carry for Phoenix1. He is coming off a serious hot streak in the 2015 NA Challenger Series Summer Split where he scored a frightening 16.6 KDA. If history is any indicator, the LCS competition will need to keep an eye on Mash to be safe -- especially if he is on Tristana. \n</p>","fr_FR":"<p>Brandon « Mash » Phan est le carry AD de Team Impulse pour les LCS NA 2016. Étant l’un des quelques joueurs professionnels nord-américain encore en activité depuis la saison 1 de League of Legends, le joueur n’a pourtant jamais réellement réussi à percer au plus haut niveau.  Après avoir enchainé les équipes sans rencontrer de succès pendant les deux premières saisons, le carry AD a enfin connu un premier succès en saison 3 en se qualifiant pour le tout premier segment des LCS NA avec Good Game University. C’est avec cette équipe qu’il a atteint le point le plus haut de sa carrière puisque malgré une saison régulière moyenne, la structure a réalisé un très beau parcours en play-off. Ils ont consécutivement vaincu Team Dignitas et Team Curse pour se qualifier en finale des play-off avant d’y être battus par Team Solomid lors de la toute première bataille pour le titre de champion des LCS NA. Malheureusement l’équipe, entre temps rachetée par Team Coast, n’est pas parvenue à reproduire son succès lors du segment d’été. A la fin de la saison Mash a quitté l’équipe et pris une première fois sa retraite de la scène compétitive de League of Legends. </p>\n\n<p>Le joueur a néanmoins repris le chemin de la compétition en 2014 au sein de la scène challenger. Revenu dans le giron de Team Coast, qui avait été entre temps boutée hors des LCS, il est parvenu à nouveau à se qualifier pour les LCS par le biais du tournoi d’expansion. Malheureusement le rêve s’est rapidement transformé en cauchemar pour le carry AD et son équipe puisqu’ils n’ont plus gagné un seul match après la première semaine. Ils ont terminé la saison avec 1 victoire seulement et 17 défaites au compteur. Un score synonyme de relégation automatique et de retour en Challenger Series. </p>\n\n<p>Aujourd’hui revoilà Mash en LCS NA sous les couleurs de Team Impulse et le moins qu’on puisse dire c’est que les attentes des fans sont faibles, tant concernant l’équipe que le joueur lui-même. Il est difficile d’imaginer qu’un carry AD qui a toujours été au mieux un joueur professionnel médiocre se transforme du jour au lendemain en compétiteur d’exception, surtout au sein d’une équipe qui est possiblement la plus faible dans laquelle il ait jamais joué. </p>","pl_PL":"<p>Kanadyjski strzelec to prawdziwy weteran amerykańskiej sceny, na której występuje od marca 2011 roku. DontMashMe był jednym z pierwszych graczy, którzy w sezonie 1 przekroczyli próg 2000 ELO. W tym czasie zawodnik stworzył wraz z Luisem „Lapaką” Perezem drużynę Team Nice. Po jej rozpadzie dołączył do Teamu XXX, który następnie przekształcił się w unRegistered eSports, a później w Team Curse. Brandon często uczestniczył w turniejach online, osiągając w nich spore sukcesy. Ostatecznie, po ponad roku współpracy z XXX/unRegistered/Curse odszedł z drużyny i przeniósł się do Complexity, ale w nowym zespole również nie zabawił zbyt długo.</p>\n<p>2012 rok upłynął Brandonowi pod znakiem kolejnych prób i zmian zespołów. Choppa in Da Car, Monomaniac Ferus, Team SoloMid Evo – żadna z tych formacji nie okazała się długotrwałym rozwiązaniem. Przełomowe okazało się dołączenie do Teamu Dynamic. Skład po kilku zmianach przeniósł się do organizacji Good Game University i wraz z nim DontMashMe dość niespodziewanie zakwalifikował się do pierwszego w historii, wiosennego splitu NA LCS 2013.</p>\n<p>Z tą formacją występował w elitarnych rozgrywkach, zarówno na wiosnę, jak i w lecie 2013 roku. DontMashMe spisywał się nieźle, a formacja po dość niemrawym starcie na wiosnę, okazała się fenomenem splitu, zdobywając w play-offach drugie miejsce. W lecie nie było już tak dobrze i ekipa zakończyła zmagania na siódmej pozycji, uczestnictwo w kolejnym splicie zapewniając sobie dopiero w barażach. W tym czasie GGU przekształciło się w Team Coast, a DontMashMe został przesunięty na ławkę rezerwowych. W związku z tym, w styczniu 2014 roku, kanadyjski gracz związał się z vVv Gaming Red, z którym bezskutecznie walczył o powrót do NA LCS. Kolejnym przystankiem na drodze doświadczonego zawodnika okazało się Curse Academy, które również rywalizowało na zapleczu najważniejszych rozgrywek. W obydwu drużynach DontMashMe spędził jednak w sumie niecałe pół roku. Brak sukcesów z CA sprawił, że zespół pożegnał się z Kanadyjczykiem, który na pewien czas pozostał bez drużyny.</p>\n<p>Jednakże w czerwcu 2014 roku zgłosił się do niego Team Coast, który spadł z NA LCS i budował skład zdolny powrócić do elitarnych rozgrywek. Tak zaczął się najbardziej trwały okres w karierze Brandona, który potrwał aż do listopada 2015 roku. W tym czasie DontMashMe przeżywał różne okresy. Początkowo udanie rywalizował w Challenger Series i będąc ważnym ogniwem formacji, przyczynił się do zrealizowania planu – Team Coast przegrał co prawda mecze barażowy przeciwko Evil Geniuses, ale wywalczył awans do wiosennego splitu NA LCS 2015 dobrym występem w Expansion Tournamencie. Później przyszedł jednak gorszy czas i DontMashMe miał swój udział w ustanowieniu niechlubnego rekordu – Team Coast zakończył zmagania z fatalnym rezultatem 1-17. Sam strzelec również nie zachwycał, ale pomimo to był najjaśniejszym punktem zmagającego się z problemami zespołu. Widać to w statystykach - co prawda Brandon zajął ostatnie miejsce wśród strzelców, jeśli chodzi o ilości zabójstw oraz asyst, ale zanotował także prawie najmniejszą ilość zgonów wśród graczy ze swojej pozycji.</p>\n<p>Po tym fatalnym splicie Team Coast spadł z NA LCS, ale DontMashMe pozostał w zespole, który został gruntownie przebudowany. Coast pokazał nową twarz w letnim splicie NA CS 2015 i z powodzeniem rywalizował w tych rozgrywkach, stając się fenomenem zmagań. Niestety dla kanadyjskiego strzelca awans do baraży był wszystkim, na co stać było ekipę. Kanadyjczyk odszedł z zespołu i w styczniu 2016 roku dołączył do występującego w NA LCS Teamu Impulse, który kompletował skład na wiosenny split.\nW trakcie swojej kariery DontMashMe zasłynął przede wszystkim świetną grą Twitchem. Co ciekawe, jego nick w tłumaczeniu na język polski znaczy mniej więcej „nie miażdż mnie”. Ponadto charakterystycznym elementem ubioru Kanadyjczyka jest skórzana kurtka, którą nosi niemal zawsze.</p>\n"},"foreignIds":{"drupalId":"43","ESPORTSTMNT02":"200000758","TRLH1":"200000305"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":363,"slug":"keith","name":"Keith","firstName":"Yuri","lastName":"Jew","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/keith-gmei2hih.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-05-24T21:45:13.000Z","bios":{"en_US":"Yuri \"Keith\" Jew has called himself \"the motivator.\" He was the player Liquid and TSM brought in to nip at the heels of an underperforming starter. He finally earned a starting role with Echo Fox in the 2016 NA LCS Summer Split, but he struggled to find his footing. Fortunately, he showed up when it counted, helping Echo Fox avoid relegation against NRG Esports.\n</p>\n<p>After a rough spring split in the bot lane with his new support Gate, Keith will look to bounce back this summer. While his positioning has been suspect, he's proven willing to play a more supportive role as ADC. With playmakers like Akaadian and Froggen on your team, sometimes all it takes is one Enchanted Crystal Arrow for Echo Fox to take a victory. </p>\n","fr_FR":"<p>Yuri « KEITH » Jew est le roi des « memes » et des réactions humoristiques sur internet. C'est aussi un carry AD nord-américain dont tout le monde reconnaît le talent et le titulaire d'Echo Fox sur ce rôle. Mais malgré quelques apparitions dans les LCS NA au cours de la saison 2015, KEITH est pour le moment connu du grand public avant tout pour sa personnalité, particulièrement aux États-Unis et sur Reddit.</p>\n\n<p>Pourtant, ce joueur d'à peine 18 ans n'est pas passé inaperçu lors de son bref passage en LCS NA, bien au contraire. Souvenez-vous, c'était au début du segment de printemps 2015 et tous les yeux étaient tournés vers Team Liquid après que l'organisation eut réussi à faire venir l'ancien champion du monde Chae « Piglet » Gwang-jin en Amérique du Nord. Mais hélas, impossible d'obtenir un visa pour le Coréen avant le début de la saison. C'est là qu'est entré en scène celui qui s'appelait alors KEITHMCBRIEF (oui, tout en majuscules!), engagé comme remplaçant pour les premiers matchs de la saison. Une pression énorme ? Pas pour le jeune carry AD, auteur de performances éclatantes lors de ses premiers matchs en tant que professionnel, avec deux victoires à la clé. Mieux encore, en raison des performances décevantes de Piglet lors des semaines suivant son arrivée, KEITH a eu le plaisir d'être rappelé deux semaines en cours de saison par Team Liquid. Pour prendre, un temps, la place d'un ancien champion du monde. Une sacrée carte de visite, d'autant plus quand on sait qu'il a réalisé à cette occasion des matchs plus qu'honorables, avec notamment une fiche de 9/1/12 sur Caitlyn. Après un retour infructueux en Challenger series, le joueur a de nouveau fait office de joker de luxe des LCS NA en remplaçant cette fois Jason « WildTurtle » Tran pour un match.</p>\n\n<p>Cette saison, c'est en tant que titulaire d'une toute nouvelle équipe que le jeune joueur va retrouver et affronter ceux qu'il remplaçait hier. Toujours sans pression, mais sans nul doute avec l'envie de bien faire.</p>\n","pl_PL":"<p>\"KEITH\" zainteresował się profesjonalną sceną w połowie 4 sezonu. Wcześniej grał w inne tytuły typu MOBA, lecz ostatecznie najbardziej spodobało mu się League of Legends, dlatego w maju 2014 roku dołączył do Team Gyrations. Tam miał okazję nabrać doświadczenia i poznać przyszłe sławy, takie jak: „NintendudeX” I “Adrian”. Dopiero w kolejnym zespole zaczął odnosić widoczne sukcesy, gdyż będąc w Team LoLPro zagrał w turnieju rozszerzającym skład NA LCS. Szansę Yuriego na coś więcej zostały przekreślone przez Team Coast, który pokonał jego drużynę we wczesnym stadium wydarzenia. Mogło to wynikać z tego, że \"KEITH\" w Team LoLPro zajmował pozycję supporta, a jego główną rolą jest AD Carry. </p>\n<p>W styczniu 2015 roku został zrekrutowany do Team Liquid Academy, co dało mu niesamowite możliwości rozwoju. Pierwszą okazję dostał kiedy na początku wiosennego sezonu 2015 główny AD Carry Team Liquid, „Piglet”, miał problemy z wizą. W związku z tym Yuri został poproszony o wystąpienie jako substytut w regularnym sezonie NA LCS. To był milowy krok w jego karierze profesjonalnego zawodnika, gdyż okazało się, że doskonale sobie radzi wśród najlepszych graczy. Już w pierwszym tygodniu wygrał z takimi potęgami jak Team Impulse i Counter Logic Gaming. Po powrocie brakującego AD, \"KEITH\" grał w szeregach Team Liquid Academy w Challenger Series, niestety bez większych sukcesów. Została mu również dana szansa na miejsce w głównym składzie Team SoloMid, jednak zagrał tylko w jednym tygodniu, po czym organizacja zdecydowała się wrócić do poprzedniego AD Carry. </p>\n<p>Ulubionym bohaterem Yuriego bez wątpienia jest Lucian. Grając głównie Klerykiem Broni siał zniszczenie wśród nieprzyjaciół, dzięki czemu szybko znalazł się w Kręgu Pretendenta. W profesjonalnych rozgrywkach nie dane mu było zagrać ukochaną postacią, lecz mimo tego poradził sobie śpiewająco. Reprezentując Team Liquid podczas NA LCS zaskoczył widzów swoimi zdolnościami w grze między innymi Corkim, Caitlyn i Kog’Mawem. Ciekawostką jest to, że pseudonim Yuriego jest pisany dużymi literami, ponieważ pragnął większej uwagi.</p>\n","de_DE":"Yuri „Keith“ Jew nannte sich selbst „der Motivator“. Er war der Spieler, den Liquid und TSM einwechselten, wenn einer der Stammspieler eine schwache Leistung ablieferte. Im Sommer-Split der NA LCS 2016 konnte er sich schließlich einen Startplatz bei Echo Fox sichern, aber er hatte Schwierigkeiten, seinen Rhythmus zu finden. Zum Glück konnte er gegen NRG Esports seine ganze Leistung abrufen und damit den Abstieg von Echo Fox verhindern.\n</p>\nIn seinem zweiten Split hat Keith erneut die Chance, als AD-Carry von Echo Fox zu glänzen. Wenn er gut mit seinem neuen Supporter Gate harmoniert, könnte die untere Lane von Echo Fox für eine Überraschung in der NA LCS sorgen. Dieses Jahr wird er nicht strauchelnde AD-Carrys ersetzen, sondern versuchen, mit seiner Mannschaft die Top-Teams der NA LCS ins Schwitzen zu bringen.\n"},"foreignIds":{"drupalId":"2999","TRLH1":"200000210","TRLH2":"200000114"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":607,"slug":"grigne","name":"Grig","firstName":"Jonathan","lastName":"Armao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/grigne-1oxeggm8.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-10T18:09:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3803","ESPORTSTMNT02":"200000546","TRLH1":"200000213","TRLH2":"200000117"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":820,"slug":"gate","name":"Gate","firstName":"Austin","lastName":"Yu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gate-6e1hw2yl.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-07-16T20:31:56.000Z","updatedAt":"2017-05-24T21:45:34.000Z","bios":{"en_US":"<p>Austin \"Gate\" Yu brings his unshakeable optimism to Echo Fox in 2017. After making his debut with Team Impulse in 2015, Gate eventually played some mid lane for the playoff-bound squad. He spent the 2016 NA LCS Summer Split as a member of Phoenix1, where he helped lead the team on a second half surge to avoid relegation.</p>\n\n<p>He'll look to act as the glue that holds Echo Fox's new lineup together in the 2017 NA LCS. With only two returning members from last year's team, Echo Fox might need a lot of that glue. But never tell Gate the odds -- that just makes him more determined to succeed.</p>","pl_PL":"<p>Gate urodził się w 1994 roku w Chinach, w prowincji Syczuan. Niemniej większość swojego życia spędził w Stanach Zjednoczonych i to właśnie tam rozpoczął swoją karierę.</p>\n<p>Pierwszym zespołem w karierze Austina było Final Five, do którego dołączył w październiku 2014 roku. Gate i jego kompani rywalizowali w Expansion Tournamencie do wiosennego splitu NA LCS 2015, ale nie udało im się dostać do elitarnych rozgrywek. Niemniej niezły występ pozwolił na występ w wiosennym splicie NA Challenger Series, gdzie chiński mid-laner i spółka spisali się przyzwoicie, kończąc rywalizację na czwartej pozycji. Niestety w play-offach powtórzyli ten wynik, przegrywając tym samym szansę na udział w turnieju barażowym. Ekipa zmieniła właściciela, a także nazwę - na Vortex. Letni split NA Challenger Series zespół zaczął dość nerwowo i Gate już po dwóch spotkaniach stracił miejsce w składzie, a niedługo później – odszedł z drużyny. W międzyczasie pełnił rolę rezerwowego w Teamie Coast, ale wkrótce, zupełnym przypadkiem, otrzymał prawdziwą szansę. Jak Austin później opowiadał, wraz z kolegą grali w kolejce solowej, a przybici kilkoma porażkami zdecydowali się na niestandardową rotację i postanowili zagrać wspólnie na dolnej alei. Gate pełnił rolę wspierającego, a zawodnicy zwyciężyli sześć spotkań z rzędu, kilkukrotnie spotykając w swoich meczach graczy Teamu Impulse. Postawa Austina zrobiła na nich wrażenie, bo niemal od razu zaproponowali mu dołączenie do drużyny. Gate przyjął propozycję i został zawodnikiem zespołu NA LCS, w którym miał zastąpić Adriana „Adriana” Ma w roli wspierającego. </p>\n<p>W nowym zespole zawodnik zadebiutował w ósmej kolejce zmagań i zaprezentował się z dobrej strony, grając Alistarem. Nie dane było mu jednak długo występować na nowej pozycji, bowiem Teamem Impulse wstrząsnęła informacja o zawieszeniu Yu „XiaoWeiXiao” Xiana. W tej dość kłopotliwej sytuacji Gate przeniósł się na środkową aleję, a Adrian pozostał supportem. Zespół zakończył sezon zasadniczy na wysokim trzecim miejscu, ale kompletnie zawiódł zarówno w play-offach, jak i w turnieju kwalifikacyjnym na Mistrzostwa Świata, a Gate był jednym z najbardziej krytykowanych zawodników. Co prawda statystyki zabójstw i zgonów nie wskazują na to jednoznacznie, ale Austin miał bardzo mały wpływ na poczynania zespołu, co oddają statystyki udziału w zabójstwach i procentowych obrażeń (tylko 22,5% w tym ostatnim zestawieniu). Mid-lanera usprawiedliwia jednak fakt, że miał bardzo mało czasu na zgranie z zespołem i przystosowanie się do poziomu rozgrywek NA LCS. Gate najlepiej spisywał się Lulu oraz Azirem.\nW przerwie między sezonami Teamem Impulse wstrząsnęły ogromne zmiany. Organizacji nie udało się sprzedać miejsca w rozgrywkach i w pośpiechu stworzony został skład, który ma rywalizować w wiosennym splicie NA LCS 2016, a Gate okazał się jedynym graczem starego składu, który pozostał w drużynie. Ponownie zmienił jednak pozycję i na wiosnę będzie pełnił rolę wspierającego.</p>\n<p>Co ciekawe, pochodzenie nicku Austina nie jest zbyt skomplikowane. Wiąże się z postacią Twisted Fate’a, który przez dłuższy czas był ulubionym bohaterem gracza oraz z fascynacją koreańskim nawykiem do nadawania sobie przez zawodników pseudonimów składających się z jednego słowa.\n</p>","fr_FR":"<p>Les fans de LCS ont découvert Austin « Gate » Yu lors de la dernière saison quand le suppléant d’Adrian « Adrian » Ma, alors support de Team Impulse, a dû remplacer au pied levé Yu « XiaoWeiXiao » Xian, le midlaner de l’équipe qui venait d’être banni. Cette année Gate porte encore les couleurs de Team Impulse, mais cette fois en tant que titulaire et de retour au poste de support. </p>\n\n<p>Malgré son bref passage sous les lumières des LCS NA 2015, le joueur sino-américain reste un relatif inconnu. Il s’agit cependant d’un des deux joueurs les plus connus de son équipe actuelle. Autant dire que peu de monde attend quelque chose de la part Gate et des siens durant cette saison.</p>\n\n<p>Une situation qui doit rappeler des mauvais souvenirs à l’ancien des Challenger Series. En effet en 2014 il a été le midlaner de Final Five, une équipe challenger passée en quelques mois de la lumière aux abysses. Apparue à l’occasion du tournoi d’expansion des LCS NA début 2015, l’équipe a surpris tout le monde en poussant Team Fusion à batailler pendant 5 manches. Le tout après avoir éliminé  compLexity.Black 2 victoires à rien pour se qualifier pour la partie offline du tournoi ! Final Five s’est ensuite imposée comme l’une des meilleures équipes des Challenger Series NA avant qu’elle soit rachetée par Team Coast et que deux de ses joueurs soient remplacés par des talents européens présentés comme infaillibles. Sauf que non. Ces changements ont signé l’arrêt de mort d’une équipe qui a ensuite enchainé les défaites sans interruption, ce qui a finalement poussé Gate à en partir et à rejoindre Team Impulse.</p>\n \n<p>À nouveau forcé d’avaler des couleuvres et contraint de jouer dans une équipe promise aux orties par tous les observateurs, on imagine que le joueur ne doit pas être forcément optimiste quant à la suite de sa carrière professionnelle. Il faudra lui prouver une certaine cohésion de groupe pour qu’il accepte de rejoindre une équipe la prochaine fois.</p>\n","de_DE":"Austin „Gate“ Yu unterstützt Echo Fox 2017 mit seinem unerschütterlichen Optimismus. Nachdem er 2015 sein Debüt bei Team Impulse gegeben hatte, übernahm Gate in den Entscheidungsspielen schließlich die Rolle des Mid-Laners. Im Sommer-Split der NA LCS 2016 spielte er bei Phoenix1, denen er in letzter Sekunde zu einem Aufschwung verhelfen konnte, um einen Abstieg zu verhindern.\n</p>\nEr soll die neue Mannschaft von Echo Fox im Frühjahrs-Split der NA LCS 2017 zusammenhalten. Mit nur zwei Mitgliedern, die auch letztes Jahr in der Mannschaft waren, könnte das eine äußerst schwierige Aufgabe werden. Aber man sollte Gate nie sagen, wie die Chancen stehen – dadurch wird er nur noch entschlossener.\n"},"foreignIds":{"drupalId":"3516","TRLH1":"200000211","TRLH2":"200000115"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1096,"slug":"damonte","name":"Damonte","firstName":"Tanner","lastName":"Damonte","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/damonte-2jz1n610.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T21:43:33.000Z","updatedAt":"2017-07-14T22:59:56.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000671","TRLH1":"200000617"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1359,"slug":"brandini","name":"Brandini","firstName":"Brandon","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brandini-3s9xhgwg.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-06-12T20:15:57.000Z","updatedAt":"2017-07-16T22:42:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000670","TRLH1":"200000616"},"socialNetworks":{},"champions":[],"liveGameTeam":169},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AVTfrUP5QMQFcjhwbQjE","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:a6ac9ba9-9b50-4657-bd8c-27f903d17e10","scheduledTime":"2016-06-04T19:00:01.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"1","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:2a6a824d-3009-4d23-9c83-859b7a9c2629"},"match":"a6ac9ba9-9b50-4657-bd8c-27f903d17e10","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"2a6a824d-3009-4d23-9c83-859b7a9c2629","league":"2"}],"gameIdMappings":[{"id":"e31185fa-391a-48d3-a823-aa56e6b1a49f","gameHash":"6b1525560c312f5d"},{"id":"0356066f-1b66-4b72-b501-88c962fabed8","gameHash":"9da12bca41666abe"}],"videos":[{"id":2937,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:e31185fa-391a-48d3-a823-aa56e6b1a49f","source":"https://www.youtube.com/embed/O_uzBKDNBlI?wmode=transparent","createdAt":"2016-06-04T23:03:45.000Z","updatedAt":"2016-06-04T23:03:45.000Z","game":"e31185fa-391a-48d3-a823-aa56e6b1a49f"},{"id":2947,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:0356066f-1b66-4b72-b501-88c962fabed8","source":"https://www.youtube.com/embed/qRz4GSCMt5g?wmode=transparent","createdAt":"2016-06-04T23:40:10.000Z","updatedAt":"2016-06-04T23:40:10.000Z","game":"0356066f-1b66-4b72-b501-88c962fabed8"}],"htmlBlocks":[],"match":{"id":"a6ac9ba9-9b50-4657-bd8c-27f903d17e10","name":"FOX-vs-P1","position":2,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"},{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}],"games":{"3af390f3-3431-46d8-8664-5ba04ec3e5bd":{"id":"3af390f3-3431-46d8-8664-5ba04ec3e5bd","name":"G3","generatedName":"FOX|P1|G3|a6ac9ba99b504657bd8c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"},{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"e31185fa-391a-48d3-a823-aa56e6b1a49f":{"id":"e31185fa-391a-48d3-a823-aa56e6b1a49f","name":"G1","generatedName":"FOX|P1|G1|a6ac9ba99b504657bd8c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"},{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}],"standings":{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465081087838,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465071078676,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001720149","gameRealm":"TRLH1","platformId":"TRLH1:1001720149","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0356066f-1b66-4b72-b501-88c962fabed8":{"id":"0356066f-1b66-4b72-b501-88c962fabed8","name":"G2","generatedName":"FOX|P1|G2|a6ac9ba99b504657bd8c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"},{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],"standings":{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465083036650,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465075700196,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001720171","gameRealm":"TRLH1","platformId":"TRLH1:1001720171","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465083036651,"source":"bestOf","history":[{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465081087839,"source":"bestOf","closed":true},{"result":[[{"roster":"abc7d748-2136-45b5-8d21-b0194184a49f"}],[{"roster":"b523655f-a1ad-461b-9c86-bcba2cb712f7"}]],"timestamp":1465075700197,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"abc7d748-2136-45b5-8d21-b0194184a49f":1,"b523655f-a1ad-461b-9c86-bcba2cb712f7":0}}}