{"teams":[{"id":228,"slug":"misfits","name":"Misfits","guid":"be7195b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/misfits-8fnvxt30.png","acronym":"MSF","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2016-06-03T15:47:57.000Z","updatedAt":"2017-06-07T08:47:16.000Z","bios":{"en_US":"<p>Misfits performed extremely well in the European Challenger circuit, amassing win after win on their way to punching their EU LCS tickets. After making it into the LCS, the team underwent some roster changes, adding PowerOfEvil, and the surprise signing of veteran KaKAO. The team spent time in Korea bootcamping in order to prepare themselves for the next level of competition. With a great mix of veteran leadership and fresh faces, Misfits has a chance to make an unexpected splash this season.</p>\n\n<p>Coach: Hussain Moosvi</p>\n<p> Team Manager: Andy \"CrazyCaps\" Walda</p>","de_DE":"<p>Die Misfits wurden aus der Asche der Renegade: Banditos geboren, nachdem deren Dachgesellschaft aus der LCS verbannt worden war. Die Einheit schlug sich in der europäischen Challenger Series extrem gut und gewann ein Spiel nach dem anderen, bevor sie endlich das Ticket für die EU LCS lösen konnte. Nachdem es die Mannschaft in die LCS geschafft hatte, veränderte sich ihre Aufstellung durch die Zugänge von PowerOfEvil und dem Veteranen KaKAO. Die Mannschaft verbrachte einige Zeit in Korea, um dort zu trainieren und sich auf die Konkurrenz vorzubereiten. Dank der großartigen Mischung aus erfahrenen Anführern und frischen Gesichtern könnten die Misfits diesen Frühling für die ein oder andere Überraschung sorgen.</p>\n<p>Coach: Hussain \"Hussain\" Moosvi</p>\n<p>Mannschaftsleiter: Andy \"CrazyCaps\" Walda</p>","es_ES":"<p>Misfits rindió extremadamente bien en el Challenger Series europeo al conseguir una victoria tras otra en su camino hasta la LCS EU. Después de llegar a la LCS, Misfits ha sufrido algunos cambios de plantel con la adquisición de PowerOfEvil y el sorprendente fichaje del veterano KaKAO. El equipo ha estado en Corea entrenando para prepararse para el siguiente nivel de la competición. Con una gran mezcla de liderazgo veterano y rostros nuevos, Misfits tiene la oportunidad de dejar huella de forma inesperada durante esta temporada.</p>\n\n<p>Entrenador principal: Hussain Moosvi</p>\n<p>Jefe de equipo: Andy \"CrazyCaps\" Walda</p>\n","fr_FR":"<p>Les Misfits ont enregistré d'excellentes performances dans le circuit Challenger européen, enchaînant les victoires et décrochant ainsi leur place aux LCS EU. Après sa sélection pour les LCS, l'équipe a procédé à quelques changements de formation, avec l'ajout de PowerOfEvil et l'arrivée surprise du vétéran KaKAO. L'équipe a passé du temps à s'entraîner en Corée afin de se préparer à un niveau de compétition supérieur. En mélangeant des leaders vétérans et de nouveaux visages, Misfits a une chance de faire un coup d'éclat inattendu cette saison.</p>\n\n<p>Entraîneur principal : Hussain Moosvi</p>\n<p>Responsable d'équipe : Andy « CrazyCaps » Walda</p>\n","pl_PL":"<p>Misfits spisali się naprawdę dobrze podczas europejskich rozgrywek serii Pretendenta, zdobywając jedno zwycięstwo po drugim i zapewniając sobie wstęp do EU LCS. Po dostaniu się do LCS drużyna przeszła kilka zmian składu, dodając PowerOfEvila i zaskakując wszystkich podpisaniem kontraktu z weteranem KaKAO. Drużyna spędziła nieco czasu na obozie treningowym w Korei, chcąc przygotować się do walki na nowym poziomie rywalizacji. Dzięki świetnemu połączeniu przywództwa weteranów i entuzjazmu świeżej krwi, Misfits mają szanse osiągnąć niespodziewany sukces podczas tego sezonu.</p>\n\n<p>Główny trener: Hussain Moosvi</p>\n<p>Menedżer drużyny: Andy „CrazyCaps” Walda</p>\n"},"foreignIds":{},"players":[87,243,357,392,628,1090,1334],"starters":[243,357,628,1090,1334],"subs":[87,392]},{"id":335,"slug":"ninjas-in-pyjamas","name":"Ninjas in Pyjamas","guid":"c11ee870-91e2-475c-8c4d-8331bbcc0fef","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-588ue1or.png","acronym":"NIP","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-fmnft9me.png","createdAt":"2017-05-23T21:16:51.000Z","updatedAt":"2017-07-27T08:06:19.000Z","bios":{"en_US":"<p>After nearly four years away, Ninjas in Pyjamas have sneaked back into the EU LCS. After acquiring the spot of Fnatic Academy, the organization that gave players like Bjergsen and Svenskeren their start is looking to take the league by storm with a brand new roster. The players will have to be nimble if they want to build synergy and challenge the giants of Europe. Don't turn your back on the Ninjas. </p>\n\n<p>Coach: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Team Manager: Robin \"Jed\" Jedhammar</p>","pl_PL":"<p>Po niemal czterech latach nieobecności Ninja zakradli się z powrotem do EU LCS. Po zajęciu miejsca Fnatic Academy — organizacji, która wydała z siebie takich zawodników jak Bjergsen i Svenskeren — drużyna od samego początku zamierza podbić ligę szturmem w całkiem nowym składzie. Zawodnicy będą musieli być niezwykle skuteczni, jeśli chcą zgrać się ze sobą i rzucić wyzwanie gigantom Europy. Nie odwracajcie się plecami do Ninja. </p>\n\n<p>Główny trener: Nicholas „NicoThePico” Korsgaard</p>\n<p>Menedżer drużyny: Robin „Jed” Jedhammar</p>\n","fr_FR":"<p>Après presque quatre ans d'absence, les Ninjas in Pyjamas sont de retour dans les LCS EU. Suite à sa victoire contre Fnatic Academy, l'organisation dans laquelle Bjergsen et Svenskeren ont fait leurs débuts espère prendre la ligue d'assaut grâce à une toute nouvelle formation. Les joueurs devront faire preuve d'une grande agilité pour créer une synergie et mettre les géants européens au défi. Ne tournez pas le dos aux Ninjas. </p>\n\n<p>Entraîneur principal : Nicholas « NicoThePico » Korsgaard</p>\n<p>Responsable d'équipe : Robin « Jed » Jedhammar</p>\n","es_ES":"<p>Después de casi cuatro años, Ninjas in Pyjamas ha vuelto a la LCS EU. La organización que fue testigo de los primeros pasos de Bjergsen y Svenskeren llega para arrasar con una nueva plantilla después de quedarse con el puesto de Fnatic Academy. Los jugadores tendrán que ser astutos si quieren compenetrarse y suponer un desafío para los colosos de Europa. No perdáis de vista a los Ninjas. </p>\n\n<p>Entrenador principal: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Jefe de equipo: Robin \"Jed\" Jedhammar</p>\n","de_DE":"<p>Nach beinahe vier Jahren Abwesenheit haben sich die Ninjas in Pyjamas wieder in die EU LCS geschlichen. Die Organisation, bei der Spieler wie Bjergsen und Svenskeren ihre Profikarrieren gestartet haben, hat sich den Startplatz von Fnatic Academy gesichert und versucht jetzt, die Liga mit einer neuen Aufstellung im Sturm zu erobern. Doch die Spieler müssen sich geschickt anstellen, wenn sie die perfekte Harmonie finden und Europas Schwergewichte herausfordern wollen. Wende den Ninjas ja nicht den Rücken zu. </p>\n\n<p>Cheftrainer: Nicholas „NicoThePico“ Korsgaard</p>\n<p>Mannschaftsleiter: Robin „Jed“ Jedhammar</p>\n"},"foreignIds":{},"players":[197,484,713,750,1115,1684,1721,1913],"starters":[197,484,713,750,1684],"subs":[1115,1721,1913]}],"players":[{"id":87,"slug":"h1iva","name":"H1Iva","firstName":"Aleksi","lastName":"Kaikkonen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/h1iva-3d3cbqxm.png","hometown":null,"region":"Challenge France","birthdate":"1994-08-31","createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-05-27T01:11:02.000Z","bios":{"en_US":"","fr_FR":"<p> H1iva est un support de niveau Challenger. C'est un joueur qui connaît bien la scène professionnelle de League of Legends, après avoir joué dans les équipes Gamers 2 ou Renegades en Challenger Series. Pour cette saison 2016-2017, il rejoint l'équipe Millenium aux objectifs européens.\nSes exploits avec la Team Forge et Renegades ont permis au finlandais de se démarquer et d'acquérir une certaine renommée dans son pays d'origine. Très bon joueur de Tresh, il compte bien prouver à la communauté française qu'il saura être au niveau et mener ses coéquipiers vers la victoire. </p>","cs_CZ":""},"foreignIds":{"drupalId":"1496","TRLH3":"1000145041","TRLH4":"1000125041","FRA1TMNT1":"375321","TRNA1":"1000525385","TREU":"1000565129","FRA1TMNT2":"25245"},"socialNetworks":{"twitter":"https://twitter.com/HiivaLoL"},"champions":[],"liveGameTeam":228},{"id":197,"slug":"shook","name":"Shook","firstName":"Ilyas","lastName":"Hartsema","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shook-43143fnj.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-06-09T11:04:02.000Z","bios":{"en_US":"<p>Ilyas “Shook” Hartsema  made his first LCS appearance in the 2014 EU LCS Spring Split, jumping onto his opponents with every jungle assassin he could find. From Lee Sin to Kha’Zix, and even Evelynn, Shook found true happiness by exploding enemy carries from 100 to 0. His skill and technique in the jungle were proven time and again with impressive displays to both save his allies and slay his foes.</p>\n\n<p>However, with the meta quickly shifting towards tanky champs in the jungle, Shook found himself out of sorts. Claiming 1st place in Europe and participating in the group stages at the 2014 World Championship with Alliance started to look like Shook's peak, and he slowly slid down the mountain in 2015 with Elements and then the Copenhagen Wolves. Now he finds himself back in the LCS with Ninjas in Pyjamas. Here's hoping we see the old Shook, the champion slayer.</p>","de_DE":"<p>Der niederländische Spieler Ilyas Hartsema hört auf den Namen Shook und hat in der Vergangenheit bereits in vielen Teams mitspielen dürfen. Die bekanntesten Besuche hatte er in diesem Fall bei Copenhagen Wolves, Elements oder mousesports. Nachdem er aber alle Teams bereits nach kurzer Zeit wieder verlassen hatte, hofft er jetzt bei Vitality auf eine lange und große Karriere. </p>\n\n<p>Ilyas Hartsema ist ein exzellenter Jungler, der vor allem für seine Spielweise mit Lee Sin bekannt ist. Shook hat 2014 für das Team Alliance gespielt und durfte hier im EU LCS Summer Split und beim EU LCS Spring Split mitwirken. Damals waren gerade Lee Sin und Nidalee auf ihm oft zu sehen. </p>\n\n<p><h2>Die Rolle von Shook </h2></p>\n\n<p>Shook begann seine Karriere in League of Legends als Top-Laner. Nachdem er es aber Leid war, immer wieder von gegnerischen Spielern aus dem Dschungel aufgemischt zu werden, entschloss er sich dazu ein Jungler zu werden. Er selbst beschreibt sich selbst als aggressiver Spieler, der gerne den Kampf beginnt und dafür ein hohes Risiko eingeht. </p>\n\n<p><i>„Ich muss mich manchmal zurückhalten, um nicht zu aggressiv ins Geschehen zu gehen. Manchmal endet es schlimm für mich.“  - Ilyas „Shook“ Hartsema </i></p>\n\n<p>Die aggressive Spielweise spiegelte sich lange Zeit aber nicht nur auf dem Spielfeld wider. Während der dritten Saison bekam er für all seine Accounts einen permanenten Bann, nachdem er lange Zeit eine sehr toxische Einstellung besaß. Erst mit dem Start der Saison im Jahr 2014 durfte Ilyas Hartsema wieder als Shook spielen und war hier als Jungler beim Team Alliance vertreten. Seitdem gibt er alles dafür, zu den besten Dschungel-Spielern aus Europa zu gehören. </p>\n\n<p><i>„Ich glaube ich kann der beste Jungler in Europa werden, sofern ich viel übe. Das Ziel ist die Weltmeisterschaft. Ich werde erst zufrieden sein, wenn ich das erreicht habe.“ - Ilyas „Shook“ Hartsema</i></p>\n\n\n<p><h2>Interessante Fakten </h2></p>\n<p>•\tBeliebte Champions: Lee Sin, Nidalee, Rek´Sai</p>\n<p>•\tNiederländischer Spieler </p>\n<p>•\tBekannt für seine aggressive Spielweise </p>\n","fr_FR":"<p>Ilyas « Shook » Hartsema a fait sa première apparition aux LCS lors du segment printanier des LCS EU 2014, bondissant inlassablement sur ses adversaires pour les assassiner. Que ce soit avec Lee Sin ou Kha'Zix, voire Evelynn, Shook s'est épanoui en supprimant les carrys ennemis. Ses compétences et sa technique dans la jungle ont prouvé à maintes reprises qu'il était aussi bien capable de sauver ses alliés que de tuer ses ennemis.</p>\n<p>Cependant, la meta ayant rapidement évolué en faveur des champions tanky dans la jungle, Shook s'est retrouvé diminué. En 2014, la première place obtenue aux LCS EU et la participation à la phase de groupe du mondial avec Alliance ont été le sommet de la carrière de Shook ; après cela, il a été sur une pente descendante en 2015, avec Elements puis avec Copenhagen Wolves. Team Vitality a toutefois décidé de compter sur lui et a recruté Shook durant l'intersaison 2015. Nouvelle formation, nouvelle organisation et nouveau départ ! Espérons que nous retrouverons l'ancien Shook, celui qui faisait des massacres.</p>","es_ES":"<p>Pocos recuerdan la época en la que Ilyas ‘Shook’ Hartsema decidió prescindir del apodo por el que ahora es conocido para llamarse ‘enVision’. En efecto, después de pasar por organizaciones con las que aspiraba a acceder a la primera edición de la LCS EU, como DragonBorns o mousesports, el holandés decidió modificar su alias con el deseo de iniciar una nueva etapa en su carrera.</p>\n\n<p>Pero, como algunos genios aconsejan, hay que tener cuidado con lo que se desea. El 21 de enero de 2013, cuatro días antes de disputar el clasificatorio para la máxima competición continental, el jungla recibió una sanción que le alejaba de la LCS durante un año. Con su sueño hecho añicos por culpa de su mal comportamiento en las partidas clasificatorias, Shook recuperó su sobrenombre original, quizá para recordarse a sí mismo que tenía que volver al punto de partida para alcanzar su meta.</p>\n\n<p>Lejos de venirse abajo, Shook no tardó en unirse a Pride FC para dominar el circuito amateur europeo junto a Martin ‘Rekkles’ Larsson, cedido por Fnatic debido a la restricción de edad que le impedía codearse con los mejores. La exitosa alineación captó con celeridad la atención de Copenhagen Wolves, que buscaba un hueco en la LCS. La organización danesa, conocida por pulir diamantes en bruto que se unen a proyectos más ambiciosos tras su periodo de formación, fue incapaz de retener a su principal activo cuando Riot Games levantó a Shook su castigo.</p>\n\n<p>Casi diez meses después de ver truncadas sus esperanzas, Alliance le ofreció al prometedor jungla un hueco en el proyecto forjado con la intención de derrocar a Fnatic. El equipo no dio con la tecla adecuada en el split de primavera de 2014, pero encontró la fórmula perfecta en la edición estival. La escuadra no abandonó el liderato durante toda la fase regular gracias en buena parte a las actuaciones de Shook con Lee Sin y Elise, sus dos personajes emblemáticos, que le llevaron a recibir el premio al jugador más valorado de la segunda jornada.</p>","pl_PL":"<p>Shook to dżungler o ogromnych możliwościach, który jednak w ciągu dwóch lat występów na najwyższym poziomie nie do końca potrafił zaprezentować skalę swojego talentu i wydaje się, że nadal ma coś do udowodnienia.</p>\n<p>\nHolenderski gracz zaczynał swoją przygodę z profesjonalną sceną we wrześniu 2012 roku od występów w IWantCookie, które później przekształciło się w Dragonborns, lecz Shook grał w tej drużynie jeszcze zanim zespół wywalczył awans do EU LCS. Później holenderski dżungler dołączył do formacji Pride FC, której potencjał szybko dostrzegły większe organizacje. Ostatecznie formacja została zakontraktowana przez Copenhagen Wolves i całkowicie zdominowała amatorską scenę, a ukoronowaniem dobrych występów był awans do wiosennego splitu EU LCS 2014. Shook jednak miał inne plany i zdecydował się zmienić zespół. Dołączył do Henrika „Froggena” Hansena budującego europejski super-team w Alliance.  Shook był w tym czasie uważany za czołowego leśnika na Starym Kontynencie, wobec czego nie może dziwić, że duński mid-laner do swojego wymarzonego składu wybrał właśnie jego. </p>\n<p>\nOczekiwania co do występów nowej potęgi były jednak ogromne, a zawodnicy mieli problemy by je udźwignąć. Ogromna fala krytyki spadła właśnie na Shooka, który nie prezentował się tak jak tego od niego oczekiwano i miał dość duży wpływ na beznadziejną passę drużyny, która z pierwszych 12 spotkań wygrała tylko cztery pojedynki. Już wieszczono rychły koniec nadziei na dominację w Europie, kiedy Shook i cały zespół przebudzili się i finiszowali na trzeciej pozycji, play-offy kończąc na czwartym miejscu. Już wtedy profesjonalni zawodnicy zachodzili w głowę, dlaczego holenderski dżungler tak znakomicie prezentuje się w grach treningowych, nierzadko niemal samodzielnie ciągnąć drużynę, a tak bardzo zawodzi w meczach o stawkę. Ten problem miał się ciągnąć za Shookiem jeszcze bardzo długo.</p>\n<p>\nPomimo to w letnim splicie 2014 Alliance spisało się już znacznie lepiej – zwyciężyło, przerywając dominację Fnatic, a Shook zrobił duży postęp, jeśli chodzi o występy na scenie. Zachwycał przede wszystkim swoim osławionym Lee Sinem, który do dziś jest jego najmocniejszą postacią. </p>\n<p>\n„Jeśli ktokolwiek miałby równać się z Inseciem, jeśli chodzi o opanowanie Lee Sina, to byłby to Shook” – powiedział nawet polski dżungler Marcin „Jankos” Jankowski.</p>\n<p>\nDrużynie Holendra udało się przerwać dominację Fnatic i wygrać letnią edycję zmagań, a w związku z tym także pojechać na Mistrzostwa Świata. Tam formacja przeżywała kryzys, a Shook ponownie zmagał się ze starymi problemami i do końca swojej kariery w Alliance, które później zmieniło nazwę na Elements, nie potrafił już pokazać pełni swoich możliwości. Wskutek tego zespół w końcu stracił cierpliwość i w letnim splicie zastąpił Holendra Marcelem „Dexterem” Feldkampem. Shook na krótko wylądował jeszcze w Copenhagen Wolves, gdzie zagrał dziesięć ostatnich spotkań splitu i, pozbawiony tak dużej presji, znów błyszczał, ale nie dał rady uratować znajdującej się w fatalnej sytuacji starej/nowej ekipy.\nPo zakończeniu letniej edycji rozgrywek 2015 słuch o holenderskim leśniku zaginął i pierwsze doniesienia wypłynęły dopiero w grudniu 2015 roku, kiedy okazało się, że Shook został dżunglerem w aspirującym do walki o czołowe lokaty Teamie Vitality.\n</p>"},"foreignIds":{"drupalId":"1119","TRLH3":"200000305","TRLH4":"200000405","TRLH2":"1001250065","FRA1TMNT2":"25479"},"socialNetworks":{"twitch":"www.twitch.tv/shooklol","facebook":"www.facebook.com/Shook.LoL","twitter":"https://twitter.com/ShookLoL"},"champions":[],"liveGameTeam":335},{"id":243,"slug":"powerofevil","name":"PowerOfEvil","firstName":"Tristan","lastName":"Schrage","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/powerofevil-dvzrzaxn.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T10:20:35.000Z","bios":{"en_US":"<p>Tristan “PowerOfEvil” Schrage has skill well beyond his years. PowerOfEvil is best known for his mechanical outplays, especially on Cassiopeia, Syndra, and Orianna. And if you don't know him for his mechanical ability, you probably know him for his bizarre champion picks in the mid lane -- we're looking at you, Smite Kayle... with Devourer. PowerOfEvil's success led him to a new team at the end of 2015 -- Origen.</p>\n\n<p>Even under the tutoring of 2016 All-Star mid laner xPeke, PowerOfEvil struggled to find his groove and eventually left Origen at the end of the year. He’s still brimming with untapped potential, and Misfits decided to pick him up in order to bolster their roster. A change of scenery may finally unlock all the talent that has only been seen in spurts since his move to Origen. The time has come for PowerOfEvil to show that his resilience has lead to growth. It’s now or never for the youngster and the stakes can’t get much higher.</p>","pl_PL":"<p>Tristan rozpoczął piąć się w górę w czwartym sezonie, kiedy zaczął być rozpoznawalny w społeczeństwie League of Legends jako naprawdę silny mid-laner. Co prawda grał w różnych drużynach, lecz skupiał się głównie na grze ESL Pro Series i Challenger Series. Jego celem było dostanie się do rozgrywek EU LCS. Ostatecznie dołączył do zespołu Unicorns Of Love, jednak po przegranej z Ninjas in Pyjamas opuścił go na miesiąc. Po tym meczu bardzo pozytywnie wypowiedział się o nim „Alex Ich”, weteran sceny esportowej, będący pod wrażeniem jego umiejętności na mid-lanie. Kiedy \"PowerOfEvil\" wrócił do różowej drużyny, ona w międzyczasie dostała się do turniej kwalifikacyjnego do wiosennego sezonu LCS 2015. To zmobilizowało go do poprawy swoich wyników. Pomimo przegranej z H2K, udało mu się dokonać zemsty na zespole NiP, wygrywając z nim. Dzięki temu zwycięstwu znalazł się w EU LCS 2015.</p>\n<p>\nKiedy \"PowerOfEvil\" znalazł się na profesjonalnej scenie, miał okazję zademonstrować publice swoje najsilniejsze strony. Poprowadził Unicorns Of Love do wielu zwycięstw w wiosennym sezonie 2015, bezlitośnie niszcząc przeciwników Syndrą i Cassiopeią – jednymi ze swoich ulubionych bohaterów. Jego zdolność do zdobywania przewagi samemu, bez dużej pomocy drużyny, sprawiła, że miał też dużą swobodę np. w wyborze postaci. Dzięki dominującej postawie Tristana UOL skończył ten okres na piątym miejscu, czyli naprawdę przyzwoicie. On sam dwukrotnie został wytypowany MVP tygodnia w tym semestrze LCS. Z kolei w letnim sezonie 2015 \"PowerOfEvil\" pokazał jak bardzo niebezpieczny jest grając Orianną i Kog’mawem. Tym razem udało mu się wnieść swoją różową drużynę aż na czwarte miejsce w tym okresie, co jak na gracza, który dopiero w tym roku znalazł się w EU LCS, było niezwykłym osiągnięciem.</p>\n<p>\nNa początku sezonu 6, 13 listopada 2015, Tristan dołączył do zespołu Origen jako szósty zawodnik. Został uznany za tak dobrego mid-lanera, że został z otwartym ramionami przyjęty do drużyny, która dotarła aż do półfinału na ostatnich Mistrzostwach Świata. Swoje członkostwo w nowej organizacji zaczął od sukcesów – wraz z nią wygrał trzecią część 10 sezonu IEM w San Jose. Pokonał tam doświadczone amerykańskie zespoły Team SoloMid i Counter Logic Gaming, nie przegrywając ani jednej gry. To jego pierwsze i prawdopodobnie nie ostatnie tak zdecydowanie zwycięstwo.</p>\n<p>\nPoza mid-lanem PowerOfEvil\" lubi też grać na top-lanie i jako support, lecz zapowiedział już, że na pewno nie zmieni swojej roli. Tak samo jak swojego pseudonimu, którego używał w innych grach przed swoją karierą świecie Runeterry. Jest dumny ze swojej odporności na porażki i panowania nad własnymi emocjami. Na co dzień \" Tristan jest chłopakiem z Bad Soden, w Niemczech, który niegdyś marzył o zostaniu pilotem i lataniu po całym świecie. Zamiast tego, starszy brat zachęcił go do gry w League of Legends, więc realizuje swoje marzenia latając na i wygrywając turnieje. Poza grą na komputerze lubi grać w tenisa i piłkę nożną z przyjaciółmi. Ma szczęście posiadając rodziców, którzy pomimo tego, że woleliby żeby skończył szkołę, wspierają go i pomagają osiągnąć jego cele. </p>\n","es_ES":"<p>Integrante de una familia de ávidos jugones, no es de extrañar que Tristan ‘PowerOfEvil’ Schrage tenga un instinto natural para los videojuegos. Su hermano siguió la estela de su padre, que desde pequeño le introdujo al mundillo ya que acudía a concentraciones de jugadores, y se convirtió en su mentor tras enseñarle el universo de Runaterra.</p>\n\n<p>El alumno, que ocupó la calle central al ser el único rol disponible entre sus amigos, no tardó mucho en superar al maestro. Aunque ambos escalaron posiciones en el ránking hasta alcanzar el rango Aspirante y se iniciaron juntos en el ámbito competitivo con Team Mistral, Gunnar Schrage decidió centrarse en sus estudios. Por contrapartida, PowerOfEvil persiguió la carrera del jugador profesional.</p>\n\n<p>El alemán se unió a EYES ON U, una modesta entidad cuya división europea compitió en la Challenger Series durante la primera mitad de la edición primaveral. Descontento con los mediocres resultados del equipo, que no alcanzó los Playoffs, PowerOfEvil pasó a jugar en dos escuadras al mismo tiempo: por un lado participaba en la ESL Pro Series con Planetkey Dynamics; por otro, ingresó en las filas de Unicorns of Love para volver a competir en la Challenger Series.</p>\n\n<p>Aunque esta vez sí alcanzó la fase eliminatoria, la derrota contra Ninjas in Pyjamas en los cuartos de final le hizo abandonar a los equinos. Para cuando decidió volver a Unicorns of Love, el equipo había logrado la clasificación para los Playoffs de verano. Esta vez galoparon por encima de los ninjas suecos, que les habían derrotado en dos ediciones consecutivas, y consiguieron el pase al Torneo de Promoción.</p>\n\n<p>Aquella eliminatoria contra Millenium supuso la eclosión de Unicorns of Love, que se metió al público en el bolsillo con una quinta partida épica en la que PowerOfEvil destruyó el nexo de los franceses con los últimos puntos de vida que le quedaban a su emblemática Cassiopeia. Sin embargo, fue la primera Intel Extreme Masters celebrada en San José la que catapultó definitivamente a PowerOfEvil al estrellato.</p>\n\n<p>Unicorns of Love acudió al evento gracias a la votación en masa de sus nuevos seguidores, pero aun así llegaba como tapado. Puede que por esta razón el cuerpo técnico de Team SoloMid pasara por alto a Syndra en la fase de selección de campeones, algo que el alemán aprovechó para destrozar a Søren ‘Bjergsen’ Bjerg. Los unicornios no se llevaron el trofeo a casa, pero el joven que quería ser piloto voló de vuelta a casa con una legión de aficionados a sus espaldas.</p>\n\n<p>Ya en la LCS, PowerOfEvil se consolidó como la mayor amenaza de Unicorns of Love, que hizo historia al ganar en los Playoffs al primer clasificado de la fase regular, SK Gaming, gracias a un crucial robo de Barón del mid con Orianna. En la final contra Fnatic sorprendió con Varus, una de sus innovadoras aportaciones al metajuego, pero no fue suficiente para llevarse la corona. Durante el split de verano de la LCS EU 2015, PowerOfEvil continuó siendo el motor de los suyos con campeones relevantes en fases tardías de la partida, como Kog’Maw u Orianna.</p>\n\n<p>Aunque los unicornios no emularon su exitoso paso por los Playoffs, el buen rendimiento del alemán captó la atención de Origen, el equipo que le privó de participar en el Campeonato Mundial 2015. Con sus nuevos compañeros regresó a San José para, esta vez sí, conquistar el campeonato como reemplazo de Enrique ‘xPeke’ Cedeño, uno de los jugadores a los que admira y con el que compartirá el puesto en 2016.</p>","fr_FR":"<p>Le jeune espoir Tristan « PowerOfEvil » Schrage est la première recrue d’Origen depuis la création de la structure. En 2014, le mid laner participe aux Challengers series mais son équipe ne signe pas une grande prestation. Plus tard, il rejoint la formation avec laquelle il se fera connaître : Unicorns of Love. Malgré des résultats discutables, UoL parvient à se qualifier sur le fil pour les play-offs des Challenger series. C’est à ce moment-là que le vent tourne. Plus motivé que jamais, UoL et celui qui se fait surnommer PoE réussissent à obtenir la 3e place en écrasant une équipe Ninjas in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et Aleš « Freeze » Kněžínek, ne cédant que face aux H2k de Fabian « Febiven » Diepstraten.\n\n<p>PowerOfEvil doit alors remporter un match en trois manches gagnantes s’il veut accéder aux League of Legends Championship Series. La victoire semble compromise puisque Millenium, l’équipe adverse, s’offre trois balles de match après avoir remporté les deux premières parties. Mais à ce moment-là, UoL décide de sortir sa botte secrète, Poppy top, et réussit l’impensable, se qualifiant de justesse au segment de printemps 2015.\n\n<p>Devant cette remontée fantastique, un style de jeu osé, des champions atypiques et un nom d’équipe attachant, les invocateurs décident de voter à 48% pour Unicorns of Love afin qu’ils participent aux Intel Extreme Masters San Jose. PowerOfEvil et ses coéquipiers font honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, PoE signe un tournoi exemplaire en se faisant particulièrement remarquer avec LeBlanc et Syndra.\n\n<p>En LCS, le mid laner impressionne encore et obtient le titre de meilleur joueur de la semaine à deux reprises. Il hisse son équipe à la très correcte 5e place de la saison régulière et arrive aux play-offs en tant qu’outsider, mais lui et son équipe démontrent très vite qu’ils sont déterminés en éliminant Gambit Gaming sans trembler. PowerOfEvil ne s’arrête pas en si bon chemin et s’impose face au premier de la saison régulière, SK Gaming, avant de donner du fil à retordre à Fnatic en finale.\n\n<p>Plus qu’un bon joueur, PowerOfEvil aime l’innovation et n’hésite pas à sortir des sentiers battus. Lors du segment de printemps, il joue Orianna avec Châtiment pour s’équiper de l’enchantement Glaive Runique et réussit un quintuplé. Cependant, ses expériences ne sont pas toujours un succès, en témoigne sa Kayle équipée d’un enchantement Dévoreur. Pendant le segment d’été, Unicorns of Love réitère une bonne performance mais échoue à obtenir la troisième place de play-offs. UoL se fait ensuite balayer par Origen et perd toute chance d’accéder au mondial 2015.\n\n<p>Fin novembre, lors des IEM San Jose, PowerOfEvil dispute ses premières rencontres au sein d’Origen, sa nouvelle équipe. Aux commandes de champions qu’il connaît bien, l’Allemand permet à sa nouvelle équipe d’éliminer TSM puis de remporter la finale face à Counter Logic Gaming, sans encaisser la moindre défaite et en montrant un niveau de jeu très convaincant. Ce début est de bonne augure et PoE devrait profiter de l’expérience de Enrique « xPeke » Cedeño-Martinez pour atteindre son plein potentiel cette année.\n","de_DE":"<p>Tristan „PowerOfEvil“ Schrage ist in seinen jungen Jahren bereits extrem talentiert. PowerOfEvil ist vor allem dafür bekannt, seine Gegner mit Cassiopeia, Syndra und Orianna in Sachen Spielmechanik zu übertreffen. Und wer ihn nicht deshalb kennt, kennt ihn wahrscheinlich aufgrund seiner seltsamen Championwahlen für die mittlere Lane – damit meinen wir vor allem Kayle mit Zerschmettern … und Verschlinger. Ende 2015 führte der Erfolg PowerOfEvil zu einer neuen Mannschaft – Origen.\n\nBei Origen hatte PowerOfEvil jedoch trotz der Hilfe des Mid-Laners des All-Stars-Events 2016, xPeke, Probleme, seinen Rhythmus zu finden, weshalb er die Mannschaft am Ende des Jahres wieder verließ. Er steckt immer noch voller Potenzial und die Misfits haben ihn aufgenommen, um ihre Aufstellung zu verstärken. Dieser Tapetenwechsel könnte sein Talent endgültig zum Vorschein bringen, das in seiner Zeit bei Origen nur selten zu sehen war. PowerOfEvil muss jetzt beweisen, dass er sich dank seiner Belastbarkeit verbessern konnte. Der Einsatz ist hoch und für ihn heißt es jetzt: „Alles oder nichts.“</p>"},"foreignIds":{"drupalId":"1455","TRLH3":"200000051","TRLH4":"200000154"},"socialNetworks":{"facebook":"www.facebook.com/thepowerofevil","twitter":"https://twitter.com/PowerOfEvilLoL"},"champions":[],"liveGameTeam":228},{"id":357,"slug":"ignar","name":"IgNar","firstName":"Dong-geun","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ignar-5rj4dfc4.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-09T11:01:30.000Z","bios":{"en_US":"Dong-geun \"IgNar\" Lee hails from South Korea but got his professional start in North America with Winterfox, although he didn’t appear in a single game for them. He eventually moved back to Korea and played with both Incredible Miracle and KT Rolster, gaining valuable top tier competitive experience.\n\nAfter proving that he could hang with the best in Korea, IgNar once again moved continents, except this time he made his way to Europe to play for the EUCS squad Misfits. He excelled as their support and helped them into the EU LCS. While assisting his team in cutting the Challenger competition down to size, IgNar played Braum, Bard and everything in-between. His wide champion pool should help give Misfits a fighting chance against the best teams Europe has to offer.</p>","de_DE":"<p>Dong-geun „IgNar“ Lee stammt aus Südkorea, hat seine professionelle Karriere aber bei Winterfox in Nordamerika begonnen (obwohl er für die Mannschaft kein einziges Spiel bestritten hat). Daraufhin ging er zurück nach Korea, wo er sowohl mit Incredible Miracle als auch mit KT Rolster Erfahrungen sammeln konnte.\n\nNachdem er bewiesen hatte, dass er es mit den besten Spielern Koreas aufnehmen konnte, zog IgNar nach Europa, um dort in der EU CS für die Misfits zu spielen. Dort lieferte er eine überragende Leistung als Supporter ab und half der Mannschaft, in die EU LCS einzuziehen. IgNar spielte sämtliche Champions von Braum bis Bard und half seiner Mannschaft, die Konkurrenz in der Challenger Series dem Erdboden gleich zu machen. Sein umfangreicher Champion-Pool sollte den Misfits helfen, gegen die besten Mannschaften Europas bestehen zu können.</p>"},"foreignIds":{"drupalId":"3777","TRLH4":"200000156","TRLH3":"200000053"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":392,"slug":"paragon","name":"Paragon","firstName":"Hyun-Il","lastName":"Choi","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/paragon-6qnhxpgh.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-03-07T19:18:45.000Z","updatedAt":"2017-05-31T21:00:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2126","TRLH1":"1001070001","ESPORTSTMNT02":"200000987","TRLH3":"200000252","TRLH4":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":484,"slug":"promisq","name":"sprattel","firstName":"Hampus","lastName":"Abrahamsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/promisq-2wryxfa8.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-05-15T18:29:25.000Z","updatedAt":"2017-06-09T11:01:09.000Z","bios":{"en_US":"<p>\nHampus “sprattel” Abrahamsson (formerly PromisQ) is a relatively new player in the EU esports scene. He joined Elements in 2015 as their starting support, taking the place of Nyph. However, Sprattel's launch into the spotlight of professional esports didn't come without its missteps. He struggled in the 2015 EU LCS Summer Split and was swapped with substitute support Nyph after the fourth week of competition.\n</p>\n<p>\nThe 2016 EU LCS Spring Split didn’t go much better as he struggled to find rhythm with his bot lane partner, MrRallez. In May, Elements’ seed was acquired by FC Schalke 04, and sprattel was kept on as the team’s starting support. Sprattel will try to right the ship on Ninjas in Pyjamas' new roster this summer.\n</p>","fr_FR":"<p>Hampus « PromisQ » Abrahamsson est relativement nouveau sur la scène e-sport européenne. Il a rejoint Elements en 2015 pour y assumer le rôle de support titulaire à la place de Nyph. Les premiers pas de PromisQ sur la scène professionnelle ne se sont cependant pas très bien passés. Il a rencontré des difficultés lors du segment d'été des LCS EU 2015 et a dû se faire remplacer par Nyph dès la quatrième semaine de la compétition.</p>\n<p>PromisQ a de nouveau retrouvé son poste de support titulaire pour le segment printanier des LCS EU 2016, mais il lui reste encore à prouver qu'il a le talent nécessaire pour être un vrai titulaire aux LCS.</p>","es_ES":"<p>Hampus 'PromisQ' Abrahamsson es un jugador relativamente conocido en la escena europea de League of Legends. Se unió a Elements en 2015 como su apoyo titular, tomando el relevo de Nyph en lo que era su debut como profesional. Pero la cosa no resultó como esperaba y fue sustituido después de cuatro semanas de competición por el mismo Nyph, debido a su pobre rendimiento.</p>\n<p>Sin embargo PromisQ ha vuelto para ser el apoyo titular de Elements en el Spring de Primavera de la LCS EU 2016, ya no es un novato, pero tiene que demostrar que tiene lo que hay que tener para ser un jugador a tener en cuenta en la máxima competición europea.</p>","de_DE":"<p>Zuvor war Hampus \"sprattel\" Abrahamsson unter den Namen promisQ bekannt. Er entdeckte League of Legends erst in der dritten Saison für sich und erfuhr von dort an rasante Verbesserungen. Jeher als Support-Spieler kletterte er in die Top 100 und wurde nach einem kurzen Aufenthalt in einem Amateurteam von Elements unter Vertrag genommen. </p>\n<h2><p>Eine schwere Aufgabe</p></h2>\n<p>Als sprattel im Sommer 2015 in das Kader von Elements aufgenommen wurde, war die Überraschung groß. Genauso groß waren damals die Fußstapfen, in die der LCS-Neuling stapfen musste. Sowohl Patrick \"Nyph\" Funke, als auch Mitch \"Krepo\" Voorspoels sind nicht nur in der Community beliebt, sondern haben vielerorts ihr Können unter Beweis gestellt. Wo Krepo resignierte, sollte das neue Gesicht einen Aufschwung bringen, der kaum noch zu schaffen war. Nach gerade einmal acht Spielen war das Erlebnis LCS schon wieder beendet. In den wenigen Spielen war es vor allem Alistar, mit dem er spielerisch überzeugte und dem Team zu seinen zwei einzigen Siegen während seines Aufenthalts verhalf. </p>\n<p>Die negative Statistik soll aber in keinem Fall damit gleichzusetzen sein, dass der Schwede es nicht verdient hätte, in der LCS zu spielen. Die Organisation glaubt fest an den noch unerfahrenen Spieler. Warum denn auch nicht, viele Teams haben in der Vergangenheit bereits unter Beweis gestellt, was aus anfangs so unbekannten Namen werden kann. Mit Nyph, einem der erfahrensten Supportern Europas, als Coach an seiner Seite kann sich der noch ungeschliffene Diamant nun mit neuem Kader unter Beweis stellen. Dieses Mal nicht inmitten eines Splits, sondern vorbereitet und mit hoch motivierten Kollegen.</p>\n","pl_PL":"<p>Hampus jest wielkim odkryciem Elements. Przed dołączeniem do tej organizacji był członkiem tylko jednej drużyny, inFerno eSports, od marca do maja 2015 roku. Wtedy zmienił barwy na tęczowe i został głównym supportem „żywiołów”. O dołączenie do tego zespołu został poproszony przez głównego trenera - Patricka \"Nyph\" Funke’a. W wywiadzie dla Aftonbladet Esport przypomniał sobie, że kiedy dostał od niego zaproszenie do znajomych w grze, aż poczuł motyle w brzuchu. Powiedział, że uznał to za swoją życiową szansę i zgodził się na tą propozycję. </p>\n<p>Niestety projekt okazał się zdecydowanie mniejszym sukcesem niż się spodziewano. W efekcie czego największe zespołowe osiągnięcia \"Sprattel’a\" nie robią wrażenia. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 uplasował się dopiero na 7 miejscu z wynikiem 7:11. Biorąc pod uwagę ekskluzywność tych rozgrywek, trzeba to uznać za niemały wyczyn. Jednak bardziej imponujący jest efekt jego gry w solo que. W League of Legends gra od 2013 roku, ciągle supportem. Zajmując tą rolę w 3 sezonie udało mu się zdobyć diamentową rangę, a w kolejnych był już w Kręgu Pretendenta, gdzie zdobył aż 800 punktów LP.</p>\n<p>Z całej drużyny, po niezbyt udanym sezonie piątym, pozostał tylko \"Sprattel\". Podczas wywiadów cechowała go rozmowność, pewnie dlatego, że chciał przekazać swoim fanom jak najwięcej o sobie. Tuż przed pokazaniem się w rozgrywkach EU LCS wyraził swoją radość, z tego że będzie mógł się zmierzyć z najlepszymi graczami w Europie. Wielokrotnie wspominał, że konkurowanie z innymi jest dla niego najważniejsze w League of Legends. To właśnie chęć starcia się ze sławami doprowadziła Hampusa tak wysoko. O dziwo jako support jest dużo bardziej skoncentrowany na wspieraniu swojego AD Carry’ego - dlatego chętnie gra Janną, Nami i Morganą.</p>\n"},"foreignIds":{"drupalId":"4329","TRLH3":"200000259","TRLH4":"200000311","TRLH2":"1001250005","FRA1TMNT2":"25420","ESPORTSTMNT02":"200001029"},"socialNetworks":{"twitter":"https://twitter.com/SPRATTEL_lol"},"champions":[],"liveGameTeam":335},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":713,"slug":"heaq","name":"HeaQ","firstName":"Martin","lastName":"Kordmaa","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/heaq-5xfyf5io.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T13:56:18.000Z","bios":{"en_US":"<p>Martin \"HeaQ\" Kordmaa  bounced around Challenger-level teams for most of his career before landing the starting AD Carry position with Giants Gaming. The team had recruited their presumed starter, Upset, but he left the team shortly after. Giants’ search for a new carry intensified and they eventually decided that HeaQ was their number one option. After Giants was relegated, HeaQ now finds himself on the new roster for Ninjas in Pyjamas. He is beyond excited to prove that he has what it takes hang tough with the best in the business.</p>","de_DE":"<p>Martin „HeaQ“ Kormaa hat einen Großteil seiner Karriere damit verbracht, zwischen Mannschaften innerhalb der Challenger Series hin- und herzuwechseln, bis er schlussendlich als AD-Carry bei Giants Gaming landete. Das Team hatte ursprünglich Upset für diese Position rekrutiert, der das Team aber nach kurzer Zeit bereits verlassen hat. Sein Spielname schien damals Programm gewesen zu sein. Die Suche nach einem neuen Carry wurde immer intensiver und schließlich haben sie sich für HeaQ entschieden. Der Position des AD-Carrys auf LCS-Niveau gerecht zu werden, ist nie einfach, aber HeaQ möchte unbedingt beweisen, dass er das Zeug dazu hat, mit den Besten der Besten mitzuhalten.</p>","es_ES":"Martin \"HeaQ\" Kordmaa pululó por equipos de nivel Aspirante durante la mayor parte de su carrera hasta llegar a la posición de ADC en Giants Gaming. El equipo había fichado al que parecía que iba a ser su titular, Upset, pero este abandonó el equipo poco después. La búsqueda de un nuevo carry se intensificó y, al final, decidieron que HeaQ era su mejor opción. Tras el descenso de Giants, HeaQ ahora forma parte de la nueva alineación de Ninjas In Pyjamas. El estonio está más que ilusionado por demostrar que tiene lo que hace falta para enfrentarse a los mejores de la escena.","fr_FR":"Après être passé d'une équipe de niveau Challenger à une autre presque toute sa carrière, Martin « HeaQ » Kordmaa a fini par devenir carry AD titulaire chez Giants Gaming. L'équipe avait recruté son titulaire présumé, Upset, mais il les a quittés peu après. Les Giants ont intensifié leur recherche d'un nouveau carry et ils ont fini par décider que HeaQ était leur meilleure option. Suite à la relégation des Giants, HeaQ se retrouve à présent membre de la nouvelle formation des Ninjas In Pyjamas. Et il est surexcité à l'idée de prouver qu'il est à la hauteur de l'élite de la profession.","pl_PL":"Martin „HeaQ” Kordmaa przez większość swojej kariery przeskakiwał między drużynami na poziomie Pretendenta, po czym objął pozycję głównego prowadzącego w Giants Gaming. Drużyna zwerbowała do pierwszego składu Upseta, ale ten wkrótce ją opuścił. Giants zintensyfikowali swoje poszukiwania nowego prowadzącego i w końcu stwierdzili, że najlepszą opcją jest HeaQ. Gdy Giants zostali relegowani, HeaQ znalazł dla siebie miejsce w nowym składzie Ninjas In Pyjamas. Nie posiada się z radości, mogąc udowodnić, że stać go na dotrzymywanie kroku najlepszym w tej dyscyplinie."},"foreignIds":{"drupalId":"4472","TRLH3":"200000098","TRLH4":"200000201"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":750,"slug":"nagne","name":"Nagne","firstName":"Sang-moon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nagne-bnle5yoc.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T10:59:07.000Z","bios":{"en_US":"<p>Sang-moon \"Nagne\" Kim made his mark when he fought SK telecom's superstar mid laner Sang-hyeok \"Faker\" Lee to a standstill during an intense Best of 5 series at the Season 3 World Championship. Since then, Nagne has oscillated between being a force to be reckoned with and being a non-factor. Ninjas in Pyjamas is hoping he can return to form on their new roster. Because when he is on, Nagne is <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">a terror in the mid lane</a>.</p>","fr_FR":"<p>Sang-moon « Nagne » Kim a laissé sa marque en combattant le célèbre mid laner de SK Telecom, Sang-hyeok « Faker » Lee et en le paralysant au cours d'une intense partie en trois manches gagnantes lors du Mondial de la Saison 3. Depuis, Nagne oscille entre le redoutable et l'insipide. Mais récemment, Nagne s'est montré à son meilleur niveau de façon plus constante. Et quand il est en forme, Nagne est <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">une terreur sur la voie du milieu</a>.</p>","pl_PL":"<p>Sangmoon „Nagne” Kim dał się poznać, kiedy walczył z gwiazdą SK Telecom, środkowym Sang-hyeokiem „Fakerem” Lee w trakcie meczu do trzech zwycięstw w Sezonie 3 Mistrzostw Świata. Od tego czasu Nagne potrafił być zarówno kluczowym zawodnikiem, jak i tym prawie nieliczącym się w meczach. Ostatnio jednak dawał z siebie wszystko. A kiedy tak jest, <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">staje się prawdziwym postrachem środkowej alei</a>.</p>","de_DE":"<p>Jedes Team braucht seine Spielmacher und seine konsistenten Spieler. Ein System aus ausschließlich einem von beiden funktioniert nicht. Sangmoon \"Nagne\" Kim ist letzteres davon, er macht alle möglichen Metawandel zu einem gewissen Grad mit und ist einer der Stützen bei KT Rolster. Selten sieht man ihn seine Lane komplett verlieren, genauso hart gewinnen tut er sie allerdings genauso oft. Durch und durch ist der Mid-Lane-Veteran ein verlässlicher Spieler.</p>","es_ES":"<p>Sang-moon “Nagne” Kim dejó huella en la intensa batalla que libró contra SK Telecom y su estrella Faker en las semifinales del Campeonato Mundial de la Temporada 3. Aunque desde entonces, Nagne no ha conseguido encontrar la regularidad, depende del día puede ser o bien uno de los mejores mids de Corea del Sur o bien puede pasar desapercibido en la partida. Últimamente, no obstante, Nagne ha estado jugando a su mejor nivel al 100% del tiempo. Y cuando está a su mejor nivel, es un<a href=\" https://www.youtube.com/watch?v=Zrgae333efs&feature=youtu.be&t=3h34m10s\">  terror en la calle central.</a></p>","pt_BR":"<p>Sang-moon \"Nagne\" Kim deixou sua marca quando enfrentou a grande estrela da SK Telecom, Sang-hyeok \"Faker\" Lee, em uma melhor de cinco durante o Mundial da Terceira Temporada. Desde então, Nagne oscilou entre um dos melhores meios da Coreia e... nada. No entanto, recentemente Nagne tem (re)demonstrado seu potencial. E quando ele está assim, ele é um <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">terror na rota do meio</a>.</p>"},"foreignIds":{"drupalId":"686","TRLH3":"200000306","TRLH4":"200000406"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1090,"slug":"liv","name":"Hanssama","firstName":"Steven","lastName":"Liv","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/liv-a4dgwahi.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-21T21:14:43.000Z","updatedAt":"2017-06-09T10:54:49.000Z","bios":{"en_US":"<p>Steven \"Hans sama\" Liv got his competitive start in 2015, where he joined up with Milenium. Soon after Milenium lost in the EUCS playoffs, Hans sama made his way to Misfits in June of 2016. He helped propel them through Challenger and into the EU LCS for the 2017 Spring Split.</p>\n\n<p>Hans sama comes into the EU LCS at just 17 years old. Largely unproven and lacking the years of experience that many players have at this level, he will have to learn to adapt quickly and step his game up accordingly. Playing against tried and tested world class talent like Rekkles and Zven will prove to be one of the biggest hurdles of his career. He will need to stand up to the best or get swept aside like the rest. Game on.</p>","de_DE":"<p>Steven „Hans Sama“ Liv begann seine professionelle Karriere 2015, als er von Millenium aufgenommen wurde. Im Juni 2016 wechselte Hans Sama kurz nach der Niederlage von Millenium in den Entscheidungsspielen der EU CS zu den Misfits. Er half der Mannschaft, sich über die Challenger Series für den Frühjahrs-Split der EU LCS 2017 zu qualifizieren.\n\nHans Sama ist gerade einmal 17 Jahre alt, wenn er zum ersten Mal in der EU LCS spielen wird. Ihm fehlt die langjährige Erfahrung der meisten Spieler auf diesem Niveau und er wird lernen müssen, sich schnell anzupassen und zu verbessern. Dabei werden die Spiele gegen herausragende Talente wie Rekkles und Zven zu den größten Hürden seiner bisherigen Karriere. Er wird sich gegen die Besten behaupten müssen, sonst wird er wie der Rest aus der Kluft gefegt. Das Spiel kann beginnen.</p>"},"foreignIds":{"TRLH4":"200000155","TRLH3":"200000052"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1115,"slug":"zhergoth","name":"Zhergoth","firstName":"Benjamin","lastName":"Sánchez","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/zhergoth-e48i3ns.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:40:03.000Z","updatedAt":"2017-05-31T21:39:43.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375397","TRLH2":"1001250089","FRA1TMNT2":"25362","TRLH3":"200000269","TRLH4":"200000321"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1334,"slug":"alphari","name":"Alphari","firstName":"Barney","lastName":"Morris","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alphari-3ozuf4zl.png","hometown":"UK","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:04:28.000Z","updatedAt":"2017-06-09T10:15:34.000Z","bios":{"en_US":"<p>Barney \"Alphari\" Morris began his career in 2015 and his play attracted the attention of Misfits who picked him up for their Challenger squad in 2016. He helped them carve a path through Europe’s Challenger scene and straight into the 2017 EU LCS Spring Split.</p>\n\n<p>Alphari spent time in Korea with his teammates in order to prepare for the challenge of playing at the highest level in Europe. He’ll need to come out of the gate swinging in order to keep up with hardened veterans in the top lane. It’ll largely be a trial by fire for the young talent, but the team’s bootcamp, coupled with tutelage from their veteran players, will play a key role in his development as he steps into one of the greatest challenges of his young career.</p>","de_DE":"<p>Barney „Alphari“ Morris begann seine Karriere 2015 und erregte mit seiner Spielweise die Aufmerksamkeit der Misfits, die ihn 2016 in die Mannschaft aufnahmen. Daraufhin half er der Mannschaft, sich einen Weg durch die europäische Challenger Series zu bahnen und den Frühjahrs-Split der EU LCS 2017 zu erreichen. \n\nAlphari verbrachte mit seinen Teamkameraden einige Zeit in Korea, um sich dort auf die kommenden Herausforderungen in Europa vorzubereiten. Er wird sein Bestes geben müssen, wenn er mit den abgehärteten Veteranen auf der oberen Lane mithalten will. Das junge Talent muss gleich eine Feuerprobe bestehen, wenn die größte Herausforderung seiner bisherigen Karriere beginnt, aber das Training mit der Mannschaft und die Hilfe der Veteranen sollten seine Entwicklung vorangetrieben haben.</p>"},"foreignIds":{"TRLH4":"200000152","TRLH3":"200000049"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1684,"slug":"profit","name":"Profit","firstName":"Junhyung","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/profit-2siu86dd.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-12T18:21:45.000Z","updatedAt":"2017-07-06T13:44:20.000Z","bios":{"en_US":"<p>Junhyung \"Profit\" Kim joins the EU LCS after spending a year playing for the best team in the world: SK telecom T1. After splitting time with Huni in the top lane, Profit heads to Europe looking to use what he's learned to dominate the competition.</p>","de_DE":"Junhyung „Profit“ Kim nimmt an der EU LCS teil, nachdem er ein Jahr lang für die beste Mannschaft der Welt gespielt hat: SK Telecom T1. Nachdem er sich mit Huni die Position als Top-Laner geteilt, zieht es ihn jetzt nach Europa, wo er sich mit seinen Erfahrungen an die Spitze kämpfen will.","es_ES":"Junhyung \"Profit\" Kim se une a la LCS EU tras pasar un año jugando en el mejor equipo del mundo: SK telecom T1. Después de un tiempo compartiendo rol con Huni en la calle superior, Profit ha decidido trasladarse a Europa con intención de usar lo que ha aprendido para arrasar en la competición","fr_FR":"Junhyung « Profit » Kim a rejoint les LCS EU suite à une année passée avec la meilleure équipe du monde : SK Telecom T1. Après avoir partagé la voie du haut avec Huni, Profit arrive en Europe déterminé à utiliser ce qu'il a appris pour dominer la compétition","pl_PL":"Junhyung „Profit” Kim dołącza do EU LCS po roku gry dla najlepszej drużyny na świecie: SK Telecom T1. Po rozstaniu z Hunim na górnej alei Profit wybiera się do Europy, chcąc wykorzystać to, czego się nauczył, by zdominować konkurencję."},"foreignIds":{"ESPORTSTMNT06":"200000353","TRLH3":"200000304","TRLH4":"200000404"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1721,"slug":"whiteknight","name":"Whiteknight","firstName":"Matti","lastName":"Sormunen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whiteknight-584o692r.png","hometown":null,"region":"EU Challenger Series","birthdate":"1996-02-16","createdAt":"2017-01-19T13:21:22.000Z","updatedAt":"2017-06-18T19:15:07.000Z","bios":{},"foreignIds":{"esportstmnt05":"200000891","TRLH3":"200000285","TRLH4":"200000337","ESPORTSTMNT02":"200002380"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1913,"slug":"m1rage","name":"M1RAGE","firstName":"Noh Hoon","lastName":"Kwon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/m1rage-ij32gh00.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:48:55.000Z","updatedAt":"2017-05-31T21:33:31.000Z","bios":{},"foreignIds":{"TRLH3":"200000307","TRLH4":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":335}],"scheduleItems":[{"id":"AVxHBnHPQMQFcjhwbQ3m","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:a7291ce1-8129-47e0-830c-da9f8fbac1ec","scheduledTime":"2017-06-08T15:00:00.030+0000","tags":{"blockLabel":"2","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:0ddf2103-0c77-4b59-bec7-7d6599c776b9","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"a7291ce1-8129-47e0-830c-da9f8fbac1ec","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"0ddf2103-0c77-4b59-bec7-7d6599c776b9","league":"3"}],"gameIdMappings":[{"id":"954ddca0-0ce2-4b78-a272-46e7f7619130","gameHash":"949687057bcc55bb"},{"id":"5709363b-fadd-4e2e-8478-b2bf621957e5","gameHash":"815d2aa544c74f76"}],"videos":[{"id":7181,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:954ddca0-0ce2-4b78-a272-46e7f7619130","source":"https://www.youtube.com/embed/epAlxUCo8dA?wmode=transparent&rel=0","createdAt":"2017-06-09T18:09:54.000Z","updatedAt":"2017-06-09T18:09:54.000Z","game":"954ddca0-0ce2-4b78-a272-46e7f7619130"},{"id":7182,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:5709363b-fadd-4e2e-8478-b2bf621957e5","source":"https://www.youtube.com/embed/gcWnxy6PbLI?wmode=transparent&rel=0","createdAt":"2017-06-09T18:10:14.000Z","updatedAt":"2017-06-09T18:10:14.000Z","game":"5709363b-fadd-4e2e-8478-b2bf621957e5"}],"htmlBlocks":[],"match":{"id":"a7291ce1-8129-47e0-830c-da9f8fbac1ec","name":"MSF-vs-NIP","position":1,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}],"games":{"5709363b-fadd-4e2e-8478-b2bf621957e5":{"id":"5709363b-fadd-4e2e-8478-b2bf621957e5","name":"G2","generatedName":"MSF|NIP|G2|a7291ce1812947e0830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1496940965128,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"1002110025","gameRealm":"TRLH3","platformId":"TRLH3:1002110025","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"954ddca0-0ce2-4b78-a272-46e7f7619130":{"id":"954ddca0-0ce2-4b78-a272-46e7f7619130","name":"G1","generatedName":"MSF|NIP|G1|a7291ce1812947e0830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497031979651,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1496937197931,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002110010","gameRealm":"TRLH3","platformId":"TRLH3:1002110010","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"06347056-645b-4473-af9b-f548ea1da10b":{"id":"06347056-645b-4473-af9b-f548ea1da10b","name":"G3","generatedName":"MSF|NIP|G3|a7291ce1812947e0830","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497031979651,"source":"bestOf","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1496940965128,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7":1,"f55a8ea5-4393-4796-9cda-7e1de955c547":0}}}