{"teams":[{"id":105,"slug":"kt-rolster","name":"kt Rolster","guid":"be6e39bf-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/kt-rolster-8rh5ukll.png","acronym":"KT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:44.000Z","bios":{"en_US":"<p>KT Rolster built a name for themselves in Korea through their strong objective control and individual laning talent. If their lanes went poorly, KT relied on their star junglers inSec and KaKAO to bail them out. Unfortunately for KT, their strategy faltered in the wake of inSec and KaKAO leaving to join teams in the LPL.</p>\n\n<p>After years of playing second fiddle to SK telecom T1, KT Rolster knocked their rivals out of the 2016 LCK Summer Playoffs. However, KT lost to ROX in a closely contested LCK Finals match, forcing them to play in the Regional Qualifier, where they were knocked out by Samsung Galaxy. Entering 2017 with a rebuilt roster packed with star power, they'll be sure to compete for the top spot in the LCK.</p>","fr_FR":"KT Rolster s'est fait un nom en Corée avec sa maîtrise des contrôles d'objectifs et l'habileté de ses membres sur les voies. Si la phase de voie se présentait mal, KT pouvait toujours compter sur les junglers inSec et KaKAO pour les sortir du pétrin. Malheureusement pour KT, cette stratégie est entrée dans une impasse quand inSec et KaKAO les ont quittés pour une autre équipe. Cela dit, quand une étoile est passée, une autre monte. Les espoirs de KT Rolster aux LCK reposent désormais sur les épaules des très capables ssumday, Arrow et Nagne.","pl_PL":"KT Rolster zyskało sławę w Korei dzięki swojej niezwykle skutecznej kontroli celów oraz talentowi do walki w alejach. Jeżeli gracze w alejach się nie popisali, KT polegało na swoich dżunglerach, inSecu i KaKAO, aby zaprowadzili porządek. Niestety dla KT strategia ta przestała działać w wyniku odejścia inSeca i KaKAO, którzy dołączyli do drużyn w LPL. Jednakże gdy jedna gwiazda znika, na jej miejscu pojawia się nowa. Marzenia KT Rolster o LCK spoczywają teraz w rękach ssumdaya, Arrowa i Nagne.","de_DE":"KT Rolster haben sich in Korea einen Namen durch ihre starke Objective-Kontrolle und individuellem Talent gemacht. Ssumday ist der Superstar-Top-Laner in Korea und lässt nicht mehr los, sobald er sich einen Vorteil verschaffen kann. Die ersten Minuten der Spiele mit KT zeichnen sich stets durch den immensen Druck des Jungle/Support-Duos aus. Es ist zu erwarten, dass der gegnerische Jungler bei ihrem Anblick in Angstschweiß ausbricht, wenn er nicht weiß, sein Territorium zu verteidigen.","es_ES":"KT Rolster se ha ganado una reputación en Corea por méritos propios gracias a un control férreo de sus objetivos y el talento de sus jugadores. Si en las calles la cosa no iba bien ahí estaba su jungla estrella para solucionar la partida, primero inSec y luego KaKAO. Desafortunadamente para KT, su estrategia falló cuando tanto inSec primero como KaKAO después abandonaron Corea para probar suerte en la LPL china. Pero cuando una estrella se va, otra se alza. Los sueños de KT Rolster residen ahora en ssumday, Arrow y Picaboo, que harán todo lo posible por llevar a su equipo a lo más alto.","pt_BR":"A KT Rolster construiu seu nome na Coreia com um estilo de jogo baseado em forte controle de objetivos e muito talento individual nas rotas. Se eles perdessem na rota, podiam confiar nos caçadores inSec e KaKAO para salvar o dia. Infelizmente, ambos deixaram o time para ir jogar na LPL. Mas quando uma estrela se apaga, outra surge no lugar. Os sonhos da KT agora estão depositados em Ssumday, Arrow e Piccaboo.\n","ko_KR":"<p>KT Rolster는 강력한 오브젝트 관리와 라인전 경기력으로 유명세를 탔습니다. 라인전에서 적팀에 밀리게 돼도 스타 정글러 inSec 선수와 KaKAO 선수가 팀을 승리로 이끌어주었죠. 하지만 두 정글러가 LPL에 진출하며 팀을 떠나자 팀 전략에 구멍이 났습니다. 하지만 별이 떠난 자리에는 다른 별이 뜨기 마련. 이제 KT Rolster는 ssumday 선수와 Arrow 선수를 선두에 내세워 전장에 나서고 있습니다.</p>"},"foreignIds":{"drupalId":"642"},"players":[69,72,304,749,769,2050],"starters":[69,72,304,749,769],"subs":[2050]},{"id":174,"slug":"afreeca-freecs","name":"Afreeca Freecs","guid":"be70e9f1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/afreeca-freecs-4melt1cj.png","acronym":"AFS","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2016-01-06T20:53:09.000Z","updatedAt":"2017-01-12T19:50:44.000Z","bios":{"en_US":"<p>The Afreeca Freecs will be looking for consistency in 2017. During Champions Summer 2016, the team managed a 2-0 record against superpower SK telecom T1. They snuck into the playoffs after finishing 8-10, but were quickly defeated by Samsung Galaxy. The Freecs went on to play in the Regional Qualifier, where they took down Jin Air Green Wings in the first round. Unfortunately, Samsung Galaxy knocked them out of contention in a rematch.</p>"},"foreignIds":{},"players":[120,308,401,767,800,1688],"starters":[120,401,767,800,1688],"subs":[308]}],"players":[{"id":69,"slug":"mata","name":"Mata","firstName":"Sehyoung","lastName":"Cho","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mata-7wmee6cg.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-06T14:11:34.000Z","bios":{"en_US":"<p>Sehyoung \"Mata\" Cho is one of the few League players who hardly needs an introduction. Mata is not just a World Champion, but the MVP of the series that won Samsung White the 2014 world title and Summoner's Cup. He’s one of the most well known Thresh players in the world, and his tactical mind is legendary.</p>\n\n<p>On the Rift, Mata is an invaluable addition to Royal Never Give Up, and has achieved an incredible synergy with his hot-headed, wildly-aggressive ADC partner Uzi. Unfortunately, his stellar play wasn’t enough to carve out a win against the eventual World champions, SK Telecom T1. Mata will have a chance to flash hook his way to some redemption in 2017.</p>","es_AR":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","fr_FR":"<p>Se-hyeong « Mata » Cho est l'un des rares joueurs de League of Legends qu'on ne présente plus. Mata n'est pas seulement champion du monde, il est aussi le MVP de la série qui a valu à Samsung White le titre de championne du monde 2014 et la Coupe de l'invocateur. Il est l'un des joueurs de Thresh les plus connus au monde, et son esprit tactique est légendaire.</p>\n\n<p>Sur la Faille, Mata est un ajout de taille pour Royal Never Give Up, et il a établi une synergie extraordinaire avec Uzi, son partenaire ADC impétueux et agressif. Malheureusement, son jeu exemplaire n'a pas suffi à vaincre les futurs champions du monde de SK Telecom T1. Mata trouvera peut-être la rédemption à coups de Saut éclair et de Grappin grâce à sa nomination à l'événement All-Stars 2016 de Barcelone. Accompagné de son partenaire de voie Uzi, la plus grande contribution de Mata se jouera dans sa façon de superviser le champ de bataille de la Faille de l'invocateur. Avec le commandant Mata à la barre, le vaisseau All-Stars de la Chine a une chance de se maintenir à flot, même si les probabilités ne jouent pas en leur faveur.</p>","es_ES":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de League que casi no necesita una presentación. No solo es un campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White ganase el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia increíble con su impulsivo e increíblemente agresivo ADC, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de calle Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","de_DE":"<p>Se-hyeong „Mata“ Cho gehört zu den wenigen League-Spielern, die man nicht groß vorstellen muss. Mata ist nicht nur ein Weltmeister, er wurde auch noch zum wertvollsten Spieler gewählt, als Samsung White 2014 Weltmeister wurde und den Beschwörerpokal gewann. Er ist einer der bekanntesten Thresh-Spieler der Welt und seine Taktiken sind legendär.</p>\n\n<p>In der Kluft ist Mata für Royal Never Give Up unbezahlbar und harmoniert unglaublich gut mit seinem hitzköpfigen, extrem aggressiven AD-Carry-Partner Uzi. Leider reichte seine überragende Leistung nicht, um die späteren Weltmeister, SK Telecom T1, zu besiegen. Doch Mata hat genug Stimmen bekommen, um am All-Stars-Event 2016 in Barcelona teilzunehmen, wo er die Chance auf Wiedergutmachung bekommt. Zusammen mit seinem Lane-Partner Uzi wird Matas größter Beitrag seine Übersicht in der Kluft der Beschwörer sein. Wenn Mata das Kommando übernimmt, stehen die Chancen gut, dass Chinas All-Stars-Schiff nicht kentern wird, selbst wenn alles gegen sie sprechen sollte.</p>","pl_PL":"Sehyeong „Mata” Cho jest jednym z kilku zawodników League of Legend, których nie trzeba przedstawiać. Mata to nie tylko mistrz świata — był także najlepszym zawodnikiem serii, podczas której zdobył dla Samsung White mistrzostwo i Puchar Przywoływacza w 2014 roku. To jeden z najlepiej znanych na świecie zawodników grających Threshem, a jego taktyczny umysł jest legendarny.</p>\n\nNa Summoner’s Rift Mata stanowi bezcenne uzupełnienie Royal Never Give Up i osiągnął niebywałe zgranie ze swoim porywczym, szaleńczo agresywnym prowadzącym partnerem, Uzim. Niestety jego znakomita gra nie wystarczyła, by zdobyć zwycięstwo przeciwko ostatecznym Mistrzom Świata, SK Telecom T1. Mata będzie miał okazję wyhaczyć swoje odkupienie dzięki nominacji do gry na wydarzeniu All-Star 2016 w Barcelonie. Mając za sobą kolegę z alei, Uziego, największą odpowiedzialnością Maty będzie nadzorowanie przebiegu walki na polu bitwy Summoner’s Rift. Gdy u steru stoi kapitan Mata, chiński okręt na All-Star zawsze będzie miał szanse utrzymać się na powierzchni, nawet w niesprzyjających okolicznościach.\n","pt_BR":"<p>Sehyeong \"Mata\" Cho é um dos poucos jogadores do League que nem precisa de apresentações. Mata não é apenas um Campeão Mundial. Ele é o MVP da série que deu o Campeonato à Samsung White. Ele é um dos jogadores de Thresh mais conhecidos do mundo e seu raciocínio tático é lendário.</p>\n\n<p>Mata é uma adição inestimável para a Royal Never Give Up e alcançou uma incrível sinergia com seu parceiro cabeça-quente e altamente agressivo, o atirador Uzi. Infelizmente, sua mecânica incrível não foi suficiente para arrancar uma vitória contra a campeã do Mundial, a SK Telecom T1. Mata terá uma chance de dar aquele Flash com gancho e agarrar sua redenção após ser eleito para participar do Evento All-Star 2016 em Barcelona. Com Uzi também eleito, a maior contribuição de Mata será em como ele cuida do campo de batalha que é Summoner’s Rift. Com o comandante Mata no manche, o navio All-Star da China tem uma chance de continuar navegando, mesmo se a sorte estiver contra eles.</p>","cs_CZ":"<p>Sehyeong „Mata“ Cho je jedním z mála hráčů League of Legends, kteří nepotřebují žádné zdlouhavé představování. Mata není jen mistr světa, ale také držitel ocenění pro nejužitečnějšího hráče za sérii, ve které Samsung White v roce 2014 vyhrál MS a Vyvolávačův pohár. Je jedním z nejslavnějších hráčů Threshe na světě a o jeho taktických dovednostech se vyprávějí legendy.</p>\n\n<p>Ve Žlebu je Mata nedocenitelnou oporou týmu Royal Never Give Up, s jehož horkokrevným a divoce agresivním ADC Uzim si vybudoval neuvěřitelně dokonalou synergii. Bohužel ani jeho hvězdné výkony nestačily na překonání SK Telecom T1, kteří nakonec letošní mistrovství světa vyhráli. Mata bude mít ještě šanci se se svým hákem pomstít, jelikož byl nominován na turnaj All-Star 2016 v Barceloně. S lajnovým parťákem Uzim v závěsu bude největším Matovým příspěvkem to, jak si dokáže udržovat přehled o celkovém dění na bojišti. Když bude mít na All-Star čínská loď u kormidla kapitána Matu, bude šanci udržet se na vodě, i když nepatří mezi favority.</p>","el_GR":"<p>Ο Sehyeong \"Mata\" Cho ανήκει στην ελίτ των παικτών του League που δεν χρειάζονται συστάσεις. Ο Mata δεν είναι μόνο Παγκόσμιος Πρωταθλητής, αλλά και ο MVP των αγώνων με τους οποίους οι Samsung White κατάκτησαν το Παγκόσμιο Πρωτάθλημα 2014 και το Κύπελλο Επικαλεστή. Είναι ένας από τους πιο διάσημους παίκτες του Θρες στον κόσμο και φημίζεται για τη στρατηγική του σκέψη.</p>\n\n<p>Σε αγωνιστικό επίπεδο, ο Mata είναι μια πολύτιμη προσθήκη στους Royal Never Give Up και έχει καταφέρει να συντονιστεί τέλεια με τον θερμόαιμο και εξαιρετικά επιθετικό ADC της ομάδας, τον Uzi. Δυστυχώς, η καταπληκτική του εμφάνιση δεν ήταν αρκετή για να δώσει τη νίκη στην ομάδα του στον αγώνα με τους SK Telecom T1 που στη συνέχεια θα έπαιρναν το Παγκόσμιο Πρωτάθλημα. Ο Mata θα έχει πάλι μια ευκαιρία να δείξει τι αξίζει, αφού επιλέχθηκε για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Ήδη γυαλίζει το φανάρι και το Φλας του. Μαζί με τον Uzi, τον συμπαίκτη του στη λωρίδα, ο Mata θα είναι ακόμη πιο πολύτιμος στην ομάδα του επειδή γνωρίζει καλύτερα από τον καθένα τη στρατηγική που απαιτεί το Φαράγγι των Επικαλεστών. Με καπετάνιο τον Mata, το πλήρωμα της Κίνας που θα ταξιδέψει στο All-Star έχει καλές πιθανότητες να μην ναυαγήσει, παρόλο που τα στατιστικά δεν είναι με το μέρος του.</p>","hu_HU":"Sehyeong „Mata” Cho a kevés LoL-játékos egyike, aki nem igazán szorul bemutatásra. Mata nem csupán világbajnok, hanem MVP volt egy olyan versenyen, ahol a Samsung White 2014-ben világbajnok lett, és elnyerte az Idézők Kupáját. A világ egyik legismertebb Thresh-játékosának taktikai érzéke legendás.</p>\n\nA Szurdokban Mata a Royal Never Give Up csodafegyvere, és meglepően jól működik együtt a forrófejű, rendkívül agresszív partnerével, Uzival. Sajnos az emberfeletti teljesítménye is kevés volt ahhoz, hogy megverjék a későbbi világbajnok SK Telecom T1-t. Mata most visszavághat, mert beszavazták őt a 2016-os All-Star gála játékosai közé. Állandó társa, Uzi is vele tart, így Mata stratégiai gondolkodása is jobban érvényesülhet az Idézők szurdokában. Mata parancsnokkal a hídon Kína All-Star-hajója akkor sem fog felborulni, ha az esélyek nem nekik kedveznek.\n","it_IT":"Sehyeong \"Mata\" Cho è uno dei pochi giocatori di LoL a non aver bisogno di presentazioni. Mata non è semplicemente un campione del mondo, ma anche il MVP della serie che ha visto i Samsung White conquistare i Mondiali 2014 e la Coppa degli evocatori. È uno dei più celebri giocatori di Thresh al mondo e la sua abilità tattica è leggendaria.</p>\n\nIn Landa, è una risorsa insostituibile dei Royal Never Give Up, tra i quali ha costruito un'incredibile sinergia con il suo aggressivo compagno ADC Uzi. Purtroppo le sue giocate stellari non sono bastate a strappare una vittoria contro i futuri campioni del mondo, gli SK Telecom T1. Mata avrà la possibilità di rifarsi e \"agganciare\" la vittoria all'All-Star 2016 di Barcellona. In compagnia del suo compagno di corsia Uzi, Mata potrebbe contribuire al successo della squadra soprattutto grazie alla sua visione del campo di battaglia. Con il comandante Mata al timone, la squadra cinese avrà sempre una possibilità di rimanere a galla, anche quando sembra che non ci sia via di scampo.\n","ro_RO":"Sehyeong ''Mata'' Cho este unul dintre puținii jucători de LoL care nu mai au nevoie de vreo prezentare. Mata nu este doar Campion Mondial, ci și MVP-ul Campionatului Mondial în care Samsung White a câștigat Cupa Invocatorului în 2014. Este unul dintre cei mai cunoscuți jucători de Thresh din lume, iar manevrele sale tactice sunt legendare.</p>\n\nÎn Rift, Mata este o piesă inestimabilă a echipei Royal Never Give Up și a dezvoltat o sinergie incredibilă cu partenerul său ADC temperamental și foarte agresiv, Uzi. Din păcate, manevrele sale uimitoare nu au fost de ajuns pentru a obține o victorie în fața viitorilor campioni mondiali, SK Telecom T1. Acum că a fost nominalizat să joace la evenimentul All-Star 2016 din Barcelona, Mata va avea ocazia să-și ia revanșa. Avându-l alături de colegul său de culoar, Uzi, cea mai importantă contribuție a lui Mata va fi controlul asupra câmpului de luptă. Cu comandantul Mata la cârmă, vasul All-Star al Chinei se va putea menține la suprafață chiar și atunci când șansele nu sunt favorabile.\n","es_MX":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>"},"foreignIds":{"drupalId":"682","ESPORTSTMNT06":"200000344","TRLT3":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":72,"slug":"pawn","name":"Pawn","firstName":"Wonseok","lastName":"Heo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pawn-bwchpx6p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:29.000Z","updatedAt":"2017-07-06T14:11:08.000Z","bios":{"en_US":"<p>\nWonseok “Pawn\" Heo is one of the best known mid laners in the world, with a career dating back to 2013. Pawn is a battle hardened veteran, with some truly impressive games under his belt. Pawn shocked the world when he solo killed Faker in the 2013 WCG Qualifiers, and he hasn’t stopped since. From there, he found himself on Samsung White during one of the most competitive and closely-matched periods in Korea’s history.\n</p>\n<p>\nSSW turned in a dominant performance during the 2014 World Championship, taking the cup home in almost unrivaled fashion. However, the team disintegrated in the aftermath of their success, and Pawn joined Edward Gaming at the end of 2014. Now rejoining the LCK, he'll once again take on Faker in the mid lane.\n</p>","fr_FR":"<p>Won-seok « PawN » Heo est l'un des meilleurs mid laners du monde. Point. Au nombre de ses trophées, on retrouve les play-offs des LPL, le Mid-Season Invitational et le Championnat du monde de League of Legends. Il a également battu Faker et SKT à de nombreuses occasions, notamment lors de la finale du MSI 2015. Et malgré son surnom (qui signifie « pion » en anglais), PawN nous rappelle plutôt une reine, capable de se déplacer où elle veut et semant la destruction dans les rangs ennemis.</p>\n<p>\nPawN a été recruté par Edward Gaming fin 2014, quand toute une vague de vedettes coréennes a migré vers les LPL. PawN a aidé à propulser EDG jusqu'à la 1re place de la Demacia Cup Spring Season 2015 et des play-offs printaniers des LPL 2015. Mais PawN sait que la route est encore longue. « Je trouve que Samsung White était une équipe parfaite », dit PawN, et EDG a encore beaucoup de travail à faire pour parvenir à ce niveau de performance. En attendant, PawN continuera à semer la peur chez ses adversaires chaque fois qu'il arrivera dans la Faille.\n</p>","pl_PL":"<p>\nHeo „PawN” Won-seok jest jednym z najlepszych graczy w środkowej alei na całym świecie. Czemu? Cóż, wygrał parę „drobnych” turniejów, takich jak choćby rozgrywki play-off LPL, turniej Mid-Season InvitationaL i mistrzostwa świata w League of Legends. Wielokrotnie też pokonywał Fakera i SKT – także podczas finałów 2015 MSI. Choć jego ksywka oznacza „pionek”, jego styl gry może bardziej kojarzyć się z królową, która porusza się po planszy w dowolnym kierunku, niszcząc każdego napotkanego przeciwnika.\n</p>\n<p>\nPawN został zwerbowany przez Edward Gaming pod koniec 2014 r. Był jedną z wielu koreańskich gwiazd, które przeszły do LPL. Pomógł EDG wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek play-off 2015 LPL. Pawn wie jednak, że przed nim trudne zadanie. „Wydaje mi się, że Samsung White było drużyną idealną” przyznaje PawN, a EDG czeka dużo pracy, jeżeli zamierzają osiągnąć podobny poziom. W międzyczasie PawN nadal będzie siał postrach w sercach wrogów za każdym razem, gdy wkroczy na Rift.\n</p>","de_DE":"<p>Won-seok „PawN“ Heo, dessen Karriere 2013 begann, ist einer der bekanntesten Mid-Laner der Welt. Obwohl PawN erst 19 Jahre alt ist, ist er bereits ein abgehärteter Veteran, der schon ein paar wirklich beeindruckende Spiele abgeliefert hat. PawN schockierte die Welt, als er Faker bei der Qualifikationsrunde für das WCG 2013 alleine besiegte, und hat seither nicht mehr nachgelassen. Kurz darauf wechselte er in einer der umkämpftesten und knappsten Phasen in Koreas Geschichte zu Samsung White.</p>\n\n<p>SSW lieferte bei der Weltmeisterschaft 2014 eine dominante Leistung ab und konnte sich den Titel beinahe widerstandslos sichern. Nach dem Erfolg brach die Mannschaft jedoch auseinander und PawN wechselte Ende 2014 zu Edward Gaming. Seither hat er EDG zu ein paar ihrer dominantesten Siege geführt. Doch der junge Spieler hat immer wieder mit Krankheiten zu kämpfen. Aber trotz dieser Rückschläge ist er immer noch ein Teil der Mannschaft und fest entschlossen, ihr zu dienen.</p>","es_ES":"<p>Won-seok \"PawN\" Heo es uno de los jugadores de la calle central más conocidos del mundo, con una carrera que data del año 2013. A pesar de tener solo 19 años, PawN es un veterano curtido en batalla que tiene en su haber unas partidas increíbles. Sorprendió a todo el mundo cuando acabó él solo con Faker en el clasificatorio del WCG 2013 y no ha parado desde entonces. Desde aquel momento, se encontraba en Samsung White durante uno de los periodos más competitivos y reñidos en la historia de Corea.</p>\n\n<p>SSW hizo gala de una actuación dominante durante el Campeonato Mundial 2014, hasta el punto de llevarse a casa el trofeo sin que casi nadie les plantase cara. No obstante, el equipo se deshizo como resultado de su éxito y PawN se unió a Edward Gaming a finales de 2014. Desde entonces, ha liderado a EDG en algunas de sus victorias más aplastantes. Aunque el joven jugador ha tenido que enfrentarse a alguna enfermedad. Y, a pesar de esto, sigue en el equipo, dispuesto a actuar.</p>","pt_BR":"<p>Won-seok “PawN” Heo é um dos jogadores do meio mais conhecidos do mundo, com uma carreira iniciada em 2013. Apesar de ter apenas 19 anos, PawN é um veterano experiente na batalha e tem alguns jogos realmente impressionantes no currículo. PawN chocou o mundo quando abateu Faker sozinho nas Classificatórias da WCG 2013 e desde então não parou mais. A partir dali, entrou para a Samsung White durante um dos períodos mais competitivos e disputados na história da Coreia.</p>\n\n<p>A SSW teve uma atuação dominante durante o Campeonato Mundial 2014 e levou a copa para casa de maneira incontestável. No entanto, a equipe se desfez em resultado a todo esse sucesso e PawN foi para a Edward Gaming no final de 2014. Desde então, ele liderou a EDG em algumas de suas vitórias mais sólidas. Porém, o jovem jogador está lutando contra uma doença. Mas apesar das adversidades, ele ainda está na equipe e está determinado a contribuir.</p>","es_AR":"<p>Won-seok “PawN” Heo es uno de los mejores carrileros centrales del mundo, con una carrera que se inició en el 2013. Con tan solo 19 años, PawN es un veterano endurecido por los enfrentamientos, con partidas realmente impresionantes bajo la manga. PawN deslumbró al mundo cuando derrotó a Faker en WCG 2013 y no para desde entonces. A partir de allí, se encontró en Samsung White durante uno de los juegos más competitivos y cerrados en la historia de Corea.</p>\n\n<p>SSW logró un desempeño deslumbrante durante el Campeonato Mundial 2015 y se llevó la copa a casa de una manera inigualable. Sin embargo, el equipo se desintegró después de todo este éxito y PawN se unió a Edward Gaming a finales del 2014. Desde entonces, condujo a EDG a algunas de las victorias más contundentes. Lamentablemente, el joven jugador tiene que hacer frente a una enfermedad. A pesar de esta adversidad, sigue formando parte del equipo y está determinado a seguir adelante.</p>"},"foreignIds":{"drupalId":"983","ESPORTSTMNT06":"200000342","TRLT3":"200000214"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":120,"slug":"kuro","name":"Kuro","firstName":"Seohaeng","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kuro-1f1b5va0.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-05-31T00:37:36.000Z","bios":{"en_US":"<p>Seohaeng \"Kuro\" Lee first entered the esports scene in 2013 when he joined Incredible Miracle in the LCK. However, it wasn’t until 2014 with the ROX Tigers that Kuro started to crush his competition. Ever the team player, Kuro has shown an aptitude to pick up whatever champions are meta and consequently sports an absolutely massive champion pool.\n</p>\n<p>\nKuro’s deep reservoir of champions has allowed him to continually evolve as a player and his enemies are often left guessing at what he’s going to play. This helped the ROX Tigers take their first-ever LCK trophy home this summer, but they fell in the semifinals at the 2016 World Championship. He'll take up the mid lane for the Afreeca Freecs in 2017.\n</p>","fr_FR":"<p>Seo-haeng « Kuro » Lee a fait son apparition sur la scène e-sport en 2013 lorsqu'il s'est joint à Incredible Miracle au cours des LCK. Cependant, c'est en 2014, avec KOO Tigers, que Kuro a commencé à affirmer sa supériorité sur la concurrence. Avec un taux de victoires de 100% avec LeBlanc, Viktor et Lissandra pendant le Segment de printemps des LCK 2015, Kuro a montré qu'il pouvait concourir pour le titre de meilleur mid laner des LCK. Et n'oublions pas qu'il a obtenu ces scores contre quelques-uns des meilleurs mid laners du monde (y compris Faker et CoCo).\n</p>\n<p>\nCependant, Kuro et KOO n'ont pas encore traduit leurs exploits locaux en trophées internationaux. Ils ont témoigné de faiblesses sur le plan mental et émotionnel dans les matchs tendus. S'agirait-il du CLG coréen ?\n</p>","pl_PL":"<p>Seo-haeng „Kuro” Lee po raz pierwszy pojawił się na scenie e-sportowej w 2013 r., gdy dołączył do Incredible Miracle w LCK. Jednakże swoim przeciwnikom dał się we znaki dopiero w 2014 r. w szeregach KOO Tigers. Dzięki zdobytemu podczas wiosennego splitu LCK 2015 współczynnikowi zwycięstw wynoszącemu 100%, ilekroć grał LeBlankiem, Viktorem i Lissandrą, Kuro udowodnił, że jest jednym z najlepszych środkowych w LCK. Nie zapominajmy też, że konkurencję stanowili najlepsi zawodnicy ze środkowej alei na świecie, tacy jak Faker i CoCo.\n</p>\n<p>\nJednakże Kuro i KOO muszą jeszcze nauczyć się sprawiać, by ich krajowe sukcesy przekładały się na międzynarodowe trofea. Gdy dochodziło do samych meczów, zdarzało im się okazywać słabość mentalną i emocjonalną. Czyżbyśmy znaleźli koreański odpowiednik CLG?\n</p>","de_DE":"<p>Seo-haeng „KurO“ Lee betrat die E-Sport-Szene im Jahr 2013, als er bei Incredible Miracle in der LCK anheuerte. Aber erst ein Jahr und einen Wechsel zu den ROX Tigers später begann KurO, seine Gegner dem Erdboden gleichzumachen. KurO war von Anfang an ein Teamspieler, konzentrierte sich seit jeher auf die Champions des Metaspiels und konnte infolgedessen schon immer auf einen großen Champion-Pool zurückgreifen.</p>\n\n<p>Dank seines großen Champion-Vorrats konnte sich KurO ständig spielerisch weiterentwickeln. Seine Gegner können oft nur raten, welchen Champion er spielen wird. Das war mit ein Grund dafür, dass die ROX Tigers in diesem Sommer erstmals die LCK gewinnen konnten. Während KurO und seine Kameraden die Weltmeisterschaft 2016 dominieren wollen, ist eines sicher: Keiner weiß, was KurO alles aus dem Ärmel zaubern wird.</p>","es_ES":"<p>Seo-haeng ''KurO'' Lee comenzó su carrera profesional en 2013 al unirse a Incredible Miracle en la LCK. Sin embargo, no fue hasta 2014 cuando comenzó a demostrar su verdadero potencial junto a los ROX Tigers. Además de ser un gran jugador en equipo, KurO ha demostrado ser capaz de seleccionar cualquier campeón que esté en el metajuego, y por consiguiente maneja un repertorio enorme de campeones.</p>\n\n<p>La gran reserva de campeones de KurO le ha permitido evolucionar constantemente como jugador y sus enemigos no suelen poder adivinar con quién va a jugar. Esto ha ayudado a ROX Tigers a llevarse a casa este verano su primer trofeo de la LCK. KurO y sus compañeros buscan conquistar el Campeonato Mundial 2016, pero una cosa está clara: nunca sabrás qué as guarda KurO bajo la manga.</p>","pt_BR":"<p>A primeira aparição de Seo-haeng \"Kuro\" Lee no cenário de eSports foi em 2013 quando ele se juntou à Incredible Miracle para a LCK, mas só foi no ano de 2014 junto com a ROX Tigers que Kuro começou a esmagar a competição. Como um forte jogador de equipe, Kuro mostrou sua aptidão em escolher qualquer campeão necessário para o meta e consequentemente formou uma gama enorme de campeões.</p>\n\n<p>O grande elenco de campeões de Kuro permitiu que ele continuasse a evoluir como jogador e seus inimigos quase nunca sabem com quem ele vai jogar. Isso ajudou a ROX Tigers a levar para casa seu primeiro troféu da LCK esse verão. Enquanto Kuro e companhia tentam dominar o Campeonato Mundial 2016, uma coisa é certa: você nunca sabe o que Kuro pode estar escondendo em suas mangas.</p>","ko_KR":"<p>\"Kuro\" 이서행 선수는 2013년 Incredible Miracle에 입단하며 e스포츠 무대에 첫발을 들여놓았습니다. 하지만 2014년에 ROX Tigers로 이적하고 나서야 본격적으로 압도적인 기량을 보이기 시작했죠. 2015 LCK 스프링에서 르블랑, 빅토르, 리산드라로 100% 승률을 기록했던 Kuro 선수는 LCK 수위급 미드 라이너다운 실력을 여실히 드러냈습니다. 게다가 Faker 선수와 CoCo 선수를 비롯한 세계 최고의 미드 라이너들과 맞서 강력한 모습을 보여주었죠.</p>\n</p>Kuro 선수를 비롯한 ROX Tigers는 2015년 월드 챔피언십 4강에 올랐을 만큼 대단한 실력을 보여주고 있죠.</p>\n","es_AR":"<p>La primera participación de Seo-haeng «KurO\" Lee en la escena de esports fue en el 2013, cuando se unió a Incredible Miracle en la LCK. Sin embargo, no fue sino hasta el 2014 con ROX Tigers que KurO empezó a arrasar en la competencia. Como gran jugador del equipo, KurO ha demostrado su capacidad para lograr todas las metas de campeones que se propuso, lo que le permitió tener un grupo de campeones increíblemente poderoso.</p>\n\n<p>La amplia reserva de campeones de KurO le ha permitido evolucionar constantemente como jugador, y sus enemigos se preguntan siempre cuál será su próxima jugada. De esta forma, los ROX Tigers lograron llevar el primer trofeo de LCK de su historia a casa este verano. Ante el deseo de KurO y compañía de dominar el Campeonato Mundial 2016, una cosa es segura: uno nunca sabe qué se trae KurO bajo la manga.</p>"},"foreignIds":{"drupalId":"886","ESPORTSTMNT06":"200000382"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":304,"slug":"deft","name":"Deft","firstName":"Hyeokgyu","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deft-4s8iwywa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-07-06T14:18:47.000Z","bios":{"en_US":"<p>\nThere are many ways to introduce Hyeokgyu “Deft” Kim: Ezreal fanatic, world class AD carry, veteran, hypercarry... Deft has been playing since 2013, earning accolades as a player who could pump out absurd amounts of damage thanks to his ability to duck, dodge, and weave through teamfights.\n</p>\n<p>\nAfter the 2014 World Championship, Deft joined up with Edward Gaming, beginning an era of dominance where the team picked up a series of convincing victories. It started with the 2015 Demacia Cup Spring, and then continued into the 2015 LPL Spring Split, where EDG only dropped six games in total. From there, EDG picked up the top prize at the 2015 Mid-Season Invitational, winning a thrilling Bo5 series against SKTelecom T1, 3-2. Yet through it all, something has eluded Deft...he has yet to take home the greatest prize of all: the World Championship.\n</p>","fr_FR":"<p>Hyuk-kyu « Deft » Kim est réputé pour être l'un des carrys AD les plus agressifs du monde, ce qui nous change de ses débuts professionnels chez Samsung Blue, où il avait plus tendance à fuir un combat qu'à tenter l'affrontement. Mais depuis qu'il a rejoint les LPL, Deft tend à repousser les limites de ses champions (pour ne pas dire qu'il les dépasse de temps en temps). De façon générale, Deft fait preuve de force et de confiance dès qu'il arrive sur la Faille.</p>\n\n<p>Par contraste, Deft, en personne, est plutôt discret, voire effacé. Il suit souvent ses coéquipiers dans la maison d'EDG, ne sachant visiblement pas trop quoi faire par lui-même. Peut-être espère-t-il que la voix douce de Meiko, son partenaire sur la voie du bas, le ramènera à bon port.</p>","pl_PL":"<p>Hyuk-kyu „Deft” Kim uważany jest powszechnie za jednego z najagresywniejszych prowadzących na świecie. Wiele się zmieniło, odkąd zaczynał karierę w Samsung Blue. Wówczas prędzej był gotów uciekać niż nawiązać walkę z przeciwnikiem. Odkąd jednak Deft przeniósł się do LPL, coraz częściej zdarza mu się w pełni wykorzystywać zalety swoich bohaterów (a także podejmować ryzykowne decyzje). Ilekroć Deft wyrusza na Rift, wykazuje się siłą i pewnością siebie.</p>\n\n<p>Z kolei w życiu prywatnym jest osobą cichą, wręcz potulną. Często zdarza mu się chodzić po domu drużynowym za pozostałymi członkami EDG, jakby nie wiedział, co robić, gdy zostaje sam. Być może wyczekuje kojącego głosu Meiko, partnera z dolnej alejki.</p>","de_DE":"<p>Man kann Hyuk-kyu „Deft“ Kim auf viele Arten vorstellen: Als Ezreal-Freak, als Weltklasse-AD-Carry, als Veteran, als Hypercarry … Deft spielt schon seit 2013 und hat als Spieler, der dank seiner schnellen Reflexe in Teamkämpfen unglaublichen Schaden austeilen kann, einige Auszeichnungen gewonnen.\nNach der Weltmeisterschaft 2014 wechselte Deft zu Edward Gaming und leitete damit eine Ära ein, in der die Mannschaft im Frühjahr beim Demacia Cup 2015 und kurz darauf beim Frühjahrs-Split der LPL 2015 einen überzeugenden Sieg nach dem anderen feierte und insgesamt nur sechs Spiele verlor. Danach gewann EDG das spannende Finale des Mid-Season Invitational 2015 gegen SKTelecom T1 mit 3–2. Deft war schon bei vielen internationalen Turnieren, aber eines fehlt ihm immer noch: der Weltmeistertitel. Deft hat bewiesen, dass er immer alles tut, um sein Ziel zu töten. Während sich EDG auf die Weltmeisterschaft vorbereitet, müssen sich die anderen Mannschaften vor seinem beweglichen und riskanten, aber lohnenden Spielstil in Acht nehmen. Eines ist jedenfalls sicher: Solange Deft in der Kluft ist, darf man EDG niemals abschreiben.</p>","es_ES":"<p>Hay muchas maneras de presentar a Hyuk-kyu \"Deft\" Kim: fanático de Ezreal, AD carry de talla mundial, veterano, hypercarry... Deft lleva jugando desde 2013 y ha conseguido elogios como jugador capaz de infligir cantidades ingentes de daño gracias a su capacidad de eludir, esquivar y moverse en los combates de equipo.</p>\n\n<p>Después del Campeonato Mundial 2014, Deft se unió a Edward Gaming, lo que dio comienzo a una era de dominio en la que el equipo se hizo con una serie de victorias convincentes en la 2015 Demacia Cup Spring y en la fase de primavera de la LPL de 2015, donde solo perdieron seis partidas. Después EDG consiguió subir a lo más alto del MSI 2015, tras una emocionante victoria por 3 a 2 en una serie al mejor de 5 contra SK Telecom T1. </p>\n\n<p>Deft ha participado en muchos torneos internacionales, pero todavía le falta por llevarse a casa el mayor premio de todos: el título del Campeonato Mundial. Ha demostrado que cuando tiene un asesinato a la vista, hará todo lo que haga falta para conseguirlo. Con EDG en el Mundial, los rivales tendrán que tener cuidado con su estilo de juego de gran movilidad, gran riesgo y gran recompensa. Una cosa está clara: mientras Deft esté en la Grieta, no se puede dar a EDG por muerto.</p>","pt_BR":"<p>Podemos apresentar Hyuk-kyu “Deft” Kim de várias formas: Fanático por Ezreal, atirador de nível internacional, veterano, hipercarregador... Deft joga desde 2013 e é tido como um jogador que consegue causar quantidades absurdas de dano graças a sua habilidade de se esconder, desviar e driblar em confrontos de equipe.</p>\n<p>Depois do Campeonato Mundial 2014, Deft entrou para a Edward Gaming, iniciando uma era de domínio em que a equipe conquistou uma série de vitórias convincentes na Etapa de Primavera da Demacia Cup 2015 e depois a Série de Primavera da LPL 2015, onde a EDG só perdeu seis jogos no total. Depois disso, a EDG levou o primeiro lugar no MSI 2015, ganhando uma série de melhor de cinco contra a SKTelecom T1 por 3 a 2. Deft já participou de inúmeros torneios internacionais, mas ainda não levou para casa o grande prêmio: o Campeonato Mundial. Mas já demonstrou que quando coloca uma presa na mira, ele faz de tudo para abatê-la. Com a EDG no Mundial, os oponentes precisarão tomar cuidado com seu estilo de jogo de alta mobilidade, alto risco e alta recompensa. Uma coisa é certa: enquanto Deft continuar no Rift, a EDG continua na parada.</p>","es_AR":"<p>Existen muchas maneras de presentar a Hyuk-kyu “Deft” Kim: fanático de Ezreal, ADC de primera categoría, veterano, hiperacarreador... Deft no deja de jugar desde el 2013, consagrándose como un jugador capaz de infligir absurdas cantidades de daño gracias a su habilidad para agacharse, esquivar y eludir peleas en equipo.</p>\n\n<p>Después del Campeonato Mundial 2015, Deft se unió a Edward Gaming y comenzó una era de dominio en la que el equipo consiguió una serie de victorias en la Copa de Verano de Demacia 2015 y luego en la Serie de Primavera de LPL 2015, donde EDG solo perdió seis partidas en total. Después, EDG consiguió el primer premio en el Torneo por Invitación de Mitad de Temporada 2015, ganando por 3-2, una increíble serie al mejor de 5 contra SKTelecom T1. Deft participó en un montón de torneos internacionales, pero aún le falta llevarse a casa el premio más importante de todos: el Campeonato Mundial. Deft demostró que consigue lo que se propone y hará todo lo que esté a su alcance para lograrlo. Cuando EDG llegue al Mundial, los oponentes tendrán que cuidarse de su estilo de juego sumamente ágil, de alto riesgo y altura. Una cosa es segura: siempre que Deft esté parado en la Grieta, no podrás contra EDG.</p>"},"foreignIds":{"drupalId":"985","ESPORTSTMNT06":"200000343","TRLT3":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":308,"slug":"spirit","name":"Spirit","firstName":"Dayun","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/spirit-11wuu9ni.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-05-31T00:31:17.000Z","bios":{"en_US":"<p>\nDa-yun \"Spirit\" Lee is one of the most hyped players to enter the EU LCS in the past several years (or possibly <em>ever</em>). While the power of his spirit faded somewhat during the year he spent getting (mostly) crushed with Team WE in the LPL, Spirit is still one of the best junglers in the game. He was a key member of the highly-rated 2014 Samsung Blue squad and held his own when surrounded by names like dade and Deft. \n</p>\n<p>\nSpirit had an underwhelming 2016 EU LCS season by his astronomical standards, but throughout the year he had flashes of brilliance with his ultra-aggressive jungling style. Back in the LCK, he now has a chance to bring his aggression to a new level.\n</p>","de_DE":"<p>Er ist nicht nur einer der besten Jungler der Geschichte, sondern hat auch das liebreizendste Lächeln in League of Legends. Da-yoon „Spirit“ Lee ist einer der drei Neuzugängen Fnatics für 2016, nachdem er für seine Verhältnisse ein ziemlich ernüchterndes Jahr in China verbrachte. In der Uniform von Team WE hielt der ehemalige Samsung Blue-Jungler seine Mannschaft im Alleingang in der chinesischen Erstliga LPL. Kaum ein anderer Spieler kann bis heute eine solche Tat vorweisen, bis vielleicht auf Sang-hyeok „Faker“ Lee während der enttäuschenden Phase SKTelecom T1 Ks im Jahr 2014. Trotz dessen ließ er sich niemals unterkriegen und hielt stets den Kopf oben. Wenn man ihn danach fragte, wie er sich fühlte, verteidigte er seine Kameraden und sprach vom gemeinsamen Scheitern und Gewinnen. </p>\n\n<p><h2> Spirits Pechsträhne</p></h2>\n<p>Es scheint, als wäre 2015 ein Jahr gewesen, welches Spirit nicht gerecht geworden ist, denn immerhin gehörte er einer Mannschaft an, welche im Vorjahr zu den besten der Welt gehörte. Mit dem Samsung Blue-Logo auf der Brust hat er seit Ende 2013 mit seinem Schwesterteam die koreanische Liga OGN Champions dominiert. In seinem ersten Split überhaupt gewann der damals achtzehnjährige Spieler den Frühlingstitel 2014 gegen ein überraschend gut spielendes Najin White Shield. Im darauffolgenden Sommer schliff er nur knapp am Pokal vorbei, als er wieder einmal das Finale bestritt, jedoch im fünften Spiel der Serie KT Rolster Arrows unterlag.  </p>\n\n<p>Zu dieser Zeit zog er viel Aufmerksamkeit des Publikums auf sich, da er der Spielmacher seiner Mannschaft war und schnell zum Top 3-Jungler in Korea aufwuchs. Er war einer der wenigen Jungler, welche die Fertigkeit hatten, mithilfe ihres aggressiven Spielstils ihren individuellen Vorteil in einen Vorteil für die gesamte Mannschaft zu konvertieren. So verhalf er in vielen Spielen seinen Star-Carries Uh-jin „dade“ Bae und Hyuk-kyu „Deft“ Kim zu einer komfortablen Position, um schließlich das Spiel an sich zu reißen. Mit ihnen formte Spirit einen Kader, der exzellent im Team kämpfen konnte und ebenso in Lategame-Manövern glänzte.  </p>\n\n<p>Im Herbst 2014 kämpfte er sich fast mühelos in die KO-Phase der Weltmeisterschaft und ließ sein heutiges Team Fnatic ausscheiden. Mit leuchtenden blauen Haaren besiegte er Cloud9 in einem zerstörerischen 3-1 und stand vor seinen Freunden und Titelfavoriten Samsung Galaxy White. Trotz der Geschichte zwischen den beiden Schwestermannschaften, welche Spirits Samsung Blue bevorteilte, hatte er nicht den Hauch einer Chance. In drei kurzen Partien war sein Schicksal besiegelt und er ließ sich mit einem bittersüßen Geschmack im Mund von seinen Teamkollegen umarmen.  </p>\n\n<p>„Das war das erste Mal, dass ich in auf einer offenen Bühne gespielt habe. Ich konnte die gleiche Luft so vieler ausländischer Menschen atmen und mit ihnen an einem Ort verbunden sein, was wirklich eine aufregende Erfahrung ist“ – Spirit während der Gruppenphase in Singapur.  </p>\n\n<p><h2> Zeit in China</p></h2>\n<p>Wenige Monate später wurde der mittlerweile erfahrene Koreaner in der LPL unter Vertrag genommen. Die chinesische Mannschaft Team WE erhoffte sich mit einem außergewöhnlichen Talent wie Spirit, wieder zu altem Glanz zurückzufinden. Schnell war den WE-Fans klar, ihr Import war tatsächlich ihre einzige Hoffnung. Team WE hatte nicht nur mangelhafte Spieler, sondern fanden die Spieler ebenso nicht auf die gleiche Ebene, um zusammenarbeiten zu können. Spirit war deutlich in einer Liga über seinen Kameraden und gewann mit eigener Kraft für sein Team Begegnung um Begegnung.  </p>\n\n<p>In seiner Karriere hat Spirit einen enorm aggressiven Spielstil entwickelt. Mithilfe von unkonventionellen Pfaden durch den Jungle überrascht er seine Gegner, wenn er vor ihrer Nase auftaucht, wo andere Jungler zu diesem Zeitpunkt ganz woanders sein sollten. Als Mittel zum Zweck dienen zum übermäßig größten Teil Nidalee und Gragas, öfters auch Elise und Rek’Sai. Was ihn aber von anderen Junglern in diesem Aspekt abhebt ist, dass er Fizz relativ oft auswählt. Der Grund dafür wurde bereits genannt: Er war der Star von Team WE und musste seine Kameraden ohne jegliche Hilfe stützen. Fizz ist ein Champion, welcher ein Spiel an sich reißen kann und war daher passend für Spirits Situation. Im Jahr 2015 konnte Fnatic zeigen, dass sie trotz Sprachbarrieren mühelos Koreaner in ihr Team einbinden konnte, wird ihnen dieser Coup auch für 2016 gelingen? </p>","pl_PL":"<p>Pomimo koreańskiego pochodzenia \"Spirit\" jest bardzo dobrze znany na całym świecie. Swoją karierę profesjonalnego gracza zaczął w swojej ojczyźnie, Korei, w czerwcu 2013 roku. Jeszcze niedoświadczony Lee Da-yoon dołączył wtedy do MVP Blue, parę miesięcy później przemianowanego na Samsung Blue. W tym zespole osiągnął swoje największe sukcesy i zaistniał na esportowej scenie. W zimowym PANDORA.TV Champions Winter jego nadzieje na podium zostały przekreślone w ćwierćfinałach przez niepokonane SKT T1. Zupełnie inaczej potoczyły się losy jego drużyny w kolejnym sezonie koreańskiej ligi. Rozgrywki podsumowujące ten okres rozpoczęła od zemsty na SKT T1 również w ćwierćfinałach. Później pokonała siostrzaną drużynę Samsung Ozone w półfinałach, a następnie zdominowała Najin White Shield w finałach. Lee Da-yoon wraz z mid-lanerem, „dade”, mieli olbrzymi wpływ na wynik tych rozgrywek. Kolejnym wielkim sukcesem junglera Samsung Blue jest udział w Mistrzostwach Świata 2014, gdzie jego drużyna była głównym faworytem. Ze swojej grupy wyszedł na pierwszym miejscu z wynikiem 5:1. Potem pokazał jak prowadzić zespół do zwycięstwa Lee Sinem w ćwierćfinałach przeciwko Cloud9 – \"Spirit\" miał najwięcej zabójstw i najmniej śmierci w trzecim meczu. Pechowo na drodze po tytuł w półfinałach, spotkał się z dobrze znaną drużyną – Samsung White, która również był faworytem tego wydarzenia. Niestety siostrzana ekipa spod skrzydeł Samsunga lepiej wykorzystała nietypową znajomość swoich przeciwników i wygrała z Samsung Blue. Nie umniejsza to osiągnięcia Lee’a Da-yoona, ponieważ mało który zawodnik może się pochwalić dojściem do półfinału w Mistrzostwach Świata.</p>\n\n<p>Wkrótce po tym epizodzie, obie wyżej wymienione drużyny zostały rozwiązane. Jednak \"Spirit\" nie zamierzał kończyć swojej kariery profesjonalnego gracza. W grudniu 2014 roku dołączył do chińskiego najstarszego klubu esportowego – World Elite. Pierwsze tygodnie w nowej organizacji były dla niego udane, gdyż zajął drugą pozycję w Demacia Cup, przegrywając w finale z EDG wynikiem 2 do 3. Dzięki świetnemu występowi WE podczas pierwszej odsłony 9 sezonu IEM w Shenzhen, cała drużyna została zaproszona na Mistrzostwa Świata IEM odbywające się w Katowicach wiosną 2015 roku. Na tym wydarzeniu Lee Da-yoon powtórnie pokazał, że dalej jest światowej klasy junglerem. Kiedy grał swoimi ulubionymi postaciami - Jarvanem IV, Rek’sai i Lee Sinem, robił wrażenie, że samotnie ustawia mecz na korzyść swojego zespołu. Dzięki jego fenomenalnej grze World Elite wygrał między innymi z: GE Tigers, Gambit Gaming i CJ Entus – weteranami takich imprez. Uległ dopiero w walce z Team SoloMid, zajmując drugie miejsce na tym prestiżowym spotkaniu. </p>\n\n<p>Pomimo doskonałego początku członkostwa w World Elite, cały skład nie radził sobie w regularnej chińskiej lidze. Na pewno w pewnym stopniu problemem dla Lee’a Da-yoona była bariera językowa, a wiadomo jak ważną rolę pełni komunikacja w League of Legends. Ostatecznie WE niewiele osiągnęło podczas reszty 2015 roku, z czego najbardziej dotkliwa była porażka w kwalifikacjach do Mistrzostw Świata 2015. W związku z tym w listopadzie 2015 roku \"Spirit\" pożegnał się z chińską elitą, przed opuszczeniem WE zdążył jeszcze podziękować swoim fanom, że wciąż są z nim pomimo zmian zespołów. W wiosennym sezonie 2016 spróbował sił w trzecim regionie, w szeregach jednej z najstarszych europejskich organizacji – Fnatic. Swoje przenosiny skomentował zwięźle: „Wcześniej wybrałem dobrą pensję, teraz wybieram doskonałą drużynę ze świetnymi zawodnikami. Poza tym i tak chciałem się nauczyć angielskiego.”</p>\n","fr_FR":"<p>Da-yun « Spirit » Lee est peut-être l'un des joueurs les plus attendus aux LCS EU de ces dernières années (voire <em>de tous les temps</em>). Bien qu'il ait passé l'année à se faire démolir avec Team WE en LPL, Spirit reste l'un des meilleurs junglers du jeu. C'était un membre clé de la fameuse équipe de Samsung Blue en 2014 et il avait su se faire une place aux côtés de grands noms, comme dade et Deft. Chez Fnatic, où pratiquement chaque poste est occupé par un joueur de talent à l'aube des LCS EU 2016, Spirit a une chance fantastique de retrouver le sommet de la compétition.</p>","es_ES":"<p>Para muchos aficionados occidentales Spirit Lee ‘Spirit’ Da-yoon es un jungla agresivo pero orientado a hacer crecer a un compañero a su lado, como pasó con Bae ‘Reignover’ Eo-Jin en el pasado. Y probablemente, esta definición es la que respeta más la filosofía de Fnatic del año pasado a causa del gran nivel mostrado por Fabian ‘Febiven’ Diepstraten, que podría ser una de las principales armas del equipo. Pero decir esto de Spirit es como no decir nada.</p>\n\n<p>Spirit creció en Corea como uno de los mejores junglas en el mundo, primero con MVP Blue y luego bajo la organización de Samsung. Tras la sombra de varios de los junglas más agresivos y con más presencia en el mapa, el nuevo coreano de Fnatic no se quedaba atrás. Él no destacó sobre sus compañeros, sino que constantemente hizo que sus compañeros destacasen sobre sus enemigos. Pero esto no lo convierte en un jugador de equipo pasivo: Spirit es la definición de proactivo. Su año acabó perfecto hasta que en el Campeonato Mundial 2014 se tuvieron que ver las caras con su equipo gemelo, Samsung White.</p>\n\n<p>Al final, el dinero mueve a las personas y Spirit vió su oportunidad en China bajo la marca de Team World Elite. El equipo que en otra hora lideró la escena china ya no es en absoluto el campeón en el juego aunque todavía mantenga su amplia comunidad de seguidores. A excepción de la IEM de Katowice en la que Team World Elite fue capaz de llegar a la final tras sorprender a todo el mundo con un jungla de escándalo, la temporada fue nefasta. Hasta los últimos partidos de la fase regular en la LPL Team World Elite no despertaba y Spirit vagaba sin rumbo intentando conseguir las victorias él sólo.</p>\n\n<p>Con esto despertó la segunda cara de la moneda que provocó su consideración como uno de los mejores junglas del momento a pesar de haber cambiado a un equipo notablemente inferior. Spirit se convirtió a un juego extremadamente agresivo, con invasiones a la jungla enemiga constantes y con posibilidad de él sólo acaparar los recursos necesarios para ganar partidas. Spirit provocó un bloqueo hacia Nidalee por los equipos enemigos incluso en los peores momentos de la Cazadora Salvaje, y su Rek’Sai también les otorgó muchas partidas.</p>\n\n<p>Fnatic ha encontrado en Spirit un jungla bidimensional: desde un punto de vista más de apoyo agresivo hasta uno totalmente demolador. Puede ejercerlo en cualquier momento del metajuego como bien ha demostrado con campeones como Jarvan IV, Elise o Lee Sin, así como adaptarse a las necesidades de su equipo para poder enfocarse a la victoria. Además de mecánicamente ser un prodigio, Spirit es uno de los jugadores más inteligentes en la jungla a la hora de localizar dónde está el enemigo y qué línea es la más apetecible en cada momento. Un perfecto cazador.</p>\n\n<p>La gran mayoría de rumores en China llegaron alrededor de sus actuaciones fuera del juego, pero las intenciones de Spirit hasta ahora se han mostrado las adecuadas. Admite que en el pasado el dinero era su prioridad, pero que prefiere mejorar su valor como jugador a la vez que ha mostrado la intención de mejorar su nivel de inglés a lo largo de la temporada. La comunicación es una de las grandes dudas en el nuevo Fnatic y Spirit ha asegurado que no será un problema. Spirit ha venido a Europa a reclamar el trono de mejor jungla de Occidente, y tendrá que demostrarlo.</p>"},"foreignIds":{"drupalId":"982","ESPORTSTMNT06":"200000380"},"socialNetworks":{"twitter":"https://twitter.com/fnc_spirit"},"champions":[],"liveGameTeam":174},{"id":401,"slug":"marin","name":"Marin","firstName":"Gyeonghwan","lastName":"Jang","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/marin-fs373908.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-05-31T00:30:50.000Z","bios":{"en_US":"<p>Gyeong-hwan \"Marin\" Jang dove directly into the deep end of Korean esports when he signed with SK Telecom T1 S in 2013. A top laner by trade,  Marin’s confidence is unshakable -- and deservedly so, considering he won the 2015 World Championship with SKT. He has a reputation for disrupting enemy teams by any means necessary -- and from what we can see, he loves every second of it. If Marin gets his hands on Rumble or Fiora, keep an eye on your health bar. You might already be dead. That's what happens when a Worlds MVP shows up.</p>\n\n<p>While most top laners are content living on an island, <a href=\"http://na.lolesports.com/articles/mint-look-marin%E2%80%99s-golden-play\" target=\"_blank\">Marin is the opposite</a>. “Push your lane against your opponent’s tower and force the jungler to help top lane,” Marin says. After all, the more pressure he is absorbing top, the more freedom his team has to control key objectives. The problem with this style of play it leaves Marin 1v2 against the enemy top laner and jungle. Oh wait, did we say that was a problem? 1v2 just means more champions for Marin to farm.</p>","fr_FR":"<p>Gyeong-hwan « MaRin » Jang a tout de suite été mis dans le bain de l'e-sport coréen quand il a signé chez SK Telecom T1 S en 2013. Top-laner de profession, MaRin arbore une confiance inébranlable, ce qui peut se comprendre quand on sait qu'il a gagné le mondial 2015 avec SKT. Il a la réputation de chercher à contrer les plans de l'ennemi par tous les moyens, et à ce qu'on peut observer il a l'air d'adorer ça. Si MaRin met la main sur Rumble ou Fiora, surveillez bien votre jauge de PV, car vous pourriez être déjà mort. C'est assez fréquent si vous tombez nez à nez avec un MVP du mondial.</p>\n\n<p>La plupart des top-laners sont heureux dans leur petit monde, mais pas MaRin. « Il faut pousser sur votre voie jusqu'à la tourelle ennemie et forcer le jungler à venir aider », explique MaRin. Après tout, plus la voie du haut absorbe de pression, plus SKT a de liberté pour contrôler les objectifs clés. Le problème avec ce style de jeu est que MaRin affronte seul deux ennemis sur sa voie : le top-laner et le jungler. Enfin, quand on dit que c'est un problème... Pour lui, c'est davantage de champions à farmer.</p>","pl_PL":"<p>\nKyung-hwan „MaRin” Jang rzucił się od razu na głębokie wody koreańskiego e-sportu, gdy dołączył do SK Telecom T1 S w 2013 r. Pewność siebie MaRina jest niezachwiana – i słusznie, biorąc pod uwagę, że wygrał mistrzostwa świata 2015 z SKT. Słynie z przeszkadzania wrogiej drużynie na wszelkie możliwe sposoby i z tego, co można zauważyć, uwielbia to. Jeżeli Rumble lub Fiora wpadną w ręce MaRina, uważnie przyglądajcie się swoim paskom zdrowia. Możliwe, że już będziecie martwi. Takie rzeczy się dzieją, gdy najlepszy gracz mistrzostw świata rusza do walki.\n</p>\n<p>\nPodczas gdy większość górnych lubi spędzać czas w samotności, Marin jest całkowitym przeciwieństwem. „Przepchnij stwory pod wieżę przeciwnika i zmuś dżunglera do przyjścia na górę”, mówi Marin. Im więcej uwagi przyciąga na górze, tym więcej swobody SKT ma przy kontrolowaniu kluczowych celów. Problemem z tym stylem gry jest to, że Marin często musi walczyć 1 na 2 przeciwko wrogiemu górnemu i dżunglerowi. Chwila, powiedzieliśmy, że to problem? 1 na 2 oznacza tylko więcej bohaterów do farmienia dla Marina.\n</p>","de_DE":"<p>\nKyung-hwan „MaRin“ Jang unterschrieb 2013 bei SK Telecom T1 S und wurde auch gleich ins kalte Wasser geworfen. MaRin, seines Zeichens Toplaner, verfügt über ein unerschütterliches Selbstvertrauen. Und das zu Recht, denn schließlich hat er mit SKT die Weltmeisterschaft 2015 gewonnen. Er ist bekannt dafür, dass er gegnerische Teams mit allen Mitteln stört, und es macht den Anschein, dass er jede Sekunde davon genießt. Wenn MaRin Rumble oder Fiora spielt, behaltet besser eure Lebensanzeige im Auge. Vielleicht seid ihr ja schon tot. Das kann passieren, wenn ein MVP der WM auftaucht.\n</p>\n<p>\nDie meisten Toplaner stört es nicht, von den anderen Spielern abgeschnitten zu sein, MaRin sieht das jedoch anders. „Drück deine Lane an den gegnerischen Turm und zwinge den Jungler, in der oberen Lane auszuhelfen“, rät MaRin. Je mehr Druck er nämlich in der oberen Lane abfängt, desto freier können SKT wichtige Ziele kontrollieren. Problematisch an diesem Spielstil ist, dass MaRin sich alleine gegen den Toplaner und den Jungler des Gegners behaupten muss. Moment, sagten wir „problematisch“? Einer-gegen-Zwei heißt einfach nur, dass MaRin mehr Champions zum Farmen hat.\n</p>","es_ES":"<p>\nKyung-hwan ''MaRin'' Jang aterrizó directamente en el centro de los deportes electrónicos coreanos al fichar por SK Telecom T1 S en 2013. La principal característica de este calle superior es una confianza a toda prueba... seguramente merecida, si tenemos en cuenta que en 2015 ha ganado el Campeonato Mundial con SKT. Se ha hecho famoso por su capacidad de desorganizar a los equipos enemigos por cualquier medio... y a juzgar por lo que hemos podido ver, disfruta como un enano haciéndolo. Si MaRin consigue echar mano a Rumble o a Fiora, más te vale vigilar tu barra de Vida, porque puede que ya estés muerto. Es lo que pasa cuando te enfrentas a un MVP del Mundial.\n</p>\n<p>\nMientras que la mayoría de los jugadores de la calle superior se contentan con vivir en una isla, a MaRin le pasa justo lo contrario. ''Tienes que avanzar contra la torre del rival y obligar a su jungla a ayudar en la calle superior'', dice. A fin de cuentas, cuanta más presión tenga que absorber en la superior, más libertad dejará a SKT para controlar los objetivos importantes. El problema de este estilo de juego es que deja a MaRin solo contra el calle superior y el jungla rivales. Alto, ¿he dicho que eso era un problema? No debería, porque en el caso de MaRin, dos campeones en contra significa el doble de posibilidades de asesinar campeones.\n</p>","pt_BR":"<p>Marin estreou no cenário profissional direto no olho do furacão: assinou com a SK Telecom T1 S em 2013. Ele é um jogador de rota do topo por natureza, muito confiante no que faz. Marin ficou famoso por obliterar adversários a qualquer custo. Se ele pegar Rumble ou Maokai, é melhor você sair correndo. Se der tempo.</p>\n\n<p>Enquanto a maioria dos jogadores no topo gosta de viver isolado em uma ilha, Marin busca o contrário. \"Empurre sua rota para sufocar o adversário, e force o caçador a ajudar no topo\", é o que ele diz. Afinal, quanto mais pressão ele exercer na rota, mais liberdade a SKT tem para controlar os principais objetivos. O problema é que ele geralmente se vê em confrontos 1x2. Ou talvez isso seja bom: é um Campeão a mais para ele eliminar. </p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">MaRin\" 장경환은 2013년 SK Telecom T1 S와 계약하면서 한국 e스포츠의 핵심에 바로 합류했습니다. 탑 라이너인 MaRin의 자신감은 좀처럼 흔들리지 않습니다. 2015년 SKT의 일원으로 월드 챔피언십을 차지한 걸 생각하면 그럴 만도 하죠. MaRin은 어떤 수를 써서라도 적 팀을 혼란에 빠뜨리는 것으로 유명합니다. 그리고 그 모든 순간을 진정 즐기는 것처럼 보이죠. MaRin이 럼블이나 피오라를 선택했다면 적은 체력 게이지를 주시해야 합니다. 이미 죽어있을 수도 있거든요. 세계적인 MVP 선수가 등장하면 흔히 벌어지는 일이죠.</p>\n<p style=”font-family:”나눔고딕”;\">대부분의 탑 라이너들은 혼자 지내는 것에 만족하지만 MaRin은 정반대입니다. \"적 타워까지 라인을 밀고 적 정글러가 탑 라인을 돕게 만들어요\"라고 그는 말하죠. 어찌됐든 그가 탑에서 더 많은 일을 해낼수록 SKT가 주요 목표물을 확보할 여지도 많아집니다. 이런 플레이 스타일의 문제는 MaRin이 적팀의 탑 라이너와 정글러를 상대로 1:2 상황에 맞닥뜨릴 수 있다는 건데요. 아, 잠깐만요. 지금 '문제'라고 했나요? 여기서 말하는 1:2 상황은 MaRin이 파밍할 챔피언이 하나 더 있다는 뜻입니다. </p>\n"},"foreignIds":{"drupalId":"877","ESPORTSTMNT06":"200000379"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":749,"slug":"score","name":"Score","firstName":"Dong-bin","lastName":"Ko","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/score-gtlz6pjd.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:20:25.000Z","bios":{"en_US":"<p>Dong-bin \"Score\" Ko, once known as “The Immortal Score,” is one of a select few Korean pros to transition smoothly from playing one role to another. Originally the pre-eminent ADC for KT Rolster, Score had a knack for surviving team fights due to his excellent positioning.\n</p>\n<p>\nScore traded in his guns and rockets for a flask and burrowing kit and moved into the jungle in 2015. Now working with a new roster, he'll have to build synergy with his new all-star laners to find success in 2017.\n</p>","fr_FR":"<p>Dong-bin « Score » Go, naguère surnommé l'« Immortel Score », est un des rares professionnels coréens à avoir su passer de façon fluide d'un rôle à un autre. Quand il était le carry AD par excellence de KT Rolster, Score avait le don pour survivre aux combats d'équipes grâce à son excellent sens du positionnement.\n</p>\n<p>\nScore opéra une reconversion vers la jungle en 2015. Pour l'heure, ce choix a l'air de sourire à KT Rolster. Les ganks de Score sur la voie du haut donnent constamment à ssumday un avantage crucial. Il fut un temps où Score amassait les éliminations sur la voie du bas, mais aujourd'hui je pense qu'on peut dire\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...que son score ne l'intéresse plus. (Phreak par pitié, ne touche pas à mon clavier).</p>","pl_PL":"<p>Dongbin „Score” Go, znany kiedyś jako „The Immortal Score” jest jednym z niewielu koreańskich zawodowców, którzy gładko przeszli z jednej roli w inną. Niegdyś był prowadzącym w KT Rolster i często przeżywał walki drużynowe ze względu na idealne ustawienie.\n</p>\n<p>\nScore przesiadł się z rakiet i broni na mikstury i przeszedł do dżungli w 2015 roku. Chwilowo ruch ten wydaje się służyć KT Rolster. Ganki Score'a na górnej alei zapewniają ssumdayowi przewagę. Chociaż Score niegdyś sam zdobywał zabójstwa na dole, teraz można powiedzieć,..\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...że Score'a nie obchodzi już jego score (wynik). (Phreak, daj spokój, zostaw mój komputer).\n</p>","de_DE":"<p>Dongbin \"Score\" Ko war wie heute schon zu Zeiten von KT Rolster Bullets der Teamkapitän und hat die Kommandos gegeben. Das Bemerkenswerte ist, dass er dies damals als Schütze, also einer sehr mikrolastigen Rolle, machte, was zu dieser Zeit keiner anderer zu diesem Maße mit Erfolg nachmachen konnte. Als Anfang 2015 die beiden Schwesterteams KTA und KTB sich zusammentaten, hat Score seine Rolle zum Jungler gewechselt. Sehr schnell nahm dieser Wechsel eine solide Form an, wobei auch die langjährige Erfahrung eine große Rolle spielte. Score wandelt diese in kluge Jungle-Pfade und Manöver um seine Gegner herum um. Zusammen mit seinem Support Piccaboo bilden diese beiden das beste Jungle/Support-Duo in Korea, das dem Gegner immer und immer wieder klar macht, dass sie keine Führung so leicht aus den Händen geben.</p>","es_ES":"<p>Dong-bin \"Score\" Go, una vez conocido como “El inmortal Score”, es uno de los pocos elegidos coreanos que ha cambiado con éxito su rol dentro del juego. Originalmente en el puesto de tirador para KT Rolster, Score tiene un truco para sobrevivir en todas las peleas gracias a su extraordinario posicionamiento. </p>\n\n<p>Score cambió sus pistolas y cohetes por la mochila de explorador y se fue a la jungla en 2015. Hasta ahora el cambio parece haber funcionado para KT Rolster. Las emboscadas de Score en la calle superior suelen darle ventaja a su compañero ssumday. Hubo un tiempo en el que Score acaparaba los asesinatos de su equipo, aquellos maravillosos años…</p>\n","pt_BR":"<p>Dong-bin \"Score\" Go, uma vez conhecido como \"O Imortal Score\", é um dos poucos jogadores coreanos a transitar tranquilamente de uma posição para outra. Originalmente um proeminente atirador para a KT Rolster, Score era conhecido por sobreviver às lutas com seu excelente posicionamento.\n</p>\n<p>\nScore trocou suas armas e foguetes por um machete e repelentes, e mudou-se para a selva em 2015. Até agora tudo tem dado certo para a KT Rolster. As emboscadas de Score na rota do topo regularmente colocam Ssumday em uma vantagem crucial para a equipe. Enquanto Score antigamente era conhecido por conquistar abates para si próprio na rota de baixo, hoje em dia você pode até dizer que...\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n...ele não se importa muito com seu score (placar). (Phreak pfv, deixe meu computador em paz).\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한때 생존왕이라고 불리기도 했던 \"Score\" 고동빈은 포지션 전향이 순탄하게 이루어진 몇 안 되는 한국 프로게이머들 중 하나입니다. KT Rolster의 탁월한 원거리 딜러였던 Score는 훌륭한 위치 선정으로 팀 전투에서 생존하는 능력이 좋았습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 Score는 총과 로켓 대신 술통과 매복 스킬을 들고 정글로 들어갔습니다. 그의 포지션 전향은 KT Rolster에게 도움이 되고 있는 듯합니다. Score의 탑 라인 갱킹은 Ssumday가 계속해서 우위에 설 수 있게 해줍니다. 한때 Score는 봇 라인에서 킬을 독식했을지 몰라도 요즘은 자기 스코어에 신경 쓰지 않습니다. </p>\n"},"foreignIds":{"drupalId":"2163","ESPORTSTMNT06":"200000341","TRLT3":"200000213"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":767,"slug":"tusin","name":"Tusin","firstName":"Jong-ik","lastName":"Park","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tusin-d92elfiv.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-31T00:38:28.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2803","ESPORTSTMNT06":"200000446"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":769,"slug":"smeb","name":"Smeb","firstName":"Kyungho","lastName":"Song","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smeb-afu7c8ds.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-07-06T14:10:36.000Z","bios":{"en_US":"<p>Kyungho \"Smeb\" Song is the most feared top laner in the world; but it wasn’t always that way. His professional debut with Incredible Miracle in 2013 was disastrous, and he was crushed repeatedly by the LCK’s top lane heavyweights. After Smeb made the move to the ROX Tigers (previously KOO Tigers) in late 2014, he defied his critics, and his play skyrocketed under the tutelage of ROX coach NoFe. Smeb’s endearing ascension gained him fans and respect as one of the most formidable foes on the Rift.</p>\n\n<p>Smeb has continually reached new heights as a player, collecting his second straight LCK MVP award in the 2016 LCK Summer Split, when he led a resilient ROX squad to their first-ever LCK crown. The hype behind Smeb was at a fever pitch heading into Worlds until the Tigers met their bitter rivals, SK Telecom T1, in the Semifinals. Even though Smeb and company fell to SKT in a hardfought battle, his admirable performances left an impression on viewers.</p>","fr_FR":"<p>Kyung-ho « Smeb » Song est aujourd'hui le top laner le plus craint au monde, mais cela n'a pas toujours été le cas. Ses débuts en tant que professionnel avec Incredible Miracle en 2013 ont été désastreux et se sont soldés par de nombreux échecs face aux poids lourds top laners des LCK. Après avoir rejoint les ROX Tigers (anciennement KOO Tigers) fin 2014, il a défié ses détracteurs et ses performances explosèrent sous la houlette de l'entraîneur des ROX, NoFe. Avec son ascension, Smeb a conquis les fans et le respect de ses pairs comme l'un des ennemis les plus imposants de la Faille.</p>\n\n<p>Smeb n'a jamais cessé d'évoluer en tant que joueur, remportant sa deuxième récompense de MVP LCK lors du segment d'été des LCK 2016 quand, grâce à la ténacité de l'équipe, ROX a pu y décrocher sa première couronne. L'engouement derrière Smeb était encore à son comble lors du Mondial jusqu'à la rencontre entre les Tigers et leurs adversaires cinglants, SK Telecom T1, lors de la demi-finale. Même si Smeb et son équipe ont perdu face à SKT après un combat acharné, ses performances incroyables ont fait forte impression sur les spectateurs qui l'ont propulsé sur la scène de l'événement All-Stars 2016 à Barcelone.</p>","pl_PL":"<p>Kyungho „Smeb” Song to budzący największą grozę na świecie gracz górnej alei — ale nie zawsze tak było. Jego profesjonalny debiut w Incredible Miracle w 2013 okazał się katastrofalny. Smeb był raz za razem miażdżony przez weteranów górnej alei z LCK. Gdy Smeb przeniósł się do ROX Tigers (dawniej KOO Tigers) pod koniec 2014 roku, rzucił rękawicę krytykom, a jego gra osiągnęła niebotyczny pułap dzięki opiece trenera ROX, NoFe. Śmiały awans Smeba przysporzył mu fanów oraz zapewnił szacunek należny jednemu z najgroźniejszych przeciwników na Summoner’s Rift.</p>\n<p>\nSmeb nieustannie osiągał nowe wyżyny jako zawodnik, zdobywając drugą z rzędu nagrodę dla Najlepszego Zawodnika LCK, gdy doprowadził mocny skład ROX do ich pierwszego wielkiego zwycięstwa w LCK. Gorączka zachwytów nad Smebem rosła w toku Mistrzostw, aż Tigers spotkali się w półfinałach ze swoimi zaciętymi rywalami, SK Telecom T1. Chociaż Smeb i koledzy ulegli SKT w zażartym boju, jego godny podziwu występ zrobił wrażenie na widzach, którzy wysłali go na wydarzenie All-Star 2016 w Barcelonie.\n","de_DE":"<p>Kyung-ho „Smeb“ Song ist der gefürchtetste Top-Laner der Welt, aber das war nicht immer der Fall. 2013 gab er ein katastrophales Debüt in der professionellen E-Sport-Szene für Incredible Miracle und wurde außerdem immer wieder von anderen Top-Lanern der LCK vernichtet. Nachdem Smeb Ende 2014 zu den ROX Tigers (ehemals KOO Tigers) gewechselt hatte, ließ er seine Kritiker verstummen und verbesserte seine Spielweise unter der Anleitung von ROX’ Coach NoFe ungemein. Smebs Aufstieg brachte ihm Fans und den Respekt der besten Spieler der Kluft ein.</p>\n\n<p>Smeb hat als Spieler immer wieder neue Höhen erreicht und nachdem er beim Sommer-Split 2016 seinen zweiten Titel als MVP der LCK erhalten hatte, führte er ROX zum ersten Sieg in der LCK. Der Hype um Smeb erreichte bei der Weltmeisterschaft seinen Höhepunkt, bis die Tigers im Halbfinale auf ihren größten Rivalen trafen: SK Telecom T1. Obwohl sich Smeb und seine Kameraden SKT nach einem harten Kampf beugen mussten, hinterließ seine Vorstellung bleibenden Eindruck bei den Zuschauern, die ihn jetzt auf der Bühne des All-Stars-Events 2016 in Barcelona sehen wollen.</p>","es_ES":"<p>Kyungho \"Smeb\" Song es considerado el top más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el split de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","pt_BR":"<p>Kyung-ho \"Smeb\" Song é um dos topos mais temidos do mundo, mas nem sempre foi assim. Sua estreia profissional na Incredible Miracle em 2013 foi um desastre e ele era constantemente destruído pelos pesos-pesados da rota do topo na LCK.  Depois de ter entrado para a ROX Tigers (antiga KOO/GE Tigers) no final de 2014, ele desafiou todos os críticos e seu desempenho explodiu sob a tutela do técnico da ROX, NoFe. A ascensão cativante de Smeb ganhou a ele fãs e respeito como um dos inimigos mais formidáveis no Rift.</p>\n\n<p>Smeb continuiu a atingir novos patamares como jogador, conquistando seu segundo prêmio consecutivo como MVP da LCK. O topo liderou a equipe resiliente da ROX a sua primeira coroa na LCK. A animação por trás de Smeb estava altíssima ao entrar no Mundial, até a Tigers encontrar sua rival, a SK Telecom T1, nas Semifinal. Apesar de Smeb e companhia terem perdido para a SKT em uma batalha difícil, seu desempenho admirável deixou uma impressão nos jogadores que os levou a votar nele para o Evento All-Star 2016.</p>","ko_KR":"<p>\"Smeb\" 송경호 선수는 LCK의 최강 탑 라이너 중 한 명입니다. 2013년 Incredible Miracle에서 e스포츠 경력을 시작했지만 별다른 모습을 보여주지 못했던 Smeb 선수는 2014년 말 ROX Tigers에 입단한 후 달라진 모습을 보여주기 시작했습니다. NoFe 코치의 지도를 받아 나르, 럼블, 헤카림을 마스터해 누구보다도 더 능수능란하게 다루는 모습을 보여주었죠. 특히 나르로 뛰어난 모습을 보여 2015 LCK 스프링에서는 나르로 6승 1패를 기록하기도 했습니다.</p>\n<p>ROX Tigers는 카토비체에서 개최된 IEM 시즌 IX 월드 챔피언십에서 World Elite에게 패하기는 했지만, 꾸준히 세계 최강급 팀으로서의 면모를 보여 왔습니다. LCK의 상위권 팀들과 자주 맞붙어야 하는 ROX Tigers에게 있어 Smeb 선수가 탑에서 럼블과 나르로 잠재력을 발휘할 수 있느냐는 팀의 성패와 직결되죠. Smeb 선수가 제 기량만 발휘할 수 있다면 ROX Tigers의 앞날을 밝을 것입니다. </p>\n","es_AR":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","cs_CZ":"<p>Kyungho „Smeb“ je nejobávanějším horním lajnařem na světě, ale nebylo tomu tak vždy. Jeho profesionální debut s Incredible Miracle roku 2013 skončil katastrofou a špičkoví horní lajnaři z LCK si z něj opakovaně dělali fackovacího panáka. Když však koncem roku 2014 přestoupil do ROX Tigers (dříve KOO Tigers), vzal svým kritiků vítr z plachet a pod vedením trenéra NoFea z ROXu se jeho herní schopnosti ohromným tempem zlepšovaly. Svou cílevědomostí a odhodláním si Smeb vysloužil davy fanoušků a pověst jednoho z nejtěžších nepřátel, na jaké lze ve Žlebu narazit.</p>\n\n<p>Smebova hvězda na herním nebi září čím dál jasněji. Během letního splitu LCK 2016 získal podruhé po sobě ocenění pro nejužitečnějšího hráče ligy, a to zcela zaslouženě, neboť dovedl nezdolný tým ROX k jeho historicky prvnímu titulu z LCK. Nadšení jeho fanoušků dosáhlo s příchodem MS neuvěřitelných výšin, studená sprcha však přišla v semifinále, kde Tigers narazili na své úhlavní nepřátele z SK Telecom T1. Smeb a jeho tým sice SKT podlehli, avšak byla to tvrdá bitva a jeho výkony zanechaly v divácích takový dojem, že se rozhodli jej vyslat do Barcelony na turnaj All-Star 2016.</p>","el_GR":"<p>Ο Kyungho \"Smeb\" Song θεωρείται ο πιο επικίνδυνος παίκτης επάνω λωρίδας στον κόσμο. Δεν ήταν πάντα έτσι, όμως. Έκανε το ντεμπούτο του στην επαγγελματική σκηνή με τους Incredible Miracle του 2013 και γνώρισε την απόλυτη αποτυχία, καθώς τον τσαλαπάτησαν όλοι οι δυνατοί παίκτες επάνω λωρίδας του LCK. Όταν ο Smeb πήρε μεταγραφή στους ROX Tigers (προηγουμένως KOO Tigers) στα τέλη του 2014, όχι μόνο διέψευσε τους κριτικούς του, αλλά βελτίωσε θεαματικά το παιχνίδι του με την καθοδήγηση του προπονητή των ROX, NoFe. Η άνοδος του Smeb κέρδισε τη συμπάθεια και το σεβασμό του κόσμου και τον έκανε έναν από τους πιο τρομακτικούς αντιπάλους στο παιχνίδι.</p>\n\n<p>Ο Smeb κατακτά διαρκώς νέες κορυφές ως παίκτης και πρόσφατα κέρδισε το δεύτερό του βραβείο MVP στο Summer Split 2016 του LCK, όπου οδήγησε τους εξαιρετικά ανθεκτικούς ROX στην πρώτη τους κατάκτηση του πρωταθλήματος. Η πορεία του Smeb είχε δημιουργήσει τρομακτικό ενθουσιασμό, μέχρι που οι Tigers συνάντησαν τους αιώνιους αντιπάλους τους, SK Telecom T1, στους Ημιτελικούς. Παρόλο που ο Smeb και η παρέα του ηττήθηκαν μετά από σκληρό αγώνα, οι εκπληκτικές εμφανίσεις του έκαναν θετική εντύπωση στους θεατές, με αποτέλεσμα να κερδίσει μια θέση στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη.</p>","hu_HU":"Kyungho „Smeb” Song ma a világ legrettegettebb felső ösvényese, de ez nem mindig volt így. 2013-as bemutatkozása az Incredible Miracle tagjaként katasztrofálisra sikeredett, és az LCK felső ösvényes nehézsúlyú játékosai sorra kiütötték. Smeb átigazolt a ROX Tigershez (korábban KOO Tigers) 2014 végén. A ROX edzője, NoFe irányítása alatt hatalmasat fejlődött. Smeb üstökösszerű felemelkedése sok rajongót és rengeteg tiszteletet hozott neki, és ma már a Szurdok egyik legkeményebb harcosának számít.\n</p>\nSmeb egyre magasabbra jut játékosként, zsinórban kétszer lett MVP az LCK 2016-os nyári szakaszában, majd megnyerte a ROX csapatával együtt az első LCK-s bajnoki címüket. Smeb menetelése a vb-n is folytatódott, amíg a Tigers nem találkozott legnagyobb riválisával, az SK Telecom T1-nal az elődöntőben. Bár Smeb és csapata kemény küzdelem után elesett az SKT ellen, így is elég népszerűvé vált ahhoz, hogy kijusson a 2016-os All-Star gálára.\n","it_IT":"Oggi Kyungho \"Smeb\" Song è il superiore più temuto al mondo, ma non è stato sempre così. Il suo debutto professionale con gli Incredible Miracle nel 2013 fu disastroso e lui stesso fu schiacciato ripetutamente in corsia superiore dai pesi massimi della LCK. Dopo essere passato ai ROX Tigers (ex KOO Tigers) alla fine del 2014, ha smentito ogni critica portando il suo gioco a livelli stellari sotto la guida del coach dei ROX, NoFe. L'affascinante ascesa di Smeb gli è valsa l'affetto di numerosi fan e il rispetto degli avversari, che lo considerano uno dei più formidabili guerrieri della Landa.\n</p>\nSmeb ha continuato a raggiungere nuove vette come giocatore, ottenendo il secondo premio consecutivo come MVP nella LCK durante il Summer Split 2016, quando ha guidato i ROX al loro primo trofeo LCK. Gli occhi del mondo erano puntati su Smeb durante i Mondiali, soprattutto durante la battaglia in semifinale contro gli acerrimi rivali degli SK Telecom T1. Anche se Smeb e i suoi compagni si sono dovuti arrendere davanti agli SKT dopo un'intensa battaglia, le sue notevoli prestazioni hanno impressionato il pubblico, che ha deciso di mandarlo dritto a Barcellona per l'All-Star.\n","ro_RO":"Kyungho ''Smeb'' Song este unul dintre cei mai temuți jucători de pe culoarul de sus din lume; dar nu a fost mereu așa. Debutul său pe scena profesionistă alături de Incredibile Miracle în 2013 a fost unul dezastruos, iar el a fost învins în repetate rânduri de legendele de pe culoarul de sus din LCK. După ce Smeb a venit la ROX Tigers (cunoscuți anterior drept KOO Tigers) la finalul lui 2014, și-a sfidat criticii și și-a îmbunătățit stilul de joc sub tutela lui NoFe, antrenorul echipei. Ascensiunea lui incredibilă i-a adus fani și respect, fiind considerat acum unul dintre cei mai formidabili adversari din Rift.</p>\n\nSmeb a atins în mod constant noi culmi ca jucător, câștigând al doilea titlu consecutiv de MVP în LCK în etapa de vară LCK 2016, când a condus echipa ROX către primul ei titlu din LCK. Speranțele și entuziasmul fanilor au atins apogeul la începutul Campionatului Mondial, când cei din Tigers și-au întâlnit adversarii înverșunați, SK Telecom T1, în semifinale. Chiar dacă Smeb și echipa lui au fost învinși de SKT într-un meci extrem de dificil, reușitele sale admirabile le-au lăsat spectatorilor o impresie plăcută, care-l aduce pe scena All-Star Event 2016 din Barcelona.\n\n","es_MX":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>"},"foreignIds":{"drupalId":"2151","ESPORTSTMNT06":"200000340","TRLT3":"200000212"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":800,"slug":"kkramer","name":"Kramer","firstName":"Jonghoon","lastName":"Ha","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kkramer-gwv88ej5.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-22T22:18:16.000Z","updatedAt":"2017-05-31T00:35:38.000Z","bios":{"en_US":"","fr_FR":"<p>\nJong-hoon « Kkramer » Ha est nouveau dans l'organigramme de Flash Wolves, ayant joint ses forces à l'équipe en 2015. Connu en Corée pour sa manière de jouer Vayne, Kkramer a souvent évoqué son désir de devenir le meilleur Vayne de la planète en détrônant des maîtres comme Uzi et Piglet.\n</p>","es_ES":"<p>\nJong-hoon ''Kkramer'' Ha es la última incorporación a la plantilla de Flash Wolves, a la que llegó en verano del 2015. Conocido hasta entonces por la pericia demostrada con Vayne en Corea, ha afirmado en repetidas ocasiones que su deseo es llegar a convertirse en el mejor especialista del mundo con este campeón, en detrimento de estrellas tan rutilantes como Uzi o Piglet.\n</p>","pl_PL":"<p>\nJong-hoon „Kkramer” Ha jest nowym nabytkiem wśród członków Flash Wolves. Dołączył do drużyny latem 2015 r. Choć wcześniej zasłynął w Korei z gry Vayne, Kkramer nierzadko oświadczał, że pragnie się stać najlepszym graczem tą postacią, bijącym na głowę dawnych mistrzów, takich jak Uzi czy Piglet.\n</p>","de_DE":"<p>\nJong-hoon „Kkramer“ Ha ist der Neuzugang bei Flash Wolves, er kam im Sommer 2015 ins Team. In Südkorea war er bekannt für sein Spiel mit Vayne, und er hat schon oft erwähnt, dass es sein Wunsch ist, der beste Vayne-Spieler der Welt zu werden, und dass er alte Meister wie Uzi und Piglet vom Thron stürzen will.\n</p>","pt_BR":"<p>O mais novo integrante da Flash Wolves chegou no verão de 2015. Kkramer ficou famoso na Coreia com sua Vayne, e já declarou o desejo de se tornar o melhor no mundo com ela, desafiando mestres como Uzi e Piglet.</p>"},"foreignIds":{"drupalId":"4654","ESPORTSTMNT06":"200000383"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":1688,"slug":"mowgli","name":"Mowgli","firstName":"Jaeha","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mowgli-arq84t54.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-12T19:02:12.000Z","updatedAt":"2017-05-31T00:37:59.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000381"},"socialNetworks":{},"champions":[],"liveGameTeam":174},{"id":2050,"slug":"ssun","name":"Ssun","firstName":"Taeyang","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:19:56.000Z","updatedAt":"2017-07-06T14:11:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001523","TRLT3":"200000200"},"socialNetworks":{},"champions":[],"liveGameTeam":105}],"scheduleItems":[{"id":"AVTGAQAeQMQFcjhwbQf9","content":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:match:a7e9a0fa-105f-4082-86b3-0fac626d5485","scheduledTime":"2016-06-10T11:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db","blockLabel":"3","subBlockLabel":"5","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:bracket:2819fc4e-457f-4242-96ad-0d9137aa9222"},"match":"a7e9a0fa-105f-4082-86b3-0fac626d5485","tournament":"a9a19798-6c5b-4383-ab27-e2bd08e224db","bracket":"2819fc4e-457f-4242-96ad-0d9137aa9222","league":"6"}],"gameIdMappings":[{"id":"36512cfa-dbe4-4932-85a8-3e0232fd5234","gameHash":"a7b8d781e505ac56"},{"id":"c764ed3d-8895-41e2-869b-2443e1c51cc7","gameHash":"8562db293a466b6f"}],"videos":[{"id":3065,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:c764ed3d-8895-41e2-869b-2443e1c51cc7","source":"https://www.youtube.com/embed/0YJcrynUD7Y?wmode=transparent&start=12133","createdAt":"2016-06-11T01:20:17.000Z","updatedAt":"2016-06-11T01:20:17.000Z","game":"c764ed3d-8895-41e2-869b-2443e1c51cc7"},{"id":3066,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:a9a19798-6c5b-4383-ab27-e2bd08e224db:game:36512cfa-dbe4-4932-85a8-3e0232fd5234","source":"https://www.youtube.com/embed/0YJcrynUD7Y?wmode=transparent&start=15492","createdAt":"2016-06-11T01:23:51.000Z","updatedAt":"2016-06-11T01:23:51.000Z","game":"36512cfa-dbe4-4932-85a8-3e0232fd5234"}],"htmlBlocks":[],"match":{"id":"a7e9a0fa-105f-4082-86b3-0fac626d5485","name":"KT-vs-AFS","position":9,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}],"games":{"36512cfa-dbe4-4932-85a8-3e0232fd5234":{"id":"36512cfa-dbe4-4932-85a8-3e0232fd5234","name":"G2","generatedName":"AFS|KT|G2|a7e9a0fa105f408286b3","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}],"standings":{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465607895414,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465566115039,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1080879","gameRealm":"TRKR1","platformId":"TRKR1:1080879","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c764ed3d-8895-41e2-869b-2443e1c51cc7":{"id":"c764ed3d-8895-41e2-869b-2443e1c51cc7","name":"G1","generatedName":"AFS|KT|G1|a7e9a0fa105f408286b3","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}],"standings":{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465607843284,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465592172749,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465566352540,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1080874","gameRealm":"TRKR1","platformId":"TRKR1:1080874","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"627f4272-374d-4f8c-8c56-3573b73e1eaa":{"id":"627f4272-374d-4f8c-8c56-3573b73e1eaa","name":"G3","generatedName":"AFS|KT|G3|a7e9a0fa105f408286b3","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"},{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465607895414,"source":"bestOf","history":[{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465607843285,"source":"bestOf","closed":true},{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465592172749,"source":"bestOf","closed":true},{"result":[[{"roster":"9c98ab8b-2469-4a99-90de-a393f4d75d82"}],[{"roster":"f86415df-fbcc-4b7a-80ff-897d33ea3607"}]],"timestamp":1465566115039,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"f86415df-fbcc-4b7a-80ff-897d33ea3607":0,"9c98ab8b-2469-4a99-90de-a393f4d75d82":1}}}