{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]}],"players":[{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AVmJu7goQMQFcjhwbQso","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:a9d61b0f-8602-4e31-8a61-57eb50568446","scheduledTime":"2017-03-09T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"7","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:612571e5-a5ba-4462-8221-9ed073eebeb5"},"match":"a9d61b0f-8602-4e31-8a61-57eb50568446","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"612571e5-a5ba-4462-8221-9ed073eebeb5","league":"3"}],"gameIdMappings":[{"id":"c7aedb06-f3cc-4893-98c3-25eda91f13db","gameHash":"89c96e9459000fb3"},{"id":"c0387079-6fae-44a7-bc98-fb3565c9ae37","gameHash":"97aaa09f204e1b42"},{"id":"006faae6-4c41-43e5-aa30-b43512f785ed","gameHash":"9096bf7272c71105"}],"videos":[{"id":5991,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:006faae6-4c41-43e5-aa30-b43512f785ed","source":"https://www.youtube.com/embed/jDLd_Og3XwQ?wmode=transparent","createdAt":"2017-03-10T00:18:57.000Z","updatedAt":"2017-03-10T00:18:57.000Z","game":"006faae6-4c41-43e5-aa30-b43512f785ed"},{"id":5992,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:c0387079-6fae-44a7-bc98-fb3565c9ae37","source":"https://www.youtube.com/embed/Fy0c6dn5KHY?wmode=transparent","createdAt":"2017-03-10T00:19:12.000Z","updatedAt":"2017-03-10T00:19:12.000Z","game":"c0387079-6fae-44a7-bc98-fb3565c9ae37"},{"id":5997,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:c7aedb06-f3cc-4893-98c3-25eda91f13db","source":"https://www.youtube.com/embed/KRSQSQzKdGs?wmode=transparent","createdAt":"2017-03-10T07:22:08.000Z","updatedAt":"2017-03-10T07:22:08.000Z","game":"c7aedb06-f3cc-4893-98c3-25eda91f13db"}],"htmlBlocks":[],"match":{"id":"a9d61b0f-8602-4e31-8a61-57eb50568446","name":"ROC-vs-OG","position":24,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"},{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],"games":{"c0387079-6fae-44a7-bc98-fb3565c9ae37":{"id":"c0387079-6fae-44a7-bc98-fb3565c9ae37","name":"G2","generatedName":"OG|ROC|G2|a9d61b0f86024e318a61","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"},{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],"standings":{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489105304050,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489100695298,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1001980283","gameRealm":"TRLH3","platformId":"TRLH3:1001980283","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"006faae6-4c41-43e5-aa30-b43512f785ed":{"id":"006faae6-4c41-43e5-aa30-b43512f785ed","name":"G1","generatedName":"OG|ROC|G1|a9d61b0f86024e318a61","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"},{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],"standings":{"result":[[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}]],"timestamp":1489105288914,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}]],"timestamp":1489096281888,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1001980278","gameRealm":"TRLH3","platformId":"TRLH3:1001980278","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c7aedb06-f3cc-4893-98c3-25eda91f13db":{"id":"c7aedb06-f3cc-4893-98c3-25eda91f13db","name":"G3","generatedName":"OG|ROC|G3|a9d61b0f86024e318a61","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"},{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],"standings":{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489130343800,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489103884864,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1001980284","gameRealm":"TRLH3","platformId":"TRLH3:1001980284","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489130343800,"source":"bestOf","history":[{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489105304050,"source":"bestOf","closed":true},{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489105288915,"source":"bestOf","closed":true},{"result":[[{"roster":"2070feb7-3097-43ad-b3b6-b7a48cb191b7"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1489103884864,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"2070feb7-3097-43ad-b3b6-b7a48cb191b7":1,"1b468c86-d18a-4ead-bad5-e848189e9fa8":0}}}