{"teams":[{"id":55,"slug":"fc-schalke-04","name":"FC Schalke 04","guid":"be6cad42-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fc-schalke-04-h992ofkj.png","acronym":"S04","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-07-06T22:27:08.000Z","bios":{"en_US":"<p>\nFC Schalke 04 bought Elements’  EU LCS seed just before the beginning of the 2016 EU LCS Summer Split. The team's remained largely the same, aside from a key addition in the mid lane with Hampus “Fox” Myhre. \n</p>\n<p>\nSchalke has a long history in organized sports, dating back to the early 1900s. This marks their first foray into the world of League of Legends esports. With a group that finished 7th last split, Schalke is looking to turn around the team’s fortunes and carve a name for themselves in the esports world.\n</p>\n<p>\nCoach: Michael \"Veteran\" Archer\n</p>","pl_PL":"<p>Organizacja, która istnieje dzięki zaangażowaniu graczy udzielających się w League of Legends od jej początków. Drużyna Elements powstała z Alliance, po której odziedziczyła miejsce w wiosennym sezonie EU LCS 2015. Przymusowa przemiana była spowodowana zmianami praw dotyczących zespołów, zbiegła się również ze zmianami w składzie osobowym drużyny. W sezonie piątym cała drużyna został zbudowana w około Henrika \"Froggen\" Hansena, jednego z najpopularniejszych graczy Europy. Stworzeniu organizacji towarzyszyła ciekawa i bardzo oryginalna kampania reklamująca jej członków. W sieci pojawiła się seria zdjęć przedstawiająca buty każdego z zawodników, dzięki czemu część z nich została rozpoznana przez fanów przed oficjalnym ogłoszeniem całej ekipy. Pojawił się również ich znak firmowy – logo przedstawiające pięć żywiołów. Dzięki znanym i lubianym graczom, którzy znaleźli się w szeregach organizacji, rzesza wielbicieli kibicowała kolejnym ujawnianym informacjom o powstającej drużynie.</p>\n<p>\nPo nowo utworzonej organizacji fani spodziewali się wyników, które zagwarantują Elements podium. Niestety rzeczywistość i poważna konkurencja zweryfikowały te oczekiwania. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 żywiołowej ekipie poszło przeciętnie. Dwukrotnie znaleźli się na siódmej pozycji mało imponującym wynikiem 7:11. Zwolennicy nie byli w pełni zawiedzeni, gdyż zespół Elements nie radził sobie najgorzej na tle innych drużyn. Jednak wszyscy, analitycy i fani, spodziewali się dużo więcej po tak hucznie ogłoszonym składzie graczy. Pozytywnym aspektem ich pozycji było znalezienie się poza trzema zespołami trafiającymi do rozgrywek relegacyjnych. Niestety będąc na siódmym miejscu nie mogli wziąć udziału w meczach barażowych.</p>\n<p>\nWłaściciel organizacji Elements, Jacob Toft-Andersen, w sezonie piątym starał się żeby polepszyć wyniki swojej drużyny. Wiele zmian osobowych wynikało z jego troski, lecz prawdopodobnie w tym okresie było ich zbyt dużo. Na przykład po wiosennym sezonie został wymieniony cały skład, oprócz mid-lanera.  Zawodnicy nie zdążyli się zgrać, w efekcie czego nie poprawiła się ani pozycja ani kondycja zespołu. Ostatecznie nie był zadowolony z osiągnięć Elements, w związku z czym podjął próbę sprzedania miejsca w wiosennym sezonie EU LCS 2016. Nieszczęśliwie dla Jacoba, nie znalazł się żaden chętny. Dlatego zdecydował się podjąć wyzwanie w czołowych europejskich rozgrywkach w 2016 roku. </p>\n","de_DE":"<p>Nachdem Alliance als erstes Team seit Entstehung der LCS Fnatic vom ersten Platz stieß, kam der Namenswechsel zum heutigen Elements. Mit lediglich einem Wechsel der Schützen Position von Erik \"Tabzz\" Van Helvert auf Martin \"Rekkles\" Larsson sollte ein Team entstehen, das fortan die europäische Liga dominieren sollte. Zu den erwünschten Resultaten kam es jedoch nie. Seit der Entstehung Anfang 2015 wurden nur mittelmäßige Erfolge erzielt. </p>\n<p><h2>Änderung sind nötig</p></h2>\n<p>Schon zum Spring Split 2015 nahm das Team um den damaligen Captain Henrik \"Froggen\" Hansen erste Änderungen vor, nachdem es das Team nicht schaffte, sich vom Mittelfeld im Ranking zu lösen. Ergebnis des Splits: Ein siebter Platz und damit verbunden erste große Spielerwechsel. Es wurden abgesehen von der Mitte und dem Support alle Positionen ausgetauscht, weiterhin mit Froggen als Kernspieler. Zu diesem Zeitpunkt stieß mit Hampus \"promisQ\" Abrahamsson, erstmals ein unbeschriebenes Blatt, zum Team. </p>\n<p>Die Resultate blieben weiterhin nicht zufriedenstellend. So hatte das Team nach einem erneuten siebten Platz im Summer Split keine Chance mehr, sich bei den Playoffs für die Weltmeisterschaft zu qualifizieren. Weitere Änderungen in der Teamaufstellung waren also schon zu erwarten. </p>\n<p><h2>Eine Legende verschwindet</p></h2>\n<p>Das Team hat nun seine bisher größte Änderung erfahren. Mit dem Wechsel von vier Spielern, darunter auch Froggen, ist die neue Stärke nur sehr schwer einzuschätzen. Bisher war eines der großen Probleme, dass das Team die Spiele möglichst in die Länge ziehen musste, um einen Sieg zu erreichen. Die neue Aufstellung sollte nun eine gute Gelegenheit bieten, mit neuen Taktiken in die Kluft der Beschwörer zu ziehen. Mit Patrick \"Nyph\" Funke steht in jedem Fall ein sehr erfahrener Spieler als Coach hinter den Spielern. </p>\n<p>Die sechste Saison wird in jedem Fall eine große Herausforderung werden. Elements wird als einer der Underdogs ins Rennen gehen und sich seinen Platz hart erkämpfen müssen. Die Priorität sollte darauf liegen, sich erst einmal aufeinander einzuspielen und mit gutem Teamwork zu überzeugen. Erst nachdem die Spieler gewisse Konsistenz unter Beweis gestellt haben, würde sich eine weitere Spezialisierung auf die Konkurrenz lohnen. </p>\n<p> Im Sommer wurde das Team nun von dem Bundesliga-Club Schalke 04 übernommen und dadurch größte Aufmerksamkeit erreicht. Wie sich das neue Team schlagen wird, muss man in den nächsten Wochen beobachten.</p>\n<p>Zu hoch gesteckte Ziele haben in der Vergangenheit eher einen gegenteiligen Effekt zum gewünschten Erfolg gebracht. Stattdessen haben die Spieler nun die Chance, bei niedrigen Erwartungen die Zuschauer zu überraschen. </p>\n","es_ES":"<p>Elements es uno de los equipos con más historia dentro de la LCS EU, historia que se remonta hasta CLG.EU en el año 2012. Como Alliance en 2014 consiguieron la victoria en los playoffs de verano de la LCS EU 2014, lo que los coronó como el mejor equipo de Europa por aquel entonces, y un equipo a tener en cuenta en el Campeonato Mundial de ese mismo año. Pero todo se vino abajo cuando fueron eliminados en la fase de grupos al perder con el equipo brasileño KaBuM! e-Sports, algo que todavía queda en la memoria de los aficionados.</p>\n\n<p>2015 no empezó mejor para el equipo europeo que después de ganar la LCS no pudo pasar del séptimo puesto en el Split de primavera de 2015, algo decepcionante que hizo retumbar los cimientos de la organización. El Split de verano iba a ser otro nuevo comienzo para Elements, pero no pudieron más que repetir la séptima posición. Para esta nueva temporada todo ha cambiado, en la LCS 2016 Elements busca una nueva dirección. ¿Conseguirán reconducir la dinámica negativa de la última temporada?</p>","fr_FR":"<p>Le FC Schalke 04 a une histoire très riche. Ce club sportif allemand a fêté son centenaire en 2004 et est le deuxième plus grand club d’Allemagne. Rien que ça. Plus de 100 000 membres y sont licenciés et le club possède des sections dans les plus grandes disciplines sportives comme le basket-ball, le handball, l’athlétisme, le tennis de Table et évidemment le football. Et depuis le mois de mai 2016, le FC Schalke 04 a mis un pied dans l’e-sport en choisissant d’investir dans une équipe League of Legends, rachetant l’équipe Elements et devenant le second club sportif à acheter une équipe League of Legends après l’équipe turque Beşiktaş au début de l’année 2015.</p> \n\n<p>Seul un joueur a été remplacé lors de la transition : le Français Jérémy « Eika » Valdenaire, au profit du Suédois Hampus « Fox » Myhre. Fox rejoint donc le cinq majeur dont les autres membres sont le Français Etienne « Steve » Michels au top, l’Allemand Berk « Gilius » Demir dans la jungle, le Danois Rasmus « MrRallez » Skinneholm en botlane et le Suédois Hampus « sprattel » Abrahamsson en support.</p>  \n\n<p>Ces joueurs vont pouvoir profiter d’un encadrement expérimenté qui devrait les mettre dans les meilleures conditions pour préparer leur saison. Le centre de formation de l’équipe de football a formé certains des meilleurs joueurs du monde, le club sait donc comment donner les armes à ses joueurs pour exprimer leur plein potentiel. L’avenir nous dira si le même destin attend la section League of Legends !</p> \n"},"foreignIds":{"drupalId":"3659"},"players":[233,490,824,1337,1376,1377,1752,2013],"starters":[233,824,1337,1376,1377],"subs":[490,1752,2013]},{"id":97,"slug":"splyce","name":"Splyce","guid":"be6e1a6a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/splyce-gyo3tr9y.png","acronym":"SPY","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-08-08T09:39:46.000Z","bios":{"en_US":"<p>Splyce started from the bottom. Now they’re here, one of the best teams in Europe. Formerly Team Dignitas EU, Splyce made their debut in the 2016 EU LCS Spring Split and immediately struggled. The young team banded together in the Summer Promotion Tournament, and the very next split took second place in the regular season and earned a spot a Worlds though the Regional Qualifiers.</p>\n\n<p>Like their rivals G2, Splyce played poorly at Worlds. But with the same five members returning for 2017, they’re poised to once again dominate the EU LCS. If there’s any team in the league that knows how to deal with failure and come out on top, it’s Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","pl_PL":"<p>Splyce było na wiosnę 2016 drugą, obok G2 Esports, drużyną, dla której udział w tamtym Splicie był debiutem w LCS-owej stawce. W pełni duński skład awans do elitarnych rozgrywek wywalczył, zwyciężając w letnim splicie europejskiego Challenger Series (EU CS) 2015.</p>\n<p>Historia ekipy jest dość skromna i jej początki sięgają wiosennej edycji rywalizacji w EU CS w 2015 roku. Wtedy to drużynę SK Gaming Prime przejął Team Dignitas EU. W składzie doszło do trzech zmian, które w efekcie sprawiły, że DIG EU od tej pory stało się zespołem jednonarodowościowym – złożonym wyłącznie z Duńczyków. Obiecujący skład miał trudne początki i na wiosnę ledwo co zakwalifikował się do play-offów Challenger Series, w których, co ciekawe, ostatecznie nie wystąpił. Wszystkiemu winne były ograniczenia wiekowe w LCS, których nie spełniała wtedy dwójka zawodników formacji – Martin „Wunderwear” Hansen oraz Chres „Sencux”Laursen. Wobec tego ówczesne DIG EU zmuszone było do gry o uzyskanie ponownej kwalifikacji do EU CS na split letni.</p>\n<p>Od tej pory wszystko szło już jednak znacznie sprawniej i zespół bez problemu znów dostał się do Challenger Series, by następnie bez problemu zakwalifikować się do play-offów i tam pokonać wszystkich rywali, zapewniając sobie awans do LCS na wiosenną edycję w 2016 roku. Warto jednak zauważyć, że triumf ex-Dignitas EU nie należał do przekonujących. Niemniej ekipa ta jest ciekawą mieszanką talentu i młodości (Sencux, Wunderwear) z rutyną i doświadczeniem (Nicolai „Nisbeth” Nisbeth, Jonas „Trashy” Andersen). Ponadto atutem formacji jest oczywiście możliwość komunikacji w rodzimym języku.</p>\n<p>Ostatecznie beniaminek zmagań przystępuje do rywalizacji w zmienionych barwach. Zawodnicy zamienili trykoty Team Dignitas EU na koszulki nowej organizacji - Follow eSports, które ostatecznie przekształciło się w Splyce. W międzyczasie, przed startem wiosennego splitu EU LCS 2016, ekipa nie uniknęła również zmian w składzie, a konkretnie jednej. Dotychczasowego dżunglera, Dennisa \"Obviousa\" Sørensena, który opuścił formację 29 października 2015 roku, dwa tygodnie później zastąpił wracający z Ameryki Jonas \"Trashy\" Andersen. Warto dodać, że Splyce było wtedy dopiero siódmym zespołem w historii LCS złożonym wyłącznie z graczy jednej narodowości i drugim w pełni duńskim.</p>\n<p>Wiosenny split nie spełnił jednak oczekiwań kibiców Splyce ani samej formacji. Drużyna od samego początku zmagań utknęła na dole tabeli i ostatecznie zajęła niskie, ósme miejsce, które sprawiło, że Splyce zmuszone zostało do walki w turnieju barażowym o utrzymanie w stawce. Tam, chociaż nie bez problemów, zespół na szczęście pokonał jednak GIANTS Gaming wynikiem 3-2 i zagwarantował sobie miejsce w EU LCS na letnim split. W składzie drużyny doszło tylko do jednej zmiany – zawodzącego wspierającego Nicolaia „Nisbetha” Nisbetha zastąpił młody i utalentowany słoweński support Mihael „Mikyx” Mehle. Splyce przystąpiło do rywalizacji z nadziejami na awans do play-offów, chociaż eksperci po raz kolejni nie dawali bardzo młodej drużynie dużych szans na osiągnięcie takiego wyniku.</p>\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>\n","es_ES":"<p>Splyce (anteriormente llamado Team Dignitas EU) hicieron su debut en la LCS EU durante el split  de primavera de 2016, y tuvieron un duro comienzo para adaptarse al nivel de la LCS. Como resultado, el equipo tuvo que luchar en el Summer Promotion Tournament, en el que superaron a Giants Gaming en un apasionante enfrentamiento al mejor de cinco y se aseguraron llegar a la LCS EU. Splyce tuvo un exitoso split de verano que le posicionaría en segundo lugar, nada que ver con el de primavera, en el que casi quedaron eliminados. Ahora que han superado los baches de la competición europea, el joven equipo rebosa confianza de camino al Campeonato Mundial 2016. Es hora de demostrarle al mundo que el split de verano no fue suerte sino que Splyce ha llegado para quedarse.</p>\n<p>Entrenador: Hans Christian \"Liq\" Duerr</p>","de_DE":"<p>Splyce fing ganz unten an. Doch heute gehören sie zu den besten Mannschaften Europas. Splyce, ehemals Team Dignitas EU, gab sein Debüt beim Frühjahrs-Split der EU LCS 2016 und hatte sofort Probleme. Doch die junge Mannschaft fand im Sommer-Aufstiegsturnier zueinander, woraufhin sie bereits den nächsten Split auf Platz Zwei beendeten und sich in der regionalen Qualifikationsrunde für die Weltmeisterschaft qualifizieren konnten.</p>\n\n<p>Genau wie ihre Rivalen G2 spielte auch Splyce bei der Weltmeisterschaft schwach. Aber da sich ihre Aufstellung für die Saison 2017 nicht geändert hat, sind sie bereit, die EU LCS erneut zu dominieren. Wenn es in der Liga eine Mannschaft gibt, die weiß, wie man mit Fehlschlägen umgeht und sich wieder an die Spitze kämpft, dann ist das Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","fr_FR":"<p>Nouveaux arrivants en LCS EU, Splyce a racheté cette année la place et l'effectif de Dignitas EU après la qualification de ces derniers en LCS.</p>\n\n<p>L'équipe a d'abord été connue sous le nom de Follow Esports, un site qui se présente comme le « programme télé de l'esport », mais tant le site que l'équipe LCS ont rapidement changé de nom au profit de l'actuel. Peu après l'achat le cofondateur du site a déclaré être très satisfait de son investissement dans League of Legends puisque cela les plaçait dans une « ligue aussi excitante que professionnelle, que ce soit au niveau de l'organisation, des joueurs ou des fans ». Reste à voir quelle place Splyce va occuper dans ces LCS auxquels l'organisation est aussi heureuse d'être associée. Pour la jeune entreprise basée aux Etats-Unis, elle n'a été créée qu'en avril 2015, les LCS sont à coup sur la garantie d'une exposition médiatique plus importante mais qu'en est-il de leurs ambitions sportives ? </p>\n\n<p>L'équipe a un avantage certain, l'absence de la barrière de la langue. En effet l'équipe est entièrement composée de joueurs danois, ce qui facilitera forcément la communication en jeu. Malgré tout, avec un effectif jeune et prometteur mais qui manque cruellement d'expérience, Splyce a un besoin criant d'un encadrement de bonne qualité pour concurrencer des adversaires qui ne leur feront pas de cadeau. L'entreprise semble néanmoins avoir bien cerné ce besoin puisqu'ils ont recruté Jakob « YamatoCannon » Mebdi, ancien entraîneur de Roccat, comme entraîneur et Chris Ehrenreich, ancien entraîneur de CLG en LCS NA, pour l'assister dans la mise en place d'un environnement de travail performant. </p>\n\n<p>Pas sur que cela suffise pour tutoyer les sommets des LCS dès le printemps 2016, mais les joueurs, confrontés au plus haut niveau européen, devraient à tout le moins progresser rapidement tant au niveau individuel qu'en tant qu'équipe. C'est tout le mal qu'on leur souhaite !</p>\n\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>","es_AR":"<p>Splyce (antiguamente llamado Team Dignitas EU) hizo su debut en la LCS EU durante el torneo de clausura del 2016 y pudo experimentar la agresividad del alto nivel de juego que allí se presenta. De esta forma, el equipo tuvo que luchar para salir del torneo de promoción de verano, en el que vencieron a Giants Gaming en un emocionante combate al mejor de cinco para conseguir un pase a la LCS EU. Splyce tuvo un exitoso torneo de clausura en el que consiguieron un segundo lugar, algo totalmente inesperado luego del descenso que sufrieron en primavera. Luego de haber arrasado en la competencia del Guantelete europeo, el joven equipo rebosa de confianza para encarar el Campeonato Mundial 2016. Es hora de mostrarle al mundo que el torneo de clausura no fue una casualidad, y que Splyce ha llegado para quedarse.</p>\n\n<p><strong>Entrenador: Jakob \"YamatoCannon\" Mebdi</strong></p>","pt_BR":"A equipe da Splyce (antiga Team Dignitas EU) fez sua estreia na EU LCS durante a Etapa de Primavera 2016 e teve um choque de realidade com o calibre de jogo da LCS. Como resultado, a equipe teve que passar pelo Torneio de Promoção de Verão, onde conseguiram derrotar a Giants Gaming em uma emocionante melhor de 5, ganhando seus ingressos de volta para a EU LCS. A Splyce então teve uma explosão de sucesso na Etapa de Verão, conseguindo o segundo lugar - um sucesso e tanto depois de sua quase relegação na Etapa de Primavera. Agora que a equipe despachou a competição no cenário europeu, todos estão transbordando de confiança para o Campeonato Mundial 2016. Está na hora de mostrar para o mundo que a Etapa de Verão não foi mera sorte e que a Splyce chegou para ficar.","en_GB":""},"foreignIds":{"drupalId":"4032"},"players":[232,336,387,588,663,954,1771],"starters":[232,336,387,588,954],"subs":[663,1771]}],"players":[{"id":232,"slug":"trashy","name":"Trashy","firstName":"Jonas ","lastName":"Andersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trashy-epw5lsut.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:40:20.000Z","bios":{"en_US":"<p>Jonas “Trashy” Anderson spent years jumping between teams until everything finally clicked with Splyce. A jungler with a wealth of experience, Trashy even spent time in the NA LCS for Enemy eSports. When he found a home on Splyce, it wasn’t long before he became a top jungler in the EU LCS.</p>\n\n<p>It will take more than a disappointing performance at the 2016 World Championship to stop this jungler from improving. At the helm of what is still a young team, Trashy is poised to take big leaps forward with Splyce in 2017. And if he’s allowed to have his way in the jungler, he’ll be taking the rest of the EU LCS out with the rest of the garbage.</p>","de_DE":"<p>Jonas „Trashy“ Anderson hat immer wieder die Mannschaft gewechselt, bis er endlich bei Splyce landete. Trashy ist ein Jungler mit viel Erfahrung, der eine Zeit lang sogar bei Enemy eSports in der NA LCS spielte. Nachdem er bei Splyce ein neues Zuhause gefunden hatte, dauerte es nicht lange, bis er zu einem der besten Jungler der EU LCS wurde.\n\nEs braucht mehr als eine enttäuschende Vorstellung bei der Weltmeisterschaft 2016, um diesen Jungler daran zu hindern, immer besser zu werden. Trashy ist am Ruder dieser jungen Mannschaft und bereit, mit Splyce 2017 große Sprünge zu machen. Und wenn er im Dschungel ungestört tun und lassen kann, was er will, wird er die anderen Mannschaften in der EU LCS zusammen mit dem Müll entsorgen.</p>","fr_FR":"<p>Jonas « Trashy » Andersen est à la fois le petit nouveau de chez Splyce et l'un des deux seuls de son équipe à avoir déjà fait l'expérience des LCS avant cette année. </p>\n\n<p>Le jungler danois a en effet pris part au segment de printemps des LCS NA en 2015 au sein de l'équipe Enemy eSports. Comme son compatriote Lucas « Santorin » Tao Kilmer Larsen avant lui, Trashy a en effet pris le risque de traverser l'atlantique pour y rejoindre une équipe semi-professionnelle et tenter de devenir joueur professionnel en Amérique du Nord. Après une qualification relativement aisée pour les Challenger Series, son équipe et lui ont entrepris une domination sans partage sur l'antichambre des LCS. Ils n'ont perdu en tout et pour tout qu'un seul match de la saison régulière, face à Team Fusion, eux-même favoris pour la qualification en LCS ! C'est logiquement que Enemy a ensuite dominé les play-off pour empocher la qualification automatique pour le segment d'été des LCS NA. </p>\n\n<p>Malheureusement pour Trashy et les siens, la suite de l'histoire n'a pas été aussi rose, loin de là. Pas suffisamment préparée au niveau d'exigence et de jeu nécessaire au plus haut niveau nord-américain, l'équipe a enchaîné défaite sur défaite. Incapables de hausser leur niveau de jeu, les Enemy ont terminé leur saison à une piteuse 9ème place. Pire, ils ont bu le calice jusqu'à la lie en se faisant éliminer 3 victoires à rien par Team Coast lors du tounoi de relégation. </p>\n\n<p>Une expérience difficile à vivre pour un joueur qui a bien cru que sa carrière allait se terminer là, alors même qu'il était sans doute le meilleur joueur de son ancienne équipe. Il avoue lui même avoir été « surpris » quand Splyce a pris contact avec lui malgré sa récente élimination des LCS NA. Un contact bienheureux pour le joueur donc, un contact remotivant aussi. Trashy a repris espoir et pense aujourd'hui que « jouer avec quatre autres danois est la bonne décision » pour sa carrière et que Splyce « va surprendre beaucoup de monde » en 2016, comme il l'a affirmé au DailyDot. </p>\n\n<p>Quoiqu'il en soit, avec des joueurs prometteurs à ses côtés, Trashy a à présent toutes les armes en main pour réussir. </p>","es_ES":"<p>Jonas ''Trashy'' Andersen llega desde Dinamarca cargado de experiencia. Jugó en equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, además de participar en la LCS NA con Enemy eSports. Pero Trashy no tardaría en echar de menos su casa, así que volvió a la LCS EU al final de 2015 y se unió a Splyce.</p>\n\n<p>Tras probar por primera vez la alta esfera competitiva europea en el split de primavera de la LCS EU 2016, Trashy subió el listón del split y se convirtió en uno de los mejores junglas de Europa. Sus mejoras ayudaron a que Splyce obtuviese el segundo puesto en la temporada regular, y una gran clasificación en el Clasificatorio Regional de la LCS EU. Trashy lidera un equipo que está dispuesto a llegar al cielo. ¿Conseguirán los equipos de alto nivel del Campeonato Mundial 2016 traer a Trashy y a Splyce de vuelta a la tierra, o el joven equipo nos sorprenderá a todos? Pronto lo descubriremos.</p>","pl_PL":"<p>Trashy jest najnowszym nabytkiem formacji (dołączył do drużyny 16 listopada 2015 roku) I jednocześnie najbardziej doświadczonym graczem w zespole. Duński dżungler na profesjonalnej scenie znajduje się już od 2012 roku i w tym trakcie swojej kariery miał okazję występować w składach takich drużyn jak Tricked eSports, Reason Gaming, Cloud 9 Eclipse czy SK Gaming Prime. W tym czasie Trashy występował głównie w Challenger Series, ale próby dostania do EU LCS kończyły się porażką zarówno w przypadku Reason Gaming, jak i SK Gaming Prime. Duńczykowi udało się awansować do najwyższej klasy rozgrywkowej (letni split NA LCS 2015) dopiero z amerykańskim Enemy eSports, choć formacja długa wahała się czy zatrudnić duńskiego leśnika. Co ciekawe, ostatecznie zarząd przekonała deklaracja Trashy’ego, że.. zapłaci za lot z własnej kieszeni, tylko po to, by móc wziąć udział w testach, które organizował zespół. </p>\n<p>\nNiestety amerykańska przygoda Duńczyka zakończyła się na dwóch splitach występów, w tym zaledwie jednym spędzonym w NA LCS i jednym w NA Challenger Series. Jednak w tym czasie duński zawodnik dał się poznać jako jeden z najmocniejszych punktów NME – w większości klasyfikacji indywidualnych znalazł się w pierwszej piątce wśród dżunglerów tamtejszych rozgrywek, a jeśli chodzi o procentowy udział w zabójstwach oraz najmniejszą ilość śmierci udało mu się nawet wskoczyć na podium. Teraz powrócił do Europy skuszony ofertą Splyce i w sumie ciężko się dziwić, że wybór FE padł właśnie na niego. Zespół szukający duńskiego dżunglera nie mógł bowiem trafić lepiej (no może z wyjątkiem Dennisa \"Svenskerena\" Johnsena, który miał jednak inne plany, bowiem dołączył do Teamu SoloMid). </p>\n<p>\nTrashy w trakcie swojej kariery dał się poznać jako znakomity gracz Elise oraz Rengara, choć w letniej edycji NA LCS 2015 najczęściej wybierał Rek’sai oraz Gragasa ze względu na siłę tych postaci. Ciekawostką może być fakt, że Thrashy bardzo dobrze zna się z innym duńskim dżunglerem, który występował w Ameryce – Lucasem \"Santorinem\" Tao Kilmer Larsenem.</p>\n<p>\n„Jestem bardzo zadowolony z dołączenia do byłego DIG EU, teraz Follow eSports… Byłem nieco zaskoczony, kiedy drużyna ta skontaktowała się ze mną po fiasku meczów barażowych w barwach mojego byłego zespołu, NME. Jednak nie mam wątpliwości, że dołączenie do tych czterech duńskich facetów jest właściwą decyzją.” – powiedział Trashy w wywiadzie dla portalu Daily.dot.</p>\n<p>\nZadowolenie Trashy’ego nie może dziwić. Wszak przyznał wcześniej w żartach, że uważa Duńczyków za… Koreańczyków Europy. A tutaj ma ich pod dostatkiem!\n</p>","es_AR":"<p>Oriundo de Dinamarca, Jonas \"Trashy\" Anderson tiene una vasta experiencia. Ha jugado para equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, sin mencionar su paso por la LCS NA con Enemy eSports. Sin embargo, no pasó mucho para que Trashy comience a echar de menos su hogar. Regresó a la LCS EU a finales del 2015 para unirse a la nueva formación de Splyce.</p>\n\n<p>Después de tener su primera experiencia en la competencia europea de primer nivel en el torneo de apertura de la LCS EU 2016, Trashy se esforzó aún más en el torneo de clausura, hasta llegar a ser uno de los mejores jungleros de Europa. Su mejora sirvió para que Splyce llegara al segundo lugar en la temporada regular y tuviera una excelente actuación en la clasificatoria regional de la LCS EU. Trashy dirige el timón de un equipo que va derecho a las nubes. ¿Lograrán los equipos de primer nivel del Campeonato Mundial 2016 enviar a Trashy y Splyce de regreso a la tierra? ¿O acaso el joven equipo conseguirá sorprendernos a todos? Estamos a punto de descubrirlo.</p>"},"foreignIds":{"drupalId":"1409","TRLH4":"200000207","TRLH3":"200000104"},"socialNetworks":{"twitch":"twitch.tv/trashylol","facebook":"facebook.com/Trashylol","twitter":"twitter.com/SPY_Trashy"},"champions":[],"liveGameTeam":97},{"id":233,"slug":"smittyj","name":"Smittyj","firstName":"Lennart ","lastName":"Warkus","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smittyj-8owo56ml.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2017-03-28T15:13:21.000Z","bios":{"en_US":"<p>\nLennart \"SmittyJ\" Warkus isn't afraid to hop, jump, dive, or charge his way into the enemy team. SmittyJ's aggression often has a purpose though -- if he causes enough chaos in the enemy ranks, his teammates can cut through them like a knife through warm butter.\nUnfortunately for SmittyJ, his dives often leave him up the proverbial creek without a paddle. Or, maybe more accurately, stranded in the Baron pit without a dash to escape over the wall. \n</p>\n<p>\nAfter a short stint in North America with Team Dignitas, Smittyj headed home to Europe to compete with Giants Gaming. They hope to turn his aggression into something special, but his aggression may be punished heading into his first full EU LCS Split.\n</p>","fr_FR":"<p>Lennart « Smittyj » Warkus est le nouveau top laner de Dignitas, tout droit débarqué des Challenger series... européennes ! Comme de nombreux joueurs professionnels et semi-professionnels ces dernières années, Smittyj a traversé l'Atlantique pour rejoindre une équipe nord-américaine.</p>\n\n<p>Auparavant, ce joueur allemand de 19 ans a passé pas loin de deux ans à arpenter la deuxième division professionnelle dans l'espoir de percer au plus haut niveau. En saison 4, avec SK Prime, le jeune joueur est parvenu à se qualifier en deuxième position pour le tournoi de promotion/relégation, mais a dû s'avouer vaincu face à des Gambit Gaming largement supérieurs. Même scénario lors du segment de printemps de la saison 5, cette fois en tant que top laner de Gamers 2. Pire, lors de cette saison des Challenger series, Smittyj et ses camarades n'ont même pas réussi à se qualifier pour le tournoi de promotion/relégation, ratant la 3e place qualificative de peu, lors d'une défaite 2 victoires à 1 face à Reason Gaming.</p>\n\n<p>Qu'à cela ne tienne, l'Allemand ne s'est pas découragé et a eu de nouveau l'occasion de toucher le graal à l'issue de la saison estivale des Challenger series de la saison 5. Une fois de plus, son équipe et lui ont perdu en demi-finale des play-offs face à Dignitas, par la suite qualifiée aux LCS EU, mais ils ont cette fois su se reprendre à temps pour arracher la troisième place qualificative des mains de Denial Esports. Au niveau individuel, Smittyj en a profité pour remporter sa voie par deux fois face à Mike « Wickd » Petersen, ancienne gloire de League of Legends. Tout un symbole.\nAutre symbole, la victoire de Gamers 2 et SmittyJ en tournoi de relégation face à l'une des plus anciennes organisations européennes du jeu, SK Gaming, vaincus 3-2 et boutés hors des LCS par le jeune top laner et ses coéquipiers.</p>\n\n<p>Sa qualification au plus haut niveau enfin en poche, Smittyj aurait pu tranquillement se préparer à découvrir les LCS EU, mais il a préféré repartir à nouveau à l'aventure, cette fois sur le serveur nord-américain au sein de l'équipe Dignitas, ce qui implique forcément beaucoup plus de pression de la part des fans et du grand public. Changement de rythme assez brutal pour le joueur qui, avec son manque d'expérience en LCS, peine à obtenir des résultats suffisants dans l'écurie Dignitas. Peu à peu, son style de jeu se confirme et bientôt, SmittyJ devient un joueur agressif, n'ayant pas peur de s'engouffrer dans des situations hasardeuses sur la voie du haut.</p>\n\n<p>Après une année en dents de scie en Amérique, le joueur revient en Europe en tant que toplaner titulaire pour les Giants Gaming. SmittyJ est prêt à relever le défi une nouvelle fois, avec une place en LCS Europe qu'il a longuement attendu.</p>\n","pl_PL":"<p>Lennart \"Smittyj\" Warkus  jest członkiem profesjonalnych drużyn League of Legends od początku czwartego sezonu. Zaczynał w lutym 2014 roku, w mało znanej drużynie COREPLAY, lecz już po miesiącu trafił do SK Gaming Prime. Pod skrzydłami tej organizacji nabrał doświadczenia na esportowej scenie. Jednak po połowie roku stwierdził, że tam nie odniesie sukcesu, więc opuścił tą drużynę i szukał szczęścia gdzie indziej. Ostatecznie, w lutym 2015 roku, dołączył do Gamers2, później przemianowanych na G2 Esports. Dopiero w tym zespole \"Smittyj\" miał okazję się zrealizować, biorąc udział w Challenger Series. W tych rozgrywkach pokazał jak umiejętnym jest zawodnikiem, kończąc na szczycie tabeli z wynikiem 8:2. Równie dobrze poszło mu w meczach barażowych, aż w końcu stanął przeciwko weteranom EU LCS – SK Gaming.</p>\n<p>\nPrzed grą z SK Gaming o wejście do EU LCS \"Smittyj\" był bardzo pewny siebie i swoich umiejętności. W nagraniu internetowym G2 Esports „Road to LCS” oświadczył, że pokona junglera przeciwników z łatwością. Co prawda nie była to dziecinna igraszka, jak zapowiadał, ale i tak bardzo doświadczony \"fredy122\" został przez niego znokautowany. Dzięki wygranej 3:2 z SK Gaming zakwalifikował się wraz z drużyną do wiosennego sezonu 2016 EU LCS, co było jego największym osiągnięciem w karierze gracza.</p>\n<p>\nNie dane mu jednak było wystąpić w Europie, gdyż jego umiejętności zaimponowały również analitykom zza oceanu. \"Smittyj\" został przez nich nazwany „niedocenianym, młodym talentem, który może wkrótce rozkwitnąć”. W listopadzie 2015 roku dołączył do Team Dignitas, jednej z najstarszych i niezatapialnych drużyn w League of Legends. Wiązało się to oczywiście z przeprowadzką młodego Niemca do Stanów Zjednoczonych, co przyjął zaskakująco dobrze. Jego debiut w ich szeregach miał miejsce na top-lanie w wiosennym sezonie 2016 NA LCS. </p>\n<p>\nZ wszystkich bohaterów najbardziej przepada za Riven, aczkolwiek równie dobrze gra innym postaciami na top-lanie. Wszechstronność jest zaletą Lennarta - świetnie sobie radzi zarówno asasynami jak i obrońcami, bądź molochami. Opierając się na swoich umiejętnościach udało mu się dostać do Kręgu Pretendenta w Europie. Oprócz uniwersalności w League of Legends wyróżnia go wrażliwość na ludzką krzywdę. Aktywnie bierze udział w streamowaniu na rzecz dzieci współpracując z organizacjami charytatywnymi. </p>\n","de_DE":"<p>Der Deutsche Lennart \"SmittyJ\" Warkus startete ursprünglich mit G2 im Jahr 2015 durch, spielte im letzten Split für Team Dignitas und ist nun Top-Laner für Giants! Gaming. Er konnte viel Erfahrung in den letzten Monaten sammeln und ist kein Neuling mehr in der Szene. SmittyJ ist bekannt für sein Selbstvertrauen, denn laut ihm ist er der beste Top-Laner den es gibt. Im ist keine Herausforderung zu groß, und die nächste Aufgabe ist es, die Giants wieder ins Spiel zu bringen. Mit seinen Lieblingschampions Maokai und Fiora hat SmittyJ eine Killbeteiligung von über 75% und ist oftmals die tragende Kraft in den Teamkämpfen. Er bezeichnet sich selber als guten Shotcaller und erweitert stets seine Auswahl an Champions – ihm sind keine Grenzen gesetzt. </p>\n\n<p>“Was ich für das Team mitbringe? Ich kann ziemlich gut shotcallen, außerdem bin ich einfach gut, also..das bringe ich mit.” - Lennart \"SmittyJ\" Warkus</p>\n"},"foreignIds":{"drupalId":"2902","TRLH1":"1001220074","TRLH2":"1001160124","TRLH3":"200000230","TRLH4":"200000082","FRA1TMNT2":"25044","ESPORTSTMNT02":"200001004"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":336,"slug":"sencux","name":"Sencux","firstName":"Chres","lastName":"Laursen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sencux-efit8ngk.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:50.000Z","updatedAt":"2017-06-09T10:40:39.000Z","bios":{"en_US":"<p>Chres “Sencux” Larsen has the makings of Europe’s next mid lane star. He made his way to Splyce after honing his skills in the Challenger scene. Sencux showed flashes of brilliance early in the 2016 EU LCS Spring Split, and in the Summer took the next step to rival the best mid laners in the league.</p>\n\n<p>At the 2016 World Championship, Sencux couldn’t quite keep up with the best mid laners in the world. But as he returns to the EU LCS with the rest of Splyce for 2017, his time on the international stage should prove to be an invaluable experience. If he can keep up his blazing pace of improvement, it won’t be long at all before he gets another shot at the world’s finest.</p>","de_DE":"<p>Chres „Sencux“ Larsen hat das Zeug zu Europas nächstem großen Star auf der mittleren Lane. Er kam zu Splyce, nachdem er sein Können in der Herausforderer-Szene perfektioniert hatte. Sencux ließ sein Können bereits zu Beginn des Frühjahrs-Splits der EU LCS 2016 aufblitzen und machte im Sommer den nächsten Schritt, um es mit den besten Mid-Lanern der Liga aufzunehmen.\n\nBei der Weltmeisterschaft 2016 konnte Sencux jedoch nicht ganz mit den besten Mid-Lanern der Welt mithalten. Aber wenn er mit dem Rest von Splyce 2017 in die EU LCS zurückkehrt, sollten sich seine Erfahrungen auf der internationalen Bühne bezahlt machen. Wenn er sich weiterhin steigern kann, wir es nicht lange dauern, bis er es wieder mit den Besten der Welt zu tun bekommt.</p>","fr_FR":"<p>Chres « Sencux » Laursen a tout juste 17 ans, joue à League of Legends depuis 4 ans et gravite dans le milieu compétitif depuis 2014. Après une première expérience chez Reason Gaming, il s'apprête à présent à découvrir les LCS accompagné d’une réputation flatteuse. </p>\n\n<p>La plupart des observateurs considèrent que le danois est, avec Luka « PerkZ » Perković de chez G2 Esports, le porte-drapeau d'une nouvelle génération de midlaners européens. Un héritage pas forcément facile à porter ! Sous les couleurs de Splyce, le joueur va en tout cas devoir le défendre face à ceux qui ont porté ce titre avant lui, à l'instar de Fabian « Febiven » Diepstraten. Y est-il prêt ? Pour être honnête et au vu de ce qu'il a montré en Challenger Series, Sencux est sans doute encore un peu tendre. Contrairement à Febiven l'an dernier, il est peu probable que le midlaner de Splyce gagne systématiquement la voie du milieu en 1v1 face à ses adversaires plus expérimentés. Sa prise de décision, particulièrement, est parfois douteuse. Malgré tout le jeune midlaner n'est pas en dessous du niveau attendu en LCS, bien au contraire. Son niveau individuel est même certainement déjà supérieur à celui de certains joueurs LCS. Il lui manque juste quelques ajustements à faire pour atteindre les sommets, mais il a à coup sur le talent nécessaire pour y parvenir. </p>\n\n<p>Il va pouvoir s'appuyer pour cela sur son style de jeu, tout en contrôle. Sur sa confiance en son jeu aussi, lui qui déclarait avant même le segment d'été des Challenger Series : « si Febiven peut passer de challenger à l'un des meilleurs midlaners, pourquoi est-ce que moi je ne pourrais pas faire de même ? » Comme dirait l'autre, y a plus qu'à !</p>","es_ES":"<p>Chres ''Sencux'' Laursen es uno de los jugadores titulares más jóvenes de la LCS EU. AspiranteTras jugar en varios equipos aspirantes diferentes, Sencux llegó a Splyce (anteriormente llamado Team Dignitas EU) y logró hacerse con un puesto en la LCS EU. Su rol en la calle central consiste fundamentalmente en debilitar constantemente a sus oponentes para controlar las batallas de equipo y los objetivos del mapa.</p>\n\n<p>Tras demostrar unas jugadas brillantes en el split de primavera de la LCS EU 2016 (como el asesinato cuádruple con LeBlanc), los espectadores y analistas se preguntaban si tiene lo que hace falta para convertirse la próxima estrella europea de la calle central. Sencux calló las voces de los escépticos y consiguió obtener con Splyce el segundo puesto en el split de verano de la LCS EU 2016 y, por consiguiente, superar la escena europea y asegurarse un puesto en el Mundial. Aunque Sencux sea capaz de lanzar hechizos a los mejores mid de Europa, la escena internacional es completamente diferente. La mayor prueba de Sencux está aún por llegar, y será una batalla a vida o muerte en la Grieta contra los mejores jugadores de League of Legends.</p>","pl_PL":"<p>Sencux to niekwestionowana gwiazda zespołu I jego najważniejszy zawodnik. To właśnie Chres dzięki swoim niesamowitym umiejętnościom i fantastycznym zagraniom najczęściej prowadzi zespół do zwycięstw. Warto jednak zauważyć, że w momencie startu wiosennego splitu EU LCS 2016 Sencux to będzie nadal bardzo młody, 17-letni zawodnik (jest ledwie pół miesiąca starszy od Wunderweara). Ogromnym problemem Duńczyka, niejako związanym z wiekiem, jest gra pod presją, której zawodnik nie zawsze potrafi sprostać. W tym aspekcie od razu nasuwa się porównanie z holenderskim mid-lanerem, Fabianem \"Febivenem\" Diepstratenem sprzed awansu do LCS z drużyną H2k. </p>\n<p>\nJednocześnie Duńczyk ma już całkiem spore doświadczenie, bowiem występuje na scenie od stycznia 2014 roku, co sprawia, że zaczynał jako zaledwie… piętnastolatek. Jego pierwszym przystankiem na drodze do wielkiej kariery był zespół Reason Gaming, gdzie spotkał Jonasa „Trashy’ego” Andersena. Później, wraz z Kasperem \"Kobbe’m\" Kobberupem oraz Martinem „Wunderwearem” Hansenem występował w 4everzenzyg oraz SK Gaming Prime-Dignitas EU, które w końcu przekształciło się w Follow eSports, a następnie w Splyce. Co ciekawe, Nicolai „Nisbeth” Nisbeth jest jedynym zawodnikiem, z którym Chres, grając w SK-DIG-FE, spotkał się po raz pierwszy. </p>\n<p>\nDuńczyk posiada bardzo szeroki champion pool, ale z pewnością największą uwagę należy zwrócić na jego Azira, Viktora oraz Twisted Fate’a, grę którymi opanował do perfekcji. Swego czasu znany był nawet jako tzw. one-trick-pony Viktora, ale gra w Challenger Series 2015 sprawiła, że obecnie większość rywali najbardziej obawia się jego Azira. Sencux powszechnie uważany jest za wielki talent i wielu znawców sceny zastanawia się nad tym jak młody zawodnik poradzi sobie w walce przeciwko najlepszym mid-lanerom na Starym Kontynencie. Jest to bardzo interesujący problem, bo niestety nawet w ostatnim, udanym dla ex-Dignitas EU splicie dało się zauważyć, że Sencuxowi obok znakomitych gier zdarzają się spotkania bardzo przeciętne i takie wahania formy mają ogromny wpływ na postawę całej drużyny, której duński mid-laner jest ważnym punktem.</p>\n<p>\n„Myślę, że Sencux jest bardzo utalentowany mechanicznie. Gra bardzo dobrze, ale ma tendencję do tiltowania dość szybko, jeśli coś nie idzie po jego myśli.” – powiedział o Sencuxie przed finałem letniego splitu EU CS 2015 jego przeciwnik, Julian \"Xioh\" Dumler (mid-laner drużyny mousesports).</p>\n<p>\nCiekawy jest fakt, że nick gracza początkowo miał brzmieć „Sencu”, ale ten pseudonim był już zajęty w momencie, w którym Duńczyk zakładał swoje konto. Wobec tego najprostszym rozwiązaniem było dodanie „x” do ksywki i właśnie tak powstał obecny nick Sencuxa.\n</p>","es_AR":"<p>Chres \"Sencux\" Laursen es uno de los jugadores más jóvenes de la LCS EU. Después de jugar en varios equipos retadores, Sencux logró llegar a Splyce (anteriormente llamado Team Dignitas EU) y se ganó un lugar en la LCS EU. Su papel en el carril central se basa mucho en realizar ataques rápidos contra los enemigos para controlar los combates en equipo y lograr los objetivos de mapa.</p>\n\n<p>Después de demostrar momentos de gran inspiración en el torneo de apertura de la LCS EU 2016 (como un asesinato cuádruple con LeBlanc), tanto espectadores como analistas se preguntaron si tendría lo que hace falta para convertirse en la próxima estrella europea del carril central. Sencux cerró la boca de todos los que dudaron de él cuando, junto a Splyce, logró el segundo lugar en el torneo de clausura de la LCS EU 2016, seguido de una victoria en el Guantelete europeo, que le garantizó un lugar en el Mundial. Aunque Sencux es capaz de lanzar hechizos con los mejores centrales de Europa, la historia es completamente diferente a nivel internacional. La prueba más difícil de Sencux está por venir, y necesitará de gran determinación al llegar a la Grieta para estar a la altura de lo mejor de lo mejor que League of Legends tiene para ofrecer.</p>"},"foreignIds":{"drupalId":"1425","TRLH3":"200000105","TRLH4":"200000208"},"socialNetworks":{"twitch":"http://www.twitch.tv/sencux","facebook":"facebook.com/Sencux","twitter":"twitter.com/\tSPY_Sencux"},"champions":[],"liveGameTeam":97},{"id":387,"slug":"wunderwear","name":"Wunder","firstName":"Martin","lastName":"Hansen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wunderwear-fgro7nyg.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-23T01:17:13.000Z","updatedAt":"2017-06-09T10:41:34.000Z","bios":{"en_US":"<p>Martin “Wunder” Hansen  is a consistent top laner -- consistently aggressive. Even when playing tanks like Nautilus and Maokai, Wunder is more than happy to overextend for a kill. That aggressive playstyle got in him trouble in his rookie split, but he adjusted and became one of the best top laners in the EU LCS.</p>\n\n<p>Wunder struggled against the best top laners in the world at the 2016 World Championship. Back on Splyce in 2017, he’ll have the chance to put what he learned into practice during the regular season. It’s not the first time people have doubted Wunder or Splyce, and Wunder would love nothing more than to silence the haters.</p>","de_DE":"<p>Martin „Wunder“ Hansen ist ein verlässlicher Top-Laner – verlässlich aggressiv. Selbst mit Tanks wie Nautilus und Maokai geht Wunder für eine Tötung gerne mal etwas mehr Risiko ein. Dieser aggressive Spielstil bereitete ihm in seinem ersten Split große Probleme, doch er passte sich an und wurde einer der besten Top-Laner in der EU LCS.\n\nBei der Weltmeisterschaft 2016 hatte Wunder Probleme, mit den besten Top-Lanern der Welt mitzuhalten. 2017 hat er mit Splyce die Gelegenheit, sein neu erlangtes Wissen während der regulären Saison in die Praxis umzusetzen. Es ist nicht das erste Mal, dass die Leute an Wunder oder Splyce gezweifelt haben, und Wunder würde nichts lieber tun, als den Kritikern den Wind aus den Segeln zu nehmen.</p>","fr_FR":"<p>Martin « Wunderwear » Hansen a tout juste 17 ans et s'apprête à découvrir les LCS EU en tant que toplaner de Splyce. Il peut en être d'autant plus fier que, comme la majeure partie de son équipe, il y est parvenu à la seule force de son talent, par le biais de la qualification en Challenger Series, puis en LCS.</p>\n\n<p>Après une première expérience en Challenger Series à l'été 2014 au sein de l'équipe danoise 4everzenzyg, déjà en compagnie de Chres « Sencux » Laursen et Kasper « Kobbe » Kobberup, qui s'est soldée par une défaite en demi-finales des Challenger Series, Wunderwear s'est lancé début 2015 dans la conquête d'une place en LCS. Cela est passé par une qualification en Challenger Series avec sa nouvelle équipe, SK Prime, au détriment de l'équipe française Thunderbot Sparta. La qualification en poche l'équipe, rachetée et renommée Dignitas EU entre temps, a terminé à la 4ème place du segment de printemps et... n'a pas pris part aux play-off ! En effet ni Sencux ni Wunderwear n'avaient atteint leurs 17 ans à ce moment. Sure de la force de ses jeunes joueurs, l'équipe a alors préféré faire l'impasse sur les play-off et sur une possible participation au tournoi de promotion et attendre le segment d'été tranquillement. </p>\n\n<p>Wunderwear a bien rendu la confiance qui lui a été ainsi accordée et a été une part importante de la réussite de son équipe lors du segment d'été, terminé avec 8 victoires et seulement 2 défaites. Terminé surtout avec une qualification en LCS après deux victoires étriquées en play-off contre Denial Esports et Mousesports. </p>\n\n<p>A présent le jeune toplaner danois s'apprête à vivre sa première saison au plus haut niveau européen et à réaliser que son parcours de l'an dernier n'a été, in fine, qu'une longue introduction. De ce qu'il a montré l'an dernier, il est encore un peu tendre pour faire face à quelqu'un comme Paul « SoaZ » Boyer mais a largement le potentiel pour combler ses lacunes d'ici à la fin du segment de printemps. A condition, bien sur, de ne pas se relâcher !</p>\n","es_ES":"<p>Martin ''Wunder'' Hansen es constante en la calle superior. Constantemente agresivo. Incluso cuando juega con tanques como Nautilus o Maokai, Wunder está encantado de arriesgarse por un asesinato. Sus jugadas le hicieron conseguir una A/M/A de 5,2 puntos en el split de verano de la Challenger Series europea. Aun así, su estilo de juego agresivo tuvo resultados variados en el primer split de la LCS EU. Con demasiada frecuencia, traspasó el límite entre una agresividad calculada y una jugada demasiado arriesgada.</p>\n\n<p>Aprendió la lección, y en el split de verano de la LCS EU 2016, Wunder y Splyce eran de lo mejor que Europa tenía que ofrecer. El crecimiento era innegable, y Wunder se convirtió en una amenaza que había que aniquilar para evitar que llevase a su equipo directo a la victoria. Puede que Wunder destaque en Europa, pero enfrentarse a jugadores de la calle superior colosales como Smeb, Duke o Looper será un reto a superar. Nadie creía antes en Wunder ni en Splyce, y nada le gustaría más que volver a silenciar a los escépticos.</p>","pl_PL":"<p>Duński, zaledwie 17-letni top-laner jest najmłodszym zawodnikiem w LCS. Dość powiedzieć, że wymagane do udziału w tych rozgrywkach siedemnaście wiosen skończył dopiero w listopadzie 2015 roku. Na profesjonalnej scenie po raz pierwszy usłyszano o nim w czerwcu 2014 roku, kiedy dołączył do 4everzenzyg wraz z… Chresem „Sencuxem” Larsenem i Kasperem „Kobbe’m” Kobberuppem, obecnymi kolegami z drużyny. Jednak dopiero przeniesienie się do SK Gaming Prime (później Team Dignitas EU), gdzie dalej występował razem z Sencuxem, sprawiło, że kariera młodego Duńczyka nabrała rozpędu. Pierwszych występów w Challenger Series, już pod banderą organizacji Dignitas, Wunderwear nie może zaliczyć do udanych. Wielu ekspertów uważało, że był w tym czasie jednym z najsłabszych ogniw zespołu i nie do końca radził sobie z presją, która towarzyszyła zmaganiom na tym poziomie. Niemniej w ciągu dwóch splitów zmagań w EU CS zrobił duży postęp i wielki talent, który od dawna jest mu przypisywany wreszcie zaczął się w pełni ujawniać. A występy przeciwko najlepszym europejskim graczom górnej alei to coś, co z pewnością pomaga jeszcze podnieść już i tak niemałe umiejętności.</p>\n<p>\nJednocześnie Wunderwear był w letnim splicie EU Challenger Series 2015 jednym z najlepszych, o ile nie najlepszym graczem górnej alei w tych rozgrywkach, co udowadniają statystyki – najwięcej asyst, prawie najwięcej zabójstw, najwyższe KDA i prawie najwyższy udział w zabójstwach wśród top-lanerów. Duński gracz górnej alei zyskał pewność w grze i regularność.</p>\n<p>\nCo ciekawe, Wunderwear ma tendencję do grania niekiedy dość nietypowymi postaciami. To właśnie duński top-laner był pierwszym zawodnikiem, który na profesjonalnej, czy też pół-profesjonalnej, scenie zdecydował się na wybór Gankplanka po reworku tego bohatera. Dał się też poznać jako doskonały gracz Tahm Kencha na górnej alei - po rzecznego potwora sięgał kilkukrotnie, nie bojąc się wybrać tego bohatera nawet w najważniejszych spotkaniach. Widzieliśmy w rękach Duńczyka także chociażby Nautilusa czy Karmę. Można więc wnioskować, że Wunderwear jest w stanie porwać za sobą tłumy europejskich kibiców, którzy przecież uwielbiają zawodników grających niestandardowymi postaciami, o czym przekonaliśmy się poprzez ogromny wzrost popularności zespołu Unicorns of Love po barażach o grę w LCS 2015 i IEM-ie w San Jose w tym samym roku.\n</p>","es_AR":"<p>Martin \"Wunderwear\" Hansen es sólido en el carril superior... sólido y agresivo. Incluso jugando con Nautilus y Maokai, a Wunderwear le encanta lograr una cantidad exagerada de asesinatos. Sus locuras le merecieron un KDA de 5.2 puntos en el torneo de clausura de la Challenger Series EU 2015. Aún así, su estilo de juego agresivo tuvo resultados muy variados en su primer torneo de la LCS EU. Casi siempre ha combinado una agresión calculada con un accionar totalmente temerario.</p>\n\n<p>Aprendió su lección, y en el torneo de clausura de la LCS EU 2016, Wunder y Splyce se convirtieron en lo mejor que Europa tenía para ofrecer. Su crecimiento era indiscutible, y Wunder pasó a ser una amenaza que sus rivales debían neutralizar si querían evitar que llevara a su equipo directo hacia la victoria. Puede que Wunder se destaque en Europa, pero jugar contra colosales carriles centrales superiores como Smeb, Duke y Looper será un reto totalmente diferente. Nadie creyó en Wunder y Splyce antes, y este jugador muere por silenciar una vez más la boca de aquellos que dudaron de él.</p>"},"foreignIds":{"drupalId":"2895","TRLH3":"200000103","TRLH4":"200000206"},"socialNetworks":{"twitter":"twitter.com/SPY_WUNDERLOLXD","twitch":"twitch.tv/Wunderwearisfame","facebook":"http://facebook.com/Wunderwearlol"},"champions":[],"liveGameTeam":97},{"id":490,"slug":"steve","name":"Steve","firstName":"Etienne","lastName":"Michels","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/steve-homsdwkp.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-05-20T14:49:17.000Z","updatedAt":"2017-03-26T09:35:58.000Z","bios":{"en_US":"<p>\nEtienne “Steve” Michels launched his career with ROCCAT during the 2015 EU LCS Summer Preseason, replacing Overpow as their starting top laner. Steve brought several years of amateur experience, but he was still an EU LCS rookie and had the inconsistent play to prove it. In 2016, Steve and Schalke were huge underdogs heading into the Spring Split. Their play was enough to hang onto 7th place and re-qualify for the Summer Split.\n</p>\n<p>\nSteve has always been a crowd favorite though, making a name for himself as a great split pusher and all-around team player. This split will be a test to find out just where Steve lies in Europe’s sea of talent. Schalke has remained largely the same, paving the way for Steve to make this Split a proving grounds for himself. Let there be no doubt, the chants of “Steeeeeeeeeeeeve!” will still be heard around the world, let’s just hope he answers the call.\n</p>","fr_FR":"<p>La France est particulièrement bien fournie en toplaners. Après le vétéran Paul « sOAZ » Boyer et Lucas « Cabochard » Simon-Meslet, le public a pu découvrir Etienne « Steve » Michels. Ayant débuté sur League of Legends dès ses prémices, Steve n’a pas tout de suite été tenté par la compétition, mettant ses études au premier plan. En 2015, il rejoint le projet Sparta, dans le but de tenter la qualification aux LCS via le tournoi d’expansion. L’équipe ayant échoué dans son entreprise, Steve rejoint l’équipe LDLC pour continuer à jouer au niveau français. C’est à ce moment-là que sa carrière décolle. Steve est repéré par l’équipe ROCCAT lors de la pré-saison estivale des LCS EU 2015, qui lui propose de remplacer Overpow au poste de toplaner titulaire. Il avait dans ses bagages quelques légères années d'expérience sur la scène amateur, mais il restait néanmoins un débutant propulsé aux LCS EU. Son inexpérience au niveau professionnel lui a coûté cher dès les premières semaines du segment d'été et les équipes adverses en abusaient.</p>\n<p>Mais très vite, le Français a redressé la tête durant la seconde moitié de la saison et son KDA moyen est passé de 1,9 (semaines 1 à 5) à 4,4 (semaines 6 à 10). Sa confiance en ses capacités et, plus important encore, la confiance que ses équipiers plaçaient en lui étaient bien plus grandes. Les spectateurs berlinois ont également soutenu le toplaner dès ses premières apparitions, visiblement séduits par son sourire permanent. Les progrès de Steve ont hissé permis à ROCCAT d’atteindre la 5e place du segment d'été des LCS EU 2015 et de participer aux play-offs. </p>\n<p>Début 2016, Steve rejoint l’équipe Elements in-extremis. Aux côtés de son compatriote Jérémy « Eika » Valdenaire, il donne le meilleur de lui-même dans un championnat très disputé mais le milieu de saison est très difficile. L’équipe parvient tout de même à sécuriser la 7e place, qui n’offre pas de ticket pour les play-offs mais qui dispense de tournoi de relégation. À l’intersaison, le spot Elements est racheté par l’équipe sportive FC Schalke 04. Fort d’un encadrement très sérieux et expérimenté, Steve pourra peut-être enfin s’épanouir cette saison !\n</p>","es_ES":"<p>Etienne 'Steve' Michaels comenzó su carrera profesional durante la pretemporada del Split de verano de la LCS EU 2015, reemplazando a Overpow como el top titular. Steve traía bajo el brazo varios años de experiencia en la competición amateur, pero no dejaba de ser un novato, cosa que pagó en las primeras semanas del Split de verano de la LCS EU 2015 con una actuación lejos del nivel esperado.</p>\n<p>Pero Steve no cejó en su empeño y mejoró sensiblemente su rendimiento en la segunda mitad de la temporada, pasando de un KDA de 1.9 (jornadas 1 a 5) a 4.4 (jornadas 6 a 10). Con un aumento significativo no sólo en su confianza sino en la del resto del equipo. La mejora de Steve llevó a ROCCAT a la tercera posición en el Split de verano de la LCS EU 2015, y eventualmente aseguró una plaza en un nuevo equipo de cara al Split de primavera de la LCS EU 2016, Elements. No podemos esperar a ver a los aficionados aclamarlo con su grito preferido: \"¡¡Steeeeevveeeeeeee!!\".</p>","pl_PL":"<p>Etienne rozpoczął swoją przygodę z League of Legends bardzo wcześnie, gdyż zdominował amerykański serwer przed powstaniem europejskiego. Zanim się przeniósł na ten drugi, udało mu się znaleźć wśród 30 najlepszych graczy w regionie. Na amatorskiej scenie pojawił się w 2013 roku, grając w wielu drużynach konkurujących w Kręgu Pretendenta. Przed zaangażowaniem się w rozgrywki 5v5, w pierwszym i drugim sezonie „Steve” uznawał za swoją główną rolę AD Carry. Dopiero udział w drużynowych konkurencjach sprawił, że przeniósł się na top-lane. Posunął się nawet do tego, że po liceum wziął rok wolnego żeby się skupić na swojej karierze profesjonalnego gracza. Jednak ani przenosiny na inną linię ani rezygnacja z pójścia na studia nie przyniosły mu upragnionych osiągnięć. Dopiero kiedy wrócił na studia fizyki w inżynierii dostał szansę na wykazanie się od drużyny Sparta. W październiku 2014 roku przeniósł się do domu graczy w Paryżu należącego do tej organizacji. Wraz z nią wziął udział w Europejskim turnieju rozszerzającym ilość drużyn w rozgrywkach LCS. Niestety znowu bez sukcesu. </p>\n<p>\n„Steve” miał okazję pokazać się społeczeństwu dopiero kiedy zastąpił Remigiusza \"Overpow\" Puscha w zespole Roccat. Od maja 2015 roku przejął górną aleję w tej ekipie i wreszcie miał okazję zaprezentować co potrafi szerszej publice. W szeregach „niebieskiego kota” osiągnął największy sukces – zajął piąte miejsce w letnim sezonie EU LCS 2015. Jak na debiutanta to naprawdę imponujący wyczyn. Jednak nie pozostawił widzom wątpliwości, że w pełni zasłużył na podziw. Wielokrotnie broniony przez Etienna top-lane stawał się ostoją całej drużyny, pomimo tego, że nie grał swoimi ulubionymi bohaterami – Ryzem i Irelią. Stał się znany z niesamowitych zagrań Maokaiem, którego najczęściej można było podziwiać właśnie w jego wydaniu. Wielu fanów utrzymuje, że największe wrażenie na nich zrobiła jego gra Ekko – w lecie wygrał wszystkie mecze, w których wybrał Chłopca, Który Ujarzmił Czas.</p>\n<p>\n„Steve”, pomimo tego, że urodził się we Francji, miał okazję mieszkać w Belgii i Arabii Saudyjskiej – co bardzo wyróżnia go wśród innych graczy. Kolejnym znaczącym kontrastem była jego zdolność do połączenia pasji gry na komputerze z klasycznym sportem. W swoim regionie osiągnął wiele w lidze badmintona.\n</p>","de_DE":"<p> „Er ist sehr bescheiden.“ Worte, mit denen Jakob \"YamatoCannon\" Mebdi seinen damaligen Top-Laner beschrieb. Ein Attribut, was nicht vielen Spielern der oberen Liga zugutekommt, da mit guten Spielern oftmals ein großes Ego einhergeht. Mit Nettigkeit kommt man nicht voran? Steve beweist das Gegenteil, denn hinter dem sanften Gemüt steckt viel Ehrgeiz und die feste Entscheidung im eSports etwas zu erreichen. </p>\n<h2><p>Ein steiniger Weg</p></h2>\n<p>Doch der Weg war kein leichter. Sein Eintritt in League war gleich zu Beginn des Spiels im Jahre 2009. Ohne weitere Hintergedanken kam er schnell unter die Top 200 und erste Gedanken an eine Karriere kamen auf. Mit Beginn der dritten Saison kam der erste große Schritt zur Umsetzung des Plans. Er wählte die Top-Lane zu seiner Bestimmung, da er Jarvan IV. sehr gerne spielte und hielt erstmals nach Amateurteams Ausschau. </p>\n<p>Wie bei so Vielen folgte ein langer Weg vom einen Challenger Team zum nächsten, da sich die Teams schon nach den ersten Misserfolgen wieder schnell auflösten. Unter anderem auch die Eigenkreationen des Hobbykeksbäckers mit seinem Team „Steve Bakes Cookies“. So richtig los ging es erst, als YamatoCannon auf ihn aufmerksam wurde, nachdem er durch seine Art immer wieder von ehemaligen Kollegen empfohlen wurde. </p>\n<p>Wohlgleich noch der Franzose noch sehr unvertraut mit dem von da an immer größer werdenden Publikum war, lieferte er einen sehr starken Split ab. Er war maßgeblich an dem zufriedenstellenden fünften Platz seitens ROCCAT beteiligt. Vor allem durch sein starkes Erscheinen auf Maokai und Ekko verhalf er dem Team vermehrt zu Siegen. Nicht ohne Grund waren die „Steeeeve“ Rufe im LCS Stream nicht zu überhören. </p>\n<p>Die Reise geht nun weiter. Das ruhige Gemüt wird zukünftig eines der fünf Elemente in Elements sein. Nicht als Feuer und Flamme, sondern als standfestes Rückgrat des Teams. Während des Spiels, aber auch danach im persönlichen Zusammenleben mit seinen wieder einmal neuen Kollegen. </p>\n"},"foreignIds":{"drupalId":"1940","TRLH3":"200000255","TRLH4":"200000307","TRLH2":"1001250001","FRA1TMNT2":"25416","ESPORTSTMNT02":"200001025"},"socialNetworks":{"twitch":"http://www.twitch.tv/rocsteve","facebook":"https://www.facebook.com/LolIAmSteve?_rdr=p"},"champions":[],"liveGameTeam":55},{"id":588,"slug":"kobbe","name":"Kobbe","firstName":"Kasper","lastName":"Kobberup","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kobbe-adbtha0l.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-09T10:31:56.000Z","bios":{"en_US":"<p>Kasper “Kobbe” Kobberup didn’t always want to be a professional gamer. He was dedicated to football before an injury sent him to the sideline and he had to rethink his options. Luckily for Splyce, Kobbe took up League of Legends. Before long, he became one of the best up-and-coming ADCs in Europe.</p>\n\n<p>Like the rest of Splyce, Kobbe was disappointed by his performance at the 2016 World Championship. But the international experience should make Kobbe and Splyce even better if they can learn from it. The next time elite opponents stare him down, Kobbe will be ready to blow right past them.</p>","de_DE":"<p>Kasper „Kobbe“ Kobberup wollte nicht immer ein professioneller Spieler werden. Er war ein leidenschaftlicher Fußballspieler, bevor ihn eine Verletzung auf die Ersatzbank zwang und er seine Optionen überdenken musste. Zum Glück für Splyce begann Koppe, League of Legends zu spielen. Es dauerte nicht lange, bis er zu einem der besten Nachwuchs-ADCs Europas wurde.\n\nWie der Rest von Splyce war auch Kobbe mit seiner Vorstellung bei der Weltmeisterschaft 2016 nicht zufrieden. Aber wenn Kobbe und Splyce aus der internationalen Erfahrung lernen konnten, sollten sie jetzt sogar noch besser sein. Wenn er das nächste Mal von Elite-Gegnern finster angestarrt wird, kann Kobbe einfach vorbeistürmen.</p>","fr_FR":"<p>Kasper « Kobbe » Kobberup sera-t-il le nouveau Jesper « Niels » Svenningsen ? C’est probablement la question qui sera posée dorénavant à chaque nouveau carry ad qui arrive en LCS EU. Sans lui imposer une trop forte pression sur les épaules, on peut déjà estimer que Kobbe a les moyens de se faire un nom pour lui-même. Le joueur danois, passé par Gamers 2 mais aussi brièvement par la structure française Millenium en 2015 a véritablement explosé sur la scène challenger au printemps de l’année écoulée quand il a rejoint son équipe actuelle. Ce qui était à l’époque Dignitas EU a eu le nez creux en recrutant deux semaines après le début des Challenger Series son nouveau carry AD. Celui-ci, alors en duo avec Erih « Voidle » Sommermann sur la voie du bas, n’a pourtant pas révélé tout de suite l’étendue de son talent. Il a fallu pour cela attendre le segment d’été des Challenger Series et l’arrivée à ses côtés d’un nouveau support, Nicolai « Nisbeth » Nisbeth. Les deux danois ont trouvé une synergie très efficace, qui leur a permis de surclasser la concurrence et d’être de l’avis général le meilleur binôme carry AD/Support de la scène challenger.   Une synergie qui va néanmoins être mise à rude épreuve face à celle de duos LCS plus expérimentés. Malgré tout, s’il est peu probable de retrouver dès cette année Splyce et Kobbe en demi –finale des championnats du monde, le joueur a largement les moyens d’imposer son style de jeu et son nom en bonne place aux côtés de ses glorieux ainés. </p>","es_ES":"<p>Antes de jugar a League of Legends, Kasper ''Kobbe'' Kobberup se dedicaba al fútbol. Cuando una lesión lo obligó a retirarse, reconsideró sus opciones, y por suerte para nosotros, el fin de un sueño es el momento perfecto para el inicio de otro. Kobbe dedicó su tiempo en el banquillo de fútbol a convertirse en jugador profesional de videojuegos.</p>\n\n<p>Tras una actuación dominante en la Challenger Series europea de 2015, Kobbe llegó a la LCS EU. Aunque estuvieron a punto de ser eliminados, Kobbe y Splyce sorprendieron a todo el mundo y obtuvieron un segundo puesto en el split de verano de la LCS EU 2016. Además de eso, ayudó a asegurarle un puesto a Splyce en el Mundial en su segundo split en acción en la LCS EU. Señalado como uno de los AD carries más prometedores de Europa, Kobbe tiene ahora la oportunidad de medir su entereza con la élite internacional. Es una lucha a vida o muerte para Kobbe, y si tomamos el pasado como referencia, llegado el momento de la partida, elegirá vivir.</p>","pl_PL":"<p>Gra urodzonego w 1996 roku Duńczyka nie jest może tak widowiskowa jak chociażby jego kolegi z drużyny Chresa „Sencuxa” Larsena, ale Kobbe jest niesamowicie regularnym graczem, a także bardzo istotnym elementem zespołu. Jego opanowanie i zdolność do utrzymania przez długi czas wysokiego poziomu doskonale równoważy wahania formy duńskiego i mid-lanera i sprawia, że ekipa Splyce ma na kim oprzeć swoją grę, podczas gdy Sencuxowi przydarzy się gorsza gra. Kobbe to na pierwszy rzut oka bardzo niepozorny strzelec, ale w letnim splicie Challenger Series 2015 nie było żadnego gracza na jego pozycji, który mógłby równać się z Duńczykiem. Najwięcej zabójstw i asyst, najmniej śmierci i niesamowite KDA na poziomie 10,5 sprawiają, że Kobbe wydaje się być najbardziej niedocenianym zawodnikiem w składzie beniaminka EU LCS. </p>\n<p>\nJednocześnie warto zauważyć, że Kobbe zwrócił uwagę czołowych drużyn w Europie już nieco wcześniej, gdy udało mu się dostać do pierwszej dziesiątki SoloQ zachodnio-europejskiego serwera. Miało to miejsce w trakcie letniego splitu 2015 i wtedy też pojawiały się pogłoski o tym, że miałby dołączyć do Teamu ROCCAT, który szukał strzelca w miejsce Pawła „Woolite’a” Pruskiego. Ostatecznie jednak Kobbe pozostał w Dignitas EU, a ROC sięgnął po Rasmusa „MrRalleza” Skinneholma. </p>\n<p>\nAle gdy my sięgniemy jeszcze dalej w przeszłość, zobaczymy, że Kobbe już od dłuższego czasu kręcił się najpierw w okolicach Challenger Series z Denial eSports i 4everzenzyg (od maja do listopada 2014), a później poczynał sobie coraz śmielej i występował w kilku ciekawych zespołach o LCS-owych aspiracjach. Wymienić tu można chociażby Gamers2, gdzie Kobbe przez krótki czas grał u boku m.in. obecnego wspierającego Teamu SoloMid – Raymonda „KaSinga” Tsanga czy późniejszego dżunglera Dignitas EU – Dennisa „Obviousa” Sørensena. Kolejnym przystankiem na drodze duńskiego strzelca było Millenium, ale także tutaj nie zabawił zbyt długo i wkrótce dołączył do Teamu Dignitas EU, z którym to po dwóch splitach zmagań w Challenger Series, w końcu udało mu się dostać do LCS-u na wiosenną edycję 2016. Konsekwencja, której nie brakuje Kobbe’mu także na Polach Sprawiedliwości w końcu zaowocowała.</p>\n<p>\n„Jest naprawdę dobrym strzelcem z solidną fazą linii i umiejętnością gry w zespole. Doskonale wie jak pozycjonować się w walkach drużynowych” – powiedział o swoim byłym koledze z drużyny francuski top-laner Julian „GoB” Treguer dla portalu Millenium.org.</p>\n<p>\nCiekawostką jest fakt, że Kobbe na wysokim poziomie gra nie tylko w League of Legends. Duński ADC, którego graniem w gry zaraził brat, był w przeszłości miłośnikiem Warcrafta 3, World of Warcraft oraz Diablo 2, a do tej pory zdarza mu się zagrać w CS:GO, gdzie udało mu się zdobyć najwyższą możliwą rangę – Global Elite.\n</p>","es_AR":"<p>Antes de jugar League of Legends, Kasper \"Kobbe\" Kobberup se dedicaba al fútbol. Luego de una lesión que lo dejó fuera del campo de juego, tuvo que reconsiderar sus opciones para el futuro. Por suerte para nosotros, el final de un sueño puede ser el comienzo de otro. Kobbe aprovechó el tiempo que pasó en el banco de suplentes para convertirse en video jugador profesional.</p>\n\n<p>Luego de una actuación dominante en la Challenger Series EU 2015, Kobbe pasó a formar parte de la LCS EU. Después de casi descender, Kobbe y Splyce sorprendieron a todos con un segundo lugar en el torneo de clausura de la LCS EU 2016. Además de esto, ayudó a Splyce a guardarse un lugar en el Mundial en su segundo torneo dentro de la escena de la LCS EU. Aclamado como uno de los mejores y prometedores ADC de Europa, Kobbe tiene la oportunidad de probar su valía contra enemigos internacionales de élite. Para Kobbe, las opciones son matar o morir, y su historia indica que escogerá la primera llegado el momento de jugar.</p>"},"foreignIds":{"drupalId":"2699","TRLH3":"200000106","TRLH4":"200000209"},"socialNetworks":{"twitch":"twitch.tv/kobbelol","facebook":"facebook.com/Kobbelol","twitter":"twitter.com/SPY_Kobbe"},"champions":[],"liveGameTeam":97},{"id":663,"slug":"gripex","name":"Gripex","firstName":"Jesper","lastName":"Terkildsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gripex-6b756abo.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-18T21:24:08.000Z","bios":{"en_US":"","es_AR":"<p>Jesper \"Gripex\" Terkildsen es el junglero suplente de Splyce.</p>"},"foreignIds":{"drupalId":"4545","TRLH4":"200000211","TRLH3":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":954,"slug":"mikyx","name":"Mikyx","firstName":"Mihael","lastName":"Mehle","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikyx-dbj14d9y.png","hometown":"","region":"EU LCS","birthdate":"","createdAt":"2016-01-05T19:47:13.000Z","updatedAt":"2017-06-09T11:10:17.000Z","bios":{"en_US":"<p>Mihael \"Mikyx\" Mehle is a support prodigy for Splyce. He's the only member of Splyce who wasn't on the team when they clawed their way out of the 2016 EU LCS Summer Promotion Tournament. As a rookie in the Summer Split, he brought a new level of playmaking to Splyce from the support position. Despite his inexperience, he helped Splyce go from rags to riches and earn a spot at the 2016 World Championship.</p>\n\n<p>At Worlds, Mikyx finally showed weakness. As he returns with the rest of Splyce for 2017, he'll get his first full season in the EU LCS to improve his talents. With his career still in its infancy, Mikyx has plans to attend Worlds for many years to come.</p>","de_DE":"<p>Mihael „Mikyx“ Mehle ist das Supporter-Wunderkind von Splyce. Er ist das einzige Mitglied, das beim erbitterten Kampf der Mannschaft im Sommer-Aufstiegsturnier der EU LCS 2016 nicht dabei war. Er ging als Nachwuchsspieler in den Sommer-Split und schaffte es dennoch, die Rolle des Spielmachers neu zu definieren. Trotz seiner geringen Erfahrung half er Splyce dabei, einen fulminanten Aufstieg hinzulegen und sich einen Platz bei der Weltmeisterschaft 2016 zu sichern.\n\nBei der Weltmeisterschaft zeigte Mikyx dann erstmals Schwäche. Wenn er 2017 mit dem Rest von Splyce zurückkehrt, kann er sein Können in seiner ersten kompletten Saison in der EU LCS verbessern. Da seine Karriere immer noch in den Kinderschuhen steckt, hat Mikyx vor, noch an vielen Weltmeisterschaften teilzunehmen.</p>","fr_FR":"<p>Mihael « Mikyx » Mehle a rejoint les rangs de Splyce en tant que support titulaire au début du segment d’été 2016. D’origine slovène il a été le support remplaçant de Fnatic durant le segment de printemps. Néanmoins, il n’a jamais été titularisé et ce sera donc avec Splyce qu’il fera ses premiers pas sur la scène compétitive des LCS durant ce segment d’été. </p>","pl_PL":"<p>Mihael „Mikyx” Mehle to zawodnik ze Słowenii, który swoje pierwsze kroki w profesjonalnym graniu stawiał w rodzimym zespole Bottled Water. Interesującym momentem w jego karierze okazało się dołączenie do legendarnego Fnatic w roli rezerwowego wspierającego. Wtedy 18-latek dał się poznać jako doskonały zawodnik soloQ, a jego talent chwalili tak znakomici zawodnicy jak Lee „Spirit” Da-yoon czy Jesper „Zven” Svenningsen, jednocześnie zwracając jednak uwagę na wąski champion pool młodego gracza. We Fnatic jednak Mikyx nie miał szans na grę, a dodatkowo jego sytuację skomplikował powrót do zespołu Bory „YellOwStaR’a” Kima.</p>\n<p>W tym czasie Mikyx otrzymał jednak ofertę ze Splyce, które dawało mu szansę sprawdzenia się na najwyższym europejskim poziomie rozgrywkowym – w EU LCS, z której to propozycji Słoweniec oczywiście skorzystał. W nowym zespole zastąpił Nicolaia „Nisbetha” Nisbetha i sprawił, że dotychczas jednonarodowościowy skład przestał być w pełni duński. Zarówno zawodnicy, jak i kibicie wierzą jednak, że Słoweniec będzie wzmocnieniem dla drużyny i że z w nim w składzie Splyce powalczy o coś więcej niż utrzymanie. Co ciekawe, Mikyx już wcześniej często grał w dynamicznej kolejce razem z Chresem „Sencuxem” Laursenem i Kasperem „Kobbe’em” Kobberupem, dzięki czemu zawodnicy ci zdążyli już zbudować podstawy synergii. Dotychczas Słoweniec dał się poznać przede wszystkim jako znakomity gracz Thresha i Morgany.</p>\n<p>„Mikyx ma wszelkie cechy, które w mojej opinii tworzą najlepszych zawodników w LCS. Posiada pasję i jest zmotywowany, by ciągle stawać się lepszym. Okazuje też wielki szacunek dla gry i samych graczy. Żeby nie wspomnieć o ogromnym talencie, który posiada.” – powiedział o swoim nowym zawodniku trener Splyce Jakob  „YamatoCannon” Mebdi.</p>\n","es_AR":"<p>Mihael \"Mikyx\" Mehle es la nueva edición del plantel inicial de Splyce. Al llegar a lo más alto del juego en solitario en nivel Aspirante, fue descubierto por Fnatic y escogido como soporte suplente para el torneo de apertura de la LCS EU 2016.</p>\n\n<p>En abril, Mikyx dejó Fnatic para convertirse en el nuevo soporte inicial de Splyce luego de que Nicolai \"Nisbeth\" Nisbeth se hiciera a un lado, y hay que decir que su presencia se hizo notar. La suerte se puso aún más del lado de Splyce durante el torneo de clausura, en el que la dupla de carriles inferiores formada por Kobbe y Mikyx estuvo asombrosamente afilada. Mikyx demostró una gran habilidad para crear jugadas con campeones como el Bardo, y lanzó habilidades definitivas determinantes por toda la Grieta con gran facilidad. Es muy poco común ver a un jugador principiante tan talentoso como Mikyx en los Mundiales. Su actuación le ha dado una oportunidad de jugar con las leyendas que el siempre ha querido ser.</p>","es_ES":"<p>Mihael ''Mikyx'' Mehle es el miembro más nuevo de la alineación principal de Splyce. Destacaba en el juego en solitario en el nivel Aspirante, así que Fnatic lo tuvo en cuenta y lo fichó como apoyo suplente durante el split de primavera de la LCS EU.</p>\n\n<p>En abril, Mikyx dejó Fnatic y pasó a ser el apoyo titular de Splyce, en sustitución de Nicolai ''Nisbeth'' Nisbeth, y lo dio todo en sus jugadas. La suerte de Splyce mejoró en el split de verano, ya que el dúo de la calle inferior, Kobbe y Mikyx, estuvo increíblemente avispado. Mikyx demostró una gran habilidad para facilitar jugadas con campeones como Bardo, con quien es capaz de lanzar fácilmente su definitiva desde la otra punta de la Grieta y propiciar así un giro en la partida. Es raro ver talentos como Mikyx en el escenario del Mundial tan pronto en su trayectoria profesional, pero se ha ganado esta oportunidad de jugar con las leyendas en las que se quiere convertir.</p>"},"foreignIds":{"TRLH3":"200000107","TRLH4":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1337,"slug":"memento","name":"Memento","firstName":"Jonas","lastName":"Elmarghichi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/memento-2s3o4ejq.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:46:29.000Z","updatedAt":"2017-06-18T19:39:23.000Z","bios":{"en_US":"<p>Jonas \"Memento\" Elmarghichi was originally a solo queue star before kickstarting his professional career in 2015. He then joined Team ROCCAT as their starting jungler in mid 2016. He, along with the entire team, struggled in the LCS and eventually had to play in the EU LCS Promotion Tournament in order to re-enter the league. After struggling with ROCCAT, Memento looked for other opportunities to showcase his abilities and landed with Giants Gaming in early 2017. While his play hasn’t been astounding by any stretch, he’ll have another shot to prove that he belongs with the best in Europe when spring rolls around.</p>","de_DE":"<p>Jonas „Memento“ Elmarghichi war ursprünglich ein Star der Solo-Warteschlange, bevor er seine Profikarriere 2015 gestartet hat. Er ist Mitte 2016 Team ROCCAT als Jungler beigetreten. Allerdings hatten er und der Rest des Teams große Schwierigkeiten in der LCS und schließlich mussten sie sich im „EU LCS“-Aufstiegsturnier den Weg zurück in die Liga erkämpfen. Nach den Problemen mit ROCCAT hat sich Memento nach anderen Möglichkeiten umgesehen, um seine Fähigkeiten zu zeigen. Anfang 2017 ist er dann bei Giants Gaming gelandet. Obwohl seine Leistung nicht außergewöhnlich war, kann er im Frühjahr erneut beweisen, dass er zu den Besten Europas gehört.</p>"},"foreignIds":{"TRLH4":"200000199","TRLH3":"200000096","ESPORTSTMNT02":"200002451"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1376,"slug":"norskeren","name":"Norskeren","firstName":"Tore","lastName":"Hoel Eilertsen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/norskeren-f5d7bkuf.png","hometown":null,"region":"Challenge France","birthdate":null,"createdAt":"2016-06-17T20:14:37.000Z","updatedAt":"2017-08-17T15:27:52.000Z","bios":{"en_US":"","fr_FR":"Dans son pays d'origine, le joueur norvégien a joué dans plusieurs équipes, participant à des tournois nationaux et des LANs. C'est en avril 2016 qu'il rejoint la structure professionnelle allemande mousesport. Finalement, il préférera retourner en Norvège pour jouer dans l'équipe Riddle eSports, la meilleure équipe du pays. \n<br />\nRéperé par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires."},"foreignIds":{"TRLH1":"1001360009","esportstmnt05":"200000939","ESPORTSTMNT02":"200002448","TRLH4":"200000354","TRLH3":"200000354"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1377,"slug":"upset","name":"Upset","firstName":"Elias","lastName":"Lipp","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/upset-f4z7h6wr.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-20T17:58:58.000Z","updatedAt":"2017-05-09T22:41:05.000Z","bios":{},"foreignIds":{"TREU1":"1000585051","TREU":"1000585051","ESPORTSTMNT02":"200001007","TRLH3":"200000233","TRLH4":"200000085","TRLH1":"200000423"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1752,"slug":"rexxx","name":"1 Rexxx","firstName":"Erik","lastName":"Reisswig","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rexxx-5uhnncsw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-30T20:08:17.000Z","updatedAt":"2017-07-07T18:06:26.000Z","bios":{},"foreignIds":{"TRLH3":"200000235","TRLH4":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1771,"slug":"annes","name":"Annes","firstName":"Annes","lastName":"Ravkic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/annes-47wl5dqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-02-10T15:25:24.000Z","updatedAt":"2017-05-31T21:46:49.000Z","bios":{},"foreignIds":{"TRLH3":"200000226","TRLH4":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":2013,"slug":"nikola-senpai","name":"Nikola Senpai","firstName":"Nikola","lastName":"Djordjevic","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nikola-senpai-3z4qiutz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:23:59.000Z","updatedAt":"2017-08-06T14:35:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002453","TRLH4":"200000454"},"socialNetworks":{},"champions":[],"liveGameTeam":55}],"scheduleItems":[{"id":"AVTGgk54QMQFcjhwbQhe","content":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:match:aa49949b-e9bd-4ac2-94a9-6208f7fb188e","scheduledTime":"2016-06-09T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb","blockLabel":"2","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:bracket:88a5aa52-4461-4a15-8fb5-83c8b5265f93"},"match":"aa49949b-e9bd-4ac2-94a9-6208f7fb188e","tournament":"f7afa181-4580-48c0-af26-4b3d70fe21eb","bracket":"88a5aa52-4461-4a15-8fb5-83c8b5265f93","league":"3"}],"gameIdMappings":[{"id":"83df6ec0-03fc-4184-8793-8d0f2fc6a025","gameHash":"9f75e09209febaa5"},{"id":"06e0477f-03a9-4df2-bf84-c5f57ce5a67b","gameHash":"11df9e8fe3eaeb24"}],"videos":[{"id":3034,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:06e0477f-03a9-4df2-bf84-c5f57ce5a67b","source":"https://www.youtube.com/embed/NAooeDBtUws?wmode=transparent","createdAt":"2016-06-09T22:34:58.000Z","updatedAt":"2016-06-09T22:34:58.000Z","game":"06e0477f-03a9-4df2-bf84-c5f57ce5a67b"},{"id":3038,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:83df6ec0-03fc-4184-8793-8d0f2fc6a025","source":"https://www.youtube.com/embed/cxqmNFc73Ws?wmode=transparent","createdAt":"2016-06-10T00:23:46.000Z","updatedAt":"2016-06-10T00:23:46.000Z","game":"83df6ec0-03fc-4184-8793-8d0f2fc6a025"}],"htmlBlocks":[],"match":{"id":"aa49949b-e9bd-4ac2-94a9-6208f7fb188e","name":"SPY-vs-S04","position":14,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"},{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}],"games":{"83df6ec0-03fc-4184-8793-8d0f2fc6a025":{"id":"83df6ec0-03fc-4184-8793-8d0f2fc6a025","name":"G2","generatedName":"S04|SPY|G2|aa49949be9bd4ac294a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],"standings":{"result":[[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1465517637897,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1465506472765,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001670080","gameRealm":"TRLH3","platformId":"TRLH3:1001670080","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"06e0477f-03a9-4df2-bf84-c5f57ce5a67b":{"id":"06e0477f-03a9-4df2-bf84-c5f57ce5a67b","name":"G1","generatedName":"S04|SPY|G1|aa49949be9bd4ac294a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"},{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}],"standings":{"result":[[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1465503098059,"source":"manual","note":"Updated from HQ 2","closed":true},"scores":{},"gameId":"1001670074","gameRealm":"TRLH3","platformId":"TRLH3:1001670074","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1465517637897,"source":"bestOf","history":[{"result":[[{"roster":"7b66cf00-ff2c-4b82-b3c6-2e6466271115"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1465506472765,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc":0,"7b66cf00-ff2c-4b82-b3c6-2e6466271115":3}}}