{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]}],"players":[{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AU9xd2oSOPWArxM1l4VS","content":"urn:rg:lolesports:global:highlander:tournament:b633bc28-3be0-44a1-9ce5-63e675a69277:match:ab8ff511-f17b-4dba-8169-25c5f2d05ee2","scheduledTime":"2015-08-31T15:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:b633bc28-3be0-44a1-9ce5-63e675a69277","stageLabel":"urn:rg:lolesports:global:highlander:tournament:b633bc28-3be0-44a1-9ce5-63e675a69277:bracket:88055e13-b57e-43fa-9e37-7f6474191a7a","blockLabel":"quarterfinals","subBlockLabel":"EU Regionals - Round 1"},"match":"ab8ff511-f17b-4dba-8169-25c5f2d05ee2","tournament":"b633bc28-3be0-44a1-9ce5-63e675a69277","bracket":"88055e13-b57e-43fa-9e37-7f6474191a7a","league":"3"}],"gameIdMappings":[{"id":"a3b7c58e-8054-4de9-b1c7-a7c17952bb45","gameHash":"48a5ed5c687881bb"},{"id":"55228a6c-3426-4c15-83bc-2ce77eb33705","gameHash":"3cddce5c4c8a0575"},{"id":"c5a5c95f-4580-40d9-a515-49ab1ae2dec9","gameHash":"abad497640eb27eb"}],"videos":[],"htmlBlocks":[],"match":{"id":"ab8ff511-f17b-4dba-8169-25c5f2d05ee2","name":"R1M1","position":0,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"},{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],"games":{"a3b7c58e-8054-4de9-b1c7-a7c17952bb45":{"id":"a3b7c58e-8054-4de9-b1c7-a7c17952bb45","name":"G1","generatedName":"GIA|ROC|G1|ab8ff511f17b4dba816","input":[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"},{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],"standings":{"result":[[{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"}]],"timestamp":1440864714377,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001300011","gameRealm":"TRLH3","platformId":"TRLH3:1001300011","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"2caa6f7e-682c-47fd-8f71-cb0e356e7397":{"id":"2caa6f7e-682c-47fd-8f71-cb0e356e7397","name":"G5","generatedName":"GIA|ROC|G5|ab8ff511f17b4dba816","input":[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"},{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"55228a6c-3426-4c15-83bc-2ce77eb33705":{"id":"55228a6c-3426-4c15-83bc-2ce77eb33705","name":"G2","generatedName":"GIA|ROC|G2|ab8ff511f17b4dba816","input":[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"},{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],"standings":{"result":[[{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"}]],"timestamp":1440867856091,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001300015","gameRealm":"TRLH3","platformId":"TRLH3:1001300015","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"ed9bd3a0-b923-4fae-a715-a934e436223e":{"id":"ed9bd3a0-b923-4fae-a715-a934e436223e","name":"G4","generatedName":"GIA|ROC|G4|ab8ff511f17b4dba816","input":[{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"},{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"c5a5c95f-4580-40d9-a515-49ab1ae2dec9":{"id":"c5a5c95f-4580-40d9-a515-49ab1ae2dec9","name":"G3","generatedName":"GIA|ROC|G3|ab8ff511f17b4dba816","input":[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"},{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],"standings":{"result":[[{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"}]],"timestamp":1440870900799,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001300016","gameRealm":"TRLH3","platformId":"TRLH3:1001300016","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"05ceeb28-3900-4ca3-9164-a7346e9c49a9"}],[{"roster":"cbf1ae05-bda3-482b-a6a0-3763ee57b265"}]],"timestamp":1440870900800,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scores":{}}}