{"teams":[{"id":9,"slug":"sktelecom-t1","name":"SK telecom T1","guid":"be6c808b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/sktelecom-t1-3mpugoym.png","acronym":"SKT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-08-01T18:16:40.000Z","updatedAt":"2017-05-26T23:47:44.000Z","bios":{"en_US":"<p>SK telecom T1 is the best team in the history of League of Legends. With three World Championships under their belt from 2013, 2015 and 2016, no team comes close to their level of dominance. After a stellar run in 2015 that ended in their second title, SKT struggled to start 2016. They righted the ship by IEM Katowice, finishing first in Champions Spring 2016 and winning the 2016 Mid-Season Invitational.</p> \n\n<p>They hit another snag when they failed to reach the finals in Champions Summer 2016, falling to kt Rolster. But the SKT of old showed up right away at the 2016 World Championship, and Faker led the team to its second straight Worlds win. Entering 2017 with a roster somehow even more packed with talent, anything short of another World Championship would be a disappointment for SKT.</p>\n\n<p>Coach: Jeonggyun “KkOma” Kim</p>","fr_FR":"SK Telecom T1 est la meilleure équipe de l'histoire de League of Legends. Avec trois Championnats du monde à son palmarès en 2013, 2015 et 2016, aucune équipe n'approche de son niveau de domination. Suite à une performance sans faute en 2015 qui s'est soldée par un deuxième titre, SKT a commencé l'année 2016 plus difficilement. L'équipe est finalement parvenue à redresser la barre lors des IEM de Katowice, décrochant la première place du Champions Spring 2016 et remportant le Mid-Season Invitational 2016.\n\nElle s'est ensuite à nouveau retrouvée dans l'impasse en manquant de se qualifier pour la finale du Champions Summer 2016 contre KT Rolster. Mais SKT s'est vite remise sur pied au Championnat du monde et Faker lui a valu sa deuxième victoire consécutive au Mondial. Après avoir dominé la LCK ce printemps, SKT s'apprête à présent à participer au Mid-Season Invitational 2017, au Brésil, en tant que favorite incontestable. Les champions en titre aspirent à la première place et ils ne se contenteront de rien de moins.\n\nEntraîneur : Jeonggyun « KkOma » Kim\n","pl_PL":"SK Telecom T1 to najlepsza drużyna w historii League of Legends. Trzy razy wygrała Mistrzostwa Świata ― w 2013, 2015 i 2016 roku. Żadna inna drużyna nie zbliżyła się nawet do tego poziomu dominacji. Po rewelacyjnych występach w 2015 roku, które zakończyli zdobyciem drugiego tytułu, SKT z trudem zaczynali 2016 rok. Podwyższyli poziom lotów na IEM w Katowicach, kończąc na pierwszym miejscu Champions Spring 2016 i wygrywając Mid-Season Invitational 2016.\n\nKolejne spowolnienie nastąpiło, gdy nie zdołali dotrzeć do finałów Champions Summer 2016, przegrywając z KT Rolster. Ale dawne SKT wkrótce powróciło na Mistrzostwa Świata 2016, a Faker doprowadził drużynę do drugiej z rzędu wygranej na Mistrzostwach. Po zdominowaniu LCK tej wiosny SKT jadą na Mid-Season Invitational 2017 w Brazylii jako zdecydowani faworyci. Cokolwiek poniżej pierwszego miejsca będzie rozczarowaniem dla obecnych czempionów.\n\nTrener: Jeonggyun „KkOma” Kim\n","de_DE":"SK Telecom T1 ist die beste Mannschaft in der Geschichte von League of Legends. Keine andere Mannschaft ist so dominant wie der dreimalige Weltmeister, der sich diesen Titel in den Jahren 2013, 2015 und 2016 sichern konnte. Nach einer überragenden Vorstellung im Jahr 2015, die die Mannschaft mit ihrem zweiten Weltmeistertitel krönte, hatte SKT 2016 Startschwierigkeiten. Beim IEM Katowice konnten sie jedoch das Ruder wieder herumreißen, woraufhin sie den Frühjahrs-Split der LCK 2016 und das Mid-Season Invitational 2016 gewannen.\n\nIm Sommer-Split der LCK 2016 folgte jedoch der nächste Dämpfer, als sie von KT Rolster besiegt wurden und das Finale nicht erreichten. Doch SKT fand vor der Weltmeisterschaft 2016 wieder zu alter Stärke zurück und Faker führte die Mannschaft zu ihrem zweiten WM-Titel hintereinander. Nach einer dominanten Vorstellung im diesjährigen Frühjahrs-Split der LCK kommt SKT als Favorit zum Mid-Season Invitational 2017 in Brasilien. Alles andere als der erste Platz wäre für die regierenden Champions eine Enttäuschung.\n\nTrainer: Jeonggyun „KkOma“ Kim\n","es_ES":"SK telecom T1 es el mejor equipo de la historia de League of Legends. Ganadores de tres Campeonatos Mundiales (en 2013, 2015 y 2016), ningún equipo se acerca a su nivel de superioridad. Tras un año estelar en 2015 que les hizo ganarse su segundo título, el comienzo de 2016 no fue tan sencillo para SKT. Recobraron la fuerza a partir del IEM Katowice, acabaron primeros en el Champions Spring de 2016 y ganaron el Mid-Season Invitational 2016.\n\nSe encontraron con un nuevo obstáculo cuando no lograron llegar a la final del Champions Summer 2016, tras perder contra KT Rolster. No obstante, el SKT al que estábamos acostumbrados volvió a dar la cara en el Campeonato Mundial de 2016, y Faker lideró al equipo hasta su tercer título de campeón mundial. Tras dominar en la LCK esta primavera, SKT llega al Mid-Season Invitational 2017 en Brasil como el máximo favorito. Solo el primer puesto estaría a la altura de las expectativas de los actuales campeones.\n\nEntrenador: Jeonggyun ''KkOma'' Kim\n","pt_BR":"<p>SK Telecom T1 é a melhor equipe da história de League of Legends. Com três Campeonatos Mundiais conquistados em 2013, 2015 e 2016, nenhuma equipe se aproxima da sua soberania. Depois de um jogo excelente em 2015 que resultou no seu segundo título, a SKT começou 2016 com dificuldades. Mas eles conseguiram virar o jogo na IEM Katowice, terminando em primeiro no Champions Spring 2016 e vencendo o Mid-Season Invitational 2016.</p>\n\n<p>Eles encontraram outro problema quando não conseguiram chegar à final no Champions Summer 2016, perdendo para KT Rolster. Mas a velha SKT se mostrou imediatamente no Campeonato Mundial 2016, e Faker liderou a equipe à sua segunda vitória mundial consecutiva. Depois de dominar a LCK desta primavera, a SKT avança para o Mid-Season Invitational 2017, no Brasil, como uma das grandes favoritas. Qualquer coisa menos que o primeiro lutar seria uma decepção para os campeões reinantes.</p>\n\n<p>Técnico: Jeonggyun \"KkOma\" Kim</p>\n","es_AR":"<p>Muchos consideran que SKT T1 es uno de los mejores equipos de League of Legends del mundo, con un primer lugar en los Campeonatos Mundiales 2013 y 2015, y varias finales en la OGN Champions. Su dominio en el 2015 era motivo de gran admiración. SKT se llevó a casa el primer lugar en la Champions de primavera y verano, y luego cerró el año con una actuación casi invicta que le mereció el primer lugar en el Campeonato Mundial 2016.</p>\n\n<p>Luego de su participación estelar en el 2015 y de pasar por varios cambios en el plantel, SKTelecom no tuvo un buen inicio del 2016. Sin embargo, brillarían luego en la competencia con una actuación invicta en el IEM Katowice. Después de eso, todo fue un trámite para SKTelecom. Obtuvieron un primer lugar en la Champions Spring 2016 y nuevamente en el torneo por invitación de mitad de temporada. Sin embargo, el equipo se vio en dificultades y no llegó a la final del torneo de clausura de la LCK 2016. Incluso después de terminar tan mal, SKTelecom siguió siendo uno de los mejores equipos del mundo, y está determinado a limpiar su imagen con otro trofeo mundial.</p>\n\n<p><strong>Entrenador: Kim \"KkOma\" Jeong-gyun</strong></p>","ko_KR":"<p>SKT T1은 전 세계에서 리그 오브 레전드 최강 팀 중 하나로 명성이 자자합니다. 시즌 3 월드 챔피언십 및 2015 월드 챔피언십뿐만 아니라 OGN 챔피언스에서 여러 차례 수위에 올랐죠. SKT T1이 2015년에 보여준 포스는 그야말로 어마어마했습니다. 2015 챔피언스 스프링과 서머에서 연달아 우승한 SKT T1은 2015 월드 챔피언십에서는 통틀어 단 한 경기만을 내주고 월드 챔피언으로 등극하며 한 해를 마무리했죠.</p>\n\n<p>영광의 2015년이 끝난 후 로스터 변경으로 인해 SKT T1는 2016년 시즌 초반 힘겨운 시기를 보냈습니다. 하지만 그것도 잠시, IEM Katowice에서 무패의 기록으로 적을 박살내며 포스가 다시 살아났죠. 그 이후 SKT T1은 여느 때처럼 다시 2016 챔피언스 스프링에서 정상에 섰습니다. 결승에서 ROX Tigers를 꺾은 것은 시작일 뿐입니다. MSI에서 SKT T1은 또 다른 국제 대회 트로피를 쟁취하기 위해 다시 전장에 나설 것입니다.</p>"},"foreignIds":{"drupalId":"684"},"players":[46,327,403,404,715,1025,1026,1033],"starters":[46,327,403,404,715],"subs":[1025,1026,1033]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":46,"slug":"faker","name":"Faker","firstName":"Sanghyeok","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/faker-euaqlz0c.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2017-07-06T14:24:48.000Z","bios":{"en_US":"<p>Sanghyeok \"Faker\" Lee is an icon of modern esports. Known as “The Demon King” in his homeland of South Korea, Faker’s quiet and respectful demeanor in person does little to alert bystanders to his dominance on the Rift. But then he steps onto the stage and shatters the limits of what we thought was possible with just a mouse and a keyboard. Faker was so untouchable in Korea for so long that his opponents started saying he had a 3rd Summoner Spell -- how else could he be so strong?</p>\n\n<p>Faker has already raised the bar for what a mid laner is expected to deliver, lifting the Summoner's Cup at three World Championships, once in 2013, again in 2015, and the third time in 2016. He has also netted his team trophies at Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016, and the 2016 Mid-Season Invitational (whew). After winning every international event that League of Legends offered in 2016, Faker and SKT are looking to sweep the international stage once again in 2017.</p>","fr_FR":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pl_PL":"Sanghyeok „Faker” Lee jest ikoną nowoczesnego e-sportu. Znany w swojej ojczystej Korei Południowej jako „Demoniczny Król”, Faker sprawia wrażenie osoby spokojnej i uprzejmej. Nic nie zdradza tego, że potrafi absolutnie dominować na Rifcie. A potem wchodzi na scenę i przekracza granice wszystkiego, co wydawało się możliwe do osiągnięcia za pomocą zwykłej myszy i klawiatury. Faker był w Korei niepokonany od tak dawna, że przeciwnicy zaczęli posądzać go o stosowanie trzeciego czaru przywoływacza — jak inaczej mógłby być tak silny?\n\nFaker znacznie podniósł poprzeczkę oczekiwań wobec zawodnika środkowej alei, trzykrotnie zdobywając Puchar Przywoływacza na Mistrzostwach Świata — po raz pierwszy w 2013 roku, potem w 2015 roku, a po raz trzeci w 2016 roku. Zdobył także trofea dla swojej drużyny podczas Champions Summer 2013, Champions Winter 2013−2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 i Mid-Season Invitational 2016 (uff!). Po wygraniu każdego międzynarodowego turnieju, jaki League of Legends oferowało w 2016 roku, Faker i SKT zamierzają zabrać do domu kolejny międzynarodowy tytuł zdobyty na Mid-Season Invitational 2017.\n","de_DE":"Sanghyeok „Faker“ Lee ist eine Ikone des modernen E-Sports. In seinem Heimatland Südkorea als der „Dämonenkönig“ bekannt, alarmiert sein ruhiges und stets höfliches Verhalten Zuschauende nur sehr selten über seine absolute Dominanz in der Kluft. Aber dann betritt er die Bühne und beweist uns, dass seine Fähigkeiten mit Maus und Tastatur keine Grenzen kennen. Faker war in Korea so lange unantastbar, dass seine Gegner schon glaubten, er hätte einen dritten Beschwörerzauber – wie hätte er sonst so stark sein können?\n\nFaker konnte den Beschwörerpokal bereits in den Jahren 2013, 2015 und jetzt auch 2016 in die Höhe stemmen und hat die Messlatte für Mid-Laner hoch gelegt. Außerdem sicherte er seiner Mannschaft Titel beim Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 und beim Mid-Season Invitational 2016 (uff!). Nachdem Faker 2016 jedes internationale Event, das League of Legends zu bieten hat, gewinnen konnte, wird er zusammen mit SKT versuchen, sich beim Mid-Season Invitational 2017 den nächsten internationalen Titel zu sichern.\n","es_ES":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pt_BR":"<p>Sanghyeok \"Faker\" Lee é um ícone do dos e-sports moderno. Conhecido como \"O Rei Demônio\" em sua terra natal na Coreia do Sul, sua personalidade calma e respeitosa pode acabar enganando os espectadores de plantão sobre as sua soberania no Rift. Quando ele entra no palco, ultrapassa todo os limites do que achávamos possível com apenas mouse e teclado. Faker ficou invicto na Coreia por tanto tempo que seus oponentes diziam que ele tinha um terceiro Feitiço de Invocador. Afinal como ele poderia ser tão forte?</p>\n\n<p>Faker já elevou as expectativas para jogadores do meio e já pôs as mãos em três Copas do Invocador nos Campeonatos Mundiais, uma em 2013, outra em 2015 e agora uma terceira em 2016. Ele também conseguiu outros troféus para sua equipe na Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e no Mid-Season Invitational 2016 (ufa!). Depois de vencerem todos os eventos internacionais oferecidos por League of Legends em 2016, Faker e a SKT procuram levar para casa outro título internacional no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한국에서 '마왕'이라 불리는 \"Faker\" 이상혁은 현대 e스포츠의 아이콘입니다. Faker의 조용하고 공손한 행동거지와 그가 소환사의 협곡에서 누리는 지배력을 연관짓기는 힘듭니다. 하지만 그가 전장에 들어서면 지금까지 사람들이 마우스와 키보드로 가능하다 생각했던 그 모든 한계들을 깨뜨려버리죠. 한국에서는 Faker가 너무 오랫동안 최강자의 지위를 누린 탓에 그가 세 번째 소환사 주문을 쓸 수 있는 게 아니냐는 말까지 나왔습니다. Faker는 어떻게 그렇게 강할 수 있을까요? </p>\n<p style=”font-family:”나눔고딕”;\">Faker는 미드 라이너에게 기대되는 수준을 이미 끌어올렸고, 2013년과 2015년 월드 챔피언십에서 두 번이나 소환사 컵을 거머쥐었습니다. 2013 챔피언스 서머 시즌, 2013-2014 챔피언스 윈터 시즌, 2015 챔피언스 스프링 시즌, 2015 챔피언스 서머 시즌에도 팀에게 우승컵을 안겨줬죠. 하지만 그의 경쟁력은 전혀 시들지 않은 것처럼 보입니다. Faker는 계속해서 SK Telecom T1의 다른 팀원들과 자기자신을 밀어붙여 새로운 전략을 개발하고 챔피언 풀을 넓힙니다. Faker가 리그 오브 레전드 사상 최고의 선수일까요? 아마도요. 하지만 한 가지만은 분명합니다. 그건 바로 Faker가 최초의 세계 e스포츠 슈퍼스타 중 하나로 역사에 남을 거라는 사실이죠. </p>\n","es_AR":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>","cs_CZ":"<p>Sanghyeok „Faker“ Lee je živoucí legendou moderních esportů. Při osobním setkání s ním by jen málokdo tušil, že tento tichý a uctivý mladík je vládcem Žlebu, kterému v jeho rodné Jižní Koreji přezdívají „Král démonů“. Pak ovšem vkročí na pódium a s pouhou klávesnicí a myší zboří všechny naše představy o tom, co všechno je v lidských silách. Faker byl v Koreji tak dlouho nedotknutelný, až o něm začali jeho soupeři říkat, že má k dispozici 3. vyvolávačovo kouzlo – jak jinak by mohl být tak silný?</p>\n\n<p>Faker zcela změnil standard toho, co se od středového lajnaře ve hře očekává, a třikrát pozvedl nad hlavu Vyvolávačův pohár z mistrovství světa: poprvé roku 2013, poté roku 2015 a potřetí roku 2016. Také se svým týmem získal trofeje z Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 a Mid-Season Invitational 2016 (uf). Poté, co roku 2016 vyhrál všechny mezinárodní turnaje League of Legends, se Faker zúčastní i All-Star 2016 v Barceloně jako absolutní král Žlebu. Jeho bohatá kariéra skvěle odolává zkoušce času a letošní All-Star bude dalším z mnoha úspěchů na jeho kontě. Opět je na čase, abychom byli svědky toho, jak se píše historie.</p>","el_GR":"<p>Ο Sanghyeok \"Faker\" Lee είναι ένας από τους πιο εμβληματικούς παίκτες στα σύγχρονα esports. Στην πατρίδα του, τη Νότια Κορέα, είναι γνωστός ως «Ο Βασιλιάς των Δαιμόνων», αλλά η συγκρατημένη και ευγενική συμπεριφορά δεν προδίδει καθόλου την ηγετική του παρουσία στο Φαράγγι των Επικαλεστών. Όταν όμως ανεβαίνει στη σκηνή, δεν είναι λίγες οι φορές που μας έχει αφήσει με το στόμα ανοιχτό. Απλά δεν πιστεύεις ότι γίνονται αυτά με ποντίκι και πληκτρολόγιο. Ο Faker ήταν τόσο εκτός συναγωνισμού στην Κορέα, για τόσο μεγάλο χρονικό διάστημα που οι αντίπαλοί του άρχισαν να λένε ότι είχε και 3ο Ξόρκι Επικαλεστή. Πώς αλλιώς θα μπορούσε να είναι τόσο ανίκητος;</p>\n\n<p>Ο Faker έχει ήδη θέσει ψηλά τον πήχη όσον αφορά τις προσδοκίες που μπορεί να έχει μια ομάδα από έναν παίκτη μεσαίας λωρίδας. Έχει ήδη σηκώσει το Κύπελλο του Επικαλεστή σε τρία Παγκόσμια Πρωταθλήματα, πρώτη φορά το 2013, μετά πάλι το 2015 και για τρίτη φορά το 2016. Επίσης, έχει οδηγήσει την ομάδα του στην κατάκτηση τροπαίων στα τουρνουά Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 και στο Mid-Season Invitational 2016 (ουφ!). Αφού κέρδισε όλα τα διεθνή τουρνουά του League of Legends για το 2016, ο Faker έρχεται στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη με τον αέρα του αδιαμφισβήτητου κυρίαρχου του παιχνιδιού. Η λαμπρή καριέρα του δεν δείχνει σημάδια κόπωσης και αυτό το Τουρνουά All-Star θα είναι άλλη μια επιτυχία που μπορεί να προσθέσει στο ήδη απίστευτο ενεργητικό του. Είναι έτοιμος να γράψει ιστορία, για ακόμη μια φορά.</p>\n","hu_HU":"Sanghyeok „Faker” Lee a modern e-sport egyik ikonja. A szülőhazájában, Dél-Koreában „Démonkirályként” emlegetett Faker élőben csendes és tisztelettudó ember, de a Szurdokban egészen más arcát mutatja. Teljesen újraírta az elvárásokat azzal kapcsolatban, hogy mit lehet megtenni egy egérrel és egy billentyűzettel. Fakerrel nem bírtak el Koreában, olyannyira, hogy egyesek szerint van egy harmadik idézői varázslata. Máskülönben hogy lehetne ennyire erős?</p>\n\nFaker eleve magasabbra tette a lécet minden középső ösvényes számára, három világbajnokságon emelhette magasba az Idézők Kupáját, 2013-ban, majd 2015-ben és 2016-ban. Ezenkívül a következő trófeákat zsebelte be: Champions 2013-os nyári szakasz, Champions 2013-2014-es téli szakasz, Champions 2015-ös tavaszi szakasz, Champions 2015-ös nyári szakasz, Champions 2016-os tavaszi szakasz, és a 2016-os szezonközi meghívásos verseny (végig se lehet mondani egy levegővel). Faker 2016-ban megnyert minden League of Legends-versenyt, és Barcelonában a Szurdok egyértelmű királyaként lép a 2016-os All-Star gála színpadára. Játéktudásán nem fog az idő vasfoga, és az All-Star gálán tovább gyarapíthatja győzelmeinek hosszú sorát. Bajnoki címből sosem lehet túl sok.\n\n","it_IT":"Sanghyeok \"Faker\" Lee è uno dei simboli degli eSport moderni. Faker, soprannominato \"Re demone\" nella sua natia Corea del Sud, ha un carattere taciturno e rispettoso che non fa minimamente trasparire la sua immensa abilità. Tuttavia, non appena sale sul palcoscenico è in grado di fare letteralmente l'impossibile con un mouse e una tastiera. Faker è rimasto imbattuto per così tanto tempo in Corea che i suoi avversari hanno iniziato a sospettare che avesse accesso a un terzo incantesimo dell'evocatore: come spiegare altrimenti la sua abilità?</p>\n\nFaker ha già scritto una nuova pagina nella storia dei centrali alzando la Coppa degli evocatori per ben tre volte, nel 2013, nel 2015 e poi nel 2016. Si è anche portato a casa parecchi trofei di squadra: Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e il Mid-Season Invitational 2016 (wow!). Dopo aver vinto tutti gli eventi internazionali organizzati da League of Legends nel 2016, Faker sale sul palco dell'All-Star 2016 a Barcellona come re indiscusso della Landa. La sua incredibile carriera resiste a ogni assalto del tempo e questo All-Star rappresenterà un'ulteriore voce da aggiungere alla sua impressionante lista di successi. Stiamo per assistere a un evento storico... di nuovo.\n","ru_RU":"","ro_RO":"Sanghyeok ''Faker'' Lee a devenit reprezentantul competiției de top în lumea eSports. În Coreea de Sud, acolo unde locuiește, este cunoscut ca ''Regele Demon'', iar atitudinea lui tăcută și respectuoasă când e întâlnit pe viu nu-i trădează deloc dominanța în Rift. Dar apoi, urcă pe scenă și distruge orice așteptare pe care am putea s-o avem de la cineva cu un mouse și o tastatură. Faker e atât de intangibil în Coreea de atât de multă vreme încât adversarii lui au început să spună că ar avea o a treia vrajă de invocator – cum altcumva ar putea fi atât de puternic?\n</p>\nFaker a ridicat deja standardele pentru jucătorii de pe culoarul de mijloc, ridicând Cupa Invocatorului la trei Campionate Mondiale, unul în 2013, altul în 2015, iar cel mai recent, în 2016. A reușit să obțină trofee pentru echipa lui și la Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 și Mid-Season Invitational 2016. După ce a câștigat toate evenimentele internaționale posibile de League of Legends din 2016, Faker vine pe scena All-Star Event 2016 din Barcelona ca rege necontestat al Riftului. Cariera sa impresionantă nu e deloc afectată de trecerea timpului, iar acest All-Star Event va putea fi o altă reușită pe care s-o adauge în palmaresul său deja terifiant. E momentul să asistăm din nou la scrierea istoriei.\n","es_MX":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>"},"foreignIds":{"drupalId":"692","ESPORTSTMNT06":"200000357","TRLH1":"200000410","TRLH2":"200000310","TRLT3":"200000208"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":327,"slug":"huni","name":"Huni","firstName":"Seung-hoon","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huni-3vra4c68.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-07-06T14:21:58.000Z","bios":{"en_US":"<p>\nSeung-hoon “Huni” Heo proved himself a dominant force in the NA LCS. He's heading to the LCK with some hard earned wisdom under his belt and a drive to prove he can compete with the best. He may look happy and harmless, but don’t underestimate him. Give him an inch, and he’ll take a quadrakill on Riven.\n</p>\n<p>\nHuni is one of the most confident players you'll find, but it’s hidden underneath a jolly layer. While his previous goal was to defeat the three-time World Champs, he's decided that if you can't beat them, join them.\n</p>","fr_FR":"Seung-hoon « Huni » Heo a prouvé être une force dominante des LCS NA. Cette saison, il est arrivé dans la LCK avec des connaissances durement acquises et la volonté de démontrer qu'il est à la hauteur des meilleurs. Il a l'air heureux et inoffensif, mais ne le sous-estimez pas. Cédez ne serait-ce que d'un pouce et il signera un quadruplé sur Riven.\n\nHuni est l'un des joueurs les plus confiants qui soient, mais il le cache bien sous son air jovial. Son objectif précédent était de vaincre les triples champions du monde, mais il s'est finalement dit, qu'à défaut de les battre, autant les rejoindre. Le Mid-Season Invitational 2017 est sa première opportunité de remporter un événement international avec sa nouvelle équipe et, s'il y parvient, ça risque d'être le début d'une longue série.\n","pl_PL":"<p>\"Huni\" jest nowością, która zaskoczyła całą społeczność League of Legends w sezonie piątym. Zaistniał na scenie dopiero po dołączeniu do dobrze wszystkim znanego zespołu Fnatic w styczniu 2015 roku. Jego wybór był szczęśliwym trafem dla europejskiej drużyny, gdyż wcześniej był tylko partnerem sparingowym dla profesjonalnych zawodników w koreańskiej organizacji Samsung. Czarno-żółci wiele zaryzykowali przyjmując debiutanta do podstawowego składu, lecz wkrótce okazało się to strzałem w dziesiątkę. Heo Seung-hoon, swoim agresywnym stylem gry, podniósł poprzeczkę pozostałym top-lanerom w Europie. W wiosennym sezonie członkowie Fnatic wciąż się poznawali, ale i tak konkurowali o czołową pozycję w EU LCS. Ostatecznie uplasowali się na drugim miejscu, tracąc tylko dwa zwycięstwa do przodującego SK Gaming. Jednak w rozgrywkach barażowych pokazali, że to właśnie oni zasługują na szczyt podium – pokonując wszystkich przeciwników na swojej drodze. \"Huni\" wśród innych graczy wyróżnił się w tak dużym stopniu, że został nagrodzony laurem najbardziej wartościowego zawodnika. Osiągnięcia poprawił w kolejnym sezonie, ponieważ w lecie pobił światowy rekord w regularnych rozgrywkach. Przez cały ten okres nie przegrał ani jednego meczu - takiego wyczynu nawet nie da się porównywać, ponieważ jest absolutnie unikalny.</p>\n<p> \nKiedy \"Huni\" dostał się do Mistrzostw Świata 2015 był już powszechnie znany i niesłychanie popularny. Jego występ na tej imprezie tylko przysporzył mu sławy, gdyż nie zawiódł swoich fanów i wyszedł z grupy na pierwszym miejscu. Zwycięstwem z potężnym zespołem EDG w ćwierćfinale przełamał wraz z Fnatic długą passę azjatyckich drużyn. Uległ dopiero w półfinale walcząc z KOO Tigers, koreańską potęgą, jednak te osiągnięcia dla europejskich kibiców były w pełni satysfakcjonujące. Po tym wydarzeniu w wywiadzie dla Redbulla powiedział: „Po Mistrzostwach byłem trochę skołowany, bo nie wiedziałem co dalej robić. Jednocześnie chciałem zdobyć nowe doświadczenie w Ameryce.” Tak \"Huni\" tłumaczył odejście z szeregów Fnatic w listopadzie 2015 roku i dołączenie miesiąc później do nowopowstałej wtedy organizacji Immortals. Później jeszcze wspomniał, że chciałby do kolekcji swoich osiągnięć dodać pierwsze miejsce w NA LCS.</p>\n<p>\n\"Huni\" to zdecydowanie najbardziej przebojowy gracz sezonu 5. Z zupełnie nieznanego nabytku Fnatic w ciągu mniej niż roku stał się jednym z najpopularniejszych zawodników. To zasługa jego rozśmieszającego stylu bycia i braku oporu przed wygłupianiem się na oczach tysięcy widzów. W przeciwieństwie do czasu wolnego, w trakcie meczy Heo Seung-hoon to śmiertelnie poważny przeciwnik. Zasłynął z wyborów agresywnych bohaterów na top-lanie i przez to bycia trzecim carry w zespole. Postaciami, takimi jak Ekko, Riven czy Rumble, wielokrotnie dominował przeciwników i zapierał dech w piersiach wszystkich widzów.\n</p>","de_DE":"Seung-hoon „Huni“ Heo mauserte sich zu einer dominanten Macht in der NA LCS. In dieser Saison wechselte er mit jeder Menge Erfahrung in die LCK, um allen zu beweisen, dass er mit den Besten der Welt mithalten kann. Er mag glücklich und harmlos aussehen, aber man darf ihn nie unterschätzen. Wenn man ihm mit Riven zu viel Platz lässt, ist er immer für eine Vierfachtötung gut.\n\nUnter seiner fröhlichen Fassade ist Huni einer der selbstbewusstesten Spieler, die es gibt. Früher wollte er den dreimaligen Weltmeister unbedingt besiegen, doch dann dachte er sich: „Wenn ich sie nicht besiegen kann, dann schließe ich mich ihnen eben an.“ Das Mid-Season Invitational 2017 ist seine erste Chance, mit seiner neuen Mannschaft einen internationalen Titel zu gewinnen, und wenn es nach ihm geht, wird das der erste von vielen.\n","es_ES":"Seung-hoon \"Huni\" Heo ha demostrado ser una fuerza dominante en la LCS NA. Esta temporada se ha trasladado a la LCK con toda la sabiduría que ha cosechado hasta ahora y viene decidido a demostrar que es capaz de competir contra los mejores. Que no os engañe su cara alegre de no haber matado ni a una mosca. Le basta un pequeño descuido para conseguir un asesinato cuádruple con Riven.\n\nHuni es uno de los jugadores más seguros de sí mismos, pero lo esconde bajo una capa de jovialidad. Aunque su meta anterior era vencer a los tres veces campeones del mundo, ha aplicado la lógica: si no puedes vencerlos, únete a ellos. El Mid-Season Invitational 2017 es su primera oportunidad para ganar un evento internacional con su nuevo equipo. Si se sale con la suya, este será el primer título de muchos.\n","pt_BR":"<p>Seung-hoon \"Huni\" Heo se provou ser uma força dominante na LCS NA. Ele vai para a LCK nesta temporada com uma nova lição arduamente aprendida e a vontade de provar que pode competir com os melhores. Ele pode parecer feliz e inofensivo, mas não o subestimem. Deem uma chance e ele conseguirá um quadrakill em Riven.</p>\n\n<p>Huni é um dos jogadores mais confiantes que você encontrará, mas esconde isso sob uma camada de alegria. Seu objetivo anterior era derrotar os tricampeões mundiais, mas ele decidiu que se você não pode vencê-los, é melhor juntar-se a eles. O Mid-Season Invitational 2017 é sua primeira chance de ganhar um evento internacional com sua nova equipe. E, se a sua vontade se concretizar, será o primeiro de muitos.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “Huni” 허승훈은 탑 라인에서 지배적인 존재입니다. 유럽 LCS에 비교적 최근에 합류한 Huni는 2015년 Fnatic 리빌딩 프로젝트의 일환으로 팀에 입단했습니다. 그의 영향은 즉시 나타났습니다. 2015 유럽 LCS 서머 스플릿에서 Fnatic을 18승 무패 기록으로 이끌었기 때문이죠. Huni는 2015 유럽 LCS 서머 스플릿에서 Outstanding Rookie 상을 수상하기도 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">소환사의 협곡 바깥에서도 Huni의 영향력이 나타났죠. 그가 만든 감탄사 “HoloHoloHolo\"는 누구라도 빠져들 수밖에 없고, 그의 장난스러운 마이크 체킹은 전설적입니다. Huni는 겉으로는 귀여워 보일지 모르지만 게임에서는 적을 깨부수는 데 거리낌이 없죠. Huni는 그의 자신감을 한줄로 이렇게 요약했습니다. \"저희에게 대적할 라이벌은 없습니다.\" 궁금해 하실까봐 말씀드리지만 저 말은 국제 경기까지 포함시킨 겁니다. 그리고 그는 이렇게 말했죠. \"SKT와 다시 한번 싸워서 박살내고 싶어요.\" </p>\n<p style=”font-family:”나눔고딕”;\">정말 대담한 친구죠. 2015 올스타전에서 과연 그가 라이벌들을 박살낼 수 있을지 지켜봅시다. </p>\n"},"foreignIds":{"drupalId":"3675","ESPORTSTMNT06":"200000354","TRLH1":"200000408","TRLH2":"200000308","TRLT3":"200000206"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":9},{"id":403,"slug":"bang","name":"Bang","firstName":"Junsik","lastName":"Bae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bang-5ln60860.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:04.000Z","bios":{"en_US":"<p>\nJunsik \"Bang\" Bae is an incredibly dedicated AD carry. Bang committed himself to a rigorous play schedule, and has the results to prove it -- he was the first Korean player to reach 1400 Challenger points in Solo Queue. But he isn’t just getting good at Solo Queue. When SKT T1 S secured 3rd place in the 2014 Summer OGN Champions League, Bang had officially arrived on the Korean esports scene. He went on to take 1st place at the 2015 World Championship with SKT, etching his name in LoL history.\n</p>\n<p>\nHe didn’t stop there, though, and like the rest of SK telecom, he struggled through the initial growing pains of roster changes in 2016 before winning the 2016 World Championship. The team adjusted quickly to its new roster this year, dominating the LCK Spring Split and taking victory at the 2017 Mid-Season Invitational in Brazil.\n</p>","fr_FR":"Junsik « Bang » Bae est un carry AD extrêmement impliqué. Bang s'est astreint de lui-même à un programme de jeu très strict, et ses résultats sont là pour lui donner raison : il a été le premier joueur coréen à atteindre les 1400 points en Challenger en file solo. Mais il ne se contente pas de briller en file solo. Quand SKT T1 S à décroché la troisième place dans la Ligue OGN Champions Summer 2014, Bang venait d'arriver officiellement sur la scène de l'e-sport coréen. Il a enchaîné avec une première place lors du Championnat du monde 2015 avec SKT, gravant pour toujours son nom dans l'histoire de LoL.\n\nIl ne s'est pourtant pas arrêté là, et comme le reste de SK Telecom, il a souffert des changements de formation en 2016 avant de remporter le Championnat du monde 2016. Cette année, l'équipe s'est rapidement adaptée à sa nouvelle formation, dominant sans mal le segment de printemps de la LCK. Ils vont maintenant tenter d'enregistrer leur premier victoire internationale de 2017 lors du Mid-Season Invitational au Brésil.\n","pl_PL":"Junsik „Bang” Bae jest niesamowicie zaciętym prowadzącym. Bang narzucił sobie bardzo rygorystyczny harmonogram rozgrywek, czego rezultaty są widoczne — był pierwszym koreańskim zawodnikiem, który osiągnął 1400 punktów Pretendenta w kolejce solo. Ale staje się coraz lepszy nie tylko w kolejce solo. Gdy SKT T1 S zdobyli trzecie miejsce w Summer OGN Champions League 2014, Bang oficjalnie pojawił się na koreańskiej scenie e-sportowej. Zdobył wraz z SKT pierwsze miejsce na Mistrzostwach Świata 2015, zapisując swoje imię w historii LoL.\n\nJednak nie zamierzał na tym poprzestać, dlatego podobnie jak reszta SK Telecom musiał przebrnąć przez trudne zmiany w składzie w 2016 roku, zanim drużyna zwyciężyła na Mistrzostwach Świata 2016. Drużyna szybko dostosowała się do tegorocznego, nowego składu, dominując podczas wiosennego splitu LCK. Teraz będzie chciała zdobyć swoje pierwsze międzynarodowe zwycięstwo w 2017 roku na Mid-Season Invitational w Brazylii.\n","de_DE":"Junsik „Bang“ Bae ist ein unglaublich engagierter AD-Carry. Bang unterwarf sich einem sehr strikten Spielplan und hat als Folge dessen auch Resultate vorzuweisen – er war der erste koreanische Spieler, der jemals 1400 Challenger-Punkte in der Einzelwarteschlange erreicht hat. Aber natürlich ist er nicht nur als Einzelspieler überragend. Als SKT T1 sich den dritten Platz beim OGN Champions im Sommer 2014 sicherten, war Bangs Debut in der Esports-Szene offiziell. Kurz danach gewann er zusammen mit seinem Team SKT die Weltmeisterschaft 2015 und verewigte seinen Namen in der Geschichte von LoL.\n\nAber damit war noch lange nicht Schluss, und genau wie der Rest von SK Telecom hatte er zu Beginn des Jahres 2016 Probleme mit den Änderungen der Aufstellung, bevor er schließlich die Weltmeisterschaft 2016 gewann. In diesem Jahr konnte sich die Mannschaft schnell auf die neue Aufstellung einstellen und den Frühjahrs-Split der LCK dominieren. Jetzt werden sie beim Mid-Season Invitational in Brasilien versuchen, sich den ersten internationalen Titel im Jahr 2017 zu sichern.\n","es_ES":"Junsik ''Bang'' Bae es un AD carry con una dedicación admirable. Su riguroso programa de entrenamiento ha demostrado su eficacia: es el primer jugador coreano en alcanzar los 1400 puntos en la cola en solitario. Y eso no es lo único que se le da bien. Cuando SKT T1 consiguió el tercer puesto en la OGN Champions League de verano de 2014, Bang ya había llegado al panorama coreano de los esports. Junto al resto de miembros de su equipo, contribuyó al triunfo de SKT en el Campeonato Mundial 2015 y su nombre pasó a la historia de League.\n\nLejos de quedarse ahí, luchó junto a SK telecom para superar el mal trago inicial de 2016 causado por el ajuste de plantilla, justo antes de ganar el Campeonato Mundial de 2016. El equipo se ha adaptado rápidamente a su plantilla este año y ha dominado el split de primavera de la LCK. Ahora intentará conseguir su primera victoria internacional de 2017 en el Mid-Season Invitational en Brasil.\n","pt_BR":"<p>Junsik \"Bang\" Bae é um carregadorregador incrivelmente dedicado. Bang se comprometeu a um treinamento rigoroso e tem os resultados para provar: foi o primeiro jogador coreano a alcançar 1400 pontos no nível Desafiante na fila solo. Mas ele não é bom só na fila solo. Quando a SKT T1 conseguiu o 3º lugar na Summer OGN Champions League 2014, Bang fez sua entrada oficial para o cenário coreano de e-Sports. Ele então continuou sua jornada e alcançou o 1º lugar no Campeonato Mundial 2015 com a SKT, gravando seu nome na história do League of Legends.</p>\n\n<p>Mas ele não parou por aí e, assim como o resto da SK Telecom, ele teve dificuldades em se adaptar às mudanças constantes de escalação antes de vencer o Campeonato Mundial 2016. A equipe se ajustou rapidamente à sua nova composição neste ano, dominando a Etapa de Primavera da LCK. Agora eles querem que sua primeira vitória internacional de 2017 seja no Mid-Season Invitational no Brasil.\n</p>","es_AR":"<p>Jun-sik \"Bang\" Bae es un ADC totalmente aplicado. Bang se comprometió a cumplir un riguroso programa de juego, y los resultados lo demuestran. Fue el primer jugador coreano en alcanzar 1400 puntos de Challenger en la cola individual. Pero no es solo en la cola individual donde está mejorando. Cuando SKT T1 S se aseguró el tercer lugar en la OGN Champions League de verano del 2014, Bang quedó oficialmente instalado en la escena de esports coreana. Llegó al primer lugar en el Campeonato Mundial 2015 con SKT, y grabó su nombre en la historia de LoL.</p>\n\n<p>Pero no se detuvo allí y, como el resto de los miembros de SKTelecom, pasó por los insoportables cambios de plantel en el 2016. Después de recibir otro título de LCK en el torneo de apertura del 2016, Bang y SKTelecom fueron derrotados durante el comienzo del torneo de clausura, lo que dejó boquiabiertos a los simpatizantes de todo el mundo. Bang tomará la pérdida como combustible para su fuego competitivo y sabe que solo hace falta una pequeña chispa para hacer que SKTelecom vuelva a tener el dominio del Campeonato Mundial 2016.</p>"},"foreignIds":{"drupalId":"881","ESPORTSTMNT06":"200000358","TRLH1":"200000411","TRLH2":"200000311","TRLT3":"200000209"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":404,"slug":"wolf","name":"Wolf","firstName":"Jaewan","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolf-82h5ft4p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:22.000Z","bios":{"en_US":"<p>Jaewan \"Wolf\" Lee is a dedicated communicator and practices constantly with his duo partner Bang. Their bond in the bot lane has proven itself, as Wolf achieved one of the highest KDAs in the 2015 LCK Summer Split. His chemistry with Bang led SK Telecom to become world champions in 2015 after they rampaged through the entire tournament nearly unbeaten.</p>\n\n<p>In 2016, the chemistry seemed to have waned as Bang and Wolf struggled along with the entirety of SKT, but after MSI their trademark chemistry was back with a vengeance. Even though SKT came up short in the Summer Split playoffs, Wolf and Bang showed up huge at the 2016 World Championship and again at the 2017 Mid-Season Invitational. Next up? Worlds.</p>","fr_FR":"Jaewan « Wolf » Lee est un excellent communiquant qui s'entraîne constamment avec son partenaire Bang. Leur lien sur la voie du bas a fait ses preuves : Wolf a enregistré l'un des plus hauts KDA du segment d'été des LCK 2015. L'alchimie entre Bang et lui a permis à SK Telecom de devenir championne du monde en 2015 après avoir fait des ravages durant tout le tournoi, presque sans subir la moindre défaite.\n\nEn 2016, cette synergie semble s'être dégradée : Bang et Wolf ont eu un peu de mal, comme l'ensemble de leur équipe, mais après le tournoi MSI, leur alchimie légendaire était de retour en beauté. Bien que SKT ait manqué de peu les play-offs du segment d'été, Wolf et Bang ont fait des étincelles au Championnat du monde 2016. À présent, ils se préparent à participer au Mid-Season Invitational 2017 et convoitent leur deuxième titre du MSI.\n","pl_PL":"Jaewan „Wolf” Lee ma świetne umiejętności komunikacyjne i nieustannie ćwiczy ze swoim partnerem z duetu, Bangiem. Ich zgrania na dolnej alei dowodzi fakt, że Wolf zdobył jeden z najwyższych wyników Z/Z/A podczas letniego splitu LCK 2015. Świetna chemia między nim a Bangiem doprowadziła SK Telecom do zdobycia mistrzostwa świata w 2015 roku, po przebiciu się przez cały turniej niemal bez porażki.\n\nW 2016 roku ta chemia jakby uleciała, gdy Bang i Wolf borykali się z problemami, które dotknęły całego SKT, ale po MSI ich charakterystyczne zgranie się powróciło jeszcze bardziej wzmocnione. Chociaż SKT odpadli w fazie pucharowej letniego splitu, Wolf i Bang pokazali się ze świetnej strony na Mistrzostwach Świata 2016. Teraz zmierzają na Mid-Season Invitational 2017, mając oko na drugi tytuł na MSI.\n","de_DE":"Jaewan „Wolf“ Lee ist ein engagierter Kommunikator und ständig damit beschäftigt, sich mit seinem Duo-Partner Bang zu verbessern. Ihre Verbindung ist stark und ihr Erfolg auf der unteren Lane spiegelt sich deutlich in Wolfs TTUs im Sommer-Split der LCK 2015 wider. Seine gute Harmonie mit Bang führte SK Telecom zum Sieg bei der Weltmeisterschaft 2015, nachdem sie im ganzen Turnier nahezu ungeschlagen geblieben waren.\n\n2016 war es mit der Harmonie plötzlich vorbei, als Bang und Wolf, genau wie der Rest der Mannschaft, große Probleme hatten. Aber nach dem MSI war ihre Harmonie wieder zurück. Obwohl SKT in den Entscheidungsspielen des Sommer-Splits scheiterte, konnten Wolf und Bang der Weltmeisterschaft 2016 ihren Stempel aufdrücken. Jetzt sind sie zum Mid-Season Invitational 2017 unterwegs, wo sie ihren zweiten MSI-Titel gewinnen wollen.\n","es_ES":"Jaewan ''Wolf'' destaca por lo bien que se comunica, y practica constantemente con su compañero de la calle inferior, Bang. Este dúo ya ha demostrado su valía, ya que Wolf consiguió uno de los marcadores A/M/A más altos del split de verano de la LCK 2015. Su química con Bang contribuyó en gran medida a que SK telecom se proclamase campeón del mundo en 2015, pues en su paso por el campeonato casi terminan invictos.\n\nEn 2016, su química comenzó a decaer cuando Bang y Wolf experimentaron los mismos problemas que el resto del equipo, pero con la victoria en el MSI todo volvió a la normalidad. Aunque SKT no dio la talla en los playoffs del split de verano, Wolf y Bang se mostraron como un potente dúo en el Campeonato Mundial de 2016. Ahora se dirigen al Mid-Season Invitational 2017 con esperanzas de obtener su segundo título del MSI.\n","pt_BR":"<p>Jaewan \"Wolf” Lee é um comunicador dedicado e pratica constantemente com seu parceiro de rota, Bang. Sua sintonia na rota inferior já provou o que tinha que provar quando Wolf alcançou um dos AMAs mais altos da Etapa de Verão da LCK 2015. Sua química com Bang levou a SK Telecom a se tornar a campeã mundial em 2015 depois de destruírem no torneio, saindo praticamente invictos.</p>\n\n<p>Em 2016, essa química parecia ter sumido quando Bang e Wolf passaram por muitas dificuldades, juntamente com toda a SKT. Mas, depois do MSI, sua tão famosa sintonia voltou com tudo. Mesmo a SKT tendo decepcionado nas eliminatórias da Etapa de Verão, Wolf e Bang impressionaram no Campeonato Mundial 2016. Agora, eles vão para o Mid-Season Invitational 2017 de olho no seu segundo título MSI.\n</p>","es_AR":"<p>Jae-wan \"Wolf\" se destaca por su dedicación a las comunicaciones y practica constantemente con su dupla Bang. Su vínculo en el carril inferior se ha mostrado fuerte, y Wolf logró uno de los más altos KDA en el torneo de clausura de la LCK 2015. Su química con Bang hizo que SKTelecom se convirtiera en campeón mundial en el 2015 luego de arrasar durante todo el torneo sin derrotas.</p>\n\n<p>En el 2016, la química pareció menguar un poco, ya que Bang y Wolf pasaron una mala racha junto a SKTelecom, pero luego de la MSI, su complementación volvió a ser la misma y estuvo cargada de venganza. Aunque SKTelecom quedó afuera rápido de las eliminatorias del torneo de clausura, Wolf y Bang siguen siendo una impresionante dupla de carrileros inferiores. Está por llegar al Mundial como uno de los soportes más temibles del planeta. Si alguien quiere meterse con Bang, tendrá que pasar por una pesadilla al cruzarse con Wolf.</p>"},"foreignIds":{"drupalId":"882","ESPORTSTMNT06":"200000435","TRLH1":"200000412","TRLH2":"200000312","TRLT3":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":715,"slug":"peanut","name":"Peanut","firstName":"Wangho","lastName":"Han","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/peanut-izmrqd1y.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:15:00.000Z","bios":{"en_US":"<p>\nWangho “Peanut” Han is the most aggressive jungler in Korea - bar none. He is a master of controlled mayhem who routinely takes over games single-handedly. After getting his professional start with the thoroughly underwhelming NaJin e-mFire, Peanut made his way to the ROX Tigers in 2016.\n</p>\n<p>\nPeanut melds chaos and calm in a way seldom seen on the Rift. One moment he’s systematically stealing the enemy’s jungle and the next he’s diving headfirst into a tower to clean up a double kill. It’s this unpredictability that sets Peanut apart from other elite level junglers. After losing a close battle to SK telecom T1 at the 2016 World Championship, Peanut joined the team that sent him packing. He earned his first international title with his new team at the 2017 Mid-Season Invitational; now, his sights are set on Worlds.\n</p>","de_DE":"Wangho „Peanut“ Han ist zweifellos der aggressivste Jungler in Korea. Er ist ein Meister des kontrollierten Chaos und kann Spiele alleine entscheiden. Nachdem seine Karriere bei den sehr enttäuschenden NaJin e-mFire begonnen hatte, wechselte Peanut im Jahr 2016 zu den ROX Tigers.\n\nPeanut vereint Chaos und Ruhe, wie man es in der Kluft nur selten sieht. In einem Moment grast er systematisch den gegnerischen Dschungel ab und im nächsten stürmt er kopfüber zu einem Turm, um eine Doppeltötung einzufahren. Es ist diese Unberechenbarkeit, die Peanut von den anderen Junglern auf diesem Niveau unterscheidet. Nachdem er sich bei der Weltmeisterschaft 2016 SK Telecom T1 knapp geschlagen geben musste, wechselte Peanut zu der Mannschaft, die ihn nach Hause geschickt hatte. Jetzt wird er beim Mid-Season Invitational 2017 versuchen, mit seiner neuen Mannschaft seinen ersten internationalen Titel zu gewinnen.\n","es_AR":"<p>Wang-ho \"Peanut\" Yun es, sin la menor duda, el junglero más agresivo de Corea. Es experto en generar un caos controlado que casi siempre le permite tener el dominio de las partidas en sus propias manos. Después de hacer su debut profesional con el absolutamente abrumador equipo NaJin e-mFire, Peanut pasó a formar parte de ROX Tigers a comienzos de año y no ha vuelto la vista atrás desde entonces.</p>\n\n<p>Peanut combina caos y calma de una forma pocas veces vista en la Grieta. En un momento se encuentra robando de forma sistemática la jungla del enemigo, y al siguiente se lanza de cabeza a una torre pera ejecutar un asesinato doble. Es el componente sorpresa lo que hace que Peanut se destaque de otros jungleros de élite. Era la última pieza que faltaba en ROX Tigers, y su juego ayudó a catapultar el equipo al estrellato internacional. Peanut y compañía son grandes favoritos para el Campeonato Mundial 2016, y hay solo una cosa para decir a los equipos que se crucen en su camino: buena suerte.</p>","es_ES":"Wangho ''Peanut'' Han es el jungla más agresivo de Corea. Es un maestro del caos controlado y suele dominar en solitario las partidas. Tras comenzar profesionalmente con el decepcionante NaJin e-mFire, se unió a ROX Tigers en 2016.\n\nPeanut combina el caos y la calma de una forma que rara vez se ha visto en la Grieta. Un segundo está robando de forma sistemática la jungla enemiga, y al siguiente se está lanzando de cabeza bajo la torre para conseguir un asesinato doble. Que sea tan impredecible es lo que lo hace destacar frente a otros junglas de élite. Tras perder una disputada batalla contra SK telecom T1 en el Campeonato Mundial de 2016, Peanut se unió al equipo que lo mandó a casa. Ahora, intentará ganar su primer título internacional con su nuevo equipo en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Wangho \"Peanut\" Han é o caçador mais agressivo da Coreia, ponto. Ele é um mestre em controlar o caos que frequentemente causa nos seus jogos. Depois de ter sua estreia no cenário profissional com a decepcionante NaJin e-mFire, Peanut encontrou seu caminho na ROX Tigers em 2016.</p>\n\n<p>Peanut consegue juntar caos e tranquilidade de uma forma raramente vista no Rift. Em um momento ele pode estar roubando sistematicamente a selva do inimigo e no outro, mergulhando de cabeça em uma torre para pegar um abate duplo. É essa imprevisibilidade que diferencia Peanut dos outros caçadores de elite. Depois de perder uma batalha acirrada para a SK Telecom T1 no Campeonato Mundial 2016, Peanut entrou para a equipe que o fez fazer as malas. Agora, ele tentará ganhar seu primeiro título internacional com sua nova equipe no Mid-Season Invitational 2017.\n</p>","pl_PL":"Wangho „Peanut” Han jest najagresywniejszym dżunglerem w Korei — bezdyskusyjnie. To mistrz kontrolowanego chaosu, który regularnie zdobywa zwycięstwa w meczach praktycznie na własną rękę. Po swoim profesjonalnym starcie w bardzo przeciętnym NaJin e-mFire Peanut przeniósł się na początku 2016 roku do ROX Tigers.\n\nPeanut łączy chaos i opanowanie w sposób rzadko widywany na Summoner’s Rift. W jednej chwili systematycznie wykrada dżunglę przeciwnikowi, a w następnej szturmuje wieżę, by zgarnąć podwójne zabójstwo. To ta nieprzewidywalność odróżnia Peanuta od pozostałych elitarnych dżunglerów. Po przegraniu zaciekłej bitwy z SK Telecom T1 na Mistrzostwach Świata 2016 Peanut dołączył do drużyny, która była przyczyną jego porażki. Teraz ze swoją nową drużyną zamierza zdobyć swój pierwszy międzynarodowy tytuł na Mid-Season Invitational 2017.\n","fr_FR":"Wangho « Peanut » Han est le jungler le plus agressif de Corée, sans exception. Il est passé maître dans l'art du chaos contrôlé, et a pour habitude de dominer les matchs seul. Suite à des débuts professionnels avec les très décevants NaJin e-mFire, Peanut a rejoint les ROX Tigers en 2016.\n\nPeanut mélange chaos et calme d'une façon rarement vue sur la Faille. Un moment, il vole systématiquement la jungle ennemie et l'instant d'après, il fonce tête la première sous une tour pour réaliser un doublé. C'est son caractère imprévisible qui distingue Peanut des autres junglers d'élite. Après avoir perdu un combat serré contre SK Telecom T1 lors du Championnat du monde 2016, Peanut a finalement rejoint l'équipe qui l'avait disqualifié. Il va maintenant tenter de remporter son premier titre international avec sa nouvelle équipe au Mid-Season Invitational 2017.\n"},"foreignIds":{"drupalId":"4062","TRLH1":"200000409","TRLH2":"200000309","ESPORTSTMNT06":"200000355","TRLT3":"200000207"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1025,"slug":"untara","name":"Untara","firstName":"Ui-jin","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/untara-72qfuy9u.png","hometown":"Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:02:38.000Z","updatedAt":"2017-05-31T00:54:38.000Z","bios":{},"foreignIds":{"TRKR1":"225031","ESPORTSTMNT06":"200000353"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1026,"slug":"sky","name":"Sky","firstName":"Haneul","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sky-2m0pzkna.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:03:37.000Z","updatedAt":"2017-05-31T00:49:05.000Z","bios":{},"foreignIds":{"TRKR1":"225033","ESPORTSTMNT06":"200000356"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1033,"slug":"blank","name":"Blank","firstName":"Sungu","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blank-7ie205tv.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:19.000Z","updatedAt":"2017-07-06T14:24:22.000Z","bios":{"en_US":"<p>Sungu “Blank” Kang started his career in China in late 2014. After being relegated from the LPL as a member of Star Horn Royal Club, Blank left the team to join SK telecom T1 in late 2015. He didn’t exactly impress with his first few games in the LCK, but when the team took him to IEM he excelled, and the team finished the tournament unbeaten. Just like that, Blank added his first trophy to his resume.</p>\n\n<p>His performances seem to be consistently improving, and SKT opted to keep playing him over the struggling veteran, Bengi. In his first split as an LCK jungler, he took first in Champions Spring, yet in the Summer Split it was clear that he was still learning how to control vision across the map. He took a back seat to Bengi during SKT's third World Championship run. While Bengi has departed, now Blank has to compete with superstar jungler Peanut for playing time.</p>","es_AR":"<p>Sun-gu \"Blank\" Kang inició su carrera en China a finales del 2014. Después de sufrir un descenso de la LPL como miembro de Star Horn Royal Club, Blank se fue del equipo para unirse a SKTelecom a finales del 2015. No tuvo una actuación muy impresionante en sus primeras partidas en la LCK, pero cuando el equipo lo llevó a la EIM, se destacó y su grupo acabó el torneo invicto. De esta forma, Blank agregó el primer trofeo a su historial.</p>\n\n<p>Sus actuaciones parecen mejorar constantemente, y SKTelecom optó por seguir jugando con él en lugar del veterano Bengi, quien no está teniendo una buena racha. En su primer torneo como junglero de la LCK, salió primero en la Champions Spring, pero en el torneo de clausura quedó claro que aún debía aprender a controlar la visión del mapa. Como resultado, SKTelecom no tuvo unas buenas eliminatorias, y cayó en la semifinal. Blank deberá refinar su control del mapa si quiere que SKTelecom tenga una buena actuación que le permita ganar el trofeo del Campeonato Mundial.</p>","fr_FR":"Sungu « Blank » Kang a débuté sa carrière en Chine fin 2014. Après avoir été relégué des LPL en tant que membre de Star Horn Royal Club, Blank a quitté l'équipe pour rejoindre SK Telecom T1 à la fin de l'année 2015. Il ne s'est pas exactement montré impressionnant lors de ses premiers matchs des LCK, mais quand l'équipe l'a emmené avec elle à l'IEM, il a révélé tout son talent et SKT a terminé le tournoi invaincue. Aussi simplement que ça, Blank a ajouté son premier trophée à son C.V.\n\nSes performances semblent s'améliorer régulièrement, aussi SKT a préféré le conserver en lieu et place de leur vétéran quelque peu affaibli, Bengi. Lors de son premier segment en tant que jungler au sein des LCK, il a remporté sa première victoire au tournoi Champions Spring. Mais lors du segment d'été il était clair qu'il apprenait encore à contrôler sa vision de l'ensemble de la carte. Il s'est ensuite effacé au profit de Bengi au cours du troisième Championnat du monde de SKT. Mais suite au départ de Bengi, c'est maintenant à Blank de se disputer du temps de jeu avec le jungler vedette qu'est Peanut\n","es_ES":"Sungu ''Blank'' Kang comenzó su carrera en China a finales de 2014. Tras ser relegado de la LPL como miembro de Star Horn Royal Club, Blank dejó el equipo y se unió a SK telecom T1 a finales de 2015. Sus primeras partidas en la LCK no fueron impresionantes, pero su actuación en el IEM fue excelente y el equipo terminó el torneo invicto. Y así fue como Blank añadió el primer trofeo a su currículum.\n\nSu rendimiento no dejaba de mejorar, así que SKT optó por darle prioridad frente al veterano Bengi. En su primer split como jungla de la LCK obtuvo el primer puesto en el Champions Spring, pero en el split de verano fue evidente que todavía estaba aprendiendo a controlar la visión del mapa. En el tercer Campeonato Mundial de SKT, Blank tuvo que ser suplente de Bengi. Ahora que Bengi se ha marchado del equipo, Blank tendrá que competir contra Peanut, el jungla superestrella, para ganarse tiempo de juego.\n","de_DE":"Sungu „Blank“ Kang begann seine Karriere Ende 2014 in China. Nachdem er mit dem Star Horn Royal Club aus der LPL abgestiegen war, verließ er die Mannschaft und wechselte Ende 2015 zu SK Telecom T1. In den ersten paar Spielen in der LCK konnte er nicht wirklich überzeugen, aber beim IEM lieferte er eine überragende Vorstellung ab und half seiner Mannschaft, das Turnier ungeschlagen zu beenden. Und mir nichts, dir nichts konnte Blank seine erste Trophäe in die Höhe stemmen.\n\nSeine Leistung scheint immer besser zu werden und SKT entschied sich, ihn dem erfahrenen Bengi vorzuziehen. In seinem ersten Split als LCK-Jungler holte er sich den ersten Platz beim Champions Spring, doch beim Sommer-Split wurde klar, dass er immer noch lernen musste, wie man die Sicht auf der Karte sicherstellt. Bei der Weltmeisterschaft musste er jedoch Bengi den Vortritt lassen. Seit dem Abgang von Bengi muss Blank mit dem Superstar im Dschungel, Peanut, um Spielzeit kämpfen.\n","pl_PL":"Kariera Sungu „Blank” Kanga zaczęła się w Chinach pod koniec 2014 roku. Po relegowaniu z LPL wraz ze wszystkimi pozostałymi członkami Star Horn Royal Club Bank opuścił drużynę, aby pod koniec 2015 roku dołączyć do SK Telecom T1. Nie zaimponował specjalnie podczas swoich pierwszych meczów w LCK, ale gdy drużyna zabrała go na IEM, pokazał, na co go stać i zespół wygrał turniej bez porażki. W ten sposób Blank dodał do swojego resume pierwsze trofeum.\n\nJego występy wydają się coraz lepsze i SKT postanowili zatrzymać go w składzie w miejsce zmagającego się z problemami weterana, Bengiego. Podczas swojego pierwszego splitu w roli dżunglera w LCK Blank zajął pierwsze miejsce w Champions Spring, jednak w toku letniego splitu stało się jasne, że wciąż uczy się kontroli wizji na całej mapie. Ustąpił miejsca Bengiemu podczas trzeciego podejścia SKT do Mistrzostw Świata. Odkąd Bengi odszedł, Blank musi rywalizować o udział w grze z supergwiazdą, dżunglerem Peanutem.\n","pt_BR":"<p>Sungu \"Blank\" Kang iniciou sua carreira na China no fim de 2014. Depois de ser rebaixado na LPL quando ainda era um membro da Star Horn Royal Club, Blank saiu da equipe e entrou para a SK Telecom T1 no final de 2015. Ele não impressionou muito com seus primeiros jogos na LCK, mas quando sua equipe o levou para a IEM, ele se destacou e a equipe terminou o torneio invicta. E simples assim, Blank acrescentou seu primeiro troféu em seu currículo.</p>\n\n<p>Seu desempenho parecia estar melhorando consistentemente, então a SKT optou por continuar jogando com ele em vez do veterano, Bengi, que parecia estar com dificuldades. Em sua primeira Etapa como caçador na LCK, ele ficou em primeiro lugar na Champions de Primavera, mas ficou claro na Etapa de Verão de que ele ainda precisava melhorar seu controle de visão do mapa. Ele ficou na reserva do Bengi durante o terceiro Campeonato Mundial da SKT. Agora que Bengi saiu da equipe, Blank precisa competir com o caçador estrela Peanut para jogar.\n</p>"},"foreignIds":{"ESPORTSTMNT06":"200000434","TRLH1":"200000413","TRLH2":"200000313","TRLT3":"200000211"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84}],"scheduleItems":[{"id":"AVdEmZnUoUG4HPFjOKDi","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:b0722c8b-058c-4804-b7c4-0890efa65c4d","scheduledTime":"2016-10-14T22:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"Quarterfinals","subBlockLabel":"2","blockPrefix":"","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:7b2625b8-6adb-447a-9c94-8f58f8e37bd0"},"match":"b0722c8b-058c-4804-b7c4-0890efa65c4d","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"7b2625b8-6adb-447a-9c94-8f58f8e37bd0","league":"9"}],"gameIdMappings":[{"id":"e3326688-9fc3-40f7-a57f-99e50c911967","gameHash":"fe20318c0aa998da"},{"id":"f8459520-5938-46d7-8cac-bbdfbe832dfa","gameHash":"52804c309296e5ff"},{"id":"b5b6a83f-5709-4995-beaf-342ac8c29d9f","gameHash":"6f36815328686158"},{"id":"2b15bcb7-926f-4c43-981d-934eb020e33e","gameHash":"694d58c8429d1cc6"}],"videos":[{"id":4699,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:b5b6a83f-5709-4995-beaf-342ac8c29d9f","source":"https://www.youtube.com/embed/LaOsXrBYUO0?wmode=transparent","createdAt":"2016-10-15T01:10:22.000Z","updatedAt":"2016-10-15T01:10:22.000Z","game":"b5b6a83f-5709-4995-beaf-342ac8c29d9f"},{"id":4700,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:b5b6a83f-5709-4995-beaf-342ac8c29d9f","source":"https://www.youtube.com/embed/oAwHaM-iF0s","createdAt":"2016-10-15T01:31:43.000Z","updatedAt":"2016-10-15T01:31:43.000Z","game":"b5b6a83f-5709-4995-beaf-342ac8c29d9f"},{"id":4701,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:2b15bcb7-926f-4c43-981d-934eb020e33e","source":"https://www.youtube.com/embed/zab9-xrvEM8","createdAt":"2016-10-15T01:33:30.000Z","updatedAt":"2016-10-15T01:33:30.000Z","game":"2b15bcb7-926f-4c43-981d-934eb020e33e"},{"id":4702,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:f8459520-5938-46d7-8cac-bbdfbe832dfa","source":"https://www.youtube.com/embed/9nc2NjInY5M","createdAt":"2016-10-15T01:43:00.000Z","updatedAt":"2016-10-15T01:43:00.000Z","game":"f8459520-5938-46d7-8cac-bbdfbe832dfa"},{"id":4703,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:2b15bcb7-926f-4c43-981d-934eb020e33e","source":"https://www.youtube.com/embed/Ood5YbxEyXs?wmode=transparent","createdAt":"2016-10-15T02:04:37.000Z","updatedAt":"2016-10-15T02:04:37.000Z","game":"2b15bcb7-926f-4c43-981d-934eb020e33e"},{"id":4704,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:f8459520-5938-46d7-8cac-bbdfbe832dfa","source":"https://www.youtube.com/embed/OZbJOxq_Tss?wmode=transparent","createdAt":"2016-10-15T02:31:54.000Z","updatedAt":"2016-10-15T02:31:54.000Z","game":"f8459520-5938-46d7-8cac-bbdfbe832dfa"},{"id":4705,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:e3326688-9fc3-40f7-a57f-99e50c911967","source":"https://www.youtube.com/embed/5420HgdRDEc","createdAt":"2016-10-15T02:44:32.000Z","updatedAt":"2016-10-15T02:44:32.000Z","game":"e3326688-9fc3-40f7-a57f-99e50c911967"},{"id":4706,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:e3326688-9fc3-40f7-a57f-99e50c911967","source":"https://www.youtube.com/embed/-NrkFhSCspY?wmode=transparent","createdAt":"2016-10-15T03:48:02.000Z","updatedAt":"2016-10-15T03:48:02.000Z","game":"e3326688-9fc3-40f7-a57f-99e50c911967"},{"id":4707,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:b5b6a83f-5709-4995-beaf-342ac8c29d9f","source":"https://www.youtube.com/watch?v=5zSeOoOSm2o?wmode=transparent","createdAt":"2016-10-15T22:02:10.000Z","updatedAt":"2016-10-15T22:02:10.000Z","game":"b5b6a83f-5709-4995-beaf-342ac8c29d9f"},{"id":4708,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:2b15bcb7-926f-4c43-981d-934eb020e33e","source":"https://www.youtube.com/watch?v=3a5_fviWlJg?wmode=transparent","createdAt":"2016-10-15T22:02:25.000Z","updatedAt":"2016-10-15T22:02:25.000Z","game":"2b15bcb7-926f-4c43-981d-934eb020e33e"},{"id":4709,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:f8459520-5938-46d7-8cac-bbdfbe832dfa","source":"https://www.youtube.com/watch?v=7p-xSPHmbXI?wmode=transparent","createdAt":"2016-10-15T22:03:35.000Z","updatedAt":"2016-10-15T22:03:35.000Z","game":"f8459520-5938-46d7-8cac-bbdfbe832dfa"},{"id":4710,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:e3326688-9fc3-40f7-a57f-99e50c911967","source":"https://www.youtube.com/watch?v=oRTg0aL4_78?wmode=transparent","createdAt":"2016-10-15T22:03:52.000Z","updatedAt":"2016-10-15T22:03:52.000Z","game":"e3326688-9fc3-40f7-a57f-99e50c911967"},{"id":4733,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:b5b6a83f-5709-4995-beaf-342ac8c29d9f","source":"https://www.youtube.com/embed/fiq_I4HPoQA","createdAt":"2016-10-18T09:12:17.000Z","updatedAt":"2016-10-18T09:12:17.000Z","game":"b5b6a83f-5709-4995-beaf-342ac8c29d9f"},{"id":4734,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:2b15bcb7-926f-4c43-981d-934eb020e33e","source":"https://www.youtube.com/embed/2eDIKeTAKTs","createdAt":"2016-10-18T09:12:48.000Z","updatedAt":"2016-10-18T09:12:48.000Z","game":"2b15bcb7-926f-4c43-981d-934eb020e33e"},{"id":4735,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:f8459520-5938-46d7-8cac-bbdfbe832dfa","source":"https://www.youtube.com/embed/O_YH72Y4qc4","createdAt":"2016-10-18T09:13:21.000Z","updatedAt":"2016-10-18T09:13:21.000Z","game":"f8459520-5938-46d7-8cac-bbdfbe832dfa"},{"id":4736,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:e3326688-9fc3-40f7-a57f-99e50c911967","source":"https://www.youtube.com/embed/Xi08FffTOv4","createdAt":"2016-10-18T09:13:50.000Z","updatedAt":"2016-10-18T09:13:50.000Z","game":"e3326688-9fc3-40f7-a57f-99e50c911967"}],"htmlBlocks":[],"match":{"id":"b0722c8b-058c-4804-b7c4-0890efa65c4d","name":"R1M2","position":1,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4},{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5}],"games":{"e3326688-9fc3-40f7-a57f-99e50c911967":{"id":"e3326688-9fc3-40f7-a57f-99e50c911967","name":"G4","generatedName":"RNG|SKT|G4|b0722c8b058c4804b7c","input":[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5},{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4}],"standings":{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476782000973,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476569006082,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476503306822,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476499446549,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476497872649,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"1001920086","gameRealm":"TRLH1","platformId":"TRLH1:1001920086","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"b5b6a83f-5709-4995-beaf-342ac8c29d9f":{"id":"b5b6a83f-5709-4995-beaf-342ac8c29d9f","name":"G1","generatedName":"RNG|SKT|G1|b0722c8b058c4804b7c","input":[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4},{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5}],"standings":{"result":[[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}],[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}]],"timestamp":1476781908270,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}],[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}]],"timestamp":1476568958286,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}],[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}]],"timestamp":1476495077318,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}],[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}]],"timestamp":1476487060146,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"1001920065","gameRealm":"TRLH1","platformId":"TRLH1:1001920065","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f8459520-5938-46d7-8cac-bbdfbe832dfa":{"id":"f8459520-5938-46d7-8cac-bbdfbe832dfa","name":"G3","generatedName":"RNG|SKT|G3|b0722c8b058c4804b7c","input":[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4},{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5}],"standings":{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476781971889,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476568988893,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476495754235,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476494864533,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"1001920084","gameRealm":"TRLH1","platformId":"TRLH1:1001920084","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"2b15bcb7-926f-4c43-981d-934eb020e33e":{"id":"2b15bcb7-926f-4c43-981d-934eb020e33e","name":"G2","generatedName":"RNG|SKT|G2|b0722c8b058c4804b7c","input":[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5},{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4}],"standings":{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476781939051,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476568972532,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476495184174,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476491353076,"source":"manual","note":"Set in esports HQ","closed":true}],"closed":true},"scores":{},"gameId":"1001920080","gameRealm":"TRLH1","platformId":"TRLH1:1001920080","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"2c313a44-f704-4367-b1c6-d50f194304af":{"id":"2c313a44-f704-4367-b1c6-d50f194304af","name":"G5","generatedName":"RNG|SKT|G5|b0722c8b058c4804b7c","input":[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":4},{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d","breakpoint":"0c552549-40b7-45c4-8c67-e2a9aeaa1bc8","standing":5}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476782000973,"source":"bestOf","history":[{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476781971889,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476781939052,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476781908270,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476569006085,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476568988893,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476568972532,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476568958286,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476503306826,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476499446549,"source":"bestOf","closed":true},{"result":[[{"roster":"bd325b88-12c9-4c7e-8cd6-e3fe7133e7c1"}],[{"roster":"7ac6a851-0bea-4e86-aa7c-3ec97caa274d"}]],"timestamp":1476497872649,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}