{"teams":[{"id":82,"slug":"team-we","name":"Team WE","guid":"be6e0936-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-we-ei826ceg.png","acronym":"WE","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-07T22:21:53.000Z","bios":{"en_US":"","pl_PL":"Team WE są znani w chińskim e-sporcie od pradziejów. Jako pionierska organizacja e-sportowa zasłynęli w świecie ze swoich drużyn Warcrafta i StarCrafta, zanim w 2011 roku przestawili się na League of Legends. Po latach przeplatających się serii sukcesów i porażek Team WE w 2017 roku naprawdę się odnaleźli. Łącząc stare talenty z nowicjuszami, Team WE zdominowali wiosenny split LPL 2017, osiągając wynik 12–4 w fazie grupowej. Nie spoczęli na laurach i wkrótce przebili się przez konkurencję w play-offach, przegrywając tylko jedną grę w drodze po tytuł wiosennego splitu. Ich zwycięstwo 3–0 z Royal Never Give Up w finale stanowiło ukoronowanie znakomitego sezonu drużyny. Teraz szykują się do Rio, gdzie zamierzają wielokrotnie wykradać Barona oraz eliminować najlepsze drużyny świata na Mid-Season Invitational 2017. \n\nTrener: Namhoon „HooN” Kim\n","es_ES":"Team WE es una vieja leyenda china de los esports. Como organización de esports pionera, ya era famosa mundialmente por sus equipos de Warcraft y Starcraft antes de que se uniera a League of Legends en 2011. Tras años alternando éxitos y fracasos, Team WE ha conseguido establecerse en 2017. Con una mezcla de viejos talentos y jugadores recién llegados, Team WE ha arrasado en el split de primavera de la LPL 2017, en la que batió un récord de 12 victorias frente a 4 derrotas en la fase de grupos. Pero la cosa no se quedó en eso. El equipo no tardaría en abrirse paso en los playoffs y en reclamar la corona del split de primavera con tan solo una derrota en su haber. Su resultado 3-0 en la final contra Royal Never Give Up es el colofón de una temporada estelar. Los jugadores de Team WE ahora se dirigen a Río y están preparados para robar el Barón y machacar a sus adversarios cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017. \n\nEntrenador: Namhoon ''HooN'' Kim\n","de_DE":"Team WE ist eine chinesische E-Sport-Legende, die so alt ist wie die Zeit selbst. Die E-Sport-Organisation gilt als Pionier auf diesem Gebiet und war für ihre Warcraft- und StarCraft-Mannschaften bekannt, bevor sie 2011 auf League of Legends umstieg. Nach Jahren voller Höhen und Tiefen scheint Team WE 2017 endlich einen guten Rhythmus gefunden zu haben. Dank einer Mischung aus alten Talenten und Neulingen konnte Team WE den Frühjahrs-Split der LPL dominieren und beendete die Gruppenphase mit 12 Siegen bei nur 4 Niederlagen. Doch das war ihnen noch nicht genug. Sie marschierten durch die Entscheidungsspiele und verloren auf dem Weg zum Titel nur ein einziges Spiel. Die Krönung ihrer sensationellen Saison war der 3–0 Sieg über Royal Never Give Up im Finale des Frühjahrs-Splits. Jetzt konzentrieren sie sich ganz auf Rio, wo sie den ein oder anderen Baron stehlen und ihre Gegner aufmischen wollen, wenn sie sich beim Mid-Season Invitational 2017 mit den besten Mannschaften der Welt messen. \n\nTrainer: Namhoon „HooN“ Kim\n","pt_BR":"<p>A história da Team WE nos e-Sports chineses é tão antiga quanto o tempo. Como uma organização pioneira na área de e-Sports, eles já haviam alcançado renome internacional com suas equipes de Warcraft e Starcraft quando fizeram o salto para League of Legends em 2011. Após passar anos intercalando sucessos e fracassos, a Team WE encontrou de vez o seu caminho em 2017. Misturando talentos experientes com novatos promissores, a Team WE dominou a Etapa de Primavera da LPL 2017 com um recorde de 12-4 na fase de grupos. Sem parar por aí, eles logo abriram caminho entre a competição das eliminatórias, perdendo apenas um jogo na sua jornada até a coroa da Etapa de Primavera. A surra de 3-0 que deram na Royal Never Give Up na final colocou um ponto de exclamação na sua já extraordinária temporada. Agora, seu foco está no Rio e eles pretendem roubar Barões e mostrar a que vieram em seus confrontos contra as melhores equipes do mundo no Mid-Season Invitational 2017. </p>\n\n<p>Técnico: Namhoon “HooN” Kim</p>","es_AR":"<p>El Team WE es un cuento de Esports tan viejo como el tiempo. Como una organización pionera de Esports, se volvieron conocidos internacionalmente por sus equipos de Warcraft y Starcraft antes de entrar a LoL en el 2011. Después de años de éxitos y fracasos, el Team WE encontró su ritmo en 2017. Al mezclar talento viejo con nuevo, el Team WE dominó el Torneo de Apertura LPL de 2017 y alcanzó un récord de 12-4 en la fase de grupos. No se detuvieron ahí. En cuanto llegaron a las eliminatorias solo perdieron una partida en su camino a la victoria del Torneo de Apertura. Su aplastante 3-0 en el Royal Never Give Up en las finales fue la cereza del pastel en su temporada. Ahora tienen los ojos puestos en Río y están listos para robar barones y aplastar a sus oponentes cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"1849"},"players":[132,511,516,517,603,692,1038,1428,1991,1992],"starters":[132,516,517,692,1038],"subs":[511,603,1428,1991,1992]},{"id":91,"slug":"flash-wolves","name":"Flash Wolves","guid":"be6e12bc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-hksj5z2h.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/flash-wolves-72ikguj5.png","acronym":"FW","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T17:45:02.000Z","bios":{"en_US":"<p>\nThe Flash Wolves are one of the most successful and storied teams in the LMS, and are hungry for another shot at the world stage. They’re no strangers to playing against global teams with the world watching; they've built a reputation as one of the only teams to consistently take games off world champions SK telecom T1. The players have spoken often and publicly about their drive to keep pushing LMS as a strong region that can compete with the best.\n</p>\n<p>\nOriginally founded in 2013, the Flash Wolves have consistently maintained their strength in the LMS. They've captured three straight LMS titles going back to last year. The team isn’t happy with running roughshod over the competition in their native region, though -- they’re gearing up to take the fight to the champions of each region.\n</p>\n\n<p>Coach: Chou “Steak” Frank</p>","fr_FR":"Les Flash Wolves sont l'une des équipes des LMS qui ont obtenu les plus grands succès et dont on a le plus parlé, et ils ont hâte de bénéficier d'une nouvelle chance sur la scène mondiale. Ils sont habitués à affronter des équipes internationales sous le regard du monde entier ; ils comptent même parmi les rares organisations à battre systématiquement les champions du monde de SK Telecom T1. Les joueurs ont souvent et publiquement parlé de leur désir de faire des LMS une puissante région capable d'affronter les meilleurs.\n\nFondée en 2013, l'équipe Flash Wolves a constamment maintenu son niveau aux LMS. Ils détiennent d'ailleurs le titre de champions LMS depuis trois années consécutives. Mais l'équipe ne veut pas se contenter de ces succès locaux : elle a bien l'intention d'affronter les champions de toutes les régions et de prouver qu'elle est de taille à attaquer n'importe quelle horde au Mid-Season Invitational 2017.\n\nEntraîneur : Chou « Steak » Frank\n","pl_PL":"Flash Wolves są jedną z najlepszych drużyn w LMS, a jej członkowie po raz kolejny spróbują sięgnąć po chwałę na światowej arenie. Gra przeciwko najwyższej klasy drużynom na oczach całego świata nie jest im obca; zdobyli sobie reputację jednej z niewielu drużyn, które konsekwentnie wygrywają mecze z mistrzami świata, SK Telecom T1. Zawodnicy drużyny często publicznie wspominają, że chcą zaprezentować LMS jako silny region, który może rywalizować z najlepszymi.\n\nZałożona w 2013 roku drużyna Flash Wolves stale osiąga dobre wyniki w LMS. Do zeszłego roku zdobyła trzy tytuły LMS z rzędu. Drużyna nie jest jednak usatysfakcjonowana poniewieraniem lokalnymi rywalami — przygotowuje się do walki z mistrzami  regionów, aby dowieść, że jest watahą, która potrafi pokonać najlepszych na Mid-Season Invitational 2017.\n\nTrener: Chou „Steak” Frank\n","de_DE":"Die Flash Wolves sind eine der erfolgreichsten und bekanntesten Mannschaften der LMS und wollen sich endlich einen internationalen Titel sichern. Sie sind es gewohnt, gegen Mannschaften aus anderen Regionen zu spielen, während die Welt zusieht, und gehören zu den wenigen Mannschaften, die gegen die Weltmeister von SK Telecom T1 gewinnen können. Die Spieler haben auch in der Öffentlichkeit immer wieder betont, dass sie die LMS zu einer Region machen wollen, die sich mit den besten der Welt messen kann.\n\nSeit ihrer Gründung 2013 haben die Flash Wolves stets ihre Stärke in der LMS unter Beweis gestellt. Seit dem letzten Jahr konnten sie sich in der LMS drei Titel sichern. Aber die Mannschaft will sich nicht damit begnügen, ihre Heimregion zu dominieren – sie bereiten sich darauf vor, den Kampf zu den Champions der anderen Region zu tragen und zu beweisen, dass es dieses Wolfsrudel beim Mid-Season Invitational 2017 mit den Größten aufnehmen kann.\n\nTrainer: Chou „Steak“ Frank\n","es_ES":"Flash Wolves es uno de los equipos más laureados y veteranos de la LMS, y está deseando tener una nueva oportunidad en el escenario mundial. No es la primera vez que compite contra equipos de todo el mundo con los espectadores internacionales como público; de hecho, se han forjado una reputación como uno de los pocos equipos capaces de ganar partidas contra los campeones mundiales SK telecom T1. Sus jugadores han hablado en más de una ocasión de forma pública sobre lo decididos que están a conseguir que la LMS se convierta en una región fuerte capaz de competir contra las mejores.\n\nFundado en 2013, Flash Wolves ha mostrado en todo momento su superioridad en la LMS: ha conseguido hacerse con tres títulos de la LMS seguidos. Pero el equipo no se conforma con triunfar en las competiciones de su región, sino que quiere enfrentarse a los campeones de todas las regiones y demostrar que su manada de lobos puede aplastar a los mejores en el Mid-Season Invitational 2017.\n\nEntrenador: Chou ''Steak'' Frank\n","pt_BR":"<p>A Flash Wolves é uma das equipes mais bem-sucedidas e celebradas na LMS e está ávida para outra chance no cenário mundial. Eles sabem bem como é jogar contra equipes globais com o mundo inteiro assistindo; construíram sua reputação como uma das únicas equipes a ganhar consistentemente dos campeões mundiais SK Telecom T1. Os jogadores têm falado frequente e publicamente sobre sua vontade de continuar tornando a LMS uma região forte e capaz de competir com os melhores.</p>\n\n<p>Fundada originalmente em 2013, a Flash Wolves tem mantido sua força na LMS. Eles capturaram três títulos seguidos na LMS desde o ano passado. Mas a equipe não está feliz com seu tratamento da oposição na sua região nativa. E eles estão se preparando para lutar contra os campeões de cada região e provar que esta matilha é capaz de derrotar os melhores no Mid-Season Invitational 2017.</p>\n\nTécnico: Chou \"Steak\" Frank</p>","es_AR":"<p>The Flash Wolves son uno de los equipos con más historia y éxito de la LMS, y se encuentran ansiosos de extender sus galardones al ámbito internacional. No son extraños a estos eventos globales; tienen una rivalidad con el equipo de Norteamérica Counter Logic Gaming, y han ganado partidas contra Cloud9 y Team SoloMid en la IEM Katowice 2015. Sus jugadores intentan llevar a la LMS al punto en que puedan competir con las mejores regiones mundiales, y trabajan para eso diariamente.</p>\n\n<p>Fundado en el 2013, los Flash Wolves se han mantenido a tope de la LMS consistentemente. Su trofeos incluyen el 1º lugar del Spring Split de la LMS en el 2015 y 2016. Pero el equipo no se conforma con liderar su región, se están preparando para pelear contra los campeones de cada rincón del mundo, y probar que esta jauría de lobos puede bajar a los más grandes.</p>\n\n<p><strong>Entrenador: Chen \"WarHorse\" Ju-Chih</strong></p>"},"foreignIds":{"drupalId":"1694"},"players":[110,617,631,633,1646,1849],"starters":[110,617,631,633,1646],"subs":[1849]}],"players":[{"id":110,"slug":"maple","name":"Maple","firstName":"Yi-Tang","lastName":"Huang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maple-g0kqxct3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":"","createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-07-06T14:27:55.000Z","bios":{"en_US":"<p>Yi-Tang “Maple” Huang is one of the most versatile mid laners around. He’s already proven to be practically unopposed in the LMS region, where he led all mid laners with a 6.9 KDA during the regular season. What’s even more impressive is that he’s still a teenager, with what looks to be a promising future ahead of him on the Flash Wolves.</p>\n\n<p>Maple demonstrated his wide champion pool when he played six different champions in six games at the 2016 World Championship. Unfortunately, he failed to find consistent success, and Flash Wolves failed to make it out of the Group Stage. Maple will no doubt jump at another chance to prove himself on the international stage.</p>","fr_FR":"Yi-Tang « Maple » Huang est l'un des midlaners les plus polyvalents. Il a déjà prouvé qu'il n'avait quasiment aucun adversaire dans la région LMS, où il a devancé tous les autres midlaners avec un KDA de 6,9 pendant la saison régulière. C'est d'autant plus impressionnant quand on sait qu'il est encore adolescent et qu'il a donc un avenir prometteur chez les Flash Wolves.\n\nMaple a montré son vaste pool de champions en jouant six champions différents dans six matchs lors du Championnat du monde 2016. Malheureusement, il a manqué de constance et les Flash Wolves n'ont pas réussi à sortir gagnants de la phase de groupe. Maple ne manquera pas de saisir cette nouvelle chance de montrer toute l'ampleur de son talent sur la scène internationale lors du Mid-Season Invitational 2017\n","pl_PL":"Yi-Tang „Maple” Huang jest aktualnie jednym z najwszechstronniejszych środkowych. Pokazał już, że jest praktycznie niepokonany w regionie LMS, w którym prowadził wśród środkowych z wynikiem 6,9 Z/Z/A w sezonie zasadniczym. Jeszcze większe wrażenie robi fakt, że wciąż jest nastolatkiem, którego czeka obiecująca przyszłość we Flash Wolves.\n\nMaple zademonstrował swoją szeroką pulę bohaterów, gdy zagrał sześcioma różnymi bohaterami w sześciu grach Mistrzostw Świata 2016. Niestety nie udało mu się powtórzyć wcześniejszych sukcesów i Flash Wolves nie zdołali wyjść z fazy grupowej. Maple bez wątpienia z radością skorzysta z kolejnej okazji, by dowieść swojej wartości na międzynarodowej arenie Mid-Season Invitational 2017.\n","de_DE":"Yi-Tang „Maple“ Huang ist einer der vielseitigsten Mid-Laner überhaupt. Mit einer TTU von 6,9 (der höchste Wert aller Mid-Laner) während der regulären Saison hat er bewiesen, dass es in der LMS-Region niemanden gibt, der es mit ihm aufnehmen kann. Noch beeindruckender ist, dass er noch ein Teenager ist, der zusammen mit den Flash Wolves eine große Zukunft vor sich hat.\n\nMaple hat mit sechs unterschiedlichen Champions in sechs Spielen der Weltmeisterschaft 2016 bewiesen, wie vielseitig er ist. Leider war er zu unbeständig und die Flash Wolves schieden in der Gruppenphase aus. Maple wird beim Mid-Season Invitational 2017 ohne Zweifel versuchen, sein Können unter Beweis zu stellen.\n","es_ES":"Yi-Tang ''Maple'' Huang es uno de los mid más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la región LMS, donde ha destacado entre los mid con un A/M/A de 6,9 puntos durante la temporada regular. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.\n\nMaple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió mantener la regularidad y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para ponerse a prueba en el escenario internacional del Mid-Season Invitational 2017.\n","pt_BR":"<p>Yi Tang “Maple” Huang é um dos jogadores de meio mais versáteis que existe. Ele já provou ser praticamente imbatível na região LMS, onde conseguiu 48,6% dos votos da rota. O que é ainda mais impressionante é que ainda é um adolescente, ostentando o que parece ser um futuro promissor na Flash Wolves.</p>\n\n<p>Maple demonstrou seu grande rol de Campeões quando jogou com seis personagens diferentes em seis partidas do Campeonato Mundial 2016. Infelizmente, ele não conseguiu manter o sucesso e a Flash Wolves falhou em sair da Fase de Grupos. Dada outra chance, Maple certamente vai agarrar a oportunidade de batalhar contra outros dos melhores jogadores de meio do mundo.</p>","es_AR":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>","cs_CZ":"<p>Yi Tang „Maple“ Huang je jedním z nejvšestrannějších středových lajnařů, na které jen můžete narazit. Jasně prokázal, že v celém LMS by jen těžko hledal nějakou konkurenci, o čemž svědčí i 48,6 % hlasů, které ve středové lajně získal. Tento fakt je o to působivější, že je dosud teenager. Vše nasvědčuje tomu, že jej v řadách Flash Wolves čeká slibná budoucnost.</p>\n\n<p>Maple na mistrovství světa 2016 demonstroval šíři své množiny šampionů, v šesti utkáních totiž hrál za šest různých postav. Bohužel se mu ne vždy dařilo a Flash Wolves nepostoupili ze skupiny. Maple tedy určitě využije druhou šanci rozpoutat masakr mezi těmi nejlepšími středovými lajnaři světa.</p>","el_GR":"<p>Ο Yi Tang “Maple” Huang είναι ένας από τους πιο ευέλικτους παίκτες μεσαίας λωρίδας. Έχει αποδείξει ήδη ότι δεν έχει αντίπαλο στο LMS, άρα δεν ήταν καθόλου περίεργο που συγκέντρωσε το 48,6% των ψήφων της περιοχής. Αυτό που είναι ακόμα πιο εντυπωσιακό είναι ότι ακόμα δεν έχει κλείσει καν τα είκοσι και, όπως όλα δείχνουν, έχει μπροστά του ένα λαμπρό μέλλον με τους Flash Wolves.</p>\n\n<p>Ο Maple έδειξε σε όλους πόσο καλά χειρίζεται μια τεράστια γκάμα ηρώων, όταν έπαιξε με έξι διαφορετικούς ήρωες σε έξι παιχνίδια του Παγκοσμίου Πρωταθλήματος 2016. Δυστυχώς, δεν κατάφερε να πιάσει σταθερή απόδοση, με αποτέλεσμα να μην καταφέρουν οι Flash Wolves να περάσουν τη Φάση Ομίλων. Είναι βέβαιο ότι ο Maple θα αδράξει τη δεύτερη ευκαιρία που του δίνεται για να αποδείξει ότι αξίζει μια θέση στους καλύτερους παίκτες μεσαίας λωρίδας στον κόσμο.</p>\n","hu_HU":"Yi Tang „Maple” Huang az egyik legsokoldalúbb középső ösvényes játékos. Az LMS régióban gyakorlatilag nincs kihívója, és a középső ösvényesekre leadott szavazatok 48,6%-át gyűjtötte be. Ez úgy érte el, hogy még tizenéves, és ígéretes karrier áll előtte a Flash Wolves tagjaként.</p>\n\nMaple a 2016-os világbajnokságon is megcsillogtatta nagy hősrepertoárját, és hat játékban hat különböző hőssel játszott. Sajnos nem sikerült következetesen nyerniük, és a Flash Wolves nem jutott tovább a csoportkörből. Ha esélyt kap rá, Maple örömmel veti bele magát a harcba a világ legjobb középső ösvényesei ellen.\n","it_IT":"Yi Tang \"Maple\" Huang è uno dei centrali più versatili attualmente in circolazione. Ha già dimostrato più volte di non avere rivali nella LMS, dove ha conquistato il 48,6% dei voti per la sua categoria. La cosa che più colpisce di lui è però la sua giovane età e il brillante futuro che lo attende assieme ai Flash Wolves.</p>\n\nMaple ha dato prova della sua grande abilità con numerosi campioni durante i Mondiali 2016 giocando 6 incontri con 6 personaggi diversi. Purtroppo non è riuscito a ottenere un successo costante, e i Flash Wolves hanno dovuto abbandonare il torneo durante la fase a gironi. Maple sfrutterà sicuramente questa seconda opportunità per portare scompiglio tra i migliori centrali del mondo.\n","ro_RO":"Yi Tang ''Maple'' Huang este unul dintre cei mai adaptabili jucători de pe culoarul din mijloc. A dovedit deja că practic nimeni nu se poate pune cu el în regiunea LMS, unde a obținut 48,6 la sută din voturile pentru culoarul din mijloc. Și mai impresionat, Maple e încă adolescent, așa că probabil că are un viitor promițător alături de Flash Wolves.\n</p>\nA demonstrat la Campionatul Mondial 2016 că poate juca cu un număr mare de campioni, făcând șase alegeri diferite în șase meciuri. Din păcate, nu a avut mereu succes, iar Flash Wolves nu a reușit să treacă de faza grupelor. Acum că a primit o nouă șansă, cu siguranță că va profita de ea și va dezlănțui haosul împotriva celor mai buni jucători din lume de pe culoarul din mijloc.\n","es_MX":"<p>Yi Tang \"Maple\" Huang es uno de los centrales más versátiles que existen. Ya ha demostrado que es prácticamente invencible en la LMS, donde ha logrado un 48,6 % de los votos para la posición de central. Lo que es aún más impresionante es que sigue siendo un adolescente que parece tener un futuro prometedor por delante en Flash Wolves.</p>\n\n<p>Maple demostró tener un gran repertorio de campeones al jugar seis diferentes en sus seis partidas del Campeonato Mundial 2016. Por desgracia, no consiguió hacer que su éxito fuera constante y Flash Wolves no logró clasificarse en la fase de grupos. No cabe duda de que Maple aprovechará esta nueva oportunidad para sembrar el caos en sus enfrentamientos contra los mejores centrales del mundo.</p>"},"foreignIds":{"drupalId":"674","TRLH3":"1001360063","TRLH4":"1001310063","TRTW":"200000014","TRLT3":"200000254","TRLH1":"200000436","TRLH2":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":132,"slug":"zero","name":"Zero","firstName":"Kyungsub","lastName":"Yun","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zero-bpm8z97p.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:59.000Z","updatedAt":"2017-07-07T22:22:17.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2165","TRLH1":"200000404","TRLH3":"1000205039","TRLT3":"200000232"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":511,"slug":"conan","name":"conan","firstName":"Yi","lastName":"Ke","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/conan-hcob1n8b.png","hometown":"Tianmen, China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-05-09T23:21:19.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2079","TRLH1":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":516,"slug":"xiye","name":"xiye","firstName":"Hanwei","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiye-4520r7ee.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:43.000Z","bios":{"en_US":"<p>Hanwei “xiye” Su is the model student for consistency in the mid lane. He joined up with the WE organization in 2013 as part of their developmental squad but was promoted in early 2015 to their main roster as the starting mid laner. His consistency across a variety of play styles has become his calling card in the LPL. Need a mage that can lock down and annihilate squishy targets? Check, xiye has got you covered. What about an assassin that can dice the enemy team down to size? No problem.</p>\n\n<p>Xiye’s steady performances combined with an ocean deep champion pool means that the enemy never quite knows what composition Team WE could build -- this makes prepping to play against xiye a nightmare. Without an easy way to ban him out, xiye can easily meld his play to whatever mid laner is required. He’ll be the rock that Team WE rely on as they step up their game at the 2017 Mid-Season Invitational in Rio. </p>","de_DE":"Hanwei „xiye“ Su ist das perfekte Beispiel für Beständigkeit auf der mittleren Lane. Er wechselte im Jahr 2013 zu WE und spielte in deren Entwicklungsmannschaft, wurde Anfang 2015 aber zum Mid-Laner der Hauptmannschaft gemacht. Durch seine Beständigkeit und seine unterschiedlichen Spielstile machte er sich schnell einen Namen in der LPL. Brauchst du einen Magier, der verletzliche Ziele jagen und vernichten kann? Kein Problem, xiye ist genau der Richtige dafür. Wie wäre es mit einem Assassinen, der die gegnerische Mannschaft in Stück reißt? Auch kein Problem. Dank xiyes konstanten Leistungen und seines umfangreichen Championpools wissen seine Gegner nie genau, was sie erwartet, und dadurch wird es unglaublich schwer, sich auf xiye vorzubereiten. Es ist schwierig, xiye mit Bannen zu schwächen, denn er kann auf der mittleren Lane so gut wie jeden Champion spielen. In Rio wird er Team WEs Fels in der Brandung sein, wenn sich die Mannschaft für das Mid-Season Invitational 2017 bereit macht. ","es_ES":"Hanwei ''xiye'' Su es el alumno modelo en términos de estabilidad en la calle central. Se unió a la organización de WE en 2013 como parte de su grupo en desarrollo, pero ascendió al principio de 2015 a la plantilla principal como mid titular. Sus resultados positivos con diversos estilos de juego se han convertido en su tarjeta de presentación en la LPL. ¿Su equipo necesita un mago que pueda inmovilizar y aniquilar a los objetivos más débiles? Sin problema, para eso está xiye. ¿Y si conviene más jugar con un asesino que pueda trocear al equipo enemigo? Todo controlado. El desempeño estable de xiye combinado con su gran repertorio de campeones hacen que el equipo enemigo casi nunca pueda prever cuál será la composición de Team WE (eso provoca que prepararse para jugar contra xiye sea toda una pesadilla). Como bloquear su selecciones no es tarea fácil, xiye puede adaptar sin problema su estilo de juego según el mid que mejor encaje. Team WE confiará en sus habilidades cuando se suban al escenario del Mid-Season Invitational 2017 en Río. ","pl_PL":"Hanwei „xiye” Su daje wzór konsekwentnej gry na środkowej alei. Dołączył do organizacji WE w 2013 roku jako część składu rozwojowego, a na początku 2015 roku został awansowany do głównego składu jako pierwszy środkowy. Umiejętna gra różnymi stylami stała się jego wyróżnikiem w LPL. Potrzebny jest mag, który umie blokować i anihilować delikatne cel? Jasne, xiye załatwi sprawę. A co z zabójcą, który potrafi ukrócić zapędy wrogiej drużyny? Żaden problem. Spójne występy xiye w połączeniu z rozległą jak ocean pulą bohaterów oznaczają, że wróg nigdy nie wie, jaką kompozycję wybierze Team WE — a to sprawia, że przygotowanie do gry przeciwko xiye jest koszmarem. Ponieważ nie ma łatwego sposobu, by go zbanować, xiye może szybko dostosować swoją grę do stylu wymaganego w danej sytuacji od środkowego. Jest opoką, na której wesprą się Team WE, by pokazać, na co ich stać na Mid-Season Invitational 2017 w Rio. ","pt_BR":"<p>Hanwei “xiye” Su é o modelo de consistência na rota do meio. Ele entrou para a organização WE em 2013 como parte da sua equipe em formação, mas foi promovido no início de 2015 à sua seleção principal para jogar na rota do meio. Sua consistência em vários estilos de jogo se tornou seu principal trunfo na LPL. Precisam de um mago que imobilize e acabe com alvos frágeis? Pode deixar, o xiye dá conta. E que tal um assassino que possa dar uma podada na equipe inimiga? Sem problema.</p> \n\n<p>Os desempenhos estáveis de xiye e o seu impressionante leque de Campeões fazem com que seus oponentes jamais saibam que composição a Team WE vai montar, o que é um verdadeiro pesadelo para quem precisa se preparar para enfrentá-lo. Sem uma maneira fácil de banir suas principais escolhas, xiye pode facilmente adequar seu estilo de jogo ao de qualquer Campeão da rota do meio que seja necessário. Ele será o alicerce em que a Team WE se apoiará para avançar no Mid-Season Invitational 2017 no Rio. </p>","es_AR":"<p><strong>Hanwei \"xiye\" Su</strong> es la imagen de la coherencia en el carril central. Se unió a la organización WE en 2013 como parte de su escuadrón de desarrollo, pero fue ascendido a inicios de 2015 a su arsenal principal como su carrilero central principal. Su coherencia a lo largo de una variedad de estilos de juego se convirtió en su marco en el LPL. ¿Necesitas a un mago que atrape y aniquile a los objetivos aplastables? Bueno, <strong>xiye</strong> se encarga. ¿Qué hay de un asesino que reduzca a la mitad al equipo enemigo? No hay problema. El desempeño estable de <strong>xiye</strong>, combinado con una profunda agrupación de campeones significa que el enemigo nunca sabe cuál será la composición del Team WE. Esto hace que prepararse para pelear contra <strong>xiye</strong> sea una pesadilla. Sin una forma sencilla de eliminarlo, <strong>xiye</strong> puede adaptarse con facilidad a lo que el carrilero central necesite. Será la roca sobre la cual se base el Team WE cuando se preparen para el Mid-Season Invitational 2017 en Río.</p>"},"foreignIds":{"drupalId":"3186","TRLH1":"200000402","TRLH2":"200000302","TRLT3":"200000230"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":517,"slug":"mystic","name":"Mystic","firstName":"Seongjun","lastName":"Jin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mystic-cktg9mzr.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:57.000Z","bios":{"en_US":"<p>Seongjun “Mystic” Jin started his professional career in his native South Korea with the Jin Air Stealths in 2013. Near the tail-end of 2014 he decided to make the move to China and Team WE Academy. It was here that he made the perilous switch from jungle to AD carry. He acclimated quickly to the new role and Team WE took notice. They promoted Mystic to their roster as a sub and not long after he was promoted yet again to their starting AD carry position where he’s been since the spring of 2015.</p>\n\n<p>He’s comfortable on a variety of champions, from the initiation of Ashe’s Crystal Arrow to the raw carry potential of Piltover’s finest, Caitlyn -- Mystic can play it all. Team WE will rely on his versatility when they come face-to-face with some of the Rift’s most feared bot lane duos at the 2017 Mid-Season Invitational.</p>","pl_PL":"Seongjun „Mystic” Jin zaczął profesjonalną karierę w ojczystej Korei Południowej z Jin Air Stealths w 2013 roku. Pod sam koniec 2014 roku zdecydował się przeprowadzić do Chin i drużyny Team WE Academy. Tam dokonał ryzykownego przejścia z dżungli do roli prowadzącego. Szybko zaaklimatyzował się na nowej pozycji, a Team WE to zauważyli. Dołączyli Mystica do swojego składu jako rezerwowego, a niedługo później ponownie awansowali na pozycję prowadzącego w pierwszym składzie, którą zajmuje od wiosny 2015 roku. Dobrze sobie radzi z różnorakimi bohaterami od inicjującej Kryształowej Strzały Ashe po potencjalnie prowadzącą sławę z Piltover, Caitlyn — Mystic potrafi grać wszystkimi. Team WE będą polegali na jego wszechstronności, gdy staną twarzą w twarz z kilkoma z najgroźniejszych duetów dolnej alei Summoner’s Rift podczas Mid-Season Invitational 2017.","es_ES":"Seongjun ''Mystic'' Jin comenzó su trayectoria profesional en su Corea del Sur natal con Jin Air Stealths en 2013. Al final de 2014, decidió trasladarse a China para formar parte de Team WE Academy. Fue en ese momento cuando hizo un arriesgado cambio de rol: de jungla a AD carry. No tardaría en adaptarse a su nueva posición, y Team WE lo tuvo en cuenta. Lo ascendieron a su plantilla principal como suplente y, poco después, pasaría a ser AD carry titular, posición que ha ocupado desde la primavera de 2015. Se siente cómodo con una gran variedad de campeones: desde la capacidad de iniciación de la Flecha de cristal de Ashe, al potencial para dominar la partida de la sheriff más sofisticada de Piltover, Caitlyn. Mystic es capaz de jugar con cualquier campeón. Team WE confiará en su versatilidad cuando se enfrenten cara a cara contra algunos de los dúos de bot más temidos de la Grieta en el Mid-Season Invitational 2017.","de_DE":"Seongjun „Mystic“ Jin begann seine professionelle Karriere 2013 in seiner Heimat, Südkorea, bei Jin Air Stealths. Gegen Ende des Jahres 2014 entschied er sich aber, nach China zu Team WE Academy zu wechseln. Dort wechselte er auch aus dem Dschungel auf die untere Lane, um dort als AD-Carry zu spielen. Er fand sich schnell in seine neue Rolle ein und machte so Team WE auf sich aufmerksam. Sie nahmen Mystic als Ersatzspieler in ihre Aufstellung auf und machten ihn im Frühjahr 2015 zum Haupt-AD-Carry. Er kommt mit vielen Champions zurecht: Von Ashes Kristallpfeil bis zur brutalen Schadensmaschine aus Piltover, Caitlyn – Mystic kann alles spielen. Team WE wird seine Vielseitigkeit brauchen, wenn sie es beim Mid-Season Invitational 2017 mit den gefürchtetsten Duos auf der unteren Lane zu tun bekommen.v","pt_BR":"<p>Seongjun “Mystic” Jin começou sua carreira profissional na Coreia do Sul, sua terra natal, com a Jin Air Stealths em 2013. Perto do fim de 2014, ele decidiu se mudar para a China e entrou para a Team WE Academy. Foi lá que ele fez a arriscada mudança de caçador para atirador. Ele se acostumou rapidamente à nova função, chamando a atenção da Team WE. Eles então promoveram Mystic à sua seleção como reserva e, pouco tempo depois, ele foi novamente promovido para a posição de atirador principal, que ocupa desde a metade inicial de 2015.</p>\n\n<p>Ele joga com diversos Campeões, sentindo-se confortável tanto com a iniciação da Flecha de Cristal da Ashe quanto com o potencial de carregar partidas da defensora de Piltover, Caitlyn. Mystic é a versatilidade em pessoa. A Team WE vai depender do grande repertório dele quando ficar cara a cara com algumas das duplas da rota inferior mais temidas do Rift no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Seongjun \"Mystic\" Jin</strong> comenzó su carrera profesional en su Corea del Sur nativa con los Jin Air Stealths en 2013. Cerca de finales de 2014 decidió mudarse a China y entrar a la academia del Team WE. Aquí hizo el peligroso cambio de junglero a tirador. Se acostumbró rápidamente al nuevo rol y el Team WE lo notó. Ascendieron a <strong>Mystic</strong> a su arsenal como suplente y no mucho después fue ascendido nuevamente a tirador principal, puesto en el cual ha permanecido desde la primavera de 2015. Se siente cómodo con una variedad de campeones, desde la iniciación de la Flecha de Cristal de Ashe, hasta el potencial de acarreador de la mejor de Piltóver: Caitlyn. <strong>Mystic</strong> puede jugar con todos. El Team WE confía en su versatilidad cuando se enfrenten a los dúos de carril inferior más temidos de la Grieta en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"994","TRLH1":"200000403","TRLH2":"200000303","TRLT3":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":603,"slug":"raison","name":"Raison","firstName":"Soobeen","lastName":"Jeong","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/raison-9vqm9g4s.png","hometown":"","region":"LMS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-09T23:20:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4366","TRLH1":"200000405"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":617,"slug":"swordart","name":"SwordArT","firstName":"Shou-Chieh","lastName":"Hu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swordart-23wa49d3.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:28:19.000Z","bios":{"en_US":"<p>Behind every great marksman is a great support. Chieh “SwordArT” Hu a perfect example of that. The LMS veteran excels on champions that can peel, zone and protect for his rookie ADC in the bot lane. He’s played a key role in all of the Flash Wolves’ upset victories over SK telecom T1, providing the vision and crowd control his team needs to win.</p> <p>He’s already established himself as the best support in the LMS, leading his role during the regular season with a ridiculous 12.0 KDA. While Maple and Karsa get the acclaim for their big plays, SwordArT is the guy behind the scenes making it all happen. The calm, cool, and collected shotcaller of the team, SwordArT can be found where the action is hottest, directing his teammates and keeping them alive.</p>","fr_FR":"Derrière chaque grand tireur se cache un grand support. Chieh « SwordArT » Hu illustre parfaitement cette maxime. Ce vétéran des LMS excelle avec les champions qui lui permettent de contrôler l'espace et de protéger son jeune ADC sur la voie du bas. Il a joué un rôle clé dans les victoires surprises des Flash Wolves face à SK Telecom T1, apportant la vision du jeu et les capacités de contrôle de foule dont son équipe avait besoin pour gagner.\n\nIl s'est illustré en devenant le meilleur support des LMS lors de la saison régulière, grâce à un KDA effarant de 12,0. Maple et Karsa sont acclamés pour leurs actions spectaculaires, mais SwordArT est bel et bien l'homme de l'ombre qui rend tout ceci possible. Décideur calme et posé au sein de l'équipe, SwordArT se trouve là où l'action est la plus débridée, dirigeant ses équipiers et les gardant en vie.\n","pl_PL":"Za każdym świetnym strzelcem stoi świetny wspierający. Chieh „SwordArt” Hu jest tego idealnym przykładem. Ten weteran LMS najlepiej gra bohaterami, którzy potrafią eskortować, utrudniać dostęp wrogom i chronić jego debiutującego prowadzącego na dolnej alei. Odegrał kluczową rolę we wszystkich niesamowitych zwycięstwach Flash Wolves z SK Telecom T1, zapewniając wizję i kontrolę tłumu, których drużyna potrzebuje, by wygrywać.\n\nJuż pokazał, że jest najlepszym wsparciem w LMS, osiągając szczyt w swojej roli podczas sezonu zasadniczego z nieprawdopodobnym wynikiem 12,0 Z/Z/A. Podczas gdy Maple i Karsa zachwycają swoimi wspaniałymi zagrywkami, SwordArT to gość, który stoi za kulisami i sprawia, że kolegom udaje się osiągnąć wszystko, co zamierzyli. Spokojnego i opanowanego lidera drużyny, jakim jest SwordArT, można znaleźć wszędzie tam, gdzie toczy się najgorętsza akcja. Stamtąd kieruje kolegami i utrzymuje ich przy życiu.\n","de_DE":"Hinter jedem großen Schützen steht ein großer Supporter. Und Chieh „SwordArT“ Hu ist ein perfektes Beispiel dafür. Der Veteran der LMS zeichnet sich vor allem mit Champions aus, mit denen er die Gegner abdrängen und seinen AD-Carry beschützen kann. Er spielte bei den Siegen der Flash Wolves gegen SK Telecom T1 eine entscheidende Rolle, weil er für die notwendige Sicht sorgte und seine Gegner mit Effekten zur Massenkontrolle unschädlich machte.\n\nMit einer unglaublichen TTU von 12,0 in der regulären Saison hat er bereits bewiesen, dass er der beste Supporter der LMS ist. Während Maple und Karsa für ihre „Big Plays“ bejubelt werden, ist SwordArT der Mann im Hintergrund, der all das überhaupt erst möglich macht. SwordArT ist der ruhige, gelassene und gefasste Spielführer der Mannschaft, der immer dort ist, wo es am heißesten wird, um seinen Teamkameraden die Richtung vorzugeben und sie am Leben zu halten.\n","es_ES":"Detrás de todo buen tirador, hay un buen apoyo. Chieh ''SwordArt'' Hu es un perfecto ejemplo de eso. El veterano de la LMS destaca con campeones que pueden defender, aislar y proteger a su ADC novato en la calle inferior. Ha jugado un papel clave en todas las victorias inesperadas de Flash Wolves contra SK telecom T1, pues ha facilitado la visión y el control de adversario que su equipo necesitaba para ganar.\n\nSe ha consolidado como el mejor apoyo de la LMS, destacando durante la temporada regular con un apabullante A/M/A de 12 puntos. Maple y Karsa serán los que se lleven los vítores por las grandes jugadas, pero SwordArT será quien las haga posibles entre bambalinas. El calmado líder del equipo, SwordArT, siempre se encontrará donde esté la acción, dirigiendo a sus compañeros y manteniéndolos con vida.\n","pt_BR":"<p>Atrás de todo ótimo carregador há um ótimo suporte. Chieh \"SwordArT\" Hu é um exemplo perfeito disso. O veterano da LMS manda bem com Campeões que podem iniciar, zonear e proteger o seu carregador novato na rota inferior. Ele teve um papel essencial em todas as vitórias da Flash Wolves sobre a SK Telecom T1, dando a visão e o Controle de Grupo que sua equipe precisou para vencer.</p> <p>Ele já se estabeleceu como o melhor suporte da LMS, liderando sua função durante a temporada regular com uma AMA absurdo de 12,0. Apesar de Maple e Karsa levarem todo o crédito pelas grandes jogadas, SwordArT é o cara que torna tudo isso possível. O calmo e tranquilo tomador de decisões da equipe pode ser encontrado sempre onde a ação estiver bombando, guiando seus companheiros e mantendo-os vivos. </p>","es_AR":"<p>Tras cada tirador agresivo hay un hábil soporte, un dicho que se ha confirmado en la carrera de Hu \"SwordArT\" Shou-Chieh. A SwordArT se lo considera un soporte mecánico increíblemente fuerte que lucha usando un campeón que pueda impedir acciones del enemigo, cubrir zonas y proteger (habilidades útiles cuando se está en un carril con NL). Si bien sus compañeros de equipo le recriminan algún combo ocasional fallido o Pulverizar de Alistar que solo golpea el aire, siempre busca proteger y defender a su equipo, símbolo de una verdadera leyenda de soporte.</p>\n\n<p>Buscará ser considerado como uno de los mejores soportes del mundo en Shanghai. Mientras Maple y Karsa reciben la atención por sus grandes actuaciones, SwordArT es quien se queda en segundo plano y hace que todo funcione. SwordArT, el tranquilo, relajado y sereno tirador del equipo, puede encontrarse donde la acción es más intensa, dirigiendo a sus compañeros y manteniéndolos con vida.</p>"},"foreignIds":{"drupalId":"676","TRLH3":"1001160054","TRLH4":"1001160054","TWTW":"135240","TRTW":"200000109","TRLT3":"200000256","TRLH1":"200000438","TRLH2":"200000338"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":631,"slug":"karsa","name":"Karsa","firstName":"Hao-Xuan","lastName":"Hong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/karsa-4n8bncs5.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:35:08.000Z","bios":{"en_US":"<p>Hao-Xuan “Karsa” Hong is the epitome of a “carry” jungler. Nothing strikes fear in Flash Wolves’ opponents as much as when Karsa locks in a Lee Sin or Graves pick for an important match. His legion of fans wouldn’t have it any other way.</p>\n\n<p>Karsa and the Flash Wolves impressed at Worlds last year by taking a game off soon-to-be champs SK telecom T1 in the group stage. The victory continued a trend for the Flash Wolves, who have built a name for themselves by upsetting SKT at international events.</p>","fr_FR":"Hao-Xuan « Karsa » Hong est la quintessence même d'un jungler « carry ». Rien ne fait plus peur aux adversaires des Flash Wolves que de voir Karsa choisir Lee Sin ou Graves pour un match important. Et ce n'est pas sa légion de fans qui nous contredira.\n\nKarsa et les Flash Wolves ont fait grande impression au Mondial l'an dernier en infligeant une défaite aux futurs champions de SK Telecom T1 lors de la phase de groupe. La chance a continué de sourire aux Flash Wolves qui se sont faits un nom en triomphant de SKT lors d'événements internationaux. Karsa va maintenant apporter son style de jeu spectaculaire et riche en ganks au Brésil, où il tentera de répéter son exploit contre les champions du monde.\n","pl_PL":"Hao-Xuan „Karsa” Hong to uosobienie „prowadzącego” dżunglera. Nikt nie budzi takiego lęku u przeciwników Flash Wolves, jak Karsa wybierający Lee Sina lub Gravesa w ważnym meczu. Legiony jego fanów uważają, że dzieje się tak nie bez powodu.\n\nKarsa i Flash Wolves zaimponowali na zeszłorocznych Mistrzostwach, wygrywając grę z SK Telecom T1 (przyszłymi mistrzami) w fazie grupowej. Zwycięstwo stanowiło kontynuację tradycji Flash Wolves, którzy zasłynęli drażnieniem SKT na imprezach międzynarodowych. Teraz Karsa pokaże swój oparty na gankowaniu, błyskotliwy styl gry w Brazylii, gdzie zamierza kolejny raz dogryźć mistrzom świata.\n","de_DE":"Hao-Xuan „Karsa“ Hong ist der Inbegriff eines „Carry“-Junglers. Nichts jagt den Gegnern der Flash Wolves mehr Angst ein als Karsa, wenn er in einem wichtigen Spiel Lee Sin oder Graves auswählt. Und genau das wollen seine zahlreichen Fans sehen.\n\nKarsa und die Flash Wolves haben bei der WM im letzten Jahr beeindruckt, indem sie in der Gruppenphase ein Spiel gegen die zukünftigen Weltmeister SK Telecom T1 gewinnen konnten. Mit diesem Sieg konnten die Flash Wolves den Trend fortsetzen und SKT wieder bei einem internationalen Turnier überraschen. Jetzt reist Karsa mit seinem auf Ganks basierenden Spielstil nach Brasilien, wo er den Weltmeister erneut in die Knie zwingen will.\n","es_ES":"Hao-Xuan ''Karsa'' Hung es la personificación del jungla carry. Nada despierta más terror entre los oponentes de Flash Wolves que ver a Karsa seleccionar a Lee Sin o a Graves en una partida importante. Su legión de fans lo tiene claro.\n\nKarsa y Flash Wolves dejaron a la audiencia boquiabierta el año pasado tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK telecom T1. La victoria continuó la tradición de Flash Wolves, que se ha ganado la fama vencer inesperadamente a SKT en los eventos internacionales. Karsa ahora trasladará su llamativo estilo de juego basado en las emboscadas a Brasil, donde intentará vencer una vez más a los campeones del mundo.\n","pt_BR":"<p>Hao-Xuan \"Karsa\" Hong é um verdadeiro caçador \"carregador\". Nada causa tanto medo nos adversários da Flash Wolves como o Karsa de Lee Sin ou Graves em uma partida importante. Sua legião de fãs não aceitaria nada diferente.</p>\n\n<p>Karsa e a Flash Wolves impressionaram no Mundial do ano passado, conseguindo uma vitória contra a campeã SK Telecom T1 na Fase de Grupos. A vitória continuou um tema recorrente para a Flash Wolves, que fez seu nome vencendo a SKT em eventos internacionais. Karsa agora trará seu estilo de jogo exuberante e de fortes emboscadas para o Brasil, onde ele vai tentar dar outra mordida nos campeões mundiais.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hau-Hsuan \"Karsa\" Hung은 Flash Wolves 선수들 중에서 2013 월드 챔피언십에 Gamania Bears로 출전하지 않은 유일한 선수입니다. 하지만 팀에서 소외감을 느끼진 않죠. Karsa는 전 Gama Bears 정글러 Winds를 보며 정글 운영의 요령을 배웠습니다. 덕분에 정신적으로 그의 후임자가 된 동시에 팀에 자연스럽게 어울리게 됐죠. </p>\n<p style=”font-family:”나눔고딕”;\">Karsa는 현재 대만에서 가장 강력한 정글러 중 하나로 꼽힙니다. 2015 월드 챔피언십에서 킬 관여율 75%라는 엄청난 기록을 낸 걸 보면 알 수 있죠. Flash Wolves는 8강에서 멈춰야 했지만 여전히 LMS 지역의 자부심입니다. 믿겨지지 않는다면 그의 팬이 얼마나 많은지 확인해 보세요. Karsa는 Flash Wolves 선수들 중에서 팬클럽 규모가 가장 큽니다. Karsa에게 가면 다신 돌아올 수 없죠. 늑대 무리에 들어온 걸 환영합니다. </p>\n","es_AR":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>","cs_CZ":"<p>Hao Hsuan „Karsa“ Hung je učebnicovým příkladem „tahounského“ džunglera. Nic nenažene soupeřům Flash Wolves takový strach, jako když si Karsa při důležitém utkání vybere Lee Sina nebo Gravese. Zástupy jeho fanoušků jsou ovšem spokojeny – důkazem je, že obdržel 49 % hlasů pro džunglera z LMS.</p>\n\n<p>Karsa a Flash Wolves podali na MS velice slušný výkon, za zmínku stojí především fakt, že ve skupině porazili budoucí šampiony z SK Telecom T1. Tato výhra byla pokračováním zavedeného trendu, Flash Wolves se totiž proslavili tím, jak na mezinárodních turnajích s oblibou šlapou SKT na kuří oko. Karsův efektní herní styl plný přepadů bude na All-Star 2016 jistě vzbuzovat pozornost, tento turnaj je totiž jako stvořený pro mladé kreativní hráče typu tohoto hvězdného džunglera z Flash Wolves.</p>","el_GR":"<p>Ο Hao Hsuan “Karsa” Hung είναι η επιτομή του παίκτη ζούγκλας τύπου carry. Όταν ο Karsa καταφέρνει να πάρει τον Λι Σιν ή τον Γκρέιβς σε έναν σημαντικό αγώνα, προκαλεί τον τρόμο σε όλους τους αντιπάλους των Flash Wolves. Οι στρατιές των οπαδών του θέλουν να τον δουν να κάνει αυτό που ξέρει καλύτερα, για αυτό του έδωσαν το 49% των ψήφων του LMS για τη θέση της ζούγκλας.</p>\n\n<p>Ο Karsa και οι Flash Wolves έκαναν αίσθηση φέτος στο Παγκόσμιο Πρωτάθλημα όταν κατάφεραν να πάρουν ένα παιχνίδι από τους αδιαμφισβήτητους πρωταθλητές SK Telecom T1 στη φάση ομίλων. Η νίκη αυτή συνέχισε την παράδοση των Flash Wolves, οι οποίοι καταφέρνουν να νικούν τους SKT σχεδόν σε κάθε διεθνές τουρνουά. Ο Karsa έχει ένα θεαματικό στυλ παιχνιδιού με έμφαση στον αιφνιδιασμό, το οποίο σίγουρα θα προκαλέσει αίσθηση στο Τουρνουά All-Star 2016, μια διοργάνωση που συνήθως αναδεικνύει νεαρούς οργανωτές, όπως ο διάσημος παίκτης ζούγκλας των Flash Wolves.</p>\n","hu_HU":"Hao Hsuan „Karsa” Hung egy igazi „lövész” dzsungelharcos. A Flash Wolves ellenfelei joggal félhetnek, ha Karsa megszerzi Lee Sint vagy Gravest egy fontos meccsen. A rajongói is szeretnék újra látni őt, mivel az LMS dzsungelharcos-szavazásában 49%-nyi szavazatot söpört be.</p>\n\nKarsa és a Flash Wolves a vb-n játékot tudott nyerni a későbbi bajnok SK Telecom T1 ellen a csoportkörben. A győzelemmel a Flash Wolves tovább építette a hírnevét, és rendszeresen odaszúrnak az SKT-nek a nemzetközi versenyeken. Karsa szereti a rajtaütéseket és a látványos akciókat, amit a 2016-os All-Star gála közönsége is imádni fog, hiszen a versenyt gyakorlatilag a Flash Wolves dzsungelharcos sztárjához hasonló fiatal tehetségeknek találták ki.\n","it_IT":"Hao Hsuan \"Karsa\" Hung è l'incarnazione del perfetto \"carry\" da giungla. Nulla instilla più paura negli avversari dei Flash Wolves di quando Karsa sceglie Lee Sin o Graves durante un incontro importante. Le sue legioni di fan non hanno dubbi su di lui, come testimoniato dal 49% di voti ottenuti nella categoria Giungla della LMS.</p>\n\nKarsa e i Flash Wolves hanno mostrato grandi numeri ai Mondiali di quest'anno, vincendo una partita nei gironi contro coloro che poi si sarebbero confermati campioni del mondo, gli SK Telecom T1. Questa vittoria rappresenta quasi una consuetudine per i Flash Wolves, che sono ormai noti per essere una spina nel fianco degli SKT negli eventi internazionali. Lo stile vistoso e fortemente basato su assalti di Karsa terrà di sicuro molti occhi incollati agli schermi durante l'All-Star 2016, un evento che molti considerano fatto su misura per giovani registi come la star della giungla dei Flash Wolves.\n","ro_RO":"Hao Hsuan ''Karsa'' Hung este întruchiparea unui jungler ''carry''. Adversarii celor de la Flash Wolves au de ce să se teamă când Karsa îl alege pe Lee Sin sau pe Graves într-un meci important. Numeroșii săi fani n-au vrut nici ei să-l lase la greu și l-au onorat cu 49 la sută din voturile pentru junglerul LMS.\n</p>\nKarsa și Flash Wolves au impresionat la Mondialele din acest an, câștigând un meci în faza grupelor împotriva viitorilor campioni, SK Telecom T1. Victoria a continuat tendința deja renumită a echipei de a-i surprinde în mod neplăcut pe cei din SKT la evenimente internaționale. Stilul de joc bazat pe gank-uri al lui Karsa va atrage cu siguranță multe priviri la All-Star 2016, un eveniment care pare parcă făcut special pentru playmakeri tineri precum junglerul extraordinar din Flash Wolves.\n","es_MX":"<p>Hao Hsuan \"Karsa\" Hung es la personificación del junglero acarreador. Nada despierta más terror entre los oponentes de Flash Wolves que si Karsa selecciona a Lee Sin o Graves en una partida importante. Su legión de fans lo tiene claro y lo ha demostrado eligiéndolo con un 49 % de los votos para el puesto de la jungla de la LMS.</p>\n\n<p>Karsa y Flash Wolves dejaron a la audiencia boquiabierta este año tras ganar en la fase de grupos al equipo que luego se convertiría en campeón, SK Telecom T1. La victoria continúa la tradición de Flash Wolves, que se han ganado la fama a costa de vencer inesperadamente a SKT en los eventos internacionales. El llamativo estilo de juego de Karsa, cargado de emboscadas, sorprenderá a más de uno en el All-Star Event 2016, un evento que parece creado a medida para los jóvenes estrategas como el junglero estrella de Flash Wolves.</p>"},"foreignIds":{"drupalId":"3721","TRLH3":"1001360062","TRLH4":"1001310062","TRLH1":"200000435","TRLH2":"200000335","TRTW":"200000013","TRLT3":"200000253"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":633,"slug":"mmd","name":"MMD","firstName":"Li-Hong","lastName":"Yu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mmd-hhy6fhit.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-06T14:37:03.000Z","bios":{"en_US":"<p>\nA one-time sub who stood behind Steak, Li-Hong “MMD” Yu has now built a name for himself as the Flash Wolves' top laner. MMD is known for his aggression and carry style, and his mechanics are top tier. However, he’s perfectly happy to switch to supportive tank picks and funnel resources towards the rest of his team. His Equalizers were on point as Rumble in the LMS Finals, which helped his team pick up the 3-1 victory over ahq e-Sports Club.\n</p>","es_AR":"<p>Yu \"MMD\" Li-Hung, que alguna vez fue espectador de la escena competitiva, es ahora el carrilero superior inicial de FW, su miembro más reciente y una pieza esencial de su éxito. MMD fue famoso anteriormente por sus juegos como acarreador y por su agresividad, siendo aún una clara mejora mecánica sobre su predecesor. En el meta actual, está feliz de cambiar al enfoque de tanque de soporte que actualmente lucha como Ekko y canaliza recursos para los acarreadores de su equipo. A pesar de que desempeña un papel de soporte, tiene lo suyo: su Poppy 6/1/11 contra AHQ en la Final del LMS de primavera es prueba de que es capaz de ir al frente y hacer el trabajo en la primera línea. Con Steak aún en la mayoría de los simpatizantes, MMD buscará su lugar frente al mundo en el Campeonato Mundial 2016.</p>","fr_FR":"Suite à son expérience de remplaçant pour Steak, Li-Hong « MMD » Yu s'est fait un nom en tant que toplaner des Flash Wolves. MMD est connu pour son agressivité et son style de carry, ainsi que pour ses mécaniques de premier ordre. Cependant, il est heureux d'incarner des supports tankys et de canaliser les ressources vers le reste de son équipe. Les Éradications de son Rumble ont fait des miracles lors de la finale des LMS et ont permis à son équipe de remporter une victoire à 3-1 contre ahq e-Sports Club. Il s'apprête maintenant à participer au Mid-Season Invitational 2017 pour avoir une nouvelle chance de vaincre SK Telecom T1.","es_ES":"El que fuera suplente de Steak, Li-Hong ''MMD'' Yu, ahora se ha forjado una reputación como top de Flash Wolves. MMD es famoso por su agresividad y liderazgo, y sus mecánicas son del más alto nivel. No obstante, está encantado de pasar a usar tanques de apoyo y concentrar todos sus recursos en ayudar a su equipo. En la final de la LMS consiguió usar justo a tiempo los Equilibradores de Rumble, lo que ayudó a que su equipo consiguiese una victoria 3-1 contra ahq e-Sports Club. Ahora se dirige al Mid-Season Invitational 2017 para enfrentarse una vez más a SK telecom T1","de_DE":"Der ehemalige Ersatzspieler für Steak, Li-Hong “MMD” Yu, konnte sich im Laufe der Zeit als Top-Laner der Flash Wolves einen Namen machen. MMD ist für seinen aggressiven Carry-Stil und seine überragenden Spielmechaniken bekannt. Er hat jedoch auch kein Problem damit, unterstützende Tanks zu spielen und dem Rest seiner Mannschaft Ressourcen zukommen zu lassen. Beim 3–1 Sieg über ahq e-Sports Club im Finale der LMS brachte er seine Gegner mit Rumbles Einebner zur Verzweiflung. Jetzt ist er zum Mid-Season Invitational 2017 unterwegs, wo er wieder versuchen wird, SK Telecom T1 zu Fall zu bringen.","pl_PL":"Jednorazowy zastępca Steaka, Li-Hong „MMD” Yu zdobył sobie rozgłos jako górny Flash Wolves. MMD jest znany ze swojej agresji i stylu prowadzenia, a jego umiejętności mechaniczne są najwyższej klasy. Potrafi też bez żadnych problemów zmienić rolę na wspierającego obrońcę, aby uzupełniać zasoby pozostałych członków drużyny. Doskonale wykorzystał Wyrównywacze Rumble’a w finale LMS, co pomogło drużynie osiągnąć zwycięstwo 3−1 z ahq e-Sports Club. Teraz zmierza na Mid-Season Invitational 2017, by jeszcze raz spróbować pobić SK Telecom T1.","pt_BR":"<p>O antes reserva de Steak, Li-Hong \"MMD\" Yu, agora deixou seu nome famoso como jogador da rota superior da Flash Wolves. MMD é conhecido pelo seu estilo agressivo e carregador, e por suas mecânicas de primeira. No entanto, ele ficou feliz de trocar para escolhas de tanques suportes e canalizar recursos para o resto de sua equipe. Seus Equalizadores estavam perfeitos como Rumble na final da LMS, quando ele ajudou a equipe a conquistar uma vitória de 3-1 sobre a ahq e-Sports Club. Agora ele vai para o Mid-Season Invitational 2017 para conseguir revanche contra a SK Telecom T1.</p>"},"foreignIds":{"drupalId":"3720","TRTW":"200000150","TRLT3":"200000252","TRLH1":"200000434","TRLH2":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":692,"slug":"condi","name":"Condi","firstName":"Renjie","lastName":"Xiang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/condi-9gseaajf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-07-07T18:00:19.000Z","bios":{"en_US":"<p>Renjie “Condi” Xiang is China’s resident Baron steal specialist, stealing more of the purple monster’s powers than any other jungler in the LPL since 2015. Since joining Team WE, Condi has been instrumental to their success. His in-your-face style, counter-jungling prowess, and potent dueling make him one of the most fearsome players on the Rift. With his aggressive style, he tends to favor dueling champions like Graves, Lee Sin, and Rek’Sai.</p>\n\n<p>Condi was instrumental in Team WE’s dismantling of Royals Never Give Up in the 2017 LPL Spring Split Finals. He consistently sliced through the enemy frontline and deleted the enemy damage dealers, turning even fights into blowouts. After the match, a tearful Condi couldn’t find any words except “I am so grateful to my teammates!” Let’s hope we see the same type of emotion and dominance as Condi travels to Rio to take on the world’s best at the 2017 Mid-Season Invitational.</p>","pl_PL":"Renjie „Condi” Xiang to chiński specjalista od wykradania Baronów. Skradł więcej mocy purpurowego potwora niż jakikolwiek inny dżungler w LPL od 2015 roku. Odkąd dołączył do Team WE, Condi stał się motorem sukcesu drużyny. Jego bezpośredni styl gry, sprawność w kontrowaniu dżunglowania i świetne umiejętności pojedynkowe sprawiają, że jest jednym z najgroźniejszych graczy na Summoner’s Rift. Ze względu na swój agresywny styl najchętniej wybiera pojedynkujących się bohaterów, takich jak Graves, Lee Sin i Rek’Sai. Condi odegrał główną rolę w rozbiciu przez Team WE drużyny Royal Never Give Up w finale wiosennego splitu LPL 2017. Regularnie przebijał się przez wrogą linię frontu i kasował zadających obrażenia przeciwników, zmieniając wyrównane walki w prawdziwą rzeź. Po meczu Condi ze łzami w oczach nie potrafił znaleźć innych słów niż: „Jestem tak bardzo wdzięczny moim kolegom z drużyny!”. Mamy nadzieję zobaczyć podobne emocje i dominację, gdy Condi wyruszy do Rio, by walczyć z najlepszymi na świecie podczas Mid-Season Invitational 2017.","es_ES":"Renjie ''Condi'' Xiang es el ladrón de Barones chino por excelencia, pues ha conseguido robar los efectos del monstruo morado más que ningún otro jungla de la LPL desde 2015. Desde que se unió a Team WE, Condi ha sido fundamental para el éxito del equipo. Su estilo enérgico, su habilidad para robar la jungla enemiga y su potente capacidad para batirse en duelo lo convierten en uno de los jugadores más temidos de la Grieta. Como su estilo es agresivo, suele optar por campeones capaces de batirse en duelo como Graves, Lee Sin o Rek'Sai. Condi fue una pieza clave para la victoria de Team WE contra Royal Never Give Up en la final del split de primavera de la LPL 2017. Consiguió de forma sistemática ignorar al frente enemigo y aplastar a sus campeones de daño, cambiando las tornas del combate a su favor. Tras la partida, con lágrimas en los ojos, Condi solo pudo articular las siguientes palabras: ''¡Les doy gracias infinitas a mis compañeros de equipo!''. Esperamos que se muestre igual de emocionado y dominante cuando viaje a Río para derrotar a los mejores del mundo en el Mid-Season Invitational 2017.","de_DE":"Renjie „Condi“ Xiang ist Chinas Experte, wenn es um das Stehlen von Barons geht (seit 2015 hat er sich die Kräfte des violetten Monsters häufiger zunutze gemacht, als alle anderen Jungler in der LPL)  Seit seinem Wechsel zu Team WE ist Condi für den Erfolg der Mannschaft unerlässlich. Sein aggressiver Stil, seine Stärke im gegnerischen Dschungel und seine Entscheidungen in Duellen machen ihn zu einem der gefährlichsten Spieler in der Kluft. Durch seine Aggressivität bevorzugt er Champions wie Graves, Lee Sin und Rek’Sai. Condi war maßgeblich daran beteiligt, dass Team WE Royal Never Give Up im Finale des Frühjahrs-Splits der LPL 2017 vernichten konnte. Er kämpfte sich immer wieder durch die Frontlinie seiner Gegner, vernichtete die feindlichen Carrys und machte aus ausgeglichenen Kämpfen Gemetzel. Das Einzige, was der überwältigte Condi nach dem Spiel sagen konnte war: „Ich bin meinen Mannschaftskameraden so dankbar!“ Hoffentlich sehen wir auch beim Mid-Season Invitational 2017 so viel Emotion und Dominanz, wo es Condi mit den Besten der Welt zu tun bekommt.","pt_BR":"<p>Renjie “Condi” Xiang é o especialista em roubos de Barão na China, tendo roubado o poder do monstro roxo mais vezes do que qualquer outro caçador da selva na LPL desde 2015. Desde que entrou para a Team WE, Condi tem sido crucial para o seu sucesso. Seu estilo de partir para cima, sua proeza em invasões da selva e seu forte desempenho em duelos fazem dele um dos jogadores mais temíveis no Rift. Com seu estilo agressivo, ele costuma preferir Campeões como Graves, Lee Sin e Rek’Sai. </p>\n\n<p>Condi foi fundamental para o desmantelamento da Royal Never Give Up por parte da Team WE na final da Etapa de Primavera da LPL 2017. Ele consistentemente rasgava a linha de frente inimiga e destruía os causadores de dano, transformando lutas equilibradas em vitórias unilaterais. Depois da partida, com lágrimas nos olhos, Condi conseguiu dizer apenas: “Sou muito grato aos meus companheiros de equipe!” Vamos torcer para ver o mesmo tipo de emoção e dominação agora que Condi viaja ao Rio para enfrentar os melhores do mundo no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Renjie “Condi” Xiang</strong> es el experto en robos de Barón de China, logra robar más de los poderes del monstruo morado que ningún otro junglero en el LPL desde 2015. Desde que se unió al Team WE, <strong>Condi</strong> ha sido clave para su éxito. Tiene un estilo de juego provocativo, destreza para el contrajungleo y es un duelista muy fuerte, lo que lo hace uno de los jugadores más atemorizantes de la Grieta. Con su estilo agresivo tiende a favorecer a los campeones duelistas como Graves, Lee Sin y Rek’Sai. Condi fue clave para el desmantelamiento de los Royal Never Give Up en manos del Team WE en las finales del 2017 del Torneo de Apertura LPL. Abrió la línea frontal del enemigo constantemente y eliminó a todos los enemigos que infligían daño para convertir las peleas justas en palizas. Después de la partida, <strong>Condi</strong> estaba lleno de lágrimas y no podía decir otra cosa más que: <i>\"¡Estoy tan agradecido con mis compañeros!\"</i> Esperamos ver el mismo tipo de emoción y dominio mientras <strong>Condi</strong> viaja a Río para participar en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"4218","TRLH1":"200000401","TRLH2":"200000301","TRLT3":"200000229"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1038,"slug":"957","name":"957","firstName":"Changyu","lastName":"Ke","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/957-fcqbzhtx.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:09.000Z","updatedAt":"2017-07-07T17:52:32.000Z","bios":{"en_US":"<p>Changyu “957” Ke kicked off his career in 2015 as the starting top laner for Team WE’s developmental squad, Team WE Future. It was there that he established himself as a reliable option and as his repertoire grew, his sister team began to take notice. In early 2016, 957 made the jump to Team WE’s LPL squad where he made an immediate difference. His steady, low maintenance play on stalwarts like Maokai, Poppy, and Nautilus provided Team WE with a dependable presence in the top lane.</p>\n\n<p>He requires notoriously low resources in game, freeing up his teammates to farm gold and kills to their heart’s content. He doesn’t mind though, because once opponents come up against him late game, chances are that he’s already an unkillable mega tank. 957’s consistency will truly be tested as he heads to Rio to clash with the best top laners the world has to offer at the 2017 Mid-Season Invitational.</p>","de_DE":"Changyu „957“ Ke begann seine Karriere 2015 als Top-Laner für die Entwicklungsmannschaft von Team WE, Team WE Future. Dort konnte er sich als verlässliche Option etablieren und als er sich weiter steigerte, wurde seine Schwestermannschaft auf ihn aufmerksam. Anfang des Jahres 2016 wechselte 957 schließlich zu Team WE in die LPL, wo er sofort einen Unterschied ausmachte. Seine stabilen Leistungen mit Champions wie Maokai, Poppy und Nautilus verliehen Team WE eine verlässliche Präsenz auf der oberen Lane. Er benötigt nur sehr wenige Ressourcen und überlässt das Gold und die Tötungen seinen Mannschaftskameraden. Aber das stört ihn nicht, denn wenn die Gegner ihm im späten Spiel zu Leibe rücken, ist er in der Regel bereits ein unsterblicher Mega-Tank. Beim Mid-Season Invitational 2017 in Rio wird 957s Beständigkeit auf die Probe gestellt, wenn er es mit den besten Top-Lanern der Welt zu tun bekommt.","es_ES":"Changyu ''957'' Ke comenzó su trayectoria en 2015 como top titular del grupo en desarrollo de Team WE, Team WE Future. A partir de entonces, demostró ser una opción fiable y, a medida que él fue aumentando su repertorio de campeones, el equipo hermano de Team WE comenzó a hacerse notar. A comienzos de 2016, 957 se unió al grupo de la LPL de Team WE y no tardaría en marcar la diferencia. Su estilo de juego estable y de bajo mantenimiento, con campeones resistentes como Maokai, Poppy y Nautilus, aportó a Team WE una presencia de fiar en la calle superior. Necesita muy pocos recursos durante la partida, lo que permite que sus compañeros de equipo puedan farmear y llevarse asesinatos libremente. Y eso no es algo que le afecte, pues cuando los oponentes intenten enfrentarse a él al final de la partida, es probable que ya sea un megatanque inmortal. La estabilidad de 957 será puesta a prueba en Río cuando se enfrente a los mejores jugadores de la calle superior del mundo en el Mid-Season Invitational 2017.","fr_FR":"Changyu „957” Ke rozpoczął karierę w 2015 roku jako główny górny rozwojowego składu Team WE, Team WE Future. Tam pokazał, że jest solidnym zawodnikiem i gdy rozszerzył swój repertuar, siostrzana drużyna zaczęła na niego zwracać uwagę. Na początku 2016 roku 957 przeszedł do występującego w LPL składu Team WE i osiągnięcia drużyny natychmiast się poprawiły. Jego równa, zużywająca niewiele zasobów gra podporami drużyny, takimi jak Maokai, Poppy i Nautilus, zapewniła Team WE stałą obecność na górnej alei. 957 w dalszym ciągu zużywa niewiele zasobów w grze, umożliwiając kolegom farmienie złota i zabójstw, ile dusza zapragnie. Nie przeszkadza mu to wcale, ponieważ gdy przeciwnicy ruszą przeciwko niemu w późnej fazie gry, są duże szanse na to, że będzie już wtedy niemożliwym do zabicia megaobrońcą. Konsekwentny styl gry 957 zostanie poddany prawdziwej próbie, gdy zawodnik pojedzie do Rio, by zetrzeć się z najlepszymi górnymi, jakich ma do zaoferowania świat, na Mid-Season Invitational 2017.","pt_BR":"<p>Changyu “957” Ke começou sua carreira em 2015 como o jogador da rota superior da equipe de formação da Team WE, a Team WE Future. Foi lá que ele se estabeleceu como uma opção confiável, e à medida que seu repertório cresceu, sua equipe irmã começou a prestar atenção nele. No início de 2016, 957 foi transferido para a equipe da LPL da Team WE, onde logo de cara fez a diferença. Seu desempenho estável e econômico com Campeões como Maokai, Poppy e Nautilus fez dele uma presença sustentadora para a Team WE na rota superior. </p><p>Ele consome pouquíssimos recursos no jogo, permitindo que seus companheiros de equipe coletem ouro e abates à vontade. E ele não se importa, porque quando seus oponentes o enfrentam nos estágios mais avançados do jogo, ele geralmente já virou um mega tanque simplesmente invencível. A consistência de 957 será colocada à prova em seu rumo ao Rio, onde ele enfrentará os melhores jogadores da rota superior que o mundo tem a oferecer no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Changyu \"957\" Ke</strong> comenzó su carrera en 2015 como el carrilero superior del escuadrón en desarrollo del Team WE, el Team WE Future. Ahí se estableció como una opción confiable y mientras su repertorio crecía su equipo hermano comenzó a notarlo. A principios del 2016, <strong>957</strong> pasó al escuadrón LPL del Team WE, en donde hizo una diferencia inmediatamente. Su juego firme, pero de bajo mantenimiento con opciones fuertes como Maokai, Poppy y Nautilus brindan al Team WE una presencia confiable en el carril superior. Él necesita recursos increíblemente bajos en una partida, lo que permite que sus compañeros coleccionen oro y asesinatos como les apetezca. No le molesta porque cuando los oponentes lo enfrentan en el juego tardío, es probable que ya sea un megatanque inmortal. La coherencia de <strong>957</strong> será puesta a prueba mientras se dirige hacia Río para enfrentarse con los mejores carrileros superiores del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000400","TRLH2":"200000300","TRLT3":"200000228"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1428,"slug":"ben","name":"Ben","firstName":"Donghyun","lastName":"Nam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben-1yppxrjt.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:25:24.000Z","updatedAt":"2017-07-07T22:23:11.000Z","bios":{"en_US":"<p>Donghyun “Ben” Nam started his professional career in the summer of 2016 when he was signed by Invictus Gaming. He unfortunately didn’t have many chances to showcase his talent when he was with Invictus, but since joining Team WE in late 2016, he’s been able to show glimpses of his mechanical prowess on the Rift. He was largely unknown before joining up with Team WE, but the LPL has been abuzz with his name ever since.</p>\n\n<p>It took him awhile to sync up with lane mate Mystic, but with his mechanical ceiling many fans are clamoring for more from him. After helping his team sweep Royal Never Give Up in the finals, Ben has the chance to show the world how supports can carry games. He’s looking to shine as he squares off against international competition for the first time at the 2017 Mid-Season Invitational.</p>","de_DE":"Donghyun „Ben“ Nam begann seine professionelle Karriere im Sommer 2016, als er bei Invictus Gaming unterschrieb. Leider konnte er bei Invictus sein Talent nur selten unter Beweis stellen, aber seit seinem Wechsel zu Team WE Ende 2016 stellte er immer wieder sein mechanisches Können unter Beweis. Vor seinem Wechsel zu Team WE war er noch Großteils unbekannt, aber seither kennt die ganze LPL seinen Namen. Es hat eine Weile gedauert, bis er sich auf seinen Lane-Partner Mystic eingestellt hatte, aber aufgrund seines mechanischen Könnens erwarten viele Fans noch mehr von ihm. Nachdem er seiner Mannschaft im Finale des Frühjahrs-Splits der LPL geholfen hat, mit Royal Never Give Up den Boden aufzuwischen, bekommt Ben jetzt die Chance, der Welt zu zeigen, wie man als Supporter Spiele entscheidet. Er wird sein Bestes geben, wenn er beim Mid-Season Invitational 2017 auf die internationale Konkurrenz trifft.","es_ES":"Donghyun ''Ben'' Nam comenzó su carrera profesional en el verano de 2016, cuando fue fichado por Invictus Gaming. Por desgracia, no tuvo muchas oportunidades para mostrar su talento cuando jugó con Invictus, pero desde que se unió a Team WE al final de 2016, ha podido hacer gala de sus destrezas en la Grieta. No era apenas conocido cuando se unió a Team WE, pero su nombre no ha dejado de repetirse en la LPL desde entonces. Tardó un tiempo en congeniar con su compañero de calle, Mystic, pero sus capacidades mecánicas son tan buenas que sus fans aún quieren más. Tras ayudar a su equipo a vencer a Royal Never Give Up en la final, Ben ahora tiene la oportunidad de demostrarle al mundo que los apoyos también pueden liderar a su equipo hasta la victoria. Intentará darlo todo cuando pise el escenario internacional por primera vez en el Mid-Season Invitational 2017.","pl_PL":"Donghyun „Ben” Nam zaczął profesjonalną karierę latem 2016 roku, gdy został zwerbowany przez Invictus Gaming. Niestety nie miał wielu okazji, by zademonstrować swój talent, grając z Invictus, dopiero odkąd dołączył do Team WE pod koniec 2016 roku może się popisywać umiejętnościami mechanicznymi na Summoner’s Rift. Przed dołączeniem do Team WE nie był szerzej znany, ale od tamtej pory LPL nie przestaje o nim mówić. Zgranie się z kolegą z alei, Mysticem, zajęło mu trochę czasu, jednak teraz fani domagają się od niego jeszcze więcej, znając górny pułap jego umiejętności mechanicznych. Po tym, jak pomógł swojej drużynie zmieść Royal Never Give Up w finale, Ben ma szansę pokazać światu, że wspierający także potrafią prowadzić do zwycięstwa w grach. Podczas swojego pierwszego starcia z rywalami z całego świata na Mid-Season Invitational 2017 na pewno spróbuje zabłysnąć.","pt_BR":"<p>Donghyun “Ben” Nam começou sua carreira profissional na metade de 2016, quando foi contratado pela Invictus Gaming. Ele infelizmente não teve muitas oportunidades de demonstrar seu talento enquanto esteve na Invictus, mas desde que entrou para a Team WE no final de 2016, temos tido vislumbres da sua proeza mecânica no Rift. Ele era bastante desconhecido antes de se juntar à Team WE, mas desde então seu nome é um dos mais citados na LPL. </p>\n\n<p>Sua sincronia com seu companheiro de rota, Mystic, não foi imediata, mas com seu alto nível de mecânica, muitos fãs estão ansiosos para vê-lo jogar mais. Após ter ajudado sua equipe a massacrar a Royal Never Give Up na final, Ben agora tem a chance de mostrar ao mundo como suportes podem carregar partidas. Ele pretende brilhar no Mid-Season Invitational 2017, onde enfrentará competidores internacionais pela primeira vez.</p>","es_AR":"<p><strong>Donghyun \"Ben\" Nam</strong> comenzó su carrera profesional en el verano de 2016 cuando entró a Invictus Gaming. Por desgracia, no tuvo muchas oportunidades de demostrar su talento cuando estuvo en Invictus, pero desde que se unió al Team WE a fines de 2016, ha podido mostrar destellos de su poderío mecánico en la Grieta. No era famoso antes de unirse al Team WE, pero LPL no deja de oír su nombre desde entonces. Le tomó un tiempo sincronizarse con su compañero de carril, <strong>Mystic</strong>, pero debido a sus habilidades mecánicas muchos seguidores lo aclaman. Después de ayudar a su equipo a ganar el Royal Never Give Up en las finales, <strong>Ben</strong> tuvo la oportunidad de mostrarle al mundo cómo los soportes pueden ser acarreadores en las partidas. Busca destacar en la competencia internacional por primera vez en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000406","TRLH2":"200000306"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1646,"slug":"betty","name":"Betty","firstName":"Yu-Hung","lastName":"Lu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betty-i225lkpn.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-01-09T22:47:23.000Z","updatedAt":"2017-07-06T14:28:07.000Z","bios":{"en_US":"<p>Yu-Hung \"Betty\" Lu is the standout rookie AD carry for the Flash Wolves. He joined the squad late last year, replacing former starter NL. Formerly known as \"DoubleRed,\" he made his debut at IEM Oakland and later picked up his first trophy at the IEM World Championship in Katowice. He continued to impress in the 2017 LMS Spring Split, leading all AD carries with an 8.8 KDA. He excelled on Ashe and Varus, going 16-0 combined on those two champions.</p>","pl_PL":"Yu-Hung „Betty” Lu jest wyróżniającym się debiutantem w roli prowadzącego Flash Wolves. Dołączył do drużyny pod koniec zeszłego roku, zastępując wcześniejszego zawodnika pierwszego składu, NL-a. Znany dawniej jako „DoubleRed” debiutował na IEM Oakland, a później zdobył swoje pierwsze trofeum na Mistrzostwach Świata IEM w Katowicach. \n\nNie przestawał imponować podczas splitu wiosennegoLMS 2017, stając się liderem wszystkich prowadzących z 8,8 Z/Z/A. Błyszczał, grając Ashe i Varusem, i w efekcie zdobył z tą dwójką bohaterów łączny wynik 16−0. Teraz jego determinacja zostanie przetestowana podczas Mid-Season Invitational 2017, na którym zmierzy się z kilkoma najlepszymi dolnymi, jakich zna świat.\n","fr_FR":"Yu-Hung « Betty » Lu est le jeune carry AD prodige des Flash Wolves. Il a rejoint la formation l'année dernière, remplaçant NL. Anciennement connu sous le pseudo « DoubleRed » Betty a fait ses débuts aux IEM d'Oakland et a, par la suite, remporté son premier trophée lors des IEM World Championship de Katowice. \n\nIl a fait forte impression lors du segment de printemps 2017 de la région LMS, dominant tous les carrys AD avec un KDA de 8,8. Lors du championnat, il a fait des merveilles avec Ashe et Varus en réalisant une série de victoires combinées de 16-0 avec ces deux personnages. Sa résolution sera mise à l'épreuve lors du Mid-Season Invitational 2017, où il affrontera certains des meilleurs spécialistes au monde de la voie du bas.\n","es_ES":"Yu-Hung ''Betty'' Lu es el prodigioso novato ADC de Flash Wolves. Se unió al grupo al final del año pasado, para reemplazar al titular NL. Conocido anteriormente como ''DoubleRed'', hizo su debut en el IEM Oakland y no tardaría en conseguir su primer trofeo en el IEM World Championship de Katowice. \n\nSiguió sorprendiendo al público en el split de primavera de la LMS 2017, donde superó a todos los carries con un A/M/A de 8,8 puntos. Destacó con campeones como Ashe y Varus, con los que consiguió quedar 16-0. Ahora tendrá que demostrar su determinación en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores dúos de bot del mundo.\n","de_DE":"Yu-Hung „Betty“ Lu ist der AD-Carry der Flash Wolves und ein herausragender Nachwuchsspieler. Er stieß Ende des letzten Jahres als Ersatz für NL zur Mannschaft. Betty, früher bekannt als „DoubleRed“, gab sein Debüt beim IEM Oakland und gewann seinen ersten Titel bei der IEM-Weltmeisterschaft in Katowice. \n\nEr konnte auch im Frühjahrs-Split der LMS 2017 beeindrucken, wo er mit einer TTU von 8,8 der beste AD-Carry war. Dabei lieferte er vor allem mit Ashe und Varus überragende Leistungen ab, mit denen er zusammen 16 Spiele gewinnen konnte. Beim Mid-Season Invitational 2017 wird er seine Entschlossenheit unter Beweis stellen müssen, wenn er es auf der unteren Lane mit einigen der besten Duos der Welt zu tun bekommt.\n","pt_BR":"<p>Yu-Hung \"Betty\" Lu é o carregador novato de destaque da Flash Wolves. Ele entrou na equipe no final do ano passado, substituindo o antigo titular NL. Anteriormente era conhecido como \"DoubleRed\" e seu debut foi na IEM Oakland. Mais tarde, ele pegou seu primeiro troféu no Campeonato Mundial IEM, em Katowice. </p>\n\n<p>Ele continuou a impressionar na Etapa de Primavera LMS 2017, liderando todos os carregadores com uma AMA de 8,8. Ele foi excelente com a Ashe e o Varus, com 16-0 combinado na soma dos dois Campeões. Sua determinação será testada no Mid-Season Invitational 2017, onde ele enfrentará alguns dos melhores jogadores de rota inferior que o mundo tem a oferecer.</p>"},"foreignIds":{"TRTW":"200000015","TRLT3":"200000255","TRLH1":"200000437","TRLH2":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1849,"slug":"cyo","name":"Cyo","firstName":"Shi-Yo","lastName":"Lin","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2017-03-17T19:03:22.000Z","updatedAt":"2017-07-06T14:38:40.000Z","bios":{},"foreignIds":{"TRTW":"200000452","TRLT3":"200000204"},"socialNetworks":{},"champions":[],"liveGameTeam":91},{"id":1991,"slug":"zbb","name":"Zbb","firstName":"Zhi","lastName":"Ke","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:24:21.000Z","updatedAt":"2017-06-07T00:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1992,"slug":"laozhou","name":"Laozhou","firstName":"Chao","lastName":"Zhou","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:17:21.000Z","updatedAt":"2017-07-07T17:53:44.000Z","bios":{},"foreignIds":{"TRLT3":"200000233"},"socialNetworks":{},"champions":[],"liveGameTeam":82}],"scheduleItems":[{"id":"AV0VpWjboUG4HPFjOKX9","content":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:match:b22524c9-aaf8-4a95-a069-b90bd1abf7b0","scheduledTime":"2017-07-07T09:00:00.064+0000","tags":{"blockLabel":"2","blockPrefix":"day","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:bracket:9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5"},"match":"b22524c9-aaf8-4a95-a069-b90bd1abf7b0","tournament":"093599e3-e07d-4b43-8430-3e03b644b1f5","bracket":"9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","league":"43"}],"gameIdMappings":[{"id":"76dad077-4b84-44ac-a5d0-7985b76adc9c","gameHash":"4ed99b72cd610163"}],"videos":[{"id":7768,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:game:76dad077-4b84-44ac-a5d0-7985b76adc9c","source":"https://www.youtube.com/embed/6jemOBvXPuo?wmode=transparent&start=16088&rel=0","createdAt":"2017-07-07T17:45:43.000Z","updatedAt":"2017-07-07T17:45:43.000Z","game":"76dad077-4b84-44ac-a5d0-7985b76adc9c"}],"htmlBlocks":[],"match":{"id":"b22524c9-aaf8-4a95-a069-b90bd1abf7b0","name":"R1M3","position":2,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":0},{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":0}],"games":{"76dad077-4b84-44ac-a5d0-7985b76adc9c":{"id":"76dad077-4b84-44ac-a5d0-7985b76adc9c","name":"G1","generatedName":"FW|WE|G1|b22524c9aaf84a95a069b","input":[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":0},{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":0}],"standings":{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":0}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":0}]],"timestamp":1499449395011,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":0}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":0}]],"timestamp":1499447635461,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d","breakpoint":"add8b5cc-9e20-4027-8877-29abd6d2d65b","standing":0}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":0}]],"timestamp":1499447036044,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"180194","gameRealm":"TRLT3","platformId":"TRLT3:180194","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d"}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1"}]],"timestamp":1499449395011,"source":"bestOf","history":[{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d"}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1"}]],"timestamp":1499447635461,"source":"bestOf","closed":true},{"result":[[{"roster":"07c635f3-23a0-4f43-a8a2-9e40c551d10d"}],[{"roster":"5f39a703-b5ab-4bb5-add3-4710476b96a1"}]],"timestamp":1499447036044,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}