{"teams":[{"id":110,"slug":"team-liquid-academy","name":"Team Liquid Academy","guid":"be6ee51c-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/team-liquid-academy-2kj6vx6x.png","acronym":"TLA","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-08-03T17:45:48.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3807"},"players":[44,250,529,549,1098,1105],"starters":[44,250,529,549,1105],"subs":[1098]},{"id":221,"slug":"apex-pride","name":"Apex Pride","guid":"be7142e6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/apex-pride-5t4zz3qg.png","acronym":"APP","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-06-02T23:57:05.000Z","updatedAt":"2016-07-01T21:18:17.000Z","bios":{},"foreignIds":{},"players":[78,144,148,275,395,746,1100],"starters":[78,148,275,395,746],"subs":[144,1100]}],"players":[{"id":44,"slug":"piglet","name":"Piglet","firstName":"Gwang-jin","lastName":"Chae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/piglet-4smmppa.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-05-25T17:21:49.000Z","bios":{"en_US":"<p>Gwang-jin “Piglet” Chae experienced the highest highs a League of Legends pro player can experience when he took home the Summoner’s Cup at the 2014 World Championship. But he has since had to endure some of the lowest lows to get another shot at glory. He struck out into the unknown and joined Liquid. It’s been a rocky road which eventually led to Piglet stepping down to play with Team Liquid Academy.</p>\n\n<p>After opting to play largely with Team Liquid Academy in 2016, Piglet is finally making his return to Team Liquid and the NA LCS. Piglet’s mechanical skill is the stuff of legends, and he’s renown for his ability to make even the most skillful plays look deceptively easy. Quite simply: Piglet is a playmaker that Team Liquid has gone far too long without. The kind of firepower that Piglet is capable of unleashing has the potential to make Team Liquid an instant contender for the NA LCS throne. Bot lane beware -- Piglet is back.</p>","fr_FR":"<p>Gwang-jin « Piglet » Chae a vécu ce qu'un joueur pro de League of Legends peut vivre de plus\n\nfantastique ; il a rapporté chez lui la Coupe de l'invocateur du mondial 2014. Mais depuis, il a dû \n\nsupporter le pire du pire dans l'espoir de revivre cette heure de gloire. Après s'être lancé dans l'inconnu \n\nen rejoignant Team Liquid de l'autre côté de l'océan, Piglet s'est pris un mur. Les choses ne se passaient \n\npas comme prévu. Au lieu de mener son équipe au sommet des LCS, il s'est retrouvé sur le banc de \n\ntouche pendant qu'un jeune n'ayant pratiquement aucune expérience pro jouait son rôle.</p>\n\n<p>Mais Piglet n'a pas été champion du monde par hasard et il a su relever ce nouveau défi. S'entraînant \n\nencore plus qu'avant, donnant tout pour établir une vraie synergie avec ses coéquipiers, Piglet et Liquid \n\nsont finalement parvenus à se fondre dans une entité efficace. Malgré quelques difficultés persistantes, \n\nPiglet retrouve peu à peu sa forme d'antan. Profitant pleinement des compétences techniques qui lui \n\navaient permis de remporter le championnat du monde, Piglet ne vise plus qu'un seul objectif : revenir \n\nune fois encore sur la plus grande scène que l'e-sport de LoL puisse offrir.</p>","pl_PL":"<p>Ten utalentowany AD Carry pojawił się na scenie esportowej League of Legends w lutym 2013 roku. Jako debiutant, doświadczony tylko w solo que, dołączył do SK Telecom T1 2. Ten skład został utworzony wokoło  Lee’a \"Faker\" Sang-hyeoka, jako siostrzana drużyna SK Telecom T1 1. \"Piglet\" wraz z ekipą osiągnęli powodzenie już na pierwszym turnieju, pomimo tego, że w większości byli nowicjuszami. Co prawda zajęli tylko trzecie miejsce, ale dzięki temu zaistnieli wśród najlepszych w Korei, pokonując m.in. CJ Entus Frost. Zaledwie parę miesięcy później pokazali na co naprawdę ich stać, wygrywając HOT6iX Champions Summer 2013. Dzięki zdobytym punktom na tym wydarzeniu, zdecydowane zwycięstwozagwarantowało Chae’owi \" Gwang-jinowi wejście do Mistrzostw Świata 2013 z trzeciego miejsca w Korei. Tam, na arenie międczynarodowej, \"Piglet\" pokazał jak bardzo wybitnym jest AD Carrym. Z grupy SKT T1 wyszło z wynikiem 7:1, tracąc tylko jedną grę przeciwko OMG. W fazie eliminacji tylko Najin Black Swordz powodzeniem stawiło czoła ich potędze, przegrywając z SKT T1 2:3. Tytuł mistrza świata to zdecydowanie największy sukces Chae’a Gwang-jina.</p>\n<p>\nCzwarty sezon w Korei rozpoczął kolejnymi triumfami, lecz wraz z upływem czasu SKT T1 coraz gorzej sobie radziło. Ostatecznie, we wrześniu 2014 roku, \"Piglet\" i jego partner \"PoohManDu\"  pożegnali się z tą organizacją. Wspomnieniem po tej współpracy pozostały skarpetki Chae’a Gwang-jina z Kubusiem Puchatkiem, które nosił podczas meczów ze swoim supportem, ponieważ przynosiły mu szczęście. Taki talent nie mógł zostać wolnym strzelcem zbyt długo, już październiku 2014 roku dostał ofertę od Team Curse. Po przeprowadzce do Stanów Zjednoczonych czekało go dużo pracy – pokonanie bariery językowej, problemy z wizą i zyskanie komunikacji z nowym kolegami. Jednak znany z zaangażowania \"Piglet\" dał z siebie wszystko. W końcu, w letnim sezonie 2015, już pod marką Team Liquid, udało mu się znaleźć na szczycie NA LCS.</p>\n<p> \nDo jego osobistych osiągnięć przede wszystkim należy nagroda za najlepszego AD Carry podczas 2013 Korea e-Sports Awards. Dokonał tego głównie grając swoją ulubioną postacią – Vayne. Poza nią, częściej od innych bohaterów, wybiera Ezreala, Corkiego i Caitlyn.Wspominając swoje najszczęśliwsze momenty w życiu, jako pierwszy przytacza dostanie się do SKT T1, a jako drugi z kolei wygranie OGN Summer 2013. Słynie ze swojego niezmiennego, defensywnego stylu gry i godnej podziwu pozycji w walkach drużynowych. To bardzo dumny zawodnik, poważnie traktujący rywalizację z AD Carry z innych zespołów, w szczególności z Gu’em \"Imp\" Seung-binem. Wśród innych graczy wyróżnia go sumienność i pracowitość. Przez to, że sypiał po 4 do 5 godzin i ćwiczył swoje umiejętności w League of Legends przez kolejne 15 do 16, zyskał przydomek „Practice Worm”. Można również o nim powiedzieć, że jest emocjonalny. Wielokrotnie reagował na krytykę lub porażkę bardzo silnie, w szczególności w kontaktach ze swoimi trenerami i menadżerami.\n</p>","de_DE":"Gwang-jin „Piglet“ Chae hat alle Höhen eines professionellen „League of Legends“-Spieler erlebt, als er die Weltmeisterschaft 2014 gewann und den Beschwörerpokal mit nach Hause nahm. Seither musste er jedoch auch einige Tiefen verkraften, um wieder eine Chance auf Ruhm und Ehre zu bekommen. Er machte sich auf ins Unbekannte und wechselte zu Liquid. Es war ein steiniger Weg, der schließlich dazu führte, dass sich Piglet zurückzog und für Team Liquid Academy spielte. \n</p>\nNachdem Piglet sich entschieden hatte, 2016 hauptsächlich für Team Liquid Academy zu spielen, kehrt er schließlich wieder zu Team Liquid in die NA LCS zurück. Piglets mechanisches Können ist legendär, und er ist bekannt dafür, selbst die schwierigsten Spielzüge ganz einfach aussehen zu lassen. Es ist ganz einfach: Piglet ist der Spielmacher, auf den Team Liquid zu lange verzichten musste. Die Feuerkraft, die in Piglet steckt, kann Team Liquid sofort zu einem Anwärter auf den Thron der NA LCS machen. Die untere Lane sei gewarnt – Piglet ist zurück.\n"},"foreignIds":{"drupalId":"690","TRLH1":"200000244","TRLH2":"200000148"},"socialNetworks":{"twitch":"","twitter":"https://twitter.com/LiquidPiglett"},"champions":[],"liveGameTeam":110},{"id":78,"slug":"diamondprox","name":"Diamondprox","firstName":"Danil","lastName":"Reshetnikov","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/diamondprox-gx80qbxc.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:33.000Z","updatedAt":"2016-06-15T22:40:21.000Z","bios":{"en_US":"<p>Danil “Diamondprox” Reshetnikov was one of the most innovative junglers in the world during Season 2. Diamondprox’s overwhelming map control kickstarted an aggressive counter-jungling strategy that continues to influence the League of Legends meta even now. </p>\n\n<p>Despite struggling to make an impact in the 2014 and 2015 EU LCS, Diamondprox was still regarded as one of the best junglers in Europe. The Unicorns of Love took Diamondprox in during the 2015 offseason, betting that his prior experience would be a boon for their revamped squad. Now, Apex Pride are hoping he can help them earn a spot in the NA LCS.</p>","fr_FR":"<p>Comme dans tout sport, il y a dans League of Legends des joueurs qui ont marqué leur époque, et le Russe Danil « Diamondprox » Reshetnikov est de ceux-là. Il se fait repérer alors qu’il n’est que platine, rejoint l’équipe Empire (qui deviendra Moscow Five) et domine très vite la scène européenne, allant jusqu’à impressionner à l’international. Diamondprox se démarque par sa capacité d’adaptation et son inventivité. Nombre d’observateurs estiment que c’est lui qui a inventé la tactique du counter-jungle, pratique à laquelle il s’adonne particulièrement bien avec Shyvana. Moscow Five est alors connue pour ses excellents résultats lors des compétitions majeurs et principalement lors des différentes éditions des Intel Extreme Masters.</p>\n\n<p>M5 et Diamondprox confirment leur supériorité sur la scène européenne en remportant les finales régionales, ce qui les qualifie d’office pour le mondial 2012. Considérés comme favoris, les M5 surprennent en s’inclinant en demi-finale face aux futurs champions du monde, les Taipei Assassins. Après quelques autres contre-performances, Diamondprox et ses coéquipiers (qui jouent désormais pour Gambit Gaming) réussissent à vaincre les équipes coréennes Azubu Frost et Azubu Blaze aux IEM Katowice 2013, avec un Diamondprox sur Xin Zhao pendant la majorité du temps.</p>\n\n<p>Dès la première occurrence, les M5 prennent part aux League of Legends Championship Series. Diamondprox participe énormément au succès de l’équipe et dicte la méta. Il est le pionnier du Nasus jungle, se démarque par son utilisation de Volibear, marque les esprits avec ses variantes d’Evelynn et va même jusqu’à invoquer Karma. Son équipe n’est plus maîtresse de la région mais obtient la 2e place de la saison de printemps et la 3e de la saison d’été, guidée par son agressivité réfléchie.</p>\n\n<p>Avec le temps, les départs successifs de ses coéquipiers et les problèmes logistiques inhérents à la structure pour laquelle il joue, les résultats de Diamondprox se sont dégradés. Celui qui a été plébiscité par la communauté lors des deux premières éditions des All-Stars n’arrive plus à mener son équipe vers la victoire, bien qu’il reste l’un des meilleurs junglers européens. Après être passé à deux doigts de la relégation en 2015 et alors que Gambit a vendu sa place en LCS, Diamondprox cherche à donner un second souffle à sa carrière en rejoignant Unicorns of Love et compte bien prouver qu’une légende ne meurt jamais.</p>\n","pl_PL":"<p>Gwiazda League of Legends od wczesnego drugiego sezonu. Złośliwi wytykają, że czerwona, bo pochodzi z Rosji. Nie zmienia to faktu, że to jeden z graczy, którzy wywarli największy wpływ na zmianę mety w grze. Danil Reshetnikov zaistniał w drużynie Team Empire, która zaskoczyła inne popularne zespoły absolutnie nietypowymi zagraniami. Później ten sam skład zawodników był znany jako Moscow Five, a następnie Gambit Gaming. Cała rosyjska ekipa była znana z innowacyjnych wyborów i zagrań, jednak król nowości wśród nich to właśnie \"Diamondprox\". Można śmiało powiedzieć, że zrewolucjonizował grę w jungli wielokrotnie podczas istnienia sceny esportowej. Brakiem obaw przed porażką i ośmieszeniem otworzył drzwi dla wielu nowych postaci na tej pozycji, zainicjował między innymi wybór Karmy, Mundo i Nasusa. Oprócz zaskakującej selekcji bohaterów, zdumiewał również swoim stylem gry – na przykład sztuką kontrowania przeciwników w ich własnej jungli. Jednak wielbiciele i społeczeństwo najlepiej znają Danila z niezwykłych zagrań Lee Sinem i Evelynn.</p>\n<p>\n\"Diamondprox\" od wczesnego drugiego sezonu uczestniczył w życiu esportowym League of Legends. Można by długo wymieniać turnieje, które wygrał i te, w których znalazł się na podium, lecz najważniejszymi dokonaniami były jego występy na Mistrzostwach Świata i turniejach IEM. W wydarzeniu o najwyższej randze na scenie League of Legends wziął udział dwukrotnie – w drugim i trzecim sezonie. Za pierwszym razem zespół Moscow Five było jednym z faworytów – uległ w półfinale w walce z Taipei Assasins. Miarę tego osiągnięcia, można mierzyć w powszechnej opinii po tej imprezie, że z zachodnich drużyn tylko ta rosyjska może się mierzyć z Azjatami. Na Mistrzostwach Świata 2013 poszło jej gorzej, ponieważ Danil wraz z kolegami dotarli tylko to ćwierćfinałów. Co i tak było niesamowitym osiągnięciem jak na europejską ekipę. Zdecydowanie lepszy owoc zebrali na wydarzeniach IEM - \"Diamondprox\" dwukrotnie był półfinalistą i raz zwycięzcą podczas Mistrzostw Świata IEM. Ponadto czterokrotnie wygrali etapy kwalifikacyjne, podczas których dominowali tak doświadczonych przeciwników jak: Team SoloMid, Fnatic i Counter Logic Gaming. Przed wiosennym sezonem EU LCS 2016 pożegnał się z pozostałościami po legendarnej rosyjskiej drużynie i w poszukiwaniu swojego miejsca dołączył do Unicorns of Love.\nDanil to jeden z bardzo małego grona graczy, które znalazło swoją drugą połówkę i się ożeniło. Podobnie jak jego kolega z drużyny, „Alex Ich”, trafił na swoją sympatię, kiedy profesjonalnie grał w League of Legends. \"Diamondprox\" spotkał „Rogue” w solo que po przeciwnej stronie barykady i w tym starciu Darina została upokorzona przez jego grę Skarnerem. W związku z czym padło parę ostrych słów między nimi. Dlatego „Rogue” zauważyła, że w kolejnej grze jej rywalem znowu jest Danil. Tym razem pogratulował swojej konkurentce dobrej gry, a po meczu zaczęli ze sobą rozmawiać. Od słów do czynów, wkrótce potem zaczęli się ze sobą spotykać – jak widać miłość potrafi znaleźć ujście w najbardziej nieoczekiwanych momentach i miejscach. \n</p>","es_ES":"<p>La eterna leyenda rusa toma un nuevo rumbo. Por primera vez en su carrera profesional desde Octubre de 2011, Danil ‘Diamondprox’ Reshetnikov opta por cambiar de aires. El jugador proveniente de World of Warcraft que enamoró a todo el mundo en Team Empire, Moscow Five y Gambit Gaming decide por primera vez dejar la infraestructura que tantos éxitos le ha otorgado en el pasado para intentar solucionar un final de carrera con un declive pasivo.</p>\n\n<p>Diamondprox empezó en 2011 a jugar para Team Empire gracias a la invitación de su amigo y apoyo del equipo Edward ‘Gosu Pepper’ Abgaryan. Tan sólo dos meses durarían ambos bajo el nombre de Team Empire, puesto que en Diciembre de ese mismo año la plantilla sería fichada por Moscow Five y un mes más tarde ya estarían dando la sorpresa en la IEM Season VI – Global Challenge Kiev que ganarían ante los grandes equipos de Europa y Norteamérica. Con campeones como Shyvana y Lee Sin el joven ruso sacaba a la palestra un estilo agresivo de invasión hacia la jungla enemiga que chocó mucho a los jungla de apoyo de aquella época. Grandes jugadores de la historia de League of Legends han elogiado al jungla por su innovación y agresividad.</p>\n\n<p>En Marzo de 2012, Diamondprox volvería a la senda de la innovación adaptada a su estilo de juego en la IEM Season VI – World Championship disputada en Hannover. La aparición estelar de Nocturne con presencia global en el mapa permitió sorprender a sus rivales. Aunque la mayor alegría llegaría a los amantes de Udyr a causa de la aparición en el último partido de la final ante Dignitas como respuesta a la propia Shyvana que él mismo había popularizado.</p>\n\n<p>En ese mismo año llegaron los mejores momentos de Diamond como en la Dreamhack Summer 2012 o las finales regionales de la segunda temporada en Colonia. Aquel Moscow Five que estuvo a punto de llegar a la final del Campeonato Mundial 2012 en el que sólo perdió ante el vencedor Taipei Assasins. Este momento supuso la cúspide en la carrera del jugador que a partir de entonces no ha conseguido éxitos del mismo calibre. Todavía se recuerda esa arrasadora primera partida que disputó con Xin Zhao.</p>\n\n<p>Después del último gran torneo jugado como Moscow Five en la IPL5 debido al arresto del CEO del equipo, Diamondprox sólo consiguió mantener su estatus debido a grandes actuaciones las Intel Extreme Masters como la victoria en 2013 en Katowice ante Azubu Frost. El formato de liga regular de la League Championship Series no favoreció al jugador debido al distanciamiento de la organización de la sede en Colonia con problemas de visado, y poco a poco su nivel fue bajando hasta la actualidad. En el año 2013 fue votado para representar a Europa en el All Stars y en el Campeonato Mundial de 2013 se clasificaría para cuartos de final.</p>\n\n<p>Tanto 2014 como 2015 fueron años aciagos para el jungla. El primer año todavía mantuvo su caché a pesar de los malos resultados del equipo con buenas actuaciones mediante el uso de junglas agresivos, pero ya no volverían a clasificarse a un Campeonato Mundial y en los últimos tiempos el jugador sólo conserva detalles de calidad.</p>\n\n<p>En Unicorns of Love podría renacer. Su carácter innovador encaja perfectamente con el equipo, y supone un reto motivacional nuevo para el ruso. A pesar de ser introvertido, su privilegiada mente podría otorgar una mejora en la toma de decisiones, faceta de la que siempre ha carecido el equipo.</p>","de_DE":"<p>Wenn man eSports-Fans nach dem einen Jungler fragt, wird sicherlich aus vieler Munde der Name „Diamond“ ertönen. Nicht viele Europäer haben sich einen solchen, vor allem auch international anerkannten Ruf erspielen können. Er ist anpassungsfähig, erfahren, Shotcaller und einer der größten Innovatoren seiner Position. Während er mit Lee Sin noch einen recht vertrauten Pick schon sehr früh an den Tag gebracht hat, wurde es schnell außergewöhnlicher. So hat er vor allem in der dritten Saison viele Trends im Jungle geschaffen. Evelynn, Nasus und nicht zu vergessen seine Karma waren noch nicht einmal alle Champions, die er allein in dieser Zeit erfolgreich in die Kluft brachte. </p>\n<h2><p>Der große Aufstieg</p></h2>\n<p>Bekannt wurde Danil \"Diamondprox\" Reshetnikov, nachdem sein damaliger Kader von Team Empire Ende 2011 von Moscow Five aufgekauft wurde. Während die Russen anfangs noch nicht sonderlich bekannt waren, änderte sich dies schon zwei Monate später schlagartig. Bei der IEM Season VI in Kiew setzte sich das Team gegen eine Armee von großen Namen durch, unter ihnen auch Zweitplatzierter der vorigen Weltmeisterschaft against All authority und TSM, den schon damaligen Favoriten der Amerikaner. Mit nur einem verlorenen Spiel während des gesamten Turniers war sehr schnell klar, dass es diese Spieler drauf haben. </p>\n<p>Die gesamte zweite Saison sollte sich ein Trend fortsetzen, der aus einem emporkommenden Team mit guten Spielern schon fast so etwas wie Legenden machte. Zusammen mit seinem Teamkollegen Alexey \"Alex Ich\" Ichetovkin hat er die gegnerischen Lanes in ein regelrechtes Chaos versetzt, um sichere Siege einzuholen. Das hat M5 nicht nur weitere Turniersiege eingebracht, sondern letztendlich zu einem Top 4 Erfolg auf der zweiten Weltmeisterschaft geführt. </p>\n<h2><p>Sein Weg mit Gambit</p></h2>\n<p>Nachdem der CEO von Moscow Five Anfang 2013 verhaftet wurde, stand das erfolgreiche Team zum Verkauf bereit. Der glückliche Käufer: Gambit Gaming. Unter neuem Namen ging es gleich da weiter, wo man zuvor aufhörte: Wer sich an die IEM Season VII in Katowice erinnert, hat sicherlich noch Gambits dortige Erfolgsgeschichte vor Augen. Nach einem knappen Sprung aus der Gruppenphase gelang es dem Team nicht nur eins, sondern gleich zwei Aufeinandertreffen gegen die damals stärksten koreanischen Teams ohne Niederlage zu gewinnen. Spätestens ab diesem Zeitpunkt wurde Diamondprox auch von vielen Koreanern als einer der besten Jungler anerkannt. Er wurde Vorbild für viele später auch erfolgreiche professionelle Jungler. </p>\n<p>Die LCS veränderte dann so einiges, während die Konkurrenz anfangs noch vergleichsweise schwach war, wurde diese über die Jahre immer stärker. Das einst so undenkbar trennbare Team verlor nach und nach seine Spieler, bis zum Schluss nur noch Diamondprox und Edward „Edward“ Abgaryan übrig blieben. Das Ende vom ursprünglichen Gambit war gekommen. </p>\n<p> „Es waren vier teuflische Jahre, Jungs“, Worte, die sich Diamond am Anfang seiner Karriere in League of Legends wohl kaum zu träumen gewagt hätte. Und doch – nach vier Jahren Achterbahnfahrt der Gefühle, kann er stolz von seinen Jahren mit den vier russischen Kumpanen reden. Ein Kapitel seines Lebens, das mit dem Austritt aus Gambit Gaming nun geschlossen wurde. </p>\n<h2><p>Das diamantene Einhorn</p></h2>\n<p>Wenn sich ein Kapitel schließt, öffnet sich ein anderes. Das richtige Team ist jedenfalls gefunden. Die Unicorns Of Love sind dafür bekannt, ungewöhnliche Champions auszupacken, da passt der neue Jungler perfekt hinein, um die Gegner noch weiter in die Irre zu führen. Er selbst erhofft sich nicht nur als Person, sondern sich auch als Anführer weiter zu verbessern, wie er in einem Interview bekannt gab. In jedem Fall wird er sein Bestes geben, um nicht nur sein Team, sondern auch den vielen treuen Fans zu zeigen, was ein Diamondprox alles so drauf hat. </p>\n"},"foreignIds":{"drupalId":"88","TRLH3":"1001220067","TRLH4":"1001190117","TRLH1":"1001300002","FRA1TMNT1":"445028"},"socialNetworks":{"twitch":"http://www.twitch.tv/tehdiamondz","facebook":"www.facebook.com/GambitDiamondprox","twitter":"http://twitter.com/tehDiamondz"},"champions":[],"liveGameTeam":221},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":148,"slug":"shiphtur","name":"Shiphtur","firstName":"Danny","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/shiphtur-3a942emw.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-06-22T22:23:47.000Z","bios":{"en_US":"<p>\nDanny “Shiphtur” Le has been competing professionally since 2012. Known for a deep champion pool, Shiphtur is most effective on mid lane assassins like Ahri and Kassadin, but he can also hold his own with control mages, as evidenced by his fantastic 10.75 KDA on Ziggs in the 2014 NA LCS Summer Split. \n</p>\n<p>\nShiphtur got his first taste of the NA LCS while playing for Team Coast, then wreaked havoc from the mid lane with Team Dignitas. As one of the more experienced players in the LCS, Shiphtur has seen the focus of professional play transition from individual mechanics to coordinated team play. \"It's all about getting down the macro,\" Shiphtur says. \"Honestly in League of Legends right now, you can win a game purely on macro, rotations and such. Individual play really doesn't mean anything right now.\" Now, Shiphtur takes up his place on Delta Fox's new lineup.\n</p>","fr_FR":"<p>Cette saison encore, Danny « Shiphtur » Le tiendra la voie du milieu pour Dignitas. À 22 ans, le Canadien est déjà un vétéran de League of Legends.</p>\n\n<p>Il a débuté sa carrière peu avant la saison 3 et le lancement des LCS. Des LCS qu'il a immédiatement rejoints au sein de Good Game University, aux côtés notamment de Darshan « ZionSpartan » Upadhyaya (aujourd'hui connu sous le pseudonyme de Darshan). Malheureusement pour lui, des problèmes de visa l'ont empêché de jouer avant le début du segment d'été. Ses malheurs ont continué tout au long de la saison puisque l'équipe, rebaptisée Team Coast, a enchaîné les défaites pour finir à la 7e place du classement, synonyme de passage en tournoi de relégation. Une victoire 3 à 2 contre The Walking Zed leur a permis de se maintenir au plus haut niveau pour la saison 4, mais le répit ne fut que de courte durée. Lors du segment de printemps des LCS de la saison 4, Shiphtur et ses comparses n'ont su faire mieux qu'une 6e place puis un retour en tournoi de relégation après deux défaites en play-offs contre Counter Logic Gaming puis Dignitas. Cette fois le couperet est tombé sous la forme d'une défaite face à compLexity.Black, 3 victoires à 1, et le mid laner s'est retrouvé bouté hors des LCS.</p>\n\n<p>C'est le moment qu'a choisi Dignitas pour le recruter, toujours aux côtés de ZionSpartan. Avec sa nouvelle équipe, le joueur canadien s'est retrouvé une fois de plus très proche des relégations, évitées de justesse en fin de saison. L’histoire se répète lors du segment de printemps de la saison 5 des LCS, où l’équipe termine à la 9ème place et doit de nouveau passer par le tournoi de relégation. Malgré une légère amélioration lors du segment d'été, Shiphtur aborde la saison 6 sans aucune certitude. À lui de prouver enfin qu'il mérite véritablement sa place sur le terrain des LCS, face à une compétition chaque année plus relevée.</p>","pl_PL":"<p>Z pochodzenia Kanadyjczyk, z krwi Wietnamczyk, z urodzenia mid-laner. Danny Le sam wybrał tą linię, gdyż uważał, że jest najbliżej centrum wydarzeń i ma największy potencjał. Podczas swojej przygody z League of Legends wielokrotnie udowadniał, że zasługuje na tą pozycję. Pojawił się na scenie esportowej pod koniec drugiego sezonu i do stycznia 2013 roku grał na różnych pozycjach w paru pomniejszych drużynach. Wtedy nastąpił przełom w jego życiu, ponieważ trafił do Good Game University, później znanego jako Team Coast. Aż do kwietnia 2014 roku zespół walczył o przetrwanie w NA LCS, ponieważ wśród innych bardziej doświadczonych drużyn był przysłowiowym chłopcem do bicia. Nie przeszkodziło to Danniemu w pokazaniu się z najlepszej strony na scenie esportowej. Zrobił pentakilla Anivią na wiosennych rozgrywkach kwalifikacyjnych w Challenger Series w styczniu 2013 roku. Niestety w kwietniu 2014 roku porażka z compLexity.Black przesądziła o relegacji Team Coast z powrotem do Challenger Series. Miesiąc później \"Shiphtur\" opuścił tą drużynę, gdyż od razu dostał propozycje od swoich niedawnych konkurentów z NA LCS. W maju 2014 roku dołączył do Team Dignitas, gdzie w swojej pierwszej grze wiosennego sezonu 2014 zrobił kolejnego pentakilla, tym razem LeBlanc. </p>\n<p>\nDanny przysłużył się wszystkim innym graczom, przecierając drogę w oddziałach imigracyjnych Stanów Zjednoczonych. Jako pierwszy zawodnik esportowy otrzymał wizę P-1A, która przysługuje tylko profesjonalnym atletom. Kolejną jego zasługą dla społeczeństwa League of Legends było wprowadzenie Ziggsa do profesjonalnej gry. Wyborem Hextechowego Sapera sprowokował wiele banów w turniejach, lecz mimo tego jest jeszcze parę innych bohaterów, które \"Shiphtur\" uwielbia. Doskonale gra Anivią, co wielokrotnie udowadniał na różnej maści meczach, podobnie traktuje Ahri i Dianę. Szczytem jego możliwości jest Krąg Pretendenta z ponad tysiącem punktów LP. W wywiadzie po Mistrzostwach Świata 2015 Danny oświadczył, że według niego najmocniejszy zespół w NA LCS 2016 będzie miał Team SoloMid. Dodał też, że nie bez powodu pojechał na długi trening do Korei i że ma zamiar godnie stawić im czoła. Całość podsumował, że kocha League of Legends i jest bardzo wdzięczny fanom, którzy przy nim wytrwali. </p>\n"},"foreignIds":{"drupalId":"38","TRLH1":"1001220076","TRLH2":"1001160126","FRA1TMNT1":"375096","ESPORTSTMNT02":"200002373"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":110},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":110},{"id":549,"slug":"moon","name":"Moon","firstName":"Galen","lastName":"Holgate","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moon-9mjoh4vb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-05-25T01:05:44.000Z","bios":{"en_US":"<p>Galen \"Moon\" Holgate is a promising young jungle talent. After playing in the NA Challenger Series for most of the past two years, Moon got a shot to start for Liquid at the beginning of the 2016 NA LCS Summer Split. Unfortunately, he struggled on the big stage and was sent back to the Challenger scene to work things out.</p>\n\n<p>Now back in the NA LCS with FlyQuest, Moon found success on unconventional picks in the 2017 NA LCS Spring Split. With veteran FlyQuest teammates alongside him, Moon has the potential to eclipse any jungler in the league.</p>","de_DE":"Galen „Moon“ Holgate ist ein vielversprechendes, junges Talent im Dschungel. Nachdem er den Großteil der letzten zwei Jahre in der nordamerikanischen Challenger Series verbracht hatte, hat Moon am Beginn des Sommer-Splits der NA LCS 2016 die Chance bekommen, für Liquid an den Start zu gehen. Leider konnte er sich auf der großen Bühne nicht durchsetzen, weshalb er wieder in die Challenger Series zurückgeschickt wurde.<p>\n\nErneut zurück in der NA LCS hofft Moon, dass er es mit FlyQuest schafft, in der höchsten Liga Fuß zu fassen. Bei FlyQuest stehen ihm einige Veteranen zur Seite, die ihm dazu verhelfen könnten, jeden Jungler der Liga in den Schatten zu stellen.\n","fr_FR":"<p>Galen « Moon » Holgate est l'un de ces joueurs professionnels qui donnent l'impression de progresser \n\ncontinuellement à chaque nouvelle partie. Moon a été particulièrement impressionnant durant les \n\nChallenger Series NA 2015. En première semaine, son KDA était de 0,2. En cinquième semaine, il est \n\npassé à 12. Pas mal, après trois semaines d'entraînement !</p>\n\n<p>Moon a été recruté par NRG à la fin de l'année 2015, rejoignant ainsi de grands noms tels qu'Impact, \n\nAltec et GBM. Si l'équipe n'a pas encore fait ses preuves, elle compte de nombreux talents. Moon a \n\nfranchi encore un nouveau palier : il passe des Challenger Series aux LCS NA.</p>","pl_PL":"<p>Jungler NRG Esports pojawił się w NA LCS wraz ze stworzeniem tej drużyny. Ten przystojny Amerykanin dotychczas grał tylko i wyłącznie w Challenger Series, śmiało można go nazwać powiewem świeżego powietrza. Galen \"Moon\" Holgate nie był znany, ale poprzez swoje niezwykłe umiejętności szybko zdobył popularność. Przed dołączeniem do NRG Esports grał w drużynie Team Imagine, wraz z innymi doświadczonymi graczami, jak Zachary \"mancloud\" Allan Hoschar i Pierre \"Steeelback\" Medjaldi. Rozgrywki w Kręgu Pretendenta skończyli na trzecim miejscu, co zagwarantowało im możliwość udziału w kwalifikacjach do NA LCS. Pechowo dla Galena, jego drużyna została wybrana i pokonana przez Team8. Teraz jednak szczęście się uśmiechnęło do tego debiutanta – dostał drugą szansę w postaci miejsca w NRG Esports. </p>\n<p>Galena \"Moon\" Holgate’a w grze charakteryzuje aktywne wspieranie drużyny. Junglerzy grający w ten sposób mają na celu zabezpieczenie innych celów, jak np. smok czy kontrowanie zagrań przeciwników, niż zabójstwa. Po jego wyborach postaci można uznać, że wręcz przepada za dwoma bohaterami: Gragasem i Evelynn. Aczkolwiek \"Moon\" z każdym kolejnym dniem pokazuje, że potrafi dużo więcej niż się wydaje na pierwszy rzut oka. Chowa wiele asów w rękawie.  Przed sezonem wiosennym 2016 jego organizacja, NRG Esports, wypowiedziała się o nim w samych superlatywach – „Z zasobem bohaterów przeznaczonym do rozprawienia się z przeciwnikami z chirurgiczną precyzją, Moon zamierza utorować sobie drogę na szczyt NA LCS.”.</p>\n<p>\nJungler NRG Esports zdecydowanie wyróżnia się od innych graczy determinacją. Potwierdza to jego wypowiedź z przed wiosennego sezonu 2016, na temat udziału w NA LCS: „Jestem ekstremalnie zmotywowany i spragniony zwycięstwa.”. Te zapewnienia prawdopodobnie zostaną zweryfikowane przez pierwsze mecze w szóstym sezonie, a mało który gracz w podobnej sytuacji był w stanie poprzeć swoje mocne słowa czynami. Na początku żadnemu żółtodziobowi nie jest łatwo, gdyż musi udowodnić, że potrafi grać na najwyższym poziomie. Utrudniona pozycja startowa może również okazać się najmocniejszym atutem. Kiedy utworzono NRG Esports \"Moon\" nie był dobrze znany, czym zagwarantował sobie element zaskoczenia w pierwszych spotkaniach. W połączeniu z niesamowitym potencjałem stawia go w naprawdę dobrej pozycji wśród innych graczy. Ponadto trenował grę w Korei, co daje mu przewagę nad wieloma zawodnikami z Ameryki. Jungler NRG Esports dzięki powyższym atrybutom, powinien budzić żywe zainteresowanie kibiców, gdyż wszyscy spodziewają się, że zaprezentuje coś innego niż utarte ścieżki weteranów.\n</p>"},"foreignIds":{"drupalId":"4509","TRLH1":"200000202","TRLH2":"200000106"},"socialNetworks":{},"champions":[],"liveGameTeam":110},{"id":746,"slug":"roar","name":"Roar","firstName":"Jang-won","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/roar-3sgsb7kb.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-06-15T22:40:35.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"874","TRLH1":"1001300003","FRA1TMNT1":"445029"},"socialNetworks":{},"champions":[],"liveGameTeam":221},{"id":1098,"slug":"painless","name":"Painless","firstName":"Eric","lastName":"Fedder","roleSlug":"support","photoUrl":null,"hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2016-01-21T22:02:50.000Z","updatedAt":"2016-03-07T20:03:06.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375173","TRLH2":"1001200001","TRLH1":"1001270001"},"socialNetworks":{},"champions":[],"liveGameTeam":110},{"id":1100,"slug":"shernfire","name":"Shernfire","firstName":"Shern","lastName":"Tai","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shernfire-1ogbrwxw.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2016-01-21T22:09:01.000Z","updatedAt":"2017-05-31T02:44:03.000Z","bios":{"en_US":"<p>Shern “Shernfire” Tai is the playmaking jungler for the Dire Wolves. The 18-year-old already has over two years of professional experience, first joining the Dire Wolves as a substitute in 2014. After spending two years in the NA Challenger series to little success, Shernfire returned to his first team for the start of 2017. He’s one of the most gold-hungry junglers in the OPL. When the gold is rolling in, his Rengar and Kha’Zix look unstoppable. He’ll have to fight tooth and nail for every jungle camp at the 2017 Mid-Season Invitational, though, where he will face off against some of the world’s best junglers.</p>","es_AR":"<p><strong>Shern \"Shernfire\" Tai</strong> es el junglero que arma jugadas para los Dire Wolves. El chico de 18 años, que se unió a los Dire Wolves como sustituto en 2014, ya tiene más de dos años de experiencia en el juego profesional. Después de pasar dos años en la serie Retador NA con pocos resultados, <strong>Shernfire</strong> regresó a su primer equipo para el comienzo de la temporada 2017. Es uno de los jungleros con más sed de oro en la OPL. Cuando el oro comienza a circular, su Rengar y su Kha'Zix parecen ser imparables. Sin embargo, <strong>Shernfire</strong> tendrá que luchar con garras y dientes por cada campamento de jungla en el Mid-Season Invitational 2017, en donde se enfrentará a algunos de los mejores jungleros del mundo.</p>","de_DE":"Shern „Shernfire“ Tai ist der Spielmacher und Jungler der Dire Wolves. Der 18-jährige, der 2014 als Ersatzspieler zu den Dire Wolves kam, kann bereits auf eine zweijährige Profi-Karriere zurückblicken. Nachdem er zwei erfolglose Jahre in der nordamerikanischen Challenger Series verbracht hatte, kehrte er Anfang 2017 wieder zu seiner alten Mannschaft zurück. Er ist einer der goldgierigsten Jungler in der OPL. Und wenn er genug Gold bekommt, ist er mit Rengar und Kha’Zix nicht zu stoppen. Beim Mid-Season Invitational 2017 wird er sich jedoch mit Händen und Füßen gegen die besten Jungler der Welt zur Wehr setzen müssen.","es_ES":"Shern ''Shernfire'' Tai es el jungla estratega de Dire Wolves. Con solo 18 años, y tras unirse a Dire Wolves en 2014 como suplente, ya cuenta con dos años de experiencia profesional. Tras pasar dos años en la Challenger Series de NA sin mucho éxito, Shernfire volvió a su primer equipo a comienzos de 2017. Es uno de los junglas más hambrientos de oro de la OPL. Cuando abunda el oro, su Rengar y su Kha'Zix son imparables. No obstante, tendrá que luchar con uñas y dientes para hacerse con todos los campamentos de la jungla en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores junglas del mundo.","fr_FR":"Shern « Shernfire » Tai est un jungler qui crée du jeu pour les Dire Wolves. Ce joueur de 18 ans a déjà deux ans d'expérience professionnelle à son actif, ayant rejoint les Dire Wolves pour la première fois en tant que remplaçant en 2014. Après avoir passé deux années dans les Challenger Series NA sans succès ou presque, Shernfire est de retour dans sa première équipe pour le début de l'année 2017. Il est l'un des junglers les plus assoiffés d'or de l'OPL. Et lorsque les PO coulent à flot, ses Rengar et Kha'Zix semblent imbattables. Dans la jungle, il devra lutter pour chaque camp bec et ongles lors du Mid-Season Invitational 2017 face à certains des meilleurs junglers du monde.","pl_PL":"Shern „Shernfire” Tai to rozgrywający dżungler Dire Wolves. Osiemnastolatek ma już za sobą ponad dwa lata profesjonalnego doświadczenia. Po raz pierwszy dołączył do Dire Wolves jako rezerwowy w 2014 roku. Po spędzeniu z niewielkim powodzeniem dwóch lat w NA Challenger Series Shernfire na początku 2017 roku wrócił do swojej pierwszej drużyny. Jest jednym z najbardziej żądnych złota dżunglerów w OPL. Gdy złoto napływa, jego Rengar i Kha’Zix stają się niepowstrzymani. Jednak na Mid-Season Invitational 2017 będzie musiał walczyć na śmierć i życie o każdy obóz w dżungli, stając przeciwko najlepszym dżunglerom na świecie.","pt_BR":"<p>Shern \"Shernfire” Tai é o criador de jogadas dos Dire Wolves. O jovem de 18 anos já tem dois anos de experiência profissional, tendo entrado para os Dire Wolves como substituto em 2014. Após passar dois anos no circuito Desafiante da NA sem muito sucesso, Shernfire voltou à sua primeira equipe para o início de 2017. Ele é um dos melhores caçadores na OPL. Quando o ouro entra, seu Rengar e Kha’Zix parecem invencíveis. Mas ele terá de lutar com unhas e dentes por cada acampamento na selva do Mid-Season Invitational 2017, quando enfrentará alguns dos melhores caçadores do mundo.</p>"},"foreignIds":{"FRA1TMNT1":"375269","ESPORTSTMNT03":"200001275","TRLT3":"200000042"},"socialNetworks":{"twitter":"https://twitter.com/shernfire"},"champions":[],"liveGameTeam":221},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":110}],"scheduleItems":[{"id":"AVUYKJc7QMQFcjhwbQkB","content":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:match:b2ad571b-49a0-4ddf-a684-adb9b62853c3","scheduledTime":"2016-06-16T01:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f","blockLabel":"2","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:bracket:3f47a875-88ff-4040-90d1-fc7980d318d2"},"match":"b2ad571b-49a0-4ddf-a684-adb9b62853c3","tournament":"9e8ae990-aa5a-4ae5-865c-3a31ae39b30f","bracket":"3f47a875-88ff-4040-90d1-fc7980d318d2","league":"4"}],"gameIdMappings":[{"id":"625b3c30-55f1-4365-b822-ea99231df0b4","gameHash":"cb079505c518e160"},{"id":"0f83b115-b996-4885-a62e-5895dc2d0519","gameHash":"11cbb8997d746a22"}],"videos":[{"id":3161,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:game:625b3c30-55f1-4365-b822-ea99231df0b4","source":"https://www.youtube.com/embed/G40ATijzqXQ?wmode=transparent","createdAt":"2016-06-16T04:38:02.000Z","updatedAt":"2016-06-16T04:38:02.000Z","game":"625b3c30-55f1-4365-b822-ea99231df0b4"},{"id":3162,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9e8ae990-aa5a-4ae5-865c-3a31ae39b30f:game:0f83b115-b996-4885-a62e-5895dc2d0519","source":"https://www.youtube.com/embed/7KrZeVzfs3M?wmode=transparent","createdAt":"2016-06-16T04:41:12.000Z","updatedAt":"2016-06-16T04:41:12.000Z","game":"0f83b115-b996-4885-a62e-5895dc2d0519"}],"htmlBlocks":[],"match":{"id":"b2ad571b-49a0-4ddf-a684-adb9b62853c3","name":"TLA-vs-APP","position":11,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],"games":{"0f83b115-b996-4885-a62e-5895dc2d0519":{"id":"0f83b115-b996-4885-a62e-5895dc2d0519","name":"G2","generatedName":"APP|TLA|G2|b2ad571b49a04ddfa68","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],"standings":{"result":[[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"}]],"timestamp":1466051737701,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}],[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"}]],"timestamp":1466045784607,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1030357","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:1030357","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"625b3c30-55f1-4365-b822-ea99231df0b4":{"id":"625b3c30-55f1-4365-b822-ea99231df0b4","name":"G1","generatedName":"APP|TLA|G1|b2ad571b49a04ddfa68","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a5127554-f058-4151-b043-2b67beb299df"},{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"}],"standings":{"result":[[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"}],[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1466051439683,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"}],[{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1466042057751,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1030355","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:1030355","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1466051737701,"source":"bestOf","history":[{"result":[[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1466051439684,"source":"bestOf","closed":true},{"result":[[{"roster":"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75"},{"roster":"a5127554-f058-4151-b043-2b67beb299df"}]],"timestamp":1466045784607,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"a05fbbe2-3923-41f3-b7b6-b1ac96d7cb75":1,"a5127554-f058-4151-b043-2b67beb299df":1}}}