{"teams":[{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]},{"id":294,"slug":"fnatic-academy","name":"Fnatic Academy","guid":"2dc9c14d-e48b-44be-a8da-fe26fe59523f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-academy-1yiaf3vk.png","acronym":"FNA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2017-01-30T20:17:58.000Z","updatedAt":"2017-03-09T02:38:16.000Z","bios":{"en_US":"Coach: Kublai \"Kubz\" Barlas"},"foreignIds":{},"players":[64,204,244,341,1159,1449,1632,1770],"starters":[64,204,341,1159,1449],"subs":[244,1632,1770]}],"players":[{"id":64,"slug":"amazing","name":"Amazing","firstName":"Maurice","lastName":"Stückenschneider","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazing-7k66ma5o.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:18.000Z","updatedAt":"2017-06-20T13:14:44.000Z","bios":{"en_US":"<p>Maurice \"Amazingx\" Stückenschneider's jungle prowess is known on both sides of the Atlantic. Amazing rose to fame when he played a key role in the Copenhagen Wolves' promotion to the EU LCS in late 2013. He then hopped across the pond and spent a brief stint in North America with Team SoloMid, helping lead the team to the 2014 World Championship Quarterfinals. At the end of the season he returned to Europe to join Origen's starting roster in the EU Challenger Series, where he easily earned a berth into the EU LCS. A lifelong basketball player, Amazing's competitive nature drives him to dominate the map and make plays for his team.</p>\n\n<p>After the struggles mounted for Origen in 2016, Amazing left the team at the end of the year and became part of the Fnatic organization shortly after. Amazing fell short of his lofty promises for Origen last year and will make sure that the same doesn’t happen this year. An explosive player on the Rift, Amazing still has the ability to take over games at a moment’s notice. A change of scenery may be just what was needed in order to rekindle Amazing’s in-game fire.</p>","de_DE":"<p>Maurice „Amazingx“ Stückenschneiders Fähigkeiten im Dschungel sind auf beiden Seiten des Atlantiks bekannt. Amazing wurde bekannt, als er beim Aufstieg der Copenhagen Wolves in die EU LCS Ende 2013 eine entscheidende Rolle spielte. Daraufhin überquerte er den großen Teich und half Team SoloMid dabei, das Viertelfinale der Weltmeisterschaft 2014 zu erreichen. Am Ende der Saison kehrte er nach Europa zurück, um Origen dabei zu helfen, die europäische Challenger Series zu gewinnen und wieder in die EU LCS aufzusteigen. Amazing spielt schon sein ganzes Leben lang Basketball und seine Wettkampfmentalität verleitet ihn dazu, die Karte zu dominieren und seine Mannschaft mit seinen Spielzügen zu unterstützen.</p>\n\n<p>Nachdem die Probleme für Origen 2016 immer größer geworden waren, verließ Amazing die Mannschaft Ende des Jahres und wechselte kurz darauf zu Fnatic. Amazing konnte seine stolzen Versprechungen letztes Jahr bei Origen nicht umsetzen und er wird alles dafür tun, dass ihm das in diesem Jahr nicht wieder passiert. Er ist in der Kluft brandgefährlich und kann Spiele von einem Augenblick zum anderen an sich reißen. Ein Tapetenwechsel könnte genau das Richtige gewesen sein, um Amazings Funken erneut zu entfachen.</p>","es_ES":"<p>Nadie pone en cuestión que Maurice ‘Amazingx’ Stückenschneider tiene un don para jugar a League of Legends al máximo nivel, pero el alemán es además un abanderado del trabajo duro, algo que aprendió de Kobe Bryant, su ídolo baloncestístico. Puede que esta mentalidad traicione a su apodo, para el cual se inspiró en la canción de Kanye West con la que comparte título, pero es lo que le ha llevado al éxito.</p>\n\n<p>Aunque en un primer momento Amazing desestimó el juego de Riot Games debido a su estética, la insistencia de su hermano acabó pasando factura y el germano se inició como tirador. No obstante, al igual que en otros títulos a los que había jugado antes, su deseo de tener un mayor impacto en las partidas le llevó a la jungla. Udyr, Shyvana y sobre todo Lee Sin fueron los personajes que utilizó para escalar posiciones en el ránking.</p>\n\n<p>Sus 2 800 puntos de ELO al término de la segunda temporada hicieron que Team Acer se hiciera con sus servicios para acceder a la primera edición de la LCS EU. Ante el fallido intento Amazing abandonó la organización y deambuló sin éxito por varios equipos durante el siguiente año, lo que estuvo a punto de provocar su retirada.</p>\n\n<p>Sin embargo, la salida de Ilyas ‘Shook’ Hartsema dejó una vacante en Copenhagen Wolves que el jungla alemán ocupó. La organización danesa se hizo con un puesto en el split de primavera de la LCS EU 2014 a través del Torneo de Promoción, en el que derrotó a Meet Your Makers sin complicaciones. Amazing, que necesitó casi dos años para ingresar en la máxima liga continental, aprovechó la ocasión para convertirse en una de las revelaciones.</p>\n\n<p>Su destreza con Lee Sin, Elise y Evelynn fue un problema que en ocasiones los rivales no pudieron resolver. El equipo tenía carencias evidentes, pero las buenas actuaciones de Amazing y Konstantinos ‘FORG1VENGRE’ Tzortziou permitieron una modesta participación en los Playoffs.</p>\n\n<p>Pero fue en verano cuando Amazing encontró su oportunidad de oro. Team SoloMid buscaba un recambio para Brian ‘TheOddOne’ Wyllie y el alto nivel mecánico del alemán le convirtió en el mejor candidato. Reemplazar a una leyenda de la organización norteamericana más popular no fue sencillo y al principio Amazing lo pasó mal debido a su escaso repertorio de campeones. Para anularle, los contrincantes bloqueaban varios personajes del jungla, que en una ocasión se vio obligado a seleccionar a Volibear para desgracia de sus aliados. Pese a todo, Amazing fue el jugador más valioso de la cuarta semana y Team SoloMid recuperó la corona que Cloud9 le había arrebatado.</p>\n\n<p>El Campeonato Mundial 2014, en el que se enfrentó a junglas de la talla de Choi ‘DanDy’ In-kyu, le ayudó a llevar su juego al siguiente nivel. Deseoso de regresar a Europa, Amazing aprovechó la oferta de Enrique ‘xPeke’ Cedeño y se unió a Origen, donde se ha asentado como uno de los mejores del continente en su posición con actuaciones sólidas, sobre todo con Gragas.</p>","fr_FR":"<p>Maurice « Amazingx » Stückenschneider est un jungler dont la carrière professionnelle débute en janvier 2014, lorsqu’il se qualifie aux League of Legends Championship Series avec l’équipe Copenhagen Wolves. Connu pour avoir un style de jeu agressif, l’Allemand s’illustre principalement avec Lee Sin pendant le segment de printemps, exposant des mécaniques de jeu solidement rodées. Malheureusement pour lui, cette première aventure en LCS s’avère infructueuse. Après avoir obtenu la 6e place sur 8 lors de la saison régulière, Amazing et son équipe finissent dernier des play-offs et sont contraints de passer par le tournoi de promotion pour conserver leur place en LCS. Après avoir réussi cette entreprise, Amazing reçoit une proposition d’outre-Atlantique : l’équipe Team SoloMid veut s’offrir ses services suite au départ du « Général OddOne ». Amazing accepte l’offre et devient l’un des premiers joueurs européens à s’expatrier aux États-Unis.</p>\n\n<p>Il y retrouve le mid laner danois Søren « Bjergsen » Bjerg, également passé par la case Copenhagen Wolves et trouve une certaine complicité avec ce dernier. Malgré de bons résultats, certains observateurs accusent Amazing d’être trop dépendant de Lee Sin et Elise, ses deux champions les plus joués et les seuls à avoir des ratios de victoires convainquant (respectivement 78% et 89%). Néanmoins, en plus d'être un joueur à la technique aiguisée, Amazing se révèle être un excellent tacticien, ce qui vaudra à son équipe la 3e position de la saison régulière. Auteur de très belles parties avec Nunu et Kha’Zix, le jungler mène son équipe à la première place de la saison estivale des LCS NA.</p>\n\n<p>Au Mondial 2014, TSM réussit à sortir du groupe B à la 2e place, puis s’incline en quart de finale face aux futurs champions du monde, réussissant tout de même à sauver l’honneur lors de la troisième partie. Amazing décide par la suite de quitter TSM pour retrouver son Europe natale. Début décembre, il rejoint les rangs d’Origen, une nouvelle structure dont la première ambition est d’accéder aux LCS via les Challenger series. Le pari est tenu et Amazing se qualifie pour la seconde fois. Contrairement à sa première expérience européenne, celle-ci s'avère fructueuse.</p>\n\n<p>Avec le temps et les patchs, la méta de la jungle a évolué. En 2015, les champions résistants font leur retour en force. Amazing s’en accommode très vite et brille particulièrement avec Rek’Sai et Gragas. Son niveau de vision de jeu est très vite remarqué tant sa présence sur la carte est percutante. En duo avec son support Alfonson « Mithy » Aguirre Rodriguez, Amazing réussi à contrer les initiatives adverses et à prendre le contrôle de la vision dans un nouveau style d’agressivité. Ces performances permettent à son équipe de se hisser à la 2e place de la saison estivale des LCS EU et d’obtenir la 2e place des play-offs. Au mondial 2015, Amazing rivalise avec les meilleurs, guidant son équipe jusqu’en demi-finale.</p>","pl_PL":"<p>Pochodzący z Bocholt w Niemczech, Maurice Stückenschneider to zawodnik, którego sława wciąż rośnie. Pierwszy raz zanurzył się w wirtualny świat gier w wieku pięciu lat, dając się porwać starym grom na konsole. Przez parę kolejnych lat nie ciągnęło go do klawiatury i myszki, zdecydowanie bardziej wolał zostać przy padzie. Dopiero w 2010 roku skusił się na grę na komputerze, z okazji wzięcia udziału w wydarzeniach związanych z ESL. Pierwotnie League of Legends odrzucało Maurice’a ze względu na grafikę podobną do kreskówek. Dopiero jego brat nakłonił go do tego, żeby spróbował w nią zagrać.</p>\n<p>\nSwój debiut w świecie Runeterry \"Amazing\" rozpoczął od fascynacji postaciami AD Carry. Po pierwszym sezonie zmienił swoje upodobania. Jego zainteresowanie skupiło się na Jungli, ponieważ chciał mieć większy wpływ na grę. Grając Udyrem, Shyvaną i Lee Sinem udało mu się osiągnąć zawrotny wynik 2,8 tysiąca Elo w drugim sezonie. Jego progres nie umknął uwadze sporej ilości drużyn, po wielu perypetiach skorzystał z oferty Copenhagen Wolves. Z tą drużyną miał okazję pierwszy raz pokazać się na EU LCS, lecz wiosenny sezon 2014 z tą drużyną skończył się na meczach relegacyjnych.  \"Amazing\" odszedł z CW, ale w międzyczasie jego sława zdążyła dotrzeć aż za ocean. Został doceniony przez powszechnie znaną drużynę Team SoloMid. Pomimo powszechnej krytyki jego małego zasobu bohaterów,  wykorzystał swoje umiejętności z tym zdecydowanie lepszym w tym czasie zespołem. Efektem tego było pierwsze miejsce w letnim sezonie 2014, gwarantujące drużynie miejsce na Mistrzostwach Świata 2014. 11 października tego samego roku Maurice odszedł z TSM, powołując się na sprawy rodzinne i wrócił do swojej ojczyzny.</p>\n<p>\n\"Amazing\" na początku swojej kariery w Jungli wzorował się na Danilu \"Diamondprox\" Reshetnikovie, bardzo sugerując się bohaterami, których Rosjanin wybierał. Jednak ostatecznie ulubionymi bohaterami Maurice’a są: Xin Zhao, Shyvana, Lee Sin i Nautilus. Duży wpływ na niego miały też gwiazdy z innych dziedzin. Ze względu na to, że w przeszłości grał zawodniczo w koszykówkę, jednym z jego idoli jest Kobe Bryant, a ulubioną drużyną Los Angeles Lakers. Stąd też wywodzi swoje motto: „Ciężka praca pokonuje talent”. Cieszy swoich fanów aktywnością na Twitterze, gdzie lubi narzekać na sprawy, które go irytują. Mocny charakter Maurice’a widać także w rozmowach z nim. W wywiadzie przed półfinałem Mistrzostw Świata 2015 powiedział „Nie boję się SKT T1”.\n</p>","pt_BR":"<p>\nA fama de Amazingx vem dos dois lados do Atlântico. Ele apareceu no cenário quando subiu com a Copenhagen Wolves para a LCS em 2013. Então ele cruzou o oceano e jogou por um tempo na TSM, ajudando a levar o time até as quartas de final. No final da temporada, ele voltou para a Europa e se juntou à Origen para disputar a Série Desafiante da LCS EU.</p>\n<p>\nEle jogou basquete por muitos anos, e sua natureza competitiva o motiva a dominar o mapa e fazer jogadas para o time. Ele teve lampejos de genialidade ao longo da carreira, mas seu desempenho se consolidou como nunca na Origen. Qual o próximo passo? Amazing só consegue pensar no Mundial. E você vai dizer que ele está errado?</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">정글러로서 Maurice \"Amazingx\" Stückenschneider 선수의 실력은 북미와 유럽 양쪽에서 유명합니다. Amazing 선수는 Copenhagen Wolves의 2013년 말 유럽 LCS 승급에 결정적인 역할을 하며 이름을 널리 알렸죠. 그리곤 대서양을 건너 북미에서 잠시 Team SoloMid에 합류해 2014년 월드 챔피언십 8강까지 진출하는 데 톡톡한 공을 세웠습니다. 그리고 시즌이 끝난 후 유럽으로 돌아와 Origen의 창단 멤버로 유럽 Challenger 시리즈에 출전했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">어릴 때부터 농구를 해온 덕에 지기 싫어하는 면모가 있어 경기를 할 때도 맵을 장악하고 플레이 메이커 역할을 하는 모습을 쉽게 볼 수 있습니다. 선수 생활을 시작할 때부터 뛰어난 실력을 계속 보였던 Amazing 선수이지만 훨씬 꾸준한 모습을 보여준 건 Origen에 합류하면서부터였습니다. Origen의 데뷔 시즌인 2015년, 월드 챔피언십에서 준결승까지 올라갔으니 올스타의 반열에 드는 게 당연해 보입니다. Amazing 선수가 앞으로 어떤 행보를 보일지 매우 기대됩니다. </p>\n","el_GR":"","es_AR":"","ro_RO":"","es_MX":"","tr_TR":"","en_PL":"","ru_RU":"","it_IT":"","en_GB":"","hu_HU":"","cs_CZ":""},"foreignIds":{"drupalId":"1102","TRLH3":"200000056","TRLH4":"200000159"},"socialNetworks":{"azubu":"azubu.tv/amazing","facebook":"https://www.facebook.com/amazinglolx?fref=ts","twitter":"https://twitter.com/Amazing_EU"},"champions":[],"liveGameTeam":294},{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":294},{"id":244,"slug":"dan","name":"Dan","firstName":"Daniel","lastName":"Hockley","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/dan-ex6b836p.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-07-30T13:55:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2915","FRA1TMNT1":"375391","ESPORTSTMNT02":"200002394","TRLH3":"200000283","TRLH4":"200000481"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":341,"slug":"kikis","name":"Kikis","firstName":"Mateusz","lastName":"Szkudlarek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kikis-9px5rew4.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-06-20T13:17:06.000Z","bios":{"en_US":"<p>\nMateusz “Kikis” Szkudlarek launched his esports career in 2012 with MeetYourMakers. Kikis spent several years battling it out in the EU Challenger scene before breaking into the EU LCS in 2015 with the Unicorns of Love. He later moved to G2 Esports, helping them to qualify for the EU LCS while also moving out of the jungle and into the top lane.\n</p>\n<p>\nKikis acclimated quickly to the top lane as G2 consistently unraveled opponents leading to a 1st place finish in the 2016 EU LCS Spring Split. After parting ways with G2, Kikis found his way to another top European team: Fnatic. The burden of high expectations lies squarely on Kikis’ shoulders -- but that’s something that he (and his scarves) are used to.\n</p>","de_DE":"<p>Der erste Gedanke, der dabei vermutlich gerade durch den Kopf geht ist „Moment einmal, ist der nicht Jungler?“. </p>\n\n<p>Naja, er war es schließlich vor nicht allzu langer Zeit einmal. Heute ist Mateusz „Kikis“ Szkudlarek, wie ihr schon richtig gelesen habt, der Top-Laner bei G2 Esports. Doch wusstet ihr auch, dass Kikis Karriere eigentlich als Top-Laner begann? Wirklich bekannt wurde der Pole erst mit seinem Durchbruch in die EU LCS mit Unicorns of Love, als er mit seinen Teamkameraden sich durch die EU Challenger Series für die europäische Erstliga qualifizierte. Sein Weg begann jedoch schon weit in der Vergangenheit, nämlich zum Zeitpunkt, als League of Legends gerade in die erste Saison der kompetitiven Szene startete. 2011 schafften Kikis und seine Mannschaft exGameburg Team sich einen Platz in seinem ersten internationalen Turnier, die 2011 World Cyber Games, zu ergattern. Gastgeber war das prestigeträchtige Najin e-mFire, welches durch die Hand des europäischen Teams fiel. Kikis Team schlug ebenso die nordamerikanische Mannschaft Counter Logic Gaming und schaffte es bis ins Finale gegen Chicks Dig ELO, ein Team bestehend aus einer Mischung aus späteren Team SoloMid- und Counter Logic Gaming-Spielern.</p>\n\n<p>Nach der Silbermedaille schlug sich der stilhafte Schal-Connaisseur für drei Jahre durch verschiedene Mannschaften, darunter auch namhafte Organisationen wie MeetYourMakers, mousesports und Team ROCCAT. Als Teil von EloHell spielte er in der regionalen KO-Phase Europas der zweiten Saison, schied allerdings bereits im Vierteilfinale aus. Ende 2013 wechselte Kikis in die Jungle-Rolle und begann für einige Mannschaften der EU CS zu spielen, in der Hoffnung eines Tages den Schritt nach ganz oben zu schaffen. </p>\n\n<p>Mit UOL kam der Durchbruch und auch der massive Strom an Fans, vor allem durch die verrückten Champions, die Kikis in den wichtigsten Spielen seiner Mannschaft auspackte. Mal war es Udyr und ein anderes Mal Gnar, beides Champions, welche wohl kein anderer Jungler der Welt sich trauen würde anzufassen. Besonders nicht im Halbfinale der EU LCS Spring 2015. Da fragt man sich, wie viel Vertrauen seiner Mannschaft sich Kikis verdient haben muss und wie viel Mut man braucht, um eine solche Aktion durchzuziehen. </p>\n\n<p>Im Laufe der folgenden Sommersaison entschied sich der Pole wegen seiner mangelhaften Leistung die Mannschaft zu verlassen und es mit einem Neuanfang bei Gamers2 zu versuchen. Der Wechsel auf die Top-Lane fand schließlich nach einer erfolgreichen Qualifikation für die Rückkehr in die LCS statt, als er seine neuen Jungler Kang-yoon „Trick“ Kim willkommen hieß. </p>\n","fr_FR":"<p>S’il existait un concours du joueur à avoir parcouru le plus d’équipes dans sa carrière, Mateusz « Kikis » Szkudlarek en serait sûrement le grand favori. Le Polonais a déjà porté les couleurs de plus de 20 équipes en 5 années, tantôt en toplane, tantôt en jungle et parfois même en midlane. Alors qu’il n’a que 15 ans, Kikis commence la compétition et participe à des dizaines de tournois. Les résultats sont parfois au rendez-vous, comme quand il envoie au tapis une équipe coréenne en 2011 et obtient la 2e place du tournoi international World Cyber Game ou quand il remporte la Gamers Assembly 2012 face à des équipes européennes comme Counter Logic Gaming Europe.</p>\n\n<p>En 2014, Kikis participe à la première édition des Challenger Series de printemps, mais son équipe Pulse Esports est rapidement éliminée. La seconde édition est davantage un succès. Avec Denial eSports, le Polonais parvient à accrocher la 3e place des play-offs et décroche ainsi son ticket pour le tournoi de promotion. Malheureusement, le joueur et son équipe s’inclinent face à l’équipe sortante, Copenhagen Wolves et échouent à la porte des League of Legends Championship Series. </p>\n\n<p>La saison estivale des Challengers Series de Kikis suit le même schéma : élimination précoce lors de la première édition, accès au tournoi de promotion avec SK Gaming Prime — une équipe différente — lors de la seconde puis échec face à l’équipe issue des LCS, cette fois-ci Gambit Gaming. Finalement, Kikis rejoint une équipe qui, elle, est parvenue à se qualifier aux LCS : Unicorns of Love.</p>\n\n<p>C’est dans cette structure que Kikis connaît ses plus grands succès. Aussitôt arrivé dans le club très fermé des licornes capables de tenir une souris, aussitôt il dispute une compétition internationale : les Intel Extreme Masters San Jose. Le Polonais, dans tout son art, innove comme personne. Face à Team SoloMid, il invoque Twisted Fate jungle et se saisi de l’enchantement Dévoreur, avec lequel il connaît un grand succès et marque les esprits. UoL parvient finalement à se hisser en finale, où l’équipe s’incline face à Cloud9. En LCS, Kikis se montre au niveau et tient tête aux meilleurs. Son équipe se hisse à la très correcte 5e place de la saison régulière. Aux play-offs, il étonne à nouveau en jouant un Shaco très convainquant face à Gambit Gaming. En demi-finale face à SK Gaming, le premier de la saison régulière, il sélectionne Gnar jungle et participe à la victoire de son équipe. La belle aventure se termine sur une finale très serrée dont Fnatic est le seul vainqueur. </p>\n\n<p>Avant la fin de la saison régulière d’été, Kikis quitte Unicorns of Love et rejoint Gamers2. Il aide l’équipe à se hisser à la 3e place des Challengers Series puis contribue à la qualifier aux LCS en s’imposant face à SK Gaming. Depuis, le joueur a cédé sa place de jungler et est retourné à ses premiers amours : la voie du haut.</p>\n","es_ES":"<p>Mateusz “Kikis” Szkudlarek comenzó su carrera de esports el año 2012 junto a MeetYourMakers. Kikis pasó varios años junto a los jugadores europeos de nivel Aspirante hasta que por fin se abrió paso a la LCS en 2015 con los Unicorns of Love. Sus actuaciones con Nidalee y Nunu son dominantes, y el marcador de juego con sus junglas preferidos en el split de primavera ha sido de 6V-2D. Como homenaje al estilo poco ortodoxo de UOL, incluso se atrevió con Shaco una vez a pesar de que muchos consideran que el campeón no es jugable actualmente.</p>\n<p>Kikis pasó de UOL a G2 Esports en 2015, y su debut para el equipo ayudó a G2 a clasificarse para la LCS EU. Este 2016, Kikis ha pasado de la jungla a la calle superior de G2. Solo hay una explicación: ha llegado el momento de desatar el poder de Shaco en la calle superior (o eso esperamos).</p>","pl_PL":"<p>Mateusz bezsprzecznie należy do grona najpopularniejszych polskich zawodników. Równolegle wybija się zdolnościami wśród innych graczy na arenie międzynarodowej. Mało kto może się pochwalić taką wprawą jak „Kikis” na profesjonalnej scenie, gdyż jest jej częścią od początku pierwszego sezonu. Do tego przyczyniło się członkostwo w ponad 20 różnych, bardziej lub mniej znanych, drużynach. Takie doświadczenie, zyskane podczas wspólnej gry z graczami z całej Europy, jest unikatowe na skalę światową. </p>\n<p>Podczas swojej długiej kariery w League of Legends „Kikis” zgromadził mnóstwo imponujących trofeów. Pierwszym znaczącym sukcesem było drugie miejsce na Samsung Euro Championship 2011. Wyjątkowość tego wydarzenia polegała na pokonaniu zespołów reprezentujących Kanadę i Koreę – Counter Logic Gaming i Najin e-mFire. Dla polskiej reprezentacji i Mateusza to był debiut w rozgrywkach na najwyższym poziomie. Po doskonałym starcie do sezonu czwartego „Kikis” brał udział w gigantycznej ilości wydarzeń różnej rangi – od regionalnych turniejów po światowe imprezy jak IEM w San Jose. W międzyczasie cały czas próbował swoich sił w Challenger Series grając w rozmaitych zespołach, jak na przykład: Denial eSports i Lublin Shore. Niestety przeważnie kończył na czwartym miejscu, bez możliwości walki o wejście do kolejnego etapu. Kwalifikacja do turnieju promocyjnego udała mu się dopiero w szeregach SK Gaming Prime, lecz na jego drodze do EU LCS stanął legendarny już zespół Gambit Gaming. „Kikis” poniósł porażkę w starciu z potęgą czerwonej gwiazdy, lecz ostatecznie i tak zagrał w wiosennym sezonie EU LCS 2015. Szansę na pokazanie się zawdzięcza ofercie of Unicorns Of Love, która przyjęła go do głównego składu z szeroko rozłożonymi ramionami. Ten okres przyniósł wiele sukcesów Mateuszowi. W grudniu 2014 roku zajął drugie miejsce na wielkim wydarzeniu – IEM w San Jose, ulegając tylko Cloud9. Natomiast w wiosennym sezonie zespół UOL zajął piąte miejsce, lecz podczas rozgrywek barażowych pokazał pazur. „Kikis” i jego ekipa pokonali Gambit Gaming i zajmujący pierwsze miejsce SK Gaming. Zostali pokonani dopiero w finale w bardzo wyrównanej batalii przeciwko Fnatic z wynikiem 3:2.</p>\n<p>„Kikis” gra profesjonalnie zarówno w jungli jak i na top-lanie, w zależności od potrzeb swojego zespołu. Uwielbia grać Lee Sinem, Shenem i Elise, lecz potrafi pozytywnie zaskoczyć widzów każdym bohaterem. Najgłośniejszym zagraniem Mateusza był doskonały gank Udyrem na drugim poziomie w meczu przeciwko Gambit Gaming podczas wiosennych rozgrywek barażowych. Większość analityków jest zgodna, że „Kikis” to gracz absolutnie nieszablonowy, co jest jego największą zaletą. Tymczasem fani kochają go za prostolinijność, ponieważ nigdy nie wstydził się mówić, tego co naprawdę czuje. Dlatego posiada szczerze oddane grono wielbicieli, którzy podążają za nim, kiedy przenosi się do kolejnych zespołów.</p>\n","es_AR":"<p>Mateusz 'Kikis' Szkudlarek comenzó su carrera en los Esports en 2012 con MeetYourMakers. Kikis pasó varios años peleando en la escena del Challenger de la UE antes de iniciarse en la LCS de la UE en 2015 con los Unicorns of Love. Es mejor conocido por sus actuaciones dominantes usando a Nidalee y Nunu, sus jungleros favoritos, y por mantener un récord de 6 ganados contra 2 perdidos durante el curso del Torneo de Primavera de 2015 de la LCS de la UE. Y en una ocasión, con un estilo poco convencional para UOL, llegó a usar a Shaco; un campeón que muchos consideran injugable en competencias profesionales.</p>\n\n<p>Kikis pasó de UOL a G2 eSports en 2015 y, su debut en el equipo, les permitió calificar para la LCS de la UE. Kikis realizó otro movimiento en 2016, al salir de la jungla para entrar al carril superior de G2. Solo puede haber una explicación para esto: es la hora del terror Iluminati del carril superior conocido como Shaco el Muñeco Sorpresa (eso esperamos).</p>"},"foreignIds":{"drupalId":"1469","TRLH3":"200000263","TRLH4":"200000315","TRLT3":"35063","TRLH2":"1001250015","FRA1TMNT2":"25428"},"socialNetworks":{"twitch":"www.twitch.tv/kikis1205","facebook":"www.facebook.com/MSkikis","twitter":"https://twitter.com/kikis1205"},"champions":[],"liveGameTeam":294},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1159,"slug":"klaj","name":"Klaj","firstName":"Johan","lastName":"Olsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/klaj-fqwjvhur.png","hometown":"Sweden","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-02-09T19:35:21.000Z","updatedAt":"2017-03-26T09:30:10.000Z","bios":{},"foreignIds":{"TRLH3":"200000267","TRLH4":"200000319","FRA1TMNT2":"25411","ESPORTSTMNT02":"200001036"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":294},{"id":1632,"slug":"panda","name":"Pandar","firstName":"Yannick","lastName":"Greff","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/panda-7ss7yc37.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T19:56:43.000Z","updatedAt":"2017-03-01T18:59:25.000Z","bios":{},"foreignIds":{"TRLH3":"200000061","TRLH4":"200000164"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1770,"slug":"wolle","name":"Wolle","firstName":"Wolfgang","lastName":"Landes","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolle-hkyqnqx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-08T23:22:18.000Z","updatedAt":"2017-03-26T09:31:19.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001037","TRLH4":"200000320","TRLH3":"200000268"},"socialNetworks":{},"champions":[],"liveGameTeam":294},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AVs2RblBQMQFcjhwbQxP","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:b6ff5376-d73d-4f5a-8f37-4de8515fde11","scheduledTime":"2017-04-06T15:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"Summer Promotion","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:8915b5e0-d908-4b6d-a35a-41f01f6a3745"},"match":"b6ff5376-d73d-4f5a-8f37-4de8515fde11","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"8915b5e0-d908-4b6d-a35a-41f01f6a3745","league":"3"}],"gameIdMappings":[{"id":"fd487838-f1a6-408a-af0a-43d26f62e214","gameHash":"a1b977cfdf95cbcc"},{"id":"fc7e368f-f8a5-4592-8d36-88794fa94c98","gameHash":"28bdbff28abb98cb"},{"id":"05d95496-7c78-4d96-9883-62c98fb907fe","gameHash":"9c3656d40bb9e987"},{"id":"cdbf360a-228a-4171-b581-93b21a399a97","gameHash":"590df52f61a600d9"}],"videos":[{"id":6494,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:cdbf360a-228a-4171-b581-93b21a399a97","source":"https://www.youtube.com/embed/gWUXtxgMy10?wmode=transparent","createdAt":"2017-04-07T02:44:24.000Z","updatedAt":"2017-04-07T02:44:24.000Z","game":"cdbf360a-228a-4171-b581-93b21a399a97"},{"id":6495,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:fd487838-f1a6-408a-af0a-43d26f62e214","source":"https://www.youtube.com/embed/JjhnwUMY_FQ?wmode=transparent","createdAt":"2017-04-07T02:44:41.000Z","updatedAt":"2017-04-07T02:44:41.000Z","game":"fd487838-f1a6-408a-af0a-43d26f62e214"},{"id":6496,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:05d95496-7c78-4d96-9883-62c98fb907fe","source":"https://www.youtube.com/embed/WRiiqQRdN1s?wmode=transparent","createdAt":"2017-04-07T02:37:40.000Z","updatedAt":"2017-04-07T02:37:40.000Z","game":"05d95496-7c78-4d96-9883-62c98fb907fe"},{"id":6497,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:fc7e368f-f8a5-4592-8d36-88794fa94c98","source":"https://www.youtube.com/embed/7RoJhU3OX2s?wmode=transparent","createdAt":"2017-04-07T02:37:57.000Z","updatedAt":"2017-04-07T02:37:57.000Z","game":"fc7e368f-f8a5-4592-8d36-88794fa94c98"}],"htmlBlocks":[],"match":{"id":"b6ff5376-d73d-4f5a-8f37-4de8515fde11","name":"match-a","position":0,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0},{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],"games":{"9751f8fd-27bd-4c3a-af3c-5421a22d0c2e":{"id":"9751f8fd-27bd-4c3a-af3c-5421a22d0c2e","name":"G5","generatedName":"FNA|GIA|G5|b6ff5376d73d4f5a8f3","input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0},{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"fc7e368f-f8a5-4592-8d36-88794fa94c98":{"id":"fc7e368f-f8a5-4592-8d36-88794fa94c98","name":"G4","generatedName":"FNA|GIA|G4|b6ff5376d73d4f5a8f3","input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0},{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],"standings":{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491532845160,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491505135554,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002030142","gameRealm":"TRLH3","platformId":"TRLH3:1002030142","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"05d95496-7c78-4d96-9883-62c98fb907fe":{"id":"05d95496-7c78-4d96-9883-62c98fb907fe","name":"G2","generatedName":"FNA|GIA|G2|b6ff5376d73d4f5a8f3","input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0},{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],"standings":{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491532863125,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491498920805,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002030139","gameRealm":"TRLH3","platformId":"TRLH3:1002030139","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"fd487838-f1a6-408a-af0a-43d26f62e214":{"id":"fd487838-f1a6-408a-af0a-43d26f62e214","name":"G3","generatedName":"FNA|GIA|G3|b6ff5376d73d4f5a8f3","input":[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}],"standings":{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491532784769,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}]],"timestamp":1491502232959,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002030140","gameRealm":"TRLH3","platformId":"TRLH3:1002030140","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"cdbf360a-228a-4171-b581-93b21a399a97":{"id":"cdbf360a-228a-4171-b581-93b21a399a97","name":"G1","generatedName":"FNA|GIA|G1|b6ff5376d73d4f5a8f3","input":[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}],"standings":{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}],[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}]],"timestamp":1491532804138,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":0}],[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08","breakpoint":"b7eaee4e-be95-41a7-96fc-802cf1f0ddac","standing":2}]],"timestamp":1491494972753,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002030126","gameRealm":"TRLH3","platformId":"TRLH3:1002030126","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1491532845161,"source":"bestOf","history":[{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1491532863125,"source":"bestOf","closed":true},{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1491532784769,"source":"bestOf","closed":true},{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1491532804138,"source":"bestOf","closed":true},{"result":[[{"roster":"24853ad1-8951-4a60-ba93-727aee847f08"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1491505135554,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}