{"teams":[{"id":82,"slug":"team-we","name":"Team WE","guid":"be6e0936-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-we-ei826ceg.png","acronym":"WE","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-07T22:21:53.000Z","bios":{"en_US":"","pl_PL":"Team WE są znani w chińskim e-sporcie od pradziejów. Jako pionierska organizacja e-sportowa zasłynęli w świecie ze swoich drużyn Warcrafta i StarCrafta, zanim w 2011 roku przestawili się na League of Legends. Po latach przeplatających się serii sukcesów i porażek Team WE w 2017 roku naprawdę się odnaleźli. Łącząc stare talenty z nowicjuszami, Team WE zdominowali wiosenny split LPL 2017, osiągając wynik 12–4 w fazie grupowej. Nie spoczęli na laurach i wkrótce przebili się przez konkurencję w play-offach, przegrywając tylko jedną grę w drodze po tytuł wiosennego splitu. Ich zwycięstwo 3–0 z Royal Never Give Up w finale stanowiło ukoronowanie znakomitego sezonu drużyny. Teraz szykują się do Rio, gdzie zamierzają wielokrotnie wykradać Barona oraz eliminować najlepsze drużyny świata na Mid-Season Invitational 2017. \n\nTrener: Namhoon „HooN” Kim\n","es_ES":"Team WE es una vieja leyenda china de los esports. Como organización de esports pionera, ya era famosa mundialmente por sus equipos de Warcraft y Starcraft antes de que se uniera a League of Legends en 2011. Tras años alternando éxitos y fracasos, Team WE ha conseguido establecerse en 2017. Con una mezcla de viejos talentos y jugadores recién llegados, Team WE ha arrasado en el split de primavera de la LPL 2017, en la que batió un récord de 12 victorias frente a 4 derrotas en la fase de grupos. Pero la cosa no se quedó en eso. El equipo no tardaría en abrirse paso en los playoffs y en reclamar la corona del split de primavera con tan solo una derrota en su haber. Su resultado 3-0 en la final contra Royal Never Give Up es el colofón de una temporada estelar. Los jugadores de Team WE ahora se dirigen a Río y están preparados para robar el Barón y machacar a sus adversarios cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017. \n\nEntrenador: Namhoon ''HooN'' Kim\n","de_DE":"Team WE ist eine chinesische E-Sport-Legende, die so alt ist wie die Zeit selbst. Die E-Sport-Organisation gilt als Pionier auf diesem Gebiet und war für ihre Warcraft- und StarCraft-Mannschaften bekannt, bevor sie 2011 auf League of Legends umstieg. Nach Jahren voller Höhen und Tiefen scheint Team WE 2017 endlich einen guten Rhythmus gefunden zu haben. Dank einer Mischung aus alten Talenten und Neulingen konnte Team WE den Frühjahrs-Split der LPL dominieren und beendete die Gruppenphase mit 12 Siegen bei nur 4 Niederlagen. Doch das war ihnen noch nicht genug. Sie marschierten durch die Entscheidungsspiele und verloren auf dem Weg zum Titel nur ein einziges Spiel. Die Krönung ihrer sensationellen Saison war der 3–0 Sieg über Royal Never Give Up im Finale des Frühjahrs-Splits. Jetzt konzentrieren sie sich ganz auf Rio, wo sie den ein oder anderen Baron stehlen und ihre Gegner aufmischen wollen, wenn sie sich beim Mid-Season Invitational 2017 mit den besten Mannschaften der Welt messen. \n\nTrainer: Namhoon „HooN“ Kim\n","pt_BR":"<p>A história da Team WE nos e-Sports chineses é tão antiga quanto o tempo. Como uma organização pioneira na área de e-Sports, eles já haviam alcançado renome internacional com suas equipes de Warcraft e Starcraft quando fizeram o salto para League of Legends em 2011. Após passar anos intercalando sucessos e fracassos, a Team WE encontrou de vez o seu caminho em 2017. Misturando talentos experientes com novatos promissores, a Team WE dominou a Etapa de Primavera da LPL 2017 com um recorde de 12-4 na fase de grupos. Sem parar por aí, eles logo abriram caminho entre a competição das eliminatórias, perdendo apenas um jogo na sua jornada até a coroa da Etapa de Primavera. A surra de 3-0 que deram na Royal Never Give Up na final colocou um ponto de exclamação na sua já extraordinária temporada. Agora, seu foco está no Rio e eles pretendem roubar Barões e mostrar a que vieram em seus confrontos contra as melhores equipes do mundo no Mid-Season Invitational 2017. </p>\n\n<p>Técnico: Namhoon “HooN” Kim</p>","es_AR":"<p>El Team WE es un cuento de Esports tan viejo como el tiempo. Como una organización pionera de Esports, se volvieron conocidos internacionalmente por sus equipos de Warcraft y Starcraft antes de entrar a LoL en el 2011. Después de años de éxitos y fracasos, el Team WE encontró su ritmo en 2017. Al mezclar talento viejo con nuevo, el Team WE dominó el Torneo de Apertura LPL de 2017 y alcanzó un récord de 12-4 en la fase de grupos. No se detuvieron ahí. En cuanto llegaron a las eliminatorias solo perdieron una partida en su camino a la victoria del Torneo de Apertura. Su aplastante 3-0 en el Royal Never Give Up en las finales fue la cereza del pastel en su temporada. Ahora tienen los ojos puestos en Río y están listos para robar barones y aplastar a sus oponentes cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"1849"},"players":[132,511,516,517,603,692,1038,1428,1991,1992],"starters":[132,516,517,692,1038],"subs":[511,603,1428,1991,1992]},{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]}],"players":[{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":132,"slug":"zero","name":"Zero","firstName":"Kyungsub","lastName":"Yun","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zero-bpm8z97p.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:59.000Z","updatedAt":"2017-07-07T22:22:17.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2165","TRLH1":"200000404","TRLH3":"1000205039","TRLT3":"200000232"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":511,"slug":"conan","name":"conan","firstName":"Yi","lastName":"Ke","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/conan-hcob1n8b.png","hometown":"Tianmen, China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-05-09T23:21:19.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2079","TRLH1":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":516,"slug":"xiye","name":"xiye","firstName":"Hanwei","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiye-4520r7ee.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:43.000Z","bios":{"en_US":"<p>Hanwei “xiye” Su is the model student for consistency in the mid lane. He joined up with the WE organization in 2013 as part of their developmental squad but was promoted in early 2015 to their main roster as the starting mid laner. His consistency across a variety of play styles has become his calling card in the LPL. Need a mage that can lock down and annihilate squishy targets? Check, xiye has got you covered. What about an assassin that can dice the enemy team down to size? No problem.</p>\n\n<p>Xiye’s steady performances combined with an ocean deep champion pool means that the enemy never quite knows what composition Team WE could build -- this makes prepping to play against xiye a nightmare. Without an easy way to ban him out, xiye can easily meld his play to whatever mid laner is required. He’ll be the rock that Team WE rely on as they step up their game at the 2017 Mid-Season Invitational in Rio. </p>","de_DE":"Hanwei „xiye“ Su ist das perfekte Beispiel für Beständigkeit auf der mittleren Lane. Er wechselte im Jahr 2013 zu WE und spielte in deren Entwicklungsmannschaft, wurde Anfang 2015 aber zum Mid-Laner der Hauptmannschaft gemacht. Durch seine Beständigkeit und seine unterschiedlichen Spielstile machte er sich schnell einen Namen in der LPL. Brauchst du einen Magier, der verletzliche Ziele jagen und vernichten kann? Kein Problem, xiye ist genau der Richtige dafür. Wie wäre es mit einem Assassinen, der die gegnerische Mannschaft in Stück reißt? Auch kein Problem. Dank xiyes konstanten Leistungen und seines umfangreichen Championpools wissen seine Gegner nie genau, was sie erwartet, und dadurch wird es unglaublich schwer, sich auf xiye vorzubereiten. Es ist schwierig, xiye mit Bannen zu schwächen, denn er kann auf der mittleren Lane so gut wie jeden Champion spielen. In Rio wird er Team WEs Fels in der Brandung sein, wenn sich die Mannschaft für das Mid-Season Invitational 2017 bereit macht. ","es_ES":"Hanwei ''xiye'' Su es el alumno modelo en términos de estabilidad en la calle central. Se unió a la organización de WE en 2013 como parte de su grupo en desarrollo, pero ascendió al principio de 2015 a la plantilla principal como mid titular. Sus resultados positivos con diversos estilos de juego se han convertido en su tarjeta de presentación en la LPL. ¿Su equipo necesita un mago que pueda inmovilizar y aniquilar a los objetivos más débiles? Sin problema, para eso está xiye. ¿Y si conviene más jugar con un asesino que pueda trocear al equipo enemigo? Todo controlado. El desempeño estable de xiye combinado con su gran repertorio de campeones hacen que el equipo enemigo casi nunca pueda prever cuál será la composición de Team WE (eso provoca que prepararse para jugar contra xiye sea toda una pesadilla). Como bloquear su selecciones no es tarea fácil, xiye puede adaptar sin problema su estilo de juego según el mid que mejor encaje. Team WE confiará en sus habilidades cuando se suban al escenario del Mid-Season Invitational 2017 en Río. ","pl_PL":"Hanwei „xiye” Su daje wzór konsekwentnej gry na środkowej alei. Dołączył do organizacji WE w 2013 roku jako część składu rozwojowego, a na początku 2015 roku został awansowany do głównego składu jako pierwszy środkowy. Umiejętna gra różnymi stylami stała się jego wyróżnikiem w LPL. Potrzebny jest mag, który umie blokować i anihilować delikatne cel? Jasne, xiye załatwi sprawę. A co z zabójcą, który potrafi ukrócić zapędy wrogiej drużyny? Żaden problem. Spójne występy xiye w połączeniu z rozległą jak ocean pulą bohaterów oznaczają, że wróg nigdy nie wie, jaką kompozycję wybierze Team WE — a to sprawia, że przygotowanie do gry przeciwko xiye jest koszmarem. Ponieważ nie ma łatwego sposobu, by go zbanować, xiye może szybko dostosować swoją grę do stylu wymaganego w danej sytuacji od środkowego. Jest opoką, na której wesprą się Team WE, by pokazać, na co ich stać na Mid-Season Invitational 2017 w Rio. ","pt_BR":"<p>Hanwei “xiye” Su é o modelo de consistência na rota do meio. Ele entrou para a organização WE em 2013 como parte da sua equipe em formação, mas foi promovido no início de 2015 à sua seleção principal para jogar na rota do meio. Sua consistência em vários estilos de jogo se tornou seu principal trunfo na LPL. Precisam de um mago que imobilize e acabe com alvos frágeis? Pode deixar, o xiye dá conta. E que tal um assassino que possa dar uma podada na equipe inimiga? Sem problema.</p> \n\n<p>Os desempenhos estáveis de xiye e o seu impressionante leque de Campeões fazem com que seus oponentes jamais saibam que composição a Team WE vai montar, o que é um verdadeiro pesadelo para quem precisa se preparar para enfrentá-lo. Sem uma maneira fácil de banir suas principais escolhas, xiye pode facilmente adequar seu estilo de jogo ao de qualquer Campeão da rota do meio que seja necessário. Ele será o alicerce em que a Team WE se apoiará para avançar no Mid-Season Invitational 2017 no Rio. </p>","es_AR":"<p><strong>Hanwei \"xiye\" Su</strong> es la imagen de la coherencia en el carril central. Se unió a la organización WE en 2013 como parte de su escuadrón de desarrollo, pero fue ascendido a inicios de 2015 a su arsenal principal como su carrilero central principal. Su coherencia a lo largo de una variedad de estilos de juego se convirtió en su marco en el LPL. ¿Necesitas a un mago que atrape y aniquile a los objetivos aplastables? Bueno, <strong>xiye</strong> se encarga. ¿Qué hay de un asesino que reduzca a la mitad al equipo enemigo? No hay problema. El desempeño estable de <strong>xiye</strong>, combinado con una profunda agrupación de campeones significa que el enemigo nunca sabe cuál será la composición del Team WE. Esto hace que prepararse para pelear contra <strong>xiye</strong> sea una pesadilla. Sin una forma sencilla de eliminarlo, <strong>xiye</strong> puede adaptarse con facilidad a lo que el carrilero central necesite. Será la roca sobre la cual se base el Team WE cuando se preparen para el Mid-Season Invitational 2017 en Río.</p>"},"foreignIds":{"drupalId":"3186","TRLH1":"200000402","TRLH2":"200000302","TRLT3":"200000230"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":517,"slug":"mystic","name":"Mystic","firstName":"Seongjun","lastName":"Jin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mystic-cktg9mzr.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:57.000Z","bios":{"en_US":"<p>Seongjun “Mystic” Jin started his professional career in his native South Korea with the Jin Air Stealths in 2013. Near the tail-end of 2014 he decided to make the move to China and Team WE Academy. It was here that he made the perilous switch from jungle to AD carry. He acclimated quickly to the new role and Team WE took notice. They promoted Mystic to their roster as a sub and not long after he was promoted yet again to their starting AD carry position where he’s been since the spring of 2015.</p>\n\n<p>He’s comfortable on a variety of champions, from the initiation of Ashe’s Crystal Arrow to the raw carry potential of Piltover’s finest, Caitlyn -- Mystic can play it all. Team WE will rely on his versatility when they come face-to-face with some of the Rift’s most feared bot lane duos at the 2017 Mid-Season Invitational.</p>","pl_PL":"Seongjun „Mystic” Jin zaczął profesjonalną karierę w ojczystej Korei Południowej z Jin Air Stealths w 2013 roku. Pod sam koniec 2014 roku zdecydował się przeprowadzić do Chin i drużyny Team WE Academy. Tam dokonał ryzykownego przejścia z dżungli do roli prowadzącego. Szybko zaaklimatyzował się na nowej pozycji, a Team WE to zauważyli. Dołączyli Mystica do swojego składu jako rezerwowego, a niedługo później ponownie awansowali na pozycję prowadzącego w pierwszym składzie, którą zajmuje od wiosny 2015 roku. Dobrze sobie radzi z różnorakimi bohaterami od inicjującej Kryształowej Strzały Ashe po potencjalnie prowadzącą sławę z Piltover, Caitlyn — Mystic potrafi grać wszystkimi. Team WE będą polegali na jego wszechstronności, gdy staną twarzą w twarz z kilkoma z najgroźniejszych duetów dolnej alei Summoner’s Rift podczas Mid-Season Invitational 2017.","es_ES":"Seongjun ''Mystic'' Jin comenzó su trayectoria profesional en su Corea del Sur natal con Jin Air Stealths en 2013. Al final de 2014, decidió trasladarse a China para formar parte de Team WE Academy. Fue en ese momento cuando hizo un arriesgado cambio de rol: de jungla a AD carry. No tardaría en adaptarse a su nueva posición, y Team WE lo tuvo en cuenta. Lo ascendieron a su plantilla principal como suplente y, poco después, pasaría a ser AD carry titular, posición que ha ocupado desde la primavera de 2015. Se siente cómodo con una gran variedad de campeones: desde la capacidad de iniciación de la Flecha de cristal de Ashe, al potencial para dominar la partida de la sheriff más sofisticada de Piltover, Caitlyn. Mystic es capaz de jugar con cualquier campeón. Team WE confiará en su versatilidad cuando se enfrenten cara a cara contra algunos de los dúos de bot más temidos de la Grieta en el Mid-Season Invitational 2017.","de_DE":"Seongjun „Mystic“ Jin begann seine professionelle Karriere 2013 in seiner Heimat, Südkorea, bei Jin Air Stealths. Gegen Ende des Jahres 2014 entschied er sich aber, nach China zu Team WE Academy zu wechseln. Dort wechselte er auch aus dem Dschungel auf die untere Lane, um dort als AD-Carry zu spielen. Er fand sich schnell in seine neue Rolle ein und machte so Team WE auf sich aufmerksam. Sie nahmen Mystic als Ersatzspieler in ihre Aufstellung auf und machten ihn im Frühjahr 2015 zum Haupt-AD-Carry. Er kommt mit vielen Champions zurecht: Von Ashes Kristallpfeil bis zur brutalen Schadensmaschine aus Piltover, Caitlyn – Mystic kann alles spielen. Team WE wird seine Vielseitigkeit brauchen, wenn sie es beim Mid-Season Invitational 2017 mit den gefürchtetsten Duos auf der unteren Lane zu tun bekommen.v","pt_BR":"<p>Seongjun “Mystic” Jin começou sua carreira profissional na Coreia do Sul, sua terra natal, com a Jin Air Stealths em 2013. Perto do fim de 2014, ele decidiu se mudar para a China e entrou para a Team WE Academy. Foi lá que ele fez a arriscada mudança de caçador para atirador. Ele se acostumou rapidamente à nova função, chamando a atenção da Team WE. Eles então promoveram Mystic à sua seleção como reserva e, pouco tempo depois, ele foi novamente promovido para a posição de atirador principal, que ocupa desde a metade inicial de 2015.</p>\n\n<p>Ele joga com diversos Campeões, sentindo-se confortável tanto com a iniciação da Flecha de Cristal da Ashe quanto com o potencial de carregar partidas da defensora de Piltover, Caitlyn. Mystic é a versatilidade em pessoa. A Team WE vai depender do grande repertório dele quando ficar cara a cara com algumas das duplas da rota inferior mais temidas do Rift no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Seongjun \"Mystic\" Jin</strong> comenzó su carrera profesional en su Corea del Sur nativa con los Jin Air Stealths en 2013. Cerca de finales de 2014 decidió mudarse a China y entrar a la academia del Team WE. Aquí hizo el peligroso cambio de junglero a tirador. Se acostumbró rápidamente al nuevo rol y el Team WE lo notó. Ascendieron a <strong>Mystic</strong> a su arsenal como suplente y no mucho después fue ascendido nuevamente a tirador principal, puesto en el cual ha permanecido desde la primavera de 2015. Se siente cómodo con una variedad de campeones, desde la iniciación de la Flecha de Cristal de Ashe, hasta el potencial de acarreador de la mejor de Piltóver: Caitlyn. <strong>Mystic</strong> puede jugar con todos. El Team WE confía en su versatilidad cuando se enfrenten a los dúos de carril inferior más temidos de la Grieta en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"994","TRLH1":"200000403","TRLH2":"200000303","TRLT3":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":603,"slug":"raison","name":"Raison","firstName":"Soobeen","lastName":"Jeong","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/raison-9vqm9g4s.png","hometown":"","region":"LMS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-09T23:20:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4366","TRLH1":"200000405"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":692,"slug":"condi","name":"Condi","firstName":"Renjie","lastName":"Xiang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/condi-9gseaajf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-07-07T18:00:19.000Z","bios":{"en_US":"<p>Renjie “Condi” Xiang is China’s resident Baron steal specialist, stealing more of the purple monster’s powers than any other jungler in the LPL since 2015. Since joining Team WE, Condi has been instrumental to their success. His in-your-face style, counter-jungling prowess, and potent dueling make him one of the most fearsome players on the Rift. With his aggressive style, he tends to favor dueling champions like Graves, Lee Sin, and Rek’Sai.</p>\n\n<p>Condi was instrumental in Team WE’s dismantling of Royals Never Give Up in the 2017 LPL Spring Split Finals. He consistently sliced through the enemy frontline and deleted the enemy damage dealers, turning even fights into blowouts. After the match, a tearful Condi couldn’t find any words except “I am so grateful to my teammates!” Let’s hope we see the same type of emotion and dominance as Condi travels to Rio to take on the world’s best at the 2017 Mid-Season Invitational.</p>","pl_PL":"Renjie „Condi” Xiang to chiński specjalista od wykradania Baronów. Skradł więcej mocy purpurowego potwora niż jakikolwiek inny dżungler w LPL od 2015 roku. Odkąd dołączył do Team WE, Condi stał się motorem sukcesu drużyny. Jego bezpośredni styl gry, sprawność w kontrowaniu dżunglowania i świetne umiejętności pojedynkowe sprawiają, że jest jednym z najgroźniejszych graczy na Summoner’s Rift. Ze względu na swój agresywny styl najchętniej wybiera pojedynkujących się bohaterów, takich jak Graves, Lee Sin i Rek’Sai. Condi odegrał główną rolę w rozbiciu przez Team WE drużyny Royal Never Give Up w finale wiosennego splitu LPL 2017. Regularnie przebijał się przez wrogą linię frontu i kasował zadających obrażenia przeciwników, zmieniając wyrównane walki w prawdziwą rzeź. Po meczu Condi ze łzami w oczach nie potrafił znaleźć innych słów niż: „Jestem tak bardzo wdzięczny moim kolegom z drużyny!”. Mamy nadzieję zobaczyć podobne emocje i dominację, gdy Condi wyruszy do Rio, by walczyć z najlepszymi na świecie podczas Mid-Season Invitational 2017.","es_ES":"Renjie ''Condi'' Xiang es el ladrón de Barones chino por excelencia, pues ha conseguido robar los efectos del monstruo morado más que ningún otro jungla de la LPL desde 2015. Desde que se unió a Team WE, Condi ha sido fundamental para el éxito del equipo. Su estilo enérgico, su habilidad para robar la jungla enemiga y su potente capacidad para batirse en duelo lo convierten en uno de los jugadores más temidos de la Grieta. Como su estilo es agresivo, suele optar por campeones capaces de batirse en duelo como Graves, Lee Sin o Rek'Sai. Condi fue una pieza clave para la victoria de Team WE contra Royal Never Give Up en la final del split de primavera de la LPL 2017. Consiguió de forma sistemática ignorar al frente enemigo y aplastar a sus campeones de daño, cambiando las tornas del combate a su favor. Tras la partida, con lágrimas en los ojos, Condi solo pudo articular las siguientes palabras: ''¡Les doy gracias infinitas a mis compañeros de equipo!''. Esperamos que se muestre igual de emocionado y dominante cuando viaje a Río para derrotar a los mejores del mundo en el Mid-Season Invitational 2017.","de_DE":"Renjie „Condi“ Xiang ist Chinas Experte, wenn es um das Stehlen von Barons geht (seit 2015 hat er sich die Kräfte des violetten Monsters häufiger zunutze gemacht, als alle anderen Jungler in der LPL)  Seit seinem Wechsel zu Team WE ist Condi für den Erfolg der Mannschaft unerlässlich. Sein aggressiver Stil, seine Stärke im gegnerischen Dschungel und seine Entscheidungen in Duellen machen ihn zu einem der gefährlichsten Spieler in der Kluft. Durch seine Aggressivität bevorzugt er Champions wie Graves, Lee Sin und Rek’Sai. Condi war maßgeblich daran beteiligt, dass Team WE Royal Never Give Up im Finale des Frühjahrs-Splits der LPL 2017 vernichten konnte. Er kämpfte sich immer wieder durch die Frontlinie seiner Gegner, vernichtete die feindlichen Carrys und machte aus ausgeglichenen Kämpfen Gemetzel. Das Einzige, was der überwältigte Condi nach dem Spiel sagen konnte war: „Ich bin meinen Mannschaftskameraden so dankbar!“ Hoffentlich sehen wir auch beim Mid-Season Invitational 2017 so viel Emotion und Dominanz, wo es Condi mit den Besten der Welt zu tun bekommt.","pt_BR":"<p>Renjie “Condi” Xiang é o especialista em roubos de Barão na China, tendo roubado o poder do monstro roxo mais vezes do que qualquer outro caçador da selva na LPL desde 2015. Desde que entrou para a Team WE, Condi tem sido crucial para o seu sucesso. Seu estilo de partir para cima, sua proeza em invasões da selva e seu forte desempenho em duelos fazem dele um dos jogadores mais temíveis no Rift. Com seu estilo agressivo, ele costuma preferir Campeões como Graves, Lee Sin e Rek’Sai. </p>\n\n<p>Condi foi fundamental para o desmantelamento da Royal Never Give Up por parte da Team WE na final da Etapa de Primavera da LPL 2017. Ele consistentemente rasgava a linha de frente inimiga e destruía os causadores de dano, transformando lutas equilibradas em vitórias unilaterais. Depois da partida, com lágrimas nos olhos, Condi conseguiu dizer apenas: “Sou muito grato aos meus companheiros de equipe!” Vamos torcer para ver o mesmo tipo de emoção e dominação agora que Condi viaja ao Rio para enfrentar os melhores do mundo no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Renjie “Condi” Xiang</strong> es el experto en robos de Barón de China, logra robar más de los poderes del monstruo morado que ningún otro junglero en el LPL desde 2015. Desde que se unió al Team WE, <strong>Condi</strong> ha sido clave para su éxito. Tiene un estilo de juego provocativo, destreza para el contrajungleo y es un duelista muy fuerte, lo que lo hace uno de los jugadores más atemorizantes de la Grieta. Con su estilo agresivo tiende a favorecer a los campeones duelistas como Graves, Lee Sin y Rek’Sai. Condi fue clave para el desmantelamiento de los Royal Never Give Up en manos del Team WE en las finales del 2017 del Torneo de Apertura LPL. Abrió la línea frontal del enemigo constantemente y eliminó a todos los enemigos que infligían daño para convertir las peleas justas en palizas. Después de la partida, <strong>Condi</strong> estaba lleno de lágrimas y no podía decir otra cosa más que: <i>\"¡Estoy tan agradecido con mis compañeros!\"</i> Esperamos ver el mismo tipo de emoción y dominio mientras <strong>Condi</strong> viaja a Río para participar en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"4218","TRLH1":"200000401","TRLH2":"200000301","TRLT3":"200000229"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1038,"slug":"957","name":"957","firstName":"Changyu","lastName":"Ke","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/957-fcqbzhtx.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:09.000Z","updatedAt":"2017-07-07T17:52:32.000Z","bios":{"en_US":"<p>Changyu “957” Ke kicked off his career in 2015 as the starting top laner for Team WE’s developmental squad, Team WE Future. It was there that he established himself as a reliable option and as his repertoire grew, his sister team began to take notice. In early 2016, 957 made the jump to Team WE’s LPL squad where he made an immediate difference. His steady, low maintenance play on stalwarts like Maokai, Poppy, and Nautilus provided Team WE with a dependable presence in the top lane.</p>\n\n<p>He requires notoriously low resources in game, freeing up his teammates to farm gold and kills to their heart’s content. He doesn’t mind though, because once opponents come up against him late game, chances are that he’s already an unkillable mega tank. 957’s consistency will truly be tested as he heads to Rio to clash with the best top laners the world has to offer at the 2017 Mid-Season Invitational.</p>","de_DE":"Changyu „957“ Ke begann seine Karriere 2015 als Top-Laner für die Entwicklungsmannschaft von Team WE, Team WE Future. Dort konnte er sich als verlässliche Option etablieren und als er sich weiter steigerte, wurde seine Schwestermannschaft auf ihn aufmerksam. Anfang des Jahres 2016 wechselte 957 schließlich zu Team WE in die LPL, wo er sofort einen Unterschied ausmachte. Seine stabilen Leistungen mit Champions wie Maokai, Poppy und Nautilus verliehen Team WE eine verlässliche Präsenz auf der oberen Lane. Er benötigt nur sehr wenige Ressourcen und überlässt das Gold und die Tötungen seinen Mannschaftskameraden. Aber das stört ihn nicht, denn wenn die Gegner ihm im späten Spiel zu Leibe rücken, ist er in der Regel bereits ein unsterblicher Mega-Tank. Beim Mid-Season Invitational 2017 in Rio wird 957s Beständigkeit auf die Probe gestellt, wenn er es mit den besten Top-Lanern der Welt zu tun bekommt.","es_ES":"Changyu ''957'' Ke comenzó su trayectoria en 2015 como top titular del grupo en desarrollo de Team WE, Team WE Future. A partir de entonces, demostró ser una opción fiable y, a medida que él fue aumentando su repertorio de campeones, el equipo hermano de Team WE comenzó a hacerse notar. A comienzos de 2016, 957 se unió al grupo de la LPL de Team WE y no tardaría en marcar la diferencia. Su estilo de juego estable y de bajo mantenimiento, con campeones resistentes como Maokai, Poppy y Nautilus, aportó a Team WE una presencia de fiar en la calle superior. Necesita muy pocos recursos durante la partida, lo que permite que sus compañeros de equipo puedan farmear y llevarse asesinatos libremente. Y eso no es algo que le afecte, pues cuando los oponentes intenten enfrentarse a él al final de la partida, es probable que ya sea un megatanque inmortal. La estabilidad de 957 será puesta a prueba en Río cuando se enfrente a los mejores jugadores de la calle superior del mundo en el Mid-Season Invitational 2017.","fr_FR":"Changyu „957” Ke rozpoczął karierę w 2015 roku jako główny górny rozwojowego składu Team WE, Team WE Future. Tam pokazał, że jest solidnym zawodnikiem i gdy rozszerzył swój repertuar, siostrzana drużyna zaczęła na niego zwracać uwagę. Na początku 2016 roku 957 przeszedł do występującego w LPL składu Team WE i osiągnięcia drużyny natychmiast się poprawiły. Jego równa, zużywająca niewiele zasobów gra podporami drużyny, takimi jak Maokai, Poppy i Nautilus, zapewniła Team WE stałą obecność na górnej alei. 957 w dalszym ciągu zużywa niewiele zasobów w grze, umożliwiając kolegom farmienie złota i zabójstw, ile dusza zapragnie. Nie przeszkadza mu to wcale, ponieważ gdy przeciwnicy ruszą przeciwko niemu w późnej fazie gry, są duże szanse na to, że będzie już wtedy niemożliwym do zabicia megaobrońcą. Konsekwentny styl gry 957 zostanie poddany prawdziwej próbie, gdy zawodnik pojedzie do Rio, by zetrzeć się z najlepszymi górnymi, jakich ma do zaoferowania świat, na Mid-Season Invitational 2017.","pt_BR":"<p>Changyu “957” Ke começou sua carreira em 2015 como o jogador da rota superior da equipe de formação da Team WE, a Team WE Future. Foi lá que ele se estabeleceu como uma opção confiável, e à medida que seu repertório cresceu, sua equipe irmã começou a prestar atenção nele. No início de 2016, 957 foi transferido para a equipe da LPL da Team WE, onde logo de cara fez a diferença. Seu desempenho estável e econômico com Campeões como Maokai, Poppy e Nautilus fez dele uma presença sustentadora para a Team WE na rota superior. </p><p>Ele consome pouquíssimos recursos no jogo, permitindo que seus companheiros de equipe coletem ouro e abates à vontade. E ele não se importa, porque quando seus oponentes o enfrentam nos estágios mais avançados do jogo, ele geralmente já virou um mega tanque simplesmente invencível. A consistência de 957 será colocada à prova em seu rumo ao Rio, onde ele enfrentará os melhores jogadores da rota superior que o mundo tem a oferecer no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Changyu \"957\" Ke</strong> comenzó su carrera en 2015 como el carrilero superior del escuadrón en desarrollo del Team WE, el Team WE Future. Ahí se estableció como una opción confiable y mientras su repertorio crecía su equipo hermano comenzó a notarlo. A principios del 2016, <strong>957</strong> pasó al escuadrón LPL del Team WE, en donde hizo una diferencia inmediatamente. Su juego firme, pero de bajo mantenimiento con opciones fuertes como Maokai, Poppy y Nautilus brindan al Team WE una presencia confiable en el carril superior. Él necesita recursos increíblemente bajos en una partida, lo que permite que sus compañeros coleccionen oro y asesinatos como les apetezca. No le molesta porque cuando los oponentes lo enfrentan en el juego tardío, es probable que ya sea un megatanque inmortal. La coherencia de <strong>957</strong> será puesta a prueba mientras se dirige hacia Río para enfrentarse con los mejores carrileros superiores del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000400","TRLH2":"200000300","TRLT3":"200000228"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1428,"slug":"ben","name":"Ben","firstName":"Donghyun","lastName":"Nam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben-1yppxrjt.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:25:24.000Z","updatedAt":"2017-07-07T22:23:11.000Z","bios":{"en_US":"<p>Donghyun “Ben” Nam started his professional career in the summer of 2016 when he was signed by Invictus Gaming. He unfortunately didn’t have many chances to showcase his talent when he was with Invictus, but since joining Team WE in late 2016, he’s been able to show glimpses of his mechanical prowess on the Rift. He was largely unknown before joining up with Team WE, but the LPL has been abuzz with his name ever since.</p>\n\n<p>It took him awhile to sync up with lane mate Mystic, but with his mechanical ceiling many fans are clamoring for more from him. After helping his team sweep Royal Never Give Up in the finals, Ben has the chance to show the world how supports can carry games. He’s looking to shine as he squares off against international competition for the first time at the 2017 Mid-Season Invitational.</p>","de_DE":"Donghyun „Ben“ Nam begann seine professionelle Karriere im Sommer 2016, als er bei Invictus Gaming unterschrieb. Leider konnte er bei Invictus sein Talent nur selten unter Beweis stellen, aber seit seinem Wechsel zu Team WE Ende 2016 stellte er immer wieder sein mechanisches Können unter Beweis. Vor seinem Wechsel zu Team WE war er noch Großteils unbekannt, aber seither kennt die ganze LPL seinen Namen. Es hat eine Weile gedauert, bis er sich auf seinen Lane-Partner Mystic eingestellt hatte, aber aufgrund seines mechanischen Könnens erwarten viele Fans noch mehr von ihm. Nachdem er seiner Mannschaft im Finale des Frühjahrs-Splits der LPL geholfen hat, mit Royal Never Give Up den Boden aufzuwischen, bekommt Ben jetzt die Chance, der Welt zu zeigen, wie man als Supporter Spiele entscheidet. Er wird sein Bestes geben, wenn er beim Mid-Season Invitational 2017 auf die internationale Konkurrenz trifft.","es_ES":"Donghyun ''Ben'' Nam comenzó su carrera profesional en el verano de 2016, cuando fue fichado por Invictus Gaming. Por desgracia, no tuvo muchas oportunidades para mostrar su talento cuando jugó con Invictus, pero desde que se unió a Team WE al final de 2016, ha podido hacer gala de sus destrezas en la Grieta. No era apenas conocido cuando se unió a Team WE, pero su nombre no ha dejado de repetirse en la LPL desde entonces. Tardó un tiempo en congeniar con su compañero de calle, Mystic, pero sus capacidades mecánicas son tan buenas que sus fans aún quieren más. Tras ayudar a su equipo a vencer a Royal Never Give Up en la final, Ben ahora tiene la oportunidad de demostrarle al mundo que los apoyos también pueden liderar a su equipo hasta la victoria. Intentará darlo todo cuando pise el escenario internacional por primera vez en el Mid-Season Invitational 2017.","pl_PL":"Donghyun „Ben” Nam zaczął profesjonalną karierę latem 2016 roku, gdy został zwerbowany przez Invictus Gaming. Niestety nie miał wielu okazji, by zademonstrować swój talent, grając z Invictus, dopiero odkąd dołączył do Team WE pod koniec 2016 roku może się popisywać umiejętnościami mechanicznymi na Summoner’s Rift. Przed dołączeniem do Team WE nie był szerzej znany, ale od tamtej pory LPL nie przestaje o nim mówić. Zgranie się z kolegą z alei, Mysticem, zajęło mu trochę czasu, jednak teraz fani domagają się od niego jeszcze więcej, znając górny pułap jego umiejętności mechanicznych. Po tym, jak pomógł swojej drużynie zmieść Royal Never Give Up w finale, Ben ma szansę pokazać światu, że wspierający także potrafią prowadzić do zwycięstwa w grach. Podczas swojego pierwszego starcia z rywalami z całego świata na Mid-Season Invitational 2017 na pewno spróbuje zabłysnąć.","pt_BR":"<p>Donghyun “Ben” Nam começou sua carreira profissional na metade de 2016, quando foi contratado pela Invictus Gaming. Ele infelizmente não teve muitas oportunidades de demonstrar seu talento enquanto esteve na Invictus, mas desde que entrou para a Team WE no final de 2016, temos tido vislumbres da sua proeza mecânica no Rift. Ele era bastante desconhecido antes de se juntar à Team WE, mas desde então seu nome é um dos mais citados na LPL. </p>\n\n<p>Sua sincronia com seu companheiro de rota, Mystic, não foi imediata, mas com seu alto nível de mecânica, muitos fãs estão ansiosos para vê-lo jogar mais. Após ter ajudado sua equipe a massacrar a Royal Never Give Up na final, Ben agora tem a chance de mostrar ao mundo como suportes podem carregar partidas. Ele pretende brilhar no Mid-Season Invitational 2017, onde enfrentará competidores internacionais pela primeira vez.</p>","es_AR":"<p><strong>Donghyun \"Ben\" Nam</strong> comenzó su carrera profesional en el verano de 2016 cuando entró a Invictus Gaming. Por desgracia, no tuvo muchas oportunidades de demostrar su talento cuando estuvo en Invictus, pero desde que se unió al Team WE a fines de 2016, ha podido mostrar destellos de su poderío mecánico en la Grieta. No era famoso antes de unirse al Team WE, pero LPL no deja de oír su nombre desde entonces. Le tomó un tiempo sincronizarse con su compañero de carril, <strong>Mystic</strong>, pero debido a sus habilidades mecánicas muchos seguidores lo aclaman. Después de ayudar a su equipo a ganar el Royal Never Give Up en las finales, <strong>Ben</strong> tuvo la oportunidad de mostrarle al mundo cómo los soportes pueden ser acarreadores en las partidas. Busca destacar en la competencia internacional por primera vez en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000406","TRLH2":"200000306"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1991,"slug":"zbb","name":"Zbb","firstName":"Zhi","lastName":"Ke","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:24:21.000Z","updatedAt":"2017-06-07T00:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1992,"slug":"laozhou","name":"Laozhou","firstName":"Chao","lastName":"Zhou","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:17:21.000Z","updatedAt":"2017-07-07T17:53:44.000Z","bios":{},"foreignIds":{"TRLT3":"200000233"},"socialNetworks":{},"champions":[],"liveGameTeam":82}],"scheduleItems":[{"id":"AVmFfmMuoUG4HPFjOKIC","content":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:match:b76360d6-3b0a-4224-9633-1a7b41cb665e","scheduledTime":"2017-03-18T08:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696","blockLabel":"6","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:bracket:8aad9de4-4ef3-43e3-8562-55d87ce468e8"},"match":"b76360d6-3b0a-4224-9633-1a7b41cb665e","tournament":"5ca2f3d5-3682-4635-bac2-87f5a7f41696","bracket":"8aad9de4-4ef3-43e3-8562-55d87ce468e8","league":"7"}],"gameIdMappings":[],"videos":[{"id":6175,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:f1f2cb61-504f-484f-a0de-2c7f9d8e680d","source":"https://www.youtube.com/embed/Nd3dB74Ix8k?wmode=transparent&start=11748","createdAt":"2017-03-18T19:01:30.000Z","updatedAt":"2017-03-18T19:01:30.000Z","game":"f1f2cb61-504f-484f-a0de-2c7f9d8e680d"},{"id":6176,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:34460adc-2266-4c2b-97e6-d3ab60f0c315","source":"https://www.youtube.com/embed/Nd3dB74Ix8k?wmode=transparent&start=14607","createdAt":"2017-03-18T19:02:03.000Z","updatedAt":"2017-03-18T19:02:03.000Z","game":"34460adc-2266-4c2b-97e6-d3ab60f0c315"},{"id":6177,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:85b49f0e-e654-4a9b-ac2a-aa246cff5eba","source":"https://www.youtube.com/embed/Nd3dB74Ix8k?wmode=transparent&start=17855","createdAt":"2017-03-18T19:08:33.000Z","updatedAt":"2017-03-18T19:08:33.000Z","game":"85b49f0e-e654-4a9b-ac2a-aa246cff5eba"}],"htmlBlocks":[],"match":{"id":"b76360d6-3b0a-4224-9633-1a7b41cb665e","name":"WE-vs-RNG","position":23,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"},{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}],"games":{"34460adc-2266-4c2b-97e6-d3ab60f0c315":{"id":"34460adc-2266-4c2b-97e6-d3ab60f0c315","name":"G2","generatedName":"RNG|WE|G2|b76360d63b0a42249633","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"},{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}],"standings":{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489863880082,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489861599753,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"85b49f0e-e654-4a9b-ac2a-aa246cff5eba":{"id":"85b49f0e-e654-4a9b-ac2a-aa246cff5eba","name":"G3","generatedName":"RNG|WE|G3|b76360d63b0a42249633","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"},{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}],"standings":{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489863901437,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489861605506,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f1f2cb61-504f-484f-a0de-2c7f9d8e680d":{"id":"f1f2cb61-504f-484f-a0de-2c7f9d8e680d","name":"G1","generatedName":"RNG|WE|G1|b76360d63b0a42249633","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"},{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],"standings":{"result":[[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}],[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}]],"timestamp":1489863846572,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}],[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}]],"timestamp":1489861595805,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489863901438,"source":"bestOf","history":[{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489863880083,"source":"bestOf","closed":true},{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489863846573,"source":"bestOf","closed":true},{"result":[[{"roster":"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1"}],[{"roster":"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247"}]],"timestamp":1489861605509,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"d4f41fa9-e16d-404f-8d99-bd8dbebf8ef1":1,"d0bc5dbc-bb99-479d-8bfe-bb22a10a0247":0}}}