{"teams":[{"id":129,"slug":"dire-wolves","name":"Dire Wolves","guid":"be6f059f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-670hnbxe.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-7ka5aby3.png","acronym":"DW","homeLeague":"urn:rg:lolesports:global:league:league:13","altLogoUrl":null,"createdAt":"2015-09-22T01:39:36.000Z","updatedAt":"2017-06-06T05:03:48.000Z","bios":{"en_US":"<br>\n<a href=\"https://www.facebook.com/direwolvesgg/\" target=\"_blank\">Dire Wolves on Facebook</a>\n<br>\n<a href=\"https://twitter.com/direwolvesgg\" target=\"_blank\">Dire Wolves on Twitter</a>\n<br>\n<a href=\"https://store.direwolves.gg/\" target=\"_blank\">Dire Wolves Store</a>\n<br>\n<a href=\"https://www.hyvio.com/direwolves\" target=\"_blank\">Join the Wolfpack</a>","es_AR":"<p>Después de dos años de quedarse cortos en la OPL, los Dire Wolves por fin reclamaron su primer campeonato de liga. Después de unirse a la OPL en 2015, este equipo nunca había quedado en un lugar menor al cuarto o mejor que el segundo... hasta ahora. Su alineación mejorada demostró ser demasiado para su competencia, en gran parte gracias al regreso del tirador <strong>K1ng</strong>, y derrotaron a Legacy eSports 3-1 en la final de la OPL. Ahora están listos para ir al Mid-Season Invitational 2017, en donde estarán buscando reconocimiento internacional.</p>","de_DE":"Nachdem die Dire Wolves die OPL in den letzten beiden Jahren knapp nicht gewinnen konnten, hat es diesmal endlich gereicht. Die Mannschaft spielt seit 2015 in der OPL und belegte immer die Plätze vier, drei oder zwei – bis jetzt. Mit ihrer neuen Aufstellung und der Rückkehr des berühmten AD-Carrys K1ng waren sie für ihre Konkurrenten einfach eine Nummer zu groß, was sie auch im Finale der OPL bewiesen, in dem sie Legacy eSports 3–1 besiegten. Jetzt sind sie beim Mid-Season Invitational 2017 dabei, wo sie um internationale Anerkennung kämpfen werden.","es_ES":"Tras dos años quedándose a las puertas en la OPL, los Dire Wolves han ganado su primer campeonato de liga. Se unieron en 2015 a la OPL y, desde entonces, nunca han quedado por debajo del cuarto puesto, pero tampoco por encima del segundo... hasta ahora. Su nueva plantilla ha resultado ser demasiado fuerte para sus rivales; en gran parte, gracias al regreso de su ADC titular, K1ng. En la final de la OPL, vencieron 3 a 1 a Legacy eSports. Ahora, en el Mid-Season Invitational 2017, tendrán que luchar para ganarse el reconocimiento internacional.","fr_FR":"Après deux mauvaises années en OPL, les Dire Wolves ont enfin remporté leur premier championnat de League of Legends. Depuis son arrivée dans l'OPL en 2015, l'équipe n'avait jamais fait moins bien que 4e place ni mieux que la 2e place – jusqu'à maintenant. Avec leur nouvelle formation, les Dire Wolves n'ont fait qu'une bouché de la concurrence, en grande partie grâce au retour de la star ADC K1ng, et ont vaincu Legacy eSports à 3-1 lors de la finale de l'OPL. À présent, ils se préparent à disputer le Mid-Season Invitational 2017 et ils ont soif de reconnaissance internationale.","pl_PL":"Po dwóch latach, w których tak niewiele im brakowało, by podbić OPL, Dire Wolves nareszcie zdobyli swoje pierwsze mistrzostwo ligi. Po dołączeniu do OPL w 2015 roku drużyna nigdy nie zajęła pozycji gorszej niż czwarta, ani lepszej niż druga — aż do teraz. Odświeżony skład okazał się zbyt twardym orzechem do zgryzienia dla konkurencji — w dużej mierze dzięki powrotowi gwiazdorskiego prowadzącego, K1nga — i drużyna pokonała Legacy eSports 3-1 w finale OPL. Teraz czas na Mid-Season Invitational 2017, gdzie zamierzają zasłużyć na międzynarodowe uznanie.","pt_BR":"<p>Após dois anos morrendo na praia da OPL, os Dire Wolves finalmente venceram o seu primeiro campeonato. Após entrar para a OPL em 2015, a equipe terminou sempre no mínimo em quarto lugar, mas nunca acima do segundo... Até agora. Seu elenco reformulado provou estar acima dos competidores, em grande parte graças ao retorno do grande atirador, K1ng, e eles derrotaram a Legacy eSports na Final da OPL. Agora é a hora do Mid-Season Invitational 2017, quando eles estarão em busca de reconhecimento internacional.</p>"},"foreignIds":{},"players":[858,865,867,1072,1076,1100],"starters":[858,865,867,1076,1100],"subs":[1072]},{"id":242,"slug":"rampage","name":"Rampage","guid":"be71ae2e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/rampage-c659oz95.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/rampage-4caqgbq7.png","acronym":"RPG","homeLeague":"urn:rg:lolesports:global:league:league:42","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/rampage-8wzhit7v.png","createdAt":"2016-08-19T22:12:06.000Z","updatedAt":"2017-05-31T18:58:21.000Z","bios":{"en_US":"<p>Originally established in 2012, Rampage is a long-standing organization that hails from Japan. While the team has struggled internationally, they have excelled domestically. They’ve taken the first place trophy in two consecutive splits of LJL action, making them the undisputed kings of Japan. With their play-in spot locked, Rampage is looking to right the past and propel themselves, and Japan, into the international spotlight.</p>\n\n<p>Coach: Donghun “3 4” Kim</p>","pt_BR":"<p>Originalmente estabelecida em 2012, a Rampage é uma organização que mesmo tendo dificuldades no cenário internacional, eles se superaram nacionalmente. Os membros da Rampage levaram o troféu de primeiro lugar em duas etapas consecutivas da LJL, o que os torna os reis supremos no Japão. Com vaga garantida na Fase de Entrada, a Rampage quer corrigir os erros do passado e colocar a equipe e seu país nos holofotes internacionais.</p>","es_AR":"<p>Rampage se estableció en el 2012. Es una antigua organización que proviene de Japón. Aunque el equipo ha tenido problemas internacionalmente, son los mejores de manera local. Han ganado el trofeo de primer lugar dos veces seguidas en los torneos de la LJL, siendo los reyes indiscutibles de Japón. Con las Eliminatorias iniciales cerradas, Rampage deja el pasado atrás y se impulsan junto a Japón a la escena internacional.</p>","de_DE":"Rampage wurde 2012 in Japan gegründet. Obwohl die Mannschaft ihre Region immer wieder dominiert, konnte sie international noch nicht für Furore sorgen. Sie konnten sich zwei Splits hintereinander die Trophäe der LJL sichern und gelten als die unangefochtenen Könige Japans. Rampage konnte sich einen Platz in der Vorrundenphase erkämpfen, wo die Mannschaft versuchen wird, die Vergangenheit hinter sich zu lassen, und sich selbst sowie ganz Japan ins internationale Rampenlicht zu spielen.","fr_FR":"Fondée en 2012, Rampage est une ancienne équipe qui nous vient du Japon. Si elle a connu quelques difficultés sur la scène internationale, elle a excellé au niveau national. Elle a remporté deux segments consécutifs de la LJL, et a ainsi accédé au statut de leader incontesté du Japon. Après avoir assuré son billet pour les qualifications, Rampage compte bien corriger les erreurs du passé en brillant sur la scène internationale.","es_ES":"Fundada originalmente en 2012, Rampage es una organización veterana procedente de Japón. Aunque este equipo ha tenido dificultades a nivel internacional, ha destacado a nivel local. Se han hecho con el primer puesto en dos splits consecutivos de la LJL, lo que los convierte en los reyes indiscutibles de Japón. Con su puesto asegurado para la fase de apertura, Rampage buscar redimirse por sus errores del pasado y colocarse tanto a ellos mismos como a Japón en el centro de la escena internacional.","pl_PL":"Rampage to doświadczona organizacja, która powstała w 2012 roku w Japonii. Chociaż drużyna miała pewne problemy na scenie międzynarodowej, u siebie radzi sobie doskonale. Rampage zajęli pierwsze miejsce w dwóch kolejnych splitach w LJL, stając się niekwestionowanymi królami Japonii. Po zdobyciu miejsca w fazie grupowej Rampage spróbują poprawić błędy z przeszłości i wprowadzić siebie, oraz Japonię, w światła sceny międzynarodowej."},"foreignIds":{},"players":[919,922,1415,1418,1861,1862],"starters":[922,1415,1418,1861,1862],"subs":[919]}],"players":[{"id":858,"slug":"destiny","name":"Destiny","firstName":"Mitchell","lastName":"Shaw","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/destiny-h3hdrfj.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:09:07.000Z","updatedAt":"2017-07-14T04:16:04.000Z","bios":{"en_US":"<p>Mitchell “Destiny” Shaw is the support for the OPL’s Dire Wolves. He joined the OPL in 2015 as a support, then role swapped to ADC for the 2016 season. He returned to his original role on Dire Wolves to start the 2017 season. As a former carry player, he sometimes brings that playstyle to support-- he went undefeated in five games on Zyra. He’s also an excellent Nami player when the situation calls for it. He’ll need to be flexible in his champion picks if he wants his team to have the best shot at earning a spot in groups at the 2017 Mid-Season Invitational in Brazil.</p>","es_AR":"<p><strong>Mitchell \"Destiny\" Shaw</strong> es el soporte de los Dire Wolves de la OPL. Se unió a la OPL en 2015 como soporte, pero cambió de papel a tirador para la temporada 2016. Regresó a su papel original en los Dire Wolves al comienzo de la temporada 2017. Como ex tirador, a veces utiliza ese estilo de juego como soporte... salió invicto de cinco partidas con Zyra. Además, es un excelente jugador con Nami cuando la situación lo amerita. Tendrá que ser flexible al escoger a su campeón si quiere que su equipo tenga la mejor oportunidad para ganarse un lugar en la fase de grupos en el Mid-Season Invitational 2017 en Río.</p>","pl_PL":"Mitchell „Destiny” Shaw jest wspierającym Dire Wolves z OPL. W 2015 r. dołączył do OPL jako wspierający, a potem zmienił rolę na prowadzącego w ciągu sezonu 2016. Jednak z początkiem sezonu 2017 powrócił do swojej pierwszej roli w Dire Wolves. Jako były prowadzący czasami wykorzystuje ten styl gry we wsparciu — był niepokonany w pięciu grach Zyrą. Jest także świetnym graczem Nami, gdy wymaga tego sytuacja. Będzie musiał być elastyczny w doborze bohaterów, jeśli chce zapewnić swojej drużynie największe szanse na zdobycie miejsca w grupach podczas Mid-Season Invitational 2017 w Brazylii.","fr_FR":"Mitchell « Destiny » Shaw est le support des Dire Wolves. Il a rejoint l'OPL en 2015 en tant que support, avant de devenir ADC lors de la saison 2016. Il a finalement retrouvé son rôle original chez les Dire Wolves au début de la saison 2017. Son expérience en tant que carry influence parfois son style de jeu en support – il est resté invaincu pendant cinq parties avec Zyra. C'est également un excellent joueur avec Nami lorsque la situation le requiert. Il devra être flexible dans ses choix de champions s'il veut que son équipe ait une chance de décrocher une place lors de la phase de groupe du Mid-Season Invitational 2017 au Brésil.","es_ES":"Mitchell ''Destiny'' Shaw es el apoyo de Dire Wolves. Se unió a la OPL en 2015 como apoyo, pero pasó a jugar como ADC en la temporada 2016. Al comienzo de la temporada 2017 volvió a su rol original con Dire Wolves. Como antiguo carry, aporta parte de ese estilo de juego al rol de apoyo (consiguió mantenerse cinco partidas invicto con Zyra). También es un gran jugador de Nami cuando la situación así lo requiere. Tendrá que ser flexible en su selección de campeones si quiere que su equipo tenga una oportunidad de llegar a la fase de grupos en el Mid-Season Invitational 2017 de Brasil","de_DE":"Mitchell „Destiny“ Shaw ist der Supporter der Dire Wolves. Er begann seine Karriere in der OPL im Jahr 2015 als Supporter, schlüpfte in der Saison 2016 aber in die Rolle des AD-Carrys. Zu Beginn der Saison 2017 übernahm er dann bei den Dire Wolves wieder seine ursprüngliche Rolle. Als ehemaliger Carry legt er auch seine Rolle als Supporter manchmal sehr offensiv an – er schaffte es, mit Zyra fünf Siege ungeschlagen zu bleiben. Außerdem kann er auch mit Nami hervorragend umgehen, wenn es die Situation erfordert. Er wird bei der Championwahl flexibel sein müssen, wenn er mit seiner Mannschaft einen Platz in der Gruppenphase des Mid-Season Invitational 2017 in Brasilien ergattern will.","pt_BR":"<p>Mitchell \"Destiny” Shaw é o suporte dos Dire Wolves da OPL. Ele entrou para a OPL em 2015 como suporte, depois trocou de função para Atirador na temporada 2016. Ele retomou sua função original na Dire Wolves no início da temporada 2017. Como ex-carregador, às vezes ele traz esse estilo de jogo para o suporte; ele passou invicto em cinco jogos como Zyra. E também joga muito bem como Nami quando a situação exige. Ele terá de ser flexível na sua escolha de Campeões se quiser que a sua equipe tenha a chance de avançar no Mid-Season Invitation 2017.</p>"},"foreignIds":{"TRNA1":"1000435440","ESPORTSTMNT03":"200000501","TRLT3":"200000044"},"socialNetworks":{"twitter":"https://twitter.com/DestinyOCE"},"champions":[],"liveGameTeam":129},{"id":865,"slug":"k1ng","name":"k1ng","firstName":"Calvin","lastName":"Truong","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/k1ng-9bm5nq5c.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:32:17.000Z","updatedAt":"2017-07-14T05:22:55.000Z","bios":{"en_US":"<p>Calvin “k1ng” Truong is the star ADC for Dire Wolves. He’s one of the best ADC player in the OPL, and he knows it-- he joined in the league in 2014 under the name “BEST AD.” The 19-year-old left Dire Wolves for a year to play with Legacy eSports, but returned to start the 2017 season. He dominated on lethality-based carries like Varus and Jhin during the regular season, earning a 6.43 KDA that was second best among OPL ADCs. His skills on more traditional ADCs will be tested when he steps onto the international stage for the first time in Brazil.</p>","en_AU":"After spending a year in the much vaunted Legacy system, k1ng has returned home for a real chance to win it all. There are few players in Oceania with a mechanical ceiling as high as k1ng's, and he's in the perfect environment to show it off.","es_AR":"<p><strong>Calvin \"K1ng\" Truong</strong> es el tirador estrella de los Dire Wolves. Es uno de los mejores tiradores de la OPL y lo sabe... se unió a la liga en 2014 con el nombre <strong>\"BEST AD\"</strong>. El chico de 19 años dejó a los Dire Wolves por un año para jugar con Legacy eSports, pero regresó al comienzo de la temporada 2017. Dominó la temporada regular con tiradores basados en letalidad como Varus y Jhin, consiguiendo un KDA de 6.43, el segundo mejor de entre los tiradores de la OPL. Sus habilidades con tiradores más tradicionales se pondrán a prueba en Brasil, cuando suba al escenario internacional por primera vez.</p>","de_DE":"Calvin „K1ng“ Truong ist der Star-AD-Carry der Dire Wolves. Er ist einer der besten AD-Carrys der OPL, und das weiß er auch – 2014 spielte er noch unter dem Namen „BEST AD“. Der 19-jährige verließ die Dire Wolves, um ein Jahr lang bei Legacy eSports zu spielen, kehrte zu Beginn der Saison 2017 aber wieder zu den Wolves zurück. Während der regulären Saison dominierte er mit Carrys wie Varus und Jhin und war mit einer TTU von 6,43 der zweitbeste AD-Carry der OPL. Auf der internationalen Bühne in Brasilien wird er beweisen müssen, dass er auch mit traditionellen AD-Carrys überzeugen kann.","es_ES":"Calvin ''K1ng'' Truong es el famoso ADC de Dire Wolves. Es uno de los mejores ADC de la OPL, y lo sabe. Se unió a la liga en 2014 con el nombre ''BEST AD'' (''El mejor AD''). Este jugador de 19 años dejó Dire Wolves durante un año para jugar con Legacy eSports, pero volvió a comienzos de la temporada 2017. Durante la temporada regular, ha dominado con carries de letalidad como Varus y Jhin, lo que le ha hecho conseguir un A/M/A de 6,43 puntos y le ha colocado como segundo mejor ADC de la OPL. Sus habilidades con los ADC más tradicionales serán puestas a prueba cuando se suba al escenario internacional por primera vez en Brasil.","fr_FR":"Calvin « K1ng » Truong est la star ADC des Dire Wolves. Il est l'un des meilleurs ADC de l'OPL et il se sait : il a intégré le championnat en 2014 sous le pseudo « BEST AD ». Ce joueur de 19 ans a quitté les Dire Wolves pendant un an pour jouer avec Legacy eSports, mais il est revenu au début de la saison 2017. Pendant la saison régulière, il a dominé avec des carrys basés sur la létalité comme Varus et Jhin, ce qui lui a permis d'établir un KDA de 6,43 faisant de lui le deuxième meilleur ADC de l'OPL. Ses compétences avec des ADC plus traditionnels vont maintenant être mises à l'épreuve alors qu'il monte pour la première fois sur la scène internationale au Brésil.","pl_PL":"Calvin „K1ng” Truong to gwiazdorski prowadzący Dire Wolves. Jest jednym z najlepszych prowadzących w OPL i wie o tym — dołączył do ligi w 2014 roku pod pseudonimem „BEST AD”. Ten dziewiętnastolatek opuścił Dire Wolves na rok, by grać z Legacy eSports, ale wrócił z początkiem sezonu 2017. Dominował podczas sezonu zasadniczego, grając opierającymi się na destrukcji prowadzącymi, takimi jak Varus i Jhin, i zdobywając Z/Z/A 6,43 — drugi wynik wśród prowadzących OPL. Jego umiejętności gry bardziej tradycyjnymi prowadzącymi zostaną poddane próbie, gdy po raz pierwszy wkroczy na międzynarodową arenę w Brazylii.","pt_BR":"<p>Calvin \"K1ng” Truong é o principal atirador dos Dire Wolves. Ele é um dos melhores Atiradores na OPL e sabe disso; ele entrou para a liga em 2014 com o nome \"BEST AD”. O jogador de 19 anos deixou a Dire Wolves por um ano para jogar pela Legacy eSports, mas voltou para o início da temporada 2017. Ele dominou com carregadores baseados em Letalidade, como Varus e Jhin, durante a temporada regular, ficando com 6,43 de AMA, segundo melhor entre os Atiradores da OPL. Suas habilidades com Atiradores mais tradicionais serão testadas quando ele passar ao estágio internacional pela primeira vez.</p>"},"foreignIds":{"TRNA1":"1000435426","TRSA1":"465235","ESPORTSTMNT03":"200000426","TRLT3":"200000090"},"socialNetworks":{"twitter":"https://twitter.com/k1ngyb"},"champions":[],"liveGameTeam":129},{"id":867,"slug":"perfection","name":"Phantiks","firstName":"Richard","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perfection-b62yqjy0.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:36:13.000Z","updatedAt":"2017-07-14T04:19:15.000Z","bios":{"en_US":"<p>Richard “Phantiks” Su forms the second half of the Dire Wolves aggressive jungle-mid duo. Phantiks has held down the mid lane for the Dire Wolves since 2015. He’ll pick an assassin whenever the situation allows it; his favorite champions include Kassadin, Fizz and Zed. But he’s equally capable on more traditional mages, which allowed him to lead OPL mid laners with a KDA of 4.94 during the regular season. In his first international appearance at the 2017 Mid-Season Invitational, he’ll have to be careful that his aggression isn’t punished by some of the best mid laners in the world.</p>","en_AU":"Along with Swiffer, Phantiks is perhaps Oceania's most complete mid laner -- but he hasn't been able to translate his raw skill into major success just yet. The rest of the field is catching up with him, but that just might be what he needs to reach the next level.","es_AR":"<p><strong>Richard \"Phantiks\" Su</strong> conforma la segunda mitad del agresivo dúo junglero/central de los Dire Wolves. <strong>Phantiks</strong> defiende el carril central para los Dire Wolves desde el 2015. Escoge un asesino cuando la situación lo permite; sus campeones favoritos incluyen a Kassadin, Fizz y Zed. Pero es igual de eficaz con magos más tradicionales, lo que le ha permitido ser el mejor carrilero medio de la OPL con un KDA de 4.94 durante la temporada regular. En su primera aparición en el Mid-Season Invitational 2017, tendrá que tener cuidado de que su agresividad no sea castigada por algunos de los mejores carrileros centrales del mundo.</p>","pl_PL":"Richard „Phantiks” Su tworzy drugą połowę agresywnego duetu dżungla-środek w Dire Wolves. Broni środkowej alei dla Dire Wolves od 2015 roku. Gdy tylko pozwala mu na to sytuacja, wybiera zabójcę; do jego ulubionych bohaterów należą Kassadin, Fizz i Zed. Równie dobrze jednak radzi sobie, grając bardziej tradycyjnymi magami, co pozwoliło mu znaleźć się na szczycie środkowych OPL z Z/Z/A 4,94 w sezonie zasadniczym. Podczas swojego pierwszego międzynarodowego występu na Mid-Season Invitational 2017 będzie musiał uważać, aby jego agresja nie została ukrócona przez któregoś z najlepszych środkowych na świecie.","fr_FR":"Richard « Phantiks » Su constitue la deuxième moitié de l'agressif duo jungler-midlaner des Dire Wolves. Phantiks tient la voie du milieu pour l'équipe depuis 2015. Il choisit un assassin dès que la situation le permet et ses champions favoris incluent Kassadin, Fizz et Zed. Mais il est également très compétent avec des mages plus traditionnels, ce qui lui a permis de prendre la tête du classement midlaner de l'OPL avec un KDA de 4,94 pendant la saison régulière. Pour sa première apparition internationale au Mid-Season Invitational 2017, il devra éviter que son agressivité ne soit punie par les meilleurs midlaners du monde.","es_ES":"Richard ''Phantiks'' Su es la otra mitad del agresivo dúo jungla-mid de Dire Wolves. Phantiks ocupa el rol de la calle central en Dire Wolves desde 2015. Siempre que la situación lo permite, opta por jugar con asesinos, y sus campeones favoritos son Kassadin, Fizz y Zed. Sin embargo, es igual de bueno con magos tradicionales, lo que le ha permitido destacar entre los mid de la OPL con un A/M/A de 4,94 puntos durante la temporada regular. En su primera aparición internacional en el Mid-Season Invitational 2017, tendrá que tener cuidado para que su agresividad no sea castigada por algunos de los mejores mids de todo el mundo.v","de_DE":"Richard „Phantiks“ Su ist die zweite Hälfte des erfolgreichen Dschungel-Mitte-Duos der Dire Wolves. Phantiks kümmert sich schon seit 2015 um die mittlere Lane der Dire Wolves. Wenn möglich spielt er am liebsten Assassinen, weshalb Kassadin, Fizz und Zed auch zu seinen Lieblingschampions gehören. Er kann aber genauso gut mit traditionellen Magiern umgehen, was er mit einer TTU von 4,94 während der regulären Saison der OPL unter Beweis stellte. Bei seinem ersten internationalen Auftritt beim Mid-Season Invitational 2017 muss er aufpassen, dass seine Aggressivität nicht von den besten Mid-Lanern der Welt bestraft wird.","pt_BR":"<p>Richard \"Phantiks” Su forma a segunda metade da selvagem dupla pelo meio dos Dire Wolves. Phantiks defende o meio dos the Dire Wolves desde 2015. Ele escolhe um assassino sempre que a situação permite; seus Campeões favoritos incluem Kassadin, Fizz e Zed. Mas ele é igualmente capaz com magos mais tradicionais, o que lhe permitiu ficar em primeiro entre jogadores de meio da OPL, com 4,94 de AMA durante a temporada regular. Em sua primeira participação internacional no Mid-Season Invitational 2017, ele terá de cuidar para que sua agressividade não seja punida por alguns dos melhores jogadores de meio do mundo.</p>"},"foreignIds":{"TRNA":"1000435432","TRNA1":"1000435432","TRSA1":"465241","ESPORTSTMNT03":"200000425","TRLT3":"200000043"},"socialNetworks":{"twitter":"https://twitter.com/Phantiks"},"champions":[],"liveGameTeam":129},{"id":919,"slug":"meron","name":"Meron","firstName":"Kiichi","lastName":"Watanabe","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meron-1rht15kr.png","hometown":null,"region":"LJL","birthdate":"1992-11-02","createdAt":"2015-11-26T20:42:52.000Z","updatedAt":"2017-04-27T19:38:34.000Z","bios":{"en_US":""},"foreignIds":{"TRLT3":"200000008"},"socialNetworks":{},"champions":[],"liveGameTeam":242},{"id":922,"slug":"evi","name":"Evi","firstName":"Shunsuke ","lastName":"Murase","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/evi-c9e7sjt2.png","hometown":"Japão","region":"LJL","birthdate":"1995-11-15","createdAt":"2015-11-26T20:50:41.000Z","updatedAt":"2017-04-27T23:52:44.000Z","bios":{"en_US":"<p>Shunsuke “Evi” Murase originally got his start in mid-2013 and quickly ascended the ranks of mere mortals in solo queue while on his way to his first professional team in 2014. Eventually he made his way to Rampage in late 2016, where he hit the ground running and the team picked up their second consecutive first place finish in the LJL. He’s as versatile as top laners come, playing everything from Lulu to Maokai, but is most at home with tanks and bruisers. He’s notorious for being one of the few players in the world that has unbenched Tahm Kench in the top lane (yes, it’s as annoying you’re imagining). When it comes to Evi, no top lane pick is safe, and if opponents aren’t careful they may just end up in an oversized catfish’s stew.</p>","es_AR":"<p><strong>Shunsuke \"Evi\" Murase</strong> comenzó a mitad del 2013 y ascendió rápidamente en los rangos de los simples mortales en partidas individuales hasta que llegó a su primer equipo profesional en 2014. Con el tiempo llegó a Rampage a finales del 2016, cuando seguía esforzándose y el equipo consiguió su segundo primer lugar consecutivo en la LJL. Es de los carrileros superiores más versátiles, puede jugar con Lulu o Maokai, pero se siente más a gusto con los tanques y los luchadores. Es conocido por ser uno de los pocos jugadores en el mundo que sacó de la banca a Tahm Kench en el carril superior (sí, es tan molesto como se lo imaginan). Cuando se trata de <strong>Evi</strong>, ningún carril superior está a salvo, y si los oponentes son descuidados podrían terminar en un guisado de bagre descomunal.</p>","de_DE":"Shunsuke „Evi“ Murase begann seine Karriere Mitte 2013 und erkämpfte sich schnell einen Spitzenplatz in der Solo-Warteschlange, bevor er 2014 das erste Mal bei einer professionellen Mannschaft unterschrieb. Ende 2016 wechselte er schließlich zu Rampage, wo er sich sofort einfand und der Mannschaft dabei half, zum zweiten Mal hintereinander die LJL zu gewinnen. Er ist so vielseitig, wie ein Top-Laner nur sein kann, und spielt von Lulu bis Maokai alles. Am wohlsten fühlt er sich aber mit Tanks und Rabauken. Er ist einer der wenigen Spieler, die Tahm Kench auf der oberen Lane spielen (ja, das ist genau so nervig, wie du denkst). Evi kann auf der oberen Lane alles spielen, und wenn seine Gegner nicht aufpassen, enden sie schnell auf dem Teller des Königs des Flusses.","fr_FR":"Shunsuke « Evi » Murase a fait ses débuts courant 2013 et a rapidement gravi les échelons en tant que joueur en file solo pour intégrer sa première équipe pro en 2014. Fin 2016, il rejoint Rampage, au sein de laquelle il trouve tout de suite ses marques. Il aide alors son équipe à décocher sa deuxième victoire d'affilée à la LJL. Evi est un top-laner polyvalent qui peut jouer de nombreux champions, de Lulu à Maokai, mais qui s'avère plus à son aise avec les tanks et les combattants. Il est célèbre pour avoir été un des rares joueurs du monde à jouer Tahm Kench sur la voie du haut (oui, c'est très pénible pour ses adversaires, comme vous vous en doutez). Face à Evi, aucun choix n'est sûr, et si l'adversaire n'est pas assez vigilant, il risque bien de finir en pâtée pour poisson-chat.","pl_PL":"Shunsuke „Evi” Murase zaczął grać w połowie 2013 roku i szybko awansował w szeregach zwykłych śmiertelników w kolejce solo, by w 2014 roku zdobyć miejsce w swojej pierwszej profesjonalnej drużynie. Ostatecznie pod koniec 2016 r. dostał się do Rampage, gdzie szybko nabrał rozpędu, a drużyna zdobyła po raz drugi z kolei pierwsze miejsce w LJL. Jest wszechstronny, jak na górnego przystało, i potrafi grać wszystkimi od Lulu po Maokaia, ale najpewniej czuje się z obrońcami i osiłkami. Słynie jako jeden z niewielu graczy na świecie, którzy nie grzali ławy Tahmem Kenchem na górnej alei (tak, to równie irytujące, jak sobie wyobrażacie). Jeśli chodzi o Eviego, żaden wybór na górze nie jest bezpieczny, a jeśli przeciwnicy nie będą ostrożni, mogą skończyć jako gulasz dla przerośniętego suma.","es_ES":"Shunsuke ''Evi'' Murase comenzó a jugar a mediados de 2013 y no tardaría en ascender en la clasificación de los mortales en la cola en solitario. Así es como se abrió paso hasta su primer equipo profesional en 2014. En 2016 pasó a formar parte de Rampage, donde no tardaría en ponerse manos a la obra para que el equipo consiguiese el primer puesto en la LJL por segunda vez consecutiva. Es un top versátil, capaz de jugar cualquier campeón, desde Lulu a Maokai, pero se siente más a gusto con tanques y matones. Es conocido por ser uno de los pocos jugadores del mundo que ha jugado con Tahm Kench en la calle superior (y sí, es tan molesto como os imagináis). Si es Evi quien se encuentra al otro lado de la pantalla, ninguna selección de la calle superior es segura. Si sus rivales no se andan con cuidado puede que acaben en el guiso de pescado del japonés.","pt_BR":"<p>Shunsuke \"Evi\" Murase iniciou sua carreira em meados de 2013 e rapidamente subiu na classificação dos reles mortais na fila solo enquanto tentava entrar na sua primeira equipe profissional, em 2014. No fim, ele conseguiu entrar na Rampage no final de 2016. Evi chegou com tudo, e a equipe ficou em primeiro lugar pela segunda vez seguida na LJL. Ele é tão versátil quanto um jogador de rota superior pode ser e joga com todos, de Lulu a Maokai. Porém, seu talento é definitivamente com tanques e lutadores. Ele é conhecido por ser um dos poucos jogadores no mundo que usaram o Tahm Kench (e sim, ele é tão irritante quanto você imagina) no topo como ele o faz. Quando se trata do Evi, ninguém na rota superior está a salvo, e, se os adversários não tiverem cuidado, é bem capaz de acabarem no sopão do bagre gigante.</p>"},"foreignIds":{"TRLT3":"200000003"},"socialNetworks":{},"champions":[],"liveGameTeam":242},{"id":1072,"slug":"rippii","name":"Rippii","firstName":"Nathan","lastName":"Mott","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rippii-7g0mtg5y.png","hometown":null,"region":"OCE","birthdate":"1995-12-29","createdAt":"2016-01-20T03:56:51.000Z","updatedAt":"2017-04-27T19:09:04.000Z","bios":{},"foreignIds":{"TRNA1":"1000435436","TRSA1":"465245","ESPORTSTMNT03":"200000502","TRLT3":"200000045"},"socialNetworks":{},"champions":[],"liveGameTeam":129},{"id":1076,"slug":"chippys","name":"Chippys","firstName":"Ryan","lastName":"Short","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chippys-2swnuqsf.png","hometown":"","region":"OCE","birthdate":"1996-12-20","createdAt":"2016-01-21T06:14:29.000Z","updatedAt":"2017-07-14T04:17:51.000Z","bios":{"en_US":"<p>Ryan “Chippys” Short made big leaps forward as a top laner this year. Known for playing carry top laners, including his signature Irelia, he went a combined 8-0 on Camille and Rumble in the OPL regular season. He can also play a tank when needed, and his versatility carried him to an impressive 5.40 KDA, good for second best among OPL top laners. Now his skills as a carry will be put to the test at the 2017 Mid-Season Invitational.</p>","es_AR":"<p>Este año, <strong>Ryan \"Chippys\" Short</strong> se perfiló como el mejor carrilero superior a pasos agigantados. Conocido por jugar con acarreadores de carril superior, incluyendo a su emblemática Irelia, logró sacar un 8-0 combinado entre Camille y Rumble en la temporada regular de la OPL. <strong>Chippys</strong> también puede ser un tanque si es necesario y su versatilidad lo llevó a un impresionante 5.40 de KDA, el segundo mejor entre los carrileros superiores de la OPL. Ahora, sus habilidades como acarreador se podrán a prueba en el Mid-Season Invitational 2017.</p>","pl_PL":"Ryan „Chippys” Short wykonał w tym roku wielki krok naprzód jako górny. Znany jest z gry prowadzącymi górnymi, włącznie z jego sztandarową Irelią. W sezonie zasadniczym osiągnął łączny wynik 8-0, grając Camille i Rumblem. W razie potrzeby potrafi także grać jako obrońca, a wszechstronność pozwoliła mu zdobyć imponujące 5,40 Z/Z/A, zapewniając drugie miejsce wśród najlepszych górnych OPL. Teraz jego umiejętności prowadzącego zostaną przetestowane podczas Mid-Season Invitational 2017.","fr_FR":"Ryan « Chippys » Short a fait d'énormes progrès en tant que toplaner cette année. Connu dans son rôle de carry dans la voie du haut, notamment avec Irelia, il a enregistré une série de victoires combinés de 8-0 avec Camille et Rumble dans la saison régulière de l'OPL. Il sait aussi jouer les tanks au besoin et sa polyvalence lui a permis d'inscrire un KDA impressionnant de 5,40, faisant de lui le deuxième meilleur toplaner de la région. Maintenant, c'est en tant que carry qu'il devra faire ses preuves lors du Mid-Season Invitational 2017.","es_ES":"Ryan ''Chippys'' Short ha hecho grandes avances como jugador de la calle superior este año. Famoso por jugar con carries en top, incluyendo a su predilecta, Irelia, consiguió quedar 8 a 0 con Camille y Rumble en la temporada regular de la OPL. También es capaz de jugar con tanques cuando es necesario, y gracias a su versatilidad ha conseguido un impresionante A/M/A de 5,40 puntos, lo que lo ha colocado como el segundo de los jugadores de la calle superior de la OPL. Ahora tendrá que demostrar sus habilidades como carry en el Mid-Season Invitational 2017","de_DE":"Ryan „Chippys“ Short hat sich in diesem Jahr auf der oberen Lane stark verbessert. Er ist dafür bekannt, auf der oberen Lane gerne Carrys wie seinen Lieblingschampion Irelia zu spielen, und hat in der regulären Saison mit Camille und Rumble insgesamt achtmal gewonnen und nie verloren. Wenn es notwendig ist, hat er auch kein Problem damit, Tanks zu spielen. Diese Vielseitigkeit hat ihm zu einer TTU von 5,40 verholfen, dem zweitbesten Wert aller Top-Laner der OPL. Jetzt muss er beim Mid-Season Invitational 2017 beweisen, wie gut seine Carry-Künste wirklich sind.","pt_BR":"<p>Ryan \"Chippys” Short deu um grande salto de qualidade na rota superior este ano. Conhecido por usar carregadores na rota superior, incluindo sua clássica Irelia, ele fez um agregado de 8-0 em Camille e Rumble na temporada regular da OPL. Ele também pode jogar de tanque quando necessário, e sua versatilidade o levou a impressionantes 5,40 de AMA, ficando em segundo lugar entre jogadores na rota superior da OPL. Agora suas habilidades como carregador serão testadas no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRNA1":"1000435445","TRSA1":"465254","ESPORTSTMNT03":"200000299","TRLT3":"200000041"},"socialNetworks":{"twitter":"https://twitter.com/ChippysOCE"},"champions":[],"liveGameTeam":129},{"id":1100,"slug":"shernfire","name":"Shernfire","firstName":"Shern","lastName":"Tai","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shernfire-1ogbrwxw.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2016-01-21T22:09:01.000Z","updatedAt":"2017-05-31T02:44:03.000Z","bios":{"en_US":"<p>Shern “Shernfire” Tai is the playmaking jungler for the Dire Wolves. The 18-year-old already has over two years of professional experience, first joining the Dire Wolves as a substitute in 2014. After spending two years in the NA Challenger series to little success, Shernfire returned to his first team for the start of 2017. He’s one of the most gold-hungry junglers in the OPL. When the gold is rolling in, his Rengar and Kha’Zix look unstoppable. He’ll have to fight tooth and nail for every jungle camp at the 2017 Mid-Season Invitational, though, where he will face off against some of the world’s best junglers.</p>","es_AR":"<p><strong>Shern \"Shernfire\" Tai</strong> es el junglero que arma jugadas para los Dire Wolves. El chico de 18 años, que se unió a los Dire Wolves como sustituto en 2014, ya tiene más de dos años de experiencia en el juego profesional. Después de pasar dos años en la serie Retador NA con pocos resultados, <strong>Shernfire</strong> regresó a su primer equipo para el comienzo de la temporada 2017. Es uno de los jungleros con más sed de oro en la OPL. Cuando el oro comienza a circular, su Rengar y su Kha'Zix parecen ser imparables. Sin embargo, <strong>Shernfire</strong> tendrá que luchar con garras y dientes por cada campamento de jungla en el Mid-Season Invitational 2017, en donde se enfrentará a algunos de los mejores jungleros del mundo.</p>","de_DE":"Shern „Shernfire“ Tai ist der Spielmacher und Jungler der Dire Wolves. Der 18-jährige, der 2014 als Ersatzspieler zu den Dire Wolves kam, kann bereits auf eine zweijährige Profi-Karriere zurückblicken. Nachdem er zwei erfolglose Jahre in der nordamerikanischen Challenger Series verbracht hatte, kehrte er Anfang 2017 wieder zu seiner alten Mannschaft zurück. Er ist einer der goldgierigsten Jungler in der OPL. Und wenn er genug Gold bekommt, ist er mit Rengar und Kha’Zix nicht zu stoppen. Beim Mid-Season Invitational 2017 wird er sich jedoch mit Händen und Füßen gegen die besten Jungler der Welt zur Wehr setzen müssen.","es_ES":"Shern ''Shernfire'' Tai es el jungla estratega de Dire Wolves. Con solo 18 años, y tras unirse a Dire Wolves en 2014 como suplente, ya cuenta con dos años de experiencia profesional. Tras pasar dos años en la Challenger Series de NA sin mucho éxito, Shernfire volvió a su primer equipo a comienzos de 2017. Es uno de los junglas más hambrientos de oro de la OPL. Cuando abunda el oro, su Rengar y su Kha'Zix son imparables. No obstante, tendrá que luchar con uñas y dientes para hacerse con todos los campamentos de la jungla en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores junglas del mundo.","fr_FR":"Shern « Shernfire » Tai est un jungler qui crée du jeu pour les Dire Wolves. Ce joueur de 18 ans a déjà deux ans d'expérience professionnelle à son actif, ayant rejoint les Dire Wolves pour la première fois en tant que remplaçant en 2014. Après avoir passé deux années dans les Challenger Series NA sans succès ou presque, Shernfire est de retour dans sa première équipe pour le début de l'année 2017. Il est l'un des junglers les plus assoiffés d'or de l'OPL. Et lorsque les PO coulent à flot, ses Rengar et Kha'Zix semblent imbattables. Dans la jungle, il devra lutter pour chaque camp bec et ongles lors du Mid-Season Invitational 2017 face à certains des meilleurs junglers du monde.","pl_PL":"Shern „Shernfire” Tai to rozgrywający dżungler Dire Wolves. Osiemnastolatek ma już za sobą ponad dwa lata profesjonalnego doświadczenia. Po raz pierwszy dołączył do Dire Wolves jako rezerwowy w 2014 roku. Po spędzeniu z niewielkim powodzeniem dwóch lat w NA Challenger Series Shernfire na początku 2017 roku wrócił do swojej pierwszej drużyny. Jest jednym z najbardziej żądnych złota dżunglerów w OPL. Gdy złoto napływa, jego Rengar i Kha’Zix stają się niepowstrzymani. Jednak na Mid-Season Invitational 2017 będzie musiał walczyć na śmierć i życie o każdy obóz w dżungli, stając przeciwko najlepszym dżunglerom na świecie.","pt_BR":"<p>Shern \"Shernfire” Tai é o criador de jogadas dos Dire Wolves. O jovem de 18 anos já tem dois anos de experiência profissional, tendo entrado para os Dire Wolves como substituto em 2014. Após passar dois anos no circuito Desafiante da NA sem muito sucesso, Shernfire voltou à sua primeira equipe para o início de 2017. Ele é um dos melhores caçadores na OPL. Quando o ouro entra, seu Rengar e Kha’Zix parecem invencíveis. Mas ele terá de lutar com unhas e dentes por cada acampamento na selva do Mid-Season Invitational 2017, quando enfrentará alguns dos melhores caçadores do mundo.</p>"},"foreignIds":{"FRA1TMNT1":"375269","ESPORTSTMNT03":"200001275","TRLT3":"200000042"},"socialNetworks":{"twitter":"https://twitter.com/shernfire"},"champions":[],"liveGameTeam":129},{"id":1415,"slug":"tussle","name":"Tussle","firstName":"Moonyong","lastName":"Lee","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tussle-hck6jcf0.png","hometown":null,"region":"International Wildcard","birthdate":"1995-03-29","createdAt":"2016-08-22T14:35:08.000Z","updatedAt":"2017-04-27T19:33:10.000Z","bios":{"en_US":"<p>Lee “Tussle” Moon-yong began his professional career with Rampage in 2015 and hasn’t looked back since. Previously known as “Doad,” he prefers high mobility, assassin-oriented junglers to their utilitarian counterparts. This doesn’t mean he can’t play the initiator; he’s infamous in Japan for his potent Rek’Sai play (he sports a ludicrous 75% winrate on it). While his champion pool isn’t deep by any means, he finds consistent success on his favorites like Lee Sin, Nidalee --  and oh, did we mention he’s never lost a game professionally while playing Graves? Kinda important. As an anchor for Rampage, he’ll do his best to punch, shoot, and spear throw his way to the MSI main event in Rio.</p>","es_AR":"<p><strong>Lee \"Tussle\" Moon-yong</strong> comenzó su carrera profesional con Rampage en 2015 y no ha vuelto a mirar atrás. Antes lo conocían como <strong>\"Doad\"</strong>. Prefiere la movilidad y a los jungleros tipo asesinos en vez de los de utilidad. Esto no significa que no pueda jugar como iniciador. Es infame en Japón por su potente juego con Rek'Sai (tiene una tasa de victorias del 75%). Aunque su poza de campeones no es amplia, tiene un éxito consistente con sus favoritos, como Lee Sin, Nidalee, y oh, ¿mencionamos que nunca ha perdido una partida profesional cuando juega con Graves? Un pequeño detalle importante. Como el ancla de Rampage, hará lo mejor posible por golpear, disparar, y usar sus lanzas para llegar al evento principal de MSI en Río de Janeiro.</p>","de_DE":"Lee “Tussle” Moon-yong begann seine professionelle Karriere 2015 bei Rampage, wo er auch heute noch spielt. Tussle, früher bekannt als „Doad“, bevorzugt bewegliche, assassinenartige Jungler. Das bedeutet aber nicht, dass er nicht als Initiator fungieren kann. In Japan ist er für seine Spiele mit Rek’Sai berüchtigt (mit ihr hat er eine verrückte Siegesrate von 75 %). Obwohl er keinen großen Championpool hat, ist er mit Champions wie Lee Sin und Nidalee sehr erfolgreich – und haben wir erwähnt, dass er mit Graves in seiner professionellen Karriere noch nie ein Spiel verloren hat? Keine ganz unwichtige Tatsache. Als einer der Leistungsträger bei Rampage wird er sein Bestes geben, um sich in Brasilien einen Weg in das Haupt-Event zu bahnen.","fr_FR":"Lee « Tussle » Moon-yong a débuté sa carrière professionnelle avec Rampage en 2015 et n'a jamais quitté cette équipe. Anciennement connu sous le pseudo « Doad », il préfère les junglers très mobiles et orientés assassin à leurs homologues plus utilitaires. Cela ne veut pas dire qu'il ne peut pas jouer en initiateur : Tussle est en effet célèbre au Japon pour son efficacité avec Rek'Sai (il affiche un taux de victoire hallucinant de 75 % avec ce personnage). Si son pool de champions est assez limité, il s'avère très constant avec ses champions réguliers, notamment Lee Sin et Nidalee. Un petit détail : il n'a jamais perdu de partie pro en jouant Graves. Plutôt impressionnant. En tant que joueur clé de Rampage, il fera tout son possible pour triompher à coups de poing, d'arme à feu et de lances au MSI au Brésil.","es_ES":"Lee ''Tussle'' Moon-yong comenzó su trayectoria profesional con Rampage en 2015, y no ha vuelto a mirar atrás desde entonces. Anteriormente conocido como ''Doad'', Tussle prefiere los campeones de la jungla con mucha movilidad y de estilo asesino, en lugar de los de utilidad. Eso no quiere decir que no pueda jugar con iniciadores (es famoso en Japón por sus potentes jugadas con Rek’Sai, con el que tiene un absurdo porcentaje de victorias del 75 %). Aunque no se caracteriza por tener un repertorio de campeones muy variado, suele tener éxito con sus campeones favoritos: Lee Sin, Nidalee y... Un momento, ¿he mencionado que nunca ha perdido una partida profesional con Graves? Creo que es un detalle a tener en cuenta. Como pieza clave de Rampage, hará lo que esté en su mano para golpear, disparar o tirar lanzas a quien haga falta para conseguir llegar al evento principal del MSI de Brasil.","pl_PL":"Lee „Tussle” Moon-yong zaczął profesjonalną karierę z Rampage w 2015 r. i od tego czasu nie ogląda się za siebie. Dawniej znany był jako „Doad”. Preferuje wysoce mobilnych, zabójczych dżunglerów w przeciwieństwie do ich użytkowych odpowiedników. Co nie oznacza, że nie potrafi grać inicjatorem; w Japonii zdobył rozgłos swoją świetną grą Rek’Sai (osiągając z nią niebagatelny wskaźnik zwycięstw 75%). Chociaż jego pula bohaterów nie jest zbyt rozległa, konsekwentnie osiąga sukces ze swoimi ulubieńcami, takimi jak Lee Sin, Nidalee — ach, czy wspomnieliśmy, że nigdy nie przegrał profesjonalnej gry Gravesem? To dość znaczące. Jako oś uwagi w Rampage zrobi co w jego mocy, by wytłuc, wystrzelać i wyciąć sobie włócznią drogę do głównego wydarzenia w Rio.","es_MX":"","en_PL":"","pt_BR":"<p>Lee \"Tussle\" Moon-yong começou sua carreira profissional com a Rampage em 2015 e não olhou mais para trás. Anteriormente conhecido como \"Doad\", ele prefere caçadores de alta mobilidade e com tendências assassinas às suas contrapartes utilitárias. Isso não significa que ele não possa jogar com um iniciador de lutas. Ele é famoso no Japão por sua potente Rek’Sai (e sua absurda taxa de vitórias de 75% com esse Campeão). Embora sua seleção de Campeões não seja muito grande, ele tem sucesso constante com seus favoritos, como Lee Sin e Nidalee. Ah, e já dissemos que ele nunca perdeu um jogo profissionalmente jogando com Graves? É bom saber. Como âncora da Rampage, ele vai atacar com tudo no principal evento do MSI no Rio.</p>"},"foreignIds":{"TRLT3":"200000004"},"socialNetworks":{},"champions":[],"liveGameTeam":242},{"id":1418,"slug":"dara","name":"Dara","firstName":"Jeon","lastName":"Jeong-hoon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dara-crt7y8vg.png","hometown":null,"region":"International Wildcard","birthdate":"1995-05-25","createdAt":"2016-08-22T14:46:34.000Z","updatedAt":"2017-04-27T19:38:01.000Z","bios":{"en_US":"<p>Jeon “Dara” Jeong-hoon started his professional career in mid-2015 and by the end of the year he found himself on Rampage’s roster. As one of the team’s two South Korean imports, Dara’s skill propelled him to stardom in Japan. He has been voted in by the fans to represent the LJL two years in a row for the IWC All-Star event. His affinity for tanky, bruiser style supports means that he has no problem getting up close and personal with his opponents while simultaneously stunlocking them to their demise. With that being said, he’s got an infinite KDA on Lulu (proof that Yordles are timeless and perhaps immortal). Look for him to stun, slow, and polymorph his enemies as his team looks to rampage through the play-ins on their way to the MSI main event.</p>","es_AR":"<p><strong>Jeon \"Dara\" Jeong-hoon</strong> comenzó su carrera profesional a la mitad del 2015, y al final de ese año, se unió a la alineación de Rampage. Como uno de los dos miembros de Corea del Sur del equipo, la habilidad de <strong>Dara</strong> lo llevó al estrellato en Japón. Los seguidores votaron por él para representar la LJL dos años seguidos para el evento IWC All-Star. Su afinidad por los soportes tanques y luchadores significa que no tiene problema para acercarse a sus oponentes mientras simultáneamente los envía a su perdición. Habiendo dicho eso, tiene un KDA infinito con Lulu (prueba de que los yordles son atemporales y tal vez inmortales). No se pierdan sus aturdimientos, ralentizaciones y polimorfias en sus enemigos mientras su equipo busca masacrar a sus oponentes en la fase de Play-in para llegar al evento principal del MSI.</p>","de_DE":"Jeon „Dara“ Jeong-hoon begann seine professionelle Karriere Mitte 2015 und wechselte Ende desselben Jahres zu Rampage. Dara ist einer der beiden Südkoreaner in der Mannschaft und sein Können hat ihn in Japan zu einem Star gemacht. Er wurde von den Fans zweimal hintereinander zum Repräsentanten der LJL beim IWC-All-Stars-Event gewählt. Seine Vorliebe für robuste Supporter beweist, dass er kein Problem damit hat, seinen Gegnern nahezukommen, während er sie gleichzeitig bis zu ihrem Untergang betäubt. Angesichts dessen hat er auch eine unendliche TTU mit Lulu (was der Beweis dafür ist, dass Yordles niemals aus der Mode kommen und wahrscheinlich unsterblich sind). Er wird seine Gegnern betäuben, verlangsamen und verwandeln, um seiner Mannschaft dabei zu helfen, die Vorrunde zu überstehen und das Haupt-Event des MSI zu erreichen.","fr_FR":"Jeon « Dara » Jeong-hoon a commencé sa carrière professionnelle courant 2015 et dès la fin de l'année, il a intégré la formation de Rampage. Véritable star au Japon, le talentueux Dara est l'une des deux recrues sud-coréennes de l'équipe. Les fans l'ont élu pour représenter la LJL deux années de suite à l'événement IWC All-Stars. Son affection pour les supports orientés tank/combattant indique qu'il n'a aucun problème pour engager l'adversaire au corps à corps et l'étourdir avant de le mener à sa perte. Ceci étant dit, il présente un KDA énorme avec Lulu (preuve que les yordles sont intemporels, peut-être même immortels). Attendez-vous à le voir étourdir, ralentir et transformer ses ennemis pour aider son équipe à sortir des qualifications au MSI.","es_ES":"Jeon ''Dara'' Jeong-hoon comenzó su carrera profesional a mitad de 2015 y a finales de ese año pasó a formar parte de la plantilla de Rampage. Dara es uno de los dos jugadores surcoreanos del equipo y sus habilidades no han tardado en convertirlo en una estrella en Japón. Los fans lo han votado dos años consecutivos para representar a la LJL en el evento del IWC All-Star. Su afinidad con los apoyos tanques y matones son prueba de que no le importa luchar cuerpo a cuerpo contra sus rivales al mismo tiempo que los aturde hasta que mueren. Además, tiene un A/M/A infinito con Lulu (lo cual demuestra que los yordles son atemporales y puede que inmortales). Estad atentos a sus aturdimientos, ralentizaciones y polimorfismos cuando su equipo intente abrirse paso en la fase de apertura hasta el evento principal del MSI.","pl_PL":"Jeon „Dara” Jeong-hoon rozpoczął profesjonalną karierę w połowie 2015 r. i pod koniec roku znalazł się w składzie Rampage. Jako jeden z dwóch nabytków z Korei Południowej Dara wykorzystał swoje umiejętności, by osiągnąć status gwiazdora w Japonii. Fani przez dwa lata z rzędu wybierali go swoimi głosami, by reprezentował LJL na turnieju All-Star IWC. Jego skłonność do gry wytrzymałymi, krzepkimi wspierającymi oznacza, że nie boi się zewrzeć w walce z przeciwnikami, jednocześnie ogłuszając ich i doprowadzając do zguby. Tak czy inaczej ma nieskończone Z/Z/A z Lulu (co udowadnia, że Yordle są ponadczasowe i być może nieśmiertelne). Możemy się spodziewać, że będzie ogłuszał, spowalniał i polimorfował przeciwników, gdy jego drużyna szturmem przebije się przez fazę grupową w drodze na główne wydarzenie MSI.","pt_BR":"<p>Jeon \"Dara\" Jeong-hoon começou sua carreira profissional em meados de 2015 e até o fim do ano já tinha sido escalado para a equipe Rampage. As habilidades de Dara, um dos dois coreanos do time, o impulsionaram ao estrelato no Japão. Os fãs votaram dois anos seguidos para que Dara representasse a LJL no IWC All-Star. Sua preferência por suportes tanques e lutadores significa que ele não hesita em fazer contato físico com seus adversários enquanto os atordoa até serem derrotados. Dito isso, ele tem um AMA infinito com a Lulu (prova de que yordles são eternos e talvez até imortais). Vamos contar com ele para atordoar, desacelerar e transformar seus inimigos enquanto a equipe agita a Fase de Entrada em busca de uma vaga na Fase de Grupos do MSI.</p>"},"foreignIds":{"TRLT3":"200000007"},"socialNetworks":{},"champions":[],"liveGameTeam":242},{"id":1861,"slug":"yutorimoyashi","name":"YutoriMoyasi","firstName":"Yuta","lastName":"Noguchi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yutorimoyashi-8ogdrvjt.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:39:10.000Z","updatedAt":"2017-04-28T16:36:30.000Z","bios":{"en_US":"<p>Yuta “YutoriMoyasi” Noguchi started playing professional League of Legends in 2013. Originally a top laner, he made the switch to AD Carry in 2016 and never looked back. He’s equally at home on mobile threats like Ezreal or on more stationary damage dealers like Jhin. He has a knack for being a difficult foe to lock down and kill; in the Spring Split alone, YutoriMoyasi had nine games where he wasn’t killed a single time -- nine games! He’ll look to keep the momentum rolling and his death count low as Rampage fight through play-ins to punch their ticket to the MSI main event.</p>","es_AR":"<p><strong>Yuta \"YutoriMoyashi\" Noguchi</strong> comenzó a jugar profesionalmente en League of Legends en 2013. Fue originalmente un carrilero superior, pero hizo el cambio a tirador en 2016 y no ha vuelto a mirar atrás. Se siente cómodo por igual con amenazas móviles como Ezreal que con atacantes estáticos como Jhin. Es un oponente difícil de asesinar. En el Torneo de Apertura, <strong>YutoriMoyashi</strong> jugó nueve partidas en las que no lo asesinaron ni una sola vez. ¡Nueve partidas! Aprovechará el ímpetu y su bajo conteo de muertes mientras Rampage se abre paso por los Play-in hasta el evento principal del MSI.</p>","de_DE":"Yuta „YutoriMoyashi“ Noguchi begann seine professionelle „League of Legends“-Karriere 2013. Der gelernte Top-Laner wechselte 2016 auf die Position des AD-Carrys und blickte nie mehr zurück. Er fühlt sich mit beweglichen Bedrohungen wie Ezreal genauso wohl wie mit stationären Schadensverursachern alla Jhin. Es ist schwierig, YutoriMoyashi einzukesseln und zu töten, was er auch im Frühjahrs-Split unter Beweis stellte, als er neun Spiele lang kein einziges Mal getötet wurde – neun Spiele lang! Er wird versuchen, auf diesem Momentum aufzubauen und so selten wie möglich zu sterben, um mit Rampage das Ticket für das Haupt-Event des MSI zu lösen.","fr_FR":"Yuta « YutoriMoyashi » Noguchi a commencé à jouer à League of Legends en professionnel en 2013. Top-laner à l'origine, il est passé ADC en 2016, un poste qu'il occupe toujours. Ce joueur est aussi à l'aise avec des menaces très mobiles comme Ezreal qu'avec des champions puissants mais plus statiques comme Jhin. YutoriMoyashi est un adversaire difficile à isoler et à éliminer. Lors du segment de printemps, il a joué neuf parties sans se faire tuer une seule fois... Neuf parties ! Il compte bien mettre tout son talent à profit pour maintenir son taux de décès aussi bas que possible et permettre à Rampage de sortir triomphalement des qualifications au MSI.","pl_PL":"Yuta „YutoriMoyashi” Noguchi zaczął grać w profesjonalnym League of Legends w 2013 roku. Początkowo jako górny, ale w 2016 roku przeszedł do roli prowadzącego i już się z nią nie rozstał. Czuje się równie pewnie, walcząc ruchliwymi wojownikami, takimi jak Ezreal, jak i bardziej stacjonarnymi siewcami obrażeń, jak Jhin. Znany jest z tego, że trudno go namierzyć i zabić; w ciągu samego wiosennego splitu YutoriMoyashi rozegrał dziewięć gier, w których nie został zabity ani razu — dziewięć gier! Zapewne postara się utrzymać impet i niską liczbę zgonów, gdy Rampage będą walczyli w fazie grupowej o bilet na główne wydarzenie MSI.","es_ES":"Yuta ''YutoriMoyashi'' Noguchi comenzó a jugar como profesional de League of Legends en 2013. Originalmente jugaba como top, pero se pasó a AD carry en 2016 y nunca más volvió a mirar atrás. Se siente igual de cómodo con amenazas ágiles, como Ezreal, como con campeones de daño más estáticos como Jhin. Tiene fama de ser un enemigo difícil de inmovilizar y asesinar. Tan solo en el split de primavera, YutoriMoyashi consiguió completar nueve partidas sin morir ni una sola vez... ¡Nueve! Intentará continuar con su buena racha y sus escasas muertes cuando Rampage luche en la fase de apertura por un puesto en el evento principal del MSI.","pt_BR":"<p>Yuta \"YutoriMoyashi\" Noguchi começou a jogar League of Legends profissionalmente em 2013. Originalmente posicionado na rota superior, ele passou a ser atirador em 2016 e nunca mais voltou atrás. Ele também lida confortavelmente com ameaças móveis, como Ezreal, ou com causadores de danos menos móveis, como Jhin. Além disso, ele tende a ser um inimigo difícil de imobilizar e matar. Só na Etapa de Primavera, YutoriMoyashi jogou nove partidas sem morrer nem mesmo uma vez: nove partidas! O competidor quer manter o ritmo do jogo fluido e continuar com uma contagem de mortes baixa enquanto a Rampage luta pelo seu lugar no grande evento do MSI.</p>"},"foreignIds":{"TRLT3":"200000006"},"socialNetworks":{},"champions":[],"liveGameTeam":242},{"id":1862,"slug":"ramune","name":"Ramune","firstName":"Osamu","lastName":"Ozawa","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ramune-fckbbo5x.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-14T01:40:13.000Z","updatedAt":"2017-04-27T19:37:12.000Z","bios":{"en_US":"<p>Osamu “Ramune” Ozawa is one of Rampage’s newest additions. As a control mage specialist, he excels on meta champions like Syndra and Orianna while also having no problem pulling out the occasional Cassiopeia or Taliyah. Ramune had no problem meshing with his teammates and adding a stable element in the mid lane. He can certainly rack up kills, but he can also get a pile of assists if that’s what his team needs. His teammates will look to him to be their steady hand as the competition heats up for one of the final spots at MSI.</p>","es_AR":"<p><strong>Osamu \"Ramune\" Ozawa</strong> es uno de los miembros más nuevos de Rampage. Con la especialidad en magos de control, se destaca en el metajuego de campeones como Syndra y Orianna mientras no tiene ningún problema al usar a Cassiopeia o a Taliyah ocasionalmente. <strong>Ramune</strong> no tiene problema en acoplarse a sus compañeros de equipo y añade un elemento estable en el carril central. Sin duda puede acumular asesinatos, pero también puede asistir si es lo que el equipo necesita. Sus compañeros de equipo cuentan con él cuando la competencia se intensifica para conseguir uno de los lugares finales en el MSI.</p>","de_DE":"Osamu „Ramune“ Ozawa ist einer von Rampages Neuzugängen. Er ist ein Spezialist für Kontrollmagier und zeigt überragende Leistungen mit Champions wie Syndra und Orianna, kann aber auch mit Cassiopeia oder Taliyah überzeugen. Ramune hatte kein Problem, sich in die Mannschaft zu integrieren, und sorgt auf der mittleren Lane für die nötige Stabilität. Er ist immer für Tötungen gut, hat aber auch kein Problem damit, seiner Mannschaft mit Unterstützungen zu helfen. Seine Mannschaftskameraden verlassen sich auf seine Stabilität, um sich einen der letzten Plätze beim MSI zu sichern.","fr_FR":"Osamu « Ramune » Ozawa est un nouveau venu chez Rampage. Ce spécialiste des mages de contrôle excelle avec des champions de la méta tels que Syndra et Orianna, mais il est également à l'aise avec Cassiopeia ou Taliyah. Ramune n'a aucun problème pour s'entendre avec ses coéquipiers, ce qui fait de lui un élément de stabilité sur la voie du milieu. S'il est redoutable en termes d'éliminations, il est aussi tout à fait capable d'assister son équipe en cas de besoin. Ses coéquipiers compteront sur sa fiabilité et sa rigueur dans le feu de l'action pour obtenir une place en finale du MSI.","pl_PL":"Osamu „Ramune” Ozawa jest jednym z najnowszych uzupełnień Rampage. Jako specjalista od magów kontrolujących najlepiej gra bohaterami mety, takimi jak Syndra i Orianna, chociaż bez wahania od czasu do czasu wybiera Cassiopeię lub Taliyah. Ramune z łatwością zgrał się z kolegami z drużyny, dodając stabilny element na środkowej alei. Z pewnością potrafi zdobywać zabójstwa, ale może także zapewnić poważną asystę, jeśli akurat tego potrzebuje jego drużyna. Koledzy będą liczyli na jego żelazne nerwy, gdy rywalizacja o jedno z ostatnich miejsc na MSI nabierze tempa.","es_ES":"Osamu ''Ramune'' Ozawa es uno de los últimos fichajes de Rampage. Especialista en los magos de control, destaca con campeonas que están ahora mismo en el metajuego, como Syndra y Orianna, aunque no tiene ningún problema a la hora de recurrir a otras como Cassiopeia o Taliyah. Remune tampoco sufrió para adaptarse a sus compañeros de equipo, a quienes aportó un elemento de estabilidad en la calle central. Es capaz de acumular asesinatos, pero también está dispuesto a cosechar múltiples asistencias si eso es lo que el equipo necesita. Sus compañeros de equipo se apoyarán en su fiabilidad cuando la competición se encuentre en plena ebullición y haya que luchar por hacerse con uno de las últimas plazas del MSI.","pt_BR":"<p>Osamu \"Ramune\" Ozawa é um dos membros mais novos da Rampage. Especialista em magos de controle, ele se supera em Campeões de meta, como Syndra e Orianna, e também não tem problemas com uma eventual Cassiopeia ou Taliyah. Ramune se deu muito bem com seus colegas de equipe e trouxe um elemento estável à rota do meio. Ele certamente acumula abates, mas também manda ver nas assistências quando é disso que a equipe precisa. Seus colegas de equipe vão contar com Ramune e seu pulso firme à medida que a competição pelas vagas finais no MSI ficar mais acirrada.</p>"},"foreignIds":{"TRLT3":"200000005"},"socialNetworks":{},"champions":[],"liveGameTeam":242}],"scheduleItems":[{"id":"AVuhncX_QMQFcjhwbQyw","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:b76cb2b2-50b5-492a-89ed-51784a73712c","scheduledTime":"2017-04-28T22:00:00.428+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:2aa734c2-34cc-4dca-b12c-8b6d6bc54421","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"b76cb2b2-50b5-492a-89ed-51784a73712c","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"2aa734c2-34cc-4dca-b12c-8b6d6bc54421","league":"10"}],"gameIdMappings":[{"id":"50ea4268-e1c5-4558-b3de-310f10c6446d","gameHash":"4b56eb79e6ab46e5"}],"videos":[{"id":6699,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:50ea4268-e1c5-4558-b3de-310f10c6446d","source":"https://www.youtube.com/embed/Kz30RqsCYpg?wmode=transparent","createdAt":"2017-04-29T00:10:37.000Z","updatedAt":"2017-04-29T00:10:37.000Z","game":"50ea4268-e1c5-4558-b3de-310f10c6446d"},{"id":6700,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:50ea4268-e1c5-4558-b3de-310f10c6446d","source":"https://www.youtube.com/embed/L9hTSLQniVs","createdAt":"2017-04-29T00:09:16.000Z","updatedAt":"2017-04-29T00:09:16.000Z","game":"50ea4268-e1c5-4558-b3de-310f10c6446d"},{"id":6703,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:50ea4268-e1c5-4558-b3de-310f10c6446d","source":"https://www.youtube.com/watch?v=is0FqUSQl-8&wmode=transparent","createdAt":"2017-04-29T00:38:04.000Z","updatedAt":"2017-04-29T00:38:04.000Z","game":"50ea4268-e1c5-4558-b3de-310f10c6446d"},{"id":6931,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:50ea4268-e1c5-4558-b3de-310f10c6446d","source":"https://www.youtube.com/embed/RyQaWCy8vUw","createdAt":"2017-05-29T03:35:33.000Z","updatedAt":"2017-05-29T03:35:33.000Z","game":"50ea4268-e1c5-4558-b3de-310f10c6446d"}],"htmlBlocks":[],"match":{"id":"b76cb2b2-50b5-492a-89ed-51784a73712c","name":"DW-vs-RPG","position":4,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"},{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}],"games":{"50ea4268-e1c5-4558-b3de-310f10c6446d":{"id":"50ea4268-e1c5-4558-b3de-310f10c6446d","name":"G1","generatedName":"DW|RPG|G1|b76cb2b250b5492a89ed","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"},{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}],"standings":{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1496028768655,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493424808547,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493424595679,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493421938262,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120126","gameRealm":"TRLT3","platformId":"TRLT3:120126","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1496028768655,"source":"bestOf","history":[{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493424808547,"source":"bestOf","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493424595679,"source":"bestOf","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"8ea3050d-01f8-4e56-880a-a7597a8acce3"}]],"timestamp":1493421938262,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c":1,"8ea3050d-01f8-4e56-880a-a7597a8acce3":0}}}