{"teams":[{"id":73,"slug":"team-dragon-knights","name":"Team Dragon Knights","guid":"be6ded88-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/team-dragon-knights-chrt2mqx.png","acronym":"TDK","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":"http://assets.lolesports.com/team/team-dragon-knights-hh39eds4.png","createdAt":"2015-05-26T21:11:28.000Z","updatedAt":"2016-04-08T20:07:05.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3856"},"players":[121,258,347,364,396,503,664,666,736,1106],"starters":[121,258,347,364,664],"subs":[396,503,666,736,1106]},{"id":186,"slug":"dream-team","name":"Dream Team","guid":"be7105b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/dream-team-57gx8jw7.png","acronym":"DT","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-01-20T22:26:10.000Z","updatedAt":"2017-01-27T16:20:45.000Z","bios":{},"foreignIds":{},"players":[225,272,563,578,774,779,1103,1121],"starters":[578,774,779,1103],"subs":[225,272,563,1121]}],"players":[{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":225,"slug":"brokenshard","name":"Brokenshard","firstName":"Ram","lastName":"Djemal","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/brokenshard-7zfzy87g.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-12T20:13:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1145","TRLH1":"1001360010","TRLH2":"15080","FRA1TMNT1":"395029"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":258,"slug":"kez","name":"kez","firstName":"Kevin","lastName":"Jeon","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/kez-5t7efxvg.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-09-09T16:42:15.000Z","updatedAt":"2016-08-04T18:01:20.000Z","bios":{"en_US":"Kevin “Kez” Jeon has been involved in the NA Challenger Series since 2013 when he joined The Walking Zed. After playing for both Cloud9 Tempest and compLexity, Kez made his way to Team Dragon Knights in 2015."},"foreignIds":{"drupalId":"1150","TRLH1":"1001270011","TRLH2":"1001200011","FRA1TMNT1":"375197"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":364,"slug":"flaresz","name":"Flaresz","firstName":"Cuong","lastName":"Ta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flaresz-bvsf1d92.png","hometown":"USA","region":"OPL","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-03-10T04:55:27.000Z","bios":{"en_US":"Flaresz has had a strange trajectory to the OPL, having substantial experience in North America's Challenger scene as well as the LCS. He was a successful solo queue player and a shining spot on Enemy Esports. His strong laning will undoubtedly draw a lot of attention this year."},"foreignIds":{"drupalId":"2544","TRLH1":"1001260001","FRA1TMNT1":"395028","TRLH2":"1001210001","ESPORTSTMNT03":"200000509"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":396,"slug":"thy","name":"Thy","firstName":"Son","lastName":"Seung Yong","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/thy-bflochot.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-03-27T20:34:57.000Z","updatedAt":"2016-02-20T00:07:27.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2798","TRLH1":"1001080004","TRLH2":"1001070004","FRA1TMNT1":"395032"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":503,"slug":"bischu","name":"Bischu","firstName":"Aaron","lastName":"Kim","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bischu-h3nie8n3.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2015-05-26T21:14:12.000Z","updatedAt":"2016-04-07T20:14:19.000Z","bios":{"en_US":"Hyung Seok “Bischu” Kim is currently playing support for Team Dragon Knights."},"foreignIds":{"drupalId":"1151","TRLH1":"1001270015","TRLH2":"1001200015","FRA1TMNT1":"375201"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":563,"slug":"papa-chau","name":"Papa Chau","firstName":"John","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/papa-chau-9zq8r0tz.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-03-08T20:01:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3002","ESPORTSTMNT02":"200000747","TRLH1":"200000297"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":578,"slug":"pekin-woof","name":"Pekin Woof","firstName":"Isaac","lastName":" Marconis","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pekin-woof-eqae2nyp.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T22:24:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2001","ESPORTSTMNT02":"200000742","TRLH1":"200000288"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":664,"slug":"trance","name":"Trance","firstName":"Lawrence","lastName":"Amador","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/trance-64pcofeg.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2016-06-09T22:55:46.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2520","FRA1TMNT1":"375421","TRLH2":"1001200033","TRLH1":"1001270033"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":666,"slug":"rf","name":"RF Legendary","firstName":"Oleksii","lastName":"Kuziuta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rf-6o25dshw.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-03-08T20:07:05.000Z","bios":{"en_US":"","fr_FR":"<p>Oleksii « RF » Kuziuta (précédemment connu sous le nom de RF Legendary) a voleté sur la scène\n\nChallenger nord-américaine pendant plusieurs années avant d'entrer aux LCS NA en 2016 avec \n\nRenegades. La quantité de dégâts qu'il est capable d'infliger, notamment avec Rumble, fait de RF une \n\ncible prioritaire. Mais il refuse de tomber sans avoir combattu jusqu'au bout.</p>","pl_PL":"<p>Ten młody Ukrainiec, przed dołączeniem do LA Renegades w marcu 2015, był członkiem tylko w drugorzędnych zespołach.  Wiosenny sezon NA LCS 2016 będzie jego debiutem, aczkolwiek jest bardzo doświadczonym graczem, ponieważ oddaje się League of Legends od czasu wydania bety. W swoich pierwszych latach lubił grać Kog’mawem, lecz nie przyniosło mu to sławy. Zyskał uznanie w Kręgu Pretendenta za doskonałe opanowanie Nidalee. Sam wielokrotnie wyznawał swoją miłość do tej postaci, podkreślając, że kocha po równo wszystkie jej skiny. Spytany o powód wyboru właśnie Zwierzęcej Łowczyni odpowiada prosto: „Fajna do gry, fajna do oglądania, trudna do opanowania, ma wysoką szansę na ciekawe zagrania, a poza tym kto by nie chciał grać piękną dziewczyną z takim tańcem, która potrafi zamienić się w kota?” Aczkolwiek na top-lanie, w oczach przeciętnego gracza, nieziemsko radzi sobie każdym bohaterem. Do grona jego ulubionych postaci należy jeszcze Irelia i Renekton.</p>\n<p>\n\"RF Legendary\" jest znany z doskonałego kontaktu ze swoimi fanami. Nigdy ich nie zawodzi i zawsze odpowiada na ich pytania na portalach społecznościowych. Olbrzymie powodzenie wśród całego społeczeństwa League of Legends przyniósł mu film wrzucony do sieci, na którego stworzenie namówili go właśnie wielbiciele. W nim zaleca się do napotkanych w szkole dziewcząt i zachęca do wspólnego powrotu do domu. Przy tym, wymieniając swoje liczne zalety, wspomina, że osiągnął diament / krąg pretendenta w solo que. Śmiałość tego występu absolutnie pobiła rekordy oglądalności, ponieważ jego nagranie obejrzała zawrotna ilość widzów - ponad 500 tysięcy.</p>\n<p>\nW rozmowach z fanami wyjawił jak się czuje w związku z dostaniem się do NA LCS. \"RF Legendary\" grając w Challenger Series czuł się spełniony i szczęśliwy. Po kwalifikacji na szczebel wyżej jest zadowolony, że będzie miał okazję się wykazać na top-lanie i że inni gracze przestali uważać, że jest one-trick pony. Sam o sobie mówi, że jest marzycielem i miłośnikiem kawy. Dzięki temu, że Oleksii urodził się w Mariupolu, na Ukrainie, a dopiero potem przeniósł się do Stanów Zjednoczonych, potrafi mówić płynnie w trzech językach – ukraińskim, rosyjskim i angielskim. </p>\n"},"foreignIds":{"drupalId":"2567","ESPORTSTMNT02":"200000740","TRLH1":"200000286"},"socialNetworks":{"twitch":"http://www.twitch.tv/RfLegendary","youtube":"https://www.youtube.com/user/RFLegendary","facebook":"https://www.facebook.com/RFLegendarylol","twitter":"https://twitter.com/RF_Legendary"},"champions":[],"liveGameTeam":73},{"id":736,"slug":"do-it","name":"do it","firstName":"Chan-ho","lastName":"Lee","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/do-it-b5reu0m.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-01-28T19:17:55.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4343","FRA1TMNT1":"375199"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":1106,"slug":"moolchael","name":"moolchael","firstName":"Young","lastName":"Kim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/moolchael-4sbbf94a.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2016-01-22T03:08:08.000Z","updatedAt":"2016-03-08T00:21:39.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375423","TRLH1":"1001270024","TRLH2":"1001200024"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":1121,"slug":"bee-sin","name":"Bee Sin","firstName":"Keaton","lastName":"Cryer","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bee-sin-chntpicw.png","hometown":"","region":"N/A","birthdate":null,"createdAt":"2016-01-22T19:26:53.000Z","updatedAt":"2016-07-12T20:14:34.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375427","TRLH1":"1001360012"},"socialNetworks":{},"champions":[],"liveGameTeam":186}],"scheduleItems":[{"id":"AVJnQ40yJTrHluSI14Mh","content":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:match:b9f5529c-6ea4-4cfc-a507-85207a3d07fc","scheduledTime":"2016-02-04T04:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3","blockLabel":"2","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:bracket:808879a2-c11c-412f-9369-55e87c09e526"},"match":"b9f5529c-6ea4-4cfc-a507-85207a3d07fc","tournament":"d35712b5-b3b9-4579-b88f-2b3999d9dda3","bracket":"808879a2-c11c-412f-9369-55e87c09e526","league":"4"}],"gameIdMappings":[{"id":"dff466a0-e76c-40d0-af52-96774d32cfe5","gameHash":"4be06822c66dbd54"},{"id":"5ab559c8-5e47-48b8-8873-31f64c16fd36","gameHash":"05fb3ad8c61bbb9c"}],"videos":[{"id":743,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:5ab559c8-5e47-48b8-8873-31f64c16fd36","source":"https://www.youtube.com/embed/BzfMDBlRsa8?wmode=transparent","createdAt":"2016-02-04T05:45:22.000Z","updatedAt":"2016-02-04T05:45:22.000Z","game":"5ab559c8-5e47-48b8-8873-31f64c16fd36"},{"id":777,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:dff466a0-e76c-40d0-af52-96774d32cfe5","source":"https://www.youtube.com/embed/PDYT5oZIECU?wmode=transparent","createdAt":"2016-02-05T17:53:14.000Z","updatedAt":"2016-02-05T17:53:14.000Z","game":"dff466a0-e76c-40d0-af52-96774d32cfe5"}],"htmlBlocks":[],"match":{"id":"b9f5529c-6ea4-4cfc-a507-85207a3d07fc","name":"DT-vs-TDK","position":9,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"},{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],"games":{"dff466a0-e76c-40d0-af52-96774d32cfe5":{"id":"dff466a0-e76c-40d0-af52-96774d32cfe5","name":"G1","generatedName":"DT|TDK|G1|b9f5529c6ea44cfca507","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"},{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}],"standings":{"result":[[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}]],"timestamp":1454558786262,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"890112","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:890112","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5ab559c8-5e47-48b8-8873-31f64c16fd36":{"id":"5ab559c8-5e47-48b8-8873-31f64c16fd36","name":"G2","generatedName":"DT|TDK|G2|b9f5529c6ea44cfca507","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"},{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}],"standings":{"result":[[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}],[{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}]],"timestamp":1454561240111,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"890123","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:890123","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"},{"roster":"cae9c414-0793-4d00-ab1a-c47e167ce481"}]],"timestamp":1454561240111,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf":1,"cae9c414-0793-4d00-ab1a-c47e167ce481":1}}}