{"teams":[{"id":18,"slug":"cloud9","name":"Cloud9 ","guid":"be6c8a00-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cloud9-gnd9b0gn.png","acronym":"C9","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-01T18:45:39.000Z","updatedAt":"2017-08-02T22:06:55.000Z","bios":{"en_US":"<p>The dream meme team is back for 2017 with some promising new additions. Although Cloud9 performed the best of any North American team at the 2016 World Championship, they weren’t satisfied with their quick exit in the quarterfinals. Former Challenger scene standout Contractz was handed the reigns to the jungle in his rookie season. The team also acquired Ray, Apex Gaming’s former playmaking top laner. \n\n<p>Despite a strong split, the team once again fell to TSM in the 2017 NA LCS Spring Split finals. Heading into summer, if Cloud9's young players can hone their raw talent, the team could rise to new heights this year.</p>\n\n<p>Coach: Han-gyu \"Reapered\" Bok<p>","fr_FR":"<p>Cloud9 a fait une entrée fracassante sur la scène compétitive de League of Legends pendant la saison 3, lors du segment d'été des LCS NA, avec un score astronomique de 25-3. Suite à ses débuts spectaculaires, l'équipe a fait plusieurs apparitions lors de championnats régionaux et internationaux, allant des play-offs régionaux des LCS NA au Championnat du monde. Toutefois, Cloud9 est tombée de son piédestal en 2015, retombant à la 7e place du segment d'été des LCS NA 2015. Malgré un parcours bien ficelé jusqu'en finale du tournoi régional NA 2015 qui a valu à C9 de se qualifier pour le Championnat du monde 2015, les performances de l'équipe ont soulevé de nombreuses questions. Reste à savoir si ses membres possèdent encore le talent nécessaire pour s'imposer comme ils ont su le faire par le passé.</p>","pl_PL":"<p>C9 to, obok Teamu SoloMid, najbardziej utytułowana amerykańska organizacja w historii. Cloud9 znane jest z utrzymywania nieustannie wysokiego poziomu oraz przywiązania do graczy. Podczas gdy inne drużyny dokonują co najmniej kilku zmian rocznie, w zespole, której symbolem jest niebieska chmurka, przez pierwsze dwa lata współpracy… nie było żadnych rotacji.</p>\n<p> \nZaczęło się zwyczajnie, od przygody z Quantic Gaming, gdzie w 2012 roku występował obiecujący skład złożony z Haia, LemonNationa, Nientosoha, Wild Turtle’a i Yazukiego. Pierwsze podejście drużyny do NA LCS było nieudane, ale na początku 2013 roku gracze i organizacja zdecydowali się dać sobie drugą szansę w nieco zmienionym składzie, a do zespołu dołączyli Balls, Meteos i Sneaky. Formacja bez trudu przeszła eliminacje i po zwycięstwie w meczu barażowym dostała się do letniego splitu NA LCS 2013. Miała to być dopiero druga edycja rozgrywek, a jednocześnie początek legendy Cloud9.</p>\n<p>\nByło powszechnie wiadomo, że nowy zespół w stawce jest naprawdę dobry, ale nie że aż tak dobry. Cloud9 całkowicie zdominowało rozgrywki, ustanawiając niewyobrażalny rekord 25-3, bo tyle wynosił bilans drużyny na koniec sezonu zasadniczego. C9 nie zamierzało jednak poprzestawać na wygraniu sezonu zasadniczego i w play-offach poszło za ciosem – 2:0 z Dignitas i 3:0 z TSM-em w finale zapewniły beniaminkowi triumf w debiutanckim splicie w NA LCS.</p>\n<p>\nTo z kolei pozwoliło Cloud9 na wyjazd na Mistrzostwa Świata. Oczekiwania kibiców były ogromne, ale zespół nie sprostał presji, odpadając z rywalizacji w swoim pierwszym meczu, w ćwierćfinale przeciwko Fnatic. Tę klęskę C9 powetowało sobie na krajowym podwórku – rok 2014 znów stał pod znakiem niebieskobarwnej dominacji, czego dowodzi kolejny fantastyczny split zakończony wynikiem 24-4 i triumf w wiosennych play-offach. Latem z formą zespołu było już nieco gorzej, a wygranie fazy zasadniczej przyszło C9 z dużym trudem. Ostatecznie w finale play-offów Cloud9 było zmuszone uznać wyższość Teamu SoloMid. Wystarczyło to, by po raz kolejny pojechać na światowy czempionat i niestety po raz kolejny zawodnicy C9 wracali ze spuszczonymi głowami po odpadnięciu w ćwierćfinale.</p>\n<p>\nWiosna 2015 była już łabędzim śpiewem formacji, której po raz kolejny udało się dostać do finału play-offów NA LCS. Tam jednak nie sprostali świetnie dysponowanemu Teamowi SoloMid, który po raz drugi z rzędu zwyciężył w rozgrywkach, jednocześnie po raz drugi spychając C9 na drugą pozycję.</p>\n<p>\nTo jednak był dopiero początek problemów zespołu, który coraz bardziej oddalał się od swoich najlepszych czasów. Narastające wewnętrzne problemy oraz uciążliwe kontuzje zmusiły Haia „Haia” Lama do rezygnacji z występów. Legendę zespołu zastąpił na środkowej alei ogromny duński talent, Nikolaj „Incarnati0n” Jensen, który został właśnie dopuszczony do grania na profesjonalnej scenie. Szybko okazało się jednak, że Incarnati0n potrzebuje trochę czasu na aklimatyzację, a cały zespół – Haia. Zastąpienie doświadczonego shot-callera okazało się niemożliwe i gra zespołu, który okupował dolne rejony tabeli, nie wyglądała najlepiej. Hai wrócił, zastępując Williama „Meteosa” Hartmana w roli dżunglera i doprowadził formację do utrzymania, a dzięki niezłej wiośnie, drużyna dostała się również do baraży o wyjazd na Mistrzostwa Świata. I znów – udało się. Co ciekawe, C9 było w tym splicie bliskie odpadnięcia z rywalizacji, a bezpieczne, siódme miejsce wywalczyło dopiero w dodatkowym meczu barażowym przeciwko Teamowi 8.</p>\n<p>\nNa MŚ, po pierwszej rundzie fazy grupowej, wydawało się, że sen C9 będzie trwał – drużyna wygrała wszystkie trzy mecze i mogło było odnieść wrażenie, że tylko kataklizm może pozbawić ją miejsca w ćwierćfinale. No cóż – trzy porażki i przegrana w barażach o drugie miejsce okazały się właśnie takim kataklizmem. Nie udało się. Zespół przygotowuje się do sezonu 2016 bogatszy o ostatnie doświadczenia i zamierza powrócić na pierwsze miejsce, a pomóc mają interesujące zmiany w składzie.</p>\n<p>\nW przerwie między rozgrywkami Hai przeniósł się na pozycję wspierającego, którą pełnić będzie wespół z utalentowanym Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity. Pozycję dżunglera zajął natomiast rozchwytywany po rozpadzie Teamu Impulse Koreańczyk Lee „Rush” Yoon-jae, który był objawieniem sezonu 2015 w NA LCS.</p>\n","de_DE":"Das Meme-Dream-Team kehrt 2017 mit einigen vielversprechenden Neuzugängen zurück. Obwohl Cloud9 das beste nordamerikanische Team bei der Weltmeisterschaft 2016 war, gaben sie sich mit dem schnellen Ausscheiden im Halbfinale nicht zufrieden. Contractz, der vor allem durch seine Leistungen in der Challenger Series bekannt wurde, übernimmt in seiner ersten Saison die Führung im Dschungel. Das Team hat außerdem Ray aufgenommen, der früher als Spielmacher bei Apex Gaming in der oberen Lane tätig war. Wenn sie es schaffen, ihr rohes Talent mit den Führungsqualitäten der Veteranen zu kombinieren, könnte Cloud9 dieses Jahr neue Höhen erklimmen.</p>\n<p>\nCoach: Trainer: Han-gyu „Reapered“ Bok</p>\n","es_ES":"<p>Nadie puede discutir que el camino para llegar al Mundial de Cloud9 ha sido más duro que el de ningún otro equipo. Tras una dolorosa derrota contra TSM en la final de la LCS NA, el equipo consiguió una vez más superar el clasificatorio regional y reservarse el último puesto para representar a Norteamérica en el Mundial. Ha sido un viaje agotador, pero la experiencia seguro que no tiene precio. Cloud9 ya ha jugado cinco enfrentamientos al mejor de 5 sin haber pisado aún siquiera el escenario del Mundial.</p> \n<p>Tras una temporada regular durante la que tuvieron problemas de coordinación en algunos momentos, han jugador de forma mucho más coherente durante los playoffs. Si pueden sacar provecho de su arduo camino hasta el Mundial, van a ser una fuerza a tener en cuenta en el escenario internacional.</p>","pt_BR":"É difícil negar que alguma outra equipe teve um caminho mais árduo para o Mundial do que a Cloud9. Depois de uma derrota arrasadora para a TSM nas Finais de Verão da NA LCS, a equipe se reergueu e lutou mais uma vez pelas Classificatórias Regionais para conseguir a última vaga da América do Norte para o Mundial. A jornada foi difícil, mas a experiência pode ter sido de grande valor. Cloud9 agora já jogou cinco partidas separadas de Melhor de 5 antes mesmo de ir para o Mundial. Depois de uma temporada regular que mostrou algumas dificuldades em sinergia, eles estavam muito mais coesos nas eliminatórias. Se eles puderem usar seu árduo caminho para o Mundial como uma vantagem, eles certamente serão uma força a ser reconhecida no palco internacional","es_AR":"<p>Es muy difícil encontrar un equipo que haya luchado más que Cloud9 para llegar al Mundial. Después de una desgarradora derrota ante TSM en la final del torneo de clausura de la LCS NA, el equipo se repuso y volvió a competir en las clasificatorias regionales para ganarse el último boleto de Norteamérica al Mundial. Fue una hazaña agotadora, pero la experiencia obtenida es una recompensa invaluable. Cloud9 ya ha jugado cinco combates al mejor de cinco antes de aparecer en el Mundial. Aunque tuvieron problemas para trabajar bien en grupo en la temporada regular, supieron complementarse mucho más en las eliminatorias. Si saben aprovechar la experiencia obtenida en el arduo camino que atravesaron para llegar al Mundial, serán una fuerza que dejará su huella en el escenario internacional.</p>\n\n<p><strong>Entrenador: Han-gyu \"Reapered\" Bok</strong></p>"},"foreignIds":{"drupalId":"304"},"players":[45,115,163,255,482,499,508,1120],"starters":[45,115,482,499,1120],"subs":[163,255,508]},{"id":220,"slug":"phoenix1","name":"Phoenix1","guid":"be7141eb-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/phoenix1-fw17w8yu.png","acronym":"P1","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2016-05-23T20:47:04.000Z","updatedAt":"2017-08-05T20:06:49.000Z","bios":{"en_US":"<p>Phoenix1 is reborn for 2017 with an overhauled roster. After starting the 2016 NA LCS Summer Split as the butt of many jokes about their poor record, the team turned things around behind jungler Inori’s strong performances in the second half. They avoided relegation and brought in key new players with the hopes of earning their first playoff berth.</p>\n\n<p>The addition of Ryu and Arrow paid off big time. Phoenix1 finished third in the regular season and made it all the way to the semifinals before falling to Cloud9. With Inori returning as the starting jungler, Phoenix1 won't need to rise from the ashes this time around; instead, they'll look to burn even brighter.</p>\n\n<p>Coach: Sang-Chul “Fly” Kim</p>","de_DE":"Phoenix1 ist 2017 mit einer überarbeiteten Mannschaft wiederauferstanden. Nachdem sie aufgrund ihrer schlechten Bilanz im Sommer-Split der NA LCS 2016 zur Zielscheibe vieler Witzeleien wurden, konnte sie dank der starken Leistungen ihres Junglers, Inori in der zweiten Hälfte das Ruder noch einmal herumreißen. Sie konnten den Abstieg verhindern und drei neue Spieler verpflichten, mit denen sie sich ihren ersten Sieg bei den Entscheidungsspielen sichern könnten.\n</p>\nDer ehemalige Mid-Laner von H2K, Ryu, der Ex-AD-Carry von KT Rolster, Arrow, und der frühere Supporter der Immortals, Adrian, schließen sich Inori und Zig an. Wenn Inori seine Form von Ende 2016 beibehalten kann und es sein Team schafft, seine aggressiven Champions wie Rengar und Hecarim zu unterstützen, könnte sich Phoenix1 einen Platz an der Spitze der NA LCS sichern.\n</p>\nCoach: Sang-Chul „Fly“ Kim\n"},"foreignIds":{},"players":[113,166,199,346,600,752,972,1160,1673,1903],"starters":[166,346,600,752,1903],"subs":[113,199,972,1160,1673]}],"players":[{"id":45,"slug":"impact","name":"Impact","firstName":"Eonyoung","lastName":"Jeong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/impact-8a44ib2j.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-07-04T19:26:43.000Z","bios":{"en_US":"<p>Former World Champion Eonyoung “Impact” Jeong isn’t quite ready to hang up the mouse and keyboard. The former SK Telecom T1 top laner put on a show in the 2016 NA LCS Playoffs, proving no other top laner in North America measured up. While his regular season was uninspiring, he almost singlehandedly earned Cloud9 a spot at the 2016 World Championship.</p>\n\n<p>Unfortunately, Impact struggled to find his groove on the world stage. Cloud9 was the only NA team to earn a quarterfinals berth, but they were quickly eliminated by Samsung Galaxy. As the shield to Ray's sword, the dynamic duo dominated the competition in the 2017 NA LCS Spring Split. With such talent in the top lane, Cloud9’s opponents’ nightmares will be just two words, repeating forever: “top die.”</p>","fr_FR":"<p>L'ancien champion du monde Eonyoung \"Impact\" Jeong n'est pas prêt à raccrocher souris et clavier. Après un segment d'été des LCS NA peu inspiré, l'ancien top laner de SK Telecom T1 a eu le vent en poupe durant les play-offs. Aucun autre top laner en Amérique du Nord n'est arrivé à la hauteur de ses performances lors des play-offs, et Cloud9 doit une grande partie de son succès post-saison à son jeu spectaculaire, ce qui a également permis de mettre un terme aux problèmes de communication qui affectaient Cloud9.</p>\n\n<p>En dépit de sa domination régionale, Impact a eu du mal à trouver ses marques dans le Championnat du monde cette année. Alors qu'il s'est montré inébranlable sur la voie du haut pour Cloud9 durant les play-offs, il a trouvé des adversaires à sa hauteur avec les top laners Duke de SK Telecom T1 et CuVee de Samsung Galaxy. Toutefois, Impact et les autres joueurs de Cloud9 ont le mérite d'être la seule équipe d'Amérique du Nord à avoir atteint les quarts de finale, et Impact les représentera lors de l'événement All-Stars. Avec 41,7 pour cent du vote top laner, il aura une chance supplémentaire cette année de \"déchirer la voie du haut\".</p>","pl_PL":"Były Mistrz Świata, Eonyoung „Impact” Jeong, nie zamierza jeszcze zawiesić na kołku mysz i klawiatury. Po niezbyt udanych występach w letnim splicie NA LCS dawny górny SKTelecom T1 szalał w fazie pucharowej. Żaden inny górny w Ameryce Północnej nie dorównywał formą Impactowi podczas playoffów, a Cloud9 zawdzięczają w dużej mierze swój sukces po sezonie jego znakomitej grze. Rozwiały się także wątpliwości dotyczące problemów z komunikacją wewnątrz Cloud9.\n</p>\nPomimo dominacji w regionie, Impact nie potrafił odnaleźć się w tym roku na Mistrzostwach Świata. Chociaż podczas fazy pucharowej na górnej alei Cloud9 był nie do ruszenia, znalazł równych sobie w postaci górnego SK Telecom T1, Duke’a i CuVee z Samsung Galaxy. Mimo to, Impact i reszta Cloud9 zasługują na uznanie jako jedyna drużyna z Ameryki Północnej, która dotarła do ćwierćfinałów. Wkrótce Impact będzie ją reprezentował na wydarzeniu All-Star. Mając 41,7 procenta głosów na górnego, dostanie w tym roku jeszcze jedną szansę, by pokazać jak „góra umiera”.\n","de_DE":"Der ehemalige Weltmeister Eonyoung „Impact“ Jeong ist noch nicht bereit, Maus und Tastatur an den Nagel zu hängen. Der ehemalige Top-Laner von SK Telecom T1 hat bei den Entscheidungsspielen der NA LCS 2016 eine Show abgeliefert und damit bewiesen, dass ihm kein Top-Laner in Nordamerika das Wasser reichen kann. Obwohl seine Leistungen in der regulären Saison uninspiriert waren, hat er Cloud9 fast im Alleingang zur Weltmeisterschaft 2016 geführt.</p>\n<p>\nLeider hatte Impact bei der Weltmeisterschaft Probleme damit, seinen Rhythmus zu finden. Cloud9 war das einzige nordamerikanische Team, das sich einen Platz im Viertelfinale sichern konnte, allerdings sind sie anschließend direkt an Samsung Galaxy gescheitert. In diesem Frühjahrs-Split wird Impact versuchen, auf einem noch höheren Level zu spielen. Darüber hinaus wird er Ray, seinen neuen Teamkollegen, unter seine Fittiche nehmen. Der talentierte Top-Laner wird den Gegnern von Cloud9 Albträume bescheren, in denen sich zwei Worte unendlich wiederholen: „top die“.\n","es_AR":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","es_ES":"<p>Aún no ha llegado el momento de que el que fuera campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del split de verano de la LCS NA poco inspirado, el exjugador de la calle superior de SK Telecom T1 lo dio todo en los playoffs. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallan las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en la calle superior para Cloud9 durante los playoffs, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su jugador de la calle superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para la calle superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","pt_BR":"<p>Ex-campeão do mundo, Eoyoung “Impact” Jeong ainda não está preparado para pendurar o mouse e o teclado. Após um começo nada inspirador na Etapa de Verão da NA LCS, o ex-topo da SK Telecom T1 arrasou nas eliminatórias. Nenhum outro jogador de topo da América do Norte chegou perto de seu desempenho, e a Cloud9 deve de seu sucesso de pós-temporada à sua mecânica incrível, que também acabou com as preocupações de comunicação interna da equipe.</p>\n\n<p>Apesar da dominância regional, Impact teve dificuldades em se manter constantemente bem no Campeonato Mundial deste ano. Apesar de ter sido imprescindível na rota do topo para a Cloud9 durante as eliminatórias, ele encontrou adversários à altura como Duke, da SK Telecom T1 e CuVee, da Samsung Galaxy. Impact e o restante da Cloud9 merecem o crédito de terem sido a única equipe da América do Norte a chegar nas quartas-de-final, fazendo dele o representante da equipe para o Evento All-Star. Com 41,7% dos votos da rota do topo, ele terá mais uma chance de acabar com o topo.</p>","cs_CZ":"<p>Bývalý mistr světa Eonyoung „Impact“ Jeong ještě není připraven pověsit klávesnici a myš na hřebík. Po neslaném nemastném letním splitu severoamerického LCS se v play-off tento dřívější horní lajnař z SK Telecom T1 doslova utrhl ze řetězu. Žádný jiný horní lajnař ze Severní Ameriky se s jeho formou ve vyřazovací části turnaje nemohl měřit a Cloud9 za svůj úspěch z velké části vděčili právě jeho hvězdným výkonům, čímž navíc vzaly zasvé obavy, že se Cloud9 potýká s komunikačními problémy.</p>\n\n<p>Ačkoliv ve svém regionu řádil Impact jako černá ruka, na letošním mistrovství světa se mu už tak skvěle nedařilo. Během vyřazovacích zápasů byl sice v horní lajně pro Cloud9 cennou oporou, našel však sobě rovné v Dukovi z SK Telecom T1 a v CuVeem ze Samsung Galaxy. Přesto si Impact a zbytek Cloud9 zaslouží uznání za to, že se stali jediným severoamerickým týmem, který se probojoval do čtvrtfinále, a Impact bude tento region reprezentovat i na turnaji All-Star. Z hráčů v horní lajně obdržel 41,7 % hlasů a bude tak mít letos ještě jednu šanci provést svůj klasický „top die“.</p>","el_GR":"<p>Ο πρώην Παγκόσμιος Πρωταθλητής Eonyoung “Impact” Jeong δεν είναι ακόμα έτοιμος να κρεμάσει το ποντίκι και το πληκτρολόγιό του. Μετά από ένα απογοητευτικό Summer Split στο LCS Βόρειας Αμερικής, ο πρώην παίκτης επάνω λωρίδας των SK Telecom T1 έκανε μια καταπληκτική εμφάνιση στα πλέι οφ. Κανένας άλλος παίκτης επάνω λωρίδας στη Βόρεια Αμερική δεν μπόρεσε να συγκριθεί μαζί του στα πλέι οφ και οι Cloud9 οφείλουν μεγάλο μέρος της επιτυχίας τους στους αγώνες μετά το τέλος της σεζόν στην εκπληκτική του φόρμα, αποστομώνοντας και όσους έλεγαν ότι οι Cloud9 είχαν προβλήματα επικοινωνίας.</p>\n\n<p>Παρά την κυριαρχία του σε τοπικό επίπεδο, ο Impact δυσκολεύτηκε πολύ να βρει το ρυθμό του στο φετινό Παγκόσμιο Πρωτάθλημα. Παρόλο που ήταν πραγματικός τοίχος στην επάνω λωρίδα των Cloud9 κατά τη διάρκεια των πλέι οφ, δυσκολεύτηκε πολύ ενάντια σε άλλους δυνατούς παίκτες επάνω λωρίδας, όπως τον Duke των SK Telecom T1 και τον CuVee των Samsung Galaxy. Ωστόσο, ο Impact και οι υπόλοιποι Cloud9 αξίζουν ένα μεγάλο «μπράβο» που ήταν η μοναδική ομάδα από τη Βόρεια Αμερική που κατάφερε να φτάσει στους προημιτελικούς. Μάλιστα, ο Impact θα εκπροσωπήσει την ομάδα του και στο Τουρνουά All-Star. Άλλωστε, ήταν ο παίκτης που συγκέντρωσε το 41,7% των ψήφων για την επάνω λωρίδα, άρα θα έχει την ευκαιρία να δείξει αν είναι όντως ο καλύτερος στη θέση του.</p>","hu_HU":"A korábbi világbajnok Eonyoung „Impact” Jeong még nem szeretné szögre akasztani az egeret és a billentyűzetet. Az NA LCS gyenge nyári szakasza után az SK Telecom T1 egykori felső ösvényese nagyon rákapcsolt a rájátszásban. Egyetlen másik észak-amerikai játékos sem tudott felérni hozzá, és a Cloud9 jórészt neki köszönheti a szezon utáni sikereit, amivel egyébként sikerült eloszlatni a Cloud9 kommunikációs problémáival kapcsolatos pletykákat is.\n</p>\nA regionális sikerek ellenére Impact nehezen talált magára az idei világbajnokságon. Bár a Cloud9 felső ösvényén nem akadt ellenfélre a rájátszás során, a vb-n olyanokkal kellett szembenéznie, mint Duke (SK Telecom T1) és CuVee (Samsung Galaxy). Impact és a Cloud9 többi tagja egyedüli észak-amerikai csapatként jutott a negyeddöntőig, és Impact képviselheti őket az All-Star gálán. A felső ösvényesekre leadott szavaztok 41,7%-át söpörte be, így idén kap még egy utolsó esélyt, hogy bizonyítson.\n","it_IT":"L'ex campione del mondo Eonyoung \"Impact\" Jeong sembra non avere ancora intenzione di appendere mouse e tastiera al chiodo. Dopo un Summer Split LCS NA poco ispirato, l'ex superiore di SK Telecom T1 si è fatto valere durante i playoff. Nessun altro giocatore top in Nord America è riuscito a tenergli testa durante questo periodo e Cloud9 deve gran parte del suo successo post-stagionale alle sue giocate stellari, che hanno messo anche a tacere le voci che parlavano di problemi di comunicazione interni alla squadra.\n</p>\nNonostante il predominio nella sua regione, Impact ha sofferto molto per trovare il giusto ritmo ai Mondiali di quest'anno. Pur essendo un elemento immancabile nella corsia superiore dei Cloud9 durante i playoff, ha avuto filo da torcere contro giocatori nel suo stesso ruolo del calibro di Duke degli SK Telecom T1 e CuVee dei Samsung Galaxy. In ogni caso, Impact e i suoi compagni dei Cloud9 meritano un encomio per essere stati l'unico team nordamericano a raggiungere i quarti di finale, e sarà proprio Impact a rappresentarli nell'evento All-Star. Forte del 41,7% dei voti per la categoria Superiore, ora avrà un'altra occasione per dominare la sua corsia.\n","ro_RO":"Fostul Campion Mondial Eonyoung ''Impact'' Jeong nu e încă pregătit să lase deoparte mouse-ul și tastatura. După o etapa de vară neinspirată în LCS NA, fostul jucător de pe culoarul de sus al SK Telecom T1 a avut parte de o serie de victorii în playoff-uri. Niciun alt jucător de pe culoarul de sus din America de Nord nu s-a ridicat la forma sa din playoff-uri. Cloud9 datorează o mare parte din succesul său de după sezon manevrelor excepționale ale lui Impact, care au pus capăt neliniștilor legate de problemele de comunicare ale echipei.\n</p>\nÎn ciuda dominației sale regionale, Impact nu a reușit să se facă remarcat la Campionatul Mondial din acest an. Cu toate că a fost o forță de neoprit pe culoarul de sus pentru Cloud9 în timpul playoff-urilor, și-a întâlnit nașii în Duke de la SK Telecom T1 și în CuVee de la Samsung Galaxy. Însă cei din Cloud9 merită apreciați pentru că au fost singura echipă din America de Nord care a ajuns în sferturile de finală, iar Impact își va reprezenta regiunea la All-Star Event. Cu 41,7 la sută din voturile pentru culoarul de sus, va mai avea o șansă anul acesta să-și omoare adversarii de unul singur, fără ajutorul nimănui.\n","ko_KR":"","es_MX":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>"},"foreignIds":{"drupalId":"691","TRLH1":"200000172","TRLH2":"200000076","TRLH3":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":113,"slug":"meteos","name":"Meteos","firstName":"William","lastName":"Hartman","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meteos-201r3p4t.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-02-23T23:43:44.000Z","bios":{"en_US":"<p>William “Meteos” Hartman is the hero Cloud9 deserves, but not the one they need right now. After stepping away from the scene, the former superstar jungler returned to lead the team’s new lineup to the 2016 World Championship. He led all NA junglers, and ranked third overall in the league, with a 6.7 KDA during the regular season.</p>\n\n<p>His performance at Worlds was subject to ridicule, but Cloud9 was still the only North American team to make it out of the Group Stage. He’s moving aside once again in 2017, this time for the promising young jungler Contractz. So Meteos will sit on the bench. Because he can take it.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">William “Meteos” Hartman 선수는 Cloud9의 정글러입니다. 실험적인 픽을 선보이기로 유명한 Meteos 선수는 파밍에 집중해서 게임 중후반에 상대를 압도하는 플레이 스타일을 퍼뜨리는 데 큰 역할을 담당했습니다. 여기에 신비로울 정도로 뛰어난 감각으로 상대 정글러의 갱킹을 받아치는 능력이 더해져, 짧은 기간에 LCS의 MVP 수준으로 뛰어오를 수 있었죠. 하지만 북미 LCS의 경쟁이 그 어느 때보다 치열한 요즘, C9도 언제나 승리를 장담할 수는 없는 처지가 되었습니다.</p>","fr_FR":"<p>\nWilliam « Meteos » Hartman est l'ancien jungler de Cloud9. Avec son pool de champion assez expérimental (à l'image de ses memes), Meteos est un joueur vraiment unique. Il a aidé à populariser un style de jungler fortement centré sur le farming et qui vise à surpasser ses opposants en milieu et fin de partie. En combinant sa position dominante dans les CS et cette intuition inimitable qui lui permet de contrer les ganks du jungler ennemi, Meteos a rapidement atteint le statut de MVP des LCS. Ses talents seront de nouveau mis à l'épreuve lors de l'événement All-Stars 2015. Il est temps de voir si Meteos est toujours de taille pour s'imposer sur la scène compétitive internationale.\n</p>","pl_PL":"<p>\nWilliam “Meteos” Hartman to były podstawowy dżungler w Cloud9. Kochający eksperymentowanie Meteos to osobowość jedyna w swoim rodzaju. Spopularyzował styl dżunglowania opierający się na farmieniu i grze bohaterami, którzy bardzo dobrze się skalują w późniejszych fazach gry. Łącząc swoją przewagę w ilości zabitych potworów z zadziwiającą zdolnością do przewidywania kolejnych ruchów przeciwnego dżunglera, Meteos szybko osiągnął status MVP w LCS. Jego umiejętności zostaną po raz kolejny przetestowane podczas All-Star 2015. Pora abyśmy dowiedzieli się, czy wciąż daje sobie radę w międzynarodowej rywalizacji.\n</p>","de_DE":"William „Meteos“ Hartman ist der Held, den Cloud9 verdient hat, aber nicht der, den sie gerade brauchen. Nachdem sich der ehemalige Jungler-Superstar aus der Profiszene zurückgezogen hatte, kehrte er zurück, um die neuformierte Mannschaft 2016 zur Weltmeisterschaft zu führen. Er war der beste Jungler der regulären Saison und belegte mit einer TTU (KDA) von 6,7 den dritten Platz unter allen Spielern der Liga.\n</p>\nSeine Leistung bei der Weltmeisterschaft hat ihm nur Spott und Hohn eingebracht, aber Cloud9 war trotzdem das einzige nordamerikanische Team, das es in die Gruppenphase geschafft hat. Er macht 2017 erneut Platz und überlässt die Bühne dem vielversprechenden jungen Jungler Contractz. Meteos sitzt also auf der Bank. Weil er damit umgehen kann.\n","es_ES":"<p>Es casi como si William ''Meteos'' Hartman nunca se hubiese ido. Tras retirarse de la escena competitiva la temporada pasada, la superestrella de la jungla de Cloud9 volvió para liderar la nueva alineación del equipo hasta un tercer puesto en el split de verano de la LCS NA 2016. Destacó entre todos los junglas de Norteamérica y acabó tercero en la liga, con 6,7 puntos de A/M/A durante la temporada regular. Pero no se conformó con eso: tras la decepcionante actuación en la final de Toronto de la LCS NA, ayudó a Cloud9 a hacerse con el último hueco para representar a Norteamérica en el Mundial, gracias a la victoria en el clasificatorio regional.</p>\n\n<p>Aunque puede que nunca más consiga un A/M/A de 12,7 puntos como hizo en la temporada 3, no cabe duda de que Meteos sigue siendo un jungla de gran calidad. Destaca en su estilo particular en la jungla, que da prioridad a farmear y a superar a sus oponentes, a la vez que interrumpe la jugada del jungla enemigo en los momentos clave. Aunque está bastante limitado a Gragas y Rek'Sai este año, que no os sorprenda si elige a Zac o a Vi más adelante. Si consigue pillar a su oponente por sorpresa, Meteos podría liderar a Cloud9 hacia la victoria en el Mundial. Lo que ha quedado claro es que Meteos ha vuelto para quedarse.</p>","es_AR":"<p>Pareciera que William \"Meteos\" Hartman nunca se hubiera ido. Después de apartarse de la escena competitiva la temporada pasada, el antiguo junglero superestrella de Cloud9 regresó para llevar a la nueva alineación del equipo a un tercer puesto en el torneo de clausura de la LCS NA 2016. Lideró la jungla norteamericana y consiguió el tercer lugar en la liga, con un KDA de 6.7 puntos durante la temporada regular. Sin embargo, no se detuvo allí. Después de un desalentador desempeño en la final de la LCS NA en Toronto, ayudó a Cloud9 a ganar el último boleto de Norteamérica al Mundial tras ganar la clasificatoria regional.</p>\n\n<p>Aunque quizás nunca vuelva a obtener un KDA de 12.7 puntos como lo hizo en la temporada 3, queda claro que Meteos sigue siendo un junglero de primer nivel. Se destaca con su particular estilo en la jungla, en el que prioriza el asesinato reiterado, procura superar a sus rivales en número y enfrenta al mismo tiempo al junglero enemigo en momentos decisivos. Aunque eligió a Gragas y Rek’Sai la mayor parte del año, no sería una sorpresa verlo escoger a Zac o Vi más adelante. Si atrapa a sus rivales con la guardia baja, Meteos podría llevar a Cloud9 a competir en el Mundial. Una cosa es segura, Meteos ha venido para quedarse.</p>","pt_BR":"<p>É quase como se William “Meteos” Hartman nunca sequer tivesse ido embora. Depois de deixar o cenário competitivo na última temporada, o ex-caçador surperestrela da Cloud9 voltou para liderar a nova composição da equipe pelo terceiro lugar na Etapa de Verão da NA LCS 2016.  Ele ficou na liderança entre todos os caçadores na NA e ficou em terceiro lugar na liga, com um AMA de 6,7 durante a temporada regular. Mas ele não parou aí. Após um desempenho decepcionante na Final da NA LCS em Toronto, ele ajudou a Cloud9 a conseguir a última vaga da América do Norte para o Mundial vencendo a Classificatória Regional.</p>\n\n<p>Apesar de talvez ele nunca mais alcançar um AMA de 12,7 de novo como fez na 3º Temporada, está claro que Meteos ainda é um caçador de elite. Ele se sobressai com seu estilo de jogo particular na selva, que parece priorizar seu acúmulo de recursos sobre seus oponentes, enquanto também contra-ataca o caçador adversário em momentos cruciais. Apesar de ele só ter jogado de Gragas e Rek’Sai este ano, não fique surpresa se ele decidir ir de Zac ou Vi em última hora. Se ele conseguir pegar seus oponentes desprevenidos, Meteos poderá liderar a Cloud9 em sua chance no Mundial. Mas uma coisa é certa: Meteos veio para ficar.</p>"},"foreignIds":{"drupalId":"329","TRLH1":"200000179","TRLH2":"200000083"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":115,"slug":"sneaky","name":"Sneaky","firstName":"Zachary ","lastName":"Scuderi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sneaky-3c359lbn.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:51.000Z","updatedAt":"2017-07-04T19:27:36.000Z","bios":{"en_US":"<p>The man, the meme, the legend. Zachary “Sneaky” Scuderi might be the class clown of the NA LCS, but his play is no joke. He’s consistently been a top ADC since he took the league by storm with Cloud9 in Season 3 with his meta-defying Ashe picks. During the 2016 NA LCS Summer Split, he led ADCs and was fourth overall in KDA with 6.3, and he also led ADCs with a 75.7% kill participation rate.</p>\n\n<p><i>“I’ve been getting a lot of memes, as of recent, about my laning phase. It doesn’t really mean anything. But there’s memes, and I could destroy them.” - Sneaky</i></p>\n\nSneaky put up a middling performance in lane and out of it at the 2016 World Championship before Cloud9 was eliminated. He brings a veteran presence to Cloud9’s retooled roster, looking to prove his detractors wrong. What memes will be destroyed or born in 2017? We’ll just have to wait and see.</p>","fr_FR":"<p>Zachary « Sneaky » Scuderi est l'un des carrys AD les plus mortels des LCS NA. Ne vous laissez\n\npar ses singeries, car Sneaky répond présent quand Cloud9 a besoin d'un exploit. Il est parvenu à obtenir \n\nun KDA de 7,2 lors du segment printanier des LCS NA 2015, le deuxième meilleur de la ligue, et il \n\ncontinue de voler de victoire en victoire depuis lors.</p>\n\n<p>L'ascension de Sneaky vers la célébrité a commencé pendant la Saison 3, quand sa décision de choisir \n\nAshe contre la logique de la metagame a propulsé Cloud9 au sommet du classement des LCS NA. Depuis, \n\nSneaky est devenu un fantastique carry AD polyvalent. Il joue désormais admirablement Corki, Tristana \n\net Lucian, et il empoche régulièrement les ratios KDA les plus élevés des LCS NA. Il est probablement le \n\njoueur professionnel de LoL qui propage le plus de memes usés jusqu'à la corde. « Same ».</p>","pl_PL":"<p>Gdyby zorganizować konkurs na najbardziej niedocenianego gracza w NA LCS Sneaky miałby bardzo dużą szansę, by zgarnąć trofeum. Na najwyższym poziomie gra już od ponad dwóch lat, ale nigdy nie dorównywał popularnością Doubleliftowi czy chociażby Wild Turtle’owi. Nie zmienia to faktu, że jest doskonałym strzelcem, być może najlepszym w Ameryce.</p>\n<p>\nSneaky jak niemal każdy zawodnik zaczynał w niewielkich organizacjach. Pierwszym przystankiem na jego drodze na szczyt był zespół Ordinance Gaming, w którym w 2012 roku pełnił rolę… mid-lanera i gdzie spotkał m.in. Roberta „RobertaXLee” Lee. Później przyszedł czas na zmianę pozycji – środkową aleję Sneaky zamienił na pozycję strzelca, w której to roli rozpoczął przygody z Absolute Legends NA oraz Pulse Esports. Dobra postawa Sneaky’ego nie umknęła większym organizacjom i lutym 2013 roku Zachary dołączył do Teamu Dignitas, ale spędził tam tylko pół roku. Pojawiła się oferta z Quantic Gaming, późniejszego Cloud9, którą zaakceptował.</p>\n<p>\nSzybko okazało się, że była to znakomita decyzja. Sneaky wraz z kolegami dwukrotnie sięgał po trofeum dla najlepszego zespołu w NA LCS i dwukrotnie zajmował w tych rozgrywkach drugie miejsce. Początkowo Zachary preferował strzelców, którzy posiadali efekty kontroli tłumu, bo tego wymagała od niego taktyka zespołu. Jego flagową bohaterką stała się w tym czasie Ashe. Co jednak oczywiste, grając tym typem czempionów nie mógł pokazać pełni swoich możliwość. Zmieniło się to wraz z modyfikacją strategii drużyny, która w 2014 roku postanowiła odciążyć nieco Haia „Haia” Lama na środkowej alei i bardziej skupić się na dolnej alei, gdzie potencjał do prowadzenia gier miał właśnie Sneaky. Kiedy po wielkich sukcesach, przyszedł mniej udany okres, Sneaky był tak naprawdę jedynym zawodnikiem C9, który nigdy nie zawodził i nierzadko to właśnie jego fenomenalna postawa i znakomite umiejętności mechaniczne pozwalały Cloud9 wygrywać gry. W wiosennym splicie 2015 Zachary miał najwyższe KDA (7,2), zadał najwięcej procentowych obrażeń (33,9%) i ginął najrzadziej spośród wszystkich zawodników NA LCS (25 śmierci). Co prawda amerykański strzelec miał nieznacznie gorszy letni split 2015, ale to nadal jest zawodnik, na którego C9 zawsze może liczyć.</p>\n<p>\nSneaky nigdy nie wygrał jednak głosowanie na najlepszego ADC w Ameryce, a w plebiscycie z listopada 2015 roku zajął drugie miejsce z wynikiem 20,3%, tracąc do zwycięzcy, Yilanga „Doublelifta” Penga, aż 32,5% głosów.</p>\n<p>\nW trakcie swojej kariery najbardziej wsławić się grą Ezrealem, Gravesem i Corkim. Ciężko też nie zauważyć sentymentu dla Ashe, bowiem Sneaky był jednym z dwóch ADC w Ameryce, który zdecydował się na kilkukrotny wybór tej bohaterki w meczach NA LCS po jej reworku. Co ciekawe, Sneaky jest… daltonistą, co sprawia, że nie potrafi odróżniać pewnych (nie wszystkich) kolorów. Na początku swojej kariery posługiwał się nickiem „SnEaKyCaStRoO”, ale zmienił go natychmiast, gdy dowiedział się, co znaczy to wyrażenie.\n</p>","de_DE":"Der Mann, das Meme, die Legende. Zachary „Sneaky“ Scuderi ist zwar der Klassenclown der NA LCS, aber wenn er spielt, ist Schluss mit lustig. Seit er durch seine Leistungen mit Ashe das Metaspiel veränderte und die Liga im Sturm eroberte, gehört Sneaky, der in Saison 3 bei Cloud9 unterschrieb, zu den besten ADCs. Beim Sommer-Split der NA LCS 2016 führte er die ADCs mit einer Tötungsbeteiligung von 75,7 % an und landete mit einer TTU (KDA) von 6,3 auf dem vierten Platz aller Spieler.</p>\n\n„Ich bekomme in letzter Zeit jede Menge Memes, die sich auf meine Anfangsphase beziehen. Das hat eigentlich nichts zu bedeuten. Aber es gibt sie und ich könnte sie zerstören.“ – Sneaky\n</p>\nSneaky hat bei der Weltmeisterschaft 2016 in der Lane und abseits davon nur eine mittelmäßige Leistung abgeliefert, bis Cloud9 ausgeschieden ist. Er wird seine Erfahrung in die Aufstellung von Cloud9 einbringen und versuchen, seine Kritiker Lügen zu strafen. Welche Memes werden 2017 wohl zerstört werden und welche neuen werden entstehen? Die Zeit wird es zeigen.\n","es_ES":"<p>El hombre, el meme, la leyenda. Zachary ''Sneaky'' Scuderi puede que sea el payaso de la clase de la LCS NA, pero sus jugadas no son un chiste. No ha dejado de ser un ADC de primera desde que llegó a la liga pisando fuerte con Cloud9 en la temporada 3, cuando seleccionaba a Ashe en contra de la lógica del metajuego. Durante el split de verano de la LCS NA 2016, destacó entre los ADC y quedó en cuarto lugar con una A/M/A de 6,3 puntos. También destacó entre ellos por su 75,7 % de participación en asesinatos.</p>\n\n<p>''Últimamente han hecho muchos memes de mí, por mi fase de calles. No significa nada para mí en realidad. Pero los memes están ahí, y yo podría destruirlos''.</p>\n\n<p>Sneaky ha tenido que soportar críticas por sus jugadas en la fase de calles, pero su tendencia a los pentakills a final de partida camufla cualquier fallo del principio. Destaca con campeones ADC de utilidad como Ashe y Sivir, y su Jhin es temido universalmente, lo que ha suscitado que lo bloqueen o que lo seleccionen el primero durante los playoffs. Intentará demostrar que sus detractores se equivocaban consiguiendo un pentakill en el escenario internacional, destruyendo algunos memes y, quizás, si tenemos suerte, creando otros nuevos.</p>","pt_BR":"<p>O homem, o meme, a lenda. Zachary “Sneaky” Scuderi pode ser o palhaço da turma na NA LCS, mas suas jogadas não são nenhuma piada. Ele tem sido consistentemente um dos melhores atiradores desde que saiu destruindo com a Cloud9 na 3º Temporada com suas escolhas de Ashe que desafiavam as leis do meta. Durante a Etapa de Verão da NA LCS 2016, ele esteve na liderança entre os atiradores e ficou em quarto lugar geral com um AMA de 6,3 e também ficou entre os primeiros em participação em abates com 75,7%.</p>\n\n<p>“Tenho ouvido muitas piadas sobre minha fase de rotas recentemente. Eu não as levo a sério e sei que posso destruí-las” - Sneaky</p>\n\n<p>Sneaky já recebeu muitas críticas por seu estilo de jogo na fase de rotas, mas sua propensão a Pentakills no fim de jogo compensa qualquer começo ruim. Ele se sobressai em atiradores de utilidade como Ashe e Sivir, e seu Jhin é universalmente temido, levando a ser banido ou escolhido em primeiro durante as eliminatórias. Ele fará de tudo para desmentir seus difamadores indo atrás do Pentakill no palco internacional, destruindo alguns memes e quem sabe (se tivermos sorte) criando alguns novos.</p>","es_AR":"<p>El hombre, el meme, la legenda. Zachary \"Sneaky\" Scuderi es quien hace reír a todos con sus bromas en la LCS NA, pero su juego no es ningún chiste. Ha sido uno de los mejores tiradores desde que sacudió la liga entera con Cloud9 en la temporada 3 jugando con su revolucionaria Ashe. Durante el torneo de clausura de la LCS NA 2016, jugó de tirador y quedó en cuarto lugar con 6.3 puntos de KDA. Además, logró un 75.7% de participación en asesinatos como tirador.</p>\n\n<p><i>\"Me han hecho muchos memes recientemente sobre mi etapa en los carriles. En realidad eso no quiere decir nada. Pero hay memes, y puedo destruirlos\".</i></p>\n\n<p>Sneaky ha soportado críticas por su juego en la fase de carriles, pero su tendencia a lograr pentakills en las últimas partes de los combates compensa los errores al comienzo. Se destaca con tiradores de utilidad como Ashe y Sivir, y su juego con Jhin es temido por todos, ya que logra bloqueos y primeras selecciones durante las eliminatorias. Buscará demostrar a sus detractores que estaban equivocados logrando un pentakill en el escenario internacional, destruyendo algunos memes y, quizás (si tenemos suerte), hasta creando algunos nuevos.</p>"},"foreignIds":{"drupalId":"331","TRLH1":"200000175","TRLH2":"200000079","TRLH3":"200000339"},"socialNetworks":{"twitch":"https://twitch.tv/c9sneaky","facebook":"https://facebook.com/c9sneaky","twitter":"https://twitter.com/c9sneaky"},"champions":[],"liveGameTeam":18},{"id":163,"slug":"bunny-fufuu","name":"Bunny FuFuu","firstName":"Michael","lastName":"Kurylo","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bunny-fufuu-b4cl3hl3.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-25T17:02:59.000Z","bios":{"en_US":"<p>\nKnown for his Thresh picks, Michael “Bunny Fufuu” Kurylo is a long time support player in the NA scene. Bunny Fufuu originally played support for Curse during the 2014 NA LCS Spring Split before moving to Curse Academy, which later rebranded as Gravity. The move served both him and Gravity well, with his skills in the bot lane steadily improving until he was regarded as one of the best supports in North America.\n</p>\n<p>\nBunny Fufuu's impact in the bot lane caught the attention of more than a few teams, and he was scooped up by Cloud9 in the 2015 offseason.\n</p>\n<p>\nLearn more about Bunny FuFuu's journey in the competitive scene in his <a href=\"https://www.youtube.com/watch?v=G0uDn46IUxE\" target=\"_blank\">Drive episode</a>.\n</p>","fr_FR":"<p>Support bien connu sur la scène nord-américaine, Michael « Bunny Fufuu » est réputé pour son Thresh. \n\nBunny Fufuu jouait à l'origine support pour Curse, lors du segment printanier des LCS NA 2014, avant de \n\npasser chez Curse Academy, qui a ensuite changé de nom pour devenir Gravity. Ce changement a été \n\nfructueux pour lui comme pour Gravity, et ses compétences sur la voie du bas se sont constamment \n\naméliorées jusqu'à ce qu'il soit considéré comme l'un des meilleurs supports d'Amérique du Nord.</p>\n\n<p>L'impact de Bunny Fufuu sur la voie du bas a attiré l'attention de plusieurs équipes et il a fini par être \n\nrecruté par Cloud9 durant l'intersaison 2015. Il travaille en étroite collaboration avec Hai, qui est sans \n\ndoute l'un des meilleurs meneurs nord-américains, avec qui il partage le poste de support chez C9. \n\nProfitant des conseils stratégiques de LemonNation et d'un puissant partenaire en la personne de \n\nSneaky, Bunny Fufuu continuera forcément de faire forte impression lors des LCS NA. </p>\n\n<p>Pour en savoir plus sur le parcours de Bunny Fufuu sur la scène compétitive, regardez l'épisode de Drive \n\nqui lui est consacré.</p>","pl_PL":"<p>Michael Kurylo przedstawił się szerszej publiczności w 2014 roku, kiedy to zasłynął w amerykańskim SoloQ nieprawdopodobną grą Threshem.</p>\n<p> \nVideo: https://www.youtube.com/watch?v=KVIj1t5duP8</p>\n<p>\nNa półprofesjonalnej scenie swoich sił próbował już wcześniej w mniej znanych formacjach, ale to właśnie sezon 2014 okazał się przełomowy. Co prawda w składzie Curse utalentowanemu wspierającemu nie udało się zaistnieć. Najpierw rywalizował z Georgem „Zekentem” Liu i Brandonem „Saintviciousem” DiMarco w szalonym wiosennym splicie 2014. Ciekawostką jest fakt, że Michael występował wtedy w LCS i jednocześnie… uczęszczał do szkoły. Później do zespołu dołączył wyrzucony z TSM-u Alex „Xpecial” Chu. Obydwaj zawodnicy rywalizowali o miejsce w składzie formacji, ale ostatecznie, pomimo pozytywnych recenzji, jakie BunnyFuFuu otrzymał za wiosenne występy, to były gracz TSM-u wygrał ten pojedynek. </p>\n<p>\nNiemniej kariera Michaela potoczyła się w myśl przysłowia „co się odwlecze, to nie uciecze”. BunnyFuFuu dołączył do występującego w NA Challenger Series Curse Academy i to właśnie wokół niego przebudowana została drużyna. </p>\n<p>\n- W ciągu roku BunnyFuFuu będzie lepszy od Xpeciala – powiedział jednak w sierpniu 2014 roku legendarny amerykański dżungler Saintvicious, który występował z Bunny’m w CA.</p>\n<p>\nCurse Academy udało się zebrać naprawdę silny skład i zespół był jednym z faworytów do awansu do LCS. Początki były trudne, ale ostatecznie cel udało się spełnić od razu w pierwszym splicie. Michael i jego koledzy z drużyny byli zmuszeni zmienić organizację i do wiosennej edycji rozgrywek 2015 przystąpili pod banderą Gravity.</p>\n<p>\nZespół zaskoczył znakomitym startem w wiosennym splicie 2015, a BunnyFuFuu, zgodnie z oczekiwaniami, był jednym z filarów zespołu. Ostatecznie drużyna zadomowiła się w środku tabeli i to był na tamten moment szczyt możliwości Michaela i jego kolegów. W przerwie między splitami zmienił się jednak partner Bunny’ego na dolnej alei – Davida „Copa” Robertsona zastąpił obiecujący Johny „Altec” Ru. W związku z tą rotacją uwaga drużyny skupiła się głównie na dolnej alei, gdzie duet młokosów radził sobie fenomenalnie, prowadząc zespół do walki o najwyższe lokaty. Gravity przez moment było nawet liderem rozgrywek, ale ostatecznie skończyło letnią edycję na czwartej pozycji i szybko odpadło w play-offach.</p>\n<p>\nBunnyFuFuu nadal słynie z nieprawdopodobnej gry Threshem, ale w ciągu ostatniego roku jego champion pool znacznie się rozszerzył – amerykański wspierający niemal równie chętnie sięgał po Shena, Alistara, Jannę czy Brauma. Ewidentnie ma jednak tendencję do gry wytrzymałymi wspierającymi. W letnim splicie 2015 BunnyFuFuu był czwartym najczęściej asystującym zawodnikiem w NA LCS. Tę samą lokatę zajął w klasyfikacji supportów obejmującej KDA. Był również drugim najczęściej wardującym graczem w amerykańskich rozgrywkach. Co ciekawe, nick Michaela początkowo miał brzmieć „BunnyFuFu”, ale był on zajęty, wobec czego gracz zdecydował się po prostu dodać drugie „u” i tak powstał obecny pseudonim.</p>\n<p>\nW przerwie przed sezonem 2016 wspierający dołączył do Cloud9, gdzie ma pełnić rolę supporta wymiennie z Haiem „Haiem” Lamem.\n</p>"},"foreignIds":{"drupalId":"1341","TRLH1":"1001220059","TRLH2":"1001160109"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":166,"slug":"xpecial","name":"Xpecial","firstName":"Alex","lastName":"Chu","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xpecial-9ypha40d.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:06.000Z","updatedAt":"2017-07-04T19:15:01.000Z","bios":{"en_US":"<p>Alex \"Xpecial\" Chu attended the first three World Championships (an honor only belonging to five players total) and he’s played on some of the biggest teams in North American: TSM and Liquid. After a short hiatus from League, Xpecial decided that Apex was the right home for him. He rolled up his sleeves and punched his way back into the NA LCS.</p>\n\n<p>After his return to the NA LCS, Xpecial still has more to prove. He specializes in getting in the enemies grill with tanky supports and not relenting 'til they see grey. He will headbutt, pulverize combo anyone who tries to dive his ADC. Believe that.</p>","fr_FR":"<p>On dit souvent de lui que c'est le meilleur support jamais formé en Amérique du Nord. Et quand on regarde l'historique d'Alex « Xpecial » Chu, on comprend aisément pourquoi. Membre de Team SoloMid, c'est l'un des cinq joueurs à avoir participé aux trois premiers Championnats du monde. Et en 2015, son envie de revenir sur cette scène était évidente. Team Liquid a fait plus d'effort que jamais pour rejoindre l'élite des joueurs d'Amérique du Nord.\n</p>\n<p>\nXpecial et Piglet ont été particulièrement zélés dans leurs entraînements et ils sont lentement parvenus à fondre leurs styles de jeu respectifs en une force impossible à arrêter. Ce duo est l'un des plus impressionnants sur la voie du bas des LCS NA. Il ne reste plus à Xpecial et à Piglet qu'à prouver leur talent sur la scène internationale.\n</p>","pl_PL":"<p>\nAlex „Xpecial” Chu nazywany jest często najlepszym graczem wsparcia w Ameryce Północnej. Patrząc na jego dokonania, nietrudno zgadnąć dlaczego. Jako członek Team SoloMid był jednym z pięciu graczy, którzy uczestniczyli we wszystkich trzech turniejach mistrzostw świata. W roku 2015 pragnienie powrotu do gry jest w jego przypadku ewidentne. Team Liquid dało jak dotąd z siebie wszystko, by dołączyć do północnoamerykańskiej elity.\n</p>\n<p>\nXpecial i Piglet trenowali szczególnie intensywnie, stopniowo wypracowując wspólny styl gry, aż stali się niepowstrzymaną siłą. Duet ten jest jednym z najgroźniejszych, jakie można spotkać w dolnej alei podczas północnoamerykańskiego LCS. Teraz Xpecial i Piglet muszą tylko dowieść swych umiejętności na arenie międzynarodowej.\n</p>","de_DE":"Alex „Xpecial“ Chu war bei den ersten drei Weltmeisterschaften dabei (eine Ehre, die insgesamt nur fünf Spielern zuteilwurde) und hat bei zwei der größten Mannschaften Nordamerikas gespielt: TSM und Liquid. Nach einer kurzen Auszeit von League entschied sich Xpecial, dass Apex das richte Zuhause für ihn ist. Er krempelte die Ärmel hoch und kämpfte sich in die NA LCS zurück.\n</p>\nNach seinem ersten Split in der NA LCS muss Xpecial immer noch einiges beweisen. Er hat eine neue Mannschaft und seine Mitspieler werden sich auf seine Führungsqualitäten und seine Erfahrungen als Ansager verlassen, während sie versuchen, der LCS ihren Stempel aufzudrücken. Er ist darauf spezialisiert, mit robusten Supportern in die gegnerische Mannschaft zu stürmen und erst dann wieder locker zu lassen, wenn für seine Gegner das Licht ausgegangen ist. Er wird jedem einen Kopfstoß verpassen und pulverisieren, der seinem neuen Partner auf der Lane, LOD, zu nahe kommt. Das kannst du ruhig glauben.\n"},"foreignIds":{"drupalId":"12","TRLH1":"200000196","TRLH2":"200000100","TRLH3":"200000347"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":220},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":346,"slug":"ryu","name":"Ryu","firstName":"Sang Wook","lastName":"Yoo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ryu-excuz1pn.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:21:46.000Z","bios":{"en_US":"<p>Sang Wook \"Ryu\" Yoo's resolve is unshakeable. Ever the stoic, you won't see Ryu show much emotion in victory or defeat. His career began in the LCK, where he battled legends like Faker and Pawn as a member of KT Rolster Bullets. He then made his way to the EU LCS to join H2K, where he made two trips to Worlds, culminating in a semifinal defeat to Samsung Galaxy at the 2016 World Championship.</p>\n\n<p>Ryu brought his legendary poker face to Phoenix1, where he continued using his mind games to trick opposing mid laners into bad decisions. With such an aggressive jungler like Inori, Ryu's mid lane is sure to be the scene of many highlight plays in 2017. Just don't expect Ryu to look too excited about them.</p>","fr_FR":"<p>Sang-ook « Ryu » Yoo est un joueur expérimenté qui a affronté les plus grands midlaners coréens lorsqu’il évoluait chez KT Rolster Bullets. En 2013, Ryu et ses coéquipiers parviennent à se hisser jusqu’en finale du championnat coréen The Champions après avoir éliminé les deux équipes de CJ Entus et retrouvent SK Telecom T1 en finale. Au terme d’un match disputé, les deux formations doivent jouer la 5e et dernière partie en mode aveugle. Ryu et son opposant direct Sang-hyeok « Faker » Lee se livrent alors à un duel de Zed qui restera dans les annales quand ce dernier retourne totalement la situation grâce à des mécaniques de jeu exceptionnelles. Triste perdant de cet affrontement, Ryu affiche pourtant un visage impassible qui suscite la curiosité des fans et devient caractéristique du midlaner.</p>\n\n<p>Pendant la saison d’hiver 2013-2014, Ryu et son équipe continuent à montrer un bon niveau de jeu mais tombent en demi-finale contre une équipe SKT T1 K encore plus féroce que jamais et doivent se contenter de la 3e place des play-offs. Les saisons suivantes sont de plus en plus difficiles pour Ryu et son équipe. Il tente alors un court retour au poste de jungler, qui n’est pas concluant. Pour la première fois, KT Rolster Bullets n’accède pas aux play-offs. Il décide alors de tenter une nouvelle expérience. Fort d’une victoire aux IEM World qui se déroulaient en Pologne, il est attiré par l’Europe et rejoint Millenium avec l’intention de se qualifier aux LCS. Malheureusement, l’équipe échoue et Ryu tente de trouver sa place chez ROCCAT lors des IEM Cologne. Finalement, c’est H2K qui lui propose de jouer en LCS, suite au départ de Fabian « Febiven » Diepstraten.</p>\n\n<p>Cette nouvelle équipe libère totalement le Coréen, que l’on revoit très à l’aise avec ses champions de prédilection comme Ahri et LeBlanc, qui sont ses champions les plus joués lors de la saison printanière des LCS EU. Plus le temps passe et plus Ryu gagne en confiance. Il montre qu’il est capable de prouesses avec de très nombreux champions et sait se déplacer sur la carte comme personne. Toujours présent au bon endroit au bon moment, il opère en silence mais se trouve être très efficace, ce qui permet à son équipe d’atteindre la 3e place des play-offs à deux reprises et de se qualifier au mondial 2015 !</p>\n\n<p>Comme le hasard fait bien les choses, Ryu retrouve Faker dans son groupe C. Pas de Zed contre Zed cette fois-ci, mais un Ryu déterminé à prendre sa revanche et qui parvient à mettre son adversaire en difficulté. Ces efforts ne sont cependant pas suffisants et H2K quitte la compétition prématurément.</p>\n\n<p>En vue de la saison 2016, H2K fait peau neuve et recrute certains des meilleurs joueurs européens, ce qui devrait aider Ryu à transcender et qui sait, de peut-être un jour l’emporter face à son adversaire de toujours.</p>","pl_PL":"<p>Ryu to żywa legenda koreańskiej sceny, która w ostatnim czasie zbudowała sobie bardzo dobrą reputację także na Zachodzie, choć jego początki na Starym Kontynencie z pewnością nie należały do łatwych. Kariera Koreańczyka w ogóle obfitowała we wspaniałe wzloty i spektakularne upadki.</p>\n\n<p>Ryu w koreańskich rozgrywkach debiutował jeszcze w marcu 2012 roku, występując w obiecującej formacji StarTale wraz z chociażby Go „Scorem” Dong-binem czy Wonem „Mafą” Sang-yeonem. Niezłe występy w rodzimym OGN i ćwierćfinał letniego splitu 2012 nie umknęły uwadze silniejszych formacji i Ryu razem ze wspomnianymi zawodnikami przenieśli się do KT Rolster Bullets. To właśnie w tym zespole koreański mid-laner zasłynął jako jeden z najlepszych graczy w kraju. Z KT zdobywał trzecie miejsce w zimie 2012/2013 i drugie w lecie 2013 roku. </p>\n\n<p>Warto jednak wspomnieć o zdarzeniu z finału letniej edycji OGN 2013, które położyło cień na całą karierę Ryu. To właśnie wtedy, w piątym, decydującym starciu tego spotkania, miał miejsce pojedynek pomiędzy Ryu a Lee „Fakerem” Sang-hyeokiem. Obydwaj zawodnicy grali Zedem, a niesamowity wyczyn Fakera, który niemal ośmieszył swojego vis-a-vis, stał się jedną z najbardziej znanych akcji w historii League of Legends. Po takim czymś ciężko było się pozbierać, tym bardziej, że KT Rolster nie pojechało nawet na MŚ, w kluczowym meczu po raz kolejny przegrywając z SKT T1 Fakera, późniejszymi triumfatorami MŚ. Ryu i jego KT udało się podnieść jeszcze raz i stanąć na najniższym stopniu podium zimowego turnieju 2013/2014, ale potem przyszedł nieudany wiosenny split. Zespół poszukiwał nowych rozwiązań i w konsekwencji Ryu z mid-lanera stał się dżunglerem. Wiosenna edycja zmagań była jednak tragiczna w wykonaniu formacji, a Koreańczyk dał się poznać jako jeden z najgorszych leśników w stawce. Wskutek tego, po niemal dwóch latach, Ryu pożegnał się z KT i zdecydował się spróbować swoich sił w Europie.</p>\n\n<p>Zawodnikowi, który słabo znał w tym czasie angielski było bardzo ciężko odnaleźć się na Starym Kontynencie. Dołączenie, wraz z rodakiem Cho „H0R0” Jae-hwanem, do Millenium okazało się katastrofą – zespół wydawał się pewniakiem do awansu do EU LCS z Expansion Tournamentu, tymczasem całkowicie zawiódł, odpadając już w ćwierćfinale. Ryu próbował swoich sił także w Teamie ROCCAT, ale po nieudanym IEM-ie w Kolonii zespół ten zdecydował się na Erlenda „Nukeducka” Holma.</p>\n\n<p>Wydawało się, że to koniec kariery Ryu, ale wtedy pomocną dłoń wyciągnęło do niego występujące w LCS H2k, które poszukiwało w trybie przyspieszonym zastępstwa za Fabiana „Febivena” Diepstratena, który zdecydował się odejść do Fnatic. Pierwsze kilka tygodni było w wykonaniu Ryu dość przeciętnych, ale Koreańczyk szybko odwdzięczył się za zaufanie i z każdym występem spisywał się lepiej. Pod koniec wiosennego splitu i przez całą letnią edycję rozgrywek należał już do najlepszych mid-lanerów w stawce i miał swój udział w dwukrotnym wywalczeniu przez H2k trzeciego miejsca w EU LCS. Dodatkowo, co nigdy nie udało mu się, gdy występował w Korei – Ryu wywalczył awans na Mistrzostwa Świata, chociaż jego przygoda ze światowym czempionatem trwała tylko sześć spotkań w fazie grupowej. Mid-laner zdecydował się zostać w H2k na wiosenny split 2016 i powalczyć o najwyższe cele wraz z przebudowaną drużyną.</p>\n\n<p>Ryu zasłynął w Korei, a potem także w Europie przede wszystkim grą Ahri oraz Orianną, ale także jego Fizz zasługuje na respekt. Co ciekawe, jego nick to prostu… nazwisko gracza. Ponadto w letnim splicie EU LCS 2015 Ryu był trzecim najczęściej zabijającym i czwartym najczęściej asystującym mid-lanerem w stawce.</p>\n","de_DE":"Sang Wook „Ryu“ Yoos Entschlossenheit ist unerschütterlich. Er war schon immer ein Stoiker, weshalb er weder bei Sieg noch Niederlage große Emotionen zeigt. Seine Karriere startete er in der LCK, wo er sich als Mitglied von KT Rolster Bullets mit Legenden wie Faker und PawN duellierte. Anschließend verschlug es ihn in die EU LCS zu H2K, mit denen er sich zweimal den Weg zur Weltmeisterschaft sichern konnte. Der Höhepunkt war die Halbfinalniederlage gegen Samsung Galaxy bei der Weltmeisterschaft 2016.\n<p>\nRyu verstärkt jetzt Phoenix1 mit seinem legendären Pokerface, wo er mit seinen Psychospielchen erneut versuchen wird, gegnerische Mid-Laner zu schlechten Entscheidungen zu verleiten. Mit einem aggressiven Jungler wie Inori können wir 2017 mit einigen Höhepunkten auf Ryus mittlerer Lane rechnen. Erwarte von Ryu nur nicht, dass er sich zu sehr darüber freuen wird.\n","es_ES":"<p>Miembro de KT Rolster Bullets en 2013, hubo un tiempo en el que Sang-Wook ''Ryu'' Yoo se enfrentaba, y solía ganar, a los mejores jugadores de la calle central del mundo, incluso a Faker o a PawN. Cuando el equipo comenzó a perder sus esplendor, el apetito de Ryu por tener una trayectoria profesional en Corea se fue apagando. Se embarcó en un viaje al extranjero y encontró una nueva vida en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se ha basado en dos factores principales: su imponente mirada y sus juegos mentales. La cara de póquer de Ryu no desvela nada y es experto en engañar a los oponentes para que tomen decisiones equivocadas. Se siente igual de cómodo superando a su rival en número de súbditos asesinados como asesinando a oponentes que no se lo esperan. Con su billete de avión listo para el Mundial, Ryu tiene la oportunidad de demostrar que es uno de los mejores jugadores de la calle central de Europa.</p>","pt_BR":"<p>Originalmente um membro da KT Rolster Bullets em 2013, houve um tempo em que Sang-wook \"Ryu\" Yoo lutava, e muitas vezes ganhava, contra alguns dos melhores meios do mundo, incluindo Faker e Pawn.  Mas conforme a chama da equipe diminuía, diminuía também o apetite de Ryu por uma careira na Coreia. Ele embarcou em uma jornada mundo afora e encontrou uma nova vida na EU LCS como líder veterano da H2K.</p>\n\n<p>A reputação de Ryu na EU LCS é baseada em dois principais fatores: seu olhar penetrante e seus jogos mentais. A total pokerface do Ryu não entrega nada sobre seu jogo e ele é especialista em enganar seus oponentes e guiá-los a decisões erradas. Ele fica tão confortável em acumular recursos quanto em assassinar oponentes desprevenidos. Com seu ingresso para o Mundial já na mão, Ryu terá uma chance de mostrar por que ele é um dos melhores meios da Europa. Vamos só esperar que eles esteja do lado certo das contra-jogadas.</p>","es_AR":"<p>Como miembro original de KT Rolster Bullets en el 2013, hubo un tiempo en que Sang-Wook \"Ryu\" Yoo luchaba (y casi siempre ganaba) contra algunos de los mejores carrileros centrales del mundo, incluido Faker y Pawn. A medida que el equipo perdía brillo, a Ryu se le iban las ganas de hacer carrera en Corea. Se embarcó en un viaje y encontró nuevas emociones en la LCS EU como líder veterano de H2K.</p>\n\n<p>La reputación de Ryu en la LCS EU se basó en dos factores principales: su mirada fija y su presión psicológica. La cara de póquer de Ryu no revela nada, y es un experto engañando a sus oponentes para hacerlos tomar malas decisiones. Le encanta tanto acumular oro como asesinar rivales desprevenidos. Con su boleto al Mundial en mano, Ryu tiene una oportunidad de demostrar por qué es uno de los mejores carrileros centrales de Europa. Esperemos que le salgan sus jugadas.</p>"},"foreignIds":{"drupalId":"2162","TRLH2":"200000138","TRLH1":"200000234","TRLH3":"200000345"},"socialNetworks":{"twitter":"https://twitter.com/H2kryu","twitch":"http://www.twitch.tv/yoosangwook"},"champions":[],"liveGameTeam":220},{"id":482,"slug":"incarnati0n","name":"Jensen","firstName":"Nicolaj","lastName":"Jensen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/incarnati0n-e5bzh5bb.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2015-05-15T18:24:28.000Z","updatedAt":"2017-07-04T19:27:23.000Z","bios":{"en_US":"<p>Nicolaj “Jensen” Jensen is out to prove there’s more than one great Danish mid laner in the NA LCS. After initially struggling when he joined Cloud9 in 2015 to replace departing Hai, he’s done more than just gain his footing: he’s become one of the most dangerous mid laners in the league. During the 2016 NA LCS Summer Split, he led the league in kills with 207 and set a new LCS record with 20 kills in a single game in the playoffs.</p>\n\n<p>Like the rest of Cloud9, Jensen was unsatisfied with the team’s performance at Worlds. Joining a retooled roster for 2017, he had to build synergy with his new jungler, Contractz. A strong season for Jensen and Cloud9 was unfortunately capped by a crushing defeat to TSM in the 2017 NA LCS Spring Split finals. With a clean slate for summer, Jensen will be looking to body fools on his way to the 2017 World Championship. </p>","fr_FR":"<p>Nicolaj « Jensen » Jensen est un mid laner danois de haut niveau, connu pour préférer des assassins \n\ncomme Zed et Fizz. Jensen a commencé sa carrière e-sportive avec Team Solo Mebdi en 2012, lors des \n\nqualifications pour les LCS EU de la Saison 3. Cependant, l'équipe a été disqualifiée du tournoi et s'est \n\nséparée au début de l'année 2013.</p>\n\n<p>Jensen est revenu à la compétition en 2015 quand Cloud9 l'a choisi pour remplacer son mid laner sur le \n\ndépart, Hai. Au début, Jensen a eu du mal dans le nouvel environnement des LCS NA, mais son KDA s'est \n\namélioré considérablement au fur et à mesure qu'il s'habituait au style de jeu de l'équipe et à la scène \n\ndes LCS NA. Jensen a terminé son premier segment professionnel en participant au mondial 2015, au \n\ncours duquel Cloud9 a été éliminée dès la phase de groupe.</p>","pl_PL":"<p>Nikolaj Jensen, bardziej znany jako Incarnati0n, to jedna z najbardziej kontrowersyjnych postaci na profesjonalnej scenie. Głośno o Duńczyku po raz pierwszy zrobiło się w 2012 roku, przed eliminacjami do pierwszego splitu EU LCS w historii. Incarnati0n całkowicie zdominował w tym czasie europejskie SoloQ i jego drużyna była jednym z faworytów do zdobycia miejsca w elitarnych rozgrywkach. Kilka dni przed zawodami sceną wstrząsnęła jednak zaskakująca wiadomość – Incarnati0n (znany wtedy pod pseudonimem Veigodx), a także jego kolega z zespołu Simon „Rayt3rch” Näslund zostali ukarani dożywotnią dyskwalifikacją, a ich formacja (Team Solo Mebdi) wykluczona z turnieju.</p>\n<p>\nSzybko na jaw wyszły na jaw powody tej decyzji. Nikolaj zbudował sobie rozległą kartotekę związaną z łamaniem Kodeksu Przywoływacza. Kara nie sprawiła jednak, że Incarnati0n porzucił League of Legends. Duńczyk tworzył kolejne konta, które były co jakiś czas eliminowane: Vizikodex, Quas0, Suq, Reversio, Apdo Dog2 czy najbardziej znane Wizikx. Mid-laner niejednokrotnie udowadniał ogromną skalę talentu, regularnie dostając się na najwyższe lokaty w europejskim SoloQ. W końcu, po niemal dwóch latach trwania tego procederu, w 2014 roku, Riot zobaczył znaczącą poprawę w postępowaniu gracza i pozwolił mu na pracę z SK Gaming w roli trenera. Niemniej, biorąc pod uwagę powody dyskwalifikacji Duńczyka, Riot pozostawał nieugięty, jeśli chodzi o występy Incarnati0na jako gracza. </p>\n<p>\nTymczasem SK Gaming, od czasu zatrudnienia Nikolaja, odnotowało niesamowity postęp i wygrało fazę zasadniczą wiosennego splitu 2014, zajmując też drugą pozycję w play-offach i trzecią na koniec letniej edycji. Formacji udało się też pojechać na Mistrzostwa Świata. Ogromny progres był widoczny w postawie mid-lanera drużyny Jesse’ego „Jesiza” Le. Wszystko wskazuje na to, że Duńczyk fantastycznie odnalazł się w nowej roli. Nie ulega jednak wątpliwości, że to rozwiązanie go nie satysfakcjonowało – chciał grać.</p>\n<p>\nIncarnati0n skupił się więc na swojej karierze jako zawodnika. Mid-laner potrzebował jeszcze dwóch podejść do aktualizacji jego sprawy. Dopiero w maju 2015 roku przekonał Riot co do swojej przemiany i został dopuszczony do gry na najwyższym poziomie. Ta sprawa podzieliła społeczność na zwolenników drugiej szansy dla utalentowanego zawodnika i przeciwników tej decyzji, wskazujących na skrajnie toksyczną przeszłość. Ostatecznie jednak nie miało to większego znaczenia, bo decyzja była wiążąca i po Duńczyka zgłosiła się chmara chętnych. Od początku faworytem w wyścigu po podpis Incarnati0na było jednak Cloud9 i to właśnie tam trafił obiecujący gracz.</p>\n<p>\n„W dziesięciostopniowej skali, przyjmując za 10 Fakera, myślę, żę Bjergsen i Incarnati0n są prawdopodobnie około ósemki. Pozostali mid-lanerzy z NA LCS oscylują w większości w przedziale 6-7.” – powiedział William „Scarra” Li przed startem splitu, stawiając Incarnati0na obok Bjergsena.</p>\n<p>\nPoczątki nie były jednak łatwe. Incarnati0n miał problemy z zaaklimatyzowaniem się na tak wysokim poziomie i ze spełnieniem wygórowanych oczekiwań kibiców. Kilka pierwszych kolejek było bardzo przeciętne w jego wykonaniu, co spowodowało falę krytyki ze strony fanów, ale później z każdym meczem radził sobie lepiej. Na pewno bardzo pomógł mu powrót do drużyny Haia „Haia” Lama, bowiem od zmiany dżunglera progres był jeszcze wyraźniejszy. Pod koniec splitu Incarnati0n był już mocnym punktem zespołu i miał spory udział w sensacyjnym wywalczeniu przez Cloud9 awansu na Mistrzostwa Świata. Trudy debiutu już więc za nim, a rok 2016 powinien być dla niego znacznie bardziej udany.</p>\n<p>\nW czasach dominacji SoloQ Incarnati0na zasłynął z niezwykle efektywnej gry zabójcami – przede wszystkim Fizzem i Zedem. Na profesjonalnej scenie jego styl gry znacznie się jednak zmienił w związku z wymogami dynamicznie ewoluującej mety. W lecie najczęściej grał Orianną, Azirem i Viktorem, co całkowicie zrozumiałem, gdyż te postaci były w tym czasie najmocniejsze. Jego pocket-pickiem był natomiast AP Kog’Maw. Co ciekawe, spośród graczy NA LCS, Duńczyk najlepiej dogaduje się z Johnym „Altec’iem” Ru i Christianem „IWillDominate” Riverą.\n </p>","de_DE":"Nicolaj „Jensen“ Jensen will allen beweisen, dass es nicht nur einen überragenden dänischen Mid-Laner gibt. Nachdem er anfangs Probleme hatte, als er 2015 als Ersatz für Hai zu Cloud9 gekommen war, konnte er mehr als nur Fuß fassen: Er wurde zu einem der gefährlichsten Mid-Laner der Liga. Beim Sommer-Split der NA LCS 2016 führte er die Liga mit 207 Tötungen an und stellte in den Entscheidungsspielen mit 20 Tötungen in einem einzigen Spiel einen neuen Rekord auf.</p>\n\nJensen war, wie der Rest von Cloud9, mit der Leistung bei der Weltmeisterschaft unzufrieden. In der neuen Aufstellung für den Frühjahrs-Split 2017 muss er an der Synergie zwischen ihm und seinem neuen Jungler, Contractz, arbeiten. Eine gute Harmonie zwischen Mid-Laner und Jungler ist das Erfolgsrezept vieler Top-Teams. Sollten sie es schaffen, gut zusammenzuarbeiten, ist kaum abzusehen, was Jensen 2017 alles erreichen kann.\n","es_ES":"<p>Nicolaj ''Jensen'' Jensen va a demostrar que no solo hay un jugador danés fantástico en la calle central de la LCS NA. Tras tener algunos problemas inicialmente cuando se unió a Cloud9 en 2015 para reemplazar a Hai, no solo se ha ganado su posición, sino que se ha convertido en uno de los mid más peligrosos de la liga. Durante el split de verano de la LCS NA 2016, despuntó en la liga con 207 asesinatos y ha establecido un nuevo récord en la LCS con 20 asesinatos en una sola partida durante los playoffs. También destacó por el número de súbditos asesinados por minuto, alcanzando una media de 9,5.</p>\n\n<p>Tras una dura derrota contra TSM en la final de verano de la LCS NA 2016, Jensen tomó las riendas de su equipo y derrotó a Immortals de nuevo en un enfrentamiento al mejor de 5, lo que significaría su clasificación para el Mundial. Aunque se hizo un nombre jugando asesinos como Zed y LeBlanc, también ha destacado con selecciones específicas como Vel'Koz y Syndra. Si Cloud9 quiere superar la fase de grupos este Mundial, a diferencia del año pasado, Jensen tendrá que deshacerse de los recuerdos de las derrotas del pasado. Puede que las emociones sean el rival más duro para Jensen en el escenario internacional; si consigue dominarlas, su límite serán las nubes.</p>","pt_BR":"<p>Nicolaj “Jensen” Jensen veio para provar que há mais do que só um grande jogador dinamarquês na rota do meio na NA LCS. Após um começo difícil quando entrou para a Cloud9 em 2015 para substituir Hai, ele fez muito mais do que só conquistar o seu lugar: ele se tornou um dos meios mais perigosos do League. Durante a Etapa de Verão da NA LCS 2016, ele ficou na liderança em número de abates marcando 207 e alcançou um novo recorde na LCS com 20 abates em um único jogo nas eliminatórias. Ele também ficou em primeiro em abates de tropa por minuto, marcando 9,5.</p>\n\n<p>Depois de uma derrota esmagadora para a TSM na Final da Etapa de Verão da NA LCS, Jensen reuniu sua equipe, que conseguiu derrotar mais uma vez a Immortals em uma melhor de 5, qualificando-se assim para o Mundial. Apesar de ter feito seu nome jogando com assassinos como Zed e LeBlanc, ele também se sobressai em escolhas mais específicas como Vel’Koz e Syndra. Se a Cloud9 espera superar sua saída na Fase de Grupos do Mundial do ano passado, Jensen vai ter que superar as derrotas do passado. As emoções talvez sejam um de seus piores inimigos no palco internacional. Se ele conseguir controlá-las, o céu é o limite.</p>","es_AR":"<p>Nicolaj \"Jensen\" Jensen ha venido para demostrar que hay más de un carrilero central danés habilidoso en la LCS NA. Después de un arduo inicio en Cloud9 como reemplazo de Hai en el 2015, ha logrado más que ganarse su lugar: se ha convertido en uno de los carrileros centrales más poderosos de la liga. Durante el torneo de clausura de la LCS NA 2016, encabezaba la liga con 207 asesinatos y registró una marca inédita de la LCS con 20 asesinatos en un solo combate durante las eliminatorias. También lideró la liga con 9.5 CS por minuto.</p>\n\n<p>Después de una aplastante derrota ante TSM en la final del torneo de clausura de la LCS NA 2016, Jensen reunió a su equipo para derrotar a Immortals una vez más en un combate al mejor de cinco y clasificar al Mundial. A pesar de que se hizo reconocido jugando con asesinos como Zed y Leblanc, también se destacó usando personajes especializados como Vel’Koz y Syndra. Si Cloud9 espera mejorar luego de su salida en la fase de grupos del Mundial del año pasado, Jensen deberá despejar los fantasmas de las derrotas anteriores. Quizás las emociones sean el rival más duro de Jensen en el escenario internacional. Si logra dominarlas, su límite será el cielo.</p>"},"foreignIds":{"drupalId":"4330","TRLH1":"200000174","TRLH2":"200000078","TRLH3":"200000338"},"socialNetworks":{"facebook":"https://www.facebook.com/c9incarnati0n","twitch":"https://twitch.tv/incarnati0n","twitter":"https://twitter.com/Incarnati0nLoL"},"champions":[],"liveGameTeam":18},{"id":499,"slug":"smoothie","name":"Smoothie","firstName":"Andy","lastName":"Ta","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smoothie-5yeikqg2.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:10.000Z","updatedAt":"2017-07-04T19:27:48.000Z","bios":{"en_US":"<p>Andy “Smoothie” Ta offers Cloud9 the perfect blend of support attributes -- control of the map, and protection of carries. After spending most of the 2016 Summer Split sharing time in the support role, Smoothie took over the job full time near the end of the split and never looked back. Despite limited playtime, Smoothie had the third best support KDA in the league for the Summer Split.</p>\n\n<p>In less than a year, Smoothie went from bouncing around the NA Challenger scene all the way to the 2016 World Championship. While the rookie was overshadowed by some of the world’s finest, he’s one of the best young supports in the scene. He’ll have his sophomore season to level up his skills and take another shot at greatness on the world stage.</p>","fr_FR":"<p>Andy « Smoothie » Ta a rejoint Team Liquid en 2015 après ses débuts aux LCS avec Team Dragon \n\nKnights, plus tôt dans l'année. Bien que ce support ait été plutôt discret dans sa première année aux LCS, \n\nSmoothie a impressionné les dirigeants de TL au point que ces derniers lui ont proposé une place dans \n\nl'équipe ; équipe qui a fini à la première place de la saison régulière du segment d'été des LCS NA 2015. \n\nIl ne tient qu'à lui de prouver qu'il est capable de conserver son poste.</p>","pl_PL":"<p>Pochodzący z Calgary, w Kanadzie, \"Smoothie\" zainteresował się profesjonalną sceną dopiero w sezonie piątym. Dołączył do Team Dragon Knights w lutym 2015 roku, zastępując poprzedniego supporta. Zamiana zbiegła się w czasie z początkiem wiosennego sezonu NA Challenger Series 2015. Andy, wraz z drużyną, skończył go na drugim miejscu z wynikiem 7:3. Po zajęciu też drugiego miejsca w rozgrywkach barażowych zakwalifikował się do Summer Promotion Tournament. TDK zostało wybrane przez Winterfox, lecz udało im się zwyciężyć, pomimo substytucji mid-lanera. Niestety „rycerze” nie poradzili sobie najlepiej w letnim sezonie NA LCS 2015, kończąc na ostatnim miejscu z wynikiem 3:15. Przez pozycję na samym dnie zostali automatycznie przeniesieni z powrotem do NA Challenger Series. Dlatego \"Smoothie\" opuścił szeregi Team Dragon Knights w październiku 2015 roku. Jednak umiejętności Kanadyjczyka zaprezentowane w tym okresie zrobiły wrażenie na wielu osobach – w efekcie dostał zaproszenie do Team Liquid.</p>\n<p>\nPrzyjęcie Andiego do drużyny zostało ogłoszone 16.10.2015 poprzez film w internecie pt. „Team Liquid Smoothie Challenge”. W nim czterech członków organizacji ściera się w konkursie na zrobienie najlepszego koktajlu, a o zwycięzcę ma wyłonić tajemniczy sędzia. Oczywiście sędzia to Andy, który oświadcza, że jest tylko jeden prawdziwy „Smoothie” i że będzie supportem w  Team Liquid. Fakt, że zastępuje doświadczonego Alexa \"Xpecial\" Chu’a, bardzo dobrze o nim świadczy.</p>\n<p>\nZa swojego ulubionego bohatera uważa Thresha, jednak cieszy go też gra Janną i Annie. W letnim sezonie NA LCS 2015 można także było zobaczyć jego imponującą grę Nautilusem. Pomimo krótkiego stażu na scenie esportowej posiada sporą ilość wielbicieli, co jest główną zasługą jego aktywności na portalach społecznościowych. Lubi umieszczać w internecie zdjęcia swojego autorstwa, np. swoich z innymi ludźmi lub potraw. Aż 1500 osób śledzi jego dzieła sztuki fotografii. Poza tym przepada za komentowaniem bieżących wydarzeń na świecie. Wszystko zapowiada, że będzie miał doskonały kontakt z fanami.\n</p>","de_DE":"Andy „Smoothie“ Ta bietet Cloud9 die perfekte Mischung an Supporter-Attributen: Er sorgt dafür, dass seine Mannschaft die Kontrolle über die Karte hat und beschützt die Carrys. Nachdem Smoothie die Supporter-Rolle für einen Großteil des Sommer-Splits 2016 teilen musste, ist er seit Ende der Saison alleine für das Wohl seiner Mitspieler verantwortlich. Trotz der beschränkten Spielzeit erreichte Smoothie die drittbeste Supporter-TTU (KDA) des Sommer-Splits.\n</p>\nIn weniger als einem Jahr hat es Smoothie von der nordamerikanischen Challenger-Szene bis zur Weltmeisterschaft 2016 geschafft. Auch wenn er von einigen der besten Spieler der Welt überschattet wurde, gehört er trotzdem zu den besten jungen Supportern der Szene. In seiner zweiten Saison hat er die Chance, weiter an seinen Fähigkeiten zu arbeiten und erneut zu versuchen, auf der WM-Bühne zu brillieren.\n","es_AR":"<p>Andy \"Smoothie\" Ta ofrece a Cloud9 la combinación perfecta de atributos de un soporte: control del mapa y protección de acarreadores. Después de pasar la mayor parte de la temporada regular del 2016 jugando parcialmente en ese rol con Bunny FuFuu, Smoothie comenzó a desempeñar esta tarea de tiempo completo para el final de la temporada y sin mirar atrás. A pesar de que su tiempo de juego fue limitado durante la mayor parte del torneo, Smoothie obtuvo el tercer mejor KDA de un soporte en la liga con 5.6 puntos. Se destacó con el Bardo durante la temporada regular, y su Tahm Kench ayudó a sellar la victoria del quinto combate contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha tenido un largo recorrido desde sus días en la escena de retadores de NA durante los últimos dos años. En el juego temprano, su fuerte carril protege a Sneaky y permite que el acarreador principal de C9 sobreviva intacto hasta el final del combate. Aunque Smoothie suele quedar opacado por Biofrost, otro gran soporte novato, tuvo un desempeño increíble para alguien con tan poca experiencia profesional. La falta de experiencia se pondrá a prueba en el Mundial. Allí se debilitará y perderá, o permanecerá firme y ganará bajo las brillantes luces del escenario internacional.</p>","es_ES":"<p>Andy ''Smoothie'' Ta ofrece a Cloud9 la mezcla perfecta de atributos de apoyo: control del mapa y protección para los carries. Tras pasar la mayor parte de la temporada regular de 2016 compartiendo el rol de apoyo con Bunny FuFuu, Smoothie acabó por ocupar el puesto a tiempo completo al final de la temporada, y no ha mirado atrás desde entonces. A pesar de haber contado con tiempo limitado de juego la mayor parte del split, Smoothie consiguió la tercera mejor A/M/A de apoyo de la liga, con una puntuación de 5,6. Durante la temporada regular destacó con Bardo, y su Tahm Kench ayudó a conseguir la victoria en la quinta partida contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha recorrido un largo camino desde que frecuentara la escena Aspirante de Norteamérica durante los últimos dos años. Al principio de la partida, su potente actividad en calle protege a Sneaky, lo que ayuda que el carry principal de C9 llegue a final de partida de una pieza. Aunque Biofrost, otro apoyo principiante, suele hacerle sombra, Smoothie lo hace increíblemente bien para tener tan poca experiencia profesional. Su escasa experiencia será puesta a prueba en el Mundial, donde podrá derrumbarse y perder, o mantenerse como un témpano de hielo y ganar bajo los ardientes focos del escenario internacional.</p>","pt_BR":"<p>Andy “Smoothie” Ta oferece à Cloud9 a mistura de atributos perfeita para um suporte: controle de mapa e proteção de carregadores. Após passar grande parte da temporada regular de 2016 dividindo a função de suporte com Bunny FuFuu, Smoothie passou a exercer a função em tempo integral próximo do final da temporada e nunca mais olhou para trás. Apesar de seu pouco tempo de jogo em grande parte da Etapa, Smoothie alcançou o terceiro melhor AMA entre os suportes da liga, marcando 5,6. Ele se sobressaiu de Bardo durante a temporada regular e seu Tahm Kench ajudou a fechar o último jogo contra a Immortals nas Semifinais.</p>\n\n<p>Smoothie trilhou um longo caminho desde a época em que se aventurava no cenário Desafiante na NA até esses últimos dois anos. No início do jogo, sua poderosa fase de rotas consegue proteger Sneaky e ajudar que o principal carregador da C9 chegue inteiro no fim de jogo. Apesar de Smoothie muitas vezes ser ofuscado por Biofrost, outro suporte novato incrível, ele ainda tem um desempenho excelente para alguém com tão pouca experiência no cenário profissional. Mas essa falta de experiência será posta à prova no Mundial, onde ele só terá duas opções: ser massacrado e perder ou manter a calma e vencer sob os enormes holofotes do palco internacional.</p>"},"foreignIds":{"drupalId":"3799","TRLH2":"200000080","TRLH1":"200000176","TRLH3":"200000340"},"socialNetworks":{"twitter":"https://twitter.com/LiquidSmoothiee"},"champions":[],"liveGameTeam":18},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":600,"slug":"zig","name":"Zig","firstName":"Derek","lastName":"Shao","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zig-7texw2zs.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:21:16.000Z","bios":{"en_US":"<p>Derek \"Zig\" Shao was once touted as one of the best top laners in the NA Challenger scene. Although he stumbled to start his rookie split with Phoenix1, he found his place within the team late in the season playing more offensive top laners like Rumble and Gangplank.</p>\n\n<p>Now in his sophomore season, the Canadian top laner returned to a roster with a new look for 2017. With a full split of experience under his belt, he'll be looking to elevate his game in the new year along with Phoenix1's position in the NA LCS standings.</p>","de_DE":"Derek „Zig“ Shao wurde einst als einer der besten Top-Laner der nordamerikanischen Challenger-Szene gehandelt. In seinem ersten Split bei Phoenix1 fand er nicht richtig ins Spiel, aber gegen Ende der Saison konnte er sich mit offensiveren Champions wie Rumble und Gangplank gut ins Team integrieren. \n</p>\nIn seiner zweiten Saison kehrt der kanadische Top-Laner in eine Mannschaft zurück, die sich für 2017 neue Ziele gesteckt hat. Mit der Erfahrung eines kompletten Splits wird er im neuen Jahr versuchen, sein Spiel und die Position von Phoenix1 in der NA LCS zu verbessern.\n"},"foreignIds":{"drupalId":"2441","TRLH1":"200000232","TRLH2":"200000136","TRLH3":"200000343"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":752,"slug":"arrow","name":"Arrow","firstName":"Dong-hyeon","lastName":"Noh","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/arrow-cg2h2dmw.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-04T19:24:14.000Z","bios":{"en_US":"<p>Dong-hyeon \"Arrow\" Noh is a member of the elite fraternity of AD carries that can play Draven at the highest level. When Arrow teases the Glorious Executioner during champion select, it’s enough to send a jolt of excitement through the crowd. Unsurprisingly, given his affinity for Draven, Arrow’s reputation leans heavily towards the “ultra-aggressive AD Carry that is all-go and no-quit” side of the scale.\n</p>\n<p>\nUnfortunately for Draven fans everywhere, Arrow has adapted to more utility-oriented AD carries like Ashe and Varus. \"Adapted\" might be an understatement -- he performed so well to those champions that he earned title of 2017 NA LCS Spring Split MVP. After falling in the semifinals the Cloud9, Arrow and Phoenix1 will be aiming even higher headed into the summer split.</p>","fr_FR":"<p>Dong-hyeon « Arrow » No appartient à la fraternité élitiste des carrys AD qui peuvent jouer Draven au plus haut niveau. Quand Arrow chatouille ce champion pendant la phase de sélection, cela suffit à faire frémir la foule d'excitation. Compte tenu de cette affinité avec Draven, la réputation d'Arrow est plutôt celle d'un carry AD extrêmement agressif qui se donne à fond et n'abandonne jamais.\n</p>\n<p>\nMalheureusement pour les fans de Draven (c'est-à-dire le monde entier), Arrow s'est adapté à la meta du carry AD (plutôt utilitaire) qui a dominé lors des Segments de printemps et d'été 2015. Il a obtenu un score de 10 victoires à 3 défaites avec Sivir pendant le Segment d'été des LCK 2015. Draaaaaaaaven est peut-être à la remise pour le moment, mais Arrow est toujours capable de revenir à ses anciennes amours.</p>","pl_PL":"<p>Donghyun „Arrow” No to członek nielicznej grupy prowadzących, którzy potrafią świetnie grać Dravenem. Kiedy Arrow klika tego Wielkiego Oprawcę podczas fazy wyboru, widzowie zaczynają szaleć. Nic dziwnego, że ma reputację kogoś, kto wybiera ultraagresywnych prowadzących.\n</p>\n<p>\nNiestety dla fanów Dravena Arrow przystosował się jednak do bardziej użytkowych prowadzących, którzy dominowali w wiosennym i letnim splicie 2015 roku. W lecie osiągnął wynik 10Z-3P, grając Sivir. Chociaż Draven poszedł chwilowo w odstawkę, Arrow bywał już prowadzącym i może znów wrócić do tej roli.</p>","de_DE":"<p>2014 hat der KT-Schütze Dong-hyeon \"Arrow\" No unzählige Draven Banns erzwungen, da er bis heute der wahrscheinlich beste koreanische Spieler auf diesem Champion ist. Einige Teams hatten den Fehler begangen, diese Fähigkeit zu unterschätzen und wurden mit rotierenden Äxten hart bestraft. Ernüchtenderweise hat Arrow sich an die Meta anpassen müssen und legt seine Hand nun an nützlichkeitsorientierten Champions wie Sivir und Ashe an. </p>","es_ES":"<p>Dong-hyeon “Arrow” No forma parte de la hermandad de tiradores de élite que juegan Draven al máximo nivel. Basta el simple coqueteo de Arrow en selección de campeones con el Glorioso Ejecutor para arrancar al público gritos de emoción. Como era de esperar, dada su afinidad con Draven, la reputación de Arrow se basa en ser el tirador ultra agresivo para el que no hay vuelta atrás. </p>\n\n<p>Desafortunadamente para todos los fans de Draven en el mundo (vamos, todas las personas) Arrow se ha adaptado hacia los tiradores de utilidad que han dominado el metajuego en los dos Split, primavera y verano, de la LCK 2015. Aunque por el momento Draaaaaaaaaaaven esté guardado en el baúl, eso no le impide a Arrow ponerse sus pantalones de carry una y otra vez para llevar a su equipo a la victoria. </p>\n","pt_BR":"<p>Dong-hyeon \"Arrow\" No é um membro de elite da fraternidade de atiradores que conseguem jogar com Draven no mais alto nível. Quando Arrow passa por cima do Carrasco de Noxus na seleção de campeões, é apenas para levantar a torcida. Sem surpresas, devido à sua afinidade com Draven, a reputação de Arrow é a de um atirador que adota um estilo de jogo ultra agressivo - WildTurtle - na escala \"de-uma-pedra-a-WildTurtle\".\n</p>\n<p>\nInfelizmente, para fãs do Draven em todo o lugar (ou seja, todo mundo), Arrow se adaptou ao meta de escolher atiradores com utilidade que dominou a temporada 2015. Ele conquistou um recorde de 10V-3D com a Sivir durante a etapa de Verão da LCS em 2015. Enquanto Draaaaaaaaaven fica na prateleira por enquanto, Arrow pode vestir as calças da carregação com outros campeões, só esperando para mostrar Draven novamente.</p>"},"foreignIds":{"drupalId":"1016","TRLH1":"200000235","TRLH2":"200000139","TRLH3":"200000346"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":972,"slug":"pirean","name":"Pirean","firstName":"Jun-sik","lastName":"Choi","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pirean-h4091ye6.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:16:17.000Z","updatedAt":"2017-07-19T23:26:49.000Z","bios":{"fr_FR":"<p>Choi « Pirean » Jun-sik est le nouveau midlaner de Team Impulse pour les LCS NA 2016. Le sud-coréen partage un point commun avec la plupart de ses coéquipiers : presque personne ne le connait. À l’instar de son toplaner Wang « Feng » Xiao-Feng, Pirean débarque en LCS directement depuis la file solo de League of Legends, sans aucune expérience compétitive antérieure. Lui vient de la file solo sud-coréenne, il en occupait la 64ème place avant de partir pour l’Amérique du Nord et contrairement à son toplaner la file du milieu est sans aucun doute son rôle favori. Ce qui est sans doute rassurant. Ou en tout cas légèrement moins inquiétant quant à ses futures performances en LCS. A en croire son historique des matchs, le joueur privilégie les carry AP en midlane et montre une nette préférence pour Twisted Fate, de loin son champion le plus joué. Il semble également très bien maitriser Kassadin, champion sur lequel il a atteint un ratio de 62% de victoires en parties classées sur la file solo en 2015. Viennent ensuite Azir et Viktor, ainsi que Leblanc, champion qu’il a énormément joué au cours de la présaison. En l’absence d’expérience en équipe, difficile d’en savoir plus sur le talent réel de Pirean ou d’en estimer son étendue avant le début des LCS NA, même si le doute est légitimement permis. Après tout, nul n’est à l’abri d’une (énorme) surprise ! </p>","en_US":"<p>Jun-sik \"Pirean\" Choi is mid laner from Korea with a penchant for assassins in the mid lane. Pirean was snatched up by Team Impulse in 2016 as part of their rebuilding effort, joining the ranks of several other former-amateur and semi-pro players on the new team. He spent the 2016 NA LCS Summer Split as Phoenix1's starting mid laner.</p>","pl_PL":"<p>Obecność koreańskiego mid-lanera w rozgrywkach LCS to, podobnie jak w przypadku jego kolegi z zespołu Wanga „Fenga” Xiao Fenga, wielka niespodzianka. </p>\n<p>Pirean został wypatrzony przez włodarzy Teamu Impulse w koreańskiej kolejce solowej, gdzie na stan z początku stycznia 2016 roku był sklasyfikowany na 64. pozycji. W dostaniu się tak wysoko w tym rankingu pomogli mu przede wszystkim Twisted Fate oraz Kassadin, ale także, w nieco mniejszym stopniu, Azir i Viktor. Warto uważać przede wszystkim na dwie pierwsze postaci, którymi Pirean utrzymywał KDA na poziomie odpowiednio 3,36 oraz 3,68.</p>\n<p>Mid-laner nie posiada żadnego doświadczenia na profesjonalnej scenie, toteż oferta TiP-u z pewnością stanowi dla niego dużą szansę, ale także wyzwanie, by sprostać presji występów na tak wysokim poziomie.</p>\n","de_DE":"Jun-sik „Pirean“ Choi ist ein koreanischer Mid-Laner mit einer Vorliebe für Assassinen. Team Impulse hat sich Pirean im Jahr 2016 im Zuge ihrer Neustrukturierung geschnappt, und so reiht er sich im neuen Team unter mehrere ehemalige Amateur-Spieler und Halb-Profis. Er war im Sommer-Split der NA LCS 2016 Mid-Laner bei Phoenix1. In der neuen Aufstellung übernimmt er die Rolle des Ersatzspielers, der jederzeit eingewechselt werden kann, um eine Top-Leistung abzuliefern."},"foreignIds":{"TRLH1":"200000238","TRLH2":"200000142"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":1160,"slug":"allorim","name":"Allorim","firstName":"Jon","lastName":"Logue","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/allorim-h3do064y.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-02-13T14:02:09.000Z","updatedAt":"2017-07-30T19:21:34.000Z","bios":{"en_US":""},"foreignIds":{"ESPORTSTMNT02":"200000760","TRLH1":"200000718"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":220},{"id":1903,"slug":"mikeyeung","name":"MikeYeung","firstName":"Mike","lastName":"Yeung","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikeyeung-2m8v2i6v.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-05-25T17:36:40.000Z","updatedAt":"2017-07-04T19:23:40.000Z","bios":{},"foreignIds":{"TRLH1":"200000621","TRLH3":"200000344"},"socialNetworks":{},"champions":[],"liveGameTeam":220}],"scheduleItems":[{"id":"AVw2gJNyoUG4HPFjOKQo","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:bef9065d-5227-49be-9be2-9b837b9d88e9","scheduledTime":"2017-07-21T22:00:00.940+0000","tags":{"blockLabel":"7","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"bef9065d-5227-49be-9be2-9b837b9d88e9","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"c14f2798-15b3-4598-bc02-10f9df8604f5","gameHash":"b310356693eeb7c2"},{"id":"61e9036d-f0c0-4f46-88d4-75200dc9ca27","gameHash":"27b653bbd3195ce9"},{"id":"dea93233-6cb6-4622-835e-33c96142a4fa","gameHash":"5868939d4f302dcf"}],"videos":[{"id":8049,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:61e9036d-f0c0-4f46-88d4-75200dc9ca27","source":"https://www.youtube.com/embed/yFH4pHgftQI?wmode=transparent&rel=0","createdAt":"2017-07-22T00:06:26.000Z","updatedAt":"2017-07-22T00:06:26.000Z","game":"61e9036d-f0c0-4f46-88d4-75200dc9ca27"},{"id":8051,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:c14f2798-15b3-4598-bc02-10f9df8604f5","source":"https://www.youtube.com/embed/2soQtxG8XFk?wmode=transparent&rel=0","createdAt":"2017-07-22T00:31:14.000Z","updatedAt":"2017-07-22T00:31:14.000Z","game":"c14f2798-15b3-4598-bc02-10f9df8604f5"},{"id":8053,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:dea93233-6cb6-4622-835e-33c96142a4fa","source":"https://www.youtube.com/embed/VbfPRpR3WY0?wmode=transparent&rel=0","createdAt":"2017-07-22T01:45:18.000Z","updatedAt":"2017-07-22T01:45:18.000Z","game":"dea93233-6cb6-4622-835e-33c96142a4fa"}],"htmlBlocks":[],"match":{"id":"bef9065d-5227-49be-9be2-9b837b9d88e9","name":"C9-vs-P1","position":7,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],"games":{"c14f2798-15b3-4598-bc02-10f9df8604f5":{"id":"c14f2798-15b3-4598-bc02-10f9df8604f5","name":"G2","generatedName":"C9|P1|G2|bef9065d522749be9be29","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"},{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],"standings":{"result":[[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}]],"timestamp":1500680921411,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"1002290059","gameRealm":"TRLH1","platformId":"TRLH1:1002290059","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"61e9036d-f0c0-4f46-88d4-75200dc9ca27":{"id":"61e9036d-f0c0-4f46-88d4-75200dc9ca27","name":"G1","generatedName":"C9|P1|G1|bef9065d522749be9be29","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500681800148,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500677177547,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002290049","gameRealm":"TRLH1","platformId":"TRLH1:1002290049","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"dea93233-6cb6-4622-835e-33c96142a4fa":{"id":"dea93233-6cb6-4622-835e-33c96142a4fa","name":"G3","generatedName":"C9|P1|G3|bef9065d522749be9be29","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500687732443,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500684194875,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002290061","gameRealm":"TRLH1","platformId":"TRLH1:1002290061","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500687732443,"source":"bestOf","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"2b9954bf-3f2a-4802-8feb-c987b12d1f42"}]],"timestamp":1500684194875,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9":1,"2b9954bf-3f2a-4802-8feb-c987b12d1f42":0}}}