{"teams":[{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]},{"id":241,"slug":"albus-nox-luna","name":"Albus NoX Luna","guid":"be71ab18-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-apxmut87.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-inrjjbeg.png","acronym":"ANX","homeLeague":"urn:rg:lolesports:global:league:league:1","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/albus-nox-luna-3isj008z.png","createdAt":"2016-08-19T21:26:13.000Z","updatedAt":"2016-10-11T14:45:11.000Z","bios":{"en_US":"<p>\nAlbus NoX Luna, previously known as Hard Random, recently collected their fifth title as the CIS regional champions, and they are ready to shine at the 2016 World Championship. Sporting a new name, but backed by the same passion, these players are hungry for more. Their struggles at past international events will be laid to rest if they can deliver some wins at League's most prestigious event.\n</p>\n<p>\nCoach: Konstantin “Ansva” Chanchikov   \n</p>","pt_BR":"A Albus NoX Luna, antes conhecida como Hard Random ganhou recentemente seu quinto título de campeões regionais da CEI e estão prontos para brilhar no Campeonato Mundial 2016. Com um novo nome, mas com a mesma paixão de sempre, esses jogadores querem mais. Suas dificuldades enfrentadas nos últimos eventos internacionais poderão finalmente ser esquecidas se eles conseguirem algumas vitórias no evento mais prestigiado do League.","de_DE":"<p>Albus NoX Luna, ehemals bekannt als Hard Random, gewann vor Kurzem den dritten Titel bei der CIS und will jetzt bei der Weltmeisterschaft 2016 glänzen. Trotz des neuen Namens brennt in der Mannschaft noch die alte Leidenschaft und die Spieler haben Lust auf mehr. Mit ein paar Siegen beim wichtigsten internationalen Event von League könnten sie ihre Probleme aus der Vergangenheit hinter sich lassen.</p>\n<p>Coach: Konstantin „Ansva“ Chanchikov</p>","es_AR":"<p>Albus NoX Luna, anteriormente conocidos como Hard Random, recientemente acumularon su quinto título como los campeones regionales de la CIS y están listos para brillar en el Campeonato Mundial 2016. Portando un nuevo nombre, pero respaldados por la misma pasión, estos jugadores vienen con hambre de más. Su lucha en eventos internacionales pasados quedará sepultada si pueden conseguir algunas victorias en el más prestigioso evento de League.</p>\n\n<p><strong>Entrenador: Konstantin \"Ansva\" Chanchikov</strong></p>","es_ES":"<p>Albus NoX Luna, anteriormente conocidos como Hard Random, se hicieron hace poco con su quinto título como campeones de la región CIS y están listos para brillar en el Campeonato Mundial 2016. Aunque lleven un nombre nuevo, los mueve la pasión de siempre y estos jugadores están hambrientos de llegar más lejos. Pondrán fin a sus problemas en eventos internacionales pasados si consiguen algunas victorias en el evento más famoso de League of Legends.</p>","pl_PL":"<p>Albus NoX Luna, poprzednio znani pod nazwą Hard Random, niedawno zdobyli piąty tytuł regionalnych mistrzów CIS i są gotowi zabłysnąć na Mistrzostwach Świata 2016. Mają nową nazwę, ale napędza ich ta sama pasja — ci zawodnicy łakną więcej sukcesów. Zapomną o trudach zmagań minionych imprez międzynarodowych, jeśli zdołają zdobyć kilka zwycięstw na najbardziej prestiżowym wydarzeniu League of Legends.</p>\n<p>Trener: Konstantin „Ansva” Chanchikov   </p>\n"},"foreignIds":{},"players":[125,828,830,1218,1411,1413],"starters":[125,828,830,1218,1411],"subs":[1413]}],"players":[{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":125,"slug":"likkrit","name":"Likkrit","firstName":"Kirill","lastName":"Malofeev","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/likkrit-fgb3ia69.png","hometown":"Moscow","region":"International Wildcard","birthdate":"1995-10-04","createdAt":"2014-08-06T16:19:17.000Z","updatedAt":"2017-07-05T18:20:48.000Z","bios":{"en_US":"<p>The Bard God is back. Last spring Likkrit found fame worldwide as one of the strongest support players in the Wildcard scene. His pool of champions played at the highest level is huge, and his Bard in particular is always a threat on the roam. Likkrit does have one weakness though -- he doesn't enjoy playing \"classic\" supports, such as Janna or Nami. Where's the fun in playing someone who can't roam for a stun and a kill?</p>","de_DE":"<p>Der Bard-Gott ist zurück. Im letzten Frühjahr wurde Likkrit als einer der besten Supporter der „Wildcard“-Szene weltweit berühmt. Er kann auch auf höchstem Niveau auf einen großen Champion-Pool zurückgreifen und wenn er Bard spielt, wird er zur umherwandernden Bedrohung. Likkrit hat jedoch eine Schwachstelle: Er spielt nicht gerne „klassische“ Supporter wie Janna oder Nami. Wo bleibt der Spaß, wenn man einen Champion spielt, mit dem man nicht herumwandern und Gegner töten kann?\t</p>","es_ES":"<p>El dios de Bardo ha vuelto. Likkrit alcanzó la fama mundial en la pasada primavera como uno de los jugadores de apoyo más potentes en el panorama wildcard. Su plantel de campeones al máximo nivel es enorme y, sobre todo, su Bardo es una amenaza siempre que se pone a deambular. No obstante, sufre de una debilidad: no le gusta jugar con apoyos \"clásicos\" como Janna o Nami. ¿Dónde está la diversión en jugar un campeón que no puede deambular y acertar un aturdimiento que acaba en un asesinato?</p>","pl_PL":"<p>Bóg Barda powrócił. Ubiegłej wiosny Likkrit zdobył międzynarodową sławę jako jeden z najsilniejszych wspierających na scenie dzikich kart. Pula bohaterów, którymi gra na najwyższym poziomie, jest bogata, ale szczególnymi względami darzy Barda. Likkrit ma jednak jedną słabość — nie lubi grać „klasycznymi” wspierającymi, jak Janna czy Nami. Co to za zabawa, grać kimś, kto nie nadaje się do wędrowania w poszukiwaniu ofiar, które można ogłuszyć i zabić?</p>"},"foreignIds":{"drupalId":"3140","TRLH1":"1001380077","TRLH2":"1001280047","ESPORTSTMNT04":"200001502"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":828,"slug":"smurf","name":"Smurf","firstName":"Dmitrii","lastName":"Ivanov","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smurf-30g8uhic.png","hometown":"Kaliningrad (Rússia)","region":"International Wildcard","birthdate":"1994-06-22","createdAt":"2015-08-25T15:37:32.000Z","updatedAt":"2017-07-05T18:23:55.000Z","bios":{"pt_BR":"<p>Dmitrii \"Smurf\" Ivanov é o agressivo jogador do topo da Albus Nox Luna. Mas a agressividade de Smurf não é só para fazer pose. Ele é considerado um dos jogadores mais inteligentes da CEI. Se ele vai para cima, ele geralmente tem um propósito. Porém, talvez seja difícil ver se você está sendo pisoteado por Hecarim ou esmagado contra uma parede por Gnar.</p>\n\n<p>Quando a inteligência de Smurf não é suficiente para sobreviver, seu senso de humor assume a posição. Sua personalidade tem sido de grande utilidade no Rift, seja jogando de meio, suporte ou de topo agora na StarLadder. Talvez Smurf seja o escolhido para trazer Soraka para o topo. Sempre podemos ter esperanças.</p>","en_US":"<p>\nDmitrii \"Smurf\" Ivanov is the all-in, aggressive top laner for Albus Nox Luna, previously known as Hard Random. Smurf's aggression is more than just posturing though. He is widely regarded as one of the smartest players in the CIS -- if he's diving in, he usually has a purpose. Although it might be hard to see if you're being trampled by Hecarim, or smashed into a wall by Gnar.\n</p>\n<p>\nWhen Smurf's wits aren't enough to survive, his sense of humor steps up to the plate. His personality has served him well all across the Rift, playing mid, support, and now top competitively in StarLadder. Maybe Smurf is the chosen one to bring out Soraka top. We can always hope!\n</p>","fr_FR":"<p>\nDmitrii « Smurf » Ivanov est le top laner agressif et bagarreur de Hard Random. Son côté agressif ne se limite pas à sa posture, cela dit. Il est largement considéré comme l'un des joueurs les plus rusés de la CEI : s'il fonce pour attaquer, c'est qu'il a une bonne raison de le faire. Mais c'est peut-être difficile à voir lorsqu'on se fait piétiner par Hecarim ou écraser contre un mur par Gnar.\n</p>\n<p>\nQuand son intelligence ne lui suffit plus pour survivre, son sens de l'humour prend le relais. Sa personnalité lui a été d'un grand secours sur la Faille, où il a joué en tant que mid laner, support et où il occupe désormais le rôle de top laner sur StarLadder. Peut-être Smurf est-il l'élu qui permettra à Soraka de gagner sa place en voie du haut ! Quoi de mieux que les All-Stars de 2015 pour tenter cette nouvelle méta ? \n</p>","pl_PL":"<p>\nDmitrii \"Smurf\" Ivanov gra dla Hard Random i jest typem agresywnego gracza górnej alei, który lubi stawiać wszystko na jedną kartę. Jednakże Smurf nie jest agresywny tylko dla zasady. Powszechnie uważa się go za jednego z najbardziej inteligentnych graczy wywodzących się z WNP. Jeżeli decyduje się na atak w zasięgu wieży to zazwyczaj ma w tym jakiś cel. Chociaż czasem doszukanie się go może być trudne, jeśli akurat jesteście tratowani przez Hecarima albo rzucani po ścianach przez Gnara.\n</p>\n<p>\nA kiedy inteligencja Smurfa to za mało, aby przetrwać, do gry wchodzi jego poczucie humoru. Jego osobowość dobrze mu służyła dookoła całego Riftu. Grał w StarLadderze jako środkowy, wspierający, a ostatnio przebywa w górnej alei. Być może to właśnie Smurf jest wybrańcem, który zagra w górnej alei Soraką. Nie będzie do tego lepszej okazji, niż All-Star 2015. \n</p>","de_DE":"<p>Dmitrii „Smurf“ Ivanov ist der aggressive Top-Laner von Albus NoX Luna, ehemals bekannt als Hard Random, der alles auf eine Karte setzt. Smurfs Angriffsfreudigkeit ist jedoch mehr als bloße Drohgebärde. Er wird weithin als einer der cleversten Spieler im CIS angesehen – wenn er losprescht, führt er meistens etwas im Schilde. Obwohl die meisten das schon nicht mehr mitkriegen, da sie von Hecarim zertrampelt oder von Gnar in die nächste Wand gerammt werden.</p>\n\n<p>Wenn Smurfs Grips zum Überleben nicht mehr ausreicht, kommt sein Sinn für Humor ins Spiel. Seine Persönlichkeit hat ihm überall in der Kluft bereits gute Dienst erwiesen, egal ob auf der mittleren Lane, als Supporter oder jetzt in der StarLadder als konkurrenzfähiger Top-Laner. Vielleicht ist Smurf der Auserwählte, der mit Soraka die obere Lane aufräumt. Die Hoffnung stirbt zuletzt.</p>","es_ES":"<p>\nDmitrii \"Smurf\" Ivanov es el agresivo top de Hard Random. La agresión de Smurf, sin embargo, no es simple postureo. Muchos lo ven como uno de los jugadores más inteligentes de CIS. Siempre hace las cosas con un objetivo en mente. A veces es difícil de ver; por ejemplo, cuando uno es arrollado por Hecarim o empotrado contra una pared por Gnar.\n</p>\n<p>Cuando el buen juicio de Smurf no consigue evitar que lo maten, su sentido del humor toma el relevo. Su personalidad le ha servido de mucho en la Grieta, tanto al jugar mid como apoyo, y ahora top en StarLadder. Puede que Smurf sea el elegido para recuperar a Soraka top. Y no hay mejor ocasión que el evento All-Star 2015. \n</p>"},"foreignIds":{"TRLH1":"1001380073","TRLH2":"1001280043","ESPORTSTMNT04":"200001476"},"socialNetworks":{},"champions":[{"id":139,"playerId":828,"championId":120,"championKey":"Hecarim","championName":"Hecarim","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"},{"id":140,"playerId":828,"championId":105,"championKey":"Fizz","championName":"Fizz","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"},{"id":141,"playerId":828,"championId":68,"championKey":"Rumble","championName":"Rumble","createdAt":"2015-08-26T11:58:00.000Z","updatedAt":"2017-07-05T18:23:55.000Z"}],"liveGameTeam":241},{"id":830,"slug":"kira","name":"Kira","firstName":"Mykhailo","lastName":"Harmash","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kira-6on16dx.png","hometown":"Mariupol (Ucrânia)","region":"International Wildcard","birthdate":"1993-03-07","createdAt":"2015-08-25T15:40:12.000Z","updatedAt":"2016-09-30T01:16:09.000Z","bios":{"pt_BR":"<p>Mykhailo \"Kira\" Harmash é o jogador da virada. Em desvantagem no 1v1? Hora de reagir e virar o jogo. O confronto vai mal? É só um inconveniente, ele ainda pode conseguir o abate. Mas de alguma forma, apesar de seu comportamento maluco na rota, Kira ganhou posições na CEI e se tornou um dos melhores jogadores do meio da Rússia. Ele também levou o primeiro lugar no torneio 1v1 do evento All-Star IWC 2015 na Austrália.</p>\n<p>A velha reputação de Kira como jogador que só sabe jogar com Anivia foi substituída por uma abundância de magos de utilidade e controle. Depois de exercer um papel essencial na trajetória da NoX até o Campeonato Mundial 2016, Kira enfrentará alguns dos melhores jogadores do meio do cenário profissional de League of Legends. Vamos ver que tipo de situações suas façanhas irão gerar na rota.</p>\n","en_US":"<p>\nMykhailo \"Kira\" Harmash will always go for the outplay. Behind in a 1v1? Time to bait them in and go for the turnaround! In a terrible matchup? A mere inconvenience, he can still get the kill. But somehow, despite his crazy laning behavior, Kira has climbed the ranks of the CIS and become one of the best mid laners in Russia. He also claimed 1st place in the 1v1 tournament at the 2015 IWC All-Star Event in Australia.\n</p>\n<p>\nKira's old reputation as a one-trick-bird with Anivia has been replaced by a plethora of control and utility mages. After playing a key role in NOX's road to the 2016 World Championship, Kira will be matched up against some of the best mid laners playing professional League of Legends. Let's see what kind of trouble his mid lane shenanigans create.\t\n</p>","fr_FR":"<p>\nMykhailo « Kira » Harmash cherche toujours à déjouer le destin et à retourner la situation. Désavantagé dans un 1c1 ? Il attire ses ennemis et change le cours du match. Handicapé par un matchup défavorable ? Ce n'est qu'un détail, il peut quand même tuer son opposant. Mais d'une certaine manière, malgré son attitude déjantée en phase de laning, Kira a su monter en grade dans sa région et devenir l'un des meilleurs mid laners de Russie. Il a également fini en première place lors du tournoi en 1c1 de l'événement All-Stars IWC 2015 en Australie. Autrefois connu pour être le joueur d'un seul champion (Anivia), il est désormais capable de jouer une kyrielle de mages de soutien ou possédant du contrôle de foule. Kira va devoir affronter certains des meilleurs mid laners au monde lors de l'événement All-Stars 2015. Attendons de voir quel genre de situation ses manigances vont créer en voie du milieu.\n</p>","pl_PL":"<p>\nMykhailo \"Kira\" Harmash zawsze stara się ograć swoich rywali. Przegrywa pojedynek 1 na 1? Najpewniej spróbuje podpuścić przeciwnika i odwrócić losy starcia. Gra w alei przeciwko trudnemu dla siebie bohaterowi? Przecież to tylko drobna niedogodność i wciąż jest w stanie zdobyć na nim zabójstwo. Kira, pomimo swej zwariowanej gry w alei, w jakiś sobie tylko znany sposób stał się jednym z najlepszych środkowych w WNP. Co więcej, zajął 1 miejsce w turnieju 1-na-1 podczas IWC All-Star 2015 w Australii. Dawniej znany był przede wszystkim z gry Anivią, lecz teraz potrafi grać całym multum kontrolujących i wspierających magów. Podczas All-Star 2015 będzie musiał stawić czoła najlepszym środkowym na świecie. Przekonajmy się, czy będzie w stanie im zagrozić.\n</p>","de_DE":"<p>Mykhailo „Kira“ Harmashs große Stärke ist das Ausspielen. Liegt er in einer 1-gegen-1-Situation hinten, lockt er seinen Gegenüber in die Falle und dreht den Spieß um. Steckt er in einer unvorteilhaften Paarung fest, ist das nicht mehr als eine Unannehmlichkeit. Er kann sich die Tötung trotzdem holen. Trotz seiner verrückten Art auf der Lane hat Kira es geschafft, die Ränge des CIS nach oben zu klettern und einer der besten Mid-Laner in Russland zu werden. Außerdem hat er sich beim IWC All-Stars-Event 2015 in Australien im 1-gegen-1-Turnier den 1. Platz geholt.\nFrüher hatte Kira den Ruf, nur mit Anivia Großes vollbringen zu können, doch mittlerweile spielt er eine ganze Mannschaft an (unterstützenden) Magiern mit Massenkontrolle wie ein Profi. Kira spielte eine Schlüsselrolle auf NoX’ Weg zur Weltmeisterschaft 2016 und wird dort auf die besten Mid-Laner in League of Legends treffen. Wir sind schon gespannt, was seine Tricksereien auf der mittleren Lane für Unfug stiften werden.</p>","es_ES":"<p>Mykhailo \"Kira\" Harmash siempre buscará la jugada destacada. ¿Que va detrás en el duelo? Dadle tiempo para que engañe a sus rivales y le dé la vuelta a la jugada. ¿Que el enfrentamiento es desfavorable? Minucias, sigue pudiendo conseguir el asesinato. Pero, de alguna manera, a pesar de su alocado comportamiento en la calle, Kira ha escalado la clasificación de la CIS y se ha convertido en uno de los mejores jugadores de la calle central de Rusia. También se hizo con el primer puesto en el torneo 1v1 del IWC All-Star Event 2015 en Australia.</p>\n\n<p>La reputación de Kira como ornitólogo con Anivia ha sido sustituida por una plétora de magos de control y utilidad. Después de jugar un papel clave en el camino de NOX hacia el Campeonato Mundial 2016, Kira se enfrentará contra algunos de los mejores jugadores de la calle central en el mundo profesional de League of Legends. Ya veremos qué tipo de problemas causan sus diabluras por la calle central.</p>"},"foreignIds":{"TRLH1":"1001380075","TRLH2":"1001280045"},"socialNetworks":{"twitch":"http://www.twitch.tv/kirrrrra"},"champions":[],"liveGameTeam":241},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1218,"slug":"pvpstejos","name":"PvPStejos","firstName":"Oleksandr","lastName":"Glazkov","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pvpstejos-9j29ioil.png","hometown":"Zaporizhia","region":"International Wildcard","birthdate":"1996-12-24","createdAt":"2016-04-15T05:33:05.000Z","updatedAt":"2016-09-30T01:20:28.000Z","bios":{"en_US":"<p>Oleksandr “PvPStejos” Glazkov serves as one of the primary shotcallers on Albus NoX Luna. His work speaks for itself, leading NOX to first place in multiple LCL Finals and then all the way to the 2016 World Championship via the International Wildcard Qualifiers in Brazil. PvPStejos' success, and that of his team in general, have earned them a slew of fans in the CIS. Now he has to prove to his fans that NOX has what it takes to survive against the best League teams in the world.</p>","de_DE":"<p>Aleksander „PvPStejos“ Glazkov ist einer der Hauptansager von Albus NoX Luna. Seine Arbeit spricht für sich: Er führte NoX zu mehreren Titeln in der LCL und über das „International Wildcard“-Qualifikationsturnier in Brasilien zur Weltmeisterschaft 2016. Die Erfolge von PvPStejos und seiner Mannschaft haben ihm in der CIS viele Fans eingebracht. Jetzt muss er seinen Fans beweisen, dass NoX das Zeug dazu hat, gegen die weltbesten Mannschaften in League zu bestehen.</p>","es_AR":"<p>Aleksander \"PvPStejos\" Glazkov es uno de los principales líderes en Albus NoX Luna. Su trabajo habla por sí mismo, llevó a NOX al primer puesto en múltiples Finales de la LCL y luego al Campeonato Mundial 2016 a través de las Clasificatorias Internacionales Wildcard en Brasil. El éxito de PvPStejos y el de su equipo en general generó un grupo de simpatizantes en la CIS. Ahora deberá probarle a sus simpatizantes que NOX tiene lo que se necesita para sobrevivir en contra de los mejores equipos de League en el mundo.</p>","es_ES":"<p>Dmitri \"Smurf\" Ivanov es el agresivo jugador de la calle superior que va a por todas para Albus NoX Luna, anteriormente conocidos como Hard Random. La agresividad de Smurf es más que una pose. Es conocido como uno de los jugadores más inteligentes de la región CIS; cada vez que realiza un ataque es porque tiene un objetivo. Aunque quizá os cueste verlo si estáis siendo aplastados por Hecarim o espachurrados contra un muro por Gnar.</p>\n\n<p>Cuando los ardides de Smurf no son suficientes para sobrevivir, aparece en escena su sentido del humor. Su personalidad le ha venido bien por toda la Grieta, ya que ha jugado, de manera competitiva, en la calle central, como apoyo y ahora en la calle superior en la StarLadder. Quizá Smurf sea el elegido para sacar a pasear a Soraka en la calle superior. No perdamos la esperanza.</p>","pt_BR":"Aleksander “PvPStejos” Glazkov é um dos principais armadores da Albus NoX Luna. Seu trabalho fala por si só e já levou a NOX a vários primeiros lugares em várias finais da LCL e depois até o Campeonato Mundial 2016 por meio do Desafio Internacional no Brasil. O sucesso de PvPStejos e da equipe como um todo lhes rendeu inúmeros fãs na CEI. Agora ele tem que provar para os fãs que a NOX tem o que é preciso para sobreviver entre as melhores equipes de League do mundo."},"foreignIds":{"TRLH2":"1001280044","TRLH1":"1001380074"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1411,"slug":"amiracle","name":"aMiracle","firstName":"Vladyslav","lastName":"Shcherbyna","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amiracle-gzemlug7.png","hometown":"Nikopol","region":"International Wildcard","birthdate":"1993-09-01","createdAt":"2016-08-22T13:47:28.000Z","updatedAt":"2016-10-11T14:44:57.000Z","bios":{"en_US":"<p>\nVladyslav “aMiracle” Scherbyna joined Albus NoX Luna (then Hard Random) in late 2015, just in time to to wreck the LCL. aMiracle and NOX claimed back-to-back 1st place finishes in the LCL, as well as taking 2nd at the 2016 IWCI. Building on his domestic success, aMiracle went into the 2016 IWCQ with something to prove -- and came away with a ticket to the 2016 World Championship.\n</p>\n<p>\nHis Jhin and Ashe play ripped through the competition in Brazil, with multiple perfect games (AKA a slew of kills and zero deaths). aMiracle is turning into one of the strongest AD carries in the wildcard regions. Now he has a chance to see how his chops match up against the best AD carries in the world.\n</p>","de_DE":"<p>Vladislav „aMiracle“ Scherbyna wechselte Ende 2015 zu Albus NoX Luna (damals noch Hard Random) und kam noch rechtzeitig, um in der LCL aufzuräumen. aMiracle und NoX gewannen zweimal hintereinander den Titel in der LCL und belegten beim IWCI 2016 den zweiten Platz. Durch seinen regionalen Erfolg hatte aMiracle beim IWCQ 2016 etwas zu beweisen – und konnte sich das Ticket zur Weltmeisterschaft 2016 sichern.</p>\n\n<p>aMiracle hat mit Jhin und Ashe die Konkurrenz in Brasilien vernichtet und wird aufgrund seiner perfekten Spiele (jede Menge Tötungen und keine Tode) zu einem der besten AD-Carrys in den „Wildcard“-Regionen. Jetzt hat er die Chance, herauszufinden, ob er es mit den besten AD-Carrys der Welt aufnehmen kann.</p>","es_AR":"<p>Vladislav \"aMiracle\" Scherbyna se unió a Albus NoX Luna (luego, Hard Random) a finales del 2015, justo a tiempo para destrozar la LCL. aMiracle y NOX reclamaron de vuelta el 1er puesto en las finales de la LCL, así como el 2do puesto en los IWCI 2016. Para construir su éxito nacional, aMiracle fue a los IWCQ 2016 para demostrar algo... y consiguió un boleto para el Campeonato Mundial 2016.</p>\n\n<p>Su juego con Jhin y Ashe destrozó a la competencia en Brasil, con múltiples juegos perfectos (con muchos asesinatos y cero muertes). aMiracle se está convirtiendo en uno de los acarreadores de AD más poderosos en las regiones de comodines. Ahora tiene la oportunidad de medirse contra los mejores acarreadores de AD del mundo.</p>","es_ES":"<p>Vladislav \"aMiracle\" Scherbyna se unió a Albus Nox Luna (por entonces Hard Random) a finales de 2015, justo a tiempo para arrasar la LCL. aMiracle y NOX se hicieron con el primer puesto en la LCL dos veces seguidas, además de un segundo puesto en el IWCI 2016. Con el apoyo del éxito en terreno doméstico, aMiracle llegó al IWCQ 2016 con algo que demostrar... y se marchó con un billete al Campeonato Mundial 2016.</p>\n\n<p>Su Jhin y su Ashe arrasaron a lo largo de la competición en Brasil con varias partidas perfectas (es decir, muchos asesinatos, pero ninguna muerte). aMiracle se está convirtiendo en uno de los AD carry más fuertes de las regiones wildcard. Ahora tiene la oportunidad de comprobar cómo se desenvuelve con su talento contra los mejores AD carry del mundo.</p>","pt_BR":"<p>Vladislav “aMiracle” Scherbyna entrou na Albus NoX Luna (na época da Hard Random) no final de 2015, a tempo de arrasar na LCL. aMiracle e a NOX ganharam todas as etapas da LCL, além do segundo lugar no IWCI 2016. Com todo esse sucesso regional, aMiracle foi para o IWCQ 2016 com algo para provar e saiu de lá com o passaporte carimbado para o Campeonato Mundial 2016.</p>\n\n<p>Jogando com Jhin e Ashe, ele destruiu os rivais no Brasil com vários jogos impecáveis (ou seja, montes de abates e nenhuma morte). aMiracle está se tornando um dos atiradores mais fortes das regiões desafiantes. Agora ele terá uma oportunidade de ver se seus disparos se comparam aos dos melhores atiradores do mundo.</p>","pl_PL":"<p>Vladislav „aMiracle” Scherbyna dołączył do Albus NoX Luna (wówczas Hard Random) pod koniec 2015 roku, w samą porę, by podbić LCL. aMiracle i NOX zdobywali raz po raz pierwsze miejsca w LCL, a ponadto zajęli 2 miejsce na IWCI 2016. Zachęcony sukcesem w macierzystym regionie, aMiracle wyruszył na IWCQ 2016, chcąc dowieść swojej wartości — i wrócił z biletem na Mistrzostwa Świata 2016.</p>\n\t\n<p>Jego gra Jhinem i Ashe zdominowała rywalizację w Brazylii, gdzie rozegrał kilka perfekcyjnych gier (wiele zabójstw i zero śmierci). aMiracle okazał się jednym z najsilniejszych prowadzących z regionów dzikich kart. Teraz ma szansę przekonać się, czy jego umiejętności dorównują najlepszym prowadzącym na świecie.</p>\n"},"foreignIds":{"TRLH1":"1001380076","TRLH2":"1001280046"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":1413,"slug":"unho1y","name":"Unho1y","firstName":"Oleksandr","lastName":"Sevostianov","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/unho1y-8fxf4nw6.png","hometown":"Odessa","region":"International Wildcard","birthdate":"1994-09-24","createdAt":"2016-08-22T13:51:24.000Z","updatedAt":"2017-07-05T18:10:50.000Z","bios":{"en_US":"","es_AR":"<p>Oleksandr \"Unho1y\" Sevostianov es el tirador suplente de Albus NoX Luna.</p>"},"foreignIds":{"TRLH1":"1001380079","TRLH2":"1001280049","ESPORTSTMNT04":"200001611"},"socialNetworks":{},"champions":[],"liveGameTeam":241},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163}],"scheduleItems":[{"id":"AVcfjjsRoUG4HPFjOKC7","content":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:match:c0cc8029-c5dd-480e-8c5d-4b1c996d524f","scheduledTime":"2016-10-07T03:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c","blockLabel":"5","subBlockLabel":"Sub Block 3","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:bracket:3eeecb03-0a62-4589-9281-481ded97424f"},"match":"c0cc8029-c5dd-480e-8c5d-4b1c996d524f","tournament":"3c5fa267-237e-4b16-8e86-20378a47bf1c","bracket":"3eeecb03-0a62-4589-9281-481ded97424f","league":"9"}],"gameIdMappings":[{"id":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","gameHash":"c3e1653de5fbde03"}],"videos":[{"id":4583,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","source":"https://www.youtube.com/embed/kbn9dsVLgDM","createdAt":"2016-10-07T05:50:40.000Z","updatedAt":"2016-10-07T05:50:40.000Z","game":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b"},{"id":4585,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","source":"https://www.youtube.com/embed/gRZe9WgaUZA?wmode=transparent","createdAt":"2016-10-07T05:52:09.000Z","updatedAt":"2016-10-07T05:52:09.000Z","game":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b"},{"id":4593,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","source":"https://www.youtube.com/embed/0_MeYtLzmd8","createdAt":"2016-10-07T12:46:52.000Z","updatedAt":"2016-10-07T12:46:52.000Z","game":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b"},{"id":4681,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3c5fa267-237e-4b16-8e86-20378a47bf1c:game:6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","source":"https://www.youtube.com/watch?v=nIdiOnP_LJY?wmode=transparent","createdAt":"2016-10-11T16:07:07.000Z","updatedAt":"2016-10-11T16:07:07.000Z","game":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b"}],"htmlBlocks":[],"match":{"id":"c0cc8029-c5dd-480e-8c5d-4b1c996d524f","name":"G2-vs-ANX","position":4,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"},{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}],"games":{"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b":{"id":"6bc93b4e-73f7-4dde-94dd-13c3d4baf88b","name":"G1","generatedName":"ANX|G2|G1|c0cc8029c5dd480e8c5d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"},{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}],"standings":{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1476202013961,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475844402646,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475819443246,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475814586549,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001900594","gameRealm":"TRLH1","platformId":"TRLH1:1001900594","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1476202013961,"source":"bestOf","history":[{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475844402646,"source":"bestOf","closed":true},{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475819443246,"source":"bestOf","closed":true},{"result":[[{"roster":"81c91830-75eb-4b26-847d-cfa0f9c894c2"}],[{"roster":"7a1e518f-38cc-41be-8a3b-dcea1a3beb79"}]],"timestamp":1475814586552,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"7a1e518f-38cc-41be-8a3b-dcea1a3beb79":0,"81c91830-75eb-4b26-847d-cfa0f9c894c2":1}}}