{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":228,"slug":"misfits","name":"Misfits","guid":"be7195b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/misfits-8fnvxt30.png","acronym":"MSF","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2016-06-03T15:47:57.000Z","updatedAt":"2017-06-07T08:47:16.000Z","bios":{"en_US":"<p>Misfits performed extremely well in the European Challenger circuit, amassing win after win on their way to punching their EU LCS tickets. After making it into the LCS, the team underwent some roster changes, adding PowerOfEvil, and the surprise signing of veteran KaKAO. The team spent time in Korea bootcamping in order to prepare themselves for the next level of competition. With a great mix of veteran leadership and fresh faces, Misfits has a chance to make an unexpected splash this season.</p>\n\n<p>Coach: Hussain Moosvi</p>\n<p> Team Manager: Andy \"CrazyCaps\" Walda</p>","de_DE":"<p>Die Misfits wurden aus der Asche der Renegade: Banditos geboren, nachdem deren Dachgesellschaft aus der LCS verbannt worden war. Die Einheit schlug sich in der europäischen Challenger Series extrem gut und gewann ein Spiel nach dem anderen, bevor sie endlich das Ticket für die EU LCS lösen konnte. Nachdem es die Mannschaft in die LCS geschafft hatte, veränderte sich ihre Aufstellung durch die Zugänge von PowerOfEvil und dem Veteranen KaKAO. Die Mannschaft verbrachte einige Zeit in Korea, um dort zu trainieren und sich auf die Konkurrenz vorzubereiten. Dank der großartigen Mischung aus erfahrenen Anführern und frischen Gesichtern könnten die Misfits diesen Frühling für die ein oder andere Überraschung sorgen.</p>\n<p>Coach: Hussain \"Hussain\" Moosvi</p>\n<p>Mannschaftsleiter: Andy \"CrazyCaps\" Walda</p>","es_ES":"<p>Misfits rindió extremadamente bien en el Challenger Series europeo al conseguir una victoria tras otra en su camino hasta la LCS EU. Después de llegar a la LCS, Misfits ha sufrido algunos cambios de plantel con la adquisición de PowerOfEvil y el sorprendente fichaje del veterano KaKAO. El equipo ha estado en Corea entrenando para prepararse para el siguiente nivel de la competición. Con una gran mezcla de liderazgo veterano y rostros nuevos, Misfits tiene la oportunidad de dejar huella de forma inesperada durante esta temporada.</p>\n\n<p>Entrenador principal: Hussain Moosvi</p>\n<p>Jefe de equipo: Andy \"CrazyCaps\" Walda</p>\n","fr_FR":"<p>Les Misfits ont enregistré d'excellentes performances dans le circuit Challenger européen, enchaînant les victoires et décrochant ainsi leur place aux LCS EU. Après sa sélection pour les LCS, l'équipe a procédé à quelques changements de formation, avec l'ajout de PowerOfEvil et l'arrivée surprise du vétéran KaKAO. L'équipe a passé du temps à s'entraîner en Corée afin de se préparer à un niveau de compétition supérieur. En mélangeant des leaders vétérans et de nouveaux visages, Misfits a une chance de faire un coup d'éclat inattendu cette saison.</p>\n\n<p>Entraîneur principal : Hussain Moosvi</p>\n<p>Responsable d'équipe : Andy « CrazyCaps » Walda</p>\n","pl_PL":"<p>Misfits spisali się naprawdę dobrze podczas europejskich rozgrywek serii Pretendenta, zdobywając jedno zwycięstwo po drugim i zapewniając sobie wstęp do EU LCS. Po dostaniu się do LCS drużyna przeszła kilka zmian składu, dodając PowerOfEvila i zaskakując wszystkich podpisaniem kontraktu z weteranem KaKAO. Drużyna spędziła nieco czasu na obozie treningowym w Korei, chcąc przygotować się do walki na nowym poziomie rywalizacji. Dzięki świetnemu połączeniu przywództwa weteranów i entuzjazmu świeżej krwi, Misfits mają szanse osiągnąć niespodziewany sukces podczas tego sezonu.</p>\n\n<p>Główny trener: Hussain Moosvi</p>\n<p>Menedżer drużyny: Andy „CrazyCaps” Walda</p>\n"},"foreignIds":{},"players":[87,243,357,392,628,1090,1334],"starters":[243,357,628,1090,1334],"subs":[87,392]}],"players":[{"id":87,"slug":"h1iva","name":"H1Iva","firstName":"Aleksi","lastName":"Kaikkonen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/h1iva-3d3cbqxm.png","hometown":null,"region":"Challenge France","birthdate":"1994-08-31","createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-05-27T01:11:02.000Z","bios":{"en_US":"","fr_FR":"<p> H1iva est un support de niveau Challenger. C'est un joueur qui connaît bien la scène professionnelle de League of Legends, après avoir joué dans les équipes Gamers 2 ou Renegades en Challenger Series. Pour cette saison 2016-2017, il rejoint l'équipe Millenium aux objectifs européens.\nSes exploits avec la Team Forge et Renegades ont permis au finlandais de se démarquer et d'acquérir une certaine renommée dans son pays d'origine. Très bon joueur de Tresh, il compte bien prouver à la communauté française qu'il saura être au niveau et mener ses coéquipiers vers la victoire. </p>","cs_CZ":""},"foreignIds":{"drupalId":"1496","TRLH3":"1000145041","TRLH4":"1000125041","FRA1TMNT1":"375321","TRNA1":"1000525385","TREU":"1000565129","FRA1TMNT2":"25245"},"socialNetworks":{"twitter":"https://twitter.com/HiivaLoL"},"champions":[],"liveGameTeam":228},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":243,"slug":"powerofevil","name":"PowerOfEvil","firstName":"Tristan","lastName":"Schrage","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/powerofevil-dvzrzaxn.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T10:20:35.000Z","bios":{"en_US":"<p>Tristan “PowerOfEvil” Schrage has skill well beyond his years. PowerOfEvil is best known for his mechanical outplays, especially on Cassiopeia, Syndra, and Orianna. And if you don't know him for his mechanical ability, you probably know him for his bizarre champion picks in the mid lane -- we're looking at you, Smite Kayle... with Devourer. PowerOfEvil's success led him to a new team at the end of 2015 -- Origen.</p>\n\n<p>Even under the tutoring of 2016 All-Star mid laner xPeke, PowerOfEvil struggled to find his groove and eventually left Origen at the end of the year. He’s still brimming with untapped potential, and Misfits decided to pick him up in order to bolster their roster. A change of scenery may finally unlock all the talent that has only been seen in spurts since his move to Origen. The time has come for PowerOfEvil to show that his resilience has lead to growth. It’s now or never for the youngster and the stakes can’t get much higher.</p>","pl_PL":"<p>Tristan rozpoczął piąć się w górę w czwartym sezonie, kiedy zaczął być rozpoznawalny w społeczeństwie League of Legends jako naprawdę silny mid-laner. Co prawda grał w różnych drużynach, lecz skupiał się głównie na grze ESL Pro Series i Challenger Series. Jego celem było dostanie się do rozgrywek EU LCS. Ostatecznie dołączył do zespołu Unicorns Of Love, jednak po przegranej z Ninjas in Pyjamas opuścił go na miesiąc. Po tym meczu bardzo pozytywnie wypowiedział się o nim „Alex Ich”, weteran sceny esportowej, będący pod wrażeniem jego umiejętności na mid-lanie. Kiedy \"PowerOfEvil\" wrócił do różowej drużyny, ona w międzyczasie dostała się do turniej kwalifikacyjnego do wiosennego sezonu LCS 2015. To zmobilizowało go do poprawy swoich wyników. Pomimo przegranej z H2K, udało mu się dokonać zemsty na zespole NiP, wygrywając z nim. Dzięki temu zwycięstwu znalazł się w EU LCS 2015.</p>\n<p>\nKiedy \"PowerOfEvil\" znalazł się na profesjonalnej scenie, miał okazję zademonstrować publice swoje najsilniejsze strony. Poprowadził Unicorns Of Love do wielu zwycięstw w wiosennym sezonie 2015, bezlitośnie niszcząc przeciwników Syndrą i Cassiopeią – jednymi ze swoich ulubionych bohaterów. Jego zdolność do zdobywania przewagi samemu, bez dużej pomocy drużyny, sprawiła, że miał też dużą swobodę np. w wyborze postaci. Dzięki dominującej postawie Tristana UOL skończył ten okres na piątym miejscu, czyli naprawdę przyzwoicie. On sam dwukrotnie został wytypowany MVP tygodnia w tym semestrze LCS. Z kolei w letnim sezonie 2015 \"PowerOfEvil\" pokazał jak bardzo niebezpieczny jest grając Orianną i Kog’mawem. Tym razem udało mu się wnieść swoją różową drużynę aż na czwarte miejsce w tym okresie, co jak na gracza, który dopiero w tym roku znalazł się w EU LCS, było niezwykłym osiągnięciem.</p>\n<p>\nNa początku sezonu 6, 13 listopada 2015, Tristan dołączył do zespołu Origen jako szósty zawodnik. Został uznany za tak dobrego mid-lanera, że został z otwartym ramionami przyjęty do drużyny, która dotarła aż do półfinału na ostatnich Mistrzostwach Świata. Swoje członkostwo w nowej organizacji zaczął od sukcesów – wraz z nią wygrał trzecią część 10 sezonu IEM w San Jose. Pokonał tam doświadczone amerykańskie zespoły Team SoloMid i Counter Logic Gaming, nie przegrywając ani jednej gry. To jego pierwsze i prawdopodobnie nie ostatnie tak zdecydowanie zwycięstwo.</p>\n<p>\nPoza mid-lanem PowerOfEvil\" lubi też grać na top-lanie i jako support, lecz zapowiedział już, że na pewno nie zmieni swojej roli. Tak samo jak swojego pseudonimu, którego używał w innych grach przed swoją karierą świecie Runeterry. Jest dumny ze swojej odporności na porażki i panowania nad własnymi emocjami. Na co dzień \" Tristan jest chłopakiem z Bad Soden, w Niemczech, który niegdyś marzył o zostaniu pilotem i lataniu po całym świecie. Zamiast tego, starszy brat zachęcił go do gry w League of Legends, więc realizuje swoje marzenia latając na i wygrywając turnieje. Poza grą na komputerze lubi grać w tenisa i piłkę nożną z przyjaciółmi. Ma szczęście posiadając rodziców, którzy pomimo tego, że woleliby żeby skończył szkołę, wspierają go i pomagają osiągnąć jego cele. </p>\n","es_ES":"<p>Integrante de una familia de ávidos jugones, no es de extrañar que Tristan ‘PowerOfEvil’ Schrage tenga un instinto natural para los videojuegos. Su hermano siguió la estela de su padre, que desde pequeño le introdujo al mundillo ya que acudía a concentraciones de jugadores, y se convirtió en su mentor tras enseñarle el universo de Runaterra.</p>\n\n<p>El alumno, que ocupó la calle central al ser el único rol disponible entre sus amigos, no tardó mucho en superar al maestro. Aunque ambos escalaron posiciones en el ránking hasta alcanzar el rango Aspirante y se iniciaron juntos en el ámbito competitivo con Team Mistral, Gunnar Schrage decidió centrarse en sus estudios. Por contrapartida, PowerOfEvil persiguió la carrera del jugador profesional.</p>\n\n<p>El alemán se unió a EYES ON U, una modesta entidad cuya división europea compitió en la Challenger Series durante la primera mitad de la edición primaveral. Descontento con los mediocres resultados del equipo, que no alcanzó los Playoffs, PowerOfEvil pasó a jugar en dos escuadras al mismo tiempo: por un lado participaba en la ESL Pro Series con Planetkey Dynamics; por otro, ingresó en las filas de Unicorns of Love para volver a competir en la Challenger Series.</p>\n\n<p>Aunque esta vez sí alcanzó la fase eliminatoria, la derrota contra Ninjas in Pyjamas en los cuartos de final le hizo abandonar a los equinos. Para cuando decidió volver a Unicorns of Love, el equipo había logrado la clasificación para los Playoffs de verano. Esta vez galoparon por encima de los ninjas suecos, que les habían derrotado en dos ediciones consecutivas, y consiguieron el pase al Torneo de Promoción.</p>\n\n<p>Aquella eliminatoria contra Millenium supuso la eclosión de Unicorns of Love, que se metió al público en el bolsillo con una quinta partida épica en la que PowerOfEvil destruyó el nexo de los franceses con los últimos puntos de vida que le quedaban a su emblemática Cassiopeia. Sin embargo, fue la primera Intel Extreme Masters celebrada en San José la que catapultó definitivamente a PowerOfEvil al estrellato.</p>\n\n<p>Unicorns of Love acudió al evento gracias a la votación en masa de sus nuevos seguidores, pero aun así llegaba como tapado. Puede que por esta razón el cuerpo técnico de Team SoloMid pasara por alto a Syndra en la fase de selección de campeones, algo que el alemán aprovechó para destrozar a Søren ‘Bjergsen’ Bjerg. Los unicornios no se llevaron el trofeo a casa, pero el joven que quería ser piloto voló de vuelta a casa con una legión de aficionados a sus espaldas.</p>\n\n<p>Ya en la LCS, PowerOfEvil se consolidó como la mayor amenaza de Unicorns of Love, que hizo historia al ganar en los Playoffs al primer clasificado de la fase regular, SK Gaming, gracias a un crucial robo de Barón del mid con Orianna. En la final contra Fnatic sorprendió con Varus, una de sus innovadoras aportaciones al metajuego, pero no fue suficiente para llevarse la corona. Durante el split de verano de la LCS EU 2015, PowerOfEvil continuó siendo el motor de los suyos con campeones relevantes en fases tardías de la partida, como Kog’Maw u Orianna.</p>\n\n<p>Aunque los unicornios no emularon su exitoso paso por los Playoffs, el buen rendimiento del alemán captó la atención de Origen, el equipo que le privó de participar en el Campeonato Mundial 2015. Con sus nuevos compañeros regresó a San José para, esta vez sí, conquistar el campeonato como reemplazo de Enrique ‘xPeke’ Cedeño, uno de los jugadores a los que admira y con el que compartirá el puesto en 2016.</p>","fr_FR":"<p>Le jeune espoir Tristan « PowerOfEvil » Schrage est la première recrue d’Origen depuis la création de la structure. En 2014, le mid laner participe aux Challengers series mais son équipe ne signe pas une grande prestation. Plus tard, il rejoint la formation avec laquelle il se fera connaître : Unicorns of Love. Malgré des résultats discutables, UoL parvient à se qualifier sur le fil pour les play-offs des Challenger series. C’est à ce moment-là que le vent tourne. Plus motivé que jamais, UoL et celui qui se fait surnommer PoE réussissent à obtenir la 3e place en écrasant une équipe Ninjas in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et Aleš « Freeze » Kněžínek, ne cédant que face aux H2k de Fabian « Febiven » Diepstraten.\n\n<p>PowerOfEvil doit alors remporter un match en trois manches gagnantes s’il veut accéder aux League of Legends Championship Series. La victoire semble compromise puisque Millenium, l’équipe adverse, s’offre trois balles de match après avoir remporté les deux premières parties. Mais à ce moment-là, UoL décide de sortir sa botte secrète, Poppy top, et réussit l’impensable, se qualifiant de justesse au segment de printemps 2015.\n\n<p>Devant cette remontée fantastique, un style de jeu osé, des champions atypiques et un nom d’équipe attachant, les invocateurs décident de voter à 48% pour Unicorns of Love afin qu’ils participent aux Intel Extreme Masters San Jose. PowerOfEvil et ses coéquipiers font honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, PoE signe un tournoi exemplaire en se faisant particulièrement remarquer avec LeBlanc et Syndra.\n\n<p>En LCS, le mid laner impressionne encore et obtient le titre de meilleur joueur de la semaine à deux reprises. Il hisse son équipe à la très correcte 5e place de la saison régulière et arrive aux play-offs en tant qu’outsider, mais lui et son équipe démontrent très vite qu’ils sont déterminés en éliminant Gambit Gaming sans trembler. PowerOfEvil ne s’arrête pas en si bon chemin et s’impose face au premier de la saison régulière, SK Gaming, avant de donner du fil à retordre à Fnatic en finale.\n\n<p>Plus qu’un bon joueur, PowerOfEvil aime l’innovation et n’hésite pas à sortir des sentiers battus. Lors du segment de printemps, il joue Orianna avec Châtiment pour s’équiper de l’enchantement Glaive Runique et réussit un quintuplé. Cependant, ses expériences ne sont pas toujours un succès, en témoigne sa Kayle équipée d’un enchantement Dévoreur. Pendant le segment d’été, Unicorns of Love réitère une bonne performance mais échoue à obtenir la troisième place de play-offs. UoL se fait ensuite balayer par Origen et perd toute chance d’accéder au mondial 2015.\n\n<p>Fin novembre, lors des IEM San Jose, PowerOfEvil dispute ses premières rencontres au sein d’Origen, sa nouvelle équipe. Aux commandes de champions qu’il connaît bien, l’Allemand permet à sa nouvelle équipe d’éliminer TSM puis de remporter la finale face à Counter Logic Gaming, sans encaisser la moindre défaite et en montrant un niveau de jeu très convaincant. Ce début est de bonne augure et PoE devrait profiter de l’expérience de Enrique « xPeke » Cedeño-Martinez pour atteindre son plein potentiel cette année.\n","de_DE":"<p>Tristan „PowerOfEvil“ Schrage ist in seinen jungen Jahren bereits extrem talentiert. PowerOfEvil ist vor allem dafür bekannt, seine Gegner mit Cassiopeia, Syndra und Orianna in Sachen Spielmechanik zu übertreffen. Und wer ihn nicht deshalb kennt, kennt ihn wahrscheinlich aufgrund seiner seltsamen Championwahlen für die mittlere Lane – damit meinen wir vor allem Kayle mit Zerschmettern … und Verschlinger. Ende 2015 führte der Erfolg PowerOfEvil zu einer neuen Mannschaft – Origen.\n\nBei Origen hatte PowerOfEvil jedoch trotz der Hilfe des Mid-Laners des All-Stars-Events 2016, xPeke, Probleme, seinen Rhythmus zu finden, weshalb er die Mannschaft am Ende des Jahres wieder verließ. Er steckt immer noch voller Potenzial und die Misfits haben ihn aufgenommen, um ihre Aufstellung zu verstärken. Dieser Tapetenwechsel könnte sein Talent endgültig zum Vorschein bringen, das in seiner Zeit bei Origen nur selten zu sehen war. PowerOfEvil muss jetzt beweisen, dass er sich dank seiner Belastbarkeit verbessern konnte. Der Einsatz ist hoch und für ihn heißt es jetzt: „Alles oder nichts.“</p>"},"foreignIds":{"drupalId":"1455","TRLH3":"200000051","TRLH4":"200000154"},"socialNetworks":{"facebook":"www.facebook.com/thepowerofevil","twitter":"https://twitter.com/PowerOfEvilLoL"},"champions":[],"liveGameTeam":228},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":357,"slug":"ignar","name":"IgNar","firstName":"Dong-geun","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ignar-5rj4dfc4.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-09T11:01:30.000Z","bios":{"en_US":"Dong-geun \"IgNar\" Lee hails from South Korea but got his professional start in North America with Winterfox, although he didn’t appear in a single game for them. He eventually moved back to Korea and played with both Incredible Miracle and KT Rolster, gaining valuable top tier competitive experience.\n\nAfter proving that he could hang with the best in Korea, IgNar once again moved continents, except this time he made his way to Europe to play for the EUCS squad Misfits. He excelled as their support and helped them into the EU LCS. While assisting his team in cutting the Challenger competition down to size, IgNar played Braum, Bard and everything in-between. His wide champion pool should help give Misfits a fighting chance against the best teams Europe has to offer.</p>","de_DE":"<p>Dong-geun „IgNar“ Lee stammt aus Südkorea, hat seine professionelle Karriere aber bei Winterfox in Nordamerika begonnen (obwohl er für die Mannschaft kein einziges Spiel bestritten hat). Daraufhin ging er zurück nach Korea, wo er sowohl mit Incredible Miracle als auch mit KT Rolster Erfahrungen sammeln konnte.\n\nNachdem er bewiesen hatte, dass er es mit den besten Spielern Koreas aufnehmen konnte, zog IgNar nach Europa, um dort in der EU CS für die Misfits zu spielen. Dort lieferte er eine überragende Leistung als Supporter ab und half der Mannschaft, in die EU LCS einzuziehen. IgNar spielte sämtliche Champions von Braum bis Bard und half seiner Mannschaft, die Konkurrenz in der Challenger Series dem Erdboden gleich zu machen. Sein umfangreicher Champion-Pool sollte den Misfits helfen, gegen die besten Mannschaften Europas bestehen zu können.</p>"},"foreignIds":{"drupalId":"3777","TRLH4":"200000156","TRLH3":"200000053"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":392,"slug":"paragon","name":"Paragon","firstName":"Hyun-Il","lastName":"Choi","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/paragon-6qnhxpgh.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-03-07T19:18:45.000Z","updatedAt":"2017-05-31T21:00:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2126","TRLH1":"1001070001","ESPORTSTMNT02":"200000987","TRLH3":"200000252","TRLH4":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1090,"slug":"liv","name":"Hanssama","firstName":"Steven","lastName":"Liv","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/liv-a4dgwahi.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-21T21:14:43.000Z","updatedAt":"2017-06-09T10:54:49.000Z","bios":{"en_US":"<p>Steven \"Hans sama\" Liv got his competitive start in 2015, where he joined up with Milenium. Soon after Milenium lost in the EUCS playoffs, Hans sama made his way to Misfits in June of 2016. He helped propel them through Challenger and into the EU LCS for the 2017 Spring Split.</p>\n\n<p>Hans sama comes into the EU LCS at just 17 years old. Largely unproven and lacking the years of experience that many players have at this level, he will have to learn to adapt quickly and step his game up accordingly. Playing against tried and tested world class talent like Rekkles and Zven will prove to be one of the biggest hurdles of his career. He will need to stand up to the best or get swept aside like the rest. Game on.</p>","de_DE":"<p>Steven „Hans Sama“ Liv begann seine professionelle Karriere 2015, als er von Millenium aufgenommen wurde. Im Juni 2016 wechselte Hans Sama kurz nach der Niederlage von Millenium in den Entscheidungsspielen der EU CS zu den Misfits. Er half der Mannschaft, sich über die Challenger Series für den Frühjahrs-Split der EU LCS 2017 zu qualifizieren.\n\nHans Sama ist gerade einmal 17 Jahre alt, wenn er zum ersten Mal in der EU LCS spielen wird. Ihm fehlt die langjährige Erfahrung der meisten Spieler auf diesem Niveau und er wird lernen müssen, sich schnell anzupassen und zu verbessern. Dabei werden die Spiele gegen herausragende Talente wie Rekkles und Zven zu den größten Hürden seiner bisherigen Karriere. Er wird sich gegen die Besten behaupten müssen, sonst wird er wie der Rest aus der Kluft gefegt. Das Spiel kann beginnen.</p>"},"foreignIds":{"TRLH4":"200000155","TRLH3":"200000052"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1334,"slug":"alphari","name":"Alphari","firstName":"Barney","lastName":"Morris","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alphari-3ozuf4zl.png","hometown":"UK","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:04:28.000Z","updatedAt":"2017-06-09T10:15:34.000Z","bios":{"en_US":"<p>Barney \"Alphari\" Morris began his career in 2015 and his play attracted the attention of Misfits who picked him up for their Challenger squad in 2016. He helped them carve a path through Europe’s Challenger scene and straight into the 2017 EU LCS Spring Split.</p>\n\n<p>Alphari spent time in Korea with his teammates in order to prepare for the challenge of playing at the highest level in Europe. He’ll need to come out of the gate swinging in order to keep up with hardened veterans in the top lane. It’ll largely be a trial by fire for the young talent, but the team’s bootcamp, coupled with tutelage from their veteran players, will play a key role in his development as he steps into one of the greatest challenges of his young career.</p>","de_DE":"<p>Barney „Alphari“ Morris begann seine Karriere 2015 und erregte mit seiner Spielweise die Aufmerksamkeit der Misfits, die ihn 2016 in die Mannschaft aufnahmen. Daraufhin half er der Mannschaft, sich einen Weg durch die europäische Challenger Series zu bahnen und den Frühjahrs-Split der EU LCS 2017 zu erreichen. \n\nAlphari verbrachte mit seinen Teamkameraden einige Zeit in Korea, um sich dort auf die kommenden Herausforderungen in Europa vorzubereiten. Er wird sein Bestes geben müssen, wenn er mit den abgehärteten Veteranen auf der oberen Lane mithalten will. Das junge Talent muss gleich eine Feuerprobe bestehen, wenn die größte Herausforderung seiner bisherigen Karriere beginnt, aber das Training mit der Mannschaft und die Hilfe der Veteranen sollten seine Entwicklung vorangetrieben haben.</p>"},"foreignIds":{"TRLH4":"200000152","TRLH3":"200000049"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28}],"scheduleItems":[{"id":"AVxHBnHRoUG4HPFjOKSW","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:c2aa6465-1971-4eb0-a503-704cbc879369","scheduledTime":"2017-06-10T15:00:00.977+0000","tags":{"blockLabel":"2","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:0ddf2103-0c77-4b59-bec7-7d6599c776b9","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"c2aa6465-1971-4eb0-a503-704cbc879369","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"0ddf2103-0c77-4b59-bec7-7d6599c776b9","league":"3"}],"gameIdMappings":[{"id":"5cc413f0-27dc-4af4-9476-501c76f8f772","gameHash":"50f51ed42afc123f"},{"id":"50998244-ffe3-4d1e-9af7-16dc5f14d658","gameHash":"ce5af80eb465f98d"},{"id":"e5bf6e55-228d-4ac4-a3aa-0764b94adf7a","gameHash":"2e3685a06d503da4"}],"videos":[{"id":7213,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:50998244-ffe3-4d1e-9af7-16dc5f14d658","source":"https://www.youtube.com/embed/2hUig9XtMvw?wmode=transparent&rel=0","createdAt":"2017-06-10T19:30:13.000Z","updatedAt":"2017-07-22T10:25:42.000Z","game":"50998244-ffe3-4d1e-9af7-16dc5f14d658"},{"id":7214,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:5cc413f0-27dc-4af4-9476-501c76f8f772","source":"https://www.youtube.com/embed/futfa5RoEk8?wmode=transparent&rel=0","createdAt":"2017-06-10T19:30:39.000Z","updatedAt":"2017-07-22T10:26:23.000Z","game":"5cc413f0-27dc-4af4-9476-501c76f8f772"},{"id":7250,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:e5bf6e55-228d-4ac4-a3aa-0764b94adf7a","source":"https://www.youtube.com/embed/bCuQIQ4b58Y?wmode=transparent&rel=0","createdAt":"2017-06-11T16:49:31.000Z","updatedAt":"2017-06-11T16:49:31.000Z","game":"e5bf6e55-228d-4ac4-a3aa-0764b94adf7a"}],"htmlBlocks":[],"match":{"id":"c2aa6465-1971-4eb0-a503-704cbc879369","name":"MSF-vs-ROC","position":2,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"games":{"5cc413f0-27dc-4af4-9476-501c76f8f772":{"id":"5cc413f0-27dc-4af4-9476-501c76f8f772","name":"G2","generatedName":"MSF|ROC|G2|c2aa646519714eb0a50","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718998617,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718909339,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718773841,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497122892347,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497112964933,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120061","gameRealm":"TRLH3","platformId":"TRLH3:1002120061","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"50998244-ffe3-4d1e-9af7-16dc5f14d658":{"id":"50998244-ffe3-4d1e-9af7-16dc5f14d658","name":"G1","generatedName":"MSF|ROC|G1|c2aa646519714eb0a50","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"standings":{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}]],"timestamp":1500718955331,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}]],"timestamp":1500718952220,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}]],"timestamp":1500718879996,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}]],"timestamp":1497122798264,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}]],"timestamp":1497110715114,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120054","gameRealm":"TRLH3","platformId":"TRLH3:1002120054","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"e5bf6e55-228d-4ac4-a3aa-0764b94adf7a":{"id":"e5bf6e55-228d-4ac4-a3aa-0764b94adf7a","name":"G3","generatedName":"MSF|ROC|G3|c2aa646519714eb0a50","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497199759026,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497116701078,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120063","gameRealm":"TRLH3","platformId":"TRLH3:1002120063","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718998618,"source":"bestOf","history":[{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718955331,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718952220,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718909339,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718879996,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1500718773841,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497199759026,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497122892348,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497122798265,"source":"bestOf","closed":true},{"result":[[{"roster":"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7"}],[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}]],"timestamp":1497116701079,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b7be6035-5eeb-4f3a-b1c3-e7865b9704a7":1,"f7aa5e2f-7241-45ce-be56-4f324d15a566":0}}}