{"teams":[{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]},{"id":334,"slug":"mysterious-monkeys","name":"Mysterious Monkeys","guid":"d4e897b7-40bd-4e65-94b6-1f8ae531267f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-3dr1fds.png","acronym":"MM","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-ftkht7hy.png","createdAt":"2017-05-23T21:16:39.000Z","updatedAt":"2017-07-30T12:57:14.000Z","bios":{"en_US":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","en_GB":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","es_ES":"<p>Nunca se sabe qué podemos esperar de Mysterious Monkeys. El equipo antes conocido como Misfits Academy se clasificó para la LCS EU durante el torneo de promoción de verano de 2017, en el que Giants Gaming y Origen perdieron sus puestos en la liga. Al mantener la plantilla entera de Misfits Academy, los jugadores están acostumbrados a jugar juntos. Para sobrevivir, Mysterious Monkeys tendrá que dar una vuelta a su estilo de juego ya que, contra equipos europeos sólidos, tienen todas las de perder.</p>\n\n<p>Entrenador principal: Petar \"Unlimited\" Georgiev</p>\n<p>Jefe de equipo: Grant \"Grievance\" Trousseau</p>\n","de_DE":"<p>Niemand weiß genau, was von den Mysterious Monkeys zu erwarten ist. Die Mannschaft, die früher als Misfits Academy bekannt war, hat sich im Sommer-Aufstiegsturnier 2017, bei dem Giants Gaming und Origen ihre Plätze in der Liga verloren haben, für die EU LCS qualifiziert. Da die gesamte Startaufstellung von Misfits Academy zur neuen Mannschaft gewechselt ist, sind es die Spieler gewohnt, zusammenzuspielen. Dennoch sind die Mysterious Monkeys gegen die etablierten Mannschaften klare Außenseiter, die sich weiterentwickeln müssen, wenn sie bestehen wollen.</p>\n\n<p>Cheftrainer: Petar „Unlimited“ Georgiev</p>\n<p>Mannschaftsleiter: Grant „Grievance“ Trousseau</p>\n","fr_FR":"<p>Personne ne sait trop à quoi s'attendre avec les Mysterious Monkeys. Anciennement Misfits Academy, l'équipe s'est qualifiée pour les LCS EU pendant le tournoi de promotion d'été 2017 qui a coûté leur place dans la ligue à Giants Gaming et Origen. La formation de Misfits Academy ayant été préservée, l'équipe a l'habitude de jouer ensemble. Mais en position évidente d'outsiders face à des équipes européennes établies, les Mysterious Monkeys vont devoir faire évoluer leur jeu s'ils veulent survivre.</p>\n\n<p>Entraîneur principal : Petar « Unlimited » Georgiev</p>\n<p>Responsable d'équipe : Grant « Grievance » Trousseau</p>\n","pl_PL":"<p>Nikt tak naprawdę nie wie, czego spodziewać się po Mysterious Monkeys. Drużyna znana wcześniej jako Misfits Academy zakwalifikowała się do EU LCS podczas turnieju o awans do letniego splitu 2017, który przyniósł klęskę i wypadnięcie z ligi Giants Gaming i Origen. Do drużyny przeniósł się cały skład Misfits Academy, więc zawodnicy są dobrze zgrani. Jednak powszechnie uznawani za chłopców do bicia dla pozostałych, uznanych drużyn europejskich, Mysterious Monkeys będą musieli podnieść poziom swoich umiejętności w grze, jeśli chcą przetrwać.</p>\n\n<p>Główny trener: Petar „Unlimited” Georgiev</p>\n<p>Menedżer drużyny: Grant „Grievance” Trousseau</p>\n"},"foreignIds":{},"players":[64,341,660,1333,1343,1574,1715,1863,1914,2082],"starters":[64,341,660,1333,1343],"subs":[1574,1715,1863,1914,2082]}],"players":[{"id":64,"slug":"amazing","name":"Amazing","firstName":"Maurice","lastName":"Stückenschneider","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazing-7k66ma5o.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:18.000Z","updatedAt":"2017-06-20T13:14:44.000Z","bios":{"en_US":"<p>Maurice \"Amazingx\" Stückenschneider's jungle prowess is known on both sides of the Atlantic. Amazing rose to fame when he played a key role in the Copenhagen Wolves' promotion to the EU LCS in late 2013. He then hopped across the pond and spent a brief stint in North America with Team SoloMid, helping lead the team to the 2014 World Championship Quarterfinals. At the end of the season he returned to Europe to join Origen's starting roster in the EU Challenger Series, where he easily earned a berth into the EU LCS. A lifelong basketball player, Amazing's competitive nature drives him to dominate the map and make plays for his team.</p>\n\n<p>After the struggles mounted for Origen in 2016, Amazing left the team at the end of the year and became part of the Fnatic organization shortly after. Amazing fell short of his lofty promises for Origen last year and will make sure that the same doesn’t happen this year. An explosive player on the Rift, Amazing still has the ability to take over games at a moment’s notice. A change of scenery may be just what was needed in order to rekindle Amazing’s in-game fire.</p>","de_DE":"<p>Maurice „Amazingx“ Stückenschneiders Fähigkeiten im Dschungel sind auf beiden Seiten des Atlantiks bekannt. Amazing wurde bekannt, als er beim Aufstieg der Copenhagen Wolves in die EU LCS Ende 2013 eine entscheidende Rolle spielte. Daraufhin überquerte er den großen Teich und half Team SoloMid dabei, das Viertelfinale der Weltmeisterschaft 2014 zu erreichen. Am Ende der Saison kehrte er nach Europa zurück, um Origen dabei zu helfen, die europäische Challenger Series zu gewinnen und wieder in die EU LCS aufzusteigen. Amazing spielt schon sein ganzes Leben lang Basketball und seine Wettkampfmentalität verleitet ihn dazu, die Karte zu dominieren und seine Mannschaft mit seinen Spielzügen zu unterstützen.</p>\n\n<p>Nachdem die Probleme für Origen 2016 immer größer geworden waren, verließ Amazing die Mannschaft Ende des Jahres und wechselte kurz darauf zu Fnatic. Amazing konnte seine stolzen Versprechungen letztes Jahr bei Origen nicht umsetzen und er wird alles dafür tun, dass ihm das in diesem Jahr nicht wieder passiert. Er ist in der Kluft brandgefährlich und kann Spiele von einem Augenblick zum anderen an sich reißen. Ein Tapetenwechsel könnte genau das Richtige gewesen sein, um Amazings Funken erneut zu entfachen.</p>","es_ES":"<p>Nadie pone en cuestión que Maurice ‘Amazingx’ Stückenschneider tiene un don para jugar a League of Legends al máximo nivel, pero el alemán es además un abanderado del trabajo duro, algo que aprendió de Kobe Bryant, su ídolo baloncestístico. Puede que esta mentalidad traicione a su apodo, para el cual se inspiró en la canción de Kanye West con la que comparte título, pero es lo que le ha llevado al éxito.</p>\n\n<p>Aunque en un primer momento Amazing desestimó el juego de Riot Games debido a su estética, la insistencia de su hermano acabó pasando factura y el germano se inició como tirador. No obstante, al igual que en otros títulos a los que había jugado antes, su deseo de tener un mayor impacto en las partidas le llevó a la jungla. Udyr, Shyvana y sobre todo Lee Sin fueron los personajes que utilizó para escalar posiciones en el ránking.</p>\n\n<p>Sus 2 800 puntos de ELO al término de la segunda temporada hicieron que Team Acer se hiciera con sus servicios para acceder a la primera edición de la LCS EU. Ante el fallido intento Amazing abandonó la organización y deambuló sin éxito por varios equipos durante el siguiente año, lo que estuvo a punto de provocar su retirada.</p>\n\n<p>Sin embargo, la salida de Ilyas ‘Shook’ Hartsema dejó una vacante en Copenhagen Wolves que el jungla alemán ocupó. La organización danesa se hizo con un puesto en el split de primavera de la LCS EU 2014 a través del Torneo de Promoción, en el que derrotó a Meet Your Makers sin complicaciones. Amazing, que necesitó casi dos años para ingresar en la máxima liga continental, aprovechó la ocasión para convertirse en una de las revelaciones.</p>\n\n<p>Su destreza con Lee Sin, Elise y Evelynn fue un problema que en ocasiones los rivales no pudieron resolver. El equipo tenía carencias evidentes, pero las buenas actuaciones de Amazing y Konstantinos ‘FORG1VENGRE’ Tzortziou permitieron una modesta participación en los Playoffs.</p>\n\n<p>Pero fue en verano cuando Amazing encontró su oportunidad de oro. Team SoloMid buscaba un recambio para Brian ‘TheOddOne’ Wyllie y el alto nivel mecánico del alemán le convirtió en el mejor candidato. Reemplazar a una leyenda de la organización norteamericana más popular no fue sencillo y al principio Amazing lo pasó mal debido a su escaso repertorio de campeones. Para anularle, los contrincantes bloqueaban varios personajes del jungla, que en una ocasión se vio obligado a seleccionar a Volibear para desgracia de sus aliados. Pese a todo, Amazing fue el jugador más valioso de la cuarta semana y Team SoloMid recuperó la corona que Cloud9 le había arrebatado.</p>\n\n<p>El Campeonato Mundial 2014, en el que se enfrentó a junglas de la talla de Choi ‘DanDy’ In-kyu, le ayudó a llevar su juego al siguiente nivel. Deseoso de regresar a Europa, Amazing aprovechó la oferta de Enrique ‘xPeke’ Cedeño y se unió a Origen, donde se ha asentado como uno de los mejores del continente en su posición con actuaciones sólidas, sobre todo con Gragas.</p>","fr_FR":"<p>Maurice « Amazingx » Stückenschneider est un jungler dont la carrière professionnelle débute en janvier 2014, lorsqu’il se qualifie aux League of Legends Championship Series avec l’équipe Copenhagen Wolves. Connu pour avoir un style de jeu agressif, l’Allemand s’illustre principalement avec Lee Sin pendant le segment de printemps, exposant des mécaniques de jeu solidement rodées. Malheureusement pour lui, cette première aventure en LCS s’avère infructueuse. Après avoir obtenu la 6e place sur 8 lors de la saison régulière, Amazing et son équipe finissent dernier des play-offs et sont contraints de passer par le tournoi de promotion pour conserver leur place en LCS. Après avoir réussi cette entreprise, Amazing reçoit une proposition d’outre-Atlantique : l’équipe Team SoloMid veut s’offrir ses services suite au départ du « Général OddOne ». Amazing accepte l’offre et devient l’un des premiers joueurs européens à s’expatrier aux États-Unis.</p>\n\n<p>Il y retrouve le mid laner danois Søren « Bjergsen » Bjerg, également passé par la case Copenhagen Wolves et trouve une certaine complicité avec ce dernier. Malgré de bons résultats, certains observateurs accusent Amazing d’être trop dépendant de Lee Sin et Elise, ses deux champions les plus joués et les seuls à avoir des ratios de victoires convainquant (respectivement 78% et 89%). Néanmoins, en plus d'être un joueur à la technique aiguisée, Amazing se révèle être un excellent tacticien, ce qui vaudra à son équipe la 3e position de la saison régulière. Auteur de très belles parties avec Nunu et Kha’Zix, le jungler mène son équipe à la première place de la saison estivale des LCS NA.</p>\n\n<p>Au Mondial 2014, TSM réussit à sortir du groupe B à la 2e place, puis s’incline en quart de finale face aux futurs champions du monde, réussissant tout de même à sauver l’honneur lors de la troisième partie. Amazing décide par la suite de quitter TSM pour retrouver son Europe natale. Début décembre, il rejoint les rangs d’Origen, une nouvelle structure dont la première ambition est d’accéder aux LCS via les Challenger series. Le pari est tenu et Amazing se qualifie pour la seconde fois. Contrairement à sa première expérience européenne, celle-ci s'avère fructueuse.</p>\n\n<p>Avec le temps et les patchs, la méta de la jungle a évolué. En 2015, les champions résistants font leur retour en force. Amazing s’en accommode très vite et brille particulièrement avec Rek’Sai et Gragas. Son niveau de vision de jeu est très vite remarqué tant sa présence sur la carte est percutante. En duo avec son support Alfonson « Mithy » Aguirre Rodriguez, Amazing réussi à contrer les initiatives adverses et à prendre le contrôle de la vision dans un nouveau style d’agressivité. Ces performances permettent à son équipe de se hisser à la 2e place de la saison estivale des LCS EU et d’obtenir la 2e place des play-offs. Au mondial 2015, Amazing rivalise avec les meilleurs, guidant son équipe jusqu’en demi-finale.</p>","pl_PL":"<p>Pochodzący z Bocholt w Niemczech, Maurice Stückenschneider to zawodnik, którego sława wciąż rośnie. Pierwszy raz zanurzył się w wirtualny świat gier w wieku pięciu lat, dając się porwać starym grom na konsole. Przez parę kolejnych lat nie ciągnęło go do klawiatury i myszki, zdecydowanie bardziej wolał zostać przy padzie. Dopiero w 2010 roku skusił się na grę na komputerze, z okazji wzięcia udziału w wydarzeniach związanych z ESL. Pierwotnie League of Legends odrzucało Maurice’a ze względu na grafikę podobną do kreskówek. Dopiero jego brat nakłonił go do tego, żeby spróbował w nią zagrać.</p>\n<p>\nSwój debiut w świecie Runeterry \"Amazing\" rozpoczął od fascynacji postaciami AD Carry. Po pierwszym sezonie zmienił swoje upodobania. Jego zainteresowanie skupiło się na Jungli, ponieważ chciał mieć większy wpływ na grę. Grając Udyrem, Shyvaną i Lee Sinem udało mu się osiągnąć zawrotny wynik 2,8 tysiąca Elo w drugim sezonie. Jego progres nie umknął uwadze sporej ilości drużyn, po wielu perypetiach skorzystał z oferty Copenhagen Wolves. Z tą drużyną miał okazję pierwszy raz pokazać się na EU LCS, lecz wiosenny sezon 2014 z tą drużyną skończył się na meczach relegacyjnych.  \"Amazing\" odszedł z CW, ale w międzyczasie jego sława zdążyła dotrzeć aż za ocean. Został doceniony przez powszechnie znaną drużynę Team SoloMid. Pomimo powszechnej krytyki jego małego zasobu bohaterów,  wykorzystał swoje umiejętności z tym zdecydowanie lepszym w tym czasie zespołem. Efektem tego było pierwsze miejsce w letnim sezonie 2014, gwarantujące drużynie miejsce na Mistrzostwach Świata 2014. 11 października tego samego roku Maurice odszedł z TSM, powołując się na sprawy rodzinne i wrócił do swojej ojczyzny.</p>\n<p>\n\"Amazing\" na początku swojej kariery w Jungli wzorował się na Danilu \"Diamondprox\" Reshetnikovie, bardzo sugerując się bohaterami, których Rosjanin wybierał. Jednak ostatecznie ulubionymi bohaterami Maurice’a są: Xin Zhao, Shyvana, Lee Sin i Nautilus. Duży wpływ na niego miały też gwiazdy z innych dziedzin. Ze względu na to, że w przeszłości grał zawodniczo w koszykówkę, jednym z jego idoli jest Kobe Bryant, a ulubioną drużyną Los Angeles Lakers. Stąd też wywodzi swoje motto: „Ciężka praca pokonuje talent”. Cieszy swoich fanów aktywnością na Twitterze, gdzie lubi narzekać na sprawy, które go irytują. Mocny charakter Maurice’a widać także w rozmowach z nim. W wywiadzie przed półfinałem Mistrzostw Świata 2015 powiedział „Nie boję się SKT T1”.\n</p>","pt_BR":"<p>\nA fama de Amazingx vem dos dois lados do Atlântico. Ele apareceu no cenário quando subiu com a Copenhagen Wolves para a LCS em 2013. Então ele cruzou o oceano e jogou por um tempo na TSM, ajudando a levar o time até as quartas de final. No final da temporada, ele voltou para a Europa e se juntou à Origen para disputar a Série Desafiante da LCS EU.</p>\n<p>\nEle jogou basquete por muitos anos, e sua natureza competitiva o motiva a dominar o mapa e fazer jogadas para o time. Ele teve lampejos de genialidade ao longo da carreira, mas seu desempenho se consolidou como nunca na Origen. Qual o próximo passo? Amazing só consegue pensar no Mundial. E você vai dizer que ele está errado?</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">정글러로서 Maurice \"Amazingx\" Stückenschneider 선수의 실력은 북미와 유럽 양쪽에서 유명합니다. Amazing 선수는 Copenhagen Wolves의 2013년 말 유럽 LCS 승급에 결정적인 역할을 하며 이름을 널리 알렸죠. 그리곤 대서양을 건너 북미에서 잠시 Team SoloMid에 합류해 2014년 월드 챔피언십 8강까지 진출하는 데 톡톡한 공을 세웠습니다. 그리고 시즌이 끝난 후 유럽으로 돌아와 Origen의 창단 멤버로 유럽 Challenger 시리즈에 출전했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">어릴 때부터 농구를 해온 덕에 지기 싫어하는 면모가 있어 경기를 할 때도 맵을 장악하고 플레이 메이커 역할을 하는 모습을 쉽게 볼 수 있습니다. 선수 생활을 시작할 때부터 뛰어난 실력을 계속 보였던 Amazing 선수이지만 훨씬 꾸준한 모습을 보여준 건 Origen에 합류하면서부터였습니다. Origen의 데뷔 시즌인 2015년, 월드 챔피언십에서 준결승까지 올라갔으니 올스타의 반열에 드는 게 당연해 보입니다. Amazing 선수가 앞으로 어떤 행보를 보일지 매우 기대됩니다. </p>\n","el_GR":"","es_AR":"","ro_RO":"","es_MX":"","tr_TR":"","en_PL":"","ru_RU":"","it_IT":"","en_GB":"","hu_HU":"","cs_CZ":""},"foreignIds":{"drupalId":"1102","TRLH3":"200000056","TRLH4":"200000159"},"socialNetworks":{"azubu":"azubu.tv/amazing","facebook":"https://www.facebook.com/amazinglolx?fref=ts","twitter":"https://twitter.com/Amazing_EU"},"champions":[],"liveGameTeam":334},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":341,"slug":"kikis","name":"Kikis","firstName":"Mateusz","lastName":"Szkudlarek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kikis-9px5rew4.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-06-20T13:17:06.000Z","bios":{"en_US":"<p>\nMateusz “Kikis” Szkudlarek launched his esports career in 2012 with MeetYourMakers. Kikis spent several years battling it out in the EU Challenger scene before breaking into the EU LCS in 2015 with the Unicorns of Love. He later moved to G2 Esports, helping them to qualify for the EU LCS while also moving out of the jungle and into the top lane.\n</p>\n<p>\nKikis acclimated quickly to the top lane as G2 consistently unraveled opponents leading to a 1st place finish in the 2016 EU LCS Spring Split. After parting ways with G2, Kikis found his way to another top European team: Fnatic. The burden of high expectations lies squarely on Kikis’ shoulders -- but that’s something that he (and his scarves) are used to.\n</p>","de_DE":"<p>Der erste Gedanke, der dabei vermutlich gerade durch den Kopf geht ist „Moment einmal, ist der nicht Jungler?“. </p>\n\n<p>Naja, er war es schließlich vor nicht allzu langer Zeit einmal. Heute ist Mateusz „Kikis“ Szkudlarek, wie ihr schon richtig gelesen habt, der Top-Laner bei G2 Esports. Doch wusstet ihr auch, dass Kikis Karriere eigentlich als Top-Laner begann? Wirklich bekannt wurde der Pole erst mit seinem Durchbruch in die EU LCS mit Unicorns of Love, als er mit seinen Teamkameraden sich durch die EU Challenger Series für die europäische Erstliga qualifizierte. Sein Weg begann jedoch schon weit in der Vergangenheit, nämlich zum Zeitpunkt, als League of Legends gerade in die erste Saison der kompetitiven Szene startete. 2011 schafften Kikis und seine Mannschaft exGameburg Team sich einen Platz in seinem ersten internationalen Turnier, die 2011 World Cyber Games, zu ergattern. Gastgeber war das prestigeträchtige Najin e-mFire, welches durch die Hand des europäischen Teams fiel. Kikis Team schlug ebenso die nordamerikanische Mannschaft Counter Logic Gaming und schaffte es bis ins Finale gegen Chicks Dig ELO, ein Team bestehend aus einer Mischung aus späteren Team SoloMid- und Counter Logic Gaming-Spielern.</p>\n\n<p>Nach der Silbermedaille schlug sich der stilhafte Schal-Connaisseur für drei Jahre durch verschiedene Mannschaften, darunter auch namhafte Organisationen wie MeetYourMakers, mousesports und Team ROCCAT. Als Teil von EloHell spielte er in der regionalen KO-Phase Europas der zweiten Saison, schied allerdings bereits im Vierteilfinale aus. Ende 2013 wechselte Kikis in die Jungle-Rolle und begann für einige Mannschaften der EU CS zu spielen, in der Hoffnung eines Tages den Schritt nach ganz oben zu schaffen. </p>\n\n<p>Mit UOL kam der Durchbruch und auch der massive Strom an Fans, vor allem durch die verrückten Champions, die Kikis in den wichtigsten Spielen seiner Mannschaft auspackte. Mal war es Udyr und ein anderes Mal Gnar, beides Champions, welche wohl kein anderer Jungler der Welt sich trauen würde anzufassen. Besonders nicht im Halbfinale der EU LCS Spring 2015. Da fragt man sich, wie viel Vertrauen seiner Mannschaft sich Kikis verdient haben muss und wie viel Mut man braucht, um eine solche Aktion durchzuziehen. </p>\n\n<p>Im Laufe der folgenden Sommersaison entschied sich der Pole wegen seiner mangelhaften Leistung die Mannschaft zu verlassen und es mit einem Neuanfang bei Gamers2 zu versuchen. Der Wechsel auf die Top-Lane fand schließlich nach einer erfolgreichen Qualifikation für die Rückkehr in die LCS statt, als er seine neuen Jungler Kang-yoon „Trick“ Kim willkommen hieß. </p>\n","fr_FR":"<p>S’il existait un concours du joueur à avoir parcouru le plus d’équipes dans sa carrière, Mateusz « Kikis » Szkudlarek en serait sûrement le grand favori. Le Polonais a déjà porté les couleurs de plus de 20 équipes en 5 années, tantôt en toplane, tantôt en jungle et parfois même en midlane. Alors qu’il n’a que 15 ans, Kikis commence la compétition et participe à des dizaines de tournois. Les résultats sont parfois au rendez-vous, comme quand il envoie au tapis une équipe coréenne en 2011 et obtient la 2e place du tournoi international World Cyber Game ou quand il remporte la Gamers Assembly 2012 face à des équipes européennes comme Counter Logic Gaming Europe.</p>\n\n<p>En 2014, Kikis participe à la première édition des Challenger Series de printemps, mais son équipe Pulse Esports est rapidement éliminée. La seconde édition est davantage un succès. Avec Denial eSports, le Polonais parvient à accrocher la 3e place des play-offs et décroche ainsi son ticket pour le tournoi de promotion. Malheureusement, le joueur et son équipe s’inclinent face à l’équipe sortante, Copenhagen Wolves et échouent à la porte des League of Legends Championship Series. </p>\n\n<p>La saison estivale des Challengers Series de Kikis suit le même schéma : élimination précoce lors de la première édition, accès au tournoi de promotion avec SK Gaming Prime — une équipe différente — lors de la seconde puis échec face à l’équipe issue des LCS, cette fois-ci Gambit Gaming. Finalement, Kikis rejoint une équipe qui, elle, est parvenue à se qualifier aux LCS : Unicorns of Love.</p>\n\n<p>C’est dans cette structure que Kikis connaît ses plus grands succès. Aussitôt arrivé dans le club très fermé des licornes capables de tenir une souris, aussitôt il dispute une compétition internationale : les Intel Extreme Masters San Jose. Le Polonais, dans tout son art, innove comme personne. Face à Team SoloMid, il invoque Twisted Fate jungle et se saisi de l’enchantement Dévoreur, avec lequel il connaît un grand succès et marque les esprits. UoL parvient finalement à se hisser en finale, où l’équipe s’incline face à Cloud9. En LCS, Kikis se montre au niveau et tient tête aux meilleurs. Son équipe se hisse à la très correcte 5e place de la saison régulière. Aux play-offs, il étonne à nouveau en jouant un Shaco très convainquant face à Gambit Gaming. En demi-finale face à SK Gaming, le premier de la saison régulière, il sélectionne Gnar jungle et participe à la victoire de son équipe. La belle aventure se termine sur une finale très serrée dont Fnatic est le seul vainqueur. </p>\n\n<p>Avant la fin de la saison régulière d’été, Kikis quitte Unicorns of Love et rejoint Gamers2. Il aide l’équipe à se hisser à la 3e place des Challengers Series puis contribue à la qualifier aux LCS en s’imposant face à SK Gaming. Depuis, le joueur a cédé sa place de jungler et est retourné à ses premiers amours : la voie du haut.</p>\n","es_ES":"<p>Mateusz “Kikis” Szkudlarek comenzó su carrera de esports el año 2012 junto a MeetYourMakers. Kikis pasó varios años junto a los jugadores europeos de nivel Aspirante hasta que por fin se abrió paso a la LCS en 2015 con los Unicorns of Love. Sus actuaciones con Nidalee y Nunu son dominantes, y el marcador de juego con sus junglas preferidos en el split de primavera ha sido de 6V-2D. Como homenaje al estilo poco ortodoxo de UOL, incluso se atrevió con Shaco una vez a pesar de que muchos consideran que el campeón no es jugable actualmente.</p>\n<p>Kikis pasó de UOL a G2 Esports en 2015, y su debut para el equipo ayudó a G2 a clasificarse para la LCS EU. Este 2016, Kikis ha pasado de la jungla a la calle superior de G2. Solo hay una explicación: ha llegado el momento de desatar el poder de Shaco en la calle superior (o eso esperamos).</p>","pl_PL":"<p>Mateusz bezsprzecznie należy do grona najpopularniejszych polskich zawodników. Równolegle wybija się zdolnościami wśród innych graczy na arenie międzynarodowej. Mało kto może się pochwalić taką wprawą jak „Kikis” na profesjonalnej scenie, gdyż jest jej częścią od początku pierwszego sezonu. Do tego przyczyniło się członkostwo w ponad 20 różnych, bardziej lub mniej znanych, drużynach. Takie doświadczenie, zyskane podczas wspólnej gry z graczami z całej Europy, jest unikatowe na skalę światową. </p>\n<p>Podczas swojej długiej kariery w League of Legends „Kikis” zgromadził mnóstwo imponujących trofeów. Pierwszym znaczącym sukcesem było drugie miejsce na Samsung Euro Championship 2011. Wyjątkowość tego wydarzenia polegała na pokonaniu zespołów reprezentujących Kanadę i Koreę – Counter Logic Gaming i Najin e-mFire. Dla polskiej reprezentacji i Mateusza to był debiut w rozgrywkach na najwyższym poziomie. Po doskonałym starcie do sezonu czwartego „Kikis” brał udział w gigantycznej ilości wydarzeń różnej rangi – od regionalnych turniejów po światowe imprezy jak IEM w San Jose. W międzyczasie cały czas próbował swoich sił w Challenger Series grając w rozmaitych zespołach, jak na przykład: Denial eSports i Lublin Shore. Niestety przeważnie kończył na czwartym miejscu, bez możliwości walki o wejście do kolejnego etapu. Kwalifikacja do turnieju promocyjnego udała mu się dopiero w szeregach SK Gaming Prime, lecz na jego drodze do EU LCS stanął legendarny już zespół Gambit Gaming. „Kikis” poniósł porażkę w starciu z potęgą czerwonej gwiazdy, lecz ostatecznie i tak zagrał w wiosennym sezonie EU LCS 2015. Szansę na pokazanie się zawdzięcza ofercie of Unicorns Of Love, która przyjęła go do głównego składu z szeroko rozłożonymi ramionami. Ten okres przyniósł wiele sukcesów Mateuszowi. W grudniu 2014 roku zajął drugie miejsce na wielkim wydarzeniu – IEM w San Jose, ulegając tylko Cloud9. Natomiast w wiosennym sezonie zespół UOL zajął piąte miejsce, lecz podczas rozgrywek barażowych pokazał pazur. „Kikis” i jego ekipa pokonali Gambit Gaming i zajmujący pierwsze miejsce SK Gaming. Zostali pokonani dopiero w finale w bardzo wyrównanej batalii przeciwko Fnatic z wynikiem 3:2.</p>\n<p>„Kikis” gra profesjonalnie zarówno w jungli jak i na top-lanie, w zależności od potrzeb swojego zespołu. Uwielbia grać Lee Sinem, Shenem i Elise, lecz potrafi pozytywnie zaskoczyć widzów każdym bohaterem. Najgłośniejszym zagraniem Mateusza był doskonały gank Udyrem na drugim poziomie w meczu przeciwko Gambit Gaming podczas wiosennych rozgrywek barażowych. Większość analityków jest zgodna, że „Kikis” to gracz absolutnie nieszablonowy, co jest jego największą zaletą. Tymczasem fani kochają go za prostolinijność, ponieważ nigdy nie wstydził się mówić, tego co naprawdę czuje. Dlatego posiada szczerze oddane grono wielbicieli, którzy podążają za nim, kiedy przenosi się do kolejnych zespołów.</p>\n","es_AR":"<p>Mateusz 'Kikis' Szkudlarek comenzó su carrera en los Esports en 2012 con MeetYourMakers. Kikis pasó varios años peleando en la escena del Challenger de la UE antes de iniciarse en la LCS de la UE en 2015 con los Unicorns of Love. Es mejor conocido por sus actuaciones dominantes usando a Nidalee y Nunu, sus jungleros favoritos, y por mantener un récord de 6 ganados contra 2 perdidos durante el curso del Torneo de Primavera de 2015 de la LCS de la UE. Y en una ocasión, con un estilo poco convencional para UOL, llegó a usar a Shaco; un campeón que muchos consideran injugable en competencias profesionales.</p>\n\n<p>Kikis pasó de UOL a G2 eSports en 2015 y, su debut en el equipo, les permitió calificar para la LCS de la UE. Kikis realizó otro movimiento en 2016, al salir de la jungla para entrar al carril superior de G2. Solo puede haber una explicación para esto: es la hora del terror Iluminati del carril superior conocido como Shaco el Muñeco Sorpresa (eso esperamos).</p>"},"foreignIds":{"drupalId":"1469","TRLH3":"200000263","TRLH4":"200000315","TRLT3":"35063","TRLH2":"1001250015","FRA1TMNT2":"25428"},"socialNetworks":{"twitch":"www.twitch.tv/kikis1205","facebook":"www.facebook.com/MSkikis","twitter":"https://twitter.com/kikis1205"},"champions":[],"liveGameTeam":334},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":660,"slug":"cozq","name":"CozQ","firstName":"Sofyan","lastName":"Rechchad","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cozq-7eq65vwu.png","hometown":"Hertogenbosch","region":"EU Challenger Series","birthdate":"1995-05-21","createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-07-06T13:27:23.000Z","bios":{"en_US":"<p>Sofyan \"CozQ\" Rechdad is the mid laner for Mysterious Monkeys. The Dutch mid laner bounced between numerous teams to start his career, which included a brief stint with Turkish team Dark Passage. He found a home on Misfits Academy to start 2017 and helped the team qualify for the EU LCS. He'll remain the starting mid laner for Mysterious Monkeys after the ownership change. He's proven capable on a wide range of mid lane champions, which bodes well for his chances in the LCS.</p>","pl_PL":"Sofyan „CozQ” Rechdad jest środkowym Mysterious Monkeys. Zaczynając karierę, duński środkowy przeskakiwał między wieloma drużynami, zaliczając między innymi krótkie występy w tureckiej drużynie Dark Passage. Na początku 2017 roku znalazł swoje miejsce w Misfits Academy i pomógł drużynie zakwalifikować się do EU LCS. Po zmianie właściciela drużyny pozostanie środkowym w pierwszym składzie Mysterious Monkeys. Pokazał, że świetnie sobie radzi z szerokim wyborem środkowych bohaterów, co dobrze wróży jego szansom w LCS.","fr_FR":"Sofyan « CozQ » Rechdad est le mid laner des Mysterious Monkeys. Le Hollandais a enchaîné les équipes au début de sa carrière, avec notamment un bref séjour chez les Turcs de Dark Passage. Il a finalement trouvé sa place chez Misfits Academy début 2017 et a aidé l'équipe à se qualifier pour les LCS EU. Il conserve sa place de mid laner titulaire des Mysterious Monkeys malgré le changement de propriétaire. CozQ a prouvé son talent avec un large éventail de champions sur la voie du milieu, et les choses se présentent bien pour lui aux LCS, où il devrait avoir toutes ses chances.","es_ES":"Sofyan \"CozQ\" Rechdad es el mid de Mysterious Monkeys. El holandés ha pasado por diversos equipos en el comienzo de su carrera, incluido un breve periodo en el equipo turco Dark Passage. A comienzos de 2017 fue fichado por Misfits Academy y ayudó al equipo a clasificarse para la LCS EU. Seguirá siendo el mid titular de Mysterious Monkeys después del cambio de propietario. Ha demostrado ser capaz de jugar con una gran variedad de campeones, lo que le augura un buen futuro en la LCS.","de_DE":"Sofyan „CozQ“ Rechdad ist der Mid-Laner der Mysterious Monkeys. Der Holländer wechselte zu Beginn seiner Karriere zwischen mehreren Mannschaften hin und her und war für kurze Zeit Teil der türkischen Mannschaft Dark Passage. Zum Jahresbeginn 2017 fand er bei Misfits Academy sein Zuhause und half ihnen bei der Qualifikation zur EU LCS. Auch nach dem Besitzerwechsel behält er seine Position als Mid-Laner für die Mysterious Monkeys. Er hat seine Fähigkeiten mit einer großen Bandbreite an Champions auf der mittleren Lane unter Beweis gestellt, was ihm gute Chancen in der LCS verspricht."},"foreignIds":{"drupalId":"3895","FRA1TMNT1":"375382","TRLH4":"200000300","TRNA1":"1000445250","TREU":"1000565102","TREU1":"1000565102","ESPORTSTMNT02":"200001022","TRLH3":"200000248"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1333,"slug":"yuuki60","name":"Yuuki60","firstName":"Florent","lastName":"Soler","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yuuki60-h09ivc6h.png","hometown":"France","region":"EU Challenger Series","birthdate":"1991-06-21","createdAt":"2016-06-03T16:01:57.000Z","updatedAt":"2017-07-06T13:37:56.000Z","bios":{"en_US":"<p>Florent \"Yuuki60\" Soler is the starting ADC for Mysterious Monkeys. The French marksman paired with support Dreams in the bot lane for Misfits Academy to start 2017, eventually qualifying for the EU LCS. He tends to select more utilty-focused ADCs like Ashe and Jhin, preferring to start the fights himself. After besting the EU CS competition, he's ready for his next challenge.</p>","fr_FR":"<p>Yuuki est un ADC reconnu de la scène française de League of Legends. Véritable vétéran, il a porté haut les couleurs de la France dans des tournois internationaux. Connu pour son positionnement impeccable, il a su créer des duos d'anthologie. </p>\n<p>On ne compte plus le nombres de trophées que Yuuki a pu remporter, sous les couleurs de aAa, Worth It mais aussi Gamers 2 ou il s'illustrait avec Dioud. </p>\n<p>Toujours au plus haut de sa forme, Yuuki a remporté la deuxième place de la Lyon e-Sport #9 avec ses coéquipiers de Renegades pour ensuite rejoindre Misfits en Challenger Series. Aujourd'hui sous le maillot de Millenium, il a a coeur de prouver qu'il reste parmi les meilleurs, et entend bien décrocher le titre de champion de France.</p>","de_DE":"Florent „Yuuki60“ Soler ist der AD-Carry der Mysterious Monkeys. Anfang 2017 tat sich der französische Schütze für Misfits Academy mit Supporter Dreams in der unteren Lane zusammen und trug zur Qualifikation für die EU LCS bei. Er bevorzugt meist unterstützende AD-Carrys wie Ashe oder Jhin und geht gerne zuerst zum Angriff über. Nach dem Sieg in der EU CS ist er bereit für die nächste Herausforderung.","es_ES":"Florent \"Yuuki60\" Soler es el ADC titular de Mysterious Monkeys. El tirador francés jugó con su compañero apoyo, Dreams, en la calle inferior de Misfits Academy al comienzo de 2017 y, finalmente, lograron clasificarse para la LCS EU. Suele decantarse por ADC de utilidad como Ashe y Jhin, ya que prefiere iniciar los combates él mismo. Tras dar lo mejor de sí mismo en la Challenger Series europea, ya está preparado para superar el próximo reto.","pl_PL":"Florent „Yuuki60” Soler to prowadzący w pierwszym składzie Mysterious Monkeys. Na początku 2017 roku roku ten francuski strzelec grał dla Misfits Academy na dolnej alei w parze ze wspierającym Dreamsem i pomógł drużynie zakwalifikować się do EU LCS. Zwykle wybiera bardziej skupionych na walorach użytkowych prowadzących, takich jak Ashe i Jhin, woląc samemu rozpoczynać walki. Po ograniu konkurencji w EU CS jest gotowy na następne wyzwanie."},"foreignIds":{"FRA1TMNT1":"435084","TRNA1":"1000525108","TREU":"1000565112","TRLH4":"200000301","FRA1TMNT2":"45055","TRLH2":"1001250099","TRLH3":"200000249"},"socialNetworks":{"twitter":"https://twitter.com/Yuukii60"},"champions":[],"liveGameTeam":334},{"id":1343,"slug":"dreams","name":"Dreams","firstName":"Min-kook","lastName":"Han","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dreams-dd99r8zs.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-06-06T23:47:30.000Z","updatedAt":"2017-07-06T13:41:55.000Z","bios":{"en_US":"<p>Min-kook \"Dreams\" Han is the Korean support player for Mysterious Monkeys. After earning a spot in the EU LCS while playing with Misfits Academy, he's sticking with the team as it rebrands to Mysterious Monkeys. He'll keep laning alongside his ADC Yuuki60 after finding success in the EU CS. Dreams has showed off a wide champion pool already this year, from shielding supports like Lulu and Karma to more niche picks such as Tahm Kench and Nautilus.</p>","pl_PL":"Min-kook „Dreams” Han jest koreańskim wspierającym w Mysterious Monkeys. Po zdobyciu miejsca w EU LCS z Misfits Academy, został z drużyną, która zmieniła nazwę na Mysterious Monkeys. Szukając dalszego sukcesu w EU CS, będzie walczył na alei obok prowadzącego Yuuki60. Dreams zaprezentował już w tym roku swoją szeroką pulę bohaterów od ochraniających wspierających, takich jak Lulu i Karma, po bardziej niszowe wybory, takie jak Tahm Kench i Nautilus.","fr_FR":"Min-kook « Dreams » Han est le support coréen des Mysterious Monkeys. Après avoir participé aux LCS EU avec Misfits Academy, il a décidé de rester aux côtés de l'équipe, maintenant renommée Mysterious Monkeys. Il continuera de collaborer avec l'ADC Yuuki60 suite à leur succès lors des CS EU. Dreams a déjà utilisé un large éventail de champions cette année, depuis des supports protecteurs comme Lulu et Karma jusqu'à des choix plus originaux comme Tahm Kench et Nautilus.","es_ES":"Min-kook \"Dreams\" Han es el apoyo coreano de Mysterious Monkeys. Tras asegurarse un puesto en la LCS EU jugando con Misfits Academy, permanece en el equipo ahora que ha cambiado su nombre por Mysterious Monkeys. Seguirá formando dúo con su ADC Yuuki60 tras el éxito que cosecharon en la CS EU. Dreams ha demostrado este año que puede dominar una gran variedad de campeones, desde apoyos con escudos como Lulu o Karma a opciones más específicas como Tahm Kench o Nautilus.","de_DE":"Min-kook „Dreams“ Han ist der koreanische Supporter der Mysterious Monkeys. Nachdem er als Teil von Misfits Academy einen Platz in der EU LCS errungen hat, bleibt er der Mannschaft auch nach der Namensänderung zu Mysterious Monkeys erhalten. Er wird im Anschluss an seinen Erfolg in der EU CS weiter an der Seite seines AD-Carrys Yuuki60 die Lane bestreiten. Dreams hat dieses Jahr bereits seinen breitgefächerten Championpool zur Schau gestellt, der von Supportern mit Schilden wie Lulu oder Karma zu eher ungewöhnlichen Wahlen wie Tahm Kench oder Nautilus reicht."},"foreignIds":{"FRA1TMNT1":"435085","TRNA1":"1000525109","TREU1":"1000565114","TREU":"1000565114","TRLH4":"200000302","ESPORTSTMNT02":"200001024","TRLH3":"200000250"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1574,"slug":"abbedagge","name":"Abbedagge","firstName":"Felix","lastName":"Braun","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/abbedagge-dy39ro6t.png","hometown":"Almanya","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T22:14:09.000Z","updatedAt":"2017-03-06T16:30:39.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001189"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1715,"slug":"kitty","name":"Kitty","firstName":"Sanders","lastName":"Everink","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kitty-67qf6sp8.png","hometown":null,"region":"EU LCS","birthdate":"1994-10-17","createdAt":"2017-01-19T08:40:34.000Z","updatedAt":"2017-05-31T21:37:09.000Z","bios":{"en_US":"","fr_FR":"<p>En participant au Challenge France, le Carry AD des Gamers Origin souhaite ajouter une nouvelle étape à son palmarès. En effet, depuis le début de sa carrière en Saison 1, il a remporté plusieurs compétitions de haut niveau en 2016 telles que l'ESL Madrid avec l'équipe Baskonia, ou l'ESL Benelux. Il arrive désormais dans une nouvelle ligue et a tout à prouver avec ses nouveaux coéquipiers.</p>\n\n<p>Il affectionne tout particulièrement des champions très agressifs comme Draven ou Ezreal, un style de jeu qui s'accordera parfaitement avec son support Targamas.</p>"},"foreignIds":{"esportstmnt05":"200000957","TRLH3":"200000309","TRLH4":"200000409"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1863,"slug":"inition","name":"Inition","firstName":"Lukas","lastName":"Otter","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inition-6kxcqgyh.png","hometown":"Avusturya","region":"EU LCS","birthdate":null,"createdAt":"2017-04-14T10:23:40.000Z","updatedAt":"2017-05-31T21:39:04.000Z","bios":{},"foreignIds":{"TRLH3":"200000310","TRLH4":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1914,"slug":"phones","name":"Phones","firstName":"Christian","lastName":"Sieg","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phones-7zhwlue6.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T22:02:28.000Z","updatedAt":"2017-05-31T21:43:42.000Z","bios":{},"foreignIds":{"TRLH3":"200000308","TRLH4":"200000408"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":2082,"slug":"quicktimer","name":"Quicktimer","firstName":"Ricardo","lastName":"Schipper","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quicktimer-be9qv8fs.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-07-30T12:53:12.000Z","updatedAt":"2017-07-30T12:48:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":334}],"scheduleItems":[{"id":"AVxHGOutQMQFcjhwbQ38","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:c3e3d309-c9c8-405a-ba88-49e070ee4765","scheduledTime":"2017-07-29T18:00:00.323+0000","tags":{"blockLabel":"8","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"c3e3d309-c9c8-405a-ba88-49e070ee4765","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"96b9c2dd-eea1-4064-aa98-e6f90d17b6b9","gameHash":"5ab2506217274e92"},{"id":"15430e1a-faa0-4432-a9ed-978b85957fd9","gameHash":"e85230dc3895e0e3"},{"id":"c94eafc0-e213-4a2b-89ca-b2b7ffeeb320","gameHash":"112d2ca22c7fc9fc"}],"videos":[{"id":8273,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:15430e1a-faa0-4432-a9ed-978b85957fd9","source":"https://www.youtube.com/embed/eINGc-n0788?wmode=transparent&rel=0","createdAt":"2017-07-30T12:57:05.000Z","updatedAt":"2017-07-30T12:57:05.000Z","game":"15430e1a-faa0-4432-a9ed-978b85957fd9"},{"id":8274,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:96b9c2dd-eea1-4064-aa98-e6f90d17b6b9","source":"https://www.youtube.com/embed/5gdpsUKRS48?wmode=transparent&rel=0","createdAt":"2017-07-30T12:48:35.000Z","updatedAt":"2017-07-30T12:48:35.000Z","game":"96b9c2dd-eea1-4064-aa98-e6f90d17b6b9"},{"id":8275,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:c94eafc0-e213-4a2b-89ca-b2b7ffeeb320","source":"https://www.youtube.com/embed/axP_zhnKlpU?wmode=transparent&rel=0","createdAt":"2017-07-30T12:49:02.000Z","updatedAt":"2017-07-30T12:49:02.000Z","game":"c94eafc0-e213-4a2b-89ca-b2b7ffeeb320"}],"htmlBlocks":[],"match":{"id":"c3e3d309-c9c8-405a-ba88-49e070ee4765","name":"MM-vs-UOL","position":39,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"},{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],"games":{"96b9c2dd-eea1-4064-aa98-e6f90d17b6b9":{"id":"96b9c2dd-eea1-4064-aa98-e6f90d17b6b9","name":"G2","generatedName":"MM|UOL|G2|c3e3d309c9c8405aba88","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"},{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],"standings":{"result":[[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1501419310907,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}]],"timestamp":1501353961388,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002170158","gameRealm":"TRLH3","platformId":"TRLH3:1002170158","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"15430e1a-faa0-4432-a9ed-978b85957fd9":{"id":"15430e1a-faa0-4432-a9ed-978b85957fd9","name":"G3","generatedName":"MM|UOL|G3|c3e3d309c9c8405aba88","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"standings":{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501419207958,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501360656127,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002170159","gameRealm":"TRLH3","platformId":"TRLH3:1002170159","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c94eafc0-e213-4a2b-89ca-b2b7ffeeb320":{"id":"c94eafc0-e213-4a2b-89ca-b2b7ffeeb320","name":"G1","generatedName":"MM|UOL|G1|c3e3d309c9c8405aba88","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"standings":{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501419290189,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501351260481,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002180189","gameRealm":"TRLH3","platformId":"TRLH3:1002180189","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501419290190,"source":"bestOf","history":[{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501419310908,"source":"bestOf","closed":true},{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501419207958,"source":"bestOf","closed":true},{"result":[[{"roster":"e23eee5c-837e-42c9-8f4c-80b68280f980"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1501360656127,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2":0,"e23eee5c-837e-42c9-8f4c-80b68280f980":1}}}