{"teams":[{"id":9,"slug":"sktelecom-t1","name":"SK telecom T1","guid":"be6c808b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/sktelecom-t1-3mpugoym.png","acronym":"SKT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-08-01T18:16:40.000Z","updatedAt":"2017-05-26T23:47:44.000Z","bios":{"en_US":"<p>SK telecom T1 is the best team in the history of League of Legends. With three World Championships under their belt from 2013, 2015 and 2016, no team comes close to their level of dominance. After a stellar run in 2015 that ended in their second title, SKT struggled to start 2016. They righted the ship by IEM Katowice, finishing first in Champions Spring 2016 and winning the 2016 Mid-Season Invitational.</p> \n\n<p>They hit another snag when they failed to reach the finals in Champions Summer 2016, falling to kt Rolster. But the SKT of old showed up right away at the 2016 World Championship, and Faker led the team to its second straight Worlds win. Entering 2017 with a roster somehow even more packed with talent, anything short of another World Championship would be a disappointment for SKT.</p>\n\n<p>Coach: Jeonggyun “KkOma” Kim</p>","fr_FR":"SK Telecom T1 est la meilleure équipe de l'histoire de League of Legends. Avec trois Championnats du monde à son palmarès en 2013, 2015 et 2016, aucune équipe n'approche de son niveau de domination. Suite à une performance sans faute en 2015 qui s'est soldée par un deuxième titre, SKT a commencé l'année 2016 plus difficilement. L'équipe est finalement parvenue à redresser la barre lors des IEM de Katowice, décrochant la première place du Champions Spring 2016 et remportant le Mid-Season Invitational 2016.\n\nElle s'est ensuite à nouveau retrouvée dans l'impasse en manquant de se qualifier pour la finale du Champions Summer 2016 contre KT Rolster. Mais SKT s'est vite remise sur pied au Championnat du monde et Faker lui a valu sa deuxième victoire consécutive au Mondial. Après avoir dominé la LCK ce printemps, SKT s'apprête à présent à participer au Mid-Season Invitational 2017, au Brésil, en tant que favorite incontestable. Les champions en titre aspirent à la première place et ils ne se contenteront de rien de moins.\n\nEntraîneur : Jeonggyun « KkOma » Kim\n","pl_PL":"SK Telecom T1 to najlepsza drużyna w historii League of Legends. Trzy razy wygrała Mistrzostwa Świata ― w 2013, 2015 i 2016 roku. Żadna inna drużyna nie zbliżyła się nawet do tego poziomu dominacji. Po rewelacyjnych występach w 2015 roku, które zakończyli zdobyciem drugiego tytułu, SKT z trudem zaczynali 2016 rok. Podwyższyli poziom lotów na IEM w Katowicach, kończąc na pierwszym miejscu Champions Spring 2016 i wygrywając Mid-Season Invitational 2016.\n\nKolejne spowolnienie nastąpiło, gdy nie zdołali dotrzeć do finałów Champions Summer 2016, przegrywając z KT Rolster. Ale dawne SKT wkrótce powróciło na Mistrzostwa Świata 2016, a Faker doprowadził drużynę do drugiej z rzędu wygranej na Mistrzostwach. Po zdominowaniu LCK tej wiosny SKT jadą na Mid-Season Invitational 2017 w Brazylii jako zdecydowani faworyci. Cokolwiek poniżej pierwszego miejsca będzie rozczarowaniem dla obecnych czempionów.\n\nTrener: Jeonggyun „KkOma” Kim\n","de_DE":"SK Telecom T1 ist die beste Mannschaft in der Geschichte von League of Legends. Keine andere Mannschaft ist so dominant wie der dreimalige Weltmeister, der sich diesen Titel in den Jahren 2013, 2015 und 2016 sichern konnte. Nach einer überragenden Vorstellung im Jahr 2015, die die Mannschaft mit ihrem zweiten Weltmeistertitel krönte, hatte SKT 2016 Startschwierigkeiten. Beim IEM Katowice konnten sie jedoch das Ruder wieder herumreißen, woraufhin sie den Frühjahrs-Split der LCK 2016 und das Mid-Season Invitational 2016 gewannen.\n\nIm Sommer-Split der LCK 2016 folgte jedoch der nächste Dämpfer, als sie von KT Rolster besiegt wurden und das Finale nicht erreichten. Doch SKT fand vor der Weltmeisterschaft 2016 wieder zu alter Stärke zurück und Faker führte die Mannschaft zu ihrem zweiten WM-Titel hintereinander. Nach einer dominanten Vorstellung im diesjährigen Frühjahrs-Split der LCK kommt SKT als Favorit zum Mid-Season Invitational 2017 in Brasilien. Alles andere als der erste Platz wäre für die regierenden Champions eine Enttäuschung.\n\nTrainer: Jeonggyun „KkOma“ Kim\n","es_ES":"SK telecom T1 es el mejor equipo de la historia de League of Legends. Ganadores de tres Campeonatos Mundiales (en 2013, 2015 y 2016), ningún equipo se acerca a su nivel de superioridad. Tras un año estelar en 2015 que les hizo ganarse su segundo título, el comienzo de 2016 no fue tan sencillo para SKT. Recobraron la fuerza a partir del IEM Katowice, acabaron primeros en el Champions Spring de 2016 y ganaron el Mid-Season Invitational 2016.\n\nSe encontraron con un nuevo obstáculo cuando no lograron llegar a la final del Champions Summer 2016, tras perder contra KT Rolster. No obstante, el SKT al que estábamos acostumbrados volvió a dar la cara en el Campeonato Mundial de 2016, y Faker lideró al equipo hasta su tercer título de campeón mundial. Tras dominar en la LCK esta primavera, SKT llega al Mid-Season Invitational 2017 en Brasil como el máximo favorito. Solo el primer puesto estaría a la altura de las expectativas de los actuales campeones.\n\nEntrenador: Jeonggyun ''KkOma'' Kim\n","pt_BR":"<p>SK Telecom T1 é a melhor equipe da história de League of Legends. Com três Campeonatos Mundiais conquistados em 2013, 2015 e 2016, nenhuma equipe se aproxima da sua soberania. Depois de um jogo excelente em 2015 que resultou no seu segundo título, a SKT começou 2016 com dificuldades. Mas eles conseguiram virar o jogo na IEM Katowice, terminando em primeiro no Champions Spring 2016 e vencendo o Mid-Season Invitational 2016.</p>\n\n<p>Eles encontraram outro problema quando não conseguiram chegar à final no Champions Summer 2016, perdendo para KT Rolster. Mas a velha SKT se mostrou imediatamente no Campeonato Mundial 2016, e Faker liderou a equipe à sua segunda vitória mundial consecutiva. Depois de dominar a LCK desta primavera, a SKT avança para o Mid-Season Invitational 2017, no Brasil, como uma das grandes favoritas. Qualquer coisa menos que o primeiro lutar seria uma decepção para os campeões reinantes.</p>\n\n<p>Técnico: Jeonggyun \"KkOma\" Kim</p>\n","es_AR":"<p>Muchos consideran que SKT T1 es uno de los mejores equipos de League of Legends del mundo, con un primer lugar en los Campeonatos Mundiales 2013 y 2015, y varias finales en la OGN Champions. Su dominio en el 2015 era motivo de gran admiración. SKT se llevó a casa el primer lugar en la Champions de primavera y verano, y luego cerró el año con una actuación casi invicta que le mereció el primer lugar en el Campeonato Mundial 2016.</p>\n\n<p>Luego de su participación estelar en el 2015 y de pasar por varios cambios en el plantel, SKTelecom no tuvo un buen inicio del 2016. Sin embargo, brillarían luego en la competencia con una actuación invicta en el IEM Katowice. Después de eso, todo fue un trámite para SKTelecom. Obtuvieron un primer lugar en la Champions Spring 2016 y nuevamente en el torneo por invitación de mitad de temporada. Sin embargo, el equipo se vio en dificultades y no llegó a la final del torneo de clausura de la LCK 2016. Incluso después de terminar tan mal, SKTelecom siguió siendo uno de los mejores equipos del mundo, y está determinado a limpiar su imagen con otro trofeo mundial.</p>\n\n<p><strong>Entrenador: Kim \"KkOma\" Jeong-gyun</strong></p>","ko_KR":"<p>SKT T1은 전 세계에서 리그 오브 레전드 최강 팀 중 하나로 명성이 자자합니다. 시즌 3 월드 챔피언십 및 2015 월드 챔피언십뿐만 아니라 OGN 챔피언스에서 여러 차례 수위에 올랐죠. SKT T1이 2015년에 보여준 포스는 그야말로 어마어마했습니다. 2015 챔피언스 스프링과 서머에서 연달아 우승한 SKT T1은 2015 월드 챔피언십에서는 통틀어 단 한 경기만을 내주고 월드 챔피언으로 등극하며 한 해를 마무리했죠.</p>\n\n<p>영광의 2015년이 끝난 후 로스터 변경으로 인해 SKT T1는 2016년 시즌 초반 힘겨운 시기를 보냈습니다. 하지만 그것도 잠시, IEM Katowice에서 무패의 기록으로 적을 박살내며 포스가 다시 살아났죠. 그 이후 SKT T1은 여느 때처럼 다시 2016 챔피언스 스프링에서 정상에 섰습니다. 결승에서 ROX Tigers를 꺾은 것은 시작일 뿐입니다. MSI에서 SKT T1은 또 다른 국제 대회 트로피를 쟁취하기 위해 다시 전장에 나설 것입니다.</p>"},"foreignIds":{"drupalId":"684"},"players":[46,327,403,404,715,1025,1026,1033],"starters":[46,327,403,404,715],"subs":[1025,1026,1033]},{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]}],"players":[{"id":46,"slug":"faker","name":"Faker","firstName":"Sanghyeok","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/faker-euaqlz0c.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2017-07-06T14:24:48.000Z","bios":{"en_US":"<p>Sanghyeok \"Faker\" Lee is an icon of modern esports. Known as “The Demon King” in his homeland of South Korea, Faker’s quiet and respectful demeanor in person does little to alert bystanders to his dominance on the Rift. But then he steps onto the stage and shatters the limits of what we thought was possible with just a mouse and a keyboard. Faker was so untouchable in Korea for so long that his opponents started saying he had a 3rd Summoner Spell -- how else could he be so strong?</p>\n\n<p>Faker has already raised the bar for what a mid laner is expected to deliver, lifting the Summoner's Cup at three World Championships, once in 2013, again in 2015, and the third time in 2016. He has also netted his team trophies at Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016, and the 2016 Mid-Season Invitational (whew). After winning every international event that League of Legends offered in 2016, Faker and SKT are looking to sweep the international stage once again in 2017.</p>","fr_FR":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pl_PL":"Sanghyeok „Faker” Lee jest ikoną nowoczesnego e-sportu. Znany w swojej ojczystej Korei Południowej jako „Demoniczny Król”, Faker sprawia wrażenie osoby spokojnej i uprzejmej. Nic nie zdradza tego, że potrafi absolutnie dominować na Rifcie. A potem wchodzi na scenę i przekracza granice wszystkiego, co wydawało się możliwe do osiągnięcia za pomocą zwykłej myszy i klawiatury. Faker był w Korei niepokonany od tak dawna, że przeciwnicy zaczęli posądzać go o stosowanie trzeciego czaru przywoływacza — jak inaczej mógłby być tak silny?\n\nFaker znacznie podniósł poprzeczkę oczekiwań wobec zawodnika środkowej alei, trzykrotnie zdobywając Puchar Przywoływacza na Mistrzostwach Świata — po raz pierwszy w 2013 roku, potem w 2015 roku, a po raz trzeci w 2016 roku. Zdobył także trofea dla swojej drużyny podczas Champions Summer 2013, Champions Winter 2013−2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 i Mid-Season Invitational 2016 (uff!). Po wygraniu każdego międzynarodowego turnieju, jaki League of Legends oferowało w 2016 roku, Faker i SKT zamierzają zabrać do domu kolejny międzynarodowy tytuł zdobyty na Mid-Season Invitational 2017.\n","de_DE":"Sanghyeok „Faker“ Lee ist eine Ikone des modernen E-Sports. In seinem Heimatland Südkorea als der „Dämonenkönig“ bekannt, alarmiert sein ruhiges und stets höfliches Verhalten Zuschauende nur sehr selten über seine absolute Dominanz in der Kluft. Aber dann betritt er die Bühne und beweist uns, dass seine Fähigkeiten mit Maus und Tastatur keine Grenzen kennen. Faker war in Korea so lange unantastbar, dass seine Gegner schon glaubten, er hätte einen dritten Beschwörerzauber – wie hätte er sonst so stark sein können?\n\nFaker konnte den Beschwörerpokal bereits in den Jahren 2013, 2015 und jetzt auch 2016 in die Höhe stemmen und hat die Messlatte für Mid-Laner hoch gelegt. Außerdem sicherte er seiner Mannschaft Titel beim Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 und beim Mid-Season Invitational 2016 (uff!). Nachdem Faker 2016 jedes internationale Event, das League of Legends zu bieten hat, gewinnen konnte, wird er zusammen mit SKT versuchen, sich beim Mid-Season Invitational 2017 den nächsten internationalen Titel zu sichern.\n","es_ES":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pt_BR":"<p>Sanghyeok \"Faker\" Lee é um ícone do dos e-sports moderno. Conhecido como \"O Rei Demônio\" em sua terra natal na Coreia do Sul, sua personalidade calma e respeitosa pode acabar enganando os espectadores de plantão sobre as sua soberania no Rift. Quando ele entra no palco, ultrapassa todo os limites do que achávamos possível com apenas mouse e teclado. Faker ficou invicto na Coreia por tanto tempo que seus oponentes diziam que ele tinha um terceiro Feitiço de Invocador. Afinal como ele poderia ser tão forte?</p>\n\n<p>Faker já elevou as expectativas para jogadores do meio e já pôs as mãos em três Copas do Invocador nos Campeonatos Mundiais, uma em 2013, outra em 2015 e agora uma terceira em 2016. Ele também conseguiu outros troféus para sua equipe na Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e no Mid-Season Invitational 2016 (ufa!). Depois de vencerem todos os eventos internacionais oferecidos por League of Legends em 2016, Faker e a SKT procuram levar para casa outro título internacional no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한국에서 '마왕'이라 불리는 \"Faker\" 이상혁은 현대 e스포츠의 아이콘입니다. Faker의 조용하고 공손한 행동거지와 그가 소환사의 협곡에서 누리는 지배력을 연관짓기는 힘듭니다. 하지만 그가 전장에 들어서면 지금까지 사람들이 마우스와 키보드로 가능하다 생각했던 그 모든 한계들을 깨뜨려버리죠. 한국에서는 Faker가 너무 오랫동안 최강자의 지위를 누린 탓에 그가 세 번째 소환사 주문을 쓸 수 있는 게 아니냐는 말까지 나왔습니다. Faker는 어떻게 그렇게 강할 수 있을까요? </p>\n<p style=”font-family:”나눔고딕”;\">Faker는 미드 라이너에게 기대되는 수준을 이미 끌어올렸고, 2013년과 2015년 월드 챔피언십에서 두 번이나 소환사 컵을 거머쥐었습니다. 2013 챔피언스 서머 시즌, 2013-2014 챔피언스 윈터 시즌, 2015 챔피언스 스프링 시즌, 2015 챔피언스 서머 시즌에도 팀에게 우승컵을 안겨줬죠. 하지만 그의 경쟁력은 전혀 시들지 않은 것처럼 보입니다. Faker는 계속해서 SK Telecom T1의 다른 팀원들과 자기자신을 밀어붙여 새로운 전략을 개발하고 챔피언 풀을 넓힙니다. Faker가 리그 오브 레전드 사상 최고의 선수일까요? 아마도요. 하지만 한 가지만은 분명합니다. 그건 바로 Faker가 최초의 세계 e스포츠 슈퍼스타 중 하나로 역사에 남을 거라는 사실이죠. </p>\n","es_AR":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>","cs_CZ":"<p>Sanghyeok „Faker“ Lee je živoucí legendou moderních esportů. Při osobním setkání s ním by jen málokdo tušil, že tento tichý a uctivý mladík je vládcem Žlebu, kterému v jeho rodné Jižní Koreji přezdívají „Král démonů“. Pak ovšem vkročí na pódium a s pouhou klávesnicí a myší zboří všechny naše představy o tom, co všechno je v lidských silách. Faker byl v Koreji tak dlouho nedotknutelný, až o něm začali jeho soupeři říkat, že má k dispozici 3. vyvolávačovo kouzlo – jak jinak by mohl být tak silný?</p>\n\n<p>Faker zcela změnil standard toho, co se od středového lajnaře ve hře očekává, a třikrát pozvedl nad hlavu Vyvolávačův pohár z mistrovství světa: poprvé roku 2013, poté roku 2015 a potřetí roku 2016. Také se svým týmem získal trofeje z Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 a Mid-Season Invitational 2016 (uf). Poté, co roku 2016 vyhrál všechny mezinárodní turnaje League of Legends, se Faker zúčastní i All-Star 2016 v Barceloně jako absolutní král Žlebu. Jeho bohatá kariéra skvěle odolává zkoušce času a letošní All-Star bude dalším z mnoha úspěchů na jeho kontě. Opět je na čase, abychom byli svědky toho, jak se píše historie.</p>","el_GR":"<p>Ο Sanghyeok \"Faker\" Lee είναι ένας από τους πιο εμβληματικούς παίκτες στα σύγχρονα esports. Στην πατρίδα του, τη Νότια Κορέα, είναι γνωστός ως «Ο Βασιλιάς των Δαιμόνων», αλλά η συγκρατημένη και ευγενική συμπεριφορά δεν προδίδει καθόλου την ηγετική του παρουσία στο Φαράγγι των Επικαλεστών. Όταν όμως ανεβαίνει στη σκηνή, δεν είναι λίγες οι φορές που μας έχει αφήσει με το στόμα ανοιχτό. Απλά δεν πιστεύεις ότι γίνονται αυτά με ποντίκι και πληκτρολόγιο. Ο Faker ήταν τόσο εκτός συναγωνισμού στην Κορέα, για τόσο μεγάλο χρονικό διάστημα που οι αντίπαλοί του άρχισαν να λένε ότι είχε και 3ο Ξόρκι Επικαλεστή. Πώς αλλιώς θα μπορούσε να είναι τόσο ανίκητος;</p>\n\n<p>Ο Faker έχει ήδη θέσει ψηλά τον πήχη όσον αφορά τις προσδοκίες που μπορεί να έχει μια ομάδα από έναν παίκτη μεσαίας λωρίδας. Έχει ήδη σηκώσει το Κύπελλο του Επικαλεστή σε τρία Παγκόσμια Πρωταθλήματα, πρώτη φορά το 2013, μετά πάλι το 2015 και για τρίτη φορά το 2016. Επίσης, έχει οδηγήσει την ομάδα του στην κατάκτηση τροπαίων στα τουρνουά Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 και στο Mid-Season Invitational 2016 (ουφ!). Αφού κέρδισε όλα τα διεθνή τουρνουά του League of Legends για το 2016, ο Faker έρχεται στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη με τον αέρα του αδιαμφισβήτητου κυρίαρχου του παιχνιδιού. Η λαμπρή καριέρα του δεν δείχνει σημάδια κόπωσης και αυτό το Τουρνουά All-Star θα είναι άλλη μια επιτυχία που μπορεί να προσθέσει στο ήδη απίστευτο ενεργητικό του. Είναι έτοιμος να γράψει ιστορία, για ακόμη μια φορά.</p>\n","hu_HU":"Sanghyeok „Faker” Lee a modern e-sport egyik ikonja. A szülőhazájában, Dél-Koreában „Démonkirályként” emlegetett Faker élőben csendes és tisztelettudó ember, de a Szurdokban egészen más arcát mutatja. Teljesen újraírta az elvárásokat azzal kapcsolatban, hogy mit lehet megtenni egy egérrel és egy billentyűzettel. Fakerrel nem bírtak el Koreában, olyannyira, hogy egyesek szerint van egy harmadik idézői varázslata. Máskülönben hogy lehetne ennyire erős?</p>\n\nFaker eleve magasabbra tette a lécet minden középső ösvényes számára, három világbajnokságon emelhette magasba az Idézők Kupáját, 2013-ban, majd 2015-ben és 2016-ban. Ezenkívül a következő trófeákat zsebelte be: Champions 2013-os nyári szakasz, Champions 2013-2014-es téli szakasz, Champions 2015-ös tavaszi szakasz, Champions 2015-ös nyári szakasz, Champions 2016-os tavaszi szakasz, és a 2016-os szezonközi meghívásos verseny (végig se lehet mondani egy levegővel). Faker 2016-ban megnyert minden League of Legends-versenyt, és Barcelonában a Szurdok egyértelmű királyaként lép a 2016-os All-Star gála színpadára. Játéktudásán nem fog az idő vasfoga, és az All-Star gálán tovább gyarapíthatja győzelmeinek hosszú sorát. Bajnoki címből sosem lehet túl sok.\n\n","it_IT":"Sanghyeok \"Faker\" Lee è uno dei simboli degli eSport moderni. Faker, soprannominato \"Re demone\" nella sua natia Corea del Sud, ha un carattere taciturno e rispettoso che non fa minimamente trasparire la sua immensa abilità. Tuttavia, non appena sale sul palcoscenico è in grado di fare letteralmente l'impossibile con un mouse e una tastiera. Faker è rimasto imbattuto per così tanto tempo in Corea che i suoi avversari hanno iniziato a sospettare che avesse accesso a un terzo incantesimo dell'evocatore: come spiegare altrimenti la sua abilità?</p>\n\nFaker ha già scritto una nuova pagina nella storia dei centrali alzando la Coppa degli evocatori per ben tre volte, nel 2013, nel 2015 e poi nel 2016. Si è anche portato a casa parecchi trofei di squadra: Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e il Mid-Season Invitational 2016 (wow!). Dopo aver vinto tutti gli eventi internazionali organizzati da League of Legends nel 2016, Faker sale sul palco dell'All-Star 2016 a Barcellona come re indiscusso della Landa. La sua incredibile carriera resiste a ogni assalto del tempo e questo All-Star rappresenterà un'ulteriore voce da aggiungere alla sua impressionante lista di successi. Stiamo per assistere a un evento storico... di nuovo.\n","ru_RU":"","ro_RO":"Sanghyeok ''Faker'' Lee a devenit reprezentantul competiției de top în lumea eSports. În Coreea de Sud, acolo unde locuiește, este cunoscut ca ''Regele Demon'', iar atitudinea lui tăcută și respectuoasă când e întâlnit pe viu nu-i trădează deloc dominanța în Rift. Dar apoi, urcă pe scenă și distruge orice așteptare pe care am putea s-o avem de la cineva cu un mouse și o tastatură. Faker e atât de intangibil în Coreea de atât de multă vreme încât adversarii lui au început să spună că ar avea o a treia vrajă de invocator – cum altcumva ar putea fi atât de puternic?\n</p>\nFaker a ridicat deja standardele pentru jucătorii de pe culoarul de mijloc, ridicând Cupa Invocatorului la trei Campionate Mondiale, unul în 2013, altul în 2015, iar cel mai recent, în 2016. A reușit să obțină trofee pentru echipa lui și la Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 și Mid-Season Invitational 2016. După ce a câștigat toate evenimentele internaționale posibile de League of Legends din 2016, Faker vine pe scena All-Star Event 2016 din Barcelona ca rege necontestat al Riftului. Cariera sa impresionantă nu e deloc afectată de trecerea timpului, iar acest All-Star Event va putea fi o altă reușită pe care s-o adauge în palmaresul său deja terifiant. E momentul să asistăm din nou la scrierea istoriei.\n","es_MX":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>"},"foreignIds":{"drupalId":"692","ESPORTSTMNT06":"200000357","TRLH1":"200000410","TRLH2":"200000310","TRLT3":"200000208"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":327,"slug":"huni","name":"Huni","firstName":"Seung-hoon","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huni-3vra4c68.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-07-06T14:21:58.000Z","bios":{"en_US":"<p>\nSeung-hoon “Huni” Heo proved himself a dominant force in the NA LCS. He's heading to the LCK with some hard earned wisdom under his belt and a drive to prove he can compete with the best. He may look happy and harmless, but don’t underestimate him. Give him an inch, and he’ll take a quadrakill on Riven.\n</p>\n<p>\nHuni is one of the most confident players you'll find, but it’s hidden underneath a jolly layer. While his previous goal was to defeat the three-time World Champs, he's decided that if you can't beat them, join them.\n</p>","fr_FR":"Seung-hoon « Huni » Heo a prouvé être une force dominante des LCS NA. Cette saison, il est arrivé dans la LCK avec des connaissances durement acquises et la volonté de démontrer qu'il est à la hauteur des meilleurs. Il a l'air heureux et inoffensif, mais ne le sous-estimez pas. Cédez ne serait-ce que d'un pouce et il signera un quadruplé sur Riven.\n\nHuni est l'un des joueurs les plus confiants qui soient, mais il le cache bien sous son air jovial. Son objectif précédent était de vaincre les triples champions du monde, mais il s'est finalement dit, qu'à défaut de les battre, autant les rejoindre. Le Mid-Season Invitational 2017 est sa première opportunité de remporter un événement international avec sa nouvelle équipe et, s'il y parvient, ça risque d'être le début d'une longue série.\n","pl_PL":"<p>\"Huni\" jest nowością, która zaskoczyła całą społeczność League of Legends w sezonie piątym. Zaistniał na scenie dopiero po dołączeniu do dobrze wszystkim znanego zespołu Fnatic w styczniu 2015 roku. Jego wybór był szczęśliwym trafem dla europejskiej drużyny, gdyż wcześniej był tylko partnerem sparingowym dla profesjonalnych zawodników w koreańskiej organizacji Samsung. Czarno-żółci wiele zaryzykowali przyjmując debiutanta do podstawowego składu, lecz wkrótce okazało się to strzałem w dziesiątkę. Heo Seung-hoon, swoim agresywnym stylem gry, podniósł poprzeczkę pozostałym top-lanerom w Europie. W wiosennym sezonie członkowie Fnatic wciąż się poznawali, ale i tak konkurowali o czołową pozycję w EU LCS. Ostatecznie uplasowali się na drugim miejscu, tracąc tylko dwa zwycięstwa do przodującego SK Gaming. Jednak w rozgrywkach barażowych pokazali, że to właśnie oni zasługują na szczyt podium – pokonując wszystkich przeciwników na swojej drodze. \"Huni\" wśród innych graczy wyróżnił się w tak dużym stopniu, że został nagrodzony laurem najbardziej wartościowego zawodnika. Osiągnięcia poprawił w kolejnym sezonie, ponieważ w lecie pobił światowy rekord w regularnych rozgrywkach. Przez cały ten okres nie przegrał ani jednego meczu - takiego wyczynu nawet nie da się porównywać, ponieważ jest absolutnie unikalny.</p>\n<p> \nKiedy \"Huni\" dostał się do Mistrzostw Świata 2015 był już powszechnie znany i niesłychanie popularny. Jego występ na tej imprezie tylko przysporzył mu sławy, gdyż nie zawiódł swoich fanów i wyszedł z grupy na pierwszym miejscu. Zwycięstwem z potężnym zespołem EDG w ćwierćfinale przełamał wraz z Fnatic długą passę azjatyckich drużyn. Uległ dopiero w półfinale walcząc z KOO Tigers, koreańską potęgą, jednak te osiągnięcia dla europejskich kibiców były w pełni satysfakcjonujące. Po tym wydarzeniu w wywiadzie dla Redbulla powiedział: „Po Mistrzostwach byłem trochę skołowany, bo nie wiedziałem co dalej robić. Jednocześnie chciałem zdobyć nowe doświadczenie w Ameryce.” Tak \"Huni\" tłumaczył odejście z szeregów Fnatic w listopadzie 2015 roku i dołączenie miesiąc później do nowopowstałej wtedy organizacji Immortals. Później jeszcze wspomniał, że chciałby do kolekcji swoich osiągnięć dodać pierwsze miejsce w NA LCS.</p>\n<p>\n\"Huni\" to zdecydowanie najbardziej przebojowy gracz sezonu 5. Z zupełnie nieznanego nabytku Fnatic w ciągu mniej niż roku stał się jednym z najpopularniejszych zawodników. To zasługa jego rozśmieszającego stylu bycia i braku oporu przed wygłupianiem się na oczach tysięcy widzów. W przeciwieństwie do czasu wolnego, w trakcie meczy Heo Seung-hoon to śmiertelnie poważny przeciwnik. Zasłynął z wyborów agresywnych bohaterów na top-lanie i przez to bycia trzecim carry w zespole. Postaciami, takimi jak Ekko, Riven czy Rumble, wielokrotnie dominował przeciwników i zapierał dech w piersiach wszystkich widzów.\n</p>","de_DE":"Seung-hoon „Huni“ Heo mauserte sich zu einer dominanten Macht in der NA LCS. In dieser Saison wechselte er mit jeder Menge Erfahrung in die LCK, um allen zu beweisen, dass er mit den Besten der Welt mithalten kann. Er mag glücklich und harmlos aussehen, aber man darf ihn nie unterschätzen. Wenn man ihm mit Riven zu viel Platz lässt, ist er immer für eine Vierfachtötung gut.\n\nUnter seiner fröhlichen Fassade ist Huni einer der selbstbewusstesten Spieler, die es gibt. Früher wollte er den dreimaligen Weltmeister unbedingt besiegen, doch dann dachte er sich: „Wenn ich sie nicht besiegen kann, dann schließe ich mich ihnen eben an.“ Das Mid-Season Invitational 2017 ist seine erste Chance, mit seiner neuen Mannschaft einen internationalen Titel zu gewinnen, und wenn es nach ihm geht, wird das der erste von vielen.\n","es_ES":"Seung-hoon \"Huni\" Heo ha demostrado ser una fuerza dominante en la LCS NA. Esta temporada se ha trasladado a la LCK con toda la sabiduría que ha cosechado hasta ahora y viene decidido a demostrar que es capaz de competir contra los mejores. Que no os engañe su cara alegre de no haber matado ni a una mosca. Le basta un pequeño descuido para conseguir un asesinato cuádruple con Riven.\n\nHuni es uno de los jugadores más seguros de sí mismos, pero lo esconde bajo una capa de jovialidad. Aunque su meta anterior era vencer a los tres veces campeones del mundo, ha aplicado la lógica: si no puedes vencerlos, únete a ellos. El Mid-Season Invitational 2017 es su primera oportunidad para ganar un evento internacional con su nuevo equipo. Si se sale con la suya, este será el primer título de muchos.\n","pt_BR":"<p>Seung-hoon \"Huni\" Heo se provou ser uma força dominante na LCS NA. Ele vai para a LCK nesta temporada com uma nova lição arduamente aprendida e a vontade de provar que pode competir com os melhores. Ele pode parecer feliz e inofensivo, mas não o subestimem. Deem uma chance e ele conseguirá um quadrakill em Riven.</p>\n\n<p>Huni é um dos jogadores mais confiantes que você encontrará, mas esconde isso sob uma camada de alegria. Seu objetivo anterior era derrotar os tricampeões mundiais, mas ele decidiu que se você não pode vencê-los, é melhor juntar-se a eles. O Mid-Season Invitational 2017 é sua primeira chance de ganhar um evento internacional com sua nova equipe. E, se a sua vontade se concretizar, será o primeiro de muitos.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “Huni” 허승훈은 탑 라인에서 지배적인 존재입니다. 유럽 LCS에 비교적 최근에 합류한 Huni는 2015년 Fnatic 리빌딩 프로젝트의 일환으로 팀에 입단했습니다. 그의 영향은 즉시 나타났습니다. 2015 유럽 LCS 서머 스플릿에서 Fnatic을 18승 무패 기록으로 이끌었기 때문이죠. Huni는 2015 유럽 LCS 서머 스플릿에서 Outstanding Rookie 상을 수상하기도 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">소환사의 협곡 바깥에서도 Huni의 영향력이 나타났죠. 그가 만든 감탄사 “HoloHoloHolo\"는 누구라도 빠져들 수밖에 없고, 그의 장난스러운 마이크 체킹은 전설적입니다. Huni는 겉으로는 귀여워 보일지 모르지만 게임에서는 적을 깨부수는 데 거리낌이 없죠. Huni는 그의 자신감을 한줄로 이렇게 요약했습니다. \"저희에게 대적할 라이벌은 없습니다.\" 궁금해 하실까봐 말씀드리지만 저 말은 국제 경기까지 포함시킨 겁니다. 그리고 그는 이렇게 말했죠. \"SKT와 다시 한번 싸워서 박살내고 싶어요.\" </p>\n<p style=”font-family:”나눔고딕”;\">정말 대담한 친구죠. 2015 올스타전에서 과연 그가 라이벌들을 박살낼 수 있을지 지켜봅시다. </p>\n"},"foreignIds":{"drupalId":"3675","ESPORTSTMNT06":"200000354","TRLH1":"200000408","TRLH2":"200000308","TRLT3":"200000206"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":9},{"id":403,"slug":"bang","name":"Bang","firstName":"Junsik","lastName":"Bae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bang-5ln60860.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:04.000Z","bios":{"en_US":"<p>\nJunsik \"Bang\" Bae is an incredibly dedicated AD carry. Bang committed himself to a rigorous play schedule, and has the results to prove it -- he was the first Korean player to reach 1400 Challenger points in Solo Queue. But he isn’t just getting good at Solo Queue. When SKT T1 S secured 3rd place in the 2014 Summer OGN Champions League, Bang had officially arrived on the Korean esports scene. He went on to take 1st place at the 2015 World Championship with SKT, etching his name in LoL history.\n</p>\n<p>\nHe didn’t stop there, though, and like the rest of SK telecom, he struggled through the initial growing pains of roster changes in 2016 before winning the 2016 World Championship. The team adjusted quickly to its new roster this year, dominating the LCK Spring Split and taking victory at the 2017 Mid-Season Invitational in Brazil.\n</p>","fr_FR":"Junsik « Bang » Bae est un carry AD extrêmement impliqué. Bang s'est astreint de lui-même à un programme de jeu très strict, et ses résultats sont là pour lui donner raison : il a été le premier joueur coréen à atteindre les 1400 points en Challenger en file solo. Mais il ne se contente pas de briller en file solo. Quand SKT T1 S à décroché la troisième place dans la Ligue OGN Champions Summer 2014, Bang venait d'arriver officiellement sur la scène de l'e-sport coréen. Il a enchaîné avec une première place lors du Championnat du monde 2015 avec SKT, gravant pour toujours son nom dans l'histoire de LoL.\n\nIl ne s'est pourtant pas arrêté là, et comme le reste de SK Telecom, il a souffert des changements de formation en 2016 avant de remporter le Championnat du monde 2016. Cette année, l'équipe s'est rapidement adaptée à sa nouvelle formation, dominant sans mal le segment de printemps de la LCK. Ils vont maintenant tenter d'enregistrer leur premier victoire internationale de 2017 lors du Mid-Season Invitational au Brésil.\n","pl_PL":"Junsik „Bang” Bae jest niesamowicie zaciętym prowadzącym. Bang narzucił sobie bardzo rygorystyczny harmonogram rozgrywek, czego rezultaty są widoczne — był pierwszym koreańskim zawodnikiem, który osiągnął 1400 punktów Pretendenta w kolejce solo. Ale staje się coraz lepszy nie tylko w kolejce solo. Gdy SKT T1 S zdobyli trzecie miejsce w Summer OGN Champions League 2014, Bang oficjalnie pojawił się na koreańskiej scenie e-sportowej. Zdobył wraz z SKT pierwsze miejsce na Mistrzostwach Świata 2015, zapisując swoje imię w historii LoL.\n\nJednak nie zamierzał na tym poprzestać, dlatego podobnie jak reszta SK Telecom musiał przebrnąć przez trudne zmiany w składzie w 2016 roku, zanim drużyna zwyciężyła na Mistrzostwach Świata 2016. Drużyna szybko dostosowała się do tegorocznego, nowego składu, dominując podczas wiosennego splitu LCK. Teraz będzie chciała zdobyć swoje pierwsze międzynarodowe zwycięstwo w 2017 roku na Mid-Season Invitational w Brazylii.\n","de_DE":"Junsik „Bang“ Bae ist ein unglaublich engagierter AD-Carry. Bang unterwarf sich einem sehr strikten Spielplan und hat als Folge dessen auch Resultate vorzuweisen – er war der erste koreanische Spieler, der jemals 1400 Challenger-Punkte in der Einzelwarteschlange erreicht hat. Aber natürlich ist er nicht nur als Einzelspieler überragend. Als SKT T1 sich den dritten Platz beim OGN Champions im Sommer 2014 sicherten, war Bangs Debut in der Esports-Szene offiziell. Kurz danach gewann er zusammen mit seinem Team SKT die Weltmeisterschaft 2015 und verewigte seinen Namen in der Geschichte von LoL.\n\nAber damit war noch lange nicht Schluss, und genau wie der Rest von SK Telecom hatte er zu Beginn des Jahres 2016 Probleme mit den Änderungen der Aufstellung, bevor er schließlich die Weltmeisterschaft 2016 gewann. In diesem Jahr konnte sich die Mannschaft schnell auf die neue Aufstellung einstellen und den Frühjahrs-Split der LCK dominieren. Jetzt werden sie beim Mid-Season Invitational in Brasilien versuchen, sich den ersten internationalen Titel im Jahr 2017 zu sichern.\n","es_ES":"Junsik ''Bang'' Bae es un AD carry con una dedicación admirable. Su riguroso programa de entrenamiento ha demostrado su eficacia: es el primer jugador coreano en alcanzar los 1400 puntos en la cola en solitario. Y eso no es lo único que se le da bien. Cuando SKT T1 consiguió el tercer puesto en la OGN Champions League de verano de 2014, Bang ya había llegado al panorama coreano de los esports. Junto al resto de miembros de su equipo, contribuyó al triunfo de SKT en el Campeonato Mundial 2015 y su nombre pasó a la historia de League.\n\nLejos de quedarse ahí, luchó junto a SK telecom para superar el mal trago inicial de 2016 causado por el ajuste de plantilla, justo antes de ganar el Campeonato Mundial de 2016. El equipo se ha adaptado rápidamente a su plantilla este año y ha dominado el split de primavera de la LCK. Ahora intentará conseguir su primera victoria internacional de 2017 en el Mid-Season Invitational en Brasil.\n","pt_BR":"<p>Junsik \"Bang\" Bae é um carregadorregador incrivelmente dedicado. Bang se comprometeu a um treinamento rigoroso e tem os resultados para provar: foi o primeiro jogador coreano a alcançar 1400 pontos no nível Desafiante na fila solo. Mas ele não é bom só na fila solo. Quando a SKT T1 conseguiu o 3º lugar na Summer OGN Champions League 2014, Bang fez sua entrada oficial para o cenário coreano de e-Sports. Ele então continuou sua jornada e alcançou o 1º lugar no Campeonato Mundial 2015 com a SKT, gravando seu nome na história do League of Legends.</p>\n\n<p>Mas ele não parou por aí e, assim como o resto da SK Telecom, ele teve dificuldades em se adaptar às mudanças constantes de escalação antes de vencer o Campeonato Mundial 2016. A equipe se ajustou rapidamente à sua nova composição neste ano, dominando a Etapa de Primavera da LCK. Agora eles querem que sua primeira vitória internacional de 2017 seja no Mid-Season Invitational no Brasil.\n</p>","es_AR":"<p>Jun-sik \"Bang\" Bae es un ADC totalmente aplicado. Bang se comprometió a cumplir un riguroso programa de juego, y los resultados lo demuestran. Fue el primer jugador coreano en alcanzar 1400 puntos de Challenger en la cola individual. Pero no es solo en la cola individual donde está mejorando. Cuando SKT T1 S se aseguró el tercer lugar en la OGN Champions League de verano del 2014, Bang quedó oficialmente instalado en la escena de esports coreana. Llegó al primer lugar en el Campeonato Mundial 2015 con SKT, y grabó su nombre en la historia de LoL.</p>\n\n<p>Pero no se detuvo allí y, como el resto de los miembros de SKTelecom, pasó por los insoportables cambios de plantel en el 2016. Después de recibir otro título de LCK en el torneo de apertura del 2016, Bang y SKTelecom fueron derrotados durante el comienzo del torneo de clausura, lo que dejó boquiabiertos a los simpatizantes de todo el mundo. Bang tomará la pérdida como combustible para su fuego competitivo y sabe que solo hace falta una pequeña chispa para hacer que SKTelecom vuelva a tener el dominio del Campeonato Mundial 2016.</p>"},"foreignIds":{"drupalId":"881","ESPORTSTMNT06":"200000358","TRLH1":"200000411","TRLH2":"200000311","TRLT3":"200000209"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":404,"slug":"wolf","name":"Wolf","firstName":"Jaewan","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolf-82h5ft4p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:22.000Z","bios":{"en_US":"<p>Jaewan \"Wolf\" Lee is a dedicated communicator and practices constantly with his duo partner Bang. Their bond in the bot lane has proven itself, as Wolf achieved one of the highest KDAs in the 2015 LCK Summer Split. His chemistry with Bang led SK Telecom to become world champions in 2015 after they rampaged through the entire tournament nearly unbeaten.</p>\n\n<p>In 2016, the chemistry seemed to have waned as Bang and Wolf struggled along with the entirety of SKT, but after MSI their trademark chemistry was back with a vengeance. Even though SKT came up short in the Summer Split playoffs, Wolf and Bang showed up huge at the 2016 World Championship and again at the 2017 Mid-Season Invitational. Next up? Worlds.</p>","fr_FR":"Jaewan « Wolf » Lee est un excellent communiquant qui s'entraîne constamment avec son partenaire Bang. Leur lien sur la voie du bas a fait ses preuves : Wolf a enregistré l'un des plus hauts KDA du segment d'été des LCK 2015. L'alchimie entre Bang et lui a permis à SK Telecom de devenir championne du monde en 2015 après avoir fait des ravages durant tout le tournoi, presque sans subir la moindre défaite.\n\nEn 2016, cette synergie semble s'être dégradée : Bang et Wolf ont eu un peu de mal, comme l'ensemble de leur équipe, mais après le tournoi MSI, leur alchimie légendaire était de retour en beauté. Bien que SKT ait manqué de peu les play-offs du segment d'été, Wolf et Bang ont fait des étincelles au Championnat du monde 2016. À présent, ils se préparent à participer au Mid-Season Invitational 2017 et convoitent leur deuxième titre du MSI.\n","pl_PL":"Jaewan „Wolf” Lee ma świetne umiejętności komunikacyjne i nieustannie ćwiczy ze swoim partnerem z duetu, Bangiem. Ich zgrania na dolnej alei dowodzi fakt, że Wolf zdobył jeden z najwyższych wyników Z/Z/A podczas letniego splitu LCK 2015. Świetna chemia między nim a Bangiem doprowadziła SK Telecom do zdobycia mistrzostwa świata w 2015 roku, po przebiciu się przez cały turniej niemal bez porażki.\n\nW 2016 roku ta chemia jakby uleciała, gdy Bang i Wolf borykali się z problemami, które dotknęły całego SKT, ale po MSI ich charakterystyczne zgranie się powróciło jeszcze bardziej wzmocnione. Chociaż SKT odpadli w fazie pucharowej letniego splitu, Wolf i Bang pokazali się ze świetnej strony na Mistrzostwach Świata 2016. Teraz zmierzają na Mid-Season Invitational 2017, mając oko na drugi tytuł na MSI.\n","de_DE":"Jaewan „Wolf“ Lee ist ein engagierter Kommunikator und ständig damit beschäftigt, sich mit seinem Duo-Partner Bang zu verbessern. Ihre Verbindung ist stark und ihr Erfolg auf der unteren Lane spiegelt sich deutlich in Wolfs TTUs im Sommer-Split der LCK 2015 wider. Seine gute Harmonie mit Bang führte SK Telecom zum Sieg bei der Weltmeisterschaft 2015, nachdem sie im ganzen Turnier nahezu ungeschlagen geblieben waren.\n\n2016 war es mit der Harmonie plötzlich vorbei, als Bang und Wolf, genau wie der Rest der Mannschaft, große Probleme hatten. Aber nach dem MSI war ihre Harmonie wieder zurück. Obwohl SKT in den Entscheidungsspielen des Sommer-Splits scheiterte, konnten Wolf und Bang der Weltmeisterschaft 2016 ihren Stempel aufdrücken. Jetzt sind sie zum Mid-Season Invitational 2017 unterwegs, wo sie ihren zweiten MSI-Titel gewinnen wollen.\n","es_ES":"Jaewan ''Wolf'' destaca por lo bien que se comunica, y practica constantemente con su compañero de la calle inferior, Bang. Este dúo ya ha demostrado su valía, ya que Wolf consiguió uno de los marcadores A/M/A más altos del split de verano de la LCK 2015. Su química con Bang contribuyó en gran medida a que SK telecom se proclamase campeón del mundo en 2015, pues en su paso por el campeonato casi terminan invictos.\n\nEn 2016, su química comenzó a decaer cuando Bang y Wolf experimentaron los mismos problemas que el resto del equipo, pero con la victoria en el MSI todo volvió a la normalidad. Aunque SKT no dio la talla en los playoffs del split de verano, Wolf y Bang se mostraron como un potente dúo en el Campeonato Mundial de 2016. Ahora se dirigen al Mid-Season Invitational 2017 con esperanzas de obtener su segundo título del MSI.\n","pt_BR":"<p>Jaewan \"Wolf” Lee é um comunicador dedicado e pratica constantemente com seu parceiro de rota, Bang. Sua sintonia na rota inferior já provou o que tinha que provar quando Wolf alcançou um dos AMAs mais altos da Etapa de Verão da LCK 2015. Sua química com Bang levou a SK Telecom a se tornar a campeã mundial em 2015 depois de destruírem no torneio, saindo praticamente invictos.</p>\n\n<p>Em 2016, essa química parecia ter sumido quando Bang e Wolf passaram por muitas dificuldades, juntamente com toda a SKT. Mas, depois do MSI, sua tão famosa sintonia voltou com tudo. Mesmo a SKT tendo decepcionado nas eliminatórias da Etapa de Verão, Wolf e Bang impressionaram no Campeonato Mundial 2016. Agora, eles vão para o Mid-Season Invitational 2017 de olho no seu segundo título MSI.\n</p>","es_AR":"<p>Jae-wan \"Wolf\" se destaca por su dedicación a las comunicaciones y practica constantemente con su dupla Bang. Su vínculo en el carril inferior se ha mostrado fuerte, y Wolf logró uno de los más altos KDA en el torneo de clausura de la LCK 2015. Su química con Bang hizo que SKTelecom se convirtiera en campeón mundial en el 2015 luego de arrasar durante todo el torneo sin derrotas.</p>\n\n<p>En el 2016, la química pareció menguar un poco, ya que Bang y Wolf pasaron una mala racha junto a SKTelecom, pero luego de la MSI, su complementación volvió a ser la misma y estuvo cargada de venganza. Aunque SKTelecom quedó afuera rápido de las eliminatorias del torneo de clausura, Wolf y Bang siguen siendo una impresionante dupla de carrileros inferiores. Está por llegar al Mundial como uno de los soportes más temibles del planeta. Si alguien quiere meterse con Bang, tendrá que pasar por una pesadilla al cruzarse con Wolf.</p>"},"foreignIds":{"drupalId":"882","ESPORTSTMNT06":"200000435","TRLH1":"200000412","TRLH2":"200000312","TRLT3":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":715,"slug":"peanut","name":"Peanut","firstName":"Wangho","lastName":"Han","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/peanut-izmrqd1y.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:15:00.000Z","bios":{"en_US":"<p>\nWangho “Peanut” Han is the most aggressive jungler in Korea - bar none. He is a master of controlled mayhem who routinely takes over games single-handedly. After getting his professional start with the thoroughly underwhelming NaJin e-mFire, Peanut made his way to the ROX Tigers in 2016.\n</p>\n<p>\nPeanut melds chaos and calm in a way seldom seen on the Rift. One moment he’s systematically stealing the enemy’s jungle and the next he’s diving headfirst into a tower to clean up a double kill. It’s this unpredictability that sets Peanut apart from other elite level junglers. After losing a close battle to SK telecom T1 at the 2016 World Championship, Peanut joined the team that sent him packing. He earned his first international title with his new team at the 2017 Mid-Season Invitational; now, his sights are set on Worlds.\n</p>","de_DE":"Wangho „Peanut“ Han ist zweifellos der aggressivste Jungler in Korea. Er ist ein Meister des kontrollierten Chaos und kann Spiele alleine entscheiden. Nachdem seine Karriere bei den sehr enttäuschenden NaJin e-mFire begonnen hatte, wechselte Peanut im Jahr 2016 zu den ROX Tigers.\n\nPeanut vereint Chaos und Ruhe, wie man es in der Kluft nur selten sieht. In einem Moment grast er systematisch den gegnerischen Dschungel ab und im nächsten stürmt er kopfüber zu einem Turm, um eine Doppeltötung einzufahren. Es ist diese Unberechenbarkeit, die Peanut von den anderen Junglern auf diesem Niveau unterscheidet. Nachdem er sich bei der Weltmeisterschaft 2016 SK Telecom T1 knapp geschlagen geben musste, wechselte Peanut zu der Mannschaft, die ihn nach Hause geschickt hatte. Jetzt wird er beim Mid-Season Invitational 2017 versuchen, mit seiner neuen Mannschaft seinen ersten internationalen Titel zu gewinnen.\n","es_AR":"<p>Wang-ho \"Peanut\" Yun es, sin la menor duda, el junglero más agresivo de Corea. Es experto en generar un caos controlado que casi siempre le permite tener el dominio de las partidas en sus propias manos. Después de hacer su debut profesional con el absolutamente abrumador equipo NaJin e-mFire, Peanut pasó a formar parte de ROX Tigers a comienzos de año y no ha vuelto la vista atrás desde entonces.</p>\n\n<p>Peanut combina caos y calma de una forma pocas veces vista en la Grieta. En un momento se encuentra robando de forma sistemática la jungla del enemigo, y al siguiente se lanza de cabeza a una torre pera ejecutar un asesinato doble. Es el componente sorpresa lo que hace que Peanut se destaque de otros jungleros de élite. Era la última pieza que faltaba en ROX Tigers, y su juego ayudó a catapultar el equipo al estrellato internacional. Peanut y compañía son grandes favoritos para el Campeonato Mundial 2016, y hay solo una cosa para decir a los equipos que se crucen en su camino: buena suerte.</p>","es_ES":"Wangho ''Peanut'' Han es el jungla más agresivo de Corea. Es un maestro del caos controlado y suele dominar en solitario las partidas. Tras comenzar profesionalmente con el decepcionante NaJin e-mFire, se unió a ROX Tigers en 2016.\n\nPeanut combina el caos y la calma de una forma que rara vez se ha visto en la Grieta. Un segundo está robando de forma sistemática la jungla enemiga, y al siguiente se está lanzando de cabeza bajo la torre para conseguir un asesinato doble. Que sea tan impredecible es lo que lo hace destacar frente a otros junglas de élite. Tras perder una disputada batalla contra SK telecom T1 en el Campeonato Mundial de 2016, Peanut se unió al equipo que lo mandó a casa. Ahora, intentará ganar su primer título internacional con su nuevo equipo en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Wangho \"Peanut\" Han é o caçador mais agressivo da Coreia, ponto. Ele é um mestre em controlar o caos que frequentemente causa nos seus jogos. Depois de ter sua estreia no cenário profissional com a decepcionante NaJin e-mFire, Peanut encontrou seu caminho na ROX Tigers em 2016.</p>\n\n<p>Peanut consegue juntar caos e tranquilidade de uma forma raramente vista no Rift. Em um momento ele pode estar roubando sistematicamente a selva do inimigo e no outro, mergulhando de cabeça em uma torre para pegar um abate duplo. É essa imprevisibilidade que diferencia Peanut dos outros caçadores de elite. Depois de perder uma batalha acirrada para a SK Telecom T1 no Campeonato Mundial 2016, Peanut entrou para a equipe que o fez fazer as malas. Agora, ele tentará ganhar seu primeiro título internacional com sua nova equipe no Mid-Season Invitational 2017.\n</p>","pl_PL":"Wangho „Peanut” Han jest najagresywniejszym dżunglerem w Korei — bezdyskusyjnie. To mistrz kontrolowanego chaosu, który regularnie zdobywa zwycięstwa w meczach praktycznie na własną rękę. Po swoim profesjonalnym starcie w bardzo przeciętnym NaJin e-mFire Peanut przeniósł się na początku 2016 roku do ROX Tigers.\n\nPeanut łączy chaos i opanowanie w sposób rzadko widywany na Summoner’s Rift. W jednej chwili systematycznie wykrada dżunglę przeciwnikowi, a w następnej szturmuje wieżę, by zgarnąć podwójne zabójstwo. To ta nieprzewidywalność odróżnia Peanuta od pozostałych elitarnych dżunglerów. Po przegraniu zaciekłej bitwy z SK Telecom T1 na Mistrzostwach Świata 2016 Peanut dołączył do drużyny, która była przyczyną jego porażki. Teraz ze swoją nową drużyną zamierza zdobyć swój pierwszy międzynarodowy tytuł na Mid-Season Invitational 2017.\n","fr_FR":"Wangho « Peanut » Han est le jungler le plus agressif de Corée, sans exception. Il est passé maître dans l'art du chaos contrôlé, et a pour habitude de dominer les matchs seul. Suite à des débuts professionnels avec les très décevants NaJin e-mFire, Peanut a rejoint les ROX Tigers en 2016.\n\nPeanut mélange chaos et calme d'une façon rarement vue sur la Faille. Un moment, il vole systématiquement la jungle ennemie et l'instant d'après, il fonce tête la première sous une tour pour réaliser un doublé. C'est son caractère imprévisible qui distingue Peanut des autres junglers d'élite. Après avoir perdu un combat serré contre SK Telecom T1 lors du Championnat du monde 2016, Peanut a finalement rejoint l'équipe qui l'avait disqualifié. Il va maintenant tenter de remporter son premier titre international avec sa nouvelle équipe au Mid-Season Invitational 2017.\n"},"foreignIds":{"drupalId":"4062","TRLH1":"200000409","TRLH2":"200000309","ESPORTSTMNT06":"200000355","TRLT3":"200000207"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1025,"slug":"untara","name":"Untara","firstName":"Ui-jin","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/untara-72qfuy9u.png","hometown":"Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:02:38.000Z","updatedAt":"2017-05-31T00:54:38.000Z","bios":{},"foreignIds":{"TRKR1":"225031","ESPORTSTMNT06":"200000353"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1026,"slug":"sky","name":"Sky","firstName":"Haneul","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sky-2m0pzkna.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:03:37.000Z","updatedAt":"2017-05-31T00:49:05.000Z","bios":{},"foreignIds":{"TRKR1":"225033","ESPORTSTMNT06":"200000356"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1033,"slug":"blank","name":"Blank","firstName":"Sungu","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blank-7ie205tv.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:19.000Z","updatedAt":"2017-07-06T14:24:22.000Z","bios":{"en_US":"<p>Sungu “Blank” Kang started his career in China in late 2014. After being relegated from the LPL as a member of Star Horn Royal Club, Blank left the team to join SK telecom T1 in late 2015. He didn’t exactly impress with his first few games in the LCK, but when the team took him to IEM he excelled, and the team finished the tournament unbeaten. Just like that, Blank added his first trophy to his resume.</p>\n\n<p>His performances seem to be consistently improving, and SKT opted to keep playing him over the struggling veteran, Bengi. In his first split as an LCK jungler, he took first in Champions Spring, yet in the Summer Split it was clear that he was still learning how to control vision across the map. He took a back seat to Bengi during SKT's third World Championship run. While Bengi has departed, now Blank has to compete with superstar jungler Peanut for playing time.</p>","es_AR":"<p>Sun-gu \"Blank\" Kang inició su carrera en China a finales del 2014. Después de sufrir un descenso de la LPL como miembro de Star Horn Royal Club, Blank se fue del equipo para unirse a SKTelecom a finales del 2015. No tuvo una actuación muy impresionante en sus primeras partidas en la LCK, pero cuando el equipo lo llevó a la EIM, se destacó y su grupo acabó el torneo invicto. De esta forma, Blank agregó el primer trofeo a su historial.</p>\n\n<p>Sus actuaciones parecen mejorar constantemente, y SKTelecom optó por seguir jugando con él en lugar del veterano Bengi, quien no está teniendo una buena racha. En su primer torneo como junglero de la LCK, salió primero en la Champions Spring, pero en el torneo de clausura quedó claro que aún debía aprender a controlar la visión del mapa. Como resultado, SKTelecom no tuvo unas buenas eliminatorias, y cayó en la semifinal. Blank deberá refinar su control del mapa si quiere que SKTelecom tenga una buena actuación que le permita ganar el trofeo del Campeonato Mundial.</p>","fr_FR":"Sungu « Blank » Kang a débuté sa carrière en Chine fin 2014. Après avoir été relégué des LPL en tant que membre de Star Horn Royal Club, Blank a quitté l'équipe pour rejoindre SK Telecom T1 à la fin de l'année 2015. Il ne s'est pas exactement montré impressionnant lors de ses premiers matchs des LCK, mais quand l'équipe l'a emmené avec elle à l'IEM, il a révélé tout son talent et SKT a terminé le tournoi invaincue. Aussi simplement que ça, Blank a ajouté son premier trophée à son C.V.\n\nSes performances semblent s'améliorer régulièrement, aussi SKT a préféré le conserver en lieu et place de leur vétéran quelque peu affaibli, Bengi. Lors de son premier segment en tant que jungler au sein des LCK, il a remporté sa première victoire au tournoi Champions Spring. Mais lors du segment d'été il était clair qu'il apprenait encore à contrôler sa vision de l'ensemble de la carte. Il s'est ensuite effacé au profit de Bengi au cours du troisième Championnat du monde de SKT. Mais suite au départ de Bengi, c'est maintenant à Blank de se disputer du temps de jeu avec le jungler vedette qu'est Peanut\n","es_ES":"Sungu ''Blank'' Kang comenzó su carrera en China a finales de 2014. Tras ser relegado de la LPL como miembro de Star Horn Royal Club, Blank dejó el equipo y se unió a SK telecom T1 a finales de 2015. Sus primeras partidas en la LCK no fueron impresionantes, pero su actuación en el IEM fue excelente y el equipo terminó el torneo invicto. Y así fue como Blank añadió el primer trofeo a su currículum.\n\nSu rendimiento no dejaba de mejorar, así que SKT optó por darle prioridad frente al veterano Bengi. En su primer split como jungla de la LCK obtuvo el primer puesto en el Champions Spring, pero en el split de verano fue evidente que todavía estaba aprendiendo a controlar la visión del mapa. En el tercer Campeonato Mundial de SKT, Blank tuvo que ser suplente de Bengi. Ahora que Bengi se ha marchado del equipo, Blank tendrá que competir contra Peanut, el jungla superestrella, para ganarse tiempo de juego.\n","de_DE":"Sungu „Blank“ Kang begann seine Karriere Ende 2014 in China. Nachdem er mit dem Star Horn Royal Club aus der LPL abgestiegen war, verließ er die Mannschaft und wechselte Ende 2015 zu SK Telecom T1. In den ersten paar Spielen in der LCK konnte er nicht wirklich überzeugen, aber beim IEM lieferte er eine überragende Vorstellung ab und half seiner Mannschaft, das Turnier ungeschlagen zu beenden. Und mir nichts, dir nichts konnte Blank seine erste Trophäe in die Höhe stemmen.\n\nSeine Leistung scheint immer besser zu werden und SKT entschied sich, ihn dem erfahrenen Bengi vorzuziehen. In seinem ersten Split als LCK-Jungler holte er sich den ersten Platz beim Champions Spring, doch beim Sommer-Split wurde klar, dass er immer noch lernen musste, wie man die Sicht auf der Karte sicherstellt. Bei der Weltmeisterschaft musste er jedoch Bengi den Vortritt lassen. Seit dem Abgang von Bengi muss Blank mit dem Superstar im Dschungel, Peanut, um Spielzeit kämpfen.\n","pl_PL":"Kariera Sungu „Blank” Kanga zaczęła się w Chinach pod koniec 2014 roku. Po relegowaniu z LPL wraz ze wszystkimi pozostałymi członkami Star Horn Royal Club Bank opuścił drużynę, aby pod koniec 2015 roku dołączyć do SK Telecom T1. Nie zaimponował specjalnie podczas swoich pierwszych meczów w LCK, ale gdy drużyna zabrała go na IEM, pokazał, na co go stać i zespół wygrał turniej bez porażki. W ten sposób Blank dodał do swojego resume pierwsze trofeum.\n\nJego występy wydają się coraz lepsze i SKT postanowili zatrzymać go w składzie w miejsce zmagającego się z problemami weterana, Bengiego. Podczas swojego pierwszego splitu w roli dżunglera w LCK Blank zajął pierwsze miejsce w Champions Spring, jednak w toku letniego splitu stało się jasne, że wciąż uczy się kontroli wizji na całej mapie. Ustąpił miejsca Bengiemu podczas trzeciego podejścia SKT do Mistrzostw Świata. Odkąd Bengi odszedł, Blank musi rywalizować o udział w grze z supergwiazdą, dżunglerem Peanutem.\n","pt_BR":"<p>Sungu \"Blank\" Kang iniciou sua carreira na China no fim de 2014. Depois de ser rebaixado na LPL quando ainda era um membro da Star Horn Royal Club, Blank saiu da equipe e entrou para a SK Telecom T1 no final de 2015. Ele não impressionou muito com seus primeiros jogos na LCK, mas quando sua equipe o levou para a IEM, ele se destacou e a equipe terminou o torneio invicta. E simples assim, Blank acrescentou seu primeiro troféu em seu currículo.</p>\n\n<p>Seu desempenho parecia estar melhorando consistentemente, então a SKT optou por continuar jogando com ele em vez do veterano, Bengi, que parecia estar com dificuldades. Em sua primeira Etapa como caçador na LCK, ele ficou em primeiro lugar na Champions de Primavera, mas ficou claro na Etapa de Verão de que ele ainda precisava melhorar seu controle de visão do mapa. Ele ficou na reserva do Bengi durante o terceiro Campeonato Mundial da SKT. Agora que Bengi saiu da equipe, Blank precisa competir com o caçador estrela Peanut para jogar.\n</p>"},"foreignIds":{"ESPORTSTMNT06":"200000434","TRLH1":"200000413","TRLH2":"200000313","TRLT3":"200000211"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33}],"scheduleItems":[{"id":"AU_dgZg2JTrHluSI14Fu","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:c79c3fc6-b2db-4789-a588-65f226c549b2","scheduledTime":"2015-10-01T16:30:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"1","subBlockLabel":"paris - W1D1","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:f6c0af3f-85e7-4de6-b064-ee9a0558d668"},"match":"c79c3fc6-b2db-4789-a588-65f226c549b2","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"f6c0af3f-85e7-4de6-b064-ee9a0558d668","league":"9"}],"gameIdMappings":[{"id":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b","gameHash":"fa1f63f766bc861d"}],"videos":[{"id":5,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:2f2c08cd-a731-47e6-95d6-d7f74f8f803b","source":"https://www.youtube.com/embed/c0Xk7wgsMK4?wmode=transparent","createdAt":"2015-10-01T18:30:45.000Z","updatedAt":"2015-10-01T18:30:45.000Z","game":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b"},{"id":6,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:2f2c08cd-a731-47e6-95d6-d7f74f8f803b","source":"https://www.youtube.com/embed/0CozgjtoOgQ?wmode=transparent","createdAt":"2015-10-01T18:56:24.000Z","updatedAt":"2015-10-01T18:56:24.000Z","game":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b"},{"id":23,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:2f2c08cd-a731-47e6-95d6-d7f74f8f803b","source":"https://www.youtube.com/embed/Lgx5DtKkxv8?wmode=transparent","createdAt":"2015-10-02T13:33:37.000Z","updatedAt":"2015-10-02T13:33:37.000Z","game":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b"},{"id":27,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:2f2c08cd-a731-47e6-95d6-d7f74f8f803b","source":"https://www.youtube.com/embed/towrjzScGMM?wmode=transparent","createdAt":"2015-10-02T15:50:26.000Z","updatedAt":"2015-10-02T15:50:26.000Z","game":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b"}],"htmlBlocks":[],"match":{"id":"c79c3fc6-b2db-4789-a588-65f226c549b2","name":"SKT-vs-H2K","position":0,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"},{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}],"games":{"2f2c08cd-a731-47e6-95d6-d7f74f8f803b":{"id":"2f2c08cd-a731-47e6-95d6-d7f74f8f803b","name":"G1","generatedName":"H2K|SKT|G1|c79c3fc6b2db4789a58","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"},{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}],"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}]],"timestamp":1443720066146,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380209","gameRealm":"TRLH3","platformId":"TRLH3:1001380209","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"d228ed48-cad9-4f6d-8973-2bef614fa96a"}]],"timestamp":1443720066146,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"d0090f63-9819-43f0-9314-9997cd3c1612":1,"d228ed48-cad9-4f6d-8973-2bef614fa96a":0}}}