{"teams":[{"id":73,"slug":"team-dragon-knights","name":"Team Dragon Knights","guid":"be6ded88-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/team-dragon-knights-chrt2mqx.png","acronym":"TDK","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":"http://assets.lolesports.com/team/team-dragon-knights-hh39eds4.png","createdAt":"2015-05-26T21:11:28.000Z","updatedAt":"2016-04-08T20:07:05.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3856"},"players":[121,258,347,364,396,503,664,666,736,1106],"starters":[121,258,347,364,664],"subs":[396,503,666,736,1106]},{"id":122,"slug":"renegades","name":"Renegades","guid":"be6eff04-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/renegades-11rbdlso.png","acronym":"REN","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-05-31T12:19:31.000Z","bios":{"en_US":"<p>\nA band of former Misfits, Renegades stormed through the 2015 NA Challenger Series and into the NA LCS within a year of their founding. Their success in the NACS was largely attributed to superior map and objective control, not individual laning talent, but don't let that fool you. Former Moscow 5 star Alexey \"Alex Ich\" Ichetovkin and former Team Dignitas star (and prophet) Alberto \"Crumbz\" Rengifo bring their fair share of experience and mechanical skill to the REN lineup. Combined with the stellar bot lane duo of Aleš \"Freeze\" Kněžínek and support Maria \"Remi\" Creveling, the Renegades ongoing success seems almost inevitable.\n</p>\n<p>\nCoach: David Tu\n</p>","fr_FR":"<p>Anciennement connus sous le nom de Misfits, les Renegades ont balayé leurs adversaires lors des Challenger Series NA 2015 et se sont qualifiés pour les LCS NA seulement un an après leur fondation. Leur succès lors des CS NA a été largement attribué à leur meilleur contrôle de la carte et des objectifs, et non à leur talent individuel en phase de laning, mais ne vous laissez pas abuser. L'ancienne star de Moscow 5, Alexy « Alex Ich » Ichetovkin et l'ancienne star (et prophète) de Team Dignitas, Alberto « Crumbz » Rengifo, ont apporté leur lot d'expérience et de maîtrise des mécaniques de jeu à l'équipe. Si l'on combine ces atouts certains au talentueux duo formé par Aleš « Freeze » Kněžínek et son support Maria « Remi » Creveling en voie du bas, le succès des Renegades semble assuré.</p>","pl_PL":"<p>Renegaci z Los Angeles wywodzą się z zespołu Misfits, który został założony na początku marca 2015. Twórcą był Chris \"Doombang\" Badawi, były prawnik patentowy z Nowego Jorku. W wywiadzie dla the Score e-sports wyjawił co przekonało go do takiego kroku. Pewnego dnia miał wypadek samochodowy, tak poważny, że z trudem udało mu się pozostać przy życiu. To skłoniło go do weryfikacji swojego życia – „Doombang” stwierdził, że nie chce być prawnikiem, bo w głębi duszy zawsze był graczem. Pierwotnie chciał kupić Curse Academy, ale skończyło się to tylko zdobyciem wielu przydatnych kontaktów w społeczeństwie League of Legends. </p>\n<p>\nWkrótce potem Chris Badawi zaprosił do rozmów Alberta \"Crumbz\" Rengifa, przyszłego kapitana LA Renegades, żeby podyskutować o stworzeniu nowej organizacji. Okazało się, że doskonale się rozumieją w kategorii idei, jak ma taki zespół wyglądać. Według filozofii Chrisa LA Renegades ma być drużyną, którą nie jest odbierana jako firma, tylko rodzina. To ma być miejsce gdzie każdy członek kocha i jest dumny z tego co robi, zamiast czuć nieustającą presję. \"Crumbz\" zaproponował Alexeya \"Alex Ich\" Ichetovkina jako kolejnego uczestnika tego projektu, którego \"Doombang\" przyjął z olbrzymim entuzjazmem. Tych trzech pasjonatów, połączonych wspólnym celem, zaczęło współpracę żeby niebawem ogłosić utworzenie Misfits. <p/>\n<p>\nPierwsza połowa 2015 roku przyniosła zespołowi wiele zmian. Przede wszystkim udało mu się dostać do 2015 NA Challenger Series, po trzech zwycięskich spotkaniach o wyniku 2:0. Zbiegło się to  w czasie ze zmianami w samej organizacji. Drużyna została przemianowana z Misfits na LA Renegades. Powszechnie znany prezenter, Christopher \"MonteCristo\" Mykles, dołączył do drużyny jako współwłaściciel. Pojawienie się kolejnej bardzo dobrze znanej twarzy zasiliło powiększające się, olbrzymie już grono kibiców tej drużyny. W międzyczasie Chris \"Doombang\" Badawi wywołał aferę w społeczeństwie League of Legends, w efekcie czego został wykluczony z uczestnictwa w LCS do końca sezonu 2016. </p>\n<p>\nPomimo tego, że na pierwszy rzut oka gracze z LA Renegades wydawali się przypadkową zbieranią, osiągnęli już swoje pierwsze sukcesy. Skończyli 2015 NA Challenger Series na drugim miejscu, po przegraniu dogrywki z Team Coast, z wynikiem 8:2. Jednak najważniejszym triumfem dla nich były rozgrywki kwalifikacjyjne do NA LCS. Renegaci zmierzyli się z najpoważniejszymi konkurentami z Challenger series. Najpierw wygrali z Team Imagine 2 do 1, a następnie w żazartej walce z Team Coast 3 do 2. Dzięki temu udało im się zrealizować ich najważniejszy cel – dostać się do wiosennego sezonu NA LCS 2016.</p>\n"},"foreignIds":{"drupalId":"4429"},"players":[144,160,272,323,501,680,784],"starters":[144,160,501,680],"subs":[272,323,784]}],"players":[{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":144,"slug":"crumbz","name":"Crumbz","firstName":"Alberto","lastName":"Rengifo","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/crumbz-4ly45vij.png","hometown":"Vancouver, BC","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2016-01-14T05:42:18.000Z","bios":{"en_US":"<p>\nAlberto \"Crumbz\" Rengifo has seen some stuff. He has played mid lane, top lane, and jungler competitively. He has started for multiple NA LCS teams. He has fought in the NA LCS Playoffs, and he has battled through the Challenger Series. He feels a little bit like Zilean -- a grizzled veteran who knows too much, but still feels compelled to push onward.\n</p>\n<p>\nSince joining Renegades (formerly Misfits) in 2015, Crumbz has trended towards bruiser champions that bring the threat of strong ganks, such as Lee Sin, Gragas, and Rek'Sai. His experience in multiple roles serves him well when coordinating with his teammates, and might tip the scales in Renegades' favor as they enter the NA LCS.\n</p>","fr_FR":"<p>Alberto « Crumbz » Rengifo a vu bien des choses. Au niveau compétitif, il a déjà joué sur la voie du \n\nmilieu, sur celle du haut et dans la jungle. Il a été titulaire dans de nombreuses équipes des LCS NA. Il a \n\nparticipé aux play-offs des LCS NA, mais il s'est aussi battu dans les Challenger Series. Il est un peu \n\ncomme Zilean : un vétéran qui en a déjà trop vu, mais qui veut toujours persévérer.</p>\n\n<p>Depuis qu'il a rejoint Renegades (précédemment les Misfits) en 2015, Crumbz a plutôt incarné des \n\ncombattants qui permettent des ganks puissants, comme Lee Sin, Gragas et Rek'Sai. Son expérience à \n\ndifférents postes lui est utile pour se coordonner avec son équipe, et cela pourrait bien faire pencher la \n\nbalance en faveur des Renegades lors des LCS NA.</p>","pl_PL":"<p>Alberto \"Crumbz\" Rengifo to dobrze znany Jungler na amerykańskiej profesjonalnej scenie. Zainteresował się League of Legends w sierpniu 2010 roku. W marcu 2011 roku dołączył do organizacji DSO, gdzie zaczął konkurować z innymi utalentowanymi graczami. Już w październiku tego roku miał okazję wziąć udział jako substytut mid-lanera w poważnym turnieju – sezonie 3 IGN ProLeague. W szeregach Epik Gamer zajął 2nd miejsce, wygrywając z Team SoloMid i Counter Logic Gaming, a przegrał tylko z Team Dignitas. Jego niezwykle pomyślny występ bardzo spodobał się Curse Gaming i bezpośrednio po turnieju Alberto dołączył do jej drużyny. Wraz z tą organizacją zdobył cenne doświadczenie na profesjonalnej scenie. Niestety nie był w stanie się przeprowadzić do ich siedziby, więc w maju 2012 opuścił szeregi Curse Gaming. Wkrótce potem, przeniósł się do Team Dignitas, w którym pozostał jako Jungler aż do lutego 2015 roku. Będąc w tym zespole \"Crumbz\" zaliczył parę pełnych sezonów NA LCS, co mało który profesjonalny gracz może o sobie powiedzieć. W marcu 2015 roku dołączył do obiecującej drużyny – LA Renegades.</p>\n<p>\nJego twarz jest dobrze znana wszystkim kibicom. Alberto często gościł w gronie analityków, nie tylko podczas rozgrywek LCS, ale również podczas większych turniejów. Zyskał sobie ogrom fanów dzięki wystąpieniu podczas Mistrzostw Świata 2014, w którym był przebrany za czarodzieja \"Professora Crumbledora\". Udało mu się rozbawić publikę, a na dodatek trafnie przewidział zwycięstwo Samsung White w meczu z Samsung Blue, a następnie fakt, że wygra finał. Można śmiało powiedzieć, że jego humorystyczne wypowiedzi i bezbłędne oceny przysporzyły mu równie dużo wielbicieli, co wcześniejsze występy na Summoner’s Rift. </p>\n<p>\nAlberto, jako jeden z niewielu profesjonalnych graczy, w swojej karierze grał zawodowo aż na trzech różnych pozycjach: na początku na top lanie, okazjonalnie na mid lanie i ostatecznie w jungli. Najbardziej lubi grać Jaxem, jednak zaraz za nim znajdują się Lee Sin i Shaco. To jak korzystał z Demonicznego Błazna stało się przedmiotem żywiołowych dyskusji, gdyż wiele osób uważało, że robi to nieprawidłowo. Jednak pomimo antagonistów jego stylu, \"Crumbz\" wielokrotnie wspiął się na sam szczyt kolejki solo que w NA. Na co dzień, poza grą w League of Legends, Alberto to bardzo muzykalny człowiek. Pasjonuje się grą na saksofonie i utrzymuje popularną listę utworów muzycznych na internetowym serwisie.</p>\n"},"foreignIds":{"drupalId":"19","TRLH1":"1001220127","TRLH2":"1001160177"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":258,"slug":"kez","name":"kez","firstName":"Kevin","lastName":"Jeon","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/kez-5t7efxvg.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-09-09T16:42:15.000Z","updatedAt":"2016-08-04T18:01:20.000Z","bios":{"en_US":"Kevin “Kez” Jeon has been involved in the NA Challenger Series since 2013 when he joined The Walking Zed. After playing for both Cloud9 Tempest and compLexity, Kez made his way to Team Dragon Knights in 2015."},"foreignIds":{"drupalId":"1150","TRLH1":"1001270011","TRLH2":"1001200011","FRA1TMNT1":"375197"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":364,"slug":"flaresz","name":"Flaresz","firstName":"Cuong","lastName":"Ta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flaresz-bvsf1d92.png","hometown":"USA","region":"OPL","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-03-10T04:55:27.000Z","bios":{"en_US":"Flaresz has had a strange trajectory to the OPL, having substantial experience in North America's Challenger scene as well as the LCS. He was a successful solo queue player and a shining spot on Enemy Esports. His strong laning will undoubtedly draw a lot of attention this year."},"foreignIds":{"drupalId":"2544","TRLH1":"1001260001","FRA1TMNT1":"395028","TRLH2":"1001210001","ESPORTSTMNT03":"200000509"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":396,"slug":"thy","name":"Thy","firstName":"Son","lastName":"Seung Yong","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/thy-bflochot.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-03-27T20:34:57.000Z","updatedAt":"2016-02-20T00:07:27.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2798","TRLH1":"1001080004","TRLH2":"1001070004","FRA1TMNT1":"395032"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":501,"slug":"ninja","name":"Ninja","firstName":"Geon-woo","lastName":"Noh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ninja-4csesuls.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:11.000Z","updatedAt":"2017-01-30T02:20:51.000Z","bios":{"en_US":"<p>Geon-woo \"Ninja\" Noh was originally meant to be a loan from to the Dragon Knights, but North America seems to agree with him. These days Ninja is most often found with his partner in fun Seraph, and the two solo laners have built up a great dynamic. Team Envy snapped up the duo in 2016 with the hope that giving the old friends a fresh start would propel their new team to victory. Their gamble paid off in the form of Team Envy making the playoffs in their inaugural split together. The team will bank on Ninja and Seraph’s chemistry growing and landing them right back where they want to be -- the playoffs.</p>","de_DE":"Geon-woo „Ninja“ Noh war ursprünglich eine Leihgabe der Dragon Knights, aber Nordamerika scheint ihm zu liegen. Heutzutage trifft man Ninja meistens mit seinem Freund Seraph zusammen an und die beiden Solo-Laner harmonieren großartig. Team Envy verpflichtete das Duo 2016 in der Hoffnung, dass die beiden Freunde ihre neue Mannschaft zum Sieg führen würden. Und ihr Wagnis machte sich bezahlt, als Team Envy gleich im ersten Split die Entscheidungsspiele erreichte. Die Mannschaft hofft darauf, dass Ninjas und Seraphs Harmonie noch besser geworden ist und sie wieder dorthin führen wird, wo sie sein wollen: in die Entscheidungsspiele."},"foreignIds":{"drupalId":"2143","TRLH1":"200000226","TRLH2":"200000130"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":503,"slug":"bischu","name":"Bischu","firstName":"Aaron","lastName":"Kim","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bischu-h3nie8n3.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2015-05-26T21:14:12.000Z","updatedAt":"2016-04-07T20:14:19.000Z","bios":{"en_US":"Hyung Seok “Bischu” Kim is currently playing support for Team Dragon Knights."},"foreignIds":{"drupalId":"1151","TRLH1":"1001270015","TRLH2":"1001200015","FRA1TMNT1":"375201"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":664,"slug":"trance","name":"Trance","firstName":"Lawrence","lastName":"Amador","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/trance-64pcofeg.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2016-06-09T22:55:46.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2520","FRA1TMNT1":"375421","TRLH2":"1001200033","TRLH1":"1001270033"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":666,"slug":"rf","name":"RF Legendary","firstName":"Oleksii","lastName":"Kuziuta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rf-6o25dshw.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-03-08T20:07:05.000Z","bios":{"en_US":"","fr_FR":"<p>Oleksii « RF » Kuziuta (précédemment connu sous le nom de RF Legendary) a voleté sur la scène\n\nChallenger nord-américaine pendant plusieurs années avant d'entrer aux LCS NA en 2016 avec \n\nRenegades. La quantité de dégâts qu'il est capable d'infliger, notamment avec Rumble, fait de RF une \n\ncible prioritaire. Mais il refuse de tomber sans avoir combattu jusqu'au bout.</p>","pl_PL":"<p>Ten młody Ukrainiec, przed dołączeniem do LA Renegades w marcu 2015, był członkiem tylko w drugorzędnych zespołach.  Wiosenny sezon NA LCS 2016 będzie jego debiutem, aczkolwiek jest bardzo doświadczonym graczem, ponieważ oddaje się League of Legends od czasu wydania bety. W swoich pierwszych latach lubił grać Kog’mawem, lecz nie przyniosło mu to sławy. Zyskał uznanie w Kręgu Pretendenta za doskonałe opanowanie Nidalee. Sam wielokrotnie wyznawał swoją miłość do tej postaci, podkreślając, że kocha po równo wszystkie jej skiny. Spytany o powód wyboru właśnie Zwierzęcej Łowczyni odpowiada prosto: „Fajna do gry, fajna do oglądania, trudna do opanowania, ma wysoką szansę na ciekawe zagrania, a poza tym kto by nie chciał grać piękną dziewczyną z takim tańcem, która potrafi zamienić się w kota?” Aczkolwiek na top-lanie, w oczach przeciętnego gracza, nieziemsko radzi sobie każdym bohaterem. Do grona jego ulubionych postaci należy jeszcze Irelia i Renekton.</p>\n<p>\n\"RF Legendary\" jest znany z doskonałego kontaktu ze swoimi fanami. Nigdy ich nie zawodzi i zawsze odpowiada na ich pytania na portalach społecznościowych. Olbrzymie powodzenie wśród całego społeczeństwa League of Legends przyniósł mu film wrzucony do sieci, na którego stworzenie namówili go właśnie wielbiciele. W nim zaleca się do napotkanych w szkole dziewcząt i zachęca do wspólnego powrotu do domu. Przy tym, wymieniając swoje liczne zalety, wspomina, że osiągnął diament / krąg pretendenta w solo que. Śmiałość tego występu absolutnie pobiła rekordy oglądalności, ponieważ jego nagranie obejrzała zawrotna ilość widzów - ponad 500 tysięcy.</p>\n<p>\nW rozmowach z fanami wyjawił jak się czuje w związku z dostaniem się do NA LCS. \"RF Legendary\" grając w Challenger Series czuł się spełniony i szczęśliwy. Po kwalifikacji na szczebel wyżej jest zadowolony, że będzie miał okazję się wykazać na top-lanie i że inni gracze przestali uważać, że jest one-trick pony. Sam o sobie mówi, że jest marzycielem i miłośnikiem kawy. Dzięki temu, że Oleksii urodził się w Mariupolu, na Ukrainie, a dopiero potem przeniósł się do Stanów Zjednoczonych, potrafi mówić płynnie w trzech językach – ukraińskim, rosyjskim i angielskim. </p>\n"},"foreignIds":{"drupalId":"2567","ESPORTSTMNT02":"200000740","TRLH1":"200000286"},"socialNetworks":{"twitch":"http://www.twitch.tv/RfLegendary","youtube":"https://www.youtube.com/user/RFLegendary","facebook":"https://www.facebook.com/RFLegendarylol","twitter":"https://twitter.com/RF_Legendary"},"champions":[],"liveGameTeam":73},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":736,"slug":"do-it","name":"do it","firstName":"Chan-ho","lastName":"Lee","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/do-it-b5reu0m.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2016-01-28T19:17:55.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4343","FRA1TMNT1":"375199"},"socialNetworks":{},"champions":[],"liveGameTeam":73},{"id":784,"slug":"leonyx","name":"Leonyx","firstName":"Rob","lastName":"Lee","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/leonyx-86twbq9h.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:47.000Z","updatedAt":"2017-01-19T22:25:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4563","TRLH1":"200000223","TRLH2":"200000127"},"socialNetworks":{},"champions":[],"liveGameTeam":122},{"id":1106,"slug":"moolchael","name":"moolchael","firstName":"Young","lastName":"Kim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/moolchael-4sbbf94a.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2016-01-22T03:08:08.000Z","updatedAt":"2016-03-08T00:21:39.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375423","TRLH1":"1001270024","TRLH2":"1001200024"},"socialNetworks":{},"champions":[],"liveGameTeam":73}],"scheduleItems":[{"id":"AVPtsr3vQMQFcjhwbQdZ","content":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:match:c86a55b3-8ea8-431f-8b6e-3b0f864f5ea4","scheduledTime":"2016-04-07T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655","blockLabel":"Round 2","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:bracket:f4c0c5a3-e8d6-4049-be81-8812c9a0a600"},"match":"c86a55b3-8ea8-431f-8b6e-3b0f864f5ea4","tournament":"739fc707-a686-4e49-9209-e16a80fd1655","bracket":"f4c0c5a3-e8d6-4049-be81-8812c9a0a600","league":"2"}],"gameIdMappings":[{"id":"80f61f8d-179b-4ab2-859d-0640ef6d2328","gameHash":"5642219e2f44e132"},{"id":"85fce6dc-9a6e-4a18-a68f-736ccd6a9d60","gameHash":"8af1efba89135bc5"},{"id":"49b0358e-5e2d-4cd9-826e-4b5e5b81001f","gameHash":"ef85264fe8a9c1d8"}],"videos":[{"id":2413,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:85fce6dc-9a6e-4a18-a68f-736ccd6a9d60","source":"https://www.youtube.com/embed/kvwOHajWy7Q?wmode=transparent","createdAt":"2016-04-07T20:55:11.000Z","updatedAt":"2016-04-07T20:55:11.000Z","game":"85fce6dc-9a6e-4a18-a68f-736ccd6a9d60"},{"id":2419,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:80f61f8d-179b-4ab2-859d-0640ef6d2328","source":"https://www.youtube.com/embed/awehlShBnTE?wmode=transparent","createdAt":"2016-04-07T22:22:24.000Z","updatedAt":"2016-04-07T22:22:24.000Z","game":"80f61f8d-179b-4ab2-859d-0640ef6d2328"},{"id":2420,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:739fc707-a686-4e49-9209-e16a80fd1655:game:49b0358e-5e2d-4cd9-826e-4b5e5b81001f","source":"https://www.youtube.com/embed/PJa2aUFoLno?wmode=transparent","createdAt":"2016-04-07T23:02:42.000Z","updatedAt":"2016-04-07T23:02:42.000Z","game":"49b0358e-5e2d-4cd9-826e-4b5e5b81001f"}],"htmlBlocks":[],"match":{"id":"c86a55b3-8ea8-431f-8b6e-3b0f864f5ea4","name":"match-b","position":0,"state":"resolved","groupPosition":1,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2},{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0}],"games":{"80f61f8d-179b-4ab2-859d-0640ef6d2328":{"id":"80f61f8d-179b-4ab2-859d-0640ef6d2328","name":"G2","generatedName":"REN|TDK|G2|c86a55b38ea8431f8b6","input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2},{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0}],"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e"}]],"timestamp":1460061477258,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001680153","gameRealm":"TRLH1","platformId":"TRLH1:1001680153","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"85fce6dc-9a6e-4a18-a68f-736ccd6a9d60":{"id":"85fce6dc-9a6e-4a18-a68f-736ccd6a9d60","name":"G1","generatedName":"REN|TDK|G1|c86a55b38ea8431f8b6","input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2},{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0}],"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e"}]],"timestamp":1460058143364,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001680138","gameRealm":"TRLH1","platformId":"TRLH1:1001680138","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"49b0358e-5e2d-4cd9-826e-4b5e5b81001f":{"id":"49b0358e-5e2d-4cd9-826e-4b5e5b81001f","name":"G3","generatedName":"REN|TDK|G3|c86a55b38ea8431f8b6","input":[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0},{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2}],"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e"}]],"timestamp":1460064655822,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001680159","gameRealm":"TRLH1","platformId":"TRLH1:1001680159","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5096cc3f-b833-41d1-9d4e-e4a170cde1b4":{"id":"5096cc3f-b833-41d1-9d4e-e4a170cde1b4","name":"G5","generatedName":"REN|TDK|G5|c86a55b38ea8431f8b6","input":[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0},{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"edc1bb15-bc76-4ec2-9628-32d5bbadd57b":{"id":"edc1bb15-bc76-4ec2-9628-32d5bbadd57b","name":"G4","generatedName":"REN|TDK|G4|c86a55b38ea8431f8b6","input":[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8","breakpoint":"5fe5b5c2-16e5-40ea-b2be-8a2821391b67","standing":2},{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e","match":"361d0f49-2621-48bd-addf-c4e55d96b708","standing":0}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"3f875c28-0a75-410f-b3e2-277b6356d2a8"}],[{"roster":"51d896fe-cc38-42da-a94f-45d9a7216c9e"}]],"timestamp":1460064655823,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}