{"teams":[{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]},{"id":76,"slug":"lgd-gaming","name":"LGD Gaming","guid":"be6df3df-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-5n0d69lg.png","acronym":"LGD","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/lgd-gaming-if86jc4q.png","createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:34:16.000Z","bios":{"en_US":"","fr_FR":"Pendant des années, LGD est restée coincée au milieu du classement des LPL. En dépit de quelques succès dans des tournois mineurs, ces joueurs n'ont pas menacé la domination d'EDG et de SHRC dans l'e-sport chinois. Puis LGD a décidé que ça suffisait comme ça. Elle a reconstruit l'équipe avec des joueurs coréens aguerris (imp, Flame et Acorn) à la fin de 2014. Les résultats parlent d'eux-mêmes : 1re place lors des play-offs d'été au LPL 2015.","pl_PL":"Od lat LGD znajduje się pośrodku tabeli LPL. Pomimo sukcesów w mniejszych turniejach nawet nie zbliżyło się do sukcesów EDG i SHRC w chińskim E-sporcie. I wtedy właśnie LGD stwierdziło, że starczy tego dobrego. Do swojego składu wcielili niezwykle utalentowanych Koreańczyków – impa, Flame'a i Acorna – pod koniec 2014 roku. Wyniki mówią same za siebie – 1. miejsce w letnich playoffach LPL 2015.","de_DE":"Seit Jahren steckte LGD in der Mitte der LPL-Tabelle fest. Trotz einigen Erfolgen bei kleineren Turnieren, schafften sie es nicht, die Dominanz von EDG oder SHRC zu beenden. Doch damit sollte nun ein für alle Mal Schluss sein. Sie verbesserten ihr Team mit den bekannten koreanischen Talenten imp, Flame und Acorn im Sommer 2014. Die Ergebnisse sprechen für sich - erster Platz der LPL Sommersaison in diesem Jahr.","es_ES":"LGD se pasó varios años estancado en centro de la tabla de la LPL. A pesar de obtener algunos éxitos en torneos menores, apenas alcanzó a mellar el férreo dominio que ejercían EDG o SHRC sobre los deportes electrónicos en China. Hasta que decidieron que ya estaba bien. A finales de 2014 reconstruyeron la plantilla con talentos coreanos de primera categoría, como Imp, Flame o Acorn. Los resultados hablan por sí mismos: Primer puesto de las eliminatorias de verano de la LPL 2015.","pt_BR":"A LGD passou anos vivendo na parte do meio da tabela LPL. Apesar de vitórias em alguns torneios menores, eles estavam longe de ameaçar a EDG ou a Royal Club no cenário chinês. Mas então eles deram um basta. Reconstruíram o time no final de 2014 com grandes astros coreanos: imp, Flame e Acorn. Os resultados falam por sisó -- campeões das eliminatórias de verão da LPL 2015.\n"},"foreignIds":{"drupalId":"1850"},"players":[56,67,541,589,605,998,1431],"starters":[67,541,589,605,998],"subs":[56,1431]}],"players":[{"id":56,"slug":"cool","name":"Cool","firstName":"Jia-Jun","lastName":"Yu","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/cool-esrj8abc.png","hometown":"Yiyang, China","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:14.000Z","updatedAt":"2017-06-06T23:29:21.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"698","TRLH1":"1000185041","TRLH3":"1000105048"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":67,"slug":"imp","name":"imp","firstName":"Seung-bin","lastName":"Gu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/imp-5lcuchzd.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:27.000Z","updatedAt":"2016-02-01T22:57:45.000Z","bios":{"en_US":"<p>Seung-bin “imp” Gu is notorious for his former rivalry with Gwang-jin “Piglet” Chae and his unabashed trash talk. But imp is more than just talk, and his recent results speak for themselves. Imp started his career on Samsung White (formerly MVP Ozone), a team that would eventually be one of the greatest of all time. Imp played a key role in their dominant performance -- and 1st place finish -- at the 2014 World Championship.</p>\n\n<p>In the wake of his move to LGD, imp matured. When naysayers said he would fail without his world-class support partner Mata, he proved them wrong. When his interviewers expected trash talk and arrogance, imp displayed humility and courteous manners. But there’s still a monster hiding beneath imp’s newfound modesty. The fact is, imp is very good at League of Legends, and he knows it.</p>","fr_FR":"<p>Seung-bin « imp » Gu est célèbre pour son ancienne rivalité avec Gwang-jin « Piglet » Chae et pour sa gouaille insolente. Mais imp n'est pas celui qui parle le plus : ses récents résultats sont plus éloquents encore que lui. Imp a commencé sa carrière chez Samsung White (anciennement MVP Ozone), une équipe qui allait compter parmi les meilleures de tous les temps. Imp a joué un rôle clé dans ses performances spectaculaires (et sa première place) aux Championnats du monde 2014.</p>\n\n<p>À la suite de son arrivée chez LGD, imp est devenu plus mûr. Quand les mauvaises langues ont prédit qu'il allait forcément échouer sans l'aide de son exceptionnel support, Mata, il leur a prouvé le contraire. Alors que ses interlocuteurs s'attendaient à le voir arrogant et désagréable, imp s'est montré humble et courtois. Mais cela ne veut pas dire qu'il n'y a pas un monstre qui dort derrière la nouvelle modestie dont fait preuve imp. De fait, imp est un excellent joueur de League of Legends et il le sait. Après tout, il est le premier des cinq anciens membres de Samsung White à s'être assuré une place aux Championnats du monde 2015. </p>","pl_PL":"<p>Seung-bin „imp” Gu okrył się złą sławą przez swą niegdysiejszą rywalizację z Gwang-jinem „Pigletem” Chae, a także bezwstydną krytykę innych zawodników. Imp nie jest jednak mocny wyłącznie w gębie, a jego niedawne rezultaty mówią same za siebie. Imp rozpoczął karierę jako zawodnik Samsung White (dawniej MVP Ozone) – drużyna ta przeszła do historii jako jedna z najlepszych. Rola impa w zajęciu przez drużynę pierwszego miejsca podczas mistrzostw świata 2014 była kluczowa.</p>\n\n<p>Po dołączeniu do LGD imp bardzo dojrzał jako gracz. Udowodnił malkontentom mówiącym, że nie poradzi sobie bez światowej klasy zawodnika wsparcia, Maty, jak bardzo się mylą. Ilekroć prowadzący wywiad oczekiwali przechwałek i arogancji, imp wykazywał się grzecznością i pokorą. Pod przykrywką skromności wciąż jednak drzemie w nim bestia. Prawda jest taka, że imp jest świetnym graczem w League of Legends i doskonale zdaje sobie z tego sprawę. Bądź co bądź jako pierwszy spośród pięciu zawodników Samsung White zdołał zająć pierwsze miejsce w mistrzostwach świata 2015. </p>","de_DE":"<p>Seung-bin “imp” Gu ist berühmt berüchtigt wegen seiner früheren Rivalität mit Gwang-jin “Piglet” Chae und ihren unerreichten Provokationen. Aber imp ist mittlerweile mehr als nur heiße Luft, was seine letzten Erfolge unter Beweis stellen. Imp begann seine Karriere bei Samsung White (früher MVP Ozone), einem Team das eventuell eines der besten der Welt für alle Zeit werden kann. Imp spielte eine Schlüsselrolle bei ihren dominanten Auftritten- und beendete die Weltmeisterschaft mit dem Titel. </p>\n\n<p>Durch seinen Wechsel zu LGD reifte imp. Die Pessimisten, die Imp´s Zukunft ohne seinen früheren Supporter Mata zum Scheitern verurteilten, überzeugte er deutlich. Wenn Reporter auf Provokation und Arroganz warteten, zeigte er Menschlichkeit und gutes Benehmen. Aber hinter seinem neugefundenen Anstand ist immer noch der frühere imp versteckt. Denn imp ist verdammt gut in League of Legends und genau das weiß er auch. Nach all dem war er der Erste von seinen früheren Mitspielern von Samsung White, der sich seinen Platz bei Worlds 2015 sicherte. </p>\n","es_ES":"Seung-bin ''Imp'' Gu es famoso tanto por su feroz rivalidad con Gwang-jin ''Piglet'' Chae como por una extraordinaria capacidad de meter la pata al hablar. Pero al margen de comentarios desafortunados, sus actuaciones de los últimos tiempos son aún más elocuentes. Comenzó su carrera en Samsung White (el antiguo MVP Ozone), un equipo que terminaría por convertirse en el mejor de la historia. De hecho, Imp desempeñó un papel fundamental en la exhibición realizada en el Campeonato Mundial de 2014 (y en la victoria que le puso la guinda).\n\nTras su paso a LGD, Imp ha madurado. Cuando algunos agoreros aseguraron que se vendría abajo sin su compañero, el fabuloso apoyo Mata, Imp demostró que se equivocaban. Y cuando toda la prensa esperaba que exhibiera su habitual arrogancia, respondió con una humildad y una educación impropias de él. Pero debajo de esta nueva prudencia se esconde todavía una bestia. El hecho es que Imp es un grandísimo jugador de League of Legends y lo sabe. A fin de cuentas, ha sido el primero de los cinco antiguos integrantes de Samsung White en asegurarse una plaza en el Campeonato Mundial de 2015. \n","pt_BR":"<p>Seung-bin “imp” Gu é famoso por sua antiga rivalidade com Gwang-jin “Piglet” Chae e todas as provovações que a seguiram. Mas imp é mais do que apenas conversa fiada, e seu histórico recente prova isso. Ele começou sua carreira na Samsung White (antes conhecida como MVP Ozone), uma equipe que eventualmente entraria na história como uma das melhores de todos os tempos. Imp foi uma peça chave na atuação dominante - e o primeiro lugar - no Campeonato Mundial de 2014.</p>\n\n<p>Entre todas as conversas durante sua mudança para a LGD, Imp amadureceu. Quando críticos disseram que sem Mata como suporte ele iria falhar, ele provou o contrário. Quando seus entrevistadores esperavam arrogância e provocações, Imp foi cordial e humilde. Mas ainda há um monstro por trás de sua nova modéstia. O fato é: Imp é muito bom em League of Legends. E ele sabe. Afinal, ele foi o primeiro dos cinco ex-integrantes da Samsung White a assegurar sua vaga no Campeonato Mundial 2015.</p>"},"foreignIds":{"drupalId":"681","TRLH3":"1001160026","TRLH1":"1001180006","TRLH4":"1001160026","TRLH2":"1001140006"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":541,"slug":"eimy","name":"Eimy","firstName":"Dan","lastName":"Xie","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/eimy-fmyi9due.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:36:23.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4513"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":589,"slug":"pyl","name":"Pyl","firstName":"Bo","lastName":"Chen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/pyl-ahtd159j.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:30:25.000Z","bios":{"en_US":"<p>\nBo “Pyl” Chen is one of the best supports in the LPL, with much of his strength coming from the diverse champion pool he brings to the bot lane and his dynamic shot-calling. He’s no slouch on his mechanics either; His Thresh is a must-ban, his Alistar tramples the competition, and his Janna always finds the right position to blow away the opposition. But as the captain of LGD, his ability to call out rotations and map objective prioritization truly set him apart. Pyl is the glue that holds LGD together.\n</p>","fr_FR":"<p>\nChen « Pyl » Bo est l'un des meilleurs supports des LPL, et l'une de ses principales forces, c'est la variété de champions qu'il peut faire intervenir sur la voie du bas et sa capacité à donner des ordres en s'adaptant à la situation. Il est également loin d'être manchot en ce qui concerne les compétences techniques : son Thresh est à bannir absolument, son Alistar écrabouille l'adversaire et sa Janna est toujours au bon endroit au bon moment pour souffler l'ennemi. Mais en tant que capitaine de LGD, c'est surtout sa capacité à donner des ordres et à définir les priorités pour les objectifs de la carte qui font la différence. Pyl est le ciment qui fait tenir LGD ensemble. Il devrait continuer dans cette optique lorsqu'il accueillera ses amis des LPL à l'événement All-Star 2015 avec son fameux sourire.\n</p>","pl_PL":"<p>\nChen „Pyl“ Bo gehört zu den besten Supportern in der LPL, und ein großer Teil seiner Stärke beruht auf seinem breitgefächerten Championpool, den er in die untere Lane mitbringt, und auf seinem dynamischen Shot-Calling. Doch auch seine Mechaniken können sich sehen lassen. Seinen Thresh zu bannen ist Pflicht, sein Alistar zertrampelt seine Rivalen und seine Janna findet immer die richtige Position, um den Gegner auszuschalten. Was ihn jedoch als Teamleiter wirklich ausmacht, ist seine Fähigkeit, Wechsel anzuordnen und bei den Kartenzielen Prioritäten zu setzen. Pyl ist der Leim, der LGD zusammenhält. Dies werden wir auch beim All-Star-Event 2015 erleben, wenn er die anderen Stars der LPL mit seinem berühmten Lächeln begrüßt.\n</p>","de_DE":"<p>Chen “Pyl” Bo ist einer der besten Supporter in der LPL, was vor allem von seinem großen Championpool für die Bot-Lane und seinem dynamischen Shotcalling herrührt. Aber auch seine Mechaniken sind nicht die schlechtesten; sein Thresh ist ein Must-Ban, sein Alistar trampelt die Spiele nieder und seine Janna findet immer die richtige Position, um die Gegner wegzuwehen. Zudem hebt ihn seine Fähigkeit als Kapitän das Team über die Karte zu navigieren und sein Fokus auf Objekte hervor. Pyl ist der Kleber, der LGD zusammenhält. </p>\n\n<p>Tatsächlich sind seine Fähigkeiten so begehrt, dass sich selbst Seung-bin “imp” Gu für LGD entschieden hat, nur um mit Pyl zusammenspielen zu können. Während er vorher seine Bot-Lane-Partner übertroffen hat, fand er mit Imp einen Partner, der jeden seiner Züge mitgehen kann. </p>\n","es_ES":"<p>\nChen ''Pyl'' Bo es uno de los mejores apoyos de la LPL, gracias a la diversidad del arsenal de campeones que puede usar en la calle inferior y a su dinamismo a la hora de marcar jugadas. Y por mecánicas tampoco es manco: Aunque los rivales bloqueen a su Thresh (como suelen hacer), es perfectamente capaz de pisotearlos con Alistar y siempre encuentra el modo de hacerlos volar por los aires con Janna. Como capitán de LGD, su habilidad para organizar las rotaciones y priorizar los objetivos lo convierte en único. Pyl es el pegamento que mantiene unido a LGD. Y seguirá siéndolo en el All-Star 2015, cuando luzca su ya famosa sonrisa para dar la bienvenida a otras estrellas de la LPL.\n</p>","pt_BR":"<p>Chen “Pyl” Bo é um dos melhores suportes na LPL, com muito de sua força vindo de um vasto leque de Campeões aliado à sua dinâmica de chamadas de equipe. Ele não é fraco em mecânicas também; seu Thresh é um banimento quase permanente, seu Alistar atropela as rotas, e sua Janna sempre sabe o lado certo para jogar os furacões. Mas como capitão da LGD, sua habilidade de chamar rotações, posicionar a equipe para objetivos e pressão pelo mapa é o que o diferencia. Pyl é a cola que segura a LGD junta.</p>\n\n<p>De fato, as habilidades de Pyl são tão aclamadas que Seung-bin “imp” Gu escolheu propositalmente a LGD somente para jogar com o suporte. Se antes ele brilhava mais do que seus parceiros de rota, quando Imp entrou na equipe, Pyl encontrou um companheiro de equipe que pudesse ser o seu par perfeito.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Chen “Pyl” Bo 선수는 LPL 최고의 서포터로 꼽힙니다. 넓은 챔피언 폭과 적극적인 지휘에서 그 저력이 나오는 선수입니다. 게다가 피지컬까지 뛰어납니다. 항상 쓰레쉬를 밴당하고 알리스타를 플레이할 땐 상대를 짓뭉개버리죠. 잔나를 잡으면 항상 정확한 위치 선정으로 상대를 날려버립니다. 그리고 LGD의 주장으로서 맵 상의 주요 목표물을 노릴 시기나 어떤 목표물을 먼저 노릴지 정하는 능력이 아주 뛰어납니다. Pyl 선수는 LGD를 하나로 묶는 구심점이기도 합니다. 이번 올스타 대회에서 다른 LPL 올스타를 만났을 때도 특유의 미소로 반기며 팀을 끈끈하게 만들어 주리라 기대해 봅니다. </p>"},"foreignIds":{"drupalId":"2069","TRLH3":"1001160027","TRLH4":"1001160027","TRLH1":"1001180005","TRLH2":"1001140005"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":605,"slug":"godv","name":"GodV","firstName":"Zhen","lastName":"Wei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/godv-awtbwftn.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:35:21.000Z","bios":{"en_US":"","fr_FR":"<p>Wei « We1less » Zhen, précédemment connu sous le nom de GODV, a placé la barre très haut lorsqu'il a choisi son premier surnom. Mais, sachant que We1less est devenu l'un des mid laners les plus réputés des LPL, il savait peut-être exactement ce qu'il faisait. Sa carrière n'a pas été de tout repos, mais on dirait que We1less est enfin sur le point d'arriver à ses fins.</p>\n\n<p>À l'origine, We1less était meneur de jeu chez Vici Gaming. Il jouait de façon égoïste et, s'il voyait une opportunité de plonger dans le combat, il n'hésitait pas une seule seconde. Évidemment, cette stratégie ne portait pas forcément ses fruits, que ce soit pour lui ou pour son équipe. Cependant, avec le temps, We1less est devenu plus réfléchi et a développé son esprit d'équipe. C'est un joueur dynamique qui réfléchit toujours à ce qu'il pourrait apporter à son équipe plutôt que le contraire.</p>\n\n<p>Même si We1less a eu du mal à rejoindre la Faille en 2016 à cause d'une blessure persistante, il a pu prouver son énorme potentiel de jeu à la toute fin du segment d'été. Enregistrant des scores hallucinants, We1less nous a montré à quel point son niveau était élevé. Ses éclairs de génie ont ébloui les fans, qui l'ont choisi pour participer à l'événement All-Stars 2016 de Barcelone. Il déborde de talent et, à en croire ses dernières performances, ses sorts risquent d'être précoces et nombreux. </p>","pl_PL":"Wei „We1less” Zhen, dawniej znany jako GODV, całkiem wysoko ustawił sobie poprzeczkę, wybierając swoje stare przezwisko. Jednak biorąc pod uwagę, że We1less został okrzyknięty jednym z najlepszych środkowych w LPL, może dokładnie wiedział, co robi. Jego podróż była trudna, ale wydaje się, że We1less nareszcie dociera do celu.</p>\n\nDawno, dawno temu We1less był rozgrywającym w Vici Gaming. Grał egoistycznie i gdy tylko dostrzegał okazję do ataku, zazwyczaj z niej korzystał. Oczywiście taka strategia nie zawsze kończyła się dobrze dla niego lub jego drużyny. Teraz jednak We1less jest rozważniejszy i bardziej zorientowany na drużynę. To dynamiczny zawodnik, który zawsze myśli o tym, jak może zapewnić korzyści swojej drużynie (a nie odwrotnie).</p>\n\nChociaż We1less miał problemy z grą na Summoner’s Rift w 2016 roku z powodu uporczywej kontuzji, pod sam koniec letniego splitu zaprezentował swój pełny potencjał jako zawodnik. Zdobywając naprawdę niesamowite wyniki punktowe, We1less pokazał nam, że ustawił sobie poprzeczkę naprawdę wysoko. Jego przebłyski geniuszu oszołomiły fanów, którzy zagłosowali na niego i wysłali na wydarzenie All-Star 2016 w Barcelonie. Ma ogromy potencjał i jeśli można robić założenia w oparciu o jego wcześniejsze występy, to czary We1lessa na turnieju będą latały szybko i często. \n","de_DE":"<p>Wei „We1less“ Zhen, ehemals bekannt als GODV, legte die Latte für sich selbst ziemlich hoch, als er sich für seinen alten Namen entschied. Aber wenn man bedenkt, dass We1less zu einem der am meisten gelobten Mid-Laner der LPL wurde, dann könnte man meinen, er wusste damals ganz genau, was er tat. Sein Weg war steinig, aber es scheint, als wäre We1less endlich angekommen.</p>\n\n<p>Vor langer Zeit war We1less der Spielmacher von Vici Gaming. Er war ein egoistischer Spieler, der so gut wie jede Gelegenheit nutzt, einen Gegner bis zum Schluss zu verfolgen. Natürlich endete diese Strategie nicht immer gut für ihn oder seine Mannschaft. Heute spielt We1less jedoch wesentlich berechnender und teamorientierter. Er ist ein dynamischer Spieler, der immer darüber nachdenkt, wie er seiner Mannschaft helfen kann.</p>\n\n<p>Und obwohl We1less 2016 mit einer hartnäckigen Verletzung zu kämpfen hatte, war sein Potenzial gegen Ende des Sommer-Splits klar zu erkennen. We1less lieferte ein paar unglaubliche Ergebnisse ab und zeigte uns, wie gut er wirklich sein kann. Er ließ immer wieder seine Klasse aufblitzen und begeisterte damit die Fans, die ihn beim All-Stars-Event 2016 in Barcelona sehen wollen. Er steckt voller Potenzial, und wenn man an seine vergangenen Leistungen denkt, ist davon auszugehen, dass er schnell mit viel Zaubern um sich schleudern wird.</p>","es_ES":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores de la calle central más codiciados de la LPL, puede que supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del split de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes.</p>","pt_BR":"<p>Wei “We1less” Zhen, antes conhecido como GODV, subiu bastante o patamar quando escolheu seu antigo apelido. Porém, considerando que We1less se tornou um dos jogadores de meio mais prolíficos da LPL, é provável que ele soubesse direitinho o que estava fazendo. Sua jornada foi difícil, mas parece que We1less finalmente está para chegar.\n\nUm dia, We1less foi um criador de jogadas na Vici Gaming. Ele jogava de forma egoísta e, se tivesse a oportunidade de mergulhar, ele normalmente o fazia. Obviamente, essa estratégia nem sempre dava certo, tanto para ele, quanto para sua equipe. Agora, We1less é mais calculado e pensa mais na equipe. Ele é um jogador dinâmico, sempre pensando em como ele pode beneficiar sua equipe, em vez do contrário.</p>\n\n<p>Apesar de We1less ter tido problemas entrando em Summoner’s Rift em 2016 com uma lesão, seu grande potencial de jogo estava à mostra no fim da Etapa de Verão. Ostentando alguns placares ridiculamente bons, We1less nos mostrou quão alto pode chegar. Seu desempenho incrível deixou uma boa impressão nos fãs que deixaram claro que o queriam no Evento All-Star 2016 em Barcelona. Ele está repleto de potencial para grandes jogadas e, se seus desempenhos anteriores são qualquer indicador, vai ter muito feitiço voando pelo mapa. </p>","cs_CZ":"<p>Wei „We1less“ Zhen, dříve známý jako GODV, si při výběru své předchozí přezdívky nasadil laťku pěkně vysoko. Ale jelikož se z něj stal jeden z nejsledovanějších středových lajnařů v LPL, možná věděl, co dělá. Jeho cesta na výsluní byla trnitá, ovšem zdá se, že konečně nese svoje ovoce.</p>\n\n<p>We1less býval kapitánem Vici Gaming. Hrával sobecky, a když se mu naskytla příležitost vrhnout se po hlavě do boje, jen málokdy jí odolal. Tato strategie samozřejmě pro něj i jeho tým nekončila pokaždé dobře. Nyní je We1less prozíravější a víc myslí na své spolubojovníky. Hraje dynamicky a neustále přemýšlí, čím by mohl svému týmu prospět on, ne naopak.</p>\n\n<p>A ačkoliv se kvůli nepříjemnému zranění podíval We1less do Žlebu v roce 2016 jen málokdy, na konci letního splitu bylo jeho řádění na bojišti hodně znát. Jeho statistiky poskočily do závratných výšin a ukázal nám, co můžeme očekávat od skutečně hvězdného hráče. Fanoušky tyto záblesky dokonalosti náležitě okouzlily, takže jej v hlasování vyslali na turnaj All-Star 2016. Dokáže provádět naprosto úchvatné akce a z jeho předchozích výkonů lze soudit, že i v Barceloně budou kouzla létat často a již krátce po zahájení utkání. </p>","el_GR":"<p>Ο Wei “We1less” Zhen, γνωστός στο παρελθόν ως GODV, ανέβασε μόνος του ψηλά τον πήχη με το όνομα που διάλεξε τότε. Από την άλλη πλευρά, ο We1less έχει γίνει ένας από τους πιο διάσημους παίκτες μεσαίας λωρίδας στο LPL, επομένως ίσως και να μην το έκανε κατά τύχη. Η διαδρομή του ήταν πολύ δύσκολη, αλλά όλα δείχνουν ότι ο We1less κοντεύει να φτάσει στον προορισμό του.</p>\n\n<p>Μια φορά κι έναν καιρό, ο We1less ήταν ο οργανωτής των Vici Gaming. Έπαιζε με πολύ εγωιστικό τρόπο και, όταν έβλεπε μια ευκαιρία να χωθεί στη δράση, ποτέ δεν την άφηνε να πάει χαμένη. Προφανώς, αυτή η στρατηγική δεν είχε πάντα καλή κατάληξη για αυτόν και για την ομάδα του. Τώρα, όμως, ο We1less παίζει πολύ πιο ομαδικά και στρατηγικά. Είναι ένας ευέλικτος παίκτης που σκέφτεται πάντα πώς μπορεί να βοηθήσει την ομάδα του και όχι πώς μπορεί να βοηθήσει αυτόν η ομάδα.</p>\n\n<p>Παρόλο που ο We1less δυσκολεύτηκε αρκετά να βρει το ρυθμό του στο 2016 λόγω ενός πολύ επίμονου τραυματισμού, έδειξε πολύ καλά τι μπορεί να κάνει στο τέλος του Summer Split. Σε μια σειρά αγώνων όπου πέτυχε εξωπραγματικές επιδόσεις, ο We1less έδειξε σε όλους πόσο ψηλά μπορεί να φτάσει. Αυτές οι θεαματικές του εκλάμψεις γοήτευσαν το κοινό που τον έστειλε στο Τουρνουά All-Star 2016. Είναι πάντα έτοιμος για μια μεγάλη κίνηση και, αν κρίνουμε από τις προηγούμενες εμφανίσεις του, θα δούμε πολλά ξόρκια στο παιχνίδι, συχνά και από νωρίς. </p>","hu_HU":"<p>Wei „We1less” Zhen, korábbi nevén GODV, elég magasra tette a lécet a korábbi neve megválasztásával. De mivel We1less lett az LPL egyik legfelkapottabb középső ösvényese, valószínűleg már akkor is tudta, hogy mi a dörgés. Nem volt egyszerű az út, de úgy tűnik, hogy We1less révbe érhet.</p>\n\n<p>We1less régebben a Vici Gaming irányítója volt. Önzően játszott, és ha meglátott egy lehetőséget, azonnal lecsapott rá. Ez a „stratégia” nyilván nem mindig volt előnyös a csapata számára. Mára We1less sokkal számítóbb és csapatközpontúbb lett. Dinamikus játékos, aki mindig azt nézi, hogyan segítheti a csapatát, és nem fordítva.</p>\n\nWe1less nehezen tudott belevágni a 2016-os évbe egy zavaró sérülés miatt, de a nyári szakasz végén ismét megcsillogtatta játéktudását. We1less elképesztő statisztikákat produkált, jelezve, hogy a határ számára a csillagos ég. Ezek a felvillanások is meggyőzték a rajongókat, hogy ott a helye a 2016-os All-Star gálán Barcelonában. Mindig ott van benne egy látványos akció esélye, és ha a korábbiak alapján kellene tippelni, akkor hamar el fog szabadulni a pokol a Szurdokban. \n","it_IT":"<p>Wei \"We1less\" Zhen, già noto come GODZ, ha scelto per se stesso un nome pieno di aspettative. E a quanto pare sapeva cosa stava facendo, visto che è riuscito a diventare uno dei centrali più apprezzati della LPL. Il suo viaggio non è stato dei più semplici, ma a quanto pare sta per arrivare alla sua meta.</p>\n\nIn passato We1less ha fatto il regista in Vici Gaming. Il suo stile era molto egoistico e sfruttava ogni occasione per tuffarsi all'attacco. Ovviamente, quella strategia non funzionava sempre. Ora però We1less è diventato più riflessivo e aperto al gioco di squadra. È un giocatore dinamico, sempre intento a pensare a come aiutare il proprio team, invece che usare il supporto della squadra a suo beneficio.</p>\n\nPur avendo avuto difficoltà ad affacciarsi sulla Landa nel 2016 a causa di un infortunio, il suo grande potenziale è stato sotto gli occhi di tutti verso la fine del Summer Split. Con le sue cifre da capogiro, We1less ci ha dimostrato di non avere limiti. Le sue brillanti giocate hanno abbagliato i fan, che hanno votato per la sua presenza all'All-Star 2016 di Barcellona. We1less ha un potenziale incredibile, e a giudicare dalle sue prestazioni passate vedremo qualcosa di straordinario. \n","ro_RO":"Wei ''We1less'' Zhen, cunoscut în trecut ca GODV, și-a stabilit un standard destul de înalt când și-a ales vechiul nume. Dar, având în vedere că a devenit unul dintre cei mai titrați jucători de pe culoarul din mijloc din LPL, poate că era conștient de ceea ce face. Drumul său a fost unul cu suișuri și coborâșuri, dar se pare că We1less e în sfârșit aproape de destinație.</p>\n\nDemult, We1less era playmaker la Vici Gaming. Era un jucător egoist; dacă vedea o oportunitate de a se arunca în luptă, de obicei profita de ea. Evident, acea strategie n-a fost întotdeauna strălucită, nici pentru el și nici pentru Vici. Acum, însă, We1less este mai calculat și mai atent la interesele echipei. E un jucător dinamic, care se gândește mereu cum își poate ajuta coechipierii, în loc să se gândească cum îl pot ajuta ei pe el.</p>\n\nChiar dacă We1less nu a putut intra în Rift în 2016 din cauza unei accidentări, potențialul său de a crea situații favorabile a ajuns în lumina reflectoarelor spre finalul etapei de vară. Reușind niște scoruri incredibile, We1less ne-a arătat cât de bun este cu adevărat. Reușitele sale impresionante i-au uimit pe fani, care l-au votat la All-Star Event 2016 din Barcelona. Are un potențial uriaș de a crea faze spectaculoase și, dacă e să ne luăm după reușitele sale din trecut, va lansa vrăji des, încă de la început. \n","es_AR":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>","es_MX":"<p>Wei \"We1less\" Zhen, anteriormente conocido como GODV, se puso el listón bastante alto cuando eligió su antiguo nombre, teniendo en cuenta la referencia divina en inglés. Pero si tenemos en cuenta que We1less se ha convertido en uno de los jugadores del carril central más codiciados de la LPL, tal vez supiera lo que hacía. El viaje ha sido duro, pero parece que We1less está a punto de llegar a su meta.</p>\n\n<p>Hubo un tiempo en el que se dedicaba a buscar las mejores jugadas personales en Vici Gaming. Jugaba de forma egoísta y, si veía la oportunidad de lanzarse bajo la torre para asesinar, lo hacía. Obviamente, esa estrategia no siempre dejaba muy bien parado a su equipo o a él mismo. Ahora, sin embargo, We1less es más calculador y juega más en equipo. Es un jugador dinámico, que siempre piensa sobre cómo puede beneficiar a su equipo, en lugar de hacer lo contrario.</p>\n\n<p>Aunque We1less tuvo problemas para adentrarse en la Grieta en 2016 debido a una molesta lesión, su gran potencial como jugador se puso de manifiesto casi al final del torneo de verano. Con algunos marcadores descabellados, We1less nos mostró lo alto que puede llegar. Sus momentos de esplendor han sorprendido a los fans, que lo han votado para asistir al All-Star Event 2016 en Barcelona. Hará su aparición cargado de potencial para la partida y sus actuaciones del pasado lo atestiguan. Se prevén hechizos tempranos y frecuentes. </p>"},"foreignIds":{"drupalId":"4529","TRLH3":"1001360058","TRLH4":"1001310058"},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":998,"slug":"jinoo","name":"Jinoo","firstName":"Jin-woo","lastName":"Lim","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jinoo-53memnp9.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2016-01-06T21:32:05.000Z","updatedAt":"2016-02-01T22:57:58.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1431,"slug":"intruder","name":"Intruder","firstName":"Sheng","lastName":"Tang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/intruder-3ffozme5.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:35:52.000Z","updatedAt":"2016-08-24T21:36:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":76},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AU_di2jWOPWArxM1l4Vn","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:cbe5227b-c24d-46cb-be52-632577c52936","scheduledTime":"2015-10-10T13:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"7","subBlockLabel":"paris - W2D3","blockPrefix":"day","subBlockPrefix":"","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:f4f94de5-3cb2-422d-89ed-2d95526f65cc"},"match":"cbe5227b-c24d-46cb-be52-632577c52936","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"f4f94de5-3cb2-422d-89ed-2d95526f65cc","league":"9"}],"gameIdMappings":[{"id":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb","gameHash":"a91e128bd7b528dc"}],"videos":[{"id":140,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:9b5f0679-7a04-4d04-ba33-f298fbd70ceb","source":"https://www.youtube.com/embed/HyQn_LemxIM?wmode=transparent","createdAt":"2015-10-10T16:12:58.000Z","updatedAt":"2015-10-10T16:44:43.000Z","game":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb"},{"id":141,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:9b5f0679-7a04-4d04-ba33-f298fbd70ceb","source":"https://www.youtube.com/embed/Ugir3fxZBkA?wmode=transparent","createdAt":"2015-10-10T16:13:11.000Z","updatedAt":"2015-10-10T16:13:11.000Z","game":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb"},{"id":169,"slug":null,"label":null,"locale":"de","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:9b5f0679-7a04-4d04-ba33-f298fbd70ceb","source":"https://www.youtube.com/embed/VPyTrbd407c?wmode=transparent","createdAt":"2015-10-11T09:55:47.000Z","updatedAt":"2015-10-11T09:55:47.000Z","game":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb"},{"id":170,"slug":null,"label":null,"locale":"es","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:9b5f0679-7a04-4d04-ba33-f298fbd70ceb","source":"https://www.youtube.com/embed/xmZx1DCXcx0?wmode=transparent","createdAt":"2015-10-11T09:55:59.000Z","updatedAt":"2015-10-11T09:55:59.000Z","game":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb"}],"htmlBlocks":[],"match":{"id":"cbe5227b-c24d-46cb-be52-632577c52936","name":"OG-vs-LGD","position":2,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"46b4c150-8c57-4319-88ce-0a9ce40f85b5"},{"roster":"fd776b6d-1274-4430-9ca0-355aab84f06e"}],"games":{"9b5f0679-7a04-4d04-ba33-f298fbd70ceb":{"id":"9b5f0679-7a04-4d04-ba33-f298fbd70ceb","name":"G1","generatedName":"LGD|OG|G1|cbe5227bc24d46cbbe52","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"46b4c150-8c57-4319-88ce-0a9ce40f85b5"},{"roster":"fd776b6d-1274-4430-9ca0-355aab84f06e"}],"standings":{"result":[[{"roster":"fd776b6d-1274-4430-9ca0-355aab84f06e"}],[{"roster":"46b4c150-8c57-4319-88ce-0a9ce40f85b5"}]],"timestamp":1444488944471,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001380831","gameRealm":"TRLH3","platformId":"TRLH3:1001380831","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"fd776b6d-1274-4430-9ca0-355aab84f06e"}],[{"roster":"46b4c150-8c57-4319-88ce-0a9ce40f85b5"}]],"timestamp":1444488944472,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scoring":{"identifier":"LegacyScoringStrategy","options":{"points":[1,0]}},"scores":{"46b4c150-8c57-4319-88ce-0a9ce40f85b5":0,"fd776b6d-1274-4430-9ca0-355aab84f06e":1}}}