{"teams":[{"id":55,"slug":"fc-schalke-04","name":"FC Schalke 04","guid":"be6cad42-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fc-schalke-04-h992ofkj.png","acronym":"S04","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-07-06T22:27:08.000Z","bios":{"en_US":"<p>\nFC Schalke 04 bought Elements’  EU LCS seed just before the beginning of the 2016 EU LCS Summer Split. The team's remained largely the same, aside from a key addition in the mid lane with Hampus “Fox” Myhre. \n</p>\n<p>\nSchalke has a long history in organized sports, dating back to the early 1900s. This marks their first foray into the world of League of Legends esports. With a group that finished 7th last split, Schalke is looking to turn around the team’s fortunes and carve a name for themselves in the esports world.\n</p>\n<p>\nCoach: Michael \"Veteran\" Archer\n</p>","pl_PL":"<p>Organizacja, która istnieje dzięki zaangażowaniu graczy udzielających się w League of Legends od jej początków. Drużyna Elements powstała z Alliance, po której odziedziczyła miejsce w wiosennym sezonie EU LCS 2015. Przymusowa przemiana była spowodowana zmianami praw dotyczących zespołów, zbiegła się również ze zmianami w składzie osobowym drużyny. W sezonie piątym cała drużyna został zbudowana w około Henrika \"Froggen\" Hansena, jednego z najpopularniejszych graczy Europy. Stworzeniu organizacji towarzyszyła ciekawa i bardzo oryginalna kampania reklamująca jej członków. W sieci pojawiła się seria zdjęć przedstawiająca buty każdego z zawodników, dzięki czemu część z nich została rozpoznana przez fanów przed oficjalnym ogłoszeniem całej ekipy. Pojawił się również ich znak firmowy – logo przedstawiające pięć żywiołów. Dzięki znanym i lubianym graczom, którzy znaleźli się w szeregach organizacji, rzesza wielbicieli kibicowała kolejnym ujawnianym informacjom o powstającej drużynie.</p>\n<p>\nPo nowo utworzonej organizacji fani spodziewali się wyników, które zagwarantują Elements podium. Niestety rzeczywistość i poważna konkurencja zweryfikowały te oczekiwania. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 żywiołowej ekipie poszło przeciętnie. Dwukrotnie znaleźli się na siódmej pozycji mało imponującym wynikiem 7:11. Zwolennicy nie byli w pełni zawiedzeni, gdyż zespół Elements nie radził sobie najgorzej na tle innych drużyn. Jednak wszyscy, analitycy i fani, spodziewali się dużo więcej po tak hucznie ogłoszonym składzie graczy. Pozytywnym aspektem ich pozycji było znalezienie się poza trzema zespołami trafiającymi do rozgrywek relegacyjnych. Niestety będąc na siódmym miejscu nie mogli wziąć udziału w meczach barażowych.</p>\n<p>\nWłaściciel organizacji Elements, Jacob Toft-Andersen, w sezonie piątym starał się żeby polepszyć wyniki swojej drużyny. Wiele zmian osobowych wynikało z jego troski, lecz prawdopodobnie w tym okresie było ich zbyt dużo. Na przykład po wiosennym sezonie został wymieniony cały skład, oprócz mid-lanera.  Zawodnicy nie zdążyli się zgrać, w efekcie czego nie poprawiła się ani pozycja ani kondycja zespołu. Ostatecznie nie był zadowolony z osiągnięć Elements, w związku z czym podjął próbę sprzedania miejsca w wiosennym sezonie EU LCS 2016. Nieszczęśliwie dla Jacoba, nie znalazł się żaden chętny. Dlatego zdecydował się podjąć wyzwanie w czołowych europejskich rozgrywkach w 2016 roku. </p>\n","de_DE":"<p>Nachdem Alliance als erstes Team seit Entstehung der LCS Fnatic vom ersten Platz stieß, kam der Namenswechsel zum heutigen Elements. Mit lediglich einem Wechsel der Schützen Position von Erik \"Tabzz\" Van Helvert auf Martin \"Rekkles\" Larsson sollte ein Team entstehen, das fortan die europäische Liga dominieren sollte. Zu den erwünschten Resultaten kam es jedoch nie. Seit der Entstehung Anfang 2015 wurden nur mittelmäßige Erfolge erzielt. </p>\n<p><h2>Änderung sind nötig</p></h2>\n<p>Schon zum Spring Split 2015 nahm das Team um den damaligen Captain Henrik \"Froggen\" Hansen erste Änderungen vor, nachdem es das Team nicht schaffte, sich vom Mittelfeld im Ranking zu lösen. Ergebnis des Splits: Ein siebter Platz und damit verbunden erste große Spielerwechsel. Es wurden abgesehen von der Mitte und dem Support alle Positionen ausgetauscht, weiterhin mit Froggen als Kernspieler. Zu diesem Zeitpunkt stieß mit Hampus \"promisQ\" Abrahamsson, erstmals ein unbeschriebenes Blatt, zum Team. </p>\n<p>Die Resultate blieben weiterhin nicht zufriedenstellend. So hatte das Team nach einem erneuten siebten Platz im Summer Split keine Chance mehr, sich bei den Playoffs für die Weltmeisterschaft zu qualifizieren. Weitere Änderungen in der Teamaufstellung waren also schon zu erwarten. </p>\n<p><h2>Eine Legende verschwindet</p></h2>\n<p>Das Team hat nun seine bisher größte Änderung erfahren. Mit dem Wechsel von vier Spielern, darunter auch Froggen, ist die neue Stärke nur sehr schwer einzuschätzen. Bisher war eines der großen Probleme, dass das Team die Spiele möglichst in die Länge ziehen musste, um einen Sieg zu erreichen. Die neue Aufstellung sollte nun eine gute Gelegenheit bieten, mit neuen Taktiken in die Kluft der Beschwörer zu ziehen. Mit Patrick \"Nyph\" Funke steht in jedem Fall ein sehr erfahrener Spieler als Coach hinter den Spielern. </p>\n<p>Die sechste Saison wird in jedem Fall eine große Herausforderung werden. Elements wird als einer der Underdogs ins Rennen gehen und sich seinen Platz hart erkämpfen müssen. Die Priorität sollte darauf liegen, sich erst einmal aufeinander einzuspielen und mit gutem Teamwork zu überzeugen. Erst nachdem die Spieler gewisse Konsistenz unter Beweis gestellt haben, würde sich eine weitere Spezialisierung auf die Konkurrenz lohnen. </p>\n<p> Im Sommer wurde das Team nun von dem Bundesliga-Club Schalke 04 übernommen und dadurch größte Aufmerksamkeit erreicht. Wie sich das neue Team schlagen wird, muss man in den nächsten Wochen beobachten.</p>\n<p>Zu hoch gesteckte Ziele haben in der Vergangenheit eher einen gegenteiligen Effekt zum gewünschten Erfolg gebracht. Stattdessen haben die Spieler nun die Chance, bei niedrigen Erwartungen die Zuschauer zu überraschen. </p>\n","es_ES":"<p>Elements es uno de los equipos con más historia dentro de la LCS EU, historia que se remonta hasta CLG.EU en el año 2012. Como Alliance en 2014 consiguieron la victoria en los playoffs de verano de la LCS EU 2014, lo que los coronó como el mejor equipo de Europa por aquel entonces, y un equipo a tener en cuenta en el Campeonato Mundial de ese mismo año. Pero todo se vino abajo cuando fueron eliminados en la fase de grupos al perder con el equipo brasileño KaBuM! e-Sports, algo que todavía queda en la memoria de los aficionados.</p>\n\n<p>2015 no empezó mejor para el equipo europeo que después de ganar la LCS no pudo pasar del séptimo puesto en el Split de primavera de 2015, algo decepcionante que hizo retumbar los cimientos de la organización. El Split de verano iba a ser otro nuevo comienzo para Elements, pero no pudieron más que repetir la séptima posición. Para esta nueva temporada todo ha cambiado, en la LCS 2016 Elements busca una nueva dirección. ¿Conseguirán reconducir la dinámica negativa de la última temporada?</p>","fr_FR":"<p>Le FC Schalke 04 a une histoire très riche. Ce club sportif allemand a fêté son centenaire en 2004 et est le deuxième plus grand club d’Allemagne. Rien que ça. Plus de 100 000 membres y sont licenciés et le club possède des sections dans les plus grandes disciplines sportives comme le basket-ball, le handball, l’athlétisme, le tennis de Table et évidemment le football. Et depuis le mois de mai 2016, le FC Schalke 04 a mis un pied dans l’e-sport en choisissant d’investir dans une équipe League of Legends, rachetant l’équipe Elements et devenant le second club sportif à acheter une équipe League of Legends après l’équipe turque Beşiktaş au début de l’année 2015.</p> \n\n<p>Seul un joueur a été remplacé lors de la transition : le Français Jérémy « Eika » Valdenaire, au profit du Suédois Hampus « Fox » Myhre. Fox rejoint donc le cinq majeur dont les autres membres sont le Français Etienne « Steve » Michels au top, l’Allemand Berk « Gilius » Demir dans la jungle, le Danois Rasmus « MrRallez » Skinneholm en botlane et le Suédois Hampus « sprattel » Abrahamsson en support.</p>  \n\n<p>Ces joueurs vont pouvoir profiter d’un encadrement expérimenté qui devrait les mettre dans les meilleures conditions pour préparer leur saison. Le centre de formation de l’équipe de football a formé certains des meilleurs joueurs du monde, le club sait donc comment donner les armes à ses joueurs pour exprimer leur plein potentiel. L’avenir nous dira si le même destin attend la section League of Legends !</p> \n"},"foreignIds":{"drupalId":"3659"},"players":[233,490,824,1337,1376,1377,1752,2013],"starters":[233,824,1337,1376,1377],"subs":[490,1752,2013]},{"id":165,"slug":"vitality","name":"Team Vitality","guid":"be6fe2a1-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vitality-2eb9w6iv.png","acronym":"VIT","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:57:43.000Z","updatedAt":"2017-06-30T14:09:41.000Z","bios":{"de_DE":"<p>Für Team Vitality geht es 2017 vor allem um Beständigkeit. Die Mannschaft beendete den Sommer-Split der EU LCS 2016 mit neun Unentschieden, dem Höchstwert der Liga. Sie landeten auf dem siebten Platz, wodurch sie zwar dem Frühjahrs-Aufstiegsturnier entgingen, aber nicht in die Entscheidungsspiele einziehen konnten.\n\nVitality hat sich für das neue Jahr Verstärkung auf der unteren Lane geholt. Mit Steeelback und Hachani und einem neuen Liga-Format, durch das es keine Unentschieden mehr gibt, ist Vitality in dieser Saison dafür prädestiniert, mehr Siege einzufahren.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Mannschaftsleiter: Michael \"Garki\" Bolze</p>","pl_PL":"<p>Vitality to francuska organizacja znana do tej pory głównie na scenie gier FPS, która postanowiła jednak zainwestować także w dywizję League of Legends. 9 grudnia 2015 roku ogłosiła ona odkupienie miejsca od zasłużonego Gambit Gaming. Niemal od razu do organizacji dołączył Raymond „KaSing” Tsang, który ostatecznie nie doszedł do porozumienia z Team SoloMid. To właśnie wokół angielskiego wspierającego został zbudowany zespół i 14 grudnia 2015 roku formacja ogłosiła tożsamość pozostałych zawodników. Miejsce na górnej alei zajął uznawany za jednego z najlepszych, o ile nie najlepszego, górnych w Europie – Francuz Lucas „Cabochard” Simon-Meslet. Środkową linię wypełnił Erlend „Nukeduck” Holm, który opuścił Team ROCCAT. Nowym dżunglerem został znany z występów w Copenhagen Wolves i Elements Ilyas „Shook” Hartsema. Tymczasem partnerem KaSinga na dolnej alei został Petter „Hjärnan” Freyschuss, z którym Anglik występował już w H2k. Trenerem zespołu ogłoszono znanego ze współpracy z Gambitem w letnim splicie 2014 byłego dżunglera, Kévina „Shaunza” Ghanbarzadeha. Drużynie udało się zbudować mocny skład i cel formacji na wiosnę 2016 to z pewnością walka o najwyższe cele.</p>\n<p>W wiosennym splicie EU LCS 2016 drużyna Team Vitality zadziwiła wszystkich fanów. Przygotowanie graczy do rozgrywek było godne podziwu, patrząc na wiek organizacji. Ten świeży zespół rozpoczął ten okres od zajęcia czwartego miejsca w pierwszym tygodniu i do samego końca nie spadł niżej. Jego wyniki były o tyle imponujące, że udało mu się czterokrotnie skończyć tydzień, wygrywając oba mecze. Natomiast ani razu drużyna Team Vitality nie przegrała obydwóch spotkań, dzięki czemu skończyła wiosenny split EU LCS 2016 na podium. Zajęcie zaszczytnego trzeciego miejsca było efektem 13 zwycięstw i zaledwie 5 porażek. Jednak to nie koniec laurów zebranych przez zespół. Zawodnicy Team Vitality otrzymali nagrodę najbardziej wartościowych graczy w piątym i szóstym tygodniu. Ponadto górny i wspierający zostali wyróżnieni w zestawieniu najbardziej profesjonalnych graczy. Powyższe osiągnięcia najlepiej oddaje współczynnik ZZA członków Team Vitality – wszyscy znaleźli się w pierwszej czwórce graczy w kategorii swojej własnej roli.</p>\n<p>Po tak udanych występach fani spodziewali się fantastycznego występu na wiosennych rozgrywkach barażowych EU LCS 2016. Jednak zespół Team Vitality poległ już w pierwszym spotkaniu, ulegając najstarszemu w lidze – Fnatic. Przegrana była o tyle bolesna, że pomimo wcześniejszych wysiłków organizacja znalazła się na piątym miejscu ex aequo. W przerwie przed rozpoczęciem letniego splitu EU LCS 2016 zostały podjęte decyzje o zmianie składu drużyny. Biorąc przykład z innych organizacji, Team Vitality zdecydowała się na podpisanie kontraktu z dwoma zawodnikami wywodzącymi się z Korei Południowej. Jednak w odróżnieniu od wielu innych, potrafili się sprawnie komunikować w języku angielskim, więc od razu przeszli do treningów, aby w nadchodzącym splicie osiągnąć jeszcze lepszy wynik.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Menedżer drużyny: Michael \"Garki\" Bolze</p>","en_US":"<p>For Team Vitality, consistency will be the name of the game in 2017. The team finished with 9 match ties in the 2016 EU LCS Summer Split, the most in the league. That landed them in 7th place for the split, allowing them to avoid the Spring Promotion Tournament but leaving them out of the playoffs.</p>\n\n<p>With a new year upon them, Vitality has upgraded their bot lane. With Steeelback and Hachani lining up down south, and with a new league format that eliminates ties, Vitality is primed to pick up some more W’s this season.</p>\n<p>Head Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Team Manager: Michael \"Garki\" Bolze</p>\n","es_ES":"<p>Ni llegaron a tiempo a la cita del 5 de noviembre ni hacen uso de la letra V como llamada a la venganza, sino a la victoria, pero si algo comparte Team Vitality con la novela gráfica de de Alan Moore y David Lloyd es la intención de hacer saltar algo por los aires. En este caso, la LCS EU.</p>\n\n<p>La organización francesa, conocida sobre todo por sus escuadras de Call of Duty, ha aprovechado la inadaptación de Gambit Gaming con respecto al desarrollo de la industria de los deportes electrónicos para expandir sus horizontes mediante la adquisición de su plaza en la máxima competición continental.</p>\n\n<p>La falta de experiencia en la Grieta del Invocador no ha supuesto un problema para Team Vitality a la hora de confeccionar su alineación explosiva, que mezcla veteranía y potencial. El buen hacer de los galos en otras disciplinas se ha traducido en una gran reputación que, junto a una fuerte inversión deportiva, ha actuado como aval en el proceso de seducción de algunos de los mejores talentos de Europa con el objetivo de dinamitar la clasificación.</p>\n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Jefe de equipo: Michael \"Garki\" Bolze</p>","fr_FR":"<p>Vitality rejoint Splyce et G2 Esports dans le trio des nouvelles équipes participant aux LCS EU. Le cœur de la formation de Vitality semble être composé d'anciens talents d'H2K et de Gambit Gaming, avec notamment le top-laner Lucas « Cabochard » Simon-Meslet et le support Raymond « KaSing » Tsang. Vitality a également recueilli le coach de GMB, Kévin Ghanbarzadeh, dans l'espoir que son expérience aide à souder les membres de l'équipe. Si Vitality est nouvelle, ses joueurs ne le sont pas, eux, et ils savent exactement à quoi s'attendre durant le segment printanier des LCS EU 2016.</p> \n<p>Coach: Jakob \"YamatoCannon\" Mebdi</p>\n<p>Responsable d’équipe: Michael \"Garki\" Bolze</p>"},"foreignIds":{},"players":[84,190,205,328,384,1089,1704],"starters":[84,190,328,384,1089],"subs":[205,1704]}],"players":[{"id":84,"slug":"cabochard","name":"Cabochard","firstName":"Lucas ","lastName":"Simon-Meslet","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cabochard-iak53xzd.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T10:49:06.000Z","bios":{"en_US":"<p>Lucas “Cabochard” Simon-Meslet is looking to get back into form for 2017. After an impressive performance in the 2016 EU LCS Spring Split, Cabochard regressed last summer. He still put up some nice games on Irelia and Fiora, but like the rest of Vitality he failed to find consistency.</p>\n\n<p>Entering 2017 armed with a new botlane, Cabochard will aim to make an impact and return to his Spring Split self. Not usually one to perform as well on tanks, if Cabochard is allowed to focus on dealing damage, he should have no problem dispensing with his opponents in the top lane.</p>","de_DE":"<p>Lucas „Cabochard“ Simon-Meslet wird 2017 versuchen, seine alte Form wiederzufinden. Nach einer beeindruckenden Vorstellung im Frühjahrs-Split der EU LCS 2016 ging es für Cabochard im letzten Sommer bergab. Er lieferte zwar mit Irelia und Fiora ein paar ansprechende Leistungen ab, aber ihm fehlte wie dem Rest von Vitality die Beständigkeit. \n\n2017 beginnt mit einem neuen Duo auf der unteren Lane und Cabochard wird versuchen, wieder zu seiner Form aus dem Frühjahrs-Split 2016 zurückzufinden. Cabochard liefert mit Tanks zwar nicht die besten Leistungen ab, aber wenn er sich auf Schaden verursachende Champions konzentrieren kann, wird er mit seinen Gegner auf der oberen Lane Schlitten fahren.</p>","fr_FR":"<p>Durant l'intersaison 2015, Lucas « Cabochard » Simon-Meslet a rejoint Team Vitality, une nouvelle organisation qui a acquis la place de Gambit aux LCS. Lorsqu'il était chez Gambit, Cabochard préférait grandement les champions AP, tels que Kennen et Morgana. Il a également joué avec quelques champions tanky, mais il revenait souvent à ses incroyables Fizz et Ryze. Bien que les performances de Cabochard aient diminué quelque peu vers la fin de la saison et aux play-offs, son potentiel restait suffisant pour lui garantir une place chez VIT en 2016.</p>","es_ES":"<p>Si bien es cierto que Lucas ‘Cabochard’ Simon-Meslet es un jugador agresivo que disfruta bajo la luz de los focos que apuntan al principal artífice de la victoria, en realidad no hace honor a la terquedad que su apodo le presupone al ser capaz de anteponer los intereses del colectivo a los suyos.</p>\n\n<p>De hecho, uno de los desafíos que se ha autoimpuesto con tal de estar a la altura de las expectativas en torno a su potencial es demostrar su versatilidad en la calle superior. El francés pasó de competir ocasionalmente junto a leyendas de la talla de Danil ‘Diamondprox’ Reshetnikov a, en cuestión de meses, amasar una ingente cantidad de recursos para liderar a aquellos a los que otrora admiraba.</p>\n\n<p>El protagonismo de Cabochard en Gambit Gaming se saldó con un éxito moderado, aunque no impidió que el joven se quedara con una espinita clavada ante la oportunidad perdida de clasificarse para los Playoffs de verano tras la polémica sanción a Konstantinos ‘FORG1VEN’ Tzortziou. De nada le sirvieron al joven jugador los elogios que propios y extraños dedicaban a sus actuaciones con campeones como Morgana, Kennen o Hecarim. Cabochard apuntó alto, pero acabó luchando por la permanencia en la máxima competición europea.</p>\n\n<p>Una vez conocido el éxito gracias a la conquista de la novena edición de la Intel Extreme Masters Colonia, Cabochard se ha unido a Team Vitality con el objetivo de hacer desaparecer de su paladar el agridulce sabor que le dejó creer que podría haber incluso participado en el Campeonato Mundial 2015 de contar con el tirador griego para reencontrarse con la miel de la victoria.</p>","pl_PL":"<p>18-letni, francuski top-laner swoją profesjonalną karierę rozpoczynał stosunkowo niedawno, bo w sierpniu 2013 roku. Początkowo występował w mniej znanych formacjach takich jak COREPLAY, GSI Gaming czy Heavy Botlane. Z tą ostatnią drużyną z całkiem niezłej strony zaprezentował się jednak w kwalifikacjach EU Challenger Series, odpadając dopiero w ostatnim meczu przeciwko faworytom zmagań. Co ciekawe, w GSI Gaming oraz HB Cabochard grał razem ze swoim bratem, Ugo „Istarim” Simon-Mesletem.</p>\n<p>\nPierwszym ważnym momentem w karierze francuskiego gracz był występ w piątym tygodniu letniego splitu EU LCS 2014, kiedy to Cabochard zastąpił mającego problemy z wizą Evgeny’ego \"Dariena\" Mazaeva. Cabochard zaprezentował się z niezłej strony i z pewnością miało to wpływ na to, że w miesiąc później otrzymał ofertę od pragnącego powrócić do elitarnych rozgrywek Ninjas in Pyjamas, na którego czele stał były mid-laner Gambitu Alexey „Alex Ich” Ichetovkin. Aspiracje te pozostały niespełnione, ale talent Francuza po raz kolejny dostrzegł Gambit, który tym razem szukał stałego zastępstwa dla Dariena. Był to drugi ważny moment w karierze francuskiego top-lanera. </p>\n<p>\nLucas do tego czasu był niezłym zawodnikiem, ale nie wyróżniał się zanadto nawet na tle rywali z Challenger Series. Tymczasem kiedy zaczął występować w EU LCS zrobił ogromny postęp i zaskoczył wszystkich, szybko stając się jednym z najlepszych graczy górnej alei na Starym Kontynencie. Co prawda Gambit spisywał się poniżej oczekiwań, ale jedyną osobą, do której kibice nie mogli mieć najmniejszych zastrzeżeń był właśnie Cabochard, który prezentował równą, wysoką formę przez cały 2015 rok. </p>\n<p>\nW tym czasie Francuz dał się poznać jako niesamowicie utalentowany mechanicznie zawodnik o bardzo szerokim champion poolu i jednocześnie gracz, który nie boi się niestandardowych rozwiązań. To właśnie on był pionierem, jeśli chodzi o wykorzystanie Gankplanka na profesjonalnej scenie – można powiedzieć, że grał piratem zanim jeszcze to było modne, bowiem wybierał tą postać jeszcze przed zmianami, które dotknęły bohatera.</p>\n<p>\nW letnim splicie EU LCS 2015 Cabochard najczęściej grał Hecarimem (4 razy) i Fizzem (trzykrotnie). Francuz był w tej edycji rozgrywek drugim najczęściej zabijającym top-lanerem i najlepiej farmiącym graczej górnej alei. W większości statystyk znajdował się na podium na swojej pozycji. Interesujący, choć nie do końca chwalebny, jest fakt, że zabierał też najwięcej złota drużynowego wśród zawodników górnej linii. Zdawałoby się to potwierdzać mentalność Cabocharda, który zawsze dąży do tego, by mieć duży wpływ na poczynania zespołu. Z tego powodu często prosi swoich dżunglerów o ganki, na co narzekali niektórzy jego byli koledzy z drużyny jak na przykład Tri Tin „K0u” Lam, z który Cabochard występował w barwach NiP. </p>\n<p>\nCo ciekawe, nick francuskiego top-lanera po francusku znaczy „uparty”, a motywacją do przyjęcia takiego właśnie pseudonimu dostarczyła zawodnikowi piosenka Cabochards autorstwa 25G i Setha Gueko.</p>"},"foreignIds":{"drupalId":"1489","TRLH3":"200000119","TRLH4":"200000222"},"socialNetworks":{"twitch":"www.twitch.tv/cabochardlol","facebook":"www.facebook.com/CabochardLol/","twitter":"https://twitter.com/CabochardLoL"},"champions":[],"liveGameTeam":165},{"id":190,"slug":"vander","name":"Vander","firstName":"Oskar","lastName":"Bogdan","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vander-edwzo382.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T10:57:12.000Z","bios":{"en_US":"<p>Oskar \"Vander\" Bogdan is one of the most veteran supports in the EU LCS. With a career that goes back to 2012, Vander has the experience any team would value in a support. After spending a split in the Challenger Series, he's making his return to the EU LCS as part of Team Vitality. He'll want to prove he's anything but past his prime as he leads Vitality in the 2017 EU LCS Summer Split.</p>","de_DE":"<p>Trotz seiner jungen 21 Jahre spielt Oskar „VandeR“ Bogdan seit 2011 kompetitiv League of Legends, also praktisch schon fast seit es das Spiel überhaupt gab. Erstes großes Aufsehen erregte er jedoch erst Ende 2013 mit der polnischen Mannschaft, bekannt als Kiedyś Miałem Team, kurz: KMT. Schon damals war sein heutiger Teamkamerad Marcin „Jankos“ Jankowski an seiner Seite und zusammen schafften sie es mit ihrer Mannschaft bis in die letzte Runde des Qualifikationsturniers für die EU LCS Spring 2014. Die fünf Polen spielten mit einem ruhigen Stil das Spiel und überzeugten vor allem in ihrer Zusammenarbeit und Synergie während Teamkämpfen. KMT schafften einen Davidsieg gegen Ninjas in Pyjamas und vollendeten ihre Reise in die EU LCS mit einem überzeugenden 3-0-Triumph.</p>\n\n<p>In zwei dieser drei Spiele, führte VandeR seine Künste auf Thresh vor, der Champion mit dem er sich bis heute einen Namen gemacht hat. Kurz darauf übernahm das allbekannte ROCCAT die Führung über das Supporttalent und seine Freunde. Ein großes Fragezeichen schwebte über dem Kopf des blonden Polens und nach der Begegnung gegen NIP wurden nicht allzu kleine Erwartungen gestellt. Tatsächlich bewies VandeR, dass es wirklich das Zeug zum LCS-Spieler hatte, als er in der vierten Woche der EU LCS Spring 2014 den wöchentlichen MVP-Titel gewann. Zudem bekamen seine Gegner einen weiteren Champion von ihm zu sehen, welcher ihnen zuvor noch nicht mit einer solchen Effektivität entgegengekommen ist: Morgana war der zweite Go-to-Pick VandeRs. </p>\n\n\n<p>Die Leistung in der ersten Saison wurde mit dem vierten Platz in der regulären Saison und dem dritten Platz in den Playoffs belohnt und ROCCAT hatte sich im europäischen oberen Mittelfeld eingelebt. </p>\n\n<p>Jedoch ging es seitdem bergab: ROCCAT schaffte es im darauffolgenden Sommer gerade so in die KO-Phase und schied letztendlich gegen den Turnierfinalisten Fnatic auszuscheiden. Ende 2014 wurde der schwach spielende  Paweł „Celaver“ Koprianiuk durch einen anderen Pawel ersetzt, nämlich Pawel “Woolite” Purski. Doch auch mit ihm gelang es VandeR im Frühling 2015 nicht die Top-Plätze der LCS zu erreichen, im Gegenteil: Er entging nur knapp der Relegation in die Challenger Series. Nach einer kurzen Pause drehte sein Mid-Laner Erlend “nukeduck” Holm auf und beschenkte dem nicht mehr ganz so polnischen Team Siege über Siege, bis sie es schließlich im Viertelfinale eine unerwartete Niederlage gegen Unicorns of Love erlitten. </p>\n\n<p>Ein letzter Pfad zur Weltmeisterschaft eröffnete sich durch das regionale Qualifikationsturnier, in welchem VandeR überragend spielte. Mit fünf verschiedenen Champions kämpfte er sich mit seinen Freunden bis in die zweite Runde des Turniers und ein fünftes Spiel gegen den Turniersieger Origen vor. Zwar verloren sie die Begegnung, doch es war ein klares Statement. 2016 könnte wieder ein Jahr sein, in dem VandeR zu VandeRLife mutiert und VandeRnoob hinter sich lässt.</p>\n\n<p>„Es gibt keinen offensiven oder defensiven Spielstil. Es gibt nur den richtigen“ – das ist sein Motto.</p>\n\n","pl_PL":"<p>Polski wspierający przeszedł długą drogę zanim udało mu się dostać do EU LCS I zostać jednym z najlepszych supportów na kontynencie. </p>\n\n<p>Początek jego kariery miał miejsce jeszcze w 2011 roku, w barwach organizacji Delta eSports, ale na dobre wszystko zaczęło się w rok później. Pomiędzy sierpniem 2012 roku a kwietniem 2013 Vander występował kolejno w polskim zespole EloHell, ale także w międzynarodowych formacjach, takich jak The Mighty Midgets, mousesports, Millenium czy Eternity Gaming. W międzyczasie wystartował też w kwalifikacjach do pierwszego splitu EU LCS w historii, ale jego zespół, Trudniej Już Nie Będzie, pożegnał się z rywalizacją już w fazie grupowej, po dwóch przegranych spotkaniach. Co ciekawe, aż do przygody z Eternity Gaming polski gracz pełnił rolę… strzelca i dopiero zmiany we wspomnianym zespole sprawiły, że zmienił pozycję i został wspierającym.</p>\n\n<p>Przełomowe dla Vandera było dołączenie do polskiego zespołu Kiedyś Miałem Team, choć drużynie nie od razu udało się zbudować stały skład. KMT istniało od września 2012 roku i przez formację przewinęło się wielu znanych na polskiej scenie zawodników. Vander dołączył do formacji już w okresie, kiedy zmian nie było tak wiele, choć nadal się zdarzały. Ostatecznie zespół znalazł sobie organizację, którą było… H2k. Początkowo dla Vandera nie było miejsca w nowej drużynie, ale po zaledwie pięciu dniach zastąpił w składzie drużyny Piotra „SuperAZE’a” Prokopa. Później zespół przeniósł się do GF Gaming, a w międzyczasie doszło jeszcze do kilku niewielkich rotacji. Ostatecznie pod szyldem Kiedyś Miałem Team ekipa spróbowała swoich sił w kwalifikacjach do EU LCS. Drużyna w składzie Xaxus-Jankos-Overpow-Celaver-Vander dostała się do baraży, w których zwyciężyła z faworyzowanym Ninjas in Pyjamas. Nowy zespół, występujący już pod banderą Teamu ROCCAT, zaskakująco dobrze radził sobie w swoich pierwszych splitach w stawce , notując trzecie i czwarte miejsce w play-offach w 2014 roku i niemalże uzyskując bilety na Mistrzostwa Świata. Jednocześnie Vander szybko wyrósł na jedną z gwiazd zespołu, zachwycając głównie niesamowitymi umiejętnościami mechanicznymi. Szczególnie było to widoczne, gdy dostawał w swoje ręce Thresha, który do dziś jest jego najbardziej znaną postacią. To on był też jednym z pierwszych graczy EU LCS, który dostrzegł potencjał Morgany w roli wspierającej. W 2015 roku przyszedł czas na zmiany w składzie zespołu i rozczarowujące występy, choć znów do wyjazdu na MŚ nie było daleko… Polski support był w tym czasie, obok Jankosa, najsilniejszym punktem zespołu. Powiększył też znacznie swój champion pool, który zaczął wykraczać poza dwie wspomniane wcześniej postaci: w letnim splicie 2015 Vander najczęściej decydował się na wybór Alistara (8 gier), Nautilusa (4 gry) i oczywiście Thresha (4 gry).</p>\n\n<p>Przed wiosennym splitem 2016, wspierający przeniósł się wraz z dżunglerem Marcinem „Jankosem” Jankowskim z Teamu ROCCAT do H2k-Gaming.</p>\n\n<p>Co ciekawe, polski zawodnik na początku swojej kariery posługiwał się pseudonimem Van Der Fckk, który później ewoluował w VandeRnoob, a następnie pozostał po prostu VandeR. Dodatkowo warto zauważyć, że wspierający był w letnim splicie 2015 najczęściej wardującym graczem w stawce, a także prawie najczęściej zabijającym supportem. Legitymował się również trzecim najwyższym KDA na swojej pozycji.</p>\n","fr_FR":"<p>Oskar « Vander » Bogdan a commencé la compétition dès la première saison, mais c’est en 2013 qu’il rencontre ses premiers succès, quand il réussit à se qualifier aux League of Legends Championship Series avec l’équipe polonaise Kiedyś Miałem Team après avoir tenu en échec les Ninjas in Pyjamas de Erlend « Nukeduck » Våtevik. Aussitôt, l’équipe signe avec ROCCAT et fait un départ en trombe aux LCS. Vander obtient le titre de meilleur joueur de la semaine 4 après avoir livré deux parties grandioses avec Thresh, son champion signature, et obtenu 22 de KDA. Son expérience et sa vision de jeu permettent au Polonais de prendre des décisions avisées et de guider ses coéquipiers vers la victoire.</p>\n\n<p>Alors à peine arrivé en LCS, le support permet à son équipe de truster la première place du classement provisoire de la saison printanière 2014 pendant trois semaines avant que cette dernière ne subisse une baisse de régime tandis que ses adversaires s’adaptent de mieux en mieux. Tout de même qualifiés aux play-offs, Vander et ses compatriotes obtiennent la 3e place après avoir tenu en échec l’équipe Alliance de Henrik « Froggen » Hansen.</p>\n\n<p>Après des résultats bien moins convaincants en saison estivale, l’équipe polonaise ne parvient qu’à obtenir la 6e place sur 8 pendant la saison régulière avant d’échouer au pied du podium des play-offs et se voit contrainte de jouer les matchs de relégation pour conserver sa place en LCS.</p>\n\n<p>Début 2015, Vander voit arriver un nouveau partenaire en voie du bas, Paweł « Woolite » Pruski, venu pour remplacer un Paweł « Celaver » Koprianiuk qui connaissait des difficultés contre les meilleurs carrys AD européens. Malheureusement, le résultat n’est pas celui escompté et ROCCAT peine toujours autant. C’est à la 4e semaine de la saison d’été et l’arrivée de Rasmus « MrRalleZ » Skinneholm, un carry AD plus autonome, que Vander peut enfin quitter sa voie afin d’accompagner son jungler Marcin « Jankos » Jankowski dans ses initiatives pour produire un jeu de meilleure qualité.</p>\n\n<p>L’équipe réussit à remonter à la 5e place du segment mais échoue dès le premier tour des play-offs face à Unicorns of Love. Dans la course à la qualification pour le mondial 2015, Vander et son équipe chutent de peu face à Origen. Il quitte ROCCAT en décembre et rejoint les rangs de H2K pour la saison 2016 en compagnie de son compatriote Jankos et a cette fois-ci à ses côtés un carry AD de première classe, Konstantinos « FORG1VEN » Tzortziou-Napoleon. Pendant la saison régulière, Vander excelle. Libéré par l’espace que lui procure un très bon partenaire de voie, il s’épanoui et devient une pièce maîtresse de son équipe avec laquelle il se hisse à la 2e place du classement à l’aube des play-offs avec le 2e meilleur KDA de tous les supports de sa ligue (7,11). Directement qualifié en demi-finale des play-offs, Vander perd ses espoirs de finale après la défaite 2 à 3 contre Origen. Cet été, en compagnie de la même équipe mais cette fois aux cotés de Aleš « Freeze » Kněžínek en carry AD, le Polonais aura à cœur de passer à l’étape supérieure pour enfin s’imposer en Europe, avec comme objectif le Mondial 2016 !</p>","es_ES":"<p>Como uno de los líderes de su anterior equipo, ROCCAT, Oskar ''Vander'' Bogdan evalúa constantemente el estado del juego y los movimientos de sus enemigos en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC, y en su primer split con H2K en 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó los problemas de ROCCAT atrás cuando se pasó a una calle inferior con uno de los AD carries más exigentes del juego, FORG1VEN. Comenzó a acumular víctimas enseguida con su nuevo compañero de calle, valiéndose de apoyos pesados de iniciación que le permitían facilitar asesinatos y aturdir a los enemigos para controlar los combates de equipo. Poco después, tuvo que compartir calle con Freeze, pero el nuevo AD carry quedó en el banquillo por una lesión y Vander volvió a reunirse con FORG1VEN. Aunque H2K no logró superar los playoffs para llegar a la final de verano, el liderazgo de</p> <p>Vander ha vuelto a su forma tajante habitual. Dirigirá un equipo de perdedores este año, pero con su experiencia internacional, Vander puede ayudar a que H2K sorprenda al mundo y recupere el trofeo para Europa.</p>","es_AR":"<p>Como uno de los líderes de su antiguo equipo ROCCAT, Oskar \"Vander\" Bogdan evalúa constantemente el estado del juego y los movimientos del enemigo en la Grieta. El conocimiento del juego de Vander fue fundamental para el éxito de ROC y, en su primer torneo con H2K en el 2016, se convirtió en un miembro clave del equipo.</p>\n\n<p>Vander dejó las peleas del equipo ROCCAT atrás para pasar directamente al carril inferior junto a uno de los ADC más demandantes del juego, FORG1VEN. Rápidamente empezó a cosechar víctimas con su nuevo compañero de carril, lo que favoreció a los soportes fuertes de iniciación, que le permitieron lograr asesinatos y tener el control del combate en equipo. Pronto tuvo a un nuevo compañero de carril en Freeze, pero, luego de que una lesión dejara fuera a su nuevo tirador, no pasó mucho para que volviera a unirse a FORG1VEN. Aunque H2K cayó en las eliminatorias antes de llegar a la final de verano, Vander volvió a liderar de forma clara y medida, tal como siempre lo ha hecho. Este año dirigirá a un equipo de jugadores de bajo nivel, pero, con su experiencia internacional, Vander puede ayudar a H2K a hacer vibrar el mundo e intentar llevarse un trofeo a Europa.</p>","pt_BR":"<p>Como coordenador das tomadas de decisão em sua antiga equipe, ROCCAT, Oskar “Vander” Bogdan está constantemente avaliando o estado do jogo e os movimentos do inimigo no Rift. O conhecimento de jogo de Vander foi primordial para o sucesso da ROC e, em sua primeira Etapa com a H2K em 2016, ele se tornou um membro essencial para a equipe.</p>\n\n<p>Vander deixou suas dificuldades com a ROCCAT para trás e fez sua transição impecável para a rota inferior junto com um dos atiradores mais exigentes do jogo, FORG1VEN.  Ele rapidamente esmagou suas vítimas com seu novo parceiro de rota, favorecendo suportes com iniciação pesada que permitiam que ele organizasse momentos de abate e atordoasse tudo em seu caminho no controle de confrontos de equipe. O suporte logo se encontrou com um novo parceiro de rota em Freeze, mas depois que uma lesão deixou seu novo atirador no banco, ele logo se reuniu com FORG1VEN. Apesar da H2K ter sido nocauteada nas eliminatórias antes de chegar na Final de Verão, as tomadas de decisão de Vander voltaram à sua antiga forma firme. Ele irá comandar uma equipe de azarões este ano, mas com sua experiência internacional, Vander pode fazer com que a H2K surpreenda o mundo enquanto tentam trazer o troféu para a Europa.</p>"},"foreignIds":{"drupalId":"1117","TRLH3":"200000234","TRLH4":"200000086","TRLH2":"1001280061","FRA1TMNT2":"25440","TRLH1":"1001380091","ESPORTSTMNT02":"200001008"},"socialNetworks":{"twitch":"http://www.twitch.tv/lolvander","facebook":"https://www.facebook.com/Vander.lol","twitter":"https://twitter.com/VanderLCS"},"champions":[],"liveGameTeam":165},{"id":205,"slug":"shlaya","name":"Shlaya","firstName":"Tony","lastName":"Carmona","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/shlaya-1gibq14m.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2016-01-28T22:37:16.000Z","bios":{"en_US":"<p>Tony “Shlaya” Carmona is substitute mid laner for Team Vitality.\n</p>","de_DE":"<p>\nTony „Shlaya“ Carmona spielt schon seit der ersten Stunde League of Legends, an Wettbewerben nimmt er bereits seit 2011 teil. Er verbrachte mehrere Jahre in der EU LCS, sowohl als Starter, als auch als Ersatzspieler, und er hat als AD-Carry, Mid-Laner und Top-Laner an Wettbewerben teilgenommen. 2015 kam Shlaya als Ersatzspieler zu Team Vitality.\n</p>","fr_FR":"<p>\nTony « Shlaya » Carmona est un joueur de League of Legends de longue date, sa participation à la compétition remontant à 2011. Au sein des LCS EU, il a joué pendant des années comme titulaire et remplaçant, évoluant en compétition comme carry AD, sur la voie du haut et sur la voie du milieu. Shlaya a rejoint les rangs de Fnatic comme remplaçant en 2015.\n</p>","es_ES":"<p>\nTony ''Shlaya'' Carmona es un auténtico veterano de League of Legends, con un historial competitivo que se remonta a 2011. Pasó varios años en la LCS de EU como titular y como suplente y ha jugado en el circuito profesional como AD carry, calle central y calle superior. En 2015 se incorporó a Fnatic como suplente.\n</p>","pl_PL":"<p>\nTony „Shlaya” Carmona jest długoletnim graczem w League of Legends. Swoją przygodę z grą rozpoczął jeszcze w 2011 r. Przez wiele lat uczestniczył w rozgrywkach EU LCS, zarówno jako zawodnik początkowego składu, jak i rezerwowy. Pełnił funkcję prowadzącego, gracza w środkowej alei, a także w górnej.  Shlaya dołączył do Fnatic jako rezerwowy w 2015 r.\n</p>","pt_BR":"<p>\nO histórico de Shlaya vem desde 2011. Ele passou vários anos na LCS EU, tanto como titular quanto reserva, e jogou competitivamente nas rotas do meio, do topo, e como atirador. Ele entrou na Fnatic como reserva em 2015.</p>"},"foreignIds":{"drupalId":"1123","TRLH3":"1001220080","TRLH4":"1001190130"},"socialNetworks":{"facebook":"https://www.facebook.com/ShLaYa.Tony","twitter":"http://twitter.com/ShLaYa","twitch":"http://www.twitch.tv/shlaya"},"champions":[],"liveGameTeam":165},{"id":233,"slug":"smittyj","name":"Smittyj","firstName":"Lennart ","lastName":"Warkus","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smittyj-8owo56ml.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2017-03-28T15:13:21.000Z","bios":{"en_US":"<p>\nLennart \"SmittyJ\" Warkus isn't afraid to hop, jump, dive, or charge his way into the enemy team. SmittyJ's aggression often has a purpose though -- if he causes enough chaos in the enemy ranks, his teammates can cut through them like a knife through warm butter.\nUnfortunately for SmittyJ, his dives often leave him up the proverbial creek without a paddle. Or, maybe more accurately, stranded in the Baron pit without a dash to escape over the wall. \n</p>\n<p>\nAfter a short stint in North America with Team Dignitas, Smittyj headed home to Europe to compete with Giants Gaming. They hope to turn his aggression into something special, but his aggression may be punished heading into his first full EU LCS Split.\n</p>","fr_FR":"<p>Lennart « Smittyj » Warkus est le nouveau top laner de Dignitas, tout droit débarqué des Challenger series... européennes ! Comme de nombreux joueurs professionnels et semi-professionnels ces dernières années, Smittyj a traversé l'Atlantique pour rejoindre une équipe nord-américaine.</p>\n\n<p>Auparavant, ce joueur allemand de 19 ans a passé pas loin de deux ans à arpenter la deuxième division professionnelle dans l'espoir de percer au plus haut niveau. En saison 4, avec SK Prime, le jeune joueur est parvenu à se qualifier en deuxième position pour le tournoi de promotion/relégation, mais a dû s'avouer vaincu face à des Gambit Gaming largement supérieurs. Même scénario lors du segment de printemps de la saison 5, cette fois en tant que top laner de Gamers 2. Pire, lors de cette saison des Challenger series, Smittyj et ses camarades n'ont même pas réussi à se qualifier pour le tournoi de promotion/relégation, ratant la 3e place qualificative de peu, lors d'une défaite 2 victoires à 1 face à Reason Gaming.</p>\n\n<p>Qu'à cela ne tienne, l'Allemand ne s'est pas découragé et a eu de nouveau l'occasion de toucher le graal à l'issue de la saison estivale des Challenger series de la saison 5. Une fois de plus, son équipe et lui ont perdu en demi-finale des play-offs face à Dignitas, par la suite qualifiée aux LCS EU, mais ils ont cette fois su se reprendre à temps pour arracher la troisième place qualificative des mains de Denial Esports. Au niveau individuel, Smittyj en a profité pour remporter sa voie par deux fois face à Mike « Wickd » Petersen, ancienne gloire de League of Legends. Tout un symbole.\nAutre symbole, la victoire de Gamers 2 et SmittyJ en tournoi de relégation face à l'une des plus anciennes organisations européennes du jeu, SK Gaming, vaincus 3-2 et boutés hors des LCS par le jeune top laner et ses coéquipiers.</p>\n\n<p>Sa qualification au plus haut niveau enfin en poche, Smittyj aurait pu tranquillement se préparer à découvrir les LCS EU, mais il a préféré repartir à nouveau à l'aventure, cette fois sur le serveur nord-américain au sein de l'équipe Dignitas, ce qui implique forcément beaucoup plus de pression de la part des fans et du grand public. Changement de rythme assez brutal pour le joueur qui, avec son manque d'expérience en LCS, peine à obtenir des résultats suffisants dans l'écurie Dignitas. Peu à peu, son style de jeu se confirme et bientôt, SmittyJ devient un joueur agressif, n'ayant pas peur de s'engouffrer dans des situations hasardeuses sur la voie du haut.</p>\n\n<p>Après une année en dents de scie en Amérique, le joueur revient en Europe en tant que toplaner titulaire pour les Giants Gaming. SmittyJ est prêt à relever le défi une nouvelle fois, avec une place en LCS Europe qu'il a longuement attendu.</p>\n","pl_PL":"<p>Lennart \"Smittyj\" Warkus  jest członkiem profesjonalnych drużyn League of Legends od początku czwartego sezonu. Zaczynał w lutym 2014 roku, w mało znanej drużynie COREPLAY, lecz już po miesiącu trafił do SK Gaming Prime. Pod skrzydłami tej organizacji nabrał doświadczenia na esportowej scenie. Jednak po połowie roku stwierdził, że tam nie odniesie sukcesu, więc opuścił tą drużynę i szukał szczęścia gdzie indziej. Ostatecznie, w lutym 2015 roku, dołączył do Gamers2, później przemianowanych na G2 Esports. Dopiero w tym zespole \"Smittyj\" miał okazję się zrealizować, biorąc udział w Challenger Series. W tych rozgrywkach pokazał jak umiejętnym jest zawodnikiem, kończąc na szczycie tabeli z wynikiem 8:2. Równie dobrze poszło mu w meczach barażowych, aż w końcu stanął przeciwko weteranom EU LCS – SK Gaming.</p>\n<p>\nPrzed grą z SK Gaming o wejście do EU LCS \"Smittyj\" był bardzo pewny siebie i swoich umiejętności. W nagraniu internetowym G2 Esports „Road to LCS” oświadczył, że pokona junglera przeciwników z łatwością. Co prawda nie była to dziecinna igraszka, jak zapowiadał, ale i tak bardzo doświadczony \"fredy122\" został przez niego znokautowany. Dzięki wygranej 3:2 z SK Gaming zakwalifikował się wraz z drużyną do wiosennego sezonu 2016 EU LCS, co było jego największym osiągnięciem w karierze gracza.</p>\n<p>\nNie dane mu jednak było wystąpić w Europie, gdyż jego umiejętności zaimponowały również analitykom zza oceanu. \"Smittyj\" został przez nich nazwany „niedocenianym, młodym talentem, który może wkrótce rozkwitnąć”. W listopadzie 2015 roku dołączył do Team Dignitas, jednej z najstarszych i niezatapialnych drużyn w League of Legends. Wiązało się to oczywiście z przeprowadzką młodego Niemca do Stanów Zjednoczonych, co przyjął zaskakująco dobrze. Jego debiut w ich szeregach miał miejsce na top-lanie w wiosennym sezonie 2016 NA LCS. </p>\n<p>\nZ wszystkich bohaterów najbardziej przepada za Riven, aczkolwiek równie dobrze gra innym postaciami na top-lanie. Wszechstronność jest zaletą Lennarta - świetnie sobie radzi zarówno asasynami jak i obrońcami, bądź molochami. Opierając się na swoich umiejętnościach udało mu się dostać do Kręgu Pretendenta w Europie. Oprócz uniwersalności w League of Legends wyróżnia go wrażliwość na ludzką krzywdę. Aktywnie bierze udział w streamowaniu na rzecz dzieci współpracując z organizacjami charytatywnymi. </p>\n","de_DE":"<p>Der Deutsche Lennart \"SmittyJ\" Warkus startete ursprünglich mit G2 im Jahr 2015 durch, spielte im letzten Split für Team Dignitas und ist nun Top-Laner für Giants! Gaming. Er konnte viel Erfahrung in den letzten Monaten sammeln und ist kein Neuling mehr in der Szene. SmittyJ ist bekannt für sein Selbstvertrauen, denn laut ihm ist er der beste Top-Laner den es gibt. Im ist keine Herausforderung zu groß, und die nächste Aufgabe ist es, die Giants wieder ins Spiel zu bringen. Mit seinen Lieblingschampions Maokai und Fiora hat SmittyJ eine Killbeteiligung von über 75% und ist oftmals die tragende Kraft in den Teamkämpfen. Er bezeichnet sich selber als guten Shotcaller und erweitert stets seine Auswahl an Champions – ihm sind keine Grenzen gesetzt. </p>\n\n<p>“Was ich für das Team mitbringe? Ich kann ziemlich gut shotcallen, außerdem bin ich einfach gut, also..das bringe ich mit.” - Lennart \"SmittyJ\" Warkus</p>\n"},"foreignIds":{"drupalId":"2902","TRLH1":"1001220074","TRLH2":"1001160124","TRLH3":"200000230","TRLH4":"200000082","FRA1TMNT2":"25044","ESPORTSTMNT02":"200001004"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":328,"slug":"steeelback","name":"Steeelback","firstName":"Pierre","lastName":"Medjaldi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/steeelback-6w0pq1lj.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-18T22:51:12.000Z","bios":{"en_US":"<p>Pierre \"Steeelback Medjaldi is still looking for a team he can call home. He rose to prominence with Fnatic in 2015 but was replaced by a returning Rekkles. He joined Gambit Gaming for a split. Then he migrated to the Unicorns of Love but departed after a playoff defeat. He spent the 2016 EU LCS Summer Split with ROCCAT before deciding to move on once again.</p>\n\n<p>Steeelback and Team Vitality both hope to have found the perfect match. Steeelback's talent has never been in question; he put up impressive numbers in the Summer Split despite ROCCAT nearly getting relegated. Alongside ex-KT Rolster support Hachani, Steeelback has the potential to rival the best bot lanes in the EU LCS -- if he's willing to stick around.</p>","de_DE":"<p>Pierre „Steeelback“ Medjaldi sucht immer noch nach einem Team, in dem er sich zu Hause fühlt. Er wurde 2015 mit Fnatic bekannt, wurde später allerdings durch Rekkles ersetzt. Daraufhin spielte er einen Split bei Gambit Gaming. Danach zog es ihn zu den Unicorns of Love, die er nach einer Niederlage in den Entscheidungsspielen jedoch wieder verließ. Während des Sommer-Splits der EU LCS 2016 spielte er dann bei ROCCAT, bevor er wieder weiterzog.\n\nJetzt hoffen sowohl Steeelback als auch Team Vitality, dass sie perfekt zusammenpassen. Steeelbacks Talent steht außer Frage. Er lieferte im Sommer-Split eine beeindruckende Leistung ab, obwohl ROCCAT beinahe absteigen musste. Neben dem ehemaligen Supporter von KT Rolster, Hachani, hat Steeelback das Potenzial, die besten Duos auf der unteren Lane herauszufordern – wenn er nicht wieder die Mannschaft wechselt.</p>","fr_FR":"<p>Pierre « Steeelback » Medjaldi a rejoint les rangs de SK Gaming Prime à la fin de l’année 2014, sans trouver le succès car éliminé prématurément du tournoi d'expansion qui permettait l’accès aux League of Legends Championship Series. </p>\n\n<p>Mais le Français accède tout de même aux LCS. Steeelback est en effet repéré par son compatriote Bora « YellOwStaR » Kim par pur hasard alors que ce dernier écumait les parties classées. Le vétéran de Fnatic qui cherchait un dernier joueur pour son équipe est agréablement surpris par le niveau de jeu du carry AD. Il décèle chez lui une soif d’apprendre très développée et décide de l’inviter à le rejoindre dans sa nouvelle aventure.</p>\n\n<p>En très peu de temps, le duo français et ses trois coéquipiers réussissent à créer un jeu qu’ils exposent aux yeux d’un public européen positivement surpris. Dès la première semaine, Steeelback et ses coéquipiers montrent une cohésion impressionnante et remportent leurs deux parties. Galvanisé et guidé par un des meilleurs support au monde, le jeune joueur tient la dragée haute à certains des meilleurs carrys AD d’Europe. S’il n’est que la 3e source de dégâts d’une équipe très centrée sur son toplaner Seung-hoon « Huni » Heo, Steeelback est régulier et sait être la tornade qui vient balayer les combats d’équipe avec Corki ou Graves, ne laissant aucune chance de fuite à ses adversaire. Il signe un très bon ratio KDA de 8,9.</p>\n\n<p>Steeelback et Fnatic sont sacrés champions d’Europe après avoir remporté les play-offs et sont conviés au tournoi sur invitation de mi-saison. Le carry AD montre ses limites face à certains des meilleurs joueurs du monde et est remercié par la suite. Le management de Fnatic a indiqué être conscient du potentiel du Français mais ne pas avoir le temps d’attendre que le joueur soit formé, les ambitions du club ayant fortement augmenté.</p>\n\n<p>À la recherche d’un nouveau toit, Steeelback se tourne vers l’Amérique du Nord et rejoint Odyssey Gaming. Malheureusement, l’équipe ne parvient pas à se qualifier aux Challenger series NA. Il rejoint par la suite une équipe qui, elle, est parvenue à accéder à la compétition : Team Imagine. Après des résultats mitigés, il parvient tout de même à accéder au tournoi de promotion, mais son équipe se fait éliminer par Team 8, l’escouade sortante des LCS.</p>\n\n<p>En 2016, Steeelback revient en Europe et compte bien réitérer une bonne performance en LCS, cette fois-ci avec Unicorns of Love. Au début du segment de printemps, il s’illustre notamment avec sa Kalista, terminant le segment avec un KDA de 33 sur ce personnage et un KDA général de 6.81. Malgré de bonnes statistiques personnelles, l’équipe ne suit pas et termine à la 5ème place de la saison régulière. Une performance décevante pour Steeelback qui décide de partir pour Roccat au début du segment d’été.</p>\n","pl_PL":"<p>Pierwszą próbę zaistnienia w League of Legends Pierre podjął w drużynie GSI Gaming w sierpniu 2014 roku. Skończyło się tylko na podejściu, gdyż w jego szeregach nie wystąpił na scenie esportowej. Udało mu się pokazać z kolejnym zespołem – SK Gaming Prime, do którego dołączył w listopadzie tego samego roku. Z tą organizacją miał okazję nabrać doświadczenia i wziąć udział w Challenger Series. Jednak nie odniósł tam sukcesów, na których mu zależało.</p>\n<p>\nPrzełomem w karierze francuza było dostanie się, w styczniu 2015 roku, do sztandarowego zespołu Europy - Fnatic. Poprzedni AD Carry, „Rekkles”, postawił mu poprzeczkę bardzo wysoko. Wielu fanów było bardzo zawiedzionych wyborem Pierra Medjaldi na tą pozycję. On sam skomentował to krótko: „Chciałbym się sprawdzić w rozgrywkach EU LCS i zasłużyć na miejsce pomiędzy najlepszymi graczami AD Carry w Europie.” Miał taką okazję w wiosennym sezonie 2015 i udowodnił, że nie był złym wyborem. Fnatic po tym okresie uplasowało się na 2gim miejscu, co w dużej mierze było jego zasługą. Później poprawił ten wynik wraz z drużyną w rozgrywkach barażowych. Czołowa pozycja w Europie po pierwszym semestrze to jedno z największych dokonań Pierra. Drugie największe osiągnięcie to występ na 2015 Mid-Season Invitational. \"Steeelback\" zmierzył się na tym wydarzeniu z najlepszymi zawodnikami z całego świata i wypadł całkiem dobrze. Fnatic został zatrzymany dopiero przez SKT T1, przyszłych Mistrzów Świata, w zaciętej walce z wynikiem 2:3. Niestety wkrótce po turnieju, w maju 2015 roku, organizacja Fnatic zdecydowała się na ponowne przyjęcie Martina „Rekkles” Larssona, więc Pierre poszedł w odstawkę. </p>\n<p>\nPo tym wydarzeniu wypowiedział się, że chciałby móc się wykazać po MSI, ale taka szansa nie została mu dana. \"Steeelback\" wrócił do prób dostania się do EU Challenger Series wraz z drużyną Odyssey Gaming, lecz bez pomyślności. Następnie zasilił skład Team Imagine, które walczyło o kwalifikację do NA LCS. W rozgrywkach kwalifikacyjnych skończyli na trzeciej pozycji, przez co później musieli się zmierzyć z doświadczonym Team8. Niestety przeciwnicy okazali się mocniejsi, więc nowa drużyna Pierra pozostała w NA Challenger Series. 2 miesiące później zrezygnował dalszej walki o wejście wyżej, na rzecz propozycji zespołu, który już znajdował się w wiosennym sezonie EU LCS 2016. W listopadzie stał się członkiem Unicorns Of Love, gotowy do kolejnego podejścia w profesjonalnych rozgrywkach.</p>\n<p>\nWypowiedzi Pierra z wywiadów to nieliczne źródła, z których można się dowiedzieć czegoś o nim. To bardzo skryty gracz, z reguły rzadko udzielający się na portalach społecznościowych. Po jego wyborach w meczach można się łatwo domyślić, że najbardziej lubi grać Corkim, Lucianem i Sivir. Tymi bohaterami miał najlepsze wyniki i nim zawdzięcza wejście do Kręgu Pretendenta w Europie i Ameryce Północnej.\n</p>","es_ES":"<p>Aunque Pierre ‘Steeelback’ Medjaldi se hizo popular gracias a su fichaje por Fnatic en el Split de primavera de la LCS 2015, el jugador ya ha pasado hasta por siete equipos en menos de un año. Sin miedo a nuevos retos y aventuras, el joven francés todavía tiene una larga carrera por delante para demostrar que no sólo fue una apuesta arriesgada, sino también una garantía de futuro que explotará en Unicorns of Love.</p>\n\n<p>No es del todo cierto asegurar que Steeelback era un completo desconocido antes de fichar por Fnatic pero sí que es cierto que sus apariciones son con cuentagotas. En Agosto ficharía por GSI Gaming, equipo francés en el que también participaron Lucas ‘Cabochard’ Simon-Meslet y Aleksi ‘Hiiva’ Kaikkonen. Quizás por el contacto con el segundo pudo competir con SK Gaming Prime en el intento en Noviembre de entrar a la LCS por el torneo de promoción de primavera, aunque serían derrotados en la primera ronda por Reason Gaming.</p>\n\n<p>Aquí es cuando la vida del tirador cambia totalmente de rumbo debido al fichaje por Fnatic. Aunque el voto de confianza de Bora ‘YellOwStaR’ Kim le permitió entrar al equipo, la toma de contacto con Fnatic fue curiosamente por Fabian ‘Febiven’ Diepstraten que realizó la sugerencia para que probase por la escuadra inglesa. Durante primavera se mostró sólido pero no espectacular aunque no sería tarea fácil enfrentarse a los mejores del mundo en su posición en el Mid Season Invitational 2015. Su dominio de Sivir les otorgó una posibilidad táctica que le permitió cumplir su rol secundario.</p>\n\n<p>Pero con la llegada de Martin ‘Rekkles’ Larsson, el joven francés decidió tomar rumbo a las américas. La suerte no le acompañó ni en Odyssey Gaming al no poder clasificarse para la Challenger Series norteamericana ni en Imagine, puesto que ya en Challenger Series no fueron rival de Team8 para ascender a la League Championship Series. El jugador mostró una faceta más agresiva con campeones como Lucian o Corki que le permitieron aportar el desgaste necesario, pero todavía se mantuvo en una posición de retaguardia más pasiva.</p>\n\n<p>Con Zdravets ‘Hylissang’ Galabov la fase de líneas será un factor fundamental a la hora de decidir las partidas debido a la agresividad del búlgaro. El tirador tendrá que dar un paso adelante en su agresividad en una metajuego que a priori podría beneficiar a su Lucian, pero en el que la duda es la principal amenaza.</p>\n\n<p>Después de Fnatic y la Challenger Series norteamericana, esta supone la tercera aventura de Steeelback. El jugador ya ha afirmado su número de la suerte es el tres, de ahí las tres es en su nombre, y además también posee a tres campeones favoritos fuera de la propia posición de tirador, como son Zed, Lee Sin y Thresh. ¿Será la tercera la vencida?</p>"},"foreignIds":{"drupalId":"2903","TRLH3":"200000122","TRLH4":"200000225"},"socialNetworks":{"twitch":"http://www.twitch.tv/steeelback","facebook":"www.facebook.com/Steeelback","twitter":"http://twitter.com/Steeelb4ck"},"champions":[],"liveGameTeam":165},{"id":384,"slug":"nukeduck","name":"Nukeduck","firstName":"Erlend","lastName":"Holm","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nukeduck-9lfeix3.png","hometown":"Norway","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T10:41:18.000Z","bios":{"en_US":"<p>Erlend “Nukeduck” Holm enters 2017 with an eye on the new mid lane meta. The Norwegian mid laner burst onto the scene in 2013 as part of the impressive Lemondogs lineup. Since then, he’s played for Ninjas in Pyjamas and ROCCAT, and he spent all of 2016 with Team Vitality.</p>\n\n<p>Previously known for his play on assassins, Nukeduck will get the chance to shape his own meta in the 2017 Season. He’ll also need to learn to work with Vitality’s new junglers, Djoko and GBM. With the whole season in front of him, Nukeduck to forge a new identity for Vitality in 2017 and earn a spot in the playoffs.</p>","de_DE":"<p>2017 wird Erlend „Nukeduck“ Holm das Metaspiel auf der mittleren Lane genau im Auge behalten. Der norwegische Mid-Laner betrat die Szene 2013 als Teil der beeindruckenden Aufstellung der Lemondogs. Seitdem hat er für die Ninjas in Pyjamas und ROCCAT gespielt, bevor er 2016 zu Team Vitality wechselte.\n\nNukeduck, der früher für seinen Spielstil mit Assassinen bekannt war, bekommt in der Saison 2017 die Gelegenheit, sein eigenes Metaspiel zu schaffen. Außerdem wird er lernen müssen, mit Vitalitys neuen Junglern, Djoko und GBM, zusammenzuarbeiten. Doch noch liegt die gesamte Saison vor ihm und Nukeduck wird versuchen, Vitality 2017 eine neue Identität zu verleihen und mit der Mannschaft in die Entscheidungsspiele einzuziehen.</p>","fr_FR":"<p>Erlend « nukeduck » Holm est devenu célèbre avec la surprenante équipe Lemondogs en 2013. À l'époque, il était considéré à raison comme l'un des meilleurs jeunes mid-laners d'Europe. Après la dissolution de Lemondogs, nukeduck a rejoint les rangs des Ninjas in Pyjamas, puis ceux de ROCCAT avant de poser ses valises chez Team Vitality durant l'intersaison des LCS EU 2015. Même si nukeduck a dû lutter pour se faire une place dans les récentes metas des LCS EU, ses talents d'assassin devraient se combiner à merveille avec ceux de son nouveau jungler, Shook.</p>","pl_PL":"<p>Karierę Nukeducka można podzielić na cztery etapy.</p>\n<p>\nPierwszym z nich była walka o dołączenie do czołówki. Ten okres rozpoczął się dla norweskiego mid-lanera w grudniu 2011 roku od przygód z 3DMAX, Tt Dragons i H2k-Gaming. Zawodnik zaliczył też na przełomie 2012 i 2013 roku epizod w Teamie Solo Mebdi, który był jednym z faworytów kwalifikacji do pierwszego w historii splitu EU LCS. Ostatecznie zespół został zdyskwalifikowany, a Nukeduck przeniósł się do Sinners Never Sleep, które po udanych eliminacjach do letniej edycji europejskich rozgrywek w 2013 roku, zmieniło nazwę na Lemondogs. </p>\n<p>\nI tu zaczął się drugi etap – okres triumfów. Nukeduck był jedną z gwiazd tego zespołu, który okazał się fenomenem. Norweg dzielił i rządził na środkowej alei, a formacja zajęła ostatecznie drugie miejsce w letnim splicie EU LCS i pojechała na Mistrzostwa Świata. Tam nie poszło już tak dobrze i LD zakończyło rywalizację już na fazie grupowej. Wtedy też na Nukeducka spadła spora fala krytyki ze strony kolegów z drużyny, którym nie podobało się zadufanie w sobie norweskiego zawodnika. Problem polegał na tym, że mid-laner był tak pewny siebie, że nierzadko świadomie wybierał niekorzystne match-upy, by słabszą postacią ograć przeciwnika i udowodnić swoją wyższość. Nietrudno przewidzieć, że na MŚ poziom był zbyt wysoki, by ta sztuka mu się udawała. Po nieudanych MŚ zespół zmienił organizację na Ninjas in Pyjamas i, w wyniku sporego chaosu i przeoczeń, był zmuszony walczyć w barażach o utrzymanie w EU LCS. </p>\n<p>\nTutaj rozpoczął się kolejny okres w karierze Nukeducka – etap spektakularnych porażek. Dużą rolę ponownie odegrał w tej kwestii egoizm Norwega, który miał duży udział w niespodziewanej porażce w meczu barażowym przeciwko Kiedyś Miałem Team. NiP został zmuszony do rywalizacji w EU Challenger Series, a Nukeduck nieprędko wrócił do LCS. Wiosenny split EU CS był dla drużyny i samego Norwega nieudany, a niedługo później Erlend został wraz z kolegą z drużyny , Alfonso „Mithy’m” Aguirre Rodriguezem, wykluczony z gry na profesjonalnym poziomie za toksyczne zachowanie w kolejce solowej. To właśnie ten moment był punktem kulminacyjnym tego bardzo nieudanego okresu w karierze Norwega, który został zmuszony do zrobienia sobie półrocznej przerwy w karierze.</p>\n<p>\nNukeduck został odbanowany w grudniu 2014 roku i niemal natychmiast znalazł nowego pracodawcę, którym okazał się Team ROCCAT. Był to już czwarty etap – powrót na szczyt. Początki nie były dla norweskiego mid-lanera łatwe i miał on problemy z odnalezieniem się zarówno w samej grze, jak i w drużynie, w której był jedynym obcokrajowcem. Skutkowało to wyjątkowo pasywnym stylem gry, jaki stał się udziałem Nukeducka. Sprawy nie ułatwiał także bardzo wąski champion pool gracza. W konsekwencji Team ROCCAT dopiero w barażach zapewnił sobie utrzymanie w rozgrywkach. Tymczasem letnia edycja zmagań była dla Norwega już znacznie bardziej udana – zawodnik odzyskał pewność w grze i stał się ważnym punktem zespołu, ponownie prezentując wysokie umiejętności mechaniczne. W lecie Nukeduck najczęściej grał Viktorem (5), Azirem (5) i Varusem (4) i trzeba przyznać, że wychodziło mu to znakomicie, bo okazał się drugim najczęściej asystującym mid-lanerem w stawce, a także drugim graczem środka alei z największym udziałem w zabójstwach drużyny.</p>\n<p>\nNick Norwega jest złożeniem dwóch słów – „Nuke”, co oznacza błyskawiczne zmiecenie przeciwnika z powierzchni ziemi, a także „Duck”, bo… dobrze brzmiało. Mid-laner w przeszłość dużo grał w koszykówkę, a także w piłkę wodną. Nukeduck nie ukrywa również fascynacji fantastyką, a szczególnym uwielbieniem darzy „Władcę Pierścieni” oraz „Hobbita”.\n</p>"},"foreignIds":{"drupalId":"280","TRLH3":"200000121","TRLH4":"200000224"},"socialNetworks":{"facebook":"www.facebook.com/nukeducklol","twitter":"https://twitter.com/nukeducklol","twitch":"http://www.twitch.tv/nukeducklol"},"champions":[],"liveGameTeam":165},{"id":490,"slug":"steve","name":"Steve","firstName":"Etienne","lastName":"Michels","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/steve-homsdwkp.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-05-20T14:49:17.000Z","updatedAt":"2017-03-26T09:35:58.000Z","bios":{"en_US":"<p>\nEtienne “Steve” Michels launched his career with ROCCAT during the 2015 EU LCS Summer Preseason, replacing Overpow as their starting top laner. Steve brought several years of amateur experience, but he was still an EU LCS rookie and had the inconsistent play to prove it. In 2016, Steve and Schalke were huge underdogs heading into the Spring Split. Their play was enough to hang onto 7th place and re-qualify for the Summer Split.\n</p>\n<p>\nSteve has always been a crowd favorite though, making a name for himself as a great split pusher and all-around team player. This split will be a test to find out just where Steve lies in Europe’s sea of talent. Schalke has remained largely the same, paving the way for Steve to make this Split a proving grounds for himself. Let there be no doubt, the chants of “Steeeeeeeeeeeeve!” will still be heard around the world, let’s just hope he answers the call.\n</p>","fr_FR":"<p>La France est particulièrement bien fournie en toplaners. Après le vétéran Paul « sOAZ » Boyer et Lucas « Cabochard » Simon-Meslet, le public a pu découvrir Etienne « Steve » Michels. Ayant débuté sur League of Legends dès ses prémices, Steve n’a pas tout de suite été tenté par la compétition, mettant ses études au premier plan. En 2015, il rejoint le projet Sparta, dans le but de tenter la qualification aux LCS via le tournoi d’expansion. L’équipe ayant échoué dans son entreprise, Steve rejoint l’équipe LDLC pour continuer à jouer au niveau français. C’est à ce moment-là que sa carrière décolle. Steve est repéré par l’équipe ROCCAT lors de la pré-saison estivale des LCS EU 2015, qui lui propose de remplacer Overpow au poste de toplaner titulaire. Il avait dans ses bagages quelques légères années d'expérience sur la scène amateur, mais il restait néanmoins un débutant propulsé aux LCS EU. Son inexpérience au niveau professionnel lui a coûté cher dès les premières semaines du segment d'été et les équipes adverses en abusaient.</p>\n<p>Mais très vite, le Français a redressé la tête durant la seconde moitié de la saison et son KDA moyen est passé de 1,9 (semaines 1 à 5) à 4,4 (semaines 6 à 10). Sa confiance en ses capacités et, plus important encore, la confiance que ses équipiers plaçaient en lui étaient bien plus grandes. Les spectateurs berlinois ont également soutenu le toplaner dès ses premières apparitions, visiblement séduits par son sourire permanent. Les progrès de Steve ont hissé permis à ROCCAT d’atteindre la 5e place du segment d'été des LCS EU 2015 et de participer aux play-offs. </p>\n<p>Début 2016, Steve rejoint l’équipe Elements in-extremis. Aux côtés de son compatriote Jérémy « Eika » Valdenaire, il donne le meilleur de lui-même dans un championnat très disputé mais le milieu de saison est très difficile. L’équipe parvient tout de même à sécuriser la 7e place, qui n’offre pas de ticket pour les play-offs mais qui dispense de tournoi de relégation. À l’intersaison, le spot Elements est racheté par l’équipe sportive FC Schalke 04. Fort d’un encadrement très sérieux et expérimenté, Steve pourra peut-être enfin s’épanouir cette saison !\n</p>","es_ES":"<p>Etienne 'Steve' Michaels comenzó su carrera profesional durante la pretemporada del Split de verano de la LCS EU 2015, reemplazando a Overpow como el top titular. Steve traía bajo el brazo varios años de experiencia en la competición amateur, pero no dejaba de ser un novato, cosa que pagó en las primeras semanas del Split de verano de la LCS EU 2015 con una actuación lejos del nivel esperado.</p>\n<p>Pero Steve no cejó en su empeño y mejoró sensiblemente su rendimiento en la segunda mitad de la temporada, pasando de un KDA de 1.9 (jornadas 1 a 5) a 4.4 (jornadas 6 a 10). Con un aumento significativo no sólo en su confianza sino en la del resto del equipo. La mejora de Steve llevó a ROCCAT a la tercera posición en el Split de verano de la LCS EU 2015, y eventualmente aseguró una plaza en un nuevo equipo de cara al Split de primavera de la LCS EU 2016, Elements. No podemos esperar a ver a los aficionados aclamarlo con su grito preferido: \"¡¡Steeeeevveeeeeeee!!\".</p>","pl_PL":"<p>Etienne rozpoczął swoją przygodę z League of Legends bardzo wcześnie, gdyż zdominował amerykański serwer przed powstaniem europejskiego. Zanim się przeniósł na ten drugi, udało mu się znaleźć wśród 30 najlepszych graczy w regionie. Na amatorskiej scenie pojawił się w 2013 roku, grając w wielu drużynach konkurujących w Kręgu Pretendenta. Przed zaangażowaniem się w rozgrywki 5v5, w pierwszym i drugim sezonie „Steve” uznawał za swoją główną rolę AD Carry. Dopiero udział w drużynowych konkurencjach sprawił, że przeniósł się na top-lane. Posunął się nawet do tego, że po liceum wziął rok wolnego żeby się skupić na swojej karierze profesjonalnego gracza. Jednak ani przenosiny na inną linię ani rezygnacja z pójścia na studia nie przyniosły mu upragnionych osiągnięć. Dopiero kiedy wrócił na studia fizyki w inżynierii dostał szansę na wykazanie się od drużyny Sparta. W październiku 2014 roku przeniósł się do domu graczy w Paryżu należącego do tej organizacji. Wraz z nią wziął udział w Europejskim turnieju rozszerzającym ilość drużyn w rozgrywkach LCS. Niestety znowu bez sukcesu. </p>\n<p>\n„Steve” miał okazję pokazać się społeczeństwu dopiero kiedy zastąpił Remigiusza \"Overpow\" Puscha w zespole Roccat. Od maja 2015 roku przejął górną aleję w tej ekipie i wreszcie miał okazję zaprezentować co potrafi szerszej publice. W szeregach „niebieskiego kota” osiągnął największy sukces – zajął piąte miejsce w letnim sezonie EU LCS 2015. Jak na debiutanta to naprawdę imponujący wyczyn. Jednak nie pozostawił widzom wątpliwości, że w pełni zasłużył na podziw. Wielokrotnie broniony przez Etienna top-lane stawał się ostoją całej drużyny, pomimo tego, że nie grał swoimi ulubionymi bohaterami – Ryzem i Irelią. Stał się znany z niesamowitych zagrań Maokaiem, którego najczęściej można było podziwiać właśnie w jego wydaniu. Wielu fanów utrzymuje, że największe wrażenie na nich zrobiła jego gra Ekko – w lecie wygrał wszystkie mecze, w których wybrał Chłopca, Który Ujarzmił Czas.</p>\n<p>\n„Steve”, pomimo tego, że urodził się we Francji, miał okazję mieszkać w Belgii i Arabii Saudyjskiej – co bardzo wyróżnia go wśród innych graczy. Kolejnym znaczącym kontrastem była jego zdolność do połączenia pasji gry na komputerze z klasycznym sportem. W swoim regionie osiągnął wiele w lidze badmintona.\n</p>","de_DE":"<p> „Er ist sehr bescheiden.“ Worte, mit denen Jakob \"YamatoCannon\" Mebdi seinen damaligen Top-Laner beschrieb. Ein Attribut, was nicht vielen Spielern der oberen Liga zugutekommt, da mit guten Spielern oftmals ein großes Ego einhergeht. Mit Nettigkeit kommt man nicht voran? Steve beweist das Gegenteil, denn hinter dem sanften Gemüt steckt viel Ehrgeiz und die feste Entscheidung im eSports etwas zu erreichen. </p>\n<h2><p>Ein steiniger Weg</p></h2>\n<p>Doch der Weg war kein leichter. Sein Eintritt in League war gleich zu Beginn des Spiels im Jahre 2009. Ohne weitere Hintergedanken kam er schnell unter die Top 200 und erste Gedanken an eine Karriere kamen auf. Mit Beginn der dritten Saison kam der erste große Schritt zur Umsetzung des Plans. Er wählte die Top-Lane zu seiner Bestimmung, da er Jarvan IV. sehr gerne spielte und hielt erstmals nach Amateurteams Ausschau. </p>\n<p>Wie bei so Vielen folgte ein langer Weg vom einen Challenger Team zum nächsten, da sich die Teams schon nach den ersten Misserfolgen wieder schnell auflösten. Unter anderem auch die Eigenkreationen des Hobbykeksbäckers mit seinem Team „Steve Bakes Cookies“. So richtig los ging es erst, als YamatoCannon auf ihn aufmerksam wurde, nachdem er durch seine Art immer wieder von ehemaligen Kollegen empfohlen wurde. </p>\n<p>Wohlgleich noch der Franzose noch sehr unvertraut mit dem von da an immer größer werdenden Publikum war, lieferte er einen sehr starken Split ab. Er war maßgeblich an dem zufriedenstellenden fünften Platz seitens ROCCAT beteiligt. Vor allem durch sein starkes Erscheinen auf Maokai und Ekko verhalf er dem Team vermehrt zu Siegen. Nicht ohne Grund waren die „Steeeeve“ Rufe im LCS Stream nicht zu überhören. </p>\n<p>Die Reise geht nun weiter. Das ruhige Gemüt wird zukünftig eines der fünf Elemente in Elements sein. Nicht als Feuer und Flamme, sondern als standfestes Rückgrat des Teams. Während des Spiels, aber auch danach im persönlichen Zusammenleben mit seinen wieder einmal neuen Kollegen. </p>\n"},"foreignIds":{"drupalId":"1940","TRLH3":"200000255","TRLH4":"200000307","TRLH2":"1001250001","FRA1TMNT2":"25416","ESPORTSTMNT02":"200001025"},"socialNetworks":{"twitch":"http://www.twitch.tv/rocsteve","facebook":"https://www.facebook.com/LolIAmSteve?_rdr=p"},"champions":[],"liveGameTeam":55},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1089,"slug":"djoko","name":"Djoko","firstName":"Charly","lastName":"Guillard","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/djoko-eihpvx8d.png","hometown":null,"region":"EU LCS","birthdate":"1997-03-01","createdAt":"2016-01-21T21:12:44.000Z","updatedAt":"2017-06-09T10:57:44.000Z","bios":{"en_US":"<p>Charly “Djoko” Guillard is finally getting his shot in the EU LCS. The jungler has spent the past two years working his way up through the Challenger scene, most recently as a member of the Millenium roster that fell to ROCCAT in the 2017 Spring Promotion Tournament.</p>\n\n<p>On Team Vitality’s 2017 lineup, he’ll be competing with teammate GBM for the starting jungle position. His history in the jungle position may end up working in his favor; GBM is new to the role this season. Either way, the competition can only serve to improve Djoko’s skills and Vitality’s chances in 2017.</p>","fr_FR":"<p>Djoko est le jungler de l’équipe Millenium. Actuellement Challenger, il a prouvé sa valeur de nombreuses fois dans le passé notamment sous les couleurs \"Imaginary Gaming\" avec qui il a remporté la première édition du Challenge France. </p>\n<p> Il a pu goûter au plus haut niveau en remplaçant DiamondProx des « Unicorns of Love » durant les LCS EU 2016. Reconnu pour ses choix de champions exotiques, Djoko est l'un des piliers de l'équipe et compte bien la mener le plus loin possible. Sa synergie avec son coéquipier Kaze lui permet de dominer la scène française et de guider son équipe vers la victoire. Après l'échec de la qualification aux LCS à une marche de son rêve, il promet de revenir encore plus fort afin de conserver le titre avec ses coéquipiers et de retenter sa chance.</p>","de_DE":"<p>Charly „Djoko“ Guillard bekommt endlich die Gelegenheit, sich in der EU LCS zu beweisen. Der Jungler hat die letzten beiden Jahre damit verbracht, sich in der Challenger Series nach oben zu arbeiten. So war er vor Kurzem noch Mitglied von Millenium, die im Frühjahrs-Aufstiegsturnier 2017 gegen ROCCAT den Kürzeren zogen.\n\n2017 wird er bei Team Vitality mit Teammitglied GBM um die Startposition als Jungler wetteifern. Dabei könnte sich seine Vergangenheit im Dschungel als Vorteil erweisen, schließlich ist diese Position für GBM neu. So oder so wird die Konkurrenz dafür sorgen, dass sich sowohl Djokos Können als auch Vitalitys Chancen 2017 verbessern.\n</p>"},"foreignIds":{"TRLH3":"200000120","TRLH4":"200000223"},"socialNetworks":{"twitter":"https://twitter.com/Djoko_GG"},"champions":[],"liveGameTeam":165},{"id":1337,"slug":"memento","name":"Memento","firstName":"Jonas","lastName":"Elmarghichi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/memento-2s3o4ejq.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:46:29.000Z","updatedAt":"2017-06-18T19:39:23.000Z","bios":{"en_US":"<p>Jonas \"Memento\" Elmarghichi was originally a solo queue star before kickstarting his professional career in 2015. He then joined Team ROCCAT as their starting jungler in mid 2016. He, along with the entire team, struggled in the LCS and eventually had to play in the EU LCS Promotion Tournament in order to re-enter the league. After struggling with ROCCAT, Memento looked for other opportunities to showcase his abilities and landed with Giants Gaming in early 2017. While his play hasn’t been astounding by any stretch, he’ll have another shot to prove that he belongs with the best in Europe when spring rolls around.</p>","de_DE":"<p>Jonas „Memento“ Elmarghichi war ursprünglich ein Star der Solo-Warteschlange, bevor er seine Profikarriere 2015 gestartet hat. Er ist Mitte 2016 Team ROCCAT als Jungler beigetreten. Allerdings hatten er und der Rest des Teams große Schwierigkeiten in der LCS und schließlich mussten sie sich im „EU LCS“-Aufstiegsturnier den Weg zurück in die Liga erkämpfen. Nach den Problemen mit ROCCAT hat sich Memento nach anderen Möglichkeiten umgesehen, um seine Fähigkeiten zu zeigen. Anfang 2017 ist er dann bei Giants Gaming gelandet. Obwohl seine Leistung nicht außergewöhnlich war, kann er im Frühjahr erneut beweisen, dass er zu den Besten Europas gehört.</p>"},"foreignIds":{"TRLH4":"200000199","TRLH3":"200000096","ESPORTSTMNT02":"200002451"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1376,"slug":"norskeren","name":"Norskeren","firstName":"Tore","lastName":"Hoel Eilertsen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/norskeren-f5d7bkuf.png","hometown":null,"region":"Challenge France","birthdate":null,"createdAt":"2016-06-17T20:14:37.000Z","updatedAt":"2017-08-17T15:27:52.000Z","bios":{"en_US":"","fr_FR":"Dans son pays d'origine, le joueur norvégien a joué dans plusieurs équipes, participant à des tournois nationaux et des LANs. C'est en avril 2016 qu'il rejoint la structure professionnelle allemande mousesport. Finalement, il préférera retourner en Norvège pour jouer dans l'équipe Riddle eSports, la meilleure équipe du pays. \n<br />\nRéperé par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires."},"foreignIds":{"TRLH1":"1001360009","esportstmnt05":"200000939","ESPORTSTMNT02":"200002448","TRLH4":"200000354","TRLH3":"200000354"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1377,"slug":"upset","name":"Upset","firstName":"Elias","lastName":"Lipp","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/upset-f4z7h6wr.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-20T17:58:58.000Z","updatedAt":"2017-05-09T22:41:05.000Z","bios":{},"foreignIds":{"TREU1":"1000585051","TREU":"1000585051","ESPORTSTMNT02":"200001007","TRLH3":"200000233","TRLH4":"200000085","TRLH1":"200000423"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1704,"slug":"alderiate","name":"Alderiate","firstName":"Adrien","lastName":"Wils","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alderiate-7q1wg8p0.png","hometown":null,"region":"EU LCS","birthdate":"1993-09-07","createdAt":"2017-01-13T19:44:16.000Z","updatedAt":"2017-01-18T22:06:05.000Z","bios":{},"foreignIds":{"TRLH3":"200000125","TRLH4":"200000228"},"socialNetworks":{"twitch":"https://twitter.com/Alderiate"},"champions":[],"liveGameTeam":165},{"id":1752,"slug":"rexxx","name":"1 Rexxx","firstName":"Erik","lastName":"Reisswig","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rexxx-5uhnncsw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-30T20:08:17.000Z","updatedAt":"2017-07-07T18:06:26.000Z","bios":{},"foreignIds":{"TRLH3":"200000235","TRLH4":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":2013,"slug":"nikola-senpai","name":"Nikola Senpai","firstName":"Nikola","lastName":"Djordjevic","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nikola-senpai-3z4qiutz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:23:59.000Z","updatedAt":"2017-08-06T14:35:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002453","TRLH4":"200000454"},"socialNetworks":{},"champions":[],"liveGameTeam":55}],"scheduleItems":[{"id":"AVTGvZ1JQMQFcjhwbQjB","content":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:match:cdc27e70-cf2a-4b2b-afba-db9851397be6","scheduledTime":"2016-07-31T10:00:01.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:bracket:88a5aa52-4461-4a15-8fb5-83c8b5265f93"},"match":"cdc27e70-cf2a-4b2b-afba-db9851397be6","tournament":"f7afa181-4580-48c0-af26-4b3d70fe21eb","bracket":"88a5aa52-4461-4a15-8fb5-83c8b5265f93","league":"3"}],"gameIdMappings":[{"id":"456daf49-f83b-4c59-9bba-4ff93e2e5fac","gameHash":"c3e36eea5f464c5d"},{"id":"8d6f59f7-d567-4206-9b0c-ad7fc6ac453f","gameHash":"5fed8c345e76763e"}],"videos":[{"id":4022,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:8d6f59f7-d567-4206-9b0c-ad7fc6ac453f","source":"https://www.youtube.com/embed/LLLk29nnvVs?wmode=transparent","createdAt":"2016-07-31T17:25:55.000Z","updatedAt":"2016-07-31T17:25:55.000Z","game":"8d6f59f7-d567-4206-9b0c-ad7fc6ac453f"},{"id":4024,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:f7afa181-4580-48c0-af26-4b3d70fe21eb:game:456daf49-f83b-4c59-9bba-4ff93e2e5fac","source":"https://www.youtube.com/embed/KyveLtXLGLg?wmode=transparent","createdAt":"2016-07-31T17:26:44.000Z","updatedAt":"2016-07-31T17:26:44.000Z","game":"456daf49-f83b-4c59-9bba-4ff93e2e5fac"}],"htmlBlocks":[],"match":{"id":"cdc27e70-cf2a-4b2b-afba-db9851397be6","name":"S04-vs-VIT","position":32,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}],"games":{"456daf49-f83b-4c59-9bba-4ff93e2e5fac":{"id":"456daf49-f83b-4c59-9bba-4ff93e2e5fac","name":"G2","generatedName":"S04|VIT|G2|cdc27e70cf2a4b2bafb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"},{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}],"standings":{"result":[[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1469985843798,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}],[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1469966742940,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"2002290170","gameRealm":"TRLH2","platformId":"TRLH2:2002290170","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8d6f59f7-d567-4206-9b0c-ad7fc6ac453f":{"id":"8d6f59f7-d567-4206-9b0c-ad7fc6ac453f","name":"G1","generatedName":"S04|VIT|G1|cdc27e70cf2a4b2bafb","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}],"standings":{"result":[[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1469985783145,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}],[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"}]],"timestamp":1469963881298,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"2002290142","gameRealm":"TRLH2","platformId":"TRLH2:2002290142","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1469985843799,"source":"bestOf","history":[{"result":[[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1469985783146,"source":"bestOf","closed":true},{"result":[[{"roster":"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc"},{"roster":"9c84662f-51ee-480b-94c3-dcfcd891ca89"}]],"timestamp":1469966742940,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"a13bf06d-bda8-46c2-a1ef-c6c1800a3fcc":1,"9c84662f-51ee-480b-94c3-dcfcd891ca89":1}}}