{"teams":[{"id":266,"slug":"tempo-storm","name":"Tempo Storm","guid":"be72468d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/tempo-storm-ixatzlou.png","acronym":"TS","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:04:32.000Z","updatedAt":"2017-07-21T02:34:49.000Z","bios":{"en_US":"<p>Coach: Seung-pyo \"Cella\" Hong</p>"},"foreignIds":{},"players":[159,199,253,323,1673,1676,1677,1996],"starters":[159,199,253,1673,1996],"subs":[323,1676,1677]},{"id":267,"slug":"big-gods-jackal","name":"Big Gods Jackals","guid":"be72477c-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/big-gods-jackal-gahxh2c5.png","acronym":"BIG","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:06:48.000Z","updatedAt":"2017-07-20T01:45:00.000Z","bios":{"en_US":"<p>Coach: Ednilson \"Jukaah\" Vargas</p>"},"foreignIds":{},"players":[275,365,419,578,666,900,1674],"starters":[275,365,419,578,900],"subs":[666,1674]}],"players":[{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":199,"slug":"selfie","name":"Selfie","firstName":"Marcin","lastName":"Wolski","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/selfie-fd1hs0op.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-07-20T21:07:27.000Z","bios":{"en_US":"","pl_PL":"<p>Marcin to młody i utalentowany polski mid-laner. Doskonale sobie radził w League of Legends na scenie amatorskiej, co potwierdziło jego wejście do Kręgu Pretendenta w Europie i Ameryce Północnej. Kiedy zainteresował się konkurencją na drużynowym poziomie, okazało się, że na jego drodze stoi bariera wiekowa. Jak tylko skończył 17 lat, grał jako substytut w MeetYourMakers. W tym zespole zdominował cotygodniowe rozgrywki Go4LoL, lecz po miesiącu zrezygnował na rzecz pełnego stażu. W marcu 2014 roku \"Selfie\" zasilił szeregi SUPA HOT CREW, gdzie dokonał swoich największych osiągnięć. Po wiosennym sezonie EU LCS 2014 drużyna Marcina otarła się o relegacje, ale wyszła z nich obronną ręką, pokonując Cloud9 Tempest 3:0. Na forach dotyczących League of Legends pojawiły się głosy, że zawodnicy potrzebowali czasu żeby zgrać się ze sobą. W letnim sezonie EU LCS 2014 zespół SHC udowodnił, że ta teoria była prawdziwa. Regularne rozgrywki skończył na trzecim miejscu, z wynikiem 16:12, co naprawdę wyróżniło graczy SHC. </p>\n<p>Czasy świetności dla Marcina przeminęły wraz z nadejściem nowego właściciela jego drużyny -  MeetYourMakers. Ze względu na dręczące go problemy związane z kontraktem spróbował opuścić MYM na samym początku wiosennego okresu, lecz to tylko doprowadziło do kłótni z menadżerem. Po aferze „Selfie” wrócił do gry pod starym sztandarem, lecz widać było obniżone morale polskiego mid-lanera. Po tym incydencie zdecydował się porzucić europejską profesjonalną scenę i poszukać szczęścia w Ameryce Północnej. Na początku amatorsko podszedł do rzeczy i poznawał region w kolejce solo que. Jednak po krótkim epizodzie z zespołem Vortex zdecydował się dać ogłoszenie na swoich portalach, że poszukuje poważnej drużyny. Jego obwieszczenie nie zostało przeoczone i wkrótce potem, w styczniu 2016 roku został przyjęty do nowo utworzonej drużyny Echo Fox. Pod jej opiekuńczymi skrzydłami zagrał w nadchodzącym wiosennym sezonie NA LCS 2016.</p>\n<p>Rozsławił się przed sezonem 4 niszczycielskimi umiejętnościami w grze Yasuo, mało kto potrafił go zatrzymać kiedy grał tym bohaterem. W tym okresie jego powodzenie w solo que, przerastało wszelkie pojęcie – „Selfie” miał aż 80% win ratio przy KDA 3.0 w meczach Pokutnikiem. Ten wyczyn sprowokował częste bany samuraja w tej kolejce. Zamiłowanie do asasynów Marcina przejawia się również w uwielbieniu dla innych postaci, takich jak: Ahri, Fizz i Kassadin. Miał okazję popisać się grą Lisicą o Dziewięciu Ogonach w regularnych rozgrywkach EU LCS, czym niezwykle uradował swoich fanów.</p>\n"},"foreignIds":{"drupalId":"1770","TRLH3":"200000232","TRLH4":"200000084","TRLH1":"200000711","TRLH2":"1001160141","FRA1TMNT1":"375111","TRNA1":"1000425111","TREU":"1000475024","TREU1":"1000475024","FRA1TMNT2":"25061","ESPORTSTMNT02":"200001006"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":253,"slug":"sheep","name":"Sheep","firstName":"Jamie","lastName":"Gallagher","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sheep-bobcjvad.png","hometown":"USA","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:12.000Z","updatedAt":"2017-06-14T21:08:08.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1313","ESPORTSTMNT02":"200000685","TRLH1":"200000311"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":323,"slug":"freeze","name":"Freeze","firstName":"Aleš","lastName":"Kněžínek","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/freeze-ak38hz0f.png","hometown":"Czech Republic","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-14T21:06:16.000Z","bios":{"en_US":"","fr_FR":"<p>En 2013, Aleš « Freeze » Kněžínek a fait ses armes dans des équipes semi-professionnelles avant d’être repéré par la structure suédoise Ninjas in Pyjamas. C’est ainsi que le carry AD tchèque fait sa première apparition en LCS, accompagné sur sa voie par l’actuel commentateur Martin « Deficio » Lynge et dans la même équipe que Søren « Bjergsen » Bjerg. Les résultats ne sont pas cinglants mais Freeze impressionne sur des champions très exigeants mécaniquement comme Caitlyn mais surtout Draven, son champion de signature. La fin de saison est désastreuse et NiP est éliminé des LCS. Après quelques mois à essayer de redresser la barre, sans succès, l’équipe se sépare. </p>\n\n<p>Freeze rebondit alors très vite et rejoint l’équipe danoise Copenhagen Wolves, récemment qualifiée en LCS. Pendant le printemps, l’équipe montre de bonnes choses et atteint les play-offs, mais la fin de saison est beaucoup moins rose. Freeze était devenu le carry principal, ce qui faisait de lui la cible prioritaire des équipes adverses. Malgré ses efforts, un seul homme ne peut pas suffire pour obtenir la victoire sur la Faille. Freeze et son équipe finissent lanterne rouge des LCS et en sont éliminés. Au début de l’année 2016, Freeze traverse l’Atlantique pour rejoindre la toute nouvelle équipe Renegades, fraîchement qualifiée aux LCS NA.</p>\n\n<p>Chez Renegades, Freeze met du temps à prendre ses marques. En jouant principalement Lucian et Kalista, il reste sur sa lancée et réussi à prendre ses responsabilités, se montrant comme la grande menace de son équipe. Mais, une fois encore, son équipe peine et finit dans la partie inférieure du classement. Il réussit cette fois à sauver la place de son équipe en LCS. Pendant l’intersaison, le carry AD reçoit une offre de l’équipe H2K, qu’il accepte. Freeze revient donc en Europe, déterminé à faire oublier Konstantinos « FORG1VEN » Tzortziou-Napoleon. Après des années à recevoir les éloges des spécialistes alors qu’il était dans des équipes de bas de classement, cette place chez H2K pourrait être un tremplin pour booster sa carrière. Aux côtés d’excellents joueurs comme son support Oskar « Vander » Bogdan et d’un coach renommé, Freeze a en tout cas toutes les cartes en main pour s’imposer en Europe et tenter de conquérir le monde.</p>","pl_PL":"<p>\"Freeze\" interesował się grami komputerowymi od wczesnego dzieciństwa, ponieważ z pierwszym tytułami miał kontakt już w wieku 5 lat. League of Legends poznał dopiero w drugim sezonie, lecz na początku grafika i mechanika tego dzieła go odrzucała. Jednak z czasem to się zmieniło i bardzo zaangażował się w konkurowanie z graczami z całego świata. Wkrótce okazało się, że doskonale sobie radzi na bot-lanie, więc we wrześniu 2012 roku został zaproszony do czeskiego zespołu eXtatus. Aleš Kněžínek nie wierzył w opłacalność bycia profesjonalnym esportowcem, ze względu na bardzo ograniczone możliwości rozwoju w tym kierunku w Czechach. Aczkolwiek został namówiony żeby chociaż spróbować, więc wraz z rodakami wziął udział w licznych turniejach w sieci. Wtedy doszedł do wniosku, że naprawdę chciałbym zostać kimś znanym w League of Legends. Przez najbliższe lata kierował się swoim mottem z filmu „Po prostu walcz!” : „Jeśli zamierzasz być najlepszym, musisz dać z siebie wszystko”. Do czerwca 2013 roku brał udział, często wygrywając, w wielu wydarzeniach różnej rangi – stopniowo stawał się coraz bardziej znany. Otarł się o wejście do rozgrywek EU LCS będąc w Samurai in Jeans, lecz na jego drodze stanął mocniejsza wtedy drużyna Copenhagen Wolves. Nie zaważyło to na spełnieniu marzeń Aleša, gdyż swoimi umiejętnościami zrobił wrażenie na organizacji Ninjas in Pyjamas. W jej szeregach zagrał w letnim sezonie EU LCS 2013 i został pierwszym Czechem, który zagrał w rozgrywkach LCS. Swój debiut na europejskiej scenie esportowej skończył na piątym miejscu z wynikiem 15:13.</p>\n<p>Los przestał się do niego uśmiechać już w wiosennych zmaganiach w EU LCS 2014. Po wszystkich meczach w tym okresie, „Freeze” i jego drużyna stanęli na krawędzi relegacji. Po czym przegrali swoje miejsce w EU LCS, walcząc z zespołem Kiedyś Miałem Team. NiP podjął próbę powrotu do renomowanych rozgrywek, lecz nie powiodło im się, dlatego we wrześniu 2014 roku Aleš zdecydował się poszukać szczęścia gdzie indziej. Zaczął grać z byłymi zawodnikami z Copenhagen Wolves i wkrótce potem został zrekrutowany przez ich starą organizację. W szeregach CW wziął udział w wiosennym sezonie EU LCS 2015 i zajął 6 pozycję, co według niego było przeciętnym wynikiem. Niestety kolejny okres letnich rozgrywek do złudzenia przypominał ten z zeszłego roku, kiedy „Freeze” był członkiem NiP. Wilki z Kopenhagi skończyły na ostatnim miejscu, w związku z czym zostały automatycznie relegowane do Challenger Series. Aleš nie zamierzał kolejny raz walczyć o miejsce w EU LCS, dlatego 1 listopada 2015 roku ogłosił, że jest wolnym agentem i szuka nowego zespołu. Po 2 miesiącach niepewności okazało się, że znowu weźmie udział w rozgrywkach LCS, tylko że tym razem w Ameryce Północnej. Czeski AD Carry dostał i przyjął ofertę od drużyny, która dopiero dostała się do wiosennego sezonu NA LCS 2016, LA Renegades. </p>\n<p>Podczas pojedynków w EU LCS „Freeze” wyróżnił się wśród innych zawodników imponującą grą Dravenem, Caitlyn i Kalistą. Z całą pewnością nie można powiedzieć o nim „monotematyczny”, gdyż grając w solo que wszedł do Kręgu Pretendenta wybierając głównie Ezreala i Corkiego. Następnie zaskoczył wszystkich oznajmiając, że wśród jego ulubionych postaci znajduje się również Varus. Za takim AD Carry z pewnością ciężko nadążyć i nie sposób zbanować mu wszystkich bohaterów, którymi gra. Wszechstronność Aleša widać także w życiu codziennym, ponieważ lubi uprawiać różne sporty - jego ulubionymi są piłka nożna i ręczna.</p>\n","de_DE":"<p>Womöglich ist Aleš \"Freeze\" Kněžínek einer der dramatischsten Figuren im professionellen League of Legends. Seit seiner Zeit bei Ninjas in Pyjamas in 2013 wurde er stets als Top-Schütze europäischer Herkunft gehandelt. Mit dem versprechenden Kader der erfolgreichen Multi-Gaming-Organisation hatte er die beste Aussicht auf den Einzug in die EU LCS 2014 und kaum jemand gab dem unbekannten polnischen Gegner den Hauch einer Chance. Doch wurde er überrascht, als Kiedys Mialem Team (später ROCCAT) das Promotionsspiel überzeugend gewann und ihm eine nahe rosige Zukunft verwehrte.  </p>\n\n<p>Freeze durfte dennoch in der europäischen Königsdisziplin mitmischen, als er im darauffolgenden Jahr von Copenhagen Wolves aufgenommen wurde. Mit den Wölfen schaffte er es entgegen vieler Erwartungen in die Playoffs des EU LCS Spring 2015, doch musste anschließend den totalen Absturz auf den zehnten Platz im Sommer miterleben, was weniger ihm zuzuschreiben war, als anderen. Er galt immer noch einer der besten seiner Rolle, obwohl er in die Zweitliga abstieg.  </p>\n\nDer Aufstieg in die LCS ließ nicht lange auf sich warten und war von recht einfacher Natur. Wiederholt wechselte er zu einem LCS-Kader, diesmal allerdings einer, der in Nordamerika ansässig war. Renegades nahm mit dem Einzug in die NA LCS auch neue Spieler auf, darunter den Tschechen. Mit der neuen Mannschaft wurden zwar ebenso wie bei Copenhagen Wolves nicht die höchsten Ziele gesetzt, allerdings war es besser, als einen Platz in der Challenger Series.  </p>\n\n<p>Mit H2K kann sich Freeze nun diese ambitionierten Ziele setzen, da er nun über eine Mannschaft aus europäischen (und einem koreanischen) Superstars verfügt. Ohne Frage ist er selbst vom selbigen Kaliber und hat somit nicht nur die Aussicht auf einen LCS-Split in den oberen Rängen der Tabelle, sondern auch eine sehr reale Chance auf eine Weltmeisterschaftsteilnahme. </p>","es_AR":"<p>Aleš \"Freeze\" Kněžínek es el tirador suplente de H2K.</p>"},"foreignIds":{"drupalId":"291","ESPORTSTMNT02":"200000684","TRLH1":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":365,"slug":"fabbbyyy","name":"fabbbyyy","firstName":"Jovani","lastName":"Guillen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fabbbyyy-ggr3o4hr.png","hometown":"USA","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-14T22:16:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1312","ESPORTSTMNT02":"200000743","TRLH1":"200000289"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":419,"slug":"sirt","name":"SirT","firstName":"Thúlio","lastName":"Carlos","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sirt-3sj9ez37.png","hometown":"Recife - PE","region":"CBLOL Brazil","birthdate":"1992-10-20","createdAt":"2015-05-13T21:10:24.000Z","updatedAt":"2017-06-14T22:21:58.000Z","bios":{"pt_BR":"SirT é um dos poucos jogadores que nunca mudou de equipe em sua carreira. Caçador da paiN desde junho de 2012, Thulião sempre esbanjou uma sinergia fora do normal com Kami, e é o grande coordenador de jogadas da equipe. Após um tempo apagado, recuperou a motivação e garantiu seu espaço no cenário, roubando Barões e Dragões em momentos fundamentais. Versátil, deixou um pouco o lado tanque e utilitário para aprender a jogar com caçadores carregadores e rápidos, e hoje em dia domina o meta como poucos caçadores.","en_US":"","fr_FR":"<p>Thúlio « SirT » Carlos a vu passer au fil des ans de nombreux joueurs dans les rangs de paiN Gaming. Et à un moment donné, peut-être un peu après le Championnat brésilien de 2013 remporté par paiN, SirT a perdu sa motivation. Mais l'arrivée de deux joueurs coréens l'an dernier a permis de rallumer la flamme. Son jeu est à nouveau dans le rythme, et la synergie avec le nouveau top laner, Mylon, permet à SirT d'avoir de nouveau un impact sur les voies de à faire tourner les têtes.</p>","pl_PL":"<p>Thúlio „SirT” Carlos całe lata obserwował zmiany w zespole paiN Gaming – każdy rok przynosił nowe twarze. Gdzieś po drodze, prawdopodobnie po Mistrzostwach Brazylii w 2013 r., SirT stracił zapał do gry. Poczuł go znowu w zeszłym roku, gdy do zespołu dołączyło dwóch byłych reprezentantów Korei. Doskonale się dogaduje z walczącym w górnej alei Mylonem, a do tego jest świetnym strategiem, więc jego powrót wróży drużynie paiN same sukcesy.</p>","de_DE":"<p>Thúlio „SirT“ Carlos musste Jahr für Jahr mit anschauen, wie die Spieler von paiN Gaming sich die Klinke in die Hand gaben, jedes Jahr gab es neue Gesichter. Irgendwo auf halber Strecke, vielleicht kurz nach der brasilianischen Meisterschaft, verlor SirT seinen Antrieb. Doch durch den Zuwachs zweier ehemaliger koreanischen Spieler, kam auch SirTs Motivation wieder zurück. Mit seinem neuen, schnellen Makro-Spiel und seiner Zusammenarbeit zwischen ihm und dem neuen Top-Laner Mylon ist er wie neugeboren, und bereit, die Weltmeisterschaft aufzumischen. </p>","es_ES":"<p>Durante años, Thúlio “SirT” Carlos ha visto a multitud de jugadores ir y venir en paiN Gaming, cada temporada plagada de caras nuevas que, al poco tiempo, se volvían a ir. Y en algún punto en el camino, quizás un poco después de la victoria en el Brazilian Championship 2013, SirT perdió las ganas por competir. Aunque la incorporación de dos jugadores coreanos el año pasado hizo  despertar su motivación. Preparado de nuevo y con una sinergia total con su nuevo compañero en la calle superior Mylon, SirT tiene todo lo que necesita para ayudar a su equipo desde la jungla. </p>"},"foreignIds":{"TRLH3":"1001160087","TRLH4":"1001160087","drupalId":"4870","ESPORTSTMNT02":"200001674"},"socialNetworks":{"facebook":"https://www.facebook.com/ThuliosirT","twitter":"https://twitter.com/SirThulio","twitch":"https://www.twitch.tv/sirt"},"champions":[{"id":7,"playerId":419,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"},{"id":8,"playerId":419,"championId":59,"championKey":"JarvanIV","championName":"Jarvan IV","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"},{"id":9,"playerId":419,"championId":107,"championKey":"Rengar","championName":"Rengar","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"}],"liveGameTeam":267},{"id":578,"slug":"pekin-woof","name":"Pekin Woof","firstName":"Isaac","lastName":" Marconis","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pekin-woof-eqae2nyp.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T22:24:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2001","ESPORTSTMNT02":"200000742","TRLH1":"200000288"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":666,"slug":"rf","name":"RF Legendary","firstName":"Oleksii","lastName":"Kuziuta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rf-6o25dshw.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-03-08T20:07:05.000Z","bios":{"en_US":"","fr_FR":"<p>Oleksii « RF » Kuziuta (précédemment connu sous le nom de RF Legendary) a voleté sur la scène\n\nChallenger nord-américaine pendant plusieurs années avant d'entrer aux LCS NA en 2016 avec \n\nRenegades. La quantité de dégâts qu'il est capable d'infliger, notamment avec Rumble, fait de RF une \n\ncible prioritaire. Mais il refuse de tomber sans avoir combattu jusqu'au bout.</p>","pl_PL":"<p>Ten młody Ukrainiec, przed dołączeniem do LA Renegades w marcu 2015, był członkiem tylko w drugorzędnych zespołach.  Wiosenny sezon NA LCS 2016 będzie jego debiutem, aczkolwiek jest bardzo doświadczonym graczem, ponieważ oddaje się League of Legends od czasu wydania bety. W swoich pierwszych latach lubił grać Kog’mawem, lecz nie przyniosło mu to sławy. Zyskał uznanie w Kręgu Pretendenta za doskonałe opanowanie Nidalee. Sam wielokrotnie wyznawał swoją miłość do tej postaci, podkreślając, że kocha po równo wszystkie jej skiny. Spytany o powód wyboru właśnie Zwierzęcej Łowczyni odpowiada prosto: „Fajna do gry, fajna do oglądania, trudna do opanowania, ma wysoką szansę na ciekawe zagrania, a poza tym kto by nie chciał grać piękną dziewczyną z takim tańcem, która potrafi zamienić się w kota?” Aczkolwiek na top-lanie, w oczach przeciętnego gracza, nieziemsko radzi sobie każdym bohaterem. Do grona jego ulubionych postaci należy jeszcze Irelia i Renekton.</p>\n<p>\n\"RF Legendary\" jest znany z doskonałego kontaktu ze swoimi fanami. Nigdy ich nie zawodzi i zawsze odpowiada na ich pytania na portalach społecznościowych. Olbrzymie powodzenie wśród całego społeczeństwa League of Legends przyniósł mu film wrzucony do sieci, na którego stworzenie namówili go właśnie wielbiciele. W nim zaleca się do napotkanych w szkole dziewcząt i zachęca do wspólnego powrotu do domu. Przy tym, wymieniając swoje liczne zalety, wspomina, że osiągnął diament / krąg pretendenta w solo que. Śmiałość tego występu absolutnie pobiła rekordy oglądalności, ponieważ jego nagranie obejrzała zawrotna ilość widzów - ponad 500 tysięcy.</p>\n<p>\nW rozmowach z fanami wyjawił jak się czuje w związku z dostaniem się do NA LCS. \"RF Legendary\" grając w Challenger Series czuł się spełniony i szczęśliwy. Po kwalifikacji na szczebel wyżej jest zadowolony, że będzie miał okazję się wykazać na top-lanie i że inni gracze przestali uważać, że jest one-trick pony. Sam o sobie mówi, że jest marzycielem i miłośnikiem kawy. Dzięki temu, że Oleksii urodził się w Mariupolu, na Ukrainie, a dopiero potem przeniósł się do Stanów Zjednoczonych, potrafi mówić płynnie w trzech językach – ukraińskim, rosyjskim i angielskim. </p>\n"},"foreignIds":{"drupalId":"2567","ESPORTSTMNT02":"200000740","TRLH1":"200000286"},"socialNetworks":{"twitch":"http://www.twitch.tv/RfLegendary","youtube":"https://www.youtube.com/user/RFLegendary","facebook":"https://www.facebook.com/RFLegendarylol","twitter":"https://twitter.com/RF_Legendary"},"champions":[],"liveGameTeam":267},{"id":900,"slug":"baiano","name":"Baiano","firstName":"Gustavo","lastName":"Gomes","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/baiano-eiyzgkv9.png","hometown":"Bom Jesus da Lapa (BA)","region":"N/A","birthdate":"1994-04-09","createdAt":"2015-11-03T20:40:59.000Z","updatedAt":"2017-06-14T22:20:49.000Z","bios":{"pt_BR":"Antes de virar profissional, Baiano (ou Owning) era conhecido de longa data pelas filas ranqueadas, e chegou a cumprir um ano de suspensão pela prática de <em>elojob</em> antes de dar prosseguimento à sua carreira. O suporte tem uma visão de jogo apurada, e é quem normalmente faz as chamadas de jogadas da Keyd. Guerreiro, superou um tumor benigno no abdômen no começo de 2016 e retornou para ajudar a Keyd na campanha que culminou no vice-campeonato."},"foreignIds":{"ESPORTSTMNT02":"200000669","TRLH1":"200000291"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/owninglol","azubu":"http://www.azubu.tv/baiano","twitter":"https://twitter.com/baianolol1"},"champions":[{"id":356,"playerId":900,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"},{"id":357,"playerId":900,"championId":25,"championKey":"Morgana","championName":"Morgana","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"},{"id":358,"playerId":900,"championId":432,"championKey":"Bard","championName":"Bard","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"}],"liveGameTeam":267},{"id":1673,"slug":"wiggily","name":"Wiggily","firstName":"Raymond","lastName":"Griffin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wiggily-cpdmecou.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:36:52.000Z","updatedAt":"2017-03-08T20:07:21.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000741","TRLH1":"200000287"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1674,"slug":"fiku","name":"Fiku","firstName":"Noah","lastName":"Martin","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:37:14.000Z","updatedAt":"2017-03-08T20:07:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000668","TRLH1":"200000290"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":1676,"slug":"saber","name":"Saber","firstName":"Allen","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":"N/A","birthdate":null,"createdAt":"2017-01-11T02:20:03.000Z","updatedAt":"2017-03-08T19:46:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000763","TRLH1":"200000312"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1677,"slug":"maxtrobo","name":"Maxtrobo","firstName":"Maxime","lastName":"Delangis Gallichand","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxtrobo-ausozhqb.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T02:19:57.000Z","updatedAt":"2017-03-08T19:46:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000764","TRLH1":"200000313"},"socialNetworks":{},"champions":[],"liveGameTeam":266},{"id":1996,"slug":"reven","name":"Reven","firstName":"Sang-hyun","lastName":"Sung","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reven-ads3kdma.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T17:34:53.000Z","updatedAt":"2017-07-20T21:18:17.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001702","TRLH1":"200000710"},"socialNetworks":{},"champions":[],"liveGameTeam":266}],"scheduleItems":[{"id":"AVx_dGQSQMQFcjhwbQ68","content":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:match:ce231818-c9f7-4468-9a65-cb6f9a5abc8d","scheduledTime":"2017-06-08T21:00:00.794+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:bracket:0b471bd2-8c29-42c1-b21e-b6c89f25b55e","leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec"},"match":"ce231818-c9f7-4468-9a65-cb6f9a5abc8d","tournament":"885be032-14f9-45bc-bfae-71eecd0213ec","bracket":"0b471bd2-8c29-42c1-b21e-b6c89f25b55e","league":"4"}],"gameIdMappings":[{"id":"eb8f543e-7fec-4d08-90a6-693c083bd427","gameHash":"4084e5ef538a73de"},{"id":"c7a5896d-1301-444b-b636-c52d008b8d8d","gameHash":"0aacea505e260a25"}],"videos":[],"htmlBlocks":[],"match":{"id":"ce231818-c9f7-4468-9a65-cb6f9a5abc8d","name":"BIG-vs-TS","position":11,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"games":{"eb8f543e-7fec-4d08-90a6-693c083bd427":{"id":"eb8f543e-7fec-4d08-90a6-693c083bd427","name":"G2","generatedName":"BIG|TS|G2|ce231818c9f744689a65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}]],"timestamp":1496961759661,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"210125","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:210125","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"eb8e0aff-5b15-4951-9187-346cbd13239b":{"id":"eb8e0aff-5b15-4951-9187-346cbd13239b","name":"G3","generatedName":"BIG|TS|G3|ce231818c9f744689a65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c7a5896d-1301-444b-b636-c52d008b8d8d":{"id":"c7a5896d-1301-444b-b636-c52d008b8d8d","name":"G1","generatedName":"BIG|TS|G1|ce231818c9f744689a65","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"},{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}]],"timestamp":1496961775424,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"210095","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:210095","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49"}],[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}]],"timestamp":1496961759661,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"4a8fad7f-2368-494b-9013-b6577a5eabc6":0,"46f3c6c9-4d8c-4f1f-8635-307ef8e2de49":1}}}