{"teams":[{"id":163,"slug":"g2-esports","name":"G2 Esports","guid":"be6fe1a3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/g2-esports-cbnyfbkl.png","acronym":"G2","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-12-14T17:50:25.000Z","updatedAt":"2017-06-21T21:22:34.000Z","bios":{"de_DE":"<p>G2 Esports sind die unangefochtenen Könige von Europa. Nachdem sie durch die Challenger Series marschiert waren, um sich einen Platz in der EU LCS zu sichern, begannen sie mit ihrem aggressiven Spielstil die besten Mannschaften der Liga zu jagen. Sie machten mit ihren Gegnern kurzen Prozess, wie ein Kog’Maw am Ende des Spiels, und hatten dabei auch noch Spaß. Sie beendeten das Jahr 2016 als zweimalige Champions der EU LCS. Bei der Weltmeisterschaft 2016 mussten sie jedoch einen Dämpfer hinnehmen, als sie in der Gruppenphase nur einmal gewinnen konnten.</p>\n\n<p>2017 sind sie auf Rache aus. Mit ihrem unverkennbaren Selbstbewusstsein dominierten sie ihre Gruppe in der EU LCS und besiegten schließlich die Unicorns of Love im Finale. Beim Mid-Season Invitational 2017 machten sie Europa mit dem zweiten Platz hinter SK Telecom T1 stolz. Das bedeutet aber nicht, dass sie sich jetzt ausruhen können, denn der Sommer-Split steht vor der Tür.</p>\n\n<p>Cheftrainer: Joey „Youngbuck“ Steltenpool</p>\n<p>Mannschaftsleiter: Christopher „Duffman“ Duff</p>\n\n","en_US":"<p>G2 Esports are the undisputed kings of Europe. After wading through the EU Challenger Series to secure a spot in the EU LCS, they aimed their aggressive playstyle at the best teams in the league. They shredded their competition like a late-game Kog'Maw, and they had fun doing it. They finished 2016 as two-time EU LCS champs. But they were brought down a peg at the 2016 World Championship, where they only managed a single victory in the group stage.</p>\n\n<p>They set out for revenge to start 2017. With their signature swagger in tow, they dominated their group in the EU LCS and took down the Unicorns of Love in the finals. They did Europe proud at the 2017 Mid-Season Invitational, finishing second behind SK telecom T1. There's no time for a vacation, though; it's time for the summer split.</p>\n\n<p>Head Coach: Joey \"Youngbuck\" Steltenpool</p>\n<p> Team Manager: Christopher \"Duffman\" Duff</p>","es_ES":"<p>G2 Esports es el indiscutible rey de Europa. Después de su paso por la Challenger Series europea y de asegurar su participación en la LCS EU, aprovechó su estilo de juego agresivo contra los mejores equipos de la liga. Destrozó a sus competidores como lo hace un Kog'Maw al final de la partida y, encima, se divirtió haciéndolo. G2 acabó 2016 como campeón de la LCS EU en dos ocasiones, pero no cumplió las expectativas en el Campeonato Mundial 2016, en el que solo consiguió una única victoria durante la fase de grupos.</p>\n\n<p>Por eso, recibió el año 2017 sediento de venganza. Con su fanfarronería habitual, dominó su grupo en la LCS EU y machacó a Unicorns of Love en la final. Europa pudo sentirse orgullosa, ya que su equipo quedó segundo en el Mid-Season Invitational 2017, tan solo por detrás de SK Telecom T1. Ahora, no hay tiempo para descansar. El split de verano ya ha comenzado.</p>\n\n<p>Entrenador principal: Joey ''Youngbuck'' Steltenpool</p>\n<p>Jefe de equipo: Christopher \"Duffman\" Duff</p>\n","fr_FR":"<p>Les joueurs de G2 Esports sont incontestablement les rois d'Europe. Après s'être frayé un chemin à travers les Challenger Series EU pour décrocher une place dans les LCS EU, l'équipe a utilisé son style de jeu agressif contre les meilleures équipes de la ligue. Elle a mis en pièces la concurrence tel un Kog'Maw de fin de partie, et n'a pas caché son enthousiasme. Les membres de G2 Esports ont terminé 2016 comme les doubles vainqueurs des LCS EU. Mais ils ont été remis à leur place lors du Championnat du monde 2016, où ils n'ont remporté qu'une seule victoire durant la phase de groupe.</p>\n\n<p>En 2017, ils se sont lancés dans une campagne pour prendre leur revanche. Avec leur assurance coutumière, ils ont dominé leur groupe des LCS EU et éliminé les Unicorns of Love en finale. Ils ont ensuite fait la fierté de l'Europe au Mid-Season Invitational 2017 en terminant seconds derrière SK Telecom T1. Mais ce n'est pas le moment de prendre des vacances : le segment d'été est là !</p>\n\n<p>Entraîneur principal : Joey « Youngbuck » Steltenpool</p>\n<p>Responsable d'équipe : Christopher « Duffman » Duff</p>\n\n\n","pl_PL":"<p>G2 Esports są niekwestionowanymi królami Europy. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.</p>\n\n<p>2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Dali Europie powody do dumy na Mid-Season Invitational 2017, plasując się na drugim miejscu, zaraz za SK Telecom T1. Nie czas jednak na wakacje, pora na letni split.</p>\n\n<p>Główny trener: Joey „Youngbuck” Steltenpool</p>\n<p>Menedżer drużyny: Christopher „Duffman” Duff</p>\n\n","es_AR":"<p>G2 Esports encaró la Challenger Series EU y la promoción del torneo de apertura de la LCS EU 2016 para asegurarse un lugar en la LCS EU. La imagen original de G2 comandada por la enigmática estrella de EU, ocelote, se ha desvanecido con los años, y ahora su fama de agresivos es lo que los representa en la Grieta. Desde que llegaron a la LCS, todo ha sido amor (y dominación) a primera vista.</p>\n\n<p>G2 se abrió paso en el circuito competitivo EU como un Maestro Yi al final de partida, readaptándose para mejorar tras cada victoria. En especial, las grandes actuaciones de su carrilero central Luka \"Perkz\" Perković y del junglero Kang-yun \"Trick\" Kim fueron esenciales para que G2 ostentara el primer lugar en las eliminatorias del torneo de apertura de EU 2016. Después de sumar a la poderosa dupla de carriles inferiores de Jesper \"Zven\" Svenningsen y Alfonso \"Mithy\" Aguirre Rodríguez, G2 arrasó en el torneo de clausura y obtuvo su segundo título consecutivo de EU. El renovado equipo tiene una oportunidad de recuperar la gloria de Europa y se prepara para logar su objetivo final: la Copa del Invocador.</p>\n\n<p><strong>Entrenador: Joey \"Youngbuck\" Steltenpool</strong></p>","pt_BR":"<p>A G2 Esports gosta de ser a vilã da LCS UE. Depois da G2 Esports cambalear pela Série Desafiante da UE para garantir sua vaga na LCS UE, ela mirou seu estilo de jogo agressivo nas melhores equipes da liga. Eles destruíram a competição como um Kog’Maw no final do jogo e se divertiram com isso. Terminaram 2016 como vice-campeões da LCS UE. Mas caíram do pedestal no Campeonato Mundial 2016, quando só conseguiram uma única vitória na Fase de Grupos.</p>\n\n<p>Eles procuram vingança no início de 2017. Com seu jeito convencido de sempre, eles dominaram o seu grupo na LCS UE e derrotaram os Unicorns of Love na final. Como a melhor equipe da Europa, ela deverá recuperar sua reputação no Mid-Season Invitational 2017 mesmo que isso signifique não ter férias.</p>\n\n<p>Técnico: Joey \"Youngbuck\" Steltenpool\n</p>"},"foreignIds":{},"players":[85,496,497,809,959,1262,1706,2044],"starters":[496,497,809,959,1262],"subs":[85,1706,2044]},{"id":334,"slug":"mysterious-monkeys","name":"Mysterious Monkeys","guid":"d4e897b7-40bd-4e65-94b6-1f8ae531267f","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-3dr1fds.png","acronym":"MM","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/mysterious-monkeys-ftkht7hy.png","createdAt":"2017-05-23T21:16:39.000Z","updatedAt":"2017-07-30T12:57:14.000Z","bios":{"en_US":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","en_GB":"<p>Nobody knows quite what to expect from the Mysterious Monkeys. Formerly Misfits Academy, the team qualified for the EU LCS during the 2017 Summer Promotion tournament that saw Giants Gaming  and Origen lose their spots in the league. With the full Misfits Academy roster carrying over, the team is used to playing together. But as clear underdogs against established European teams, Mysterious Monkeys will have to evolve their play to survive.</p>\n\n<p>Head Coach: Peter \"Unlimited\" Georgiev</p>\n<p>Team Manager: Grant \"Grievance\" Rousseau</p>","es_ES":"<p>Nunca se sabe qué podemos esperar de Mysterious Monkeys. El equipo antes conocido como Misfits Academy se clasificó para la LCS EU durante el torneo de promoción de verano de 2017, en el que Giants Gaming y Origen perdieron sus puestos en la liga. Al mantener la plantilla entera de Misfits Academy, los jugadores están acostumbrados a jugar juntos. Para sobrevivir, Mysterious Monkeys tendrá que dar una vuelta a su estilo de juego ya que, contra equipos europeos sólidos, tienen todas las de perder.</p>\n\n<p>Entrenador principal: Petar \"Unlimited\" Georgiev</p>\n<p>Jefe de equipo: Grant \"Grievance\" Trousseau</p>\n","de_DE":"<p>Niemand weiß genau, was von den Mysterious Monkeys zu erwarten ist. Die Mannschaft, die früher als Misfits Academy bekannt war, hat sich im Sommer-Aufstiegsturnier 2017, bei dem Giants Gaming und Origen ihre Plätze in der Liga verloren haben, für die EU LCS qualifiziert. Da die gesamte Startaufstellung von Misfits Academy zur neuen Mannschaft gewechselt ist, sind es die Spieler gewohnt, zusammenzuspielen. Dennoch sind die Mysterious Monkeys gegen die etablierten Mannschaften klare Außenseiter, die sich weiterentwickeln müssen, wenn sie bestehen wollen.</p>\n\n<p>Cheftrainer: Petar „Unlimited“ Georgiev</p>\n<p>Mannschaftsleiter: Grant „Grievance“ Trousseau</p>\n","fr_FR":"<p>Personne ne sait trop à quoi s'attendre avec les Mysterious Monkeys. Anciennement Misfits Academy, l'équipe s'est qualifiée pour les LCS EU pendant le tournoi de promotion d'été 2017 qui a coûté leur place dans la ligue à Giants Gaming et Origen. La formation de Misfits Academy ayant été préservée, l'équipe a l'habitude de jouer ensemble. Mais en position évidente d'outsiders face à des équipes européennes établies, les Mysterious Monkeys vont devoir faire évoluer leur jeu s'ils veulent survivre.</p>\n\n<p>Entraîneur principal : Petar « Unlimited » Georgiev</p>\n<p>Responsable d'équipe : Grant « Grievance » Trousseau</p>\n","pl_PL":"<p>Nikt tak naprawdę nie wie, czego spodziewać się po Mysterious Monkeys. Drużyna znana wcześniej jako Misfits Academy zakwalifikowała się do EU LCS podczas turnieju o awans do letniego splitu 2017, który przyniósł klęskę i wypadnięcie z ligi Giants Gaming i Origen. Do drużyny przeniósł się cały skład Misfits Academy, więc zawodnicy są dobrze zgrani. Jednak powszechnie uznawani za chłopców do bicia dla pozostałych, uznanych drużyn europejskich, Mysterious Monkeys będą musieli podnieść poziom swoich umiejętności w grze, jeśli chcą przetrwać.</p>\n\n<p>Główny trener: Petar „Unlimited” Georgiev</p>\n<p>Menedżer drużyny: Grant „Grievance” Trousseau</p>\n"},"foreignIds":{},"players":[64,341,660,1333,1343,1574,1715,1863,1914,2082],"starters":[64,341,660,1333,1343],"subs":[1574,1715,1863,1914,2082]}],"players":[{"id":64,"slug":"amazing","name":"Amazing","firstName":"Maurice","lastName":"Stückenschneider","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazing-7k66ma5o.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:18.000Z","updatedAt":"2017-06-20T13:14:44.000Z","bios":{"en_US":"<p>Maurice \"Amazingx\" Stückenschneider's jungle prowess is known on both sides of the Atlantic. Amazing rose to fame when he played a key role in the Copenhagen Wolves' promotion to the EU LCS in late 2013. He then hopped across the pond and spent a brief stint in North America with Team SoloMid, helping lead the team to the 2014 World Championship Quarterfinals. At the end of the season he returned to Europe to join Origen's starting roster in the EU Challenger Series, where he easily earned a berth into the EU LCS. A lifelong basketball player, Amazing's competitive nature drives him to dominate the map and make plays for his team.</p>\n\n<p>After the struggles mounted for Origen in 2016, Amazing left the team at the end of the year and became part of the Fnatic organization shortly after. Amazing fell short of his lofty promises for Origen last year and will make sure that the same doesn’t happen this year. An explosive player on the Rift, Amazing still has the ability to take over games at a moment’s notice. A change of scenery may be just what was needed in order to rekindle Amazing’s in-game fire.</p>","de_DE":"<p>Maurice „Amazingx“ Stückenschneiders Fähigkeiten im Dschungel sind auf beiden Seiten des Atlantiks bekannt. Amazing wurde bekannt, als er beim Aufstieg der Copenhagen Wolves in die EU LCS Ende 2013 eine entscheidende Rolle spielte. Daraufhin überquerte er den großen Teich und half Team SoloMid dabei, das Viertelfinale der Weltmeisterschaft 2014 zu erreichen. Am Ende der Saison kehrte er nach Europa zurück, um Origen dabei zu helfen, die europäische Challenger Series zu gewinnen und wieder in die EU LCS aufzusteigen. Amazing spielt schon sein ganzes Leben lang Basketball und seine Wettkampfmentalität verleitet ihn dazu, die Karte zu dominieren und seine Mannschaft mit seinen Spielzügen zu unterstützen.</p>\n\n<p>Nachdem die Probleme für Origen 2016 immer größer geworden waren, verließ Amazing die Mannschaft Ende des Jahres und wechselte kurz darauf zu Fnatic. Amazing konnte seine stolzen Versprechungen letztes Jahr bei Origen nicht umsetzen und er wird alles dafür tun, dass ihm das in diesem Jahr nicht wieder passiert. Er ist in der Kluft brandgefährlich und kann Spiele von einem Augenblick zum anderen an sich reißen. Ein Tapetenwechsel könnte genau das Richtige gewesen sein, um Amazings Funken erneut zu entfachen.</p>","es_ES":"<p>Nadie pone en cuestión que Maurice ‘Amazingx’ Stückenschneider tiene un don para jugar a League of Legends al máximo nivel, pero el alemán es además un abanderado del trabajo duro, algo que aprendió de Kobe Bryant, su ídolo baloncestístico. Puede que esta mentalidad traicione a su apodo, para el cual se inspiró en la canción de Kanye West con la que comparte título, pero es lo que le ha llevado al éxito.</p>\n\n<p>Aunque en un primer momento Amazing desestimó el juego de Riot Games debido a su estética, la insistencia de su hermano acabó pasando factura y el germano se inició como tirador. No obstante, al igual que en otros títulos a los que había jugado antes, su deseo de tener un mayor impacto en las partidas le llevó a la jungla. Udyr, Shyvana y sobre todo Lee Sin fueron los personajes que utilizó para escalar posiciones en el ránking.</p>\n\n<p>Sus 2 800 puntos de ELO al término de la segunda temporada hicieron que Team Acer se hiciera con sus servicios para acceder a la primera edición de la LCS EU. Ante el fallido intento Amazing abandonó la organización y deambuló sin éxito por varios equipos durante el siguiente año, lo que estuvo a punto de provocar su retirada.</p>\n\n<p>Sin embargo, la salida de Ilyas ‘Shook’ Hartsema dejó una vacante en Copenhagen Wolves que el jungla alemán ocupó. La organización danesa se hizo con un puesto en el split de primavera de la LCS EU 2014 a través del Torneo de Promoción, en el que derrotó a Meet Your Makers sin complicaciones. Amazing, que necesitó casi dos años para ingresar en la máxima liga continental, aprovechó la ocasión para convertirse en una de las revelaciones.</p>\n\n<p>Su destreza con Lee Sin, Elise y Evelynn fue un problema que en ocasiones los rivales no pudieron resolver. El equipo tenía carencias evidentes, pero las buenas actuaciones de Amazing y Konstantinos ‘FORG1VENGRE’ Tzortziou permitieron una modesta participación en los Playoffs.</p>\n\n<p>Pero fue en verano cuando Amazing encontró su oportunidad de oro. Team SoloMid buscaba un recambio para Brian ‘TheOddOne’ Wyllie y el alto nivel mecánico del alemán le convirtió en el mejor candidato. Reemplazar a una leyenda de la organización norteamericana más popular no fue sencillo y al principio Amazing lo pasó mal debido a su escaso repertorio de campeones. Para anularle, los contrincantes bloqueaban varios personajes del jungla, que en una ocasión se vio obligado a seleccionar a Volibear para desgracia de sus aliados. Pese a todo, Amazing fue el jugador más valioso de la cuarta semana y Team SoloMid recuperó la corona que Cloud9 le había arrebatado.</p>\n\n<p>El Campeonato Mundial 2014, en el que se enfrentó a junglas de la talla de Choi ‘DanDy’ In-kyu, le ayudó a llevar su juego al siguiente nivel. Deseoso de regresar a Europa, Amazing aprovechó la oferta de Enrique ‘xPeke’ Cedeño y se unió a Origen, donde se ha asentado como uno de los mejores del continente en su posición con actuaciones sólidas, sobre todo con Gragas.</p>","fr_FR":"<p>Maurice « Amazingx » Stückenschneider est un jungler dont la carrière professionnelle débute en janvier 2014, lorsqu’il se qualifie aux League of Legends Championship Series avec l’équipe Copenhagen Wolves. Connu pour avoir un style de jeu agressif, l’Allemand s’illustre principalement avec Lee Sin pendant le segment de printemps, exposant des mécaniques de jeu solidement rodées. Malheureusement pour lui, cette première aventure en LCS s’avère infructueuse. Après avoir obtenu la 6e place sur 8 lors de la saison régulière, Amazing et son équipe finissent dernier des play-offs et sont contraints de passer par le tournoi de promotion pour conserver leur place en LCS. Après avoir réussi cette entreprise, Amazing reçoit une proposition d’outre-Atlantique : l’équipe Team SoloMid veut s’offrir ses services suite au départ du « Général OddOne ». Amazing accepte l’offre et devient l’un des premiers joueurs européens à s’expatrier aux États-Unis.</p>\n\n<p>Il y retrouve le mid laner danois Søren « Bjergsen » Bjerg, également passé par la case Copenhagen Wolves et trouve une certaine complicité avec ce dernier. Malgré de bons résultats, certains observateurs accusent Amazing d’être trop dépendant de Lee Sin et Elise, ses deux champions les plus joués et les seuls à avoir des ratios de victoires convainquant (respectivement 78% et 89%). Néanmoins, en plus d'être un joueur à la technique aiguisée, Amazing se révèle être un excellent tacticien, ce qui vaudra à son équipe la 3e position de la saison régulière. Auteur de très belles parties avec Nunu et Kha’Zix, le jungler mène son équipe à la première place de la saison estivale des LCS NA.</p>\n\n<p>Au Mondial 2014, TSM réussit à sortir du groupe B à la 2e place, puis s’incline en quart de finale face aux futurs champions du monde, réussissant tout de même à sauver l’honneur lors de la troisième partie. Amazing décide par la suite de quitter TSM pour retrouver son Europe natale. Début décembre, il rejoint les rangs d’Origen, une nouvelle structure dont la première ambition est d’accéder aux LCS via les Challenger series. Le pari est tenu et Amazing se qualifie pour la seconde fois. Contrairement à sa première expérience européenne, celle-ci s'avère fructueuse.</p>\n\n<p>Avec le temps et les patchs, la méta de la jungle a évolué. En 2015, les champions résistants font leur retour en force. Amazing s’en accommode très vite et brille particulièrement avec Rek’Sai et Gragas. Son niveau de vision de jeu est très vite remarqué tant sa présence sur la carte est percutante. En duo avec son support Alfonson « Mithy » Aguirre Rodriguez, Amazing réussi à contrer les initiatives adverses et à prendre le contrôle de la vision dans un nouveau style d’agressivité. Ces performances permettent à son équipe de se hisser à la 2e place de la saison estivale des LCS EU et d’obtenir la 2e place des play-offs. Au mondial 2015, Amazing rivalise avec les meilleurs, guidant son équipe jusqu’en demi-finale.</p>","pl_PL":"<p>Pochodzący z Bocholt w Niemczech, Maurice Stückenschneider to zawodnik, którego sława wciąż rośnie. Pierwszy raz zanurzył się w wirtualny świat gier w wieku pięciu lat, dając się porwać starym grom na konsole. Przez parę kolejnych lat nie ciągnęło go do klawiatury i myszki, zdecydowanie bardziej wolał zostać przy padzie. Dopiero w 2010 roku skusił się na grę na komputerze, z okazji wzięcia udziału w wydarzeniach związanych z ESL. Pierwotnie League of Legends odrzucało Maurice’a ze względu na grafikę podobną do kreskówek. Dopiero jego brat nakłonił go do tego, żeby spróbował w nią zagrać.</p>\n<p>\nSwój debiut w świecie Runeterry \"Amazing\" rozpoczął od fascynacji postaciami AD Carry. Po pierwszym sezonie zmienił swoje upodobania. Jego zainteresowanie skupiło się na Jungli, ponieważ chciał mieć większy wpływ na grę. Grając Udyrem, Shyvaną i Lee Sinem udało mu się osiągnąć zawrotny wynik 2,8 tysiąca Elo w drugim sezonie. Jego progres nie umknął uwadze sporej ilości drużyn, po wielu perypetiach skorzystał z oferty Copenhagen Wolves. Z tą drużyną miał okazję pierwszy raz pokazać się na EU LCS, lecz wiosenny sezon 2014 z tą drużyną skończył się na meczach relegacyjnych.  \"Amazing\" odszedł z CW, ale w międzyczasie jego sława zdążyła dotrzeć aż za ocean. Został doceniony przez powszechnie znaną drużynę Team SoloMid. Pomimo powszechnej krytyki jego małego zasobu bohaterów,  wykorzystał swoje umiejętności z tym zdecydowanie lepszym w tym czasie zespołem. Efektem tego było pierwsze miejsce w letnim sezonie 2014, gwarantujące drużynie miejsce na Mistrzostwach Świata 2014. 11 października tego samego roku Maurice odszedł z TSM, powołując się na sprawy rodzinne i wrócił do swojej ojczyzny.</p>\n<p>\n\"Amazing\" na początku swojej kariery w Jungli wzorował się na Danilu \"Diamondprox\" Reshetnikovie, bardzo sugerując się bohaterami, których Rosjanin wybierał. Jednak ostatecznie ulubionymi bohaterami Maurice’a są: Xin Zhao, Shyvana, Lee Sin i Nautilus. Duży wpływ na niego miały też gwiazdy z innych dziedzin. Ze względu na to, że w przeszłości grał zawodniczo w koszykówkę, jednym z jego idoli jest Kobe Bryant, a ulubioną drużyną Los Angeles Lakers. Stąd też wywodzi swoje motto: „Ciężka praca pokonuje talent”. Cieszy swoich fanów aktywnością na Twitterze, gdzie lubi narzekać na sprawy, które go irytują. Mocny charakter Maurice’a widać także w rozmowach z nim. W wywiadzie przed półfinałem Mistrzostw Świata 2015 powiedział „Nie boję się SKT T1”.\n</p>","pt_BR":"<p>\nA fama de Amazingx vem dos dois lados do Atlântico. Ele apareceu no cenário quando subiu com a Copenhagen Wolves para a LCS em 2013. Então ele cruzou o oceano e jogou por um tempo na TSM, ajudando a levar o time até as quartas de final. No final da temporada, ele voltou para a Europa e se juntou à Origen para disputar a Série Desafiante da LCS EU.</p>\n<p>\nEle jogou basquete por muitos anos, e sua natureza competitiva o motiva a dominar o mapa e fazer jogadas para o time. Ele teve lampejos de genialidade ao longo da carreira, mas seu desempenho se consolidou como nunca na Origen. Qual o próximo passo? Amazing só consegue pensar no Mundial. E você vai dizer que ele está errado?</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">정글러로서 Maurice \"Amazingx\" Stückenschneider 선수의 실력은 북미와 유럽 양쪽에서 유명합니다. Amazing 선수는 Copenhagen Wolves의 2013년 말 유럽 LCS 승급에 결정적인 역할을 하며 이름을 널리 알렸죠. 그리곤 대서양을 건너 북미에서 잠시 Team SoloMid에 합류해 2014년 월드 챔피언십 8강까지 진출하는 데 톡톡한 공을 세웠습니다. 그리고 시즌이 끝난 후 유럽으로 돌아와 Origen의 창단 멤버로 유럽 Challenger 시리즈에 출전했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">어릴 때부터 농구를 해온 덕에 지기 싫어하는 면모가 있어 경기를 할 때도 맵을 장악하고 플레이 메이커 역할을 하는 모습을 쉽게 볼 수 있습니다. 선수 생활을 시작할 때부터 뛰어난 실력을 계속 보였던 Amazing 선수이지만 훨씬 꾸준한 모습을 보여준 건 Origen에 합류하면서부터였습니다. Origen의 데뷔 시즌인 2015년, 월드 챔피언십에서 준결승까지 올라갔으니 올스타의 반열에 드는 게 당연해 보입니다. Amazing 선수가 앞으로 어떤 행보를 보일지 매우 기대됩니다. </p>\n","el_GR":"","es_AR":"","ro_RO":"","es_MX":"","tr_TR":"","en_PL":"","ru_RU":"","it_IT":"","en_GB":"","hu_HU":"","cs_CZ":""},"foreignIds":{"drupalId":"1102","TRLH3":"200000056","TRLH4":"200000159"},"socialNetworks":{"azubu":"azubu.tv/amazing","facebook":"https://www.facebook.com/amazinglolx?fref=ts","twitter":"https://twitter.com/Amazing_EU"},"champions":[],"liveGameTeam":334},{"id":85,"slug":"loulex","name":"Loulex","firstName":"Jean","lastName":"Burgevin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/loulex-68t6tctj.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-06-09T11:20:25.000Z","bios":{"en_US":"","fr_FR":"<p>Relativement nouveau sur la scène compétitive, Jean « Loulex » Burgevin a fait ses débuts dans les LCS à la Wembley Arena de Londres en 2014, remplaçant pour l'occasion le jungler de Gambit Gaming. Loulex a gagné en assurance et en nonchalance quand il est passé des files solo à l'une des scènes d'e-sport les plus compétitives au monde. Loulex a ensuite rejoint H2K pour le segment d'été des LCS EU 2015.\n</p>\n<p>\nLoulex excelle dans le rôle de jungler-support, et Gragas a été son champion de prédilection tout au long du segment d'été des LCS européennes 2015. Sa capacité à utiliser l'Agitateur de différentes façons sert parfaitement les besoins d'H2K. Besoin d'un gros gaillard capable d'absorber les dégâts ? De quelqu'un qui prépare le terrain pour des carrys trop fragiles ? D'un téméraire capable de foncer sur la ligne arrière de l'ennemi ? Avec Loulex, vous avez les trois à la fois ! \n</p>","pl_PL":"<p>Jean „Loulex” Burgevin to stosunkowo nowy gracz na scenie e-sportowej. Jego debiut w LCS miał miejsce w 2014 r., kiedy na londyńskiej Wembley Arena wystąpił jako zastępczy dżungler drużyny Gambit Gaming. Loulex podkręcił swą pewność siebie do maksimum, przenosząc się z rozgrywek solowych do jednej z najbardziej wymagających lig e-sportowych na świecie. Do drużyny H2K dołączył przed europejskimi letnimi rozgrywkami LCS 2015.\n</p>\n<p>\nNajlepiej sprawdza się w roli wspierającego dżunglera. Podczas letnich rozgrywek jego najlepiej ogranym bohaterem okazał się Gragas. W rękach Loulexa Karczemny Zabijaka zwycięża na kilka różnych sposobów, co szczególnie dobrze wpisuje się w styl gry drużyny H2K. Czasem potrzeba kogoś dużego, kto osłoni resztę. Czasem ktoś musi odciągnąć uwagę wroga od słabiutkich prowadzących. Innym razem najbardziej przyda się wojownik siejący zniszczenie na tyłach przeciwnika. Loulex doskonale odnajduje się w każdej z tych ról! \n</p>","de_DE":"<p>Als relativer Neuling zur professionellen Szene machte Jean „Loulex“ Burgevin sein LCS Debüt in der Wembley Arena in London 2014 als Jungle Vertretung für Gambit Gaming. Loulex bog sein Selbstvertrauen und seine zurückhaltende Art auf Stufe 11 als er von der Solo Rangliste in einer der kompetitivsten eSports Ligen der Welt schoss. Loulex fuhr damit fort H2K für den 2015 EU LCS Sommer Split beizutreten. </p>\n\n<p>Loulex übertrifft sich als unterstützender Jungler mit Gragas als zuverlässigster Champion durchgehend im 2015 EU LCS Sommer Split. Seine Fähigkeit den Unruhestifter in verschiedenen Formen einzusetzen passt H2Ks kompositionellem  Wünschen besonders gut. Brauchst du einen großen Körper um dich wie großes Schild aus Fleisch zu benehmen? Wie wäre es mit jemandem der Peel für deine schwachen Carries ermöglicht? Oder jemand der mit rücksichtsloser Hingabe in die gegnerische Backline eintaucht? Mit Loulex kannst du alle drei Dinge haben! </p>\n","es_ES":"<p>Un jugador relativamente nuevo en el panorama competitivo, el debut de Jean “Loulex” Burgevin en la LCS tuvo lugar en el Wembley Arena de Londres en 2014 como jungla reserva para Gambit Gaming. Y no defraudó, con la confianza en sí mismo que le caracteriza deslumbró en el salto desde la SoloQ hasta una de las ligas más competitivas del mundo. Loulex se unió a la plantilla de H2K para el Split de verano de la LCS EU 2015. </p>\n\n<p>Loulex brilla como un jungla apoyo, teniendo en Gragas a su campeón más fiable durante el Split de verano de la LCS EU 2015. Su habilidad para usar al Camorrista en multitud de situaciones le hace ser un muy buen complemento a las necesidades de H2K. ¿Necesitas algún tipo grande para actuar como escudo? ¿Qué tal alguien que separe a tus enemigos de tus aliados? ¿O por qué no alguien lo suficientemente temerario para lanzarse contra el equipo contrario sin ningún tipo de reparos? Con Loulex, ¡Tienes a los tres! </p>\n","pt_BR":"<p>Loulex é um talento das filas ranqueadas, ainda relativamente novato no cenário competitivo. Sua estreia na LCS foi como substituto do caçador da Gambit Gaming em 2014 na Arena Wembley, em Londres. Ele se juntou à H2K para a temporada de verão da LCS EU 2015. \n</p>\n<p>\nEle é um caçador de apoio, sendo Gragas seu Campeão mais confiável ao longo da temporada de verão da LCS EU 2015. Sua versatilidade com o Badernista encaixa muito bem com as necessidades de composição do time. Você precisa de uma muralha para segurar o time inimigo? Ou alguém pra atacar os carregadores? Por que não alguém para mergulhar na retaguarda rival sem medo de ser feliz? Com Loulex, você pode ter tudo isso.</p>"},"foreignIds":{"drupalId":"2781","TRLH3":"200000231","TRLH4":"200000083","ESPORTSTMNT02":"200001005"},"socialNetworks":{"twitch":"www.twitch.tv/l0ulex","twitter":"https://twitter.com/loulexd"},"champions":[],"liveGameTeam":163},{"id":341,"slug":"kikis","name":"Kikis","firstName":"Mateusz","lastName":"Szkudlarek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kikis-9px5rew4.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-06-20T13:17:06.000Z","bios":{"en_US":"<p>\nMateusz “Kikis” Szkudlarek launched his esports career in 2012 with MeetYourMakers. Kikis spent several years battling it out in the EU Challenger scene before breaking into the EU LCS in 2015 with the Unicorns of Love. He later moved to G2 Esports, helping them to qualify for the EU LCS while also moving out of the jungle and into the top lane.\n</p>\n<p>\nKikis acclimated quickly to the top lane as G2 consistently unraveled opponents leading to a 1st place finish in the 2016 EU LCS Spring Split. After parting ways with G2, Kikis found his way to another top European team: Fnatic. The burden of high expectations lies squarely on Kikis’ shoulders -- but that’s something that he (and his scarves) are used to.\n</p>","de_DE":"<p>Der erste Gedanke, der dabei vermutlich gerade durch den Kopf geht ist „Moment einmal, ist der nicht Jungler?“. </p>\n\n<p>Naja, er war es schließlich vor nicht allzu langer Zeit einmal. Heute ist Mateusz „Kikis“ Szkudlarek, wie ihr schon richtig gelesen habt, der Top-Laner bei G2 Esports. Doch wusstet ihr auch, dass Kikis Karriere eigentlich als Top-Laner begann? Wirklich bekannt wurde der Pole erst mit seinem Durchbruch in die EU LCS mit Unicorns of Love, als er mit seinen Teamkameraden sich durch die EU Challenger Series für die europäische Erstliga qualifizierte. Sein Weg begann jedoch schon weit in der Vergangenheit, nämlich zum Zeitpunkt, als League of Legends gerade in die erste Saison der kompetitiven Szene startete. 2011 schafften Kikis und seine Mannschaft exGameburg Team sich einen Platz in seinem ersten internationalen Turnier, die 2011 World Cyber Games, zu ergattern. Gastgeber war das prestigeträchtige Najin e-mFire, welches durch die Hand des europäischen Teams fiel. Kikis Team schlug ebenso die nordamerikanische Mannschaft Counter Logic Gaming und schaffte es bis ins Finale gegen Chicks Dig ELO, ein Team bestehend aus einer Mischung aus späteren Team SoloMid- und Counter Logic Gaming-Spielern.</p>\n\n<p>Nach der Silbermedaille schlug sich der stilhafte Schal-Connaisseur für drei Jahre durch verschiedene Mannschaften, darunter auch namhafte Organisationen wie MeetYourMakers, mousesports und Team ROCCAT. Als Teil von EloHell spielte er in der regionalen KO-Phase Europas der zweiten Saison, schied allerdings bereits im Vierteilfinale aus. Ende 2013 wechselte Kikis in die Jungle-Rolle und begann für einige Mannschaften der EU CS zu spielen, in der Hoffnung eines Tages den Schritt nach ganz oben zu schaffen. </p>\n\n<p>Mit UOL kam der Durchbruch und auch der massive Strom an Fans, vor allem durch die verrückten Champions, die Kikis in den wichtigsten Spielen seiner Mannschaft auspackte. Mal war es Udyr und ein anderes Mal Gnar, beides Champions, welche wohl kein anderer Jungler der Welt sich trauen würde anzufassen. Besonders nicht im Halbfinale der EU LCS Spring 2015. Da fragt man sich, wie viel Vertrauen seiner Mannschaft sich Kikis verdient haben muss und wie viel Mut man braucht, um eine solche Aktion durchzuziehen. </p>\n\n<p>Im Laufe der folgenden Sommersaison entschied sich der Pole wegen seiner mangelhaften Leistung die Mannschaft zu verlassen und es mit einem Neuanfang bei Gamers2 zu versuchen. Der Wechsel auf die Top-Lane fand schließlich nach einer erfolgreichen Qualifikation für die Rückkehr in die LCS statt, als er seine neuen Jungler Kang-yoon „Trick“ Kim willkommen hieß. </p>\n","fr_FR":"<p>S’il existait un concours du joueur à avoir parcouru le plus d’équipes dans sa carrière, Mateusz « Kikis » Szkudlarek en serait sûrement le grand favori. Le Polonais a déjà porté les couleurs de plus de 20 équipes en 5 années, tantôt en toplane, tantôt en jungle et parfois même en midlane. Alors qu’il n’a que 15 ans, Kikis commence la compétition et participe à des dizaines de tournois. Les résultats sont parfois au rendez-vous, comme quand il envoie au tapis une équipe coréenne en 2011 et obtient la 2e place du tournoi international World Cyber Game ou quand il remporte la Gamers Assembly 2012 face à des équipes européennes comme Counter Logic Gaming Europe.</p>\n\n<p>En 2014, Kikis participe à la première édition des Challenger Series de printemps, mais son équipe Pulse Esports est rapidement éliminée. La seconde édition est davantage un succès. Avec Denial eSports, le Polonais parvient à accrocher la 3e place des play-offs et décroche ainsi son ticket pour le tournoi de promotion. Malheureusement, le joueur et son équipe s’inclinent face à l’équipe sortante, Copenhagen Wolves et échouent à la porte des League of Legends Championship Series. </p>\n\n<p>La saison estivale des Challengers Series de Kikis suit le même schéma : élimination précoce lors de la première édition, accès au tournoi de promotion avec SK Gaming Prime — une équipe différente — lors de la seconde puis échec face à l’équipe issue des LCS, cette fois-ci Gambit Gaming. Finalement, Kikis rejoint une équipe qui, elle, est parvenue à se qualifier aux LCS : Unicorns of Love.</p>\n\n<p>C’est dans cette structure que Kikis connaît ses plus grands succès. Aussitôt arrivé dans le club très fermé des licornes capables de tenir une souris, aussitôt il dispute une compétition internationale : les Intel Extreme Masters San Jose. Le Polonais, dans tout son art, innove comme personne. Face à Team SoloMid, il invoque Twisted Fate jungle et se saisi de l’enchantement Dévoreur, avec lequel il connaît un grand succès et marque les esprits. UoL parvient finalement à se hisser en finale, où l’équipe s’incline face à Cloud9. En LCS, Kikis se montre au niveau et tient tête aux meilleurs. Son équipe se hisse à la très correcte 5e place de la saison régulière. Aux play-offs, il étonne à nouveau en jouant un Shaco très convainquant face à Gambit Gaming. En demi-finale face à SK Gaming, le premier de la saison régulière, il sélectionne Gnar jungle et participe à la victoire de son équipe. La belle aventure se termine sur une finale très serrée dont Fnatic est le seul vainqueur. </p>\n\n<p>Avant la fin de la saison régulière d’été, Kikis quitte Unicorns of Love et rejoint Gamers2. Il aide l’équipe à se hisser à la 3e place des Challengers Series puis contribue à la qualifier aux LCS en s’imposant face à SK Gaming. Depuis, le joueur a cédé sa place de jungler et est retourné à ses premiers amours : la voie du haut.</p>\n","es_ES":"<p>Mateusz “Kikis” Szkudlarek comenzó su carrera de esports el año 2012 junto a MeetYourMakers. Kikis pasó varios años junto a los jugadores europeos de nivel Aspirante hasta que por fin se abrió paso a la LCS en 2015 con los Unicorns of Love. Sus actuaciones con Nidalee y Nunu son dominantes, y el marcador de juego con sus junglas preferidos en el split de primavera ha sido de 6V-2D. Como homenaje al estilo poco ortodoxo de UOL, incluso se atrevió con Shaco una vez a pesar de que muchos consideran que el campeón no es jugable actualmente.</p>\n<p>Kikis pasó de UOL a G2 Esports en 2015, y su debut para el equipo ayudó a G2 a clasificarse para la LCS EU. Este 2016, Kikis ha pasado de la jungla a la calle superior de G2. Solo hay una explicación: ha llegado el momento de desatar el poder de Shaco en la calle superior (o eso esperamos).</p>","pl_PL":"<p>Mateusz bezsprzecznie należy do grona najpopularniejszych polskich zawodników. Równolegle wybija się zdolnościami wśród innych graczy na arenie międzynarodowej. Mało kto może się pochwalić taką wprawą jak „Kikis” na profesjonalnej scenie, gdyż jest jej częścią od początku pierwszego sezonu. Do tego przyczyniło się członkostwo w ponad 20 różnych, bardziej lub mniej znanych, drużynach. Takie doświadczenie, zyskane podczas wspólnej gry z graczami z całej Europy, jest unikatowe na skalę światową. </p>\n<p>Podczas swojej długiej kariery w League of Legends „Kikis” zgromadził mnóstwo imponujących trofeów. Pierwszym znaczącym sukcesem było drugie miejsce na Samsung Euro Championship 2011. Wyjątkowość tego wydarzenia polegała na pokonaniu zespołów reprezentujących Kanadę i Koreę – Counter Logic Gaming i Najin e-mFire. Dla polskiej reprezentacji i Mateusza to był debiut w rozgrywkach na najwyższym poziomie. Po doskonałym starcie do sezonu czwartego „Kikis” brał udział w gigantycznej ilości wydarzeń różnej rangi – od regionalnych turniejów po światowe imprezy jak IEM w San Jose. W międzyczasie cały czas próbował swoich sił w Challenger Series grając w rozmaitych zespołach, jak na przykład: Denial eSports i Lublin Shore. Niestety przeważnie kończył na czwartym miejscu, bez możliwości walki o wejście do kolejnego etapu. Kwalifikacja do turnieju promocyjnego udała mu się dopiero w szeregach SK Gaming Prime, lecz na jego drodze do EU LCS stanął legendarny już zespół Gambit Gaming. „Kikis” poniósł porażkę w starciu z potęgą czerwonej gwiazdy, lecz ostatecznie i tak zagrał w wiosennym sezonie EU LCS 2015. Szansę na pokazanie się zawdzięcza ofercie of Unicorns Of Love, która przyjęła go do głównego składu z szeroko rozłożonymi ramionami. Ten okres przyniósł wiele sukcesów Mateuszowi. W grudniu 2014 roku zajął drugie miejsce na wielkim wydarzeniu – IEM w San Jose, ulegając tylko Cloud9. Natomiast w wiosennym sezonie zespół UOL zajął piąte miejsce, lecz podczas rozgrywek barażowych pokazał pazur. „Kikis” i jego ekipa pokonali Gambit Gaming i zajmujący pierwsze miejsce SK Gaming. Zostali pokonani dopiero w finale w bardzo wyrównanej batalii przeciwko Fnatic z wynikiem 3:2.</p>\n<p>„Kikis” gra profesjonalnie zarówno w jungli jak i na top-lanie, w zależności od potrzeb swojego zespołu. Uwielbia grać Lee Sinem, Shenem i Elise, lecz potrafi pozytywnie zaskoczyć widzów każdym bohaterem. Najgłośniejszym zagraniem Mateusza był doskonały gank Udyrem na drugim poziomie w meczu przeciwko Gambit Gaming podczas wiosennych rozgrywek barażowych. Większość analityków jest zgodna, że „Kikis” to gracz absolutnie nieszablonowy, co jest jego największą zaletą. Tymczasem fani kochają go za prostolinijność, ponieważ nigdy nie wstydził się mówić, tego co naprawdę czuje. Dlatego posiada szczerze oddane grono wielbicieli, którzy podążają za nim, kiedy przenosi się do kolejnych zespołów.</p>\n","es_AR":"<p>Mateusz 'Kikis' Szkudlarek comenzó su carrera en los Esports en 2012 con MeetYourMakers. Kikis pasó varios años peleando en la escena del Challenger de la UE antes de iniciarse en la LCS de la UE en 2015 con los Unicorns of Love. Es mejor conocido por sus actuaciones dominantes usando a Nidalee y Nunu, sus jungleros favoritos, y por mantener un récord de 6 ganados contra 2 perdidos durante el curso del Torneo de Primavera de 2015 de la LCS de la UE. Y en una ocasión, con un estilo poco convencional para UOL, llegó a usar a Shaco; un campeón que muchos consideran injugable en competencias profesionales.</p>\n\n<p>Kikis pasó de UOL a G2 eSports en 2015 y, su debut en el equipo, les permitió calificar para la LCS de la UE. Kikis realizó otro movimiento en 2016, al salir de la jungla para entrar al carril superior de G2. Solo puede haber una explicación para esto: es la hora del terror Iluminati del carril superior conocido como Shaco el Muñeco Sorpresa (eso esperamos).</p>"},"foreignIds":{"drupalId":"1469","TRLH3":"200000263","TRLH4":"200000315","TRLT3":"35063","TRLH2":"1001250015","FRA1TMNT2":"25428"},"socialNetworks":{"twitch":"www.twitch.tv/kikis1205","facebook":"www.facebook.com/MSkikis","twitter":"https://twitter.com/kikis1205"},"champions":[],"liveGameTeam":334},{"id":496,"slug":"niels","name":"Zven","firstName":"Jesper","lastName":"Svenningsen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/niels-d9lahq8w.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:43:57.000Z","bios":{"en_US":"<p>Jesper \"Zven\" Svenningsen is the ticking time bomb in G2's arsenal. If the rest of the team hasn't built a lead early, all they need to do is wait for Zven to pop off. The Danish ADC began his career with Origen before making the jump to G2 for the 2016 EU LCS Summer Split. His late-game potential doesn't come with a deficit in the early game, either, as he's able to build substantial leads in the bot lane.</p> <p>While Zven and his support mithy came into the 2016 World Championship ranked among the best, their performance was lackluster at best. He redeemed himself along with the rest of G2 at the 2017 Mid-Season Invitational,\n where the team finished second behind SK telecom T1.</p>","fr_FR":"Jesper « Zven » Svenningsen est la bombe à retardement de l'arsenal de G2. Si ses équipiers ne prennent pas la tête en début de partie, ils n'ont qu'à attendre que Zven explose. L'ADC danois a commencé sa carrière chez Origen avant de rejoindre G2 pour le segment d'été des LCS EU 2016. Son potentiel en fin de partie n'est cependant pas absent en début de partie, où il est capable de prendre une avance considérable sur la voie du bas.\n\nZven et son support Mithy étaient classés parmi les meilleurs à leur entrée dans le Championnat du monde 2016, mais leur performance a été sans éclat. Avec cette nouvelle opportunité de défier le monde au Mid-Season Invitational 2017, son objectif sera de combler les nombreuses attentes qui ont été placées en lui. Une chose est sûre – si on veut battre G2, il ne faut pas oublier Zven.\n","pl_PL":"Jesper „Zven” Svenningsen to tykająca bomba zegarowa w arsenale G2. Jeśli reszta drużyny nie zdobędzie wczesnej przewagi, musi tylko poczekać, aż Zven ruszy do akcji. Duński prowadzący rozpoczął swoją karierę z Origen, a następnie przeskoczył do G2 na letni split EU LCS 2016. Jego potencjał w późnej fazie gry nie oznacza braku potencjału w początkowej fazie. Zven potrafi zdobyć znaczącą przewagę na dolnej alei.\n\nChociaż Zven i wspierający mithy przybyli na Mistrzostwa Świata 2016 z etykietą najlepszych, ich występy były co najwyżej przeciętne. Stając przed kolejną szansą na podbicie świata podczas Mid-Season Invitational 2017, będzie chciał uzasadnić zaufanie, jakie wielu w nim pokłada. Jedno jest pewne — każdy, kto chce pokonać G2, nie może zapominać o Zvenie.\n","de_DE":"Jesper „Zven“ Svenningsen ist die tickende Zeitbombe in G2s Arsenal. Wenn sich die restlichen Mitglieder der Mannschaft zu Beginn des Spiels keinen Vorteil verschaffen können, müssen sie nur warten, bis Zven explodiert. Der dänische AD-Carry begann seine Karriere bei Origen, bevor er für den Sommer-Split der EU LCS 2016 zu G2 wechselte. Trotz seines Potenzials im späten Spiel beherrscht er auch das frühe Spiel, da er sich auf der unteren Lane immer wieder erhebliche Vorteile erarbeiten kann.\n\nUnd obwohl Zven und sein Supporter Mithy vor der Weltmeisterschaft 2016 zu den besten Spielern gehörten, war ihre Leistung dort im besten Fall glanzlos. Beim Mid-Season Invitational 2017 bekommt er erneut die Chance, sich mit den Besten der Welt zu messen, und er wird versuchen, das Vertrauen, das viele in ihn gesetzt haben, zu rechtfertigen. Eine Sache ist sicher: Wenn du G2 schlagen willst, musst du dich um Zven kümmern.\n","es_ES":"Jesper ''Zven'' Svenningsen es la bomba de relojería del arsenal de G2. Si el resto del equipo no consigue una ventaja inicial, lo único que tienen que hacer es esperar a que Zven explote. El ADC danés comenzó su carrera en Origen antes de dar el salto a G2 para el split de verano de la LCS EU 2016. El potencial que tiene al final de la partida no le viene por sacrificar las fases iniciales; todo lo contrario, es capaz de hacerse con una ventaja importante en la calle inferior.\n\nA pesar de que Zven y su apoyo, mithy, llegaron al Campeonato Mundial 2016 situados entre los mejores, su rendimiento fue, como poco, deslucido. Con una nueva oportunidad de enfrentarse al mundo en el Mid-Season Invitational 2017, está listo para demostrar que la confianza depositada en él no es en vano. Una cosa es cierta: uno no puede olvidarse de Zven si se quiere ganar a G2.\n","pt_BR":"<p>Jesper \"Zven\" Svenningsen é uma bomba prestes a explodir do arsenal da G2. Se o resto da equipe ainda não conseguiu a liderança, tudo que eles precisam fazer é esperar o Zven aparecer. O carregador dinamarquês começou sua carreira com Origen antes de pular para a G2na Etapa de Verão da LCS UE 2016. Seu potencial de final de jogo não vem com um déficit no início do jogo, pois ele é capaz de se estabelecer no jogo na rota inferior.</p> <p>Embora Zven e seu suporte mithy tenham chegado no Campeonato Mundial 2016 entre os melhores, seus desempenhos foram, no máximo, medíocres. Com outra chance de confrontar o mundo no Mid-Season Invitational 2017, ele procurará justificar a fé que muitos colocaram nele. Uma coisa é certa: se quiser derrotar a G2, não pode esquecer do Zven. </p>","es_AR":"<p>Según su compañero de equipo Maurice \"Amazing\" Stückenschneider, el acarreador de G2 Esport, Jesper \"Zven\" Svenningsen, es un \"veterano en cuerpo de amateur\". De hecho, esa fue la impresión luego del debut aplastante del danés en la LCS EU, que lo convirtió en el mejor jugador de la semana 1 en el torneo de clausura de la LCS EU 2015. Como un novato solitario en un equipo lleno de veteranos, Zven llegó como ADC de Origen después de recibir críticas brillantes del propio Martin \"Rekkles\" Larsson de Fnatic. La combinación de talento y capacidad de mejorar de Zven justifican la aprobación de Rekkles.</p>\n\n<p>Mientras acumula más y más experiencia, Zven no ha dejado de sorprender a sus compañeros de equipo, rivales y simpatizantes por igual. Después de otro torneo estelar durante la primavera del 2016, Zven y su cómplice Alfonso \"Mithy\" Aguirre se pasaron a G2 Esports y se abrieron paso por la competencia hacia el título del torneo de clausura de la LCS EU 2016. Con un lugar en el Mundial asegurado, Zven podrá probar su valía una vez más contra las mejores duplas de carriles inferiores del mundo. Hay algo que es seguro: no importa lo que suceda, Zven presentará una lucha encarnizada.</p>"},"foreignIds":{"drupalId":"3886","TRLH3":"200000066","TRLH4":"200000169","TRLH1":"200000421","TRLH2":"200000321"},"socialNetworks":{"azubu":"azubu.tv/niels","facebook":"https://www.facebook.com/Zvanillan?fref=ts","twitter":"https://twitter.com/Zvanillan"},"champions":[],"liveGameTeam":163},{"id":497,"slug":"mithy","name":"mithy","firstName":"Alfonso","lastName":"Aguirre Rodriguez","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mithy-15rjs47u.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-05-26T21:14:06.000Z","updatedAt":"2017-06-19T13:45:26.000Z","bios":{"en_US":"<p>Alfonso \"mithy\" Aguirre Rodriguez brings a veteran presence to G2 Esports' bot lane. His career began in 2013 with Lemondogs and included a trip to the 2013 World Championship. He later joined Origen and made another trip to Worlds in 2015, losing in the semifinals to eventual champs SK telecom T1. He found his home on G2 Esports for the 2016 EU LCS Summer Split and eventually journeyed to Worlds for a third time in 2016.</p>\n\n<p>After failing to make it out of groups, mithy and G2 are out for blood in 2017. Rejoining Zven in the bot lane for 2017, mithy had another great season en route to a third EU LCS title. His versatility was on full display, playing everything from Karma to his signature Tahm Kench. With his reputation on the line, he showed up at the 2017 Mid-Season lnvitational, where G2 took second place.</p>","fr_FR":"Alfonso « Mithy » Aguirre Rodriguez apporte une présence de vétéran à la voie du bas de G2 Esports. Sa carrière a commencé en 2013 au sein des Lemondogs, avec une participation au Championnat du monde 2013. Il a ensuite rejoint Origen et participé au Mondial 2015, qui s'est soldé par une défaite pour son équipe lors des demi-finales contre les futurs champions, SK Telecom T1. Enfin, il a élu domicile chez G2 Esports pour le segment d'été des LCS EU 2016 avant d'enregistrer une troisième participation au Mondial en 2016.\n\nAprès leur échec lors de la phase de groupe, Mithy et G2 ont soif de victoire en 2017. Rejoignant Zven sur la voie du bas pour l'année 2017, Mithy a réalisé une excellente saison, puis remporté un troisième titre en LCS EU. Lors de son parcours, il a pu démontrer toute sa polyvalence en jouant de nombreux champions, de Karma à Tahm Kench, son favori. Sa réputation étant en jeu, il mettra certainement à profit toute son expérience pour travailler ses adversaires au corps lors du Mid-Season Invitational 2017\n","pl_PL":"Alfonso „mithy” Aguirre Rodriguez będzie weteranem na dolnej alei G2 Esports. Jego kariera rozpoczęła się w 2013 roku z Lemondogs i objęła wyprawę na Mistrzostwa Świata 2013. Później mithy dołączył do Origen i wyruszył na kolejną wyprawę na Mistrzostwa w 2015 roku, przegrywając w półfinałach z późniejszymi mistrzami, SK Telecom T1. Znalazł swoje miejsce w G2 Esports podczas letniego splitu EU LCS 2016 i w efekcie w 2016 roku po raz trzeci wyruszył na Mistrzostwa.\n\nPo nieudanym wyjściu z grupy mithy i G2 łakną zemsty w 2017 r. Po dołączeniu do Zvena na dolnej alei w 2017 roku mithy rozegrał kolejny świetny sezon w drodze po trzeci tytuł EU LCS. W pełni zademonstrował swoją wszechstronność, grając wszystkim od Karmy po swojego sztandarowego Tahm Kencha. Ponieważ mithy kładzie na szali swoją reputację, wykorzysta całe swoje doświadczenie, aby pokonać przeciwników na Mid-Season Invitational 2017.\n","de_DE":"Alfonso „Mithy“ Aguirre Rodriguez ist der Veteran auf der unteren Lane von G2 Esports. Seine Karriere begann 2013 bei den Lemondogs, mit denen er auch zur Weltmeisterschaft 2013 fuhr. Daraufhin wechselte er zu Origen, fuhr 2015 wieder zur Weltmeisterschaft und musste sich dort im Halbfinale den späteren Champions SK Telecom T1 geschlagen geben. Vor dem Sommer-Split der EU LCS 2016 wechselte er schließlich zu G2, mit denen er im letzten Jahr ein weiteres Mal an der Weltmeisterschaft teilnahm.\n\nDort scheiterten Mithy und G2 bereits in der Gruppenphase, weshalb sie 2017 auf Rache aus sind. Nach einer weiteren großartigen Saison und dem dritten Titel in der EU LCS sind Mithy und Zven 2017 wieder auf der unteren Lane vereint. Er zeigte seine ganze Vielseitigkeit und spielte alles von Karma bis hin zu seinem Lieblingsschampion Tahm Kench. Da sein Ruf auf dem Spiel steht, wird er sicher seine ganze Erfahrung nutzen, um seinen Gegnern beim Mid-Season Invitational 2017das Leben schwer zu machen.\n","es_ES":"Alfonso \"mithy\" Aguirre Rodríguez aporta veteranía a la calle inferior de G2 Esports. Empezó su carrera en 2013, con Lemondogs, año que incluyó una visita al Campeonato Mundial 2013. Después se unió a Origen y volvió a acudir al Mundial en 2015, donde acabó perdiendo en semifinales contra los que serían los campeones, SK telecom T1. Encontró su hogar en G2 Esports para el split de verano de la LCS EU 2016 y, al final, viajó de nuevo al Mundial, por tercera vez, en 2016.\n\nTras fracasar en su intento por salir de la fase de grupos, mithy y G2 están sedientos de sangre en 2017. Tras reunirse un año más en la calle inferior con Zven, a mithy le espera otra gran temporada tras obtener el tercer título consecutivo de la LCS EU. Su versatilidad se puso de manifiesto cuando demostró ser capaz de jugar campeones desde Karma a su característico Tahm Kench. Su reputación está en juego, por lo que empleará toda su experiencia contra sus rivales en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Alfonso \"mithy\" Aguirre Rodriguez traz uma presença veterana à rota inferior da G2 Esports. A sua carreira começou em 2013, com a Lemondogs, e incluiu uma viagem para o Campeonato Mundial 2013. Depois, ele entrou para a Origen e foi novamente para o Mundial em 2015, perdendo nas semifinais para os campeões SK Telecom T1. Ele se encontrou na G2 Esports para a Etapa de Verão da LCS UE 2016 e terminou indo para o Mundial pela terceira vez em 2016.</p>\n\n<p>Depois de fracassar na fase de grupos, mithy e G2 têm sede de sangue em 2017. Reunindo-se a Zven na rota inferior em 2017, mithy teve outra grande temporada a caminho de um terceiro título da LCS UE. Sua versatilidade estava escancarada, jogando com tudo desde, Karma até Tahm Kench. Com sua reputação em jogo, ele trará toda sua experiência para cima dos seus adversários no Mid-Season Invitational 2017.\n</p>","es_AR":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>","cs_CZ":"<p>Alfonso „mithy“ Aguirre Rodriguez nastoupil do týmu Origen roku 2014, když zrovna hledal příležitost k novému začátku. Své schopnosti jakožto hráče v roli podpory prokázal už v Lemondogs, s nimiž se probojoval na mistrovství světa 3. sezóny. Bylo čas na něco nového. Mithyho zaujal především fakt, že by mohl hrát s Jesperem „Zvenem“ Svenningsenem, mladým a slibným ADC, který právě sjel z výrobního pásu sólové fronty. „Chtěl jsem mít po svém boku někoho, kdo by mě motivoval podávat co nejlepší výkony,“ říká Mithy a Zven této představě skvěle odpovídal. Rychle si padli do noty a vytvořili jednu z nejobávanějších dvojic v evropském LCS. Mithyho schopnost rychle měnit svůj herní styl mezi zahajováním soubojů a postupným oslabováním soupeřů zajistila spodní lajně Origenu vysokou variabilnost.</p>\n\n<p>Těsně před zahájením letního splitu EU LCS 2016 se Mithy a Zven i se svou chemií ve spodní lajně přestěhovali do G2 Esports, se kterými pak vyhráli ligu a zajistili si tak místo na MS. Tento výlet ale pro Mithyho a jeho spolubojovníky nedopadl tak, jak doufali: vypadli již ve skupině a připsali si jen jediné vítězství. Jelikož se turnaj All-Star koná na Mithyho domácí španělské půdě, bude mít v hledišti jistě ohromné množství fanoušků, ale pokud bude chtít dotáhnout Evropu k vítězství, bude muset přechytračit i některé z nejbystřejších mozků League of Legends (včetně svého obdivovaného MadLifea). Zkouška ohněm proti těm nejlepším a nezkušenějším… Brnkačka, ne?</p>","el_GR":"<p>Ο Alfonso \"mithy\" Aguirre Rodriguez έγινε μέλος των Origen το 2014, εκμεταλλευόμενος την ευκαιρία για ένα νέο ξεκίνημα. Είχε αποδείξει ήδη το ταλέντο του ως υποστηρικτής με τους Lemondogs, μια ομάδα που είχε καταφέρει να φτάσει στο Παγκόσμιο Πρωτάθλημα της Σεζόν 3. Είχε έρθει η ώρα να δοκιμάσει κάτι νέο. Ο Mithy επιθυμούσε ιδιαίτερα να παίξει στο πλευρό του Jesper \"Zven\" Svenningsen, ενός νεαρού και φιλόδοξου AD Carry που μόλις είχε κάνει τη μετάβαση από την ουρά αναμονής για έναν παίκτη. «Ήθελα να έχω δίπλα μου κάποιον που θα μου έδινε ένα ισχυρό κίνητρο να παίξω καλά και να πιάσω υψηλή απόδοση¨, δηλώνει ο Mithy και ο Zven του το προσφέρει αυτό με το παραπάνω. Οι δυο τους έδεσαν πολύ γρήγορα μεταξύ τους και έγιναν ένα από τα πιο επικίνδυνα δίδυμα στο LCS Ευρώπης. Ο Mithy έχει την ικανότητα να αλλάζει γρήγορα το στυλ παιχνιδιού του μεταξύ συμπλοκής και αποσυμπλοκής και αυτό χάρισε στην κάτω λωρίδα των Origen τρομερή ευελιξία.</p>\n\n<p>Ο Mithy και ο Zven συνεργάστηκαν άψογα στην κάτω λωρίδα και κατά των G2 Esports λίγο πριν το Summer Split 2016 του LCS Ευρώπης και στη συνέχεια πήραν την πρώτη θέση και σφράγισαν το εισιτήριό τους για το Παγκόσμιο Πρωτάθλημα. Όμως ο Mithy και η παρέα του δεν είχαν ανάλογη πορεία στο Παγκόσμιο, καθώς αποκλείστηκαν στη φάση ομίλων, επιτυγχάνοντας μόνο μία νίκη. Ο Mithy είναι βέβαιο ότι θα έχει πολύ ισχυρή υποστήριξη στο τουρνουά, αφού διεξάγεται στην πατρίδα του, την Ισπανία. Βέβαια, εκεί θα βρεθεί αντιμέτωπος με ορισμένους από τους πιο στρατηγικούς εγκεφάλους του League of Legends (όπως και ο MadLife, ένας παίκτης που θαυμάζει) στην προσπάθειά του να οδηγήσει την Ευρώπη στη νίκη. Θα είναι μια δοκιμασία ενάντια στους καλύτερους και εξυπνότερους παίκτες του LoL... κανένα άγχος, σωστά;</p>","hu_HU":"<p>Alfonso „mithy” Aguirre Rodriguez 2014-ben igazolt az Origenhez egy új kezdet reményében. A Lemondogs tagjaként bizonyította, hogy kiváló támogató, és a 3. szezon világbajnokságán is ott volt. De valami újra vágyott. Mithy különösen örült, hogy lehetősége lesz együtt játszani Jesper „Zven” Svenningsennel, egy fiatal és diadaléhes lövésszel, aki frissen érkezett az egyéni várólista darálójából. „Olyasvalakit kerestem, aki tud motiválni engem – magyarázta Mithy –, és Zven pontosan ezt teszi.” Ők ketten hamar összeszoktak, és az EU LCS egyik legfélelmetesebb alsó ösvényét hozták össze. Mithy gyorsan tud váltani a kezdeményező szerep és az ellenfél kivéreztetése között, ami nagyon sokoldalúvá tette az Origen alsó ösvényét.</p>\n\nMithy és Zven az alsó ösvényen kialakult összhangját átmentette a G2 Esportsba az EU LCS 2016-os nyári szakasza előtt, ahol megszerezték az első helyet, és ezzel a vb-szereplés jogát. Ez a kiruccanás nem éppen a tervek szerint alakult Mithy és csapata számára, mivel már a csoportkörben kiestek, mindössze egyetlen győzelmet sikerült kicsikarniuk. Mithy számára a hazai pálya azt jelenti, hogy a tömeg mindenkinél jobban fogja támogatni, miközben túl kell járnia a League of Legends néhány legokosabb játékosának (többek között a példaképe, MadLife) eszén, hogy győzelemre segítse Európát. A Szurdok legjobbjai ellen kell játszani… Mi baj lehet?\n","it_IT":"<p>Alfonso \"Mithy\" Aguirre Rodriguez si è unito agli Origen nel 2014, mentre cercava un'occasione per poter ricominciare da zero. Aveva già dimostrato le sue capacità di supporto durante il suo periodo con i Lemondogs, facendosi strada fino ai Mondiali della terza stagione. Era il momento di cercare qualcosa di nuovo. Mithy era particolarmente attratto dall'idea di giocare con Jesper \"Zven\" Svenningsen, un giovane e famelico ADC appena uscito dalla fucina della coda in singolo. \"Volevo avere accanto qualcuno che mi motivasse a giocare bene,\" ha detto Mithy, e Zven è perfetto per questo ruolo. I due legarono molto velocemente, creando una delle coppie più temute di tutta la LCS EU. La capacità di Mithy di modificare rapidamente il suo stile da iniziatore a difensore ha dato agli Origen una buona versatilità in corsia inferiore.</p>\n\nMithy e Zven hanno portato la loro sinergia ai G2 Esports subito prima del Summer Split 2016, in cui si sono assicurati il primo posto e la partecipazione ai Mondiali. Purtroppo, il viaggio non si è concluso bene per Mithy e i suoi compagni, eliminati nella fase a gironi con una sola vittoria all'attivo. Per Mithy, un torneo nella sua patria significa che avrà un supporto enorme da parte dei fan, ma anche che dovrà superare in astuzia alcune delle menti più brillanti di League of Legends (incluso il suo mito, MadLife) per portare l'Europa al trionfo. Un rito di passaggio contro i migliori della Landa... Cosa potrebbe andare storto?\n\n","ro_RO":"<p>Alfonso ''mithy'' Aguirre Rodriguez, aflat în căutarea unui nou început, a devenit membru al echipei Origen în 2014. Își dovedise deja abilitățile de suport în echipa Lemondogs, alături de care s-a luptat până la Campionatul Mondial din sezonul 3. Era momentul să încerce ceva nou. Mithy a fost atras în mod special de ideea de a juca cu Jesper \"Zven\" Svenningsen, un AD carry tânăr și dornic să se afirme, venit din lista de așteptare solo. ''Am vrut să am lângă mine o persoană care mă motivează să joc și să dau mai mult'', a afirmat Mithy, iar Zven e persoana potrivită. Cei doi s-au apropiat rapid, formând unul dintre cele mai de temut culoare duo din LCS EU. Abilitatea lui Mithy de a-și ajusta rapid stilul de joc între inițiator și hărțuitor i-a oferit multă adaptabilitate culoarului de jos al Origen.</p>\n\nMithy și Zven au luat cu ei magia de pe culoarul de jos atunci când s-au alăturat echipei G2 Esports chiar înainte de etapa de vară a LCS EU 2016. Alături de G2 au câștigat prima poziție, obținând un loc la Mondiale. Acolo, lucrurile nu au decurs conform așteptărilor pentru Mithy și coechipierii săi, întrucât au fost eliminați din turneu în faza grupelor, obținând o singură victorie. Pentru Mithy, un turneu acasă la el, în Spania, înseamnă un sprijin deosebit din partea fanilor. Dar pentru a reuși să-i aducă o victorie Europei, va trebui să fie mai isteț ca unele dintre cele mai iluminate minți din League of Legends (inclusiv idolul său, MadLife). Un rit de trecere împotriva celor mai buni și mai inteligenți jucători din Rift... Ce-ar putea să nu meargă bine?\n","es_MX":"<p>Alfonso ''mithy'' Aguirre Rodríguez se unió a Origen en 2014, en busca de una oportunidad para empezar de cero. Ya había demostrado sus habilidades como soporte durante su temporada con Lemondogs, cuando consiguió llegar al Campeonato Mundial de la tercera temporada. Ya era hora de probar algo nuevo. A Mithy le atraía especialmente la idea de jugar con Jesper ''Zven'' Svenningsen, un joven tirador hambriento de fortuna y recién sacado de la presión de la cola individual. ''Quería tener a alguien a mi lado que me motivase a jugar'', dice Mithy, y Zven aporta eso del mejor modo posible. Encajaron enseguida, y formaron uno de los dúos más temidos de la LCS EU. La capacidad de Mithy para cambiar su estilo de juego muy rápido, entre iniciador de combates y defensor, otorgó versatilidad al carril inferior de Origen.</p>\n\n<p>Mithy y Zven trasladaron su química del carril inferior a G2 Esports justo antes del torneo de verano de la LCS EU 2016 y consiguieron quedar primeros, lo que les aseguró un puesto en el Mundial. El viaje no fue según lo esperado para Mithy y sus compañeros, ya que quedaron descalificados del campeonato en la fase de grupos tras lograr una única victoria. Un torneo en casa, España, supondrá que Mithy reciba un gran soporte por parte de la audiencia. Sin embargo, tendrá que superar a algunas de las mentes más brillantes de League of Legends (incluyendo a su inspiración, MadLife) si quiere conseguir que Europa salga victoriosa. Un rito de iniciación contra los mejores y más brillantes de la Grieta... ¿qué podría salir mal?</p>"},"foreignIds":{"drupalId":"277","TRLH3":"200000067","TRLH4":"200000170","TRLH1":"200000422","TRLH2":"200000322"},"socialNetworks":{"azubu":"azubu.tv/mithy","twitter":"https://twitter.com/mithyxd "},"champions":[],"liveGameTeam":163},{"id":660,"slug":"cozq","name":"CozQ","firstName":"Sofyan","lastName":"Rechchad","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cozq-7eq65vwu.png","hometown":"Hertogenbosch","region":"EU Challenger Series","birthdate":"1995-05-21","createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-07-06T13:27:23.000Z","bios":{"en_US":"<p>Sofyan \"CozQ\" Rechdad is the mid laner for Mysterious Monkeys. The Dutch mid laner bounced between numerous teams to start his career, which included a brief stint with Turkish team Dark Passage. He found a home on Misfits Academy to start 2017 and helped the team qualify for the EU LCS. He'll remain the starting mid laner for Mysterious Monkeys after the ownership change. He's proven capable on a wide range of mid lane champions, which bodes well for his chances in the LCS.</p>","pl_PL":"Sofyan „CozQ” Rechdad jest środkowym Mysterious Monkeys. Zaczynając karierę, duński środkowy przeskakiwał między wieloma drużynami, zaliczając między innymi krótkie występy w tureckiej drużynie Dark Passage. Na początku 2017 roku znalazł swoje miejsce w Misfits Academy i pomógł drużynie zakwalifikować się do EU LCS. Po zmianie właściciela drużyny pozostanie środkowym w pierwszym składzie Mysterious Monkeys. Pokazał, że świetnie sobie radzi z szerokim wyborem środkowych bohaterów, co dobrze wróży jego szansom w LCS.","fr_FR":"Sofyan « CozQ » Rechdad est le mid laner des Mysterious Monkeys. Le Hollandais a enchaîné les équipes au début de sa carrière, avec notamment un bref séjour chez les Turcs de Dark Passage. Il a finalement trouvé sa place chez Misfits Academy début 2017 et a aidé l'équipe à se qualifier pour les LCS EU. Il conserve sa place de mid laner titulaire des Mysterious Monkeys malgré le changement de propriétaire. CozQ a prouvé son talent avec un large éventail de champions sur la voie du milieu, et les choses se présentent bien pour lui aux LCS, où il devrait avoir toutes ses chances.","es_ES":"Sofyan \"CozQ\" Rechdad es el mid de Mysterious Monkeys. El holandés ha pasado por diversos equipos en el comienzo de su carrera, incluido un breve periodo en el equipo turco Dark Passage. A comienzos de 2017 fue fichado por Misfits Academy y ayudó al equipo a clasificarse para la LCS EU. Seguirá siendo el mid titular de Mysterious Monkeys después del cambio de propietario. Ha demostrado ser capaz de jugar con una gran variedad de campeones, lo que le augura un buen futuro en la LCS.","de_DE":"Sofyan „CozQ“ Rechdad ist der Mid-Laner der Mysterious Monkeys. Der Holländer wechselte zu Beginn seiner Karriere zwischen mehreren Mannschaften hin und her und war für kurze Zeit Teil der türkischen Mannschaft Dark Passage. Zum Jahresbeginn 2017 fand er bei Misfits Academy sein Zuhause und half ihnen bei der Qualifikation zur EU LCS. Auch nach dem Besitzerwechsel behält er seine Position als Mid-Laner für die Mysterious Monkeys. Er hat seine Fähigkeiten mit einer großen Bandbreite an Champions auf der mittleren Lane unter Beweis gestellt, was ihm gute Chancen in der LCS verspricht."},"foreignIds":{"drupalId":"3895","FRA1TMNT1":"375382","TRLH4":"200000300","TRNA1":"1000445250","TREU":"1000565102","TREU1":"1000565102","ESPORTSTMNT02":"200001022","TRLH3":"200000248"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":809,"slug":"trick","name":"Trick","firstName":"Kang Yun","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trick-1h25r825.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-30T18:36:18.000Z","updatedAt":"2017-06-19T13:46:53.000Z","bios":{"en_US":"<p>Kang Yun \"Trick\" Kim won both MVP awards for the 2016 EU LCS -- and he's just getting started. After beginning his career as a substitute jungler, he came to G2 Esports with something to prove. He fit right in on G2, a former EU Challenger team with chips on their shoulders. Trick went on to string together two splits of the most dominant jungle play ever seen in the LCS. Unfortunately, he came up short at the 2016 World Championship.</p>\n\n<p>Trick and the rest of G2 will have something to prove again in 2017 -- that they can do more than just dominate their own league. G2 once again dominated their region on their way to a third straight EU LCS title. While he struggled at times, he played a key role in G2's second place finish at the 2017 Mid-Season Invitational.</p>","de_DE":"<Kang Yun „Trick“ Kim wurde in der EU LCS 2016 zweimal zum wertvollsten Spieler gewählt – und dabei fängt er gerade erst an. Nachdem er seine Karriere als Ersatzspieler für den Dschungel begonnen hatte, wechselte er zu G2 Esports, um sein Können unter Beweis zu stellen. Er passte perfekt zu G2, einer Mannschaft aus der europäischen Challenger Series, die noch eine Rechnung offen hatte. Daraufhin spielte Trick im Dschungel zweimal hintereinander so dominant wie kein anderer Spieler in der LCS. Leider blieb er bei der Weltmeisterschaft 2016 hinter seinen Erwartungen zurück.\n\n2017 müssen sich Trick und der Rest von G2 wieder beweisen – sie müssen allen zeigen, dass sie mehr können, als nur ihre eigene Liga zu dominieren. Auf dem Weg zu ihrem dritten Titel in Folge lieferte G2 erneut eine dominante Vorstellung in der EU LCS ab. Beim Mid-Season Invitational 2017 erwartet Trick jedoch die wahre Herausforderung: Er muss G2s Probleme aus der Vergangenheit hinter sich lassen und zeigen, was ihn ihm steckt.\n","fr_FR":"Kang Yun « Trick » Kim a remporté les deux titres de MVP lors des LCS EU 2016 – et il ne fait que commencer. Après avoir débuté sa carrière comme jungler remplaçant, il est arrivé chez G2 Esports avec l'intention de faire ses preuves. Il s'est intégré sans mal dans cette ancienne équipe Challenger EU, qui avait une revanche à prendre. Trick a continué sur sa lancée lors des deux segments suivants en dominant la jungle comme jamais personne ne l'avait fait dans les LCS. Malheureusement, il n'a pas eu le succès escompté lors du Championnat du monde 2016.\n\nEn 2017, Trick et ses équipiers de G2 devront à nouveau prouver qu'ils sont capables d'étendre leur domination au-delà de leur propre ligue. G2 a une fois de plus dominé sa région en remportant un troisième titre LCS EU d'affilée. Le véritable défi pour Trick sera de faire oublier les difficultés de G2 sur la scène internationale en faisant éclater son talent lors du Mid-Season Invitational 2017.\n","es_ES":"Kang Yun ''Trick'' Kim ganó los dos premios MVP de la LCS EU 2016. Y eso solo fue el principio. Tras comenzar su carrera como jungla suplente, se convirtió en titular de G2 Esports, listo para demostrar lo que vale. Encajó a la perfección en G2, un antiguo equipo Aspirante europeo con ganas de pelea. Trick encadenó dos splits con el juego más dominante que se ha visto en la historia de la LCS en un jungla. Por desgracia, esa actitud no se trasladó al Campeonato Mundial 2016.\n\nTrick y el resto de G2 tendrán algo que demostrar de nuevo en 2017: que pueden hacer algo más que triunfar en su propia liga. G2 ha vuelto a dominar en su región y ha conseguido su tercer título consecutivo de la LCS EU. El auténtico reto para Trick será superar los problemas de G2 en el pasado en la escena internacional y demostrar todo lo que puede dar en el Mid-Season Invitational 2017 en Brasil.\n","pl_PL":"Kang Yun „Trick” Kim zgarnął obie nagrody dla Najlepszego Zawodnika EU LCS 2016 — a dopiero się rozkręca. Po rozpoczęciu kariery jako rezerwowy dżungler dołączył do G2 Esports, chcąc dowieść swojej wartości. Dobrze pasuje do G2, byłej drużyny europejskiej serii Pretendenta, która ma rachunki do wyrównania. Trick połączył oba splity najbardziej dominującą grą w dżungli, jaką kiedykolwiek widziano w LCS. Niestety nie poradził sobie na Mistrzostwach Świata 2016.\n\nTrick i reszta G2 będą mieli znowu coś do udowodnienia w 2017 roku — muszą pokazać, że potrafią więcej niż tylko zdominować własną ligę, co zrobili w drodze po trzeci z rzędu tytuł EU LCS. Prawdziwym wyzwaniem dla Tricka będzie otrząśnięcie się po wcześniejszych niepowodzeniach G2 na arenie międzynarodowej i pokazanie, co chowa w rękawie na Mid-Season Invitational 2017 w Brazylii.\n\n","es_AR":"<p>Kang-yun \"Trick\" Kim llegó a la escena de la LCS europea para demostrar su valía en el 2016, y lo logró con gran estilo. Trick había jugado como junglero sustituto rotativo de CJ Entus en la LCK, pero, después de pasar un año en la competencia principal de Corea, se fue a Europa con G2 Esports. Aparentemente, nadie le dijo a Trick que G2 había acabado de ascender de la Challenger, y el jugador tuvo una de las actuaciones de junglero más dominantes jamás vistas en la LCS, que le mereció el premio al mejor jugador del torneo.</p>\n\n<p>Parecía que no le alcanzaba ser el mejor jugador de la EU en solo un torneo, así que Trick repitió la proeza en el torneo de clausura de la LCS EU 2016 y ayudó a que su equipo ganara su segundo título de LCS EU consecutivo. Trick tiene la oportunidad de coronar su mejor año levantando la Copa del Invocador en el escenario más importante de League of Legends.</p>","pt_BR":"<p>Kang Yun \"Trick\" Kim ganhou ambos prêmios de Jogador Mais Valioso da LCS UE 2016, e ele só está começando. Depois de iniciar sua carreira como caçador substituto, ele entrou na G2 Esports com algo a provar. Ele se ajustou perfeitamente na G2, uma antiga equipe Desafiante UE bastante agressiva. Trick une duas das características mais dominantes do jogo na selva já vistos no LCS. Infelizmente, ele não estava à altura do Campeonato Mundial 2016.</p>\n\n<p>Trick e o resto a G2 terão algo a provar novamente em 2017: que eles podem fazer mais do que apenas dominar sua própria liga. A G2 dominou sua região mais uma vez a caminho do terceiro título LCS UE consecutivo. O desafio de verdade para Trick será esquecer as antigas dificuldades internacionais da G2 e mostrar o que esconde na manga para o Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"3643","TRLH3":"200000064","TRLH4":"200000167","TRLH1":"200000419","TRLH2":"200000319"},"socialNetworks":{"twitter":"https://twitter.com/G2Trick"},"champions":[],"liveGameTeam":163},{"id":959,"slug":"perkz","name":"Perkz","firstName":"Luka","lastName":"Perkovic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perkz-7vcrb0in.png","hometown":"Croatia","region":"EU LCS","birthdate":null,"createdAt":"2016-01-05T19:58:09.000Z","updatedAt":"2017-06-19T13:42:28.000Z","bios":{"fr_FR":"Luka « Perkz » Perkovic est peut-être le midlaner le plus confiant des LCS EU. Heureusement pour lui, son talent est à la hauteur de son assurance. Lors de son premier segment avec G2 Esports, il a apporté à la voie du milieu son penchant pour la destruction, impressionnant les fans avec Azir et LeBlanc. Il a été nommé meilleur débutant du segment de printemps des LCS EU 2016 et a permis à G2 de remporter deux titres consécutifs dans les LCS EU cette même année.\n\nMais l'égo de Perkz en a pris un coup lors de deux événements internationaux de 2016, le MSI et le Mondial, dans lesquels G2 n'a pas réussi à s'imposer. Après avoir remporté son troisième titre consécutif en LCS EU, il va avoir une chance de se racheter au plus haut niveau lors du Mid-Season Invitational 2017. Même si ses performances passées ont ébranlé sa confiance, il devrait s'en remettre rapidement. Et vu son tempérament, c'est sûrement déjà fait.\n","es_ES":"Luka ''Perkz'' Perkovic es el jugador de la calle central más confiado de la LCS EU. Por suerte, goza de la habilidad necesaria para cumplir con lo que promete. En su primer split con G2 Esports, desató una lluvia de destrucción en la calle central, sorprendiendo a los fans con jugadas con Azir y LeBlanc. Consiguió el premio al mejor novato del split de primavera de la LCS EU 2016 y contribuyó a los dos títulos consecutivos de la LCS EU que consiguió G2 in 2016.\n\nPero el ego de Perkz sufrió un importante varapalo en dos eventos internacionales durante 2016, en los que G2 no estuvo a la altura: el MSI y el Mundial 2016. Tras ganar su tercer título consecutivo de la LCS EU, tendrá la oportunidad de redimirse en el Mid-Season Invitational 2017. No importa que su participación internacional anterior afectase a su confianza, ya que no quedaría herida mucho tiempo. Y, de todas formas, él nunca lo admitiría.\n","de_DE":"Luka „Perkz“ Perkovic ist der selbstsicherste Mid-Laner in der EU LCS. Glücklicherweise ist er auch gut genug, um seinen Worten Taten folgen zu lassen. In seinem ersten Split mit G2 Esports vernichtete er seine Gegner auf der mittleren Lane und begeisterte die Fans mit Azir und LeBlanc. Im Frühjahrs-Split der EU LCS 2016 wurde er zum Nachwuchsspieler des Splits gewählt und half G2 dabei, die EU LCS 2016 zweimal in Folge zu gewinnen.\n\nAber Perkz’ Ego hat 2016 bei zwei internationalen Events – dem MSI und der Weltmeisterschaft 2016 – ordentliche Dämpfer abbekommen, weil G2 beide Male weit hinter den Erwartungen zurückblieb. Nach seinem dritten Titel in der EU LCS in Folge bekommt er beim Mid-Season Invitational 2017 eine Chance zur Wiedergutmachung. Seine vergangenen Leistungen haben seinem Selbstbewusstsein zwar geschadet, aber die Zeit heilt alle Wunden. Außerdem würde er das sowieso nie zugeben.\n","en_US":"<p>Luka \"Perkz\" Perkovic is the most confident mid laner in the EU LCS. Lucky for him he has the skill to back up his boasts. In his rookie split with G2 Esports, he brought a penchant for destruction to the mid lane, wowing fans with his play on Azir and LeBlanc. He earned himself the Rookie of  the Split award for the 2016 EU LCS Spring Split, and helped carry G2 to back-to-back EU LCS titles in 2016.</p>\n\n<p>But Perkz ego took a major blow at two international events in 2016 -- MSI and Worlds 2016 -- where G2 twice failed to perform. After winning his third straight EU LCS title, he broke the trend at the 2017 Mid-Season Invitational, where he performed excellently in G2's second-place finish.</p>","pl_PL":"Luka „Perkz” Perkovic to najpewniejszy siebie środkowy w EU LCS. Na szczęście ma umiejętności, które dorównują jego przechwałkom. Podczas debiutanckiego splitu wraz z G2 Esports zademonstrował swoje destrukcyjne zapędy w środkowej alei, zdobywając fanów dzięki grze Azirem i LeBlanc. Odebrał nagrodę dla Debiutanta Splitu podczas wiosennego splitu EU LCS 2016 i pomógł G2 zdobyć dwa z rzędu tytuły EU LCS w 2016 r.\n\nAle ego Perkza musiało znieść silny cios, gdy podczas dwóch międzynarodowych wydarzeń 2016 roku — MSI i Mistrzostw 2016 — G2 dwukrotnie zawiedli. Po wygraniu trzeciego z rzędu tytułu EU LCS będzie miał szansę odkupić się na Mid-Season Invitational 2017. Nawet jeśli wcześniejsze występy podkopały jego pewność siebie, to nie załamał się na długo. Poza tym, nigdy by się do tego nie przyznał.\n","es_AR":"<p>Luka \"Perkz\" Perković se movió por la escena amateur europea de League of Legends durante varios años antes de firmar con G2 Esports en el 2015. Una vez a bordo, Perkz imprimió un cariz particular de destrucción al carril central de G2, especialmente con Azir y LeBlanc. Después de un exitoso paso por el torneo de clausura y las eliminatorias de la Challenger Series EU 2015, Perkz y G2 arrasaron la LCS EU como un huracán.</p>\n\n<p>La maestría de Perkz en el carril central tuvo un rol clave en la dominación del torneo regular por parte de G2, que terminó valiéndole el premio al novato del torneo y una victoria en la final de las eliminatorias del torneo de apertura de la LCS EU 2016. Continuó sus esfuerzos de novato ganando un sólido  torneo de clausura y otro título de LCS EU. Ha demostrado tener lo que hace falta para destacarse en la LCS EU, pero ahora tiene otra oportunidad de mostrarle al mundo que puede medirse con los pesos pesados internacionales. El paso por el Mundial no será fácil, pero si hay un jugador con confianza para realizarlo, ese es Perkz.</p>","pt_BR":"<p>Luka \"Perkz\" Perkovic é o jogador de meio mais confiante da LCS UE. Sorte a sua possuir a habilidade para apoiar sua gabação. Na sua primeira etapa com a G2 Esports, ele levou o caos e a destruição para a rota do meio da G2, deixando os fãs de boca aberta com suas jogadas como Azir e LeBlanc. Ele ganhou o prêmio de Novato da Etapa pela Etapa de Primavera da LCS UE 2016, e ajudou a carregar a G2 para dois títulos LCS UE consecutivos em 2016.</p>\n\n<p>Mas o ego do Perkz foi acertado em cheio em dois eventos internacionais em 2016: o MSI e o Mundial de 2016, onde a G2 falhou duas vezes. Depois de vencer seu terceiro título LCS UE seguido, ele terá uma chance de se redimir no Mid-Season Invitational 2017. Mesmo seu desempenho anterior tenha ferido sua confiança, ela não ficaria danificada por muito tempo. E, além disso, ele nunca admitiria.\n</p>"},"foreignIds":{"TRLH3":"200000065","TRLH4":"200000168","TRLH1":"200000420","TRLH2":"200000320"},"socialNetworks":{"twitch":"www.twitch.tv/perrkz","facebook":"www.facebook.com/perkzlol/","twitter":"https://twitter.com/perkzlol"},"champions":[],"liveGameTeam":163},{"id":1262,"slug":"expect","name":"Expect","firstName":"Daehan","lastName":"Ki","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/expect-d5l0hkgo.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:08:30.000Z","updatedAt":"2017-06-19T13:48:46.000Z","bios":{"en_US":"<p>Daehan \"Expect\" Ki is coming into his own as G2 Esports' top laner. When he first joined the team last summer, he played the role of punching bag, absorbing blows in the top lane and allowing his teammates to carry. That playstyle was good enough to win the 2016 EU LCS Summer Split, but Expect wanted more.</p>\n\n<p>Expect took big steps forward in the 2017 EU LCS Spring Split, playing more carries in the top lane and doing his own share of damage. He took on some of the world's best top laners en route to G2's second place finish at the 2017 Mid-Season Invitational.</p>","pl_PL":"Daehan „Expect” Ki umacnia się na pozycji górnego G2 Esports. Gdy po raz pierwszy dołączył do drużyny ubiegłego lata, grał rolę worka treningowego, przyjmując na siebie ciosy na górnej alei i pozwalając kolegom z drużyny prowadzić grę. Ten styl gry wystarczył, by osiągnąć zwycięstwo w letnim splicie EU LCS 2016, ale Expect chciał więcej.\n\nW sezonie wiosennym EU LCS 2017 Expect poczynił wielkie kroki naprzód, częściej grając prowadzącymi na górnej alei i mając swój wkład w zadawane obrażenia. Podczas sezonu zasadniczego osiągnął wynik 8−1, grając Rumblem, a jego Gangplank pomógł G2 pokonać Unicorns of Love w finale wiosny EU LCS. Jaki będzie następny krok Expecta? Starcie z najlepszymi na świecie górnymi na Mid-Season Invitational 2017 w Brazylii.\n","es_AR":"<p>Daehan ''Expect'' Ki comenzó su trayectoria profesional jugando para el equipo coreano Midas FIO. Cuando consideró que ya le habían machacado suficiente en Corea, se trasladó a China y comenzó a cosechar éxitos. Avanzó muy rápido y en 2016 sustituyó a Mateusz ''Kikis'' Szkudlarek como jugador de la calle superior de G2 Esports, contribuyendo así a la que el equipo ganase su segundo título seguido en la LCS EU.</p>\n\n<p>A menudo, se le ha considerado el ''saco de boxeo'' de G2, ya que Expect cumple una función extraordinaria absorbiendo presión. Esto sirve de liberación para sus compañeros de equipo, que pueden jugar más libremente con su potente agresividad. Puede que no sea el rol más glamuroso, pero Expect sigue cumpliendo con su trabajo este año. Tendrá que enfrentarse contra los mejores jugadores de la calle superior que jamás hayan pisado el ring (como Smeb o Looper); una difícil tarea para alguien que nunca ha vivido una competición como esta. ¿Conseguirá superar las expectativas? Solo el tiempo lo dirá.</p>","pt_BR":"<p>Daehan \"Expect\" Ki está se instalando como o jogador de rota superior da G2 Esports. Quando ele entrou na equipe no último verão, jogou na função de saco de pancadas, absorvendo os golpes da rota superior e permitindo que seus companheiros carregassem. Aquele estilo de jogo foi bom para vencer a Etapa de Verão da LCS UE 2016, mas Expect queria mais.</p>\n\n<p>Expect deu grandes passos na Etapa de Primavera da LCS UE 2017, jogando com mais carregadores na rota superior e causando sua parcela de dano. Ele conseguiu 8-1 durante a temporada regular com Rumble, e seu Gangplank ajudou a G2 a derrotar os Unicorns of Love na Final da Primavera da LCS UE. Qual será o próximo passo do Expect? Jogar contra os melhores jogadores de rota superior do mundo no Mid-Season Invitational 2017 no Brasil.\n</p>","de_DE":"Daehan „Expect“ Ki kann als G2 Esports’ Top-Laner zeigen, was in ihm steckt. Als er im Sommer des letzten Jahres zur Mannschaft stieß, übernahm er die Rolle des Sandsacks, der auf der oberen Lane die Aufmerksamkeit auf sich zieht, damit seine Mannschaftskameraden das Spiel entscheiden können. Das reichte, um den Sommer-Split der EU LCS 2016 zu gewinnen, aber Expect wollte mehr.\n\nIm Frühjahrs-Split der EU LCS 2017 machte Expect einen großen Schritt nach vorne, indem er auf der oberen Lane öfter einen Carry spielte und selbst Schaden austeilte. Während der regulären Saison gewann er mit Rumble acht Spiele bei nur einer Niederlage und im Finale des Frühjahrs-Splits der EU LCS half er G2 mit Gangplank, die Unicorns of Love zu besiegen. Doch wie geht es jetzt für Expect weiter? Er wird es beim Mid-Season Invitational 2017 in Brasilien mit den besten Top-Lanern der Welt zu tun bekommen.\n","fr_FR":"Daehan « Expect » Ki s'est révélé au poste de toplaner de G2 Esports. Quand il a rejoint l'équipe l'été dernier, il a joué le rôle de punching ball, encaissant les coups sur la voie du haut pour permettre à ses coéquipiers de jouer les carrys. Ce style de jeu a permis à l'équipe de remporter le segment d'été des LCS EU 2016, mais Expect en voulait plus.\n\nLors du segment de printemps des LCS EU 2017, il a fait d'énormes progrès, jouant davantage les carrys dans la voie du haut et infligeant des dégâts de son côté. Lors de la saison régulière, il a réalisé une série de 8-1 avec Rumble, et son talent avec Gangplank a aidé G2 à vaincre les Unicorns of Love en finale du segment de printemps des LCS EU. La prochaine étape pour Expect ? Défier les meilleurs toplaners du monde lors du Mid-Season Invitational 2017 au Brésil.\n","es_ES":"Daehan ''Expect'' Ki vuelve como top de G2 Esports. Cuando se unió al equipo por primera vez el verano pasado, cumplió el papel de saco de boxeo, absorbiendo los golpes desde la calle superior para que su equipo obtuviese la victoria. Ese estilo de juego fue suficiente para ganar el split de verano de la LCS EU 2016, pero Expect no se conformaba con eso.\n\nHa demostrado grandes mejorías en el split de primavera de la LCS EU 2017, y ahora juega más carries en top, lo que le permite infligir su buena dosis de daño. Quedó 8-1 en la temporada regular con Rumble, y su Gangplank ayudó a que G2 venciese a Unicorns of Love en la final de primavera de la LCS EU. ¿Cuál será su próximo paso? Vencer a los mejores tops del mundo en el Mid-Season Invitational 2017 en Brasil.\n"},"foreignIds":{"TRLH4":"200000166","TRLH3":"200000063","TRLH1":"200000418","TRLH2":"200000318"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1333,"slug":"yuuki60","name":"Yuuki60","firstName":"Florent","lastName":"Soler","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yuuki60-h09ivc6h.png","hometown":"France","region":"EU Challenger Series","birthdate":"1991-06-21","createdAt":"2016-06-03T16:01:57.000Z","updatedAt":"2017-07-06T13:37:56.000Z","bios":{"en_US":"<p>Florent \"Yuuki60\" Soler is the starting ADC for Mysterious Monkeys. The French marksman paired with support Dreams in the bot lane for Misfits Academy to start 2017, eventually qualifying for the EU LCS. He tends to select more utilty-focused ADCs like Ashe and Jhin, preferring to start the fights himself. After besting the EU CS competition, he's ready for his next challenge.</p>","fr_FR":"<p>Yuuki est un ADC reconnu de la scène française de League of Legends. Véritable vétéran, il a porté haut les couleurs de la France dans des tournois internationaux. Connu pour son positionnement impeccable, il a su créer des duos d'anthologie. </p>\n<p>On ne compte plus le nombres de trophées que Yuuki a pu remporter, sous les couleurs de aAa, Worth It mais aussi Gamers 2 ou il s'illustrait avec Dioud. </p>\n<p>Toujours au plus haut de sa forme, Yuuki a remporté la deuxième place de la Lyon e-Sport #9 avec ses coéquipiers de Renegades pour ensuite rejoindre Misfits en Challenger Series. Aujourd'hui sous le maillot de Millenium, il a a coeur de prouver qu'il reste parmi les meilleurs, et entend bien décrocher le titre de champion de France.</p>","de_DE":"Florent „Yuuki60“ Soler ist der AD-Carry der Mysterious Monkeys. Anfang 2017 tat sich der französische Schütze für Misfits Academy mit Supporter Dreams in der unteren Lane zusammen und trug zur Qualifikation für die EU LCS bei. Er bevorzugt meist unterstützende AD-Carrys wie Ashe oder Jhin und geht gerne zuerst zum Angriff über. Nach dem Sieg in der EU CS ist er bereit für die nächste Herausforderung.","es_ES":"Florent \"Yuuki60\" Soler es el ADC titular de Mysterious Monkeys. El tirador francés jugó con su compañero apoyo, Dreams, en la calle inferior de Misfits Academy al comienzo de 2017 y, finalmente, lograron clasificarse para la LCS EU. Suele decantarse por ADC de utilidad como Ashe y Jhin, ya que prefiere iniciar los combates él mismo. Tras dar lo mejor de sí mismo en la Challenger Series europea, ya está preparado para superar el próximo reto.","pl_PL":"Florent „Yuuki60” Soler to prowadzący w pierwszym składzie Mysterious Monkeys. Na początku 2017 roku roku ten francuski strzelec grał dla Misfits Academy na dolnej alei w parze ze wspierającym Dreamsem i pomógł drużynie zakwalifikować się do EU LCS. Zwykle wybiera bardziej skupionych na walorach użytkowych prowadzących, takich jak Ashe i Jhin, woląc samemu rozpoczynać walki. Po ograniu konkurencji w EU CS jest gotowy na następne wyzwanie."},"foreignIds":{"FRA1TMNT1":"435084","TRNA1":"1000525108","TREU":"1000565112","TRLH4":"200000301","FRA1TMNT2":"45055","TRLH2":"1001250099","TRLH3":"200000249"},"socialNetworks":{"twitter":"https://twitter.com/Yuukii60"},"champions":[],"liveGameTeam":334},{"id":1343,"slug":"dreams","name":"Dreams","firstName":"Min-kook","lastName":"Han","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dreams-dd99r8zs.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2016-06-06T23:47:30.000Z","updatedAt":"2017-07-06T13:41:55.000Z","bios":{"en_US":"<p>Min-kook \"Dreams\" Han is the Korean support player for Mysterious Monkeys. After earning a spot in the EU LCS while playing with Misfits Academy, he's sticking with the team as it rebrands to Mysterious Monkeys. He'll keep laning alongside his ADC Yuuki60 after finding success in the EU CS. Dreams has showed off a wide champion pool already this year, from shielding supports like Lulu and Karma to more niche picks such as Tahm Kench and Nautilus.</p>","pl_PL":"Min-kook „Dreams” Han jest koreańskim wspierającym w Mysterious Monkeys. Po zdobyciu miejsca w EU LCS z Misfits Academy, został z drużyną, która zmieniła nazwę na Mysterious Monkeys. Szukając dalszego sukcesu w EU CS, będzie walczył na alei obok prowadzącego Yuuki60. Dreams zaprezentował już w tym roku swoją szeroką pulę bohaterów od ochraniających wspierających, takich jak Lulu i Karma, po bardziej niszowe wybory, takie jak Tahm Kench i Nautilus.","fr_FR":"Min-kook « Dreams » Han est le support coréen des Mysterious Monkeys. Après avoir participé aux LCS EU avec Misfits Academy, il a décidé de rester aux côtés de l'équipe, maintenant renommée Mysterious Monkeys. Il continuera de collaborer avec l'ADC Yuuki60 suite à leur succès lors des CS EU. Dreams a déjà utilisé un large éventail de champions cette année, depuis des supports protecteurs comme Lulu et Karma jusqu'à des choix plus originaux comme Tahm Kench et Nautilus.","es_ES":"Min-kook \"Dreams\" Han es el apoyo coreano de Mysterious Monkeys. Tras asegurarse un puesto en la LCS EU jugando con Misfits Academy, permanece en el equipo ahora que ha cambiado su nombre por Mysterious Monkeys. Seguirá formando dúo con su ADC Yuuki60 tras el éxito que cosecharon en la CS EU. Dreams ha demostrado este año que puede dominar una gran variedad de campeones, desde apoyos con escudos como Lulu o Karma a opciones más específicas como Tahm Kench o Nautilus.","de_DE":"Min-kook „Dreams“ Han ist der koreanische Supporter der Mysterious Monkeys. Nachdem er als Teil von Misfits Academy einen Platz in der EU LCS errungen hat, bleibt er der Mannschaft auch nach der Namensänderung zu Mysterious Monkeys erhalten. Er wird im Anschluss an seinen Erfolg in der EU CS weiter an der Seite seines AD-Carrys Yuuki60 die Lane bestreiten. Dreams hat dieses Jahr bereits seinen breitgefächerten Championpool zur Schau gestellt, der von Supportern mit Schilden wie Lulu oder Karma zu eher ungewöhnlichen Wahlen wie Tahm Kench oder Nautilus reicht."},"foreignIds":{"FRA1TMNT1":"435085","TRNA1":"1000525109","TREU1":"1000565114","TREU":"1000565114","TRLH4":"200000302","ESPORTSTMNT02":"200001024","TRLH3":"200000250"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1574,"slug":"abbedagge","name":"Abbedagge","firstName":"Felix","lastName":"Braun","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/abbedagge-dy39ro6t.png","hometown":"Almanya","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T22:14:09.000Z","updatedAt":"2017-03-06T16:30:39.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001189"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1706,"slug":"sendo","name":"Send0o","firstName":"Rosendo","lastName":"Fuentes Bóveda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sendo-g3gop67t.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-16T19:31:57.000Z","updatedAt":"2017-06-09T11:19:35.000Z","bios":{},"foreignIds":{"TRLH3":"200000301","TRLH4":"200000401"},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":1715,"slug":"kitty","name":"Kitty","firstName":"Sanders","lastName":"Everink","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kitty-67qf6sp8.png","hometown":null,"region":"EU LCS","birthdate":"1994-10-17","createdAt":"2017-01-19T08:40:34.000Z","updatedAt":"2017-05-31T21:37:09.000Z","bios":{"en_US":"","fr_FR":"<p>En participant au Challenge France, le Carry AD des Gamers Origin souhaite ajouter une nouvelle étape à son palmarès. En effet, depuis le début de sa carrière en Saison 1, il a remporté plusieurs compétitions de haut niveau en 2016 telles que l'ESL Madrid avec l'équipe Baskonia, ou l'ESL Benelux. Il arrive désormais dans une nouvelle ligue et a tout à prouver avec ses nouveaux coéquipiers.</p>\n\n<p>Il affectionne tout particulièrement des champions très agressifs comme Draven ou Ezreal, un style de jeu qui s'accordera parfaitement avec son support Targamas.</p>"},"foreignIds":{"esportstmnt05":"200000957","TRLH3":"200000309","TRLH4":"200000409"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1863,"slug":"inition","name":"Inition","firstName":"Lukas","lastName":"Otter","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inition-6kxcqgyh.png","hometown":"Avusturya","region":"EU LCS","birthdate":null,"createdAt":"2017-04-14T10:23:40.000Z","updatedAt":"2017-05-31T21:39:04.000Z","bios":{},"foreignIds":{"TRLH3":"200000310","TRLH4":"200000310"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":1914,"slug":"phones","name":"Phones","firstName":"Christian","lastName":"Sieg","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phones-7zhwlue6.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T22:02:28.000Z","updatedAt":"2017-05-31T21:43:42.000Z","bios":{},"foreignIds":{"TRLH3":"200000308","TRLH4":"200000408"},"socialNetworks":{},"champions":[],"liveGameTeam":334},{"id":2044,"slug":"hoang","name":"Hoang","firstName":"Michael Tuan","lastName":"Hoang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hoang-f3qmug9n.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-06-21T21:20:06.000Z","updatedAt":"2017-06-21T21:20:38.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":163},{"id":2082,"slug":"quicktimer","name":"Quicktimer","firstName":"Ricardo","lastName":"Schipper","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quicktimer-be9qv8fs.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-07-30T12:53:12.000Z","updatedAt":"2017-07-30T12:48:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":334}],"scheduleItems":[{"id":"AVxHDHLBQMQFcjhwbQ3y","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:cf65532d-d0b8-4749-b13d-bbb3f8f30181","scheduledTime":"2017-07-01T15:00:00.743+0000","tags":{"blockLabel":"5","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"cf65532d-d0b8-4749-b13d-bbb3f8f30181","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"8cef06b7-9779-48e2-a7e3-77024324ed49","gameHash":"07f34562424022f1"},{"id":"2b58a5e7-eb52-4017-b6f2-19a98ebce666","gameHash":"24dd614973a25ef1"}],"videos":[{"id":7682,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:8cef06b7-9779-48e2-a7e3-77024324ed49","source":"https://www.youtube.com/embed/C96J_RFOrtA?wmode=transparent&rel=0","createdAt":"2017-07-02T14:12:22.000Z","updatedAt":"2017-07-02T14:12:22.000Z","game":"8cef06b7-9779-48e2-a7e3-77024324ed49"},{"id":7683,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:2b58a5e7-eb52-4017-b6f2-19a98ebce666","source":"https://www.youtube.com/embed/pyB4isX2NvM?wmode=transparent&rel=0","createdAt":"2017-07-02T14:12:43.000Z","updatedAt":"2017-07-02T14:12:43.000Z","game":"2b58a5e7-eb52-4017-b6f2-19a98ebce666"}],"htmlBlocks":[],"match":{"id":"cf65532d-d0b8-4749-b13d-bbb3f8f30181","name":"MM-vs-G2","position":40,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"games":{"2b58a5e7-eb52-4017-b6f2-19a98ebce666":{"id":"2b58a5e7-eb52-4017-b6f2-19a98ebce666","name":"G2","generatedName":"G2|MM|G2|cf65532dd0b84749b13db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1499005089425,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1498928459002,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002140161","gameRealm":"TRLH3","platformId":"TRLH3:1002140161","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"172078db-a9b1-405b-b0e3-41a68770a070":{"id":"172078db-a9b1-405b-b0e3-41a68770a070","name":"G3","generatedName":"G2|MM|G3|cf65532dd0b84749b13db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"},{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8cef06b7-9779-48e2-a7e3-77024324ed49":{"id":"8cef06b7-9779-48e2-a7e3-77024324ed49","name":"G1","generatedName":"G2|MM|G1|cf65532dd0b84749b13db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"},{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}],"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1499005068481,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1498925504596,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002140143","gameRealm":"TRLH3","platformId":"TRLH3:1002140143","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1499005089426,"source":"bestOf","history":[{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1499005068482,"source":"bestOf","closed":true},{"result":[[{"roster":"448614f1-757e-4a44-8c84-80a48cf8b425"}],[{"roster":"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2"}]],"timestamp":1498928459002,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"fd0a7c0f-c5a4-4516-8b46-a4857dedb1b2":0,"448614f1-757e-4a44-8c84-80a48cf8b425":1}}}