{"teams":[{"id":84,"slug":"royal-never-give-up","name":"Royal Never Give Up","guid":"be6e0b13-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/royal-never-give-up-cyacqft1.png","acronym":"RNG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:48:15.000Z","bios":{"en_US":"","es_AR":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes de China en los últimos años. Consiguieron múltiples posiciones número 1, como locales, en la LPL e incluso alcanzaron la fase eliminatoria del Torneo por Invitación de Temporada del 2016. El equipo ha cultivado algunos de los más grandes talentos en China y han construido una fuerte alineación con experiencia, talento y tenacidad. Como los segundos clasificados de China, RNG representará a sus simpatizantes dentro del mayor escenario existente. Con esta alineación y su historia, no tenemos la menor duda de que podrán cumplir con la tarea.</p>\n\n<p><strong>Entrenador: Kim \"Fly\" Sang-chul</strong></p>","fr_FR":"<p>Royal Never Give Up a emprunté la voie royale et remporté les LPL printemps 2016 lors de son second segment, en triomphant de plusieurs équipes telles que Qiao Gu Reapers, Edward Gaming et Team World Elite. Désormais au même niveau que son homologue Star Horn Royal Club, deux fois finaliste du Championnat du monde, l'organisation Royale n'est pas étrangère au succès sur la scène internationale. Après avoir goûté à la compétition internationale en arrivant en 3e/4e place de l'IEM Season X World Championship, l'équipe va tenter de transposer son succès national sur la scène mondiale.</p>","es_ES":"<p>Royal Never Give Up ha sido uno de los equipos más fuertes del último año en China. Se hicieron con varios primeros puestos en la LPL y, además, llegaron a la fase eliminatoria del MSI 2016. El equipo ha dado lugar a algunos de los mayores talentos de China y ha construido un buen plantel con experiencia, talento y tenacidad. Como segundo clasificado de China, RNG representará a sus seguidores en el mayor escenario posible. Con esta plantilla y con su historial, no hay duda de que cumplirán lo que prometen.</p>","de_DE":"<p>Royal Never Give Up war im vergangenen Jahr eine der stärksten Mannschaften Chinas. Sie konnten in der LPL mehrere erste Plätze erobern und erreichten sogar die K.-o.-Phase des Mid-Season Invitational 2016. Die Mannschaft hat ein paar der größten Talente Chinas hervorgebracht und verfügt über eine starke Aufstellung voller Erfahrung, Talent und Entschlossenheit. RNG konnte sich als zweite chinesische Mannschaft für die WM qualifizieren und wird versuchen, ihre Fans auf der größten aller Bühnen zu begeistern. Dank ihrer Aufstellung und ihrer Geschichte haben wir keinen Zweifel daran, dass sie für diese Aufgabe gewappnet sind.</p>","pl_PL":"<p>Royal Never Give Up zwyciężyli w wiosennym LPL 2016 podczas swojego drugiego splitu, pokonując takie drużyny, jak Qiao Gu Reapers, Edward Gaming oraz Team World Elite. Będąca przeciwieństwem dwukrotnych finalistów Mistrzostw Świata Star Horn Royal Club, organizacja Royal jest za pan brat z sukcesami na międzynarodowej scenie. Po zasmakowaniu międzynarodowej rywalizacji, zajmując miejsce 3./4. podczas Mistrzostw Świata 10. sezonu IEM, będą chcieli odtworzyć swój krajowy sukces za granicą.</p>","pt_BR":"A Royal Never Give Up foi uma das equipes mais fortes da China no ano passado. Eles abocanharam vários primeiros lugares na LPL e também chegaram à fase eliminatória do MSI 2016. A equipe produziu alguns dos maiores talentos da China e compôs um elenco forte, experiente, talentoso e obstinado. Como a segunda melhor equipe da China, a RNG vai representar sua torcida de fãs no maior palco que existe. E com esse elenco e esse histórico, não temos dúvidas de que eles vão dar conta do recado."},"foreignIds":{"drupalId":"4381"},"players":[102,290,704,709,710,712,1659,1890,1987],"starters":[704,709,710,1659,1987],"subs":[102,290,712,1890]},{"id":105,"slug":"kt-rolster","name":"kt Rolster","guid":"be6e39bf-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/kt-rolster-8rh5ukll.png","acronym":"KT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:44.000Z","bios":{"en_US":"<p>KT Rolster built a name for themselves in Korea through their strong objective control and individual laning talent. If their lanes went poorly, KT relied on their star junglers inSec and KaKAO to bail them out. Unfortunately for KT, their strategy faltered in the wake of inSec and KaKAO leaving to join teams in the LPL.</p>\n\n<p>After years of playing second fiddle to SK telecom T1, KT Rolster knocked their rivals out of the 2016 LCK Summer Playoffs. However, KT lost to ROX in a closely contested LCK Finals match, forcing them to play in the Regional Qualifier, where they were knocked out by Samsung Galaxy. Entering 2017 with a rebuilt roster packed with star power, they'll be sure to compete for the top spot in the LCK.</p>","fr_FR":"KT Rolster s'est fait un nom en Corée avec sa maîtrise des contrôles d'objectifs et l'habileté de ses membres sur les voies. Si la phase de voie se présentait mal, KT pouvait toujours compter sur les junglers inSec et KaKAO pour les sortir du pétrin. Malheureusement pour KT, cette stratégie est entrée dans une impasse quand inSec et KaKAO les ont quittés pour une autre équipe. Cela dit, quand une étoile est passée, une autre monte. Les espoirs de KT Rolster aux LCK reposent désormais sur les épaules des très capables ssumday, Arrow et Nagne.","pl_PL":"KT Rolster zyskało sławę w Korei dzięki swojej niezwykle skutecznej kontroli celów oraz talentowi do walki w alejach. Jeżeli gracze w alejach się nie popisali, KT polegało na swoich dżunglerach, inSecu i KaKAO, aby zaprowadzili porządek. Niestety dla KT strategia ta przestała działać w wyniku odejścia inSeca i KaKAO, którzy dołączyli do drużyn w LPL. Jednakże gdy jedna gwiazda znika, na jej miejscu pojawia się nowa. Marzenia KT Rolster o LCK spoczywają teraz w rękach ssumdaya, Arrowa i Nagne.","de_DE":"KT Rolster haben sich in Korea einen Namen durch ihre starke Objective-Kontrolle und individuellem Talent gemacht. Ssumday ist der Superstar-Top-Laner in Korea und lässt nicht mehr los, sobald er sich einen Vorteil verschaffen kann. Die ersten Minuten der Spiele mit KT zeichnen sich stets durch den immensen Druck des Jungle/Support-Duos aus. Es ist zu erwarten, dass der gegnerische Jungler bei ihrem Anblick in Angstschweiß ausbricht, wenn er nicht weiß, sein Territorium zu verteidigen.","es_ES":"KT Rolster se ha ganado una reputación en Corea por méritos propios gracias a un control férreo de sus objetivos y el talento de sus jugadores. Si en las calles la cosa no iba bien ahí estaba su jungla estrella para solucionar la partida, primero inSec y luego KaKAO. Desafortunadamente para KT, su estrategia falló cuando tanto inSec primero como KaKAO después abandonaron Corea para probar suerte en la LPL china. Pero cuando una estrella se va, otra se alza. Los sueños de KT Rolster residen ahora en ssumday, Arrow y Picaboo, que harán todo lo posible por llevar a su equipo a lo más alto.","pt_BR":"A KT Rolster construiu seu nome na Coreia com um estilo de jogo baseado em forte controle de objetivos e muito talento individual nas rotas. Se eles perdessem na rota, podiam confiar nos caçadores inSec e KaKAO para salvar o dia. Infelizmente, ambos deixaram o time para ir jogar na LPL. Mas quando uma estrela se apaga, outra surge no lugar. Os sonhos da KT agora estão depositados em Ssumday, Arrow e Piccaboo.\n","ko_KR":"<p>KT Rolster는 강력한 오브젝트 관리와 라인전 경기력으로 유명세를 탔습니다. 라인전에서 적팀에 밀리게 돼도 스타 정글러 inSec 선수와 KaKAO 선수가 팀을 승리로 이끌어주었죠. 하지만 두 정글러가 LPL에 진출하며 팀을 떠나자 팀 전략에 구멍이 났습니다. 하지만 별이 떠난 자리에는 다른 별이 뜨기 마련. 이제 KT Rolster는 ssumday 선수와 Arrow 선수를 선두에 내세워 전장에 나서고 있습니다.</p>"},"foreignIds":{"drupalId":"642"},"players":[69,72,304,749,769,2050],"starters":[69,72,304,749,769],"subs":[2050]}],"players":[{"id":69,"slug":"mata","name":"Mata","firstName":"Sehyoung","lastName":"Cho","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mata-7wmee6cg.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-06T14:11:34.000Z","bios":{"en_US":"<p>Sehyoung \"Mata\" Cho is one of the few League players who hardly needs an introduction. Mata is not just a World Champion, but the MVP of the series that won Samsung White the 2014 world title and Summoner's Cup. He’s one of the most well known Thresh players in the world, and his tactical mind is legendary.</p>\n\n<p>On the Rift, Mata is an invaluable addition to Royal Never Give Up, and has achieved an incredible synergy with his hot-headed, wildly-aggressive ADC partner Uzi. Unfortunately, his stellar play wasn’t enough to carve out a win against the eventual World champions, SK Telecom T1. Mata will have a chance to flash hook his way to some redemption in 2017.</p>","es_AR":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","fr_FR":"<p>Se-hyeong « Mata » Cho est l'un des rares joueurs de League of Legends qu'on ne présente plus. Mata n'est pas seulement champion du monde, il est aussi le MVP de la série qui a valu à Samsung White le titre de championne du monde 2014 et la Coupe de l'invocateur. Il est l'un des joueurs de Thresh les plus connus au monde, et son esprit tactique est légendaire.</p>\n\n<p>Sur la Faille, Mata est un ajout de taille pour Royal Never Give Up, et il a établi une synergie extraordinaire avec Uzi, son partenaire ADC impétueux et agressif. Malheureusement, son jeu exemplaire n'a pas suffi à vaincre les futurs champions du monde de SK Telecom T1. Mata trouvera peut-être la rédemption à coups de Saut éclair et de Grappin grâce à sa nomination à l'événement All-Stars 2016 de Barcelone. Accompagné de son partenaire de voie Uzi, la plus grande contribution de Mata se jouera dans sa façon de superviser le champ de bataille de la Faille de l'invocateur. Avec le commandant Mata à la barre, le vaisseau All-Stars de la Chine a une chance de se maintenir à flot, même si les probabilités ne jouent pas en leur faveur.</p>","es_ES":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de League que casi no necesita una presentación. No solo es un campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White ganase el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia increíble con su impulsivo e increíblemente agresivo ADC, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de calle Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","de_DE":"<p>Se-hyeong „Mata“ Cho gehört zu den wenigen League-Spielern, die man nicht groß vorstellen muss. Mata ist nicht nur ein Weltmeister, er wurde auch noch zum wertvollsten Spieler gewählt, als Samsung White 2014 Weltmeister wurde und den Beschwörerpokal gewann. Er ist einer der bekanntesten Thresh-Spieler der Welt und seine Taktiken sind legendär.</p>\n\n<p>In der Kluft ist Mata für Royal Never Give Up unbezahlbar und harmoniert unglaublich gut mit seinem hitzköpfigen, extrem aggressiven AD-Carry-Partner Uzi. Leider reichte seine überragende Leistung nicht, um die späteren Weltmeister, SK Telecom T1, zu besiegen. Doch Mata hat genug Stimmen bekommen, um am All-Stars-Event 2016 in Barcelona teilzunehmen, wo er die Chance auf Wiedergutmachung bekommt. Zusammen mit seinem Lane-Partner Uzi wird Matas größter Beitrag seine Übersicht in der Kluft der Beschwörer sein. Wenn Mata das Kommando übernimmt, stehen die Chancen gut, dass Chinas All-Stars-Schiff nicht kentern wird, selbst wenn alles gegen sie sprechen sollte.</p>","pl_PL":"Sehyeong „Mata” Cho jest jednym z kilku zawodników League of Legend, których nie trzeba przedstawiać. Mata to nie tylko mistrz świata — był także najlepszym zawodnikiem serii, podczas której zdobył dla Samsung White mistrzostwo i Puchar Przywoływacza w 2014 roku. To jeden z najlepiej znanych na świecie zawodników grających Threshem, a jego taktyczny umysł jest legendarny.</p>\n\nNa Summoner’s Rift Mata stanowi bezcenne uzupełnienie Royal Never Give Up i osiągnął niebywałe zgranie ze swoim porywczym, szaleńczo agresywnym prowadzącym partnerem, Uzim. Niestety jego znakomita gra nie wystarczyła, by zdobyć zwycięstwo przeciwko ostatecznym Mistrzom Świata, SK Telecom T1. Mata będzie miał okazję wyhaczyć swoje odkupienie dzięki nominacji do gry na wydarzeniu All-Star 2016 w Barcelonie. Mając za sobą kolegę z alei, Uziego, największą odpowiedzialnością Maty będzie nadzorowanie przebiegu walki na polu bitwy Summoner’s Rift. Gdy u steru stoi kapitan Mata, chiński okręt na All-Star zawsze będzie miał szanse utrzymać się na powierzchni, nawet w niesprzyjających okolicznościach.\n","pt_BR":"<p>Sehyeong \"Mata\" Cho é um dos poucos jogadores do League que nem precisa de apresentações. Mata não é apenas um Campeão Mundial. Ele é o MVP da série que deu o Campeonato à Samsung White. Ele é um dos jogadores de Thresh mais conhecidos do mundo e seu raciocínio tático é lendário.</p>\n\n<p>Mata é uma adição inestimável para a Royal Never Give Up e alcançou uma incrível sinergia com seu parceiro cabeça-quente e altamente agressivo, o atirador Uzi. Infelizmente, sua mecânica incrível não foi suficiente para arrancar uma vitória contra a campeã do Mundial, a SK Telecom T1. Mata terá uma chance de dar aquele Flash com gancho e agarrar sua redenção após ser eleito para participar do Evento All-Star 2016 em Barcelona. Com Uzi também eleito, a maior contribuição de Mata será em como ele cuida do campo de batalha que é Summoner’s Rift. Com o comandante Mata no manche, o navio All-Star da China tem uma chance de continuar navegando, mesmo se a sorte estiver contra eles.</p>","cs_CZ":"<p>Sehyeong „Mata“ Cho je jedním z mála hráčů League of Legends, kteří nepotřebují žádné zdlouhavé představování. Mata není jen mistr světa, ale také držitel ocenění pro nejužitečnějšího hráče za sérii, ve které Samsung White v roce 2014 vyhrál MS a Vyvolávačův pohár. Je jedním z nejslavnějších hráčů Threshe na světě a o jeho taktických dovednostech se vyprávějí legendy.</p>\n\n<p>Ve Žlebu je Mata nedocenitelnou oporou týmu Royal Never Give Up, s jehož horkokrevným a divoce agresivním ADC Uzim si vybudoval neuvěřitelně dokonalou synergii. Bohužel ani jeho hvězdné výkony nestačily na překonání SK Telecom T1, kteří nakonec letošní mistrovství světa vyhráli. Mata bude mít ještě šanci se se svým hákem pomstít, jelikož byl nominován na turnaj All-Star 2016 v Barceloně. S lajnovým parťákem Uzim v závěsu bude největším Matovým příspěvkem to, jak si dokáže udržovat přehled o celkovém dění na bojišti. Když bude mít na All-Star čínská loď u kormidla kapitána Matu, bude šanci udržet se na vodě, i když nepatří mezi favority.</p>","el_GR":"<p>Ο Sehyeong \"Mata\" Cho ανήκει στην ελίτ των παικτών του League που δεν χρειάζονται συστάσεις. Ο Mata δεν είναι μόνο Παγκόσμιος Πρωταθλητής, αλλά και ο MVP των αγώνων με τους οποίους οι Samsung White κατάκτησαν το Παγκόσμιο Πρωτάθλημα 2014 και το Κύπελλο Επικαλεστή. Είναι ένας από τους πιο διάσημους παίκτες του Θρες στον κόσμο και φημίζεται για τη στρατηγική του σκέψη.</p>\n\n<p>Σε αγωνιστικό επίπεδο, ο Mata είναι μια πολύτιμη προσθήκη στους Royal Never Give Up και έχει καταφέρει να συντονιστεί τέλεια με τον θερμόαιμο και εξαιρετικά επιθετικό ADC της ομάδας, τον Uzi. Δυστυχώς, η καταπληκτική του εμφάνιση δεν ήταν αρκετή για να δώσει τη νίκη στην ομάδα του στον αγώνα με τους SK Telecom T1 που στη συνέχεια θα έπαιρναν το Παγκόσμιο Πρωτάθλημα. Ο Mata θα έχει πάλι μια ευκαιρία να δείξει τι αξίζει, αφού επιλέχθηκε για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Ήδη γυαλίζει το φανάρι και το Φλας του. Μαζί με τον Uzi, τον συμπαίκτη του στη λωρίδα, ο Mata θα είναι ακόμη πιο πολύτιμος στην ομάδα του επειδή γνωρίζει καλύτερα από τον καθένα τη στρατηγική που απαιτεί το Φαράγγι των Επικαλεστών. Με καπετάνιο τον Mata, το πλήρωμα της Κίνας που θα ταξιδέψει στο All-Star έχει καλές πιθανότητες να μην ναυαγήσει, παρόλο που τα στατιστικά δεν είναι με το μέρος του.</p>","hu_HU":"Sehyeong „Mata” Cho a kevés LoL-játékos egyike, aki nem igazán szorul bemutatásra. Mata nem csupán világbajnok, hanem MVP volt egy olyan versenyen, ahol a Samsung White 2014-ben világbajnok lett, és elnyerte az Idézők Kupáját. A világ egyik legismertebb Thresh-játékosának taktikai érzéke legendás.</p>\n\nA Szurdokban Mata a Royal Never Give Up csodafegyvere, és meglepően jól működik együtt a forrófejű, rendkívül agresszív partnerével, Uzival. Sajnos az emberfeletti teljesítménye is kevés volt ahhoz, hogy megverjék a későbbi világbajnok SK Telecom T1-t. Mata most visszavághat, mert beszavazták őt a 2016-os All-Star gála játékosai közé. Állandó társa, Uzi is vele tart, így Mata stratégiai gondolkodása is jobban érvényesülhet az Idézők szurdokában. Mata parancsnokkal a hídon Kína All-Star-hajója akkor sem fog felborulni, ha az esélyek nem nekik kedveznek.\n","it_IT":"Sehyeong \"Mata\" Cho è uno dei pochi giocatori di LoL a non aver bisogno di presentazioni. Mata non è semplicemente un campione del mondo, ma anche il MVP della serie che ha visto i Samsung White conquistare i Mondiali 2014 e la Coppa degli evocatori. È uno dei più celebri giocatori di Thresh al mondo e la sua abilità tattica è leggendaria.</p>\n\nIn Landa, è una risorsa insostituibile dei Royal Never Give Up, tra i quali ha costruito un'incredibile sinergia con il suo aggressivo compagno ADC Uzi. Purtroppo le sue giocate stellari non sono bastate a strappare una vittoria contro i futuri campioni del mondo, gli SK Telecom T1. Mata avrà la possibilità di rifarsi e \"agganciare\" la vittoria all'All-Star 2016 di Barcellona. In compagnia del suo compagno di corsia Uzi, Mata potrebbe contribuire al successo della squadra soprattutto grazie alla sua visione del campo di battaglia. Con il comandante Mata al timone, la squadra cinese avrà sempre una possibilità di rimanere a galla, anche quando sembra che non ci sia via di scampo.\n","ro_RO":"Sehyeong ''Mata'' Cho este unul dintre puținii jucători de LoL care nu mai au nevoie de vreo prezentare. Mata nu este doar Campion Mondial, ci și MVP-ul Campionatului Mondial în care Samsung White a câștigat Cupa Invocatorului în 2014. Este unul dintre cei mai cunoscuți jucători de Thresh din lume, iar manevrele sale tactice sunt legendare.</p>\n\nÎn Rift, Mata este o piesă inestimabilă a echipei Royal Never Give Up și a dezvoltat o sinergie incredibilă cu partenerul său ADC temperamental și foarte agresiv, Uzi. Din păcate, manevrele sale uimitoare nu au fost de ajuns pentru a obține o victorie în fața viitorilor campioni mondiali, SK Telecom T1. Acum că a fost nominalizat să joace la evenimentul All-Star 2016 din Barcelona, Mata va avea ocazia să-și ia revanșa. Avându-l alături de colegul său de culoar, Uzi, cea mai importantă contribuție a lui Mata va fi controlul asupra câmpului de luptă. Cu comandantul Mata la cârmă, vasul All-Star al Chinei se va putea menține la suprafață chiar și atunci când șansele nu sunt favorabile.\n","es_MX":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>"},"foreignIds":{"drupalId":"682","ESPORTSTMNT06":"200000344","TRLT3":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":72,"slug":"pawn","name":"Pawn","firstName":"Wonseok","lastName":"Heo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pawn-bwchpx6p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:29.000Z","updatedAt":"2017-07-06T14:11:08.000Z","bios":{"en_US":"<p>\nWonseok “Pawn\" Heo is one of the best known mid laners in the world, with a career dating back to 2013. Pawn is a battle hardened veteran, with some truly impressive games under his belt. Pawn shocked the world when he solo killed Faker in the 2013 WCG Qualifiers, and he hasn’t stopped since. From there, he found himself on Samsung White during one of the most competitive and closely-matched periods in Korea’s history.\n</p>\n<p>\nSSW turned in a dominant performance during the 2014 World Championship, taking the cup home in almost unrivaled fashion. However, the team disintegrated in the aftermath of their success, and Pawn joined Edward Gaming at the end of 2014. Now rejoining the LCK, he'll once again take on Faker in the mid lane.\n</p>","fr_FR":"<p>Won-seok « PawN » Heo est l'un des meilleurs mid laners du monde. Point. Au nombre de ses trophées, on retrouve les play-offs des LPL, le Mid-Season Invitational et le Championnat du monde de League of Legends. Il a également battu Faker et SKT à de nombreuses occasions, notamment lors de la finale du MSI 2015. Et malgré son surnom (qui signifie « pion » en anglais), PawN nous rappelle plutôt une reine, capable de se déplacer où elle veut et semant la destruction dans les rangs ennemis.</p>\n<p>\nPawN a été recruté par Edward Gaming fin 2014, quand toute une vague de vedettes coréennes a migré vers les LPL. PawN a aidé à propulser EDG jusqu'à la 1re place de la Demacia Cup Spring Season 2015 et des play-offs printaniers des LPL 2015. Mais PawN sait que la route est encore longue. « Je trouve que Samsung White était une équipe parfaite », dit PawN, et EDG a encore beaucoup de travail à faire pour parvenir à ce niveau de performance. En attendant, PawN continuera à semer la peur chez ses adversaires chaque fois qu'il arrivera dans la Faille.\n</p>","pl_PL":"<p>\nHeo „PawN” Won-seok jest jednym z najlepszych graczy w środkowej alei na całym świecie. Czemu? Cóż, wygrał parę „drobnych” turniejów, takich jak choćby rozgrywki play-off LPL, turniej Mid-Season InvitationaL i mistrzostwa świata w League of Legends. Wielokrotnie też pokonywał Fakera i SKT – także podczas finałów 2015 MSI. Choć jego ksywka oznacza „pionek”, jego styl gry może bardziej kojarzyć się z królową, która porusza się po planszy w dowolnym kierunku, niszcząc każdego napotkanego przeciwnika.\n</p>\n<p>\nPawN został zwerbowany przez Edward Gaming pod koniec 2014 r. Był jedną z wielu koreańskich gwiazd, które przeszły do LPL. Pomógł EDG wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek play-off 2015 LPL. Pawn wie jednak, że przed nim trudne zadanie. „Wydaje mi się, że Samsung White było drużyną idealną” przyznaje PawN, a EDG czeka dużo pracy, jeżeli zamierzają osiągnąć podobny poziom. W międzyczasie PawN nadal będzie siał postrach w sercach wrogów za każdym razem, gdy wkroczy na Rift.\n</p>","de_DE":"<p>Won-seok „PawN“ Heo, dessen Karriere 2013 begann, ist einer der bekanntesten Mid-Laner der Welt. Obwohl PawN erst 19 Jahre alt ist, ist er bereits ein abgehärteter Veteran, der schon ein paar wirklich beeindruckende Spiele abgeliefert hat. PawN schockierte die Welt, als er Faker bei der Qualifikationsrunde für das WCG 2013 alleine besiegte, und hat seither nicht mehr nachgelassen. Kurz darauf wechselte er in einer der umkämpftesten und knappsten Phasen in Koreas Geschichte zu Samsung White.</p>\n\n<p>SSW lieferte bei der Weltmeisterschaft 2014 eine dominante Leistung ab und konnte sich den Titel beinahe widerstandslos sichern. Nach dem Erfolg brach die Mannschaft jedoch auseinander und PawN wechselte Ende 2014 zu Edward Gaming. Seither hat er EDG zu ein paar ihrer dominantesten Siege geführt. Doch der junge Spieler hat immer wieder mit Krankheiten zu kämpfen. Aber trotz dieser Rückschläge ist er immer noch ein Teil der Mannschaft und fest entschlossen, ihr zu dienen.</p>","es_ES":"<p>Won-seok \"PawN\" Heo es uno de los jugadores de la calle central más conocidos del mundo, con una carrera que data del año 2013. A pesar de tener solo 19 años, PawN es un veterano curtido en batalla que tiene en su haber unas partidas increíbles. Sorprendió a todo el mundo cuando acabó él solo con Faker en el clasificatorio del WCG 2013 y no ha parado desde entonces. Desde aquel momento, se encontraba en Samsung White durante uno de los periodos más competitivos y reñidos en la historia de Corea.</p>\n\n<p>SSW hizo gala de una actuación dominante durante el Campeonato Mundial 2014, hasta el punto de llevarse a casa el trofeo sin que casi nadie les plantase cara. No obstante, el equipo se deshizo como resultado de su éxito y PawN se unió a Edward Gaming a finales de 2014. Desde entonces, ha liderado a EDG en algunas de sus victorias más aplastantes. Aunque el joven jugador ha tenido que enfrentarse a alguna enfermedad. Y, a pesar de esto, sigue en el equipo, dispuesto a actuar.</p>","pt_BR":"<p>Won-seok “PawN” Heo é um dos jogadores do meio mais conhecidos do mundo, com uma carreira iniciada em 2013. Apesar de ter apenas 19 anos, PawN é um veterano experiente na batalha e tem alguns jogos realmente impressionantes no currículo. PawN chocou o mundo quando abateu Faker sozinho nas Classificatórias da WCG 2013 e desde então não parou mais. A partir dali, entrou para a Samsung White durante um dos períodos mais competitivos e disputados na história da Coreia.</p>\n\n<p>A SSW teve uma atuação dominante durante o Campeonato Mundial 2014 e levou a copa para casa de maneira incontestável. No entanto, a equipe se desfez em resultado a todo esse sucesso e PawN foi para a Edward Gaming no final de 2014. Desde então, ele liderou a EDG em algumas de suas vitórias mais sólidas. Porém, o jovem jogador está lutando contra uma doença. Mas apesar das adversidades, ele ainda está na equipe e está determinado a contribuir.</p>","es_AR":"<p>Won-seok “PawN” Heo es uno de los mejores carrileros centrales del mundo, con una carrera que se inició en el 2013. Con tan solo 19 años, PawN es un veterano endurecido por los enfrentamientos, con partidas realmente impresionantes bajo la manga. PawN deslumbró al mundo cuando derrotó a Faker en WCG 2013 y no para desde entonces. A partir de allí, se encontró en Samsung White durante uno de los juegos más competitivos y cerrados en la historia de Corea.</p>\n\n<p>SSW logró un desempeño deslumbrante durante el Campeonato Mundial 2015 y se llevó la copa a casa de una manera inigualable. Sin embargo, el equipo se desintegró después de todo este éxito y PawN se unió a Edward Gaming a finales del 2014. Desde entonces, condujo a EDG a algunas de las victorias más contundentes. Lamentablemente, el joven jugador tiene que hacer frente a una enfermedad. A pesar de esta adversidad, sigue formando parte del equipo y está determinado a seguir adelante.</p>"},"foreignIds":{"drupalId":"983","ESPORTSTMNT06":"200000342","TRLT3":"200000214"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":102,"slug":"uzi","name":"Uzi","firstName":"Zihao","lastName":"Jian","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/uzi-70vy7ms.png","hometown":"Yichang, China","region":"LPL China","birthdate":null,"createdAt":"2014-07-28T19:09:47.000Z","updatedAt":"2017-06-07T00:03:49.000Z","bios":{"en_US":"","fr_FR":"<p>Jian « Uzi » Zi-Hao est une véritable légende de LoL et il est souvent considéré comme l'un des meilleurs carrys AD du monde. Uzi s'est souvent approché du trône, mais il n'est jamais parvenu à revendiquer la couronne du Championnat du monde. Royal n'est pas passée loin deux années de suite, terminant en deuxième place du Mondial en 2013 et 2014. Malheureusement, Uzi n'a pas été à la hauteur de sa réputation et le carry AD turbulent s'est enlisé dans une mauvaise passe pendant la saison 5.</p>\n\n<p>Mais comme on dit, un vainqueur se définit par sa capacité à reprendre le combat, non pas par ses victoires. Si le proverbe est fondé, Uzi est peut-être l'un des plus grands vainqueurs de League of Legends, et il est sur le point de retenter sa chance à l'événement All-Stars 2016. Même si le Mondial ne s'est pas terminé comme l'aurait voulu Uzi, son style super agressif et rentre-dedans fait son grand retour à Barcelone. Il est considéré comme l'un des carrys les plus puissants de l'événement, alors ses alliés, ses ennemis et ses fans ont intérêt à s'accrocher car, avec Uzi, l'aventure est toujours mouvementée.</p>","es_ES":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas del juego y, a menudo, es considerado uno de los mejores AD carry del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso AD carry sufrió un bajón durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los carry más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pl_PL":"Jian „Uzi” Zi-Hao należy do legend League of Legends i często jest uznawany za jednego z najlepszych prowadzących na świecie. Uzi był już blisko tronu, ale nigdy nie udało mu się zdobyć korony Mistrzostw Świata. Royal odpadali, będąc już bardzo blisko celu w dwóch kolejnych latach, ale musieli zadowolić się drugim miejscem na Mistrzostwach 2013 i Mistrzostwach 2014. Niestety Uzi stracił impet i ten energetyczny prowadzący podczas sezonu 5 popadł w marazm.</p>\n\nAle mówi się przecież, że zwycięzcę poznaje się nie po tym, jak zwycięża, ale po tym, czy potrafi wrócić do walki po przegranej. Jeśli to prawda, to Uzi jest być może jednym z największych zwycięzców w League of Legends — powrócił i walczy o chwałę podczas wydarzenia All-Star 2016. Chociaż Mistrzostwa nie skończyły się w taki sposób, jakiego życzyłby sobie Uzi, jego niezwykle agresywny, bezpośredni styl gry da o sobie znać ponownie w Barcelonie. Uzi uważany jest za jednego z najsilniejszych prowadzących, którzy wezmą udział w tych zawodach, zatem przyjaciele, wrogowie i fani powinni zapiąć pasy, ponieważ Uzi zawsze gwarantuje szaloną jazdę.\n","de_DE":"<p>Jian „Uzi“ Zi-Hao ist eine Legende in League und gehört zu den besten AD-Carrys der Welt. Uzi ist dem Thron schon einige Male sehr nahe gekommen, konnte sich bis jetzt aber nicht zum Weltmeister krönen. Royal hatte zwei Jahre hintereinander das Nachsehen und belegte bei den Weltmeisterschaften 2013 und 2014 den zweiten Platz. Leider hatte Uzis Stoßkraft irgendwann ein Ende und der stürmische AD-Carry stürzte in der fünften Saison in eine Krise.</p>\n\n<p>Aber wie heißt es so schön: Ein Gewinner wird nicht durch seine Siege definiert, sondern dadurch, wie oft er sich dem Kampf stellt. Wenn dieses Sprichwort stimmt, ist Uzi einer der größten Gewinner in League – er ist zurück und kämpft beim All-Stars-Event 2016 um Ruhm und Ehre. Die Weltmeisterschaft ist zwar nicht ganz nach Uzis Wunsch verlaufen, dafür bekommt er mit seinem aggressiven Spielstil die Gelegenheit, in Barcelona zu zeigen, was er kann. Er gilt als einer der besten aller teilnehmenden Carrys, daher sollten sich seine Gegner und Fans besser anschnallen, denn Uzi gibt immer Vollgas.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Uzi 선수는 피지컬이 뛰어난 원딜러로 팀원이 최고의 기량을 끌어내길 요구하는 선수입니다. 완벽주의자이다 보니 그동안 수없이 많은 서포터와 손을 잡았다가 놓길 반복했고 드디어 2013년 Tabe 선수를 만나 만족할만한 파트너를 찾았죠. 이 봇 듀오는 수많은 하이라이트 영상을 뽑아낼 수 있을 정도로 눈부신 플레이를 펼쳤던 팀, Star Horn Royal Club은 두 번이나 월드 챔피언십 결승에 올랐습니다. 하지만 두 번 다 한국팀인 SKT와 삼성 화이트에 패합니다. </p>\n<p style=”font-family:”나눔고딕”;\">질 때조차 Uzi 선수는 대단한 실력을 뽐냈습니다. 2013년 월드 챔피언십에서 OMG를 상대로 보여준 베인 플레이는 리그 오브 레전드 역사상 최고로 꼽히는 플레이죠. 더 큰 시너지를 낼 수 있는 팀을 만난다면, 그리고 부담을 덜어줄 뛰어난 캐리가 그 팀에 있다면 Uzi 선수는 다시 우승의 아이콘이 될 수 있을 겁니다. </p>\n","es_AR":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>","pt_BR":"<p>Jian \"Uzi\" Zi-Hao é uma das lendas do League e muitas vezes considerado um dos melhores atiradores do mundo. Uzi já chegou perto do trono, mas nunca conseguiu colocar as mãos na coroa do Campeonato Mundial. A Royal chegou perto por dois anos seguidos, levando para casa o segundo lugar em 2013 e 2014. Infelizmente, Uzi não correspondeu e entrou em crise durante a 5ª Temporada.</p>\n\n<p>Mas como dizem, um vencedor não é definido por suas vitórias, mas por como ele continua lutando. Se esse provérbio for verdade, Uzi talvez seja um dos grandes vitoriosos do League, pois ele se reergueu e está de volta para lutar mais uma vez por glória no Evento All-Star 2016. Mesmo que o Mundial não tenha acabado bem como Uzi queria, seu estilo ultra agressivo fará uma aparição em Barcelona. Ele é considerado como um dos carregadores mais fortes que vai participar, então cuidado, porque o Uzi vem aí.</p>","cs_CZ":"<p>Jian „Uzi“ Zi-Hao patří mezi legendy LoL a je často označován za jednoho z nejlepších ADC všech dob. Ale ačkoliv měl titul mistra světa hned několikrát na dosah, nikdy jej nezískal. Hned dvakrát po sobě uniklo první místo Royal jen o vlásek – v letech 2013 a 2014 se vrátili z MS se stříbrnými medailemi. Uzi tím bohužel přišel o motivaci a během 5. sezóny se začal tento bouřlivý ADC výrazně zhoršovat.</p>\n\n<p>Ale jak se říká, vítěze z člověka nedělá to, jak často vyhraje, nýbrž kolikrát je schopen vrátit se do boje. Z tohoto pohledu je Uzi jedním z největších vítězů, které LoL kdy spatřilo – je zpět a zúčastní se prestižního turnaje All-Star 2016. MS sice neskončilo podle Uziho představ, ale i tak si budeme moci v Barceloně vychutnat jeho utraagresivní, drzý styl hry. Je považován za jednoho z nejschopnějších ADC, kteří se této akce zúčastní, takže přátelé, soupeři a fanoušci, zapněte si bezpečnostní pásy, protože s Uzim to je pokaždé divoká jízda.</p>","el_GR":"<p>Ο Jian \"Uzi\" Zi-Hao είναι κι αυτός ένας από τους θρύλους του League και πολλοί πιστεύουν ότι είναι ένας από τους καλύτερους AD Carry στον κόσμο. Ο Uzi έχει πλησιάσει αρκετές φορές τον τίτλο, αλλά ποτέ δεν κατάφερε να κερδίσει το στέμμα του Παγκόσμιου Πρωταθλητή. Οι Royal έφτασαν δύο φορές στην πηγή, αλλά δεν ήπιαν νερό. Η πρώτη φορά ήταν στο Παγκόσμιο Πρωτάθλημα του 2013 και η δεύτερη το 2014. Δυστυχώς, ο Uzi δεν κατάφερε να διατηρήσει τον εκρηκτικό ρυθμό του και ο θερμοκέφαλος AD Carry έπεσε σε απόδοση τη Σεζόν 5.</p>\n\n<p>Όμως ο νικητής δεν κρίνεται μόνο από τις νίκες του, αλλά και από την επιμονή του. Σύμφωνα με αυτό το ρητό, ο Uzi είναι ένας από τους μεγαλύτερους νικητές του League, ιδιαίτερα τώρα που θα επιστρέψει για να διεκδικήσει πάλι τη δόξα που του αναλογεί στο Τουρνουά All-Star 2016. Παρόλο που το Παγκόσμιο Πρωτάθλημα δεν είχε την κατάληξη που θα ήθελε ο Uzi, θα έχουμε την ευκαιρία να θαυμάσουμε το προκλητικό και εξαιρετικά επιθετικό του στυλ στη Βαρκελώνη. Θεωρείται ένας από τους ισχυρότερους Carry που θα λάβουν μέρος στο τουρνουά, επομένως καλά θα κάνουν οι συμπαίκτες, οι αντίπαλοι, αλλά και οι θεατές να δέσουν τις ζώνες τους, γιατί σίγουρα δεν θα κάτσει καλά.</p>","hu_HU":"Jian „Uzi” Zi-Hao a LoL egyik legendája, a világ egyik legjobb lövésze. Uzi többször is közel került a csúcshoz, de a világbajnoki címről mindig lemaradt. A Royal két egymást követő évben lett ezüstérmes a vb-n, 2013-ban és 2014-ben. Sajnos úgy tűnt, hogy elfogyott Uzi lendülete, és a zajosan játszó lövész 5. szezonja elég döcögős lett.</p>\n\nDe ahogy mondani szokás, a győztes nem arról ismerszik meg, hogy hány csatát nyer, hanem hogy mindig visszatér a harcba. Ha ez igaz, akkor Uzi lehet a LoL egyik legnagyobb győztese. Visszatért, és mindent megtesz a győzelemért a 2016-os All-Star gálán. Bár a vb nem úgy alakult, ahogy Uzi szerette volna, a végletekig agresszív, az ellenfél arcába mászó stílusa bemutatkozik Barcelonában is. Uzi az egyik legjobb lövész a résztvevők közül, és egy dolog biztos: ha ő ott lesz, akkor őrült futamokra lehet számítani.\n\n","it_IT":"Jian \"Uzi\" Zi-Hao è una delle leggende di LoL ed è considerato uno degli ADC più forti del mondo. Uzi si è avvicinato più volte alla vetta, ma non è mai riuscito a conquistare la Coppa degli evocatori. I Royal hanno mancato l'obiettivo per due anni di seguito, portandosi a casa un secondo posto ai Mondiali nel 2013 e nel 2014. Purtroppo anche Uzi ha risentito delle sconfitte, e il talentuoso ADC ha subito una battuta d'arresto durante la stagione 5.</p>\n\nTuttavia, come si dice, il vero valore non sta nelle vittorie, ma nel sapersi rialzare dopo le sconfitte. Se il detto ha ragione, Uzi potrebbe esser uno dei più grandi campioni di LoL, dal momento che non ha mai smesso di rialzarsi ed è pronto a combattere per la gloria all'All-Star 2016. Anche se i Mondiali non si sono conclusi come Uzi avrebbe desiderato, il suo stile sprezzante e ultra aggressivo tornerà a stupirci a Barcellona. È ancora uno dei più potenti carry in circolazione, quindi alleati, avversari e fan faranno meglio ad allacciarsi le cinture, perché con Uzi al volante si corre a tavoletta.\n","ro_RO":"Jian ''Uzi'' Zi-Hao este una dintre legendele din LoL și este adesea considerat unul dintre cei mai buni AD Carry din lume. Uzi a dat târcoale tronului, dar nu a reușit niciodată să-și adjudece titlul de Campion Mondial. Royal au fost la un pas de victorie doi ani la rând, terminând pe locul doi la Mondialele din 2013 și 2014. Din păcate, elanul lui Uzi a mai slăbit, iar AD carry-ul de temut a intrat pe un trend descendent în sezonul 5.</p>\n\nDar, după cum se zice, învingătorul nu e stabilit după numărul de victorii, ci după numărul de reveniri în luptă. Dacă e adevărat, Uzi ar putea fi unul dintre cei mai mari învingători din lumea eSports LoL, pentru că s-a întors să lupte pentru glorie la All-Star Event 2016. Chiar dacă Mondialele nu s-au încheiat așa cum și-ar fi dorit el, stilul său foarte agresiv revine în lumina reflectoarelor în Barcelona. Uzi este considerat unul dintre cei mai puternici carry din competiție, deci prietenii, inamicii și fanii săi ar trebui să se țină bine, deoarece călătoria e mereu nebunească alături de el.\n","es_MX":"<p>Jian \"Uzi\" Zi-Hao es una de las leyendas de este juego y, a menudo, es considerado uno de los mejores tiradores acarreadores del mundo. Uzi ha estado cerca del trono, pero nunca ha conseguido ponerse la corona del Campeonato Mundial. Royal se quedó a punto durante dos años seguidos, en los que acabó en segundo lugar en los Mundiales de 2013 y 2014. Por desgracia, el ímpetu de Uzi no fue suficiente y el tumultuoso tirador acarreador sufrió un bajón de nivel durante la temporada 5.</p>\n\n<p>Pero, como se suele decir, a un ganador no lo definen sus victorias, sino cuántas veces es capaz de volver a la pelea. Si este proverbio es cierto, Uzi quizá sea uno de los mayores ganadores del juego, ya que ha vuelto en busca de gloria al All-Star Event 2016. Aunque el Mundial no acabase como Uzi habría querido, su estilo superagresivo y provocativo tendrá ocasión de reaparecer en Barcelona. Está considerado uno de los acarreadores más fuertes que asistirán al evento, así que más vale que los oponentes y los fans se abrochen los cinturones, porque con Uzi todo es una montaña rusa.</p>"},"foreignIds":{"drupalId":"705","TRLH1":"1001380041","TRLH3":"1001360059","TRLH2":"1001280011","TRLH4":"1001310059"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":290,"slug":"koro1","name":"Koro1","firstName":"Yang","lastName":"Tong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/koro1-di0owlst.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:47:53.000Z","bios":{"en_US":"","fr_FR":"<p>\nTong « Koro1 » Yang assoit sa supériorité dans la Faille avec un poing d'acier. Si on le voit souvent écraser ses adversaires avec des champions tanky, Shen ou Gnar par exemple, Koro1 aime aussi détruire l'ennemi avec des combattants tels que Darius.\n</p>\n<p>À bien des égards, Koro1 est le contre parfait de Clearlove, le jungler d'EDG. Si Clearlove préfère jouer avec des junglers de type carry et s'acheter des objets offensifs, Koro1 privilégie les champions qui peuvent protéger ses coéquipiers tout en étant capables d'infliger des dégâts.\n</p>\n<p>\nEt il n'est pas du tout manchot. Après qu'EDG a affronté SKT lors du Mid-Season Invitational, MaRin (pourtant très sûr de lui) a tiré son chapeau à la performance de Koro1. « Je pense que Koro1 est vraiment un bon joueur et il peut se montrer carrément brillant. » Et quand l'un des meilleurs top-laners des LCK vous fait des compliments, ça veut probablement dire quelque chose. Malheureusement, les performances de Koro1 n'ont pas été suffisantes pour sauver EDG lors du mondial 2015. Mais il sera certainement prêt à prendre sa revanche lors de l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nTong „Koro1” Yang udowodnił innym, że jest mistrzem Riftu, a dokonywał tego żelazną pięścią. swoich Przeciwników najczęściej rozgramia wytrzymałymi bohaterami, takimi jak Shen albo Gnar, ale nie stroni też od osiłków, takich jak Darius.\n</p>\n<p>\nPod wieloma względami Koro1 jest idealnym odpowiednikiem Clearlove'a, dżunglera z EDG. Clearlove preferuje jednak grę dżunglerami prowadzącymi, a także inwestowanie w przedmioty umożliwiające zadawanie obrażeń, z kolei Koro1 jest ekspertem w kwestii bohaterów, którzy mogą chronić sojuszników, jednocześnie zadając sensowne obrażenia.\n</p>\n<p>\nZ pewnością nie można go nazwać fajtłapą. Gdy EDG stawiało czoła SKT w turnieju Mid-Season Invitational, zazwyczaj pewny siebie MaRin przyznał, że chyli przed Koro1 czoła. „Sądzę, ze Koro1 jest naprawdę dobrym graczem, okazującym chwilami przebłysk geniuszu”, wyjaśnił MaRin. Jeśli chwali cię jeden z najlepszych graczy w górnej alejce w całej LCK, znaczy to, że jesteś naprawdę dobry. Niestety popisy Koro1 nie wystarczyły, aby uratować EDG podczas mistrzostw świata 2015. Ale możecie być pewni, że zechce się zemścić podczas All-Star Event 2015.\n</p>","de_DE":"<p>Tong „Koro1“ Yang stammt aus Leping in China, ist bereits seit 2013 Profi, wurde von seinem Teamkameraden ClearLove betreut und ist EDGs Top-Laner und ein richtiger Veteran. Ursprünglich galt Koro1 als oberflächlicher Spieler, der nur mit Supportern spielen konnte, aber sein Mentor ClearLove legte ein gutes Wort für ihn ein und verschaffte ihm einen Platz bei EDG. Koro1, der für seine unglaubliche Arbeitsmoral bekannt ist, konnte mit EDG einige Spiele gewinnen. Zuerst besiegten sie OMG beim Internationalen E-Sport-Turnier 2014 eines Drittanbieters. Dann gewann sie zum ersten Mal die LPL. \nKoro1 spielte wegen seiner Unerfahrenheit hauptsächlich mit defensiven Champions wie Trundle und Renekton. Als sein Selbstbewusstsein wuchs, begann er auch mit den Hypercarrys Jax und Kayle sowie Ryze und Irelia zu spielen, die mehrere Lanes gleichzeitig pushen können. Im Laufe der Jahre etablierte sich Koro1 als erfahrener Top-Laner, dem ein Meer aus Champions zur Verfügung steht. Seine Einstellung und sein Optimismus machen ihn zu einem tödlichen Gegner, während er sich als Spieler stets verbessert und weiterentwickelt. </p>","es_ES":"<p>Aconsejado por su compañero ClearLove, Tong \"Koro1\" Yang, natural de la ciudad china de Leping, es el jugador de la calle superior de EDG, además de un auténtico veterano, ya que lleva jugando de forma competitiva desde 2013. Al principio, a Koro1 se le consideraba un jugador superficial que solo servía para aportar utilidad, pero ClearLove, su mentor, intervino y Koro1 se hizo con un hueco en EDG. Se le conoce por su increíble ética de trabajo y empezó a conseguir victorias con EDG. Primero vencieron a OMG en el International Esports Tournament (un evento organizado por terceros) en 2014. Y después ganaron su primera final de la LPL.</p>\n\n<p>Koro1 evolucionó para convertirse en un jugador cómodo con Trundle y Renekton, ya que usaba su falta de experiencia para perfeccionar campeones que juegan a remolque. Según iba ganando confianza, se dedicó a campeones hypercarry especializados en el avance dividido, como Jax y Kayle, e incluso Ryze e Irelia. Con el paso de los años, Koro1 se ha abierto paso hasta convertirse en un veterano de la calle superior con un sinfín de campeones a su disposición. Su ética de práctica y su optimismo hacen que sea un oponente letal, ya que siempre busca mejorar y evolucionar como jugador.</p>","pt_BR":"<p>Orientado pelo companheiro de equipe, Clearlove, e vindo de Leaping City na China, Tong “Koro1” Yang é o jogador do topo da EDG e um verdadeiro veterano, pois já compete profissionalmente desde 2013. A princípio, Koro1 era considerado um jogador fraco que só era bom em utilidade, mas seu mentor, Clearlove, intercedeu a seu favor e ele conseguiu uma vaga no elenco da EDG. Koro1 é bastante conhecido por sua incrível ética profissional e na EDG ele conseguiu abocanhar algumas vitórias. Primeiro, eles derrotaram a OMG no Torneio Internacional de e-Sports em 2014. Em seguida, eles ganharam sua primeira final na LPL.</p>\n\n<p>Koro1 se tornou um jogador que se sentia confortável jogando com Trundle e Renekton, e usava sua falta de experiência para aperfeiçoar campeões que jogavam na retaguarda. À medida que ganhou confiança, ele escolheu hipercarregadores de investidas divididas, como Jax e Kayle, e até Ryze e Irelia. Ao longo dos anos, Koro1 se tornou um jogador veterano do topo, com um mar de campeões a sua disposição. Sua conduta ética e seu otimismo o tornam um adversário fatal, enquanto ele está sempre melhorando e evoluindo enquanto jogador.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Tong \"Koro1\" Yang 선수는 협곡에서 철권을 휘두르며 상대를 압도합니다. 주로 쉔이나 나르 같은 탱커를 플레이하지만 다리우스 같은 딜탱으로 상대를 박살 내기도 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">여러모로 Koro1 선수는 EDG의 정글러인 Clearlove 선수와 서로 보완하는 관계입니다. Clearlove 선수는 캐리 정글러 스타일로 주로 공격력 아이템을 맞추는 편이라면 Koro1 선수는 팀원을 보호하면서 어느 정도 적에게 위협이 되는 챔피언을 플레이하죠. </p>\n<p style=”font-family:”나눔고딕”;\">게다가 실력도 출중합니다. 미드 시즌 인비테이셔널에서 EDG가 SKT와 맞대결을 펼친 후, 항상 자신 넘치는 MaRin 선수가 Koro1 선수는 정말 뛰어난 선수이고 눈부신 활약을 보여줬다며 실력을 인정하기도 했죠. LCK 최고의 탑 라이너에게서 이런 칭찬을 들었으니 진정 우수한 선수임이 틀림없습니다. 하지만 이 선수의 뛰어난 실력도 2015 월드 챔피언십에서 팀을 끌어올리진 못했습니다. 그러니 이번 올스타 대회가 설욕의 기회가 된 셈입니다. </p>\n","es_AR":"<p>Oriundo de Leping City en China, y con su compañero de equipo ClearLove como mentor, Tong “Koro1” Yang es carrilero superior de EDG y un veterano de verdad que juega en forma competitiva desde el 2013. Originalmente, Koro1 era considerado un jugador chato que no podía salir de ahí, pero su mentor ClearLove expresó su opinión y Koro1 logró un lugar en el equipo de EDG. Koro1 es conocido por su loca ética de trabajo y comenzó a lograr victorias mientras estaba en EDG. Primero, vencieron a OMG en el Torneo Internacional de eSports en el 2014. Después, ganaron la primera final de la LPL.</p>\n\n<p>Koro1 se convirtió en un jugador que se sentía cómodo en Trundle y Renekton y utilizó su inexperiencia para perfeccionar a campeones que jugaban desde atrás. Después de adquirir confianza, tomó a Jax y Kayle, los hiperacarreadores de empuje en varios carriles, y también a Ryze e Irelia. Con el pasar de los años, Koro1 se convirtió en carrilero superior veterano con un océano de campeones a su disposición. Su ética de práctica y su optimismo lo convirtieron en un excelente oponente que está siempre mejorando y evolucionando como jugador.</p>"},"foreignIds":{"drupalId":"2088","TRLH3":"1001160037","TRLH1":"1001410001","TRLH2":"1001290001","TRLH4":"1001160037","TRLT3":"200000239"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":304,"slug":"deft","name":"Deft","firstName":"Hyeokgyu","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deft-4s8iwywa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-07-06T14:18:47.000Z","bios":{"en_US":"<p>\nThere are many ways to introduce Hyeokgyu “Deft” Kim: Ezreal fanatic, world class AD carry, veteran, hypercarry... Deft has been playing since 2013, earning accolades as a player who could pump out absurd amounts of damage thanks to his ability to duck, dodge, and weave through teamfights.\n</p>\n<p>\nAfter the 2014 World Championship, Deft joined up with Edward Gaming, beginning an era of dominance where the team picked up a series of convincing victories. It started with the 2015 Demacia Cup Spring, and then continued into the 2015 LPL Spring Split, where EDG only dropped six games in total. From there, EDG picked up the top prize at the 2015 Mid-Season Invitational, winning a thrilling Bo5 series against SKTelecom T1, 3-2. Yet through it all, something has eluded Deft...he has yet to take home the greatest prize of all: the World Championship.\n</p>","fr_FR":"<p>Hyuk-kyu « Deft » Kim est réputé pour être l'un des carrys AD les plus agressifs du monde, ce qui nous change de ses débuts professionnels chez Samsung Blue, où il avait plus tendance à fuir un combat qu'à tenter l'affrontement. Mais depuis qu'il a rejoint les LPL, Deft tend à repousser les limites de ses champions (pour ne pas dire qu'il les dépasse de temps en temps). De façon générale, Deft fait preuve de force et de confiance dès qu'il arrive sur la Faille.</p>\n\n<p>Par contraste, Deft, en personne, est plutôt discret, voire effacé. Il suit souvent ses coéquipiers dans la maison d'EDG, ne sachant visiblement pas trop quoi faire par lui-même. Peut-être espère-t-il que la voix douce de Meiko, son partenaire sur la voie du bas, le ramènera à bon port.</p>","pl_PL":"<p>Hyuk-kyu „Deft” Kim uważany jest powszechnie za jednego z najagresywniejszych prowadzących na świecie. Wiele się zmieniło, odkąd zaczynał karierę w Samsung Blue. Wówczas prędzej był gotów uciekać niż nawiązać walkę z przeciwnikiem. Odkąd jednak Deft przeniósł się do LPL, coraz częściej zdarza mu się w pełni wykorzystywać zalety swoich bohaterów (a także podejmować ryzykowne decyzje). Ilekroć Deft wyrusza na Rift, wykazuje się siłą i pewnością siebie.</p>\n\n<p>Z kolei w życiu prywatnym jest osobą cichą, wręcz potulną. Często zdarza mu się chodzić po domu drużynowym za pozostałymi członkami EDG, jakby nie wiedział, co robić, gdy zostaje sam. Być może wyczekuje kojącego głosu Meiko, partnera z dolnej alejki.</p>","de_DE":"<p>Man kann Hyuk-kyu „Deft“ Kim auf viele Arten vorstellen: Als Ezreal-Freak, als Weltklasse-AD-Carry, als Veteran, als Hypercarry … Deft spielt schon seit 2013 und hat als Spieler, der dank seiner schnellen Reflexe in Teamkämpfen unglaublichen Schaden austeilen kann, einige Auszeichnungen gewonnen.\nNach der Weltmeisterschaft 2014 wechselte Deft zu Edward Gaming und leitete damit eine Ära ein, in der die Mannschaft im Frühjahr beim Demacia Cup 2015 und kurz darauf beim Frühjahrs-Split der LPL 2015 einen überzeugenden Sieg nach dem anderen feierte und insgesamt nur sechs Spiele verlor. Danach gewann EDG das spannende Finale des Mid-Season Invitational 2015 gegen SKTelecom T1 mit 3–2. Deft war schon bei vielen internationalen Turnieren, aber eines fehlt ihm immer noch: der Weltmeistertitel. Deft hat bewiesen, dass er immer alles tut, um sein Ziel zu töten. Während sich EDG auf die Weltmeisterschaft vorbereitet, müssen sich die anderen Mannschaften vor seinem beweglichen und riskanten, aber lohnenden Spielstil in Acht nehmen. Eines ist jedenfalls sicher: Solange Deft in der Kluft ist, darf man EDG niemals abschreiben.</p>","es_ES":"<p>Hay muchas maneras de presentar a Hyuk-kyu \"Deft\" Kim: fanático de Ezreal, AD carry de talla mundial, veterano, hypercarry... Deft lleva jugando desde 2013 y ha conseguido elogios como jugador capaz de infligir cantidades ingentes de daño gracias a su capacidad de eludir, esquivar y moverse en los combates de equipo.</p>\n\n<p>Después del Campeonato Mundial 2014, Deft se unió a Edward Gaming, lo que dio comienzo a una era de dominio en la que el equipo se hizo con una serie de victorias convincentes en la 2015 Demacia Cup Spring y en la fase de primavera de la LPL de 2015, donde solo perdieron seis partidas. Después EDG consiguió subir a lo más alto del MSI 2015, tras una emocionante victoria por 3 a 2 en una serie al mejor de 5 contra SK Telecom T1. </p>\n\n<p>Deft ha participado en muchos torneos internacionales, pero todavía le falta por llevarse a casa el mayor premio de todos: el título del Campeonato Mundial. Ha demostrado que cuando tiene un asesinato a la vista, hará todo lo que haga falta para conseguirlo. Con EDG en el Mundial, los rivales tendrán que tener cuidado con su estilo de juego de gran movilidad, gran riesgo y gran recompensa. Una cosa está clara: mientras Deft esté en la Grieta, no se puede dar a EDG por muerto.</p>","pt_BR":"<p>Podemos apresentar Hyuk-kyu “Deft” Kim de várias formas: Fanático por Ezreal, atirador de nível internacional, veterano, hipercarregador... Deft joga desde 2013 e é tido como um jogador que consegue causar quantidades absurdas de dano graças a sua habilidade de se esconder, desviar e driblar em confrontos de equipe.</p>\n<p>Depois do Campeonato Mundial 2014, Deft entrou para a Edward Gaming, iniciando uma era de domínio em que a equipe conquistou uma série de vitórias convincentes na Etapa de Primavera da Demacia Cup 2015 e depois a Série de Primavera da LPL 2015, onde a EDG só perdeu seis jogos no total. Depois disso, a EDG levou o primeiro lugar no MSI 2015, ganhando uma série de melhor de cinco contra a SKTelecom T1 por 3 a 2. Deft já participou de inúmeros torneios internacionais, mas ainda não levou para casa o grande prêmio: o Campeonato Mundial. Mas já demonstrou que quando coloca uma presa na mira, ele faz de tudo para abatê-la. Com a EDG no Mundial, os oponentes precisarão tomar cuidado com seu estilo de jogo de alta mobilidade, alto risco e alta recompensa. Uma coisa é certa: enquanto Deft continuar no Rift, a EDG continua na parada.</p>","es_AR":"<p>Existen muchas maneras de presentar a Hyuk-kyu “Deft” Kim: fanático de Ezreal, ADC de primera categoría, veterano, hiperacarreador... Deft no deja de jugar desde el 2013, consagrándose como un jugador capaz de infligir absurdas cantidades de daño gracias a su habilidad para agacharse, esquivar y eludir peleas en equipo.</p>\n\n<p>Después del Campeonato Mundial 2015, Deft se unió a Edward Gaming y comenzó una era de dominio en la que el equipo consiguió una serie de victorias en la Copa de Verano de Demacia 2015 y luego en la Serie de Primavera de LPL 2015, donde EDG solo perdió seis partidas en total. Después, EDG consiguió el primer premio en el Torneo por Invitación de Mitad de Temporada 2015, ganando por 3-2, una increíble serie al mejor de 5 contra SKTelecom T1. Deft participó en un montón de torneos internacionales, pero aún le falta llevarse a casa el premio más importante de todos: el Campeonato Mundial. Deft demostró que consigue lo que se propone y hará todo lo que esté a su alcance para lograrlo. Cuando EDG llegue al Mundial, los oponentes tendrán que cuidarse de su estilo de juego sumamente ágil, de alto riesgo y altura. Una cosa es segura: siempre que Deft esté parado en la Grieta, no podrás contra EDG.</p>"},"foreignIds":{"drupalId":"985","ESPORTSTMNT06":"200000343","TRLT3":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":704,"slug":"letme","name":"Letme","firstName":"Jun-ze","lastName":"Yan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/letme-coxczdev.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:45.000Z","bios":{"en_US":"","es_AR":"<p>Luego de jugar para Gamtee, LetMe fue reclutado para la organización Royal después de una tórrida temporada en el LPL, terminando en el puesto número 11. Elegido como respaldo para Looper, LetMe ha entrado en dos partidas durante este torneo y ha demostrado un gran compromiso como un tanque confiable.</p>\n\n<p>Habiendo jugado competitivamente únicamente durante dos temporadas, aún le queda mucho camino por recorrer para conseguir un puesto inicial en la alineación del equipo.</p>","de_DE":"<p>LetMe spielte ursprünglich für Gamtee und wurde nach einer hitzigen Saison in der LPL mit einem 11. Platz von der Royal-Organisation rekrutiert. Als Ersatz für Looper verpflichtet wurde LetMe in diesem Split in zwei Spielen eingesetzt und zeigte dabei viel Potenzial als zuverlässiger Tank. </p>\n\n<p>Da er erst seit zwei Saisons auf Wettkampfniveau spielt, hat er noch einen weiten Weg vor sich, um sich einen Platz in der Startformation des Teams zu sichern.\n</p>","pl_PL":"<p>Oryginalnie grający dla Gamtee, LetMe został zwerbowany do organizacji Royal po ciężkim sezonie w LPL, który zakończył na 11. miejscu. Wybrany na zastępcę Loopera, LetMe brał udział w dwóch meczach w tym splicie, pokazując, że świetnie gra obrońcami. </p>\n\n<p>Profesjonalnie grał tylko przez dwa sezony, więc czeka go jeszcze długa droga, aby zostać głównym zawodnikiem drużyny.</p>\n"},"foreignIds":{"drupalId":"3763","TRLT3":"200000234"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":709,"slug":"mlxg","name":"Mlxg","firstName":"Shiyu","lastName":"Liu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mlxg-4e5ftigd.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:44:59.000Z","bios":{"en_US":"","es_AR":"<p>Llaman a Liu \"Mlxg\" Shi-yu así dado que es un acrónimo para Ma La Xiang Guo, un caldero mongol picante. Este junglero ha tenido una ardiente carrera últimamente, lo que hace que su título sea apropiado. Mlxg está en la jungla para los Royal Never Give Up desde el verano del 2015 y ha aparecido en una multitud de eventos nacionales al igual que en IEM Katowice.</p>\n\n<p>Este será el primer Campeonato Mundial de Mlxg, pero, si tomamos su elección de campeón como un indicativo, está más que listo para el desafío de un territorio no explorado: Rengar y Lee Sin. Aún cuando está jugando una partida amistosa de metajuego, se vira a elecciones agresivas como Graves y Elise. El junglero de RNG puede ser uno de los miembros menos conocidos del equipo, pero, en este Mundial, Mxlg se asegurará de que todo el mundo lo recuerde.</p>","fr_FR":"<p>Shi-yu « Mlxg » Liu est l'un des meilleurs carrys junglers de la scène des LPL. Il a enregistré des statistiques impressionnantes avec des champions comme Graves, Kindred et Nidalee, en suivant la voie royale empruntée par RNG jusqu'à la victoire. Sa Nidalee, plus particulièrement, a atteint un KDA de 8;27 lors de la portion régulière du segment.</p>\n\n<p>Largement favorisé par la méta actuelle, Mlxg peut souvent être aperçu en train de pourchasser le jungler ennemi. Son style de jeu agressif lui permet de prendre une large avance en termes d'or et d'expérience, grâce à ses invasions répétées dans la jungle ennemie pour affaiblir son homologue et l'empêcher de rattraper son retard.</p>\n\n<p>Mxlg est un acronyme qui reprend la forme syllabique d'un plat épicé chinois... et le moins qu'on puisse dire, c'est qu'il a su mettre le feu à la scène des LPL ! Bien qu'il n'ait jamais vraiment fait ses preuves en dehors des compétitions nationales, le fait qu'il joue en priorité par rapport à InSec en dit long sur ses capacités.\n</p>","es_ES":"<p>A Liu \"Mlxg\" Shi-Yu lo llaman así porque es un acrónimo de \"Ma La Xiang Guo\", un estofado picante. El jungla ha visto su carrera al rojo vivo últimamente, lo que hace que sea más que apropiado. Mlxg lleva en la jungla para Royal Never Give Up desde el verano de 2015 y ha aparecido en muchos eventos domésticos, así como en el IEM Katowice. </p>\n\n<p>Este será el primer Campeonato Mundial para Mlxg, pero si su elección de campeón, Rengar y Lee Sin, sirve de indicador, está más que preparado para el desafío de explorar un territorio desconocido. Incluso cuando juega campeones adaptados al metajuego, se acerca más a elecciones agresivas como Graves y Elise. El jungla de RNG puede que sea uno de los miembros menos conocidos de la plantilla, pero en este Mundial se encargará de que el mundo lo recuerde.</p>","de_DE":"<p>Der Beschwörername von Liu „Mlxg“ Shi-Yu steht für „Ma La Xiang Guo“ und bedeutet „würzig scharfer Topf“. Und da die Karriere dieses Jungler in letzter Zeit richtig heiß ist, ist der Name auch mehr als passend. Mlxg ist seit Sommer 2015 der Jungler von Royal Never Give Up und war schon bei einigen Events in seiner Region sowie beim IEM Katowice mit von der Partie. \nDas wird Mlxgs erste Weltmeisterschaft, aber seine Champion-Wahl (Rengar und Lee Sin) zeigt, dass er mehr als bereit ist, sich auf unerforschtes Terrain zu wagen. Selbst wenn er seine Wahl anhand des Metaspiels trifft, tendiert er zu aggressiven Champions wie Graves und Elise. RNGs Jungler gehört zwar zu den unbekannteren Mitgliedern der Mannschaft, aber bei dieser Weltmeisterschaft wird Mlxg sicherstellen, dass sich die Welt seinen Namen merkt.</p>","pl_PL":"<p>Shi-yu „Mlxg” Liu jest jednym z najlepszych prowadzących dżunglerów w LPL. Osiągnął absurdalnie dobre wyniki na takich postaciach jak Graves, Kindred i Nidalee podczas serii zwycięstw RNG. Szczególnie jego Nidalee jest wyjątkowa, gdyż osiągnął na niej stosunek zabić do zgonów wynoszący 8,27 podczas regularnego splitu.</p>\n\n<p>Mlxg, dla którego obecna meta jest niezwykle korzystna, bardzo często poluje na wrogich dżunglerów. Jego agresywne zagrania często prowadzą do dużej przewagi pod względem złota i doświadczenia, a regularne inwazje w dżungli powodują, że jego rywal nie jest w stanie odrobić straty.</p>\n\n<p>Mlxg już stał się bardzo rozpoznawalny w LPL. Mimo że nie mieliśmy okazji zobaczyć go na międzynarodowych turniejach, fakt, że zastąpił Inseca świetnie świadczy o jego możliwościach.</p>\n","pt_BR":"<p>O apelido de Liu “Mlxg” Shi-Yu veio de uma abreviação de Ma La Xiang Guo, uma espécie de erva picante. O caçador têm tido uma carreira bem temperada até agora, então o apelido até que lhe cai bem. Mlxg é caçador da Royal Never Give Up desde o verão de 2015 e participou de vários eventos nacionais, bem como da IEM Katowice.</p>\n<p>Este será o primeiro Campeonato Mundial da Mlxg, mas se sua escolha de campeões (Rengar e Lee Sin) diz alguma coisa, é que ele está mais do que pronto para o desafio de explorar novos territórios. Mesmo quando ele joga com campeões favoráveis ao meta, ele faz escolhas mais agressivas como Graves e Elise. O Caçador da RNG pode ser o integrante menos conhecido da equipe, mas neste Mundial, Mlxg vai fazer de tudo para que o mundo se lembre dele.</p>"},"foreignIds":{"drupalId":"3772","TRLT3":"200000235","TRLH1":"1001380039","TRLH2":"1001280009"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":710,"slug":"xiaohu","name":"Xiaohu","firstName":"Yuanhao","lastName":"Li","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiaohu-5h6g1y08.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:45:11.000Z","bios":{"en_US":"","es_AR":"<p>Li \"xiaohu\" Yuan-Hao entró a la LPL con muy bajas expectativas sobre sus hombros. Como un prometedor talento nuevo, los simpatizantes esperaban que xiaohu llenara los zapatos de otros carrileros centrales chinos. Pero a pesar de la presión, xiahou apenas comenzó a hacerse a un nombre por cuenta propia.</p>\n\n<p>En el MSI del 2016, Faker se mantuvo en el carril medio con muy poca vida en contra de LeBlanc. Fue aquí donde xiahou demostró que no dudaría: hizo explotar a Faker y a todo el estadio también, al animar a RNG y a xiahou a seguir. Ahora, xiahou se prepara para pisar otro escenario internacional. A pesar de que RNG no pudo tomar el ímpetu de las fases grupales en las eliminatorias durante el Torneo por Invitación de Mitad de Temporada, el equipo maduró y aprendió de esta experiencia, y xiahou se ha ido desarrollando discretamente. No podemos esperar para ver qué aportará a la escena internacional.</p>","fr_FR":"<p>Yuan-Hao « Xiaohu » Li est le midlaner de Royal Never Give Up. Il a fait ses débuts aux côtés de Gamtee avant de remporter les LPL au printemps 2016 avec RNG. Xiaohu est connu pour sa maîtrise de LeBlanc : il affiche un taux de victoire époustouflant de 87,5% avec la Manipulatrice pendant la saison régulière, et il est capable d'écraser ses opposants et de soutenir son jungler pour réaliser des actions spectaculaires en plein territoire ennemi.\nIl est également capable de s'adapter facilement, et peut jouer des assassins ou des mages de contrôle à un très haut niveau. Qu'il joue avec la Téléportation ou qu'il incarne un assassin hyper-mobile en voie du milieu, vous pouvez vous attendre à ce que Xiaohu fonde sur ses opposants s'il a la moindre occasion de se balader sur la carte.</p>\n","es_ES":"<p>Li \"xiaohu\" Yuan-Hao llegó a la LPL con expectativas muy grandes a sus espaldas. Como nuevo talento en ciernes, los seguidores esperaban que xiaohu estuviese a la altura del exigente legado de otros jugadores chinos de la calle central. Pero, a pesar de la presión, xiaohu ya ha empezado a labrarse un nombre.</p>\n\n<p>En el MSI 2016, Faker estaba en la calle central con poca vida contra una LeBlanc. Y aquí fue cuando xiaohu demostró que no dudaría. Borró a Faker y todo el estadio abarrotado gritó de júbilo, animando a RNG y a xiaohu. Ahora se prepara para subirse otra vez a un escenario internacional. Aunque RNG no fue capaz de trasladar el ímpetu de la fase de grupos a los playoffs en el MSI, el equipo ha crecido y aprendido de la experiencia y xiaohu ha evolucionado con discreción. Estamos deseando ver su actuación en el escenario internacional.</p>","de_DE":"<p>Die Erwartungen an Li „xiaohu“ Yuan-Hao waren enorm hoch, als er seine Karriere in der LPL startete. Er war ein vielversprechendes junges Talent und die Fans erwarteten, dass er das schwierige Erbe der anderen chinesischen Mid-Laner antreten würde. Aber trotz des Drucks konnte sich xiaohu bereits einen Namen machen. \nBeim Mid-Season Invitational 2016 stand Faker mit wenig Lebenspunkten LeBlanc gegenüber. In diesem Moment zeigte xiaohu dann allen, dass er niemals zögert – er vernichtete Faker und brachte das Stadion zum Überkochen, bis alle Fans nur noch RNG und xiaohu zujubelten. Jetzt bereitet sich xiaohu darauf vor, die nächste internationale Bühne zu betreten. RNG konnte das Momentum aus der Gruppenphase damals nicht in die Entscheidungsspiele des Mid-Season Invitational mitnehmen, aber die Mannschaft hat daraus gelernt und xiaohu hat sich heimlich, still und leise weiterentwickelt. Wir freuen uns schon darauf, wie er sich auf der internationalen Bühne schlagen wird.</p>","pl_PL":"<p>Yuan-Hao „Xiaohu” Li jest środkowym dla Royal Never Give Up. Debiutował w Gametee, a następnie przeniósł się do RNG, gdzie wygrał wiosenne LPL 2016. Xiaohu słynie ze swojej gry LeBlanc, podczas której miażdży swojego przeciwnika z alei i wspiera swojego dżunglera, aby móc działać na terytorium wrogów.</p>\n\n<p>Niezwykle dobrze potrafi przystosować się do sytuacji pokazując, że świetnie gra zabójcami i kontrolującymi magami. Niezależnie od tego, czy korzysta z Teleportacji, czy gra bardzo mobilnym zabójcą na środku, Xiaohu będzie atakował swoich przeciwników, jeżeli tylko zyska okazję do wędrowania.</p>\n"},"foreignIds":{"drupalId":"3762","TRLT3":"200000236","TRLH1":"1001380040","TRLH2":"1001280010"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":712,"slug":"wuxx","name":"Wuxx","firstName":"Cheng","lastName":"Wang","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wuxx-6wtghiw5.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-07T00:11:30.000Z","bios":{"en_US":"","es_AR":"<p>Cheng 'Wuxx' Wang es uno de los dos tiradores del equipo Royal Never Give Up y es capaz de usar una gran variedad de campeones para aportar el daño a su equipo. Reconocido como el acarreador AD más agresivo, Wuxx ha jugado casi toda la temporada regular para RNG, abriéndose camino entre sus competidores con su fase de carril dominante.</p>\n\n<p>Usado como el principal golpeador en su quinta partida en contra de World Elite durante las semifinales del Torneo de Primavera de la LPL de 2016, Wuxx superó con creces las expectativas y enterró a sus oponentes bajo una tormenta de balas a cargo de Lucian.</p>","fr_FR":"<p>Cheng « Wuxx » Wang est l'un des deux ADC de l'équipe Royal Never Give Up, et il est capable de jouer une grande variété de champions pour augmenter le potentiel de dégâts de son équipe. Considéré comme le plus agressif des deux carrys AD, Wuxx a joué la majeure partie de la saison régulière aux côtés de RNG, à balayer ses adversaires en dominant la phase de laning.</p>\n\n<p>Amené sur le terrain comme frappeur suppléant lors du 5e match de l'équipe contre World Elite, pendant les demi-finales des LPL au printemps 2016, Wuxx a relevé le défi haut la main et à noyé ses opposants sous une pluie de balles avec son Lucian.</p>\n","es_ES":"<p>Cheng \"Wuxx\" Wang es uno de los dos AD carry de Royal Never Give Up, y juega con una gran variedad de campeones que sustentan el daño del equipo. Conocido por ser el AD carry más agresivo, Wuxx ha jugado la mayor parte de la temporada regular para RNG, dejando en la cuneta a los oponentes con sus avasalladoras fases de calles.</p>\n\n<p>Alineado en la quinta partida contra World Elite durante las semifinales de primavera 2016 de la LPL, Wuxx luchó contra la presión y hundió a los oponentes con una tormenta de balas gracias a su Lucian.</p>","de_DE":"<p>Cheng „Wuxx“ Wang ist einer von zwei ADCs im Team Royal Never Give Up. Er spielt eine Reihe von Champions, um für sein Team Schaden anzurichten. Wuxx gilt als der aggressivere AD-Carry und hat den Großteil der regulären Saison für RNG gespielt. Mit seiner dominanten Laning-Phase wischt er seine Herausforderer beiseite.</p>\n\n<p>Im 5. Spiel des Halbfinales beim LPL Spring 2016 gegen World Elite wurde Wuxx als Joker gebracht ... und erledigte seine Aufgabe mit Bravour. Er wählte Lucian und ließ die Gegner in einem Kugelhagel versinken.\n</p>","pl_PL":"<p>Cheng „Wuxx” Wang jest jednym z dwóch prowadzących w Royal Never Give Up, grając wieloma bohaterami, którzy zadają obrażenia dla drużyny. Uważany za bardziej agresywnego prowadzącego, Wuxx przez większość sezonu grał dla RNG, miażdżąc swoich przeciwników podczas fazy walki w alejach.</p>\n\n<p>Wciągnięty z rezerwy podczas piątego meczu przeciwko World Elite w półfinałach wiosennego LPL 2016, Wuxx pokazał na co go stać i zalał swoich przeciwników deszczem pocisków jako Lucian.</p>\n"},"foreignIds":{"drupalId":"4534","TRLT3":"25065","TRLH1":"1001380043","TRLH2":"1001280013"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":749,"slug":"score","name":"Score","firstName":"Dong-bin","lastName":"Ko","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/score-gtlz6pjd.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:20:25.000Z","bios":{"en_US":"<p>Dong-bin \"Score\" Ko, once known as “The Immortal Score,” is one of a select few Korean pros to transition smoothly from playing one role to another. Originally the pre-eminent ADC for KT Rolster, Score had a knack for surviving team fights due to his excellent positioning.\n</p>\n<p>\nScore traded in his guns and rockets for a flask and burrowing kit and moved into the jungle in 2015. Now working with a new roster, he'll have to build synergy with his new all-star laners to find success in 2017.\n</p>","fr_FR":"<p>Dong-bin « Score » Go, naguère surnommé l'« Immortel Score », est un des rares professionnels coréens à avoir su passer de façon fluide d'un rôle à un autre. Quand il était le carry AD par excellence de KT Rolster, Score avait le don pour survivre aux combats d'équipes grâce à son excellent sens du positionnement.\n</p>\n<p>\nScore opéra une reconversion vers la jungle en 2015. Pour l'heure, ce choix a l'air de sourire à KT Rolster. Les ganks de Score sur la voie du haut donnent constamment à ssumday un avantage crucial. Il fut un temps où Score amassait les éliminations sur la voie du bas, mais aujourd'hui je pense qu'on peut dire\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...que son score ne l'intéresse plus. (Phreak par pitié, ne touche pas à mon clavier).</p>","pl_PL":"<p>Dongbin „Score” Go, znany kiedyś jako „The Immortal Score” jest jednym z niewielu koreańskich zawodowców, którzy gładko przeszli z jednej roli w inną. Niegdyś był prowadzącym w KT Rolster i często przeżywał walki drużynowe ze względu na idealne ustawienie.\n</p>\n<p>\nScore przesiadł się z rakiet i broni na mikstury i przeszedł do dżungli w 2015 roku. Chwilowo ruch ten wydaje się służyć KT Rolster. Ganki Score'a na górnej alei zapewniają ssumdayowi przewagę. Chociaż Score niegdyś sam zdobywał zabójstwa na dole, teraz można powiedzieć,..\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...że Score'a nie obchodzi już jego score (wynik). (Phreak, daj spokój, zostaw mój komputer).\n</p>","de_DE":"<p>Dongbin \"Score\" Ko war wie heute schon zu Zeiten von KT Rolster Bullets der Teamkapitän und hat die Kommandos gegeben. Das Bemerkenswerte ist, dass er dies damals als Schütze, also einer sehr mikrolastigen Rolle, machte, was zu dieser Zeit keiner anderer zu diesem Maße mit Erfolg nachmachen konnte. Als Anfang 2015 die beiden Schwesterteams KTA und KTB sich zusammentaten, hat Score seine Rolle zum Jungler gewechselt. Sehr schnell nahm dieser Wechsel eine solide Form an, wobei auch die langjährige Erfahrung eine große Rolle spielte. Score wandelt diese in kluge Jungle-Pfade und Manöver um seine Gegner herum um. Zusammen mit seinem Support Piccaboo bilden diese beiden das beste Jungle/Support-Duo in Korea, das dem Gegner immer und immer wieder klar macht, dass sie keine Führung so leicht aus den Händen geben.</p>","es_ES":"<p>Dong-bin \"Score\" Go, una vez conocido como “El inmortal Score”, es uno de los pocos elegidos coreanos que ha cambiado con éxito su rol dentro del juego. Originalmente en el puesto de tirador para KT Rolster, Score tiene un truco para sobrevivir en todas las peleas gracias a su extraordinario posicionamiento. </p>\n\n<p>Score cambió sus pistolas y cohetes por la mochila de explorador y se fue a la jungla en 2015. Hasta ahora el cambio parece haber funcionado para KT Rolster. Las emboscadas de Score en la calle superior suelen darle ventaja a su compañero ssumday. Hubo un tiempo en el que Score acaparaba los asesinatos de su equipo, aquellos maravillosos años…</p>\n","pt_BR":"<p>Dong-bin \"Score\" Go, uma vez conhecido como \"O Imortal Score\", é um dos poucos jogadores coreanos a transitar tranquilamente de uma posição para outra. Originalmente um proeminente atirador para a KT Rolster, Score era conhecido por sobreviver às lutas com seu excelente posicionamento.\n</p>\n<p>\nScore trocou suas armas e foguetes por um machete e repelentes, e mudou-se para a selva em 2015. Até agora tudo tem dado certo para a KT Rolster. As emboscadas de Score na rota do topo regularmente colocam Ssumday em uma vantagem crucial para a equipe. Enquanto Score antigamente era conhecido por conquistar abates para si próprio na rota de baixo, hoje em dia você pode até dizer que...\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n...ele não se importa muito com seu score (placar). (Phreak pfv, deixe meu computador em paz).\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한때 생존왕이라고 불리기도 했던 \"Score\" 고동빈은 포지션 전향이 순탄하게 이루어진 몇 안 되는 한국 프로게이머들 중 하나입니다. KT Rolster의 탁월한 원거리 딜러였던 Score는 훌륭한 위치 선정으로 팀 전투에서 생존하는 능력이 좋았습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 Score는 총과 로켓 대신 술통과 매복 스킬을 들고 정글로 들어갔습니다. 그의 포지션 전향은 KT Rolster에게 도움이 되고 있는 듯합니다. Score의 탑 라인 갱킹은 Ssumday가 계속해서 우위에 설 수 있게 해줍니다. 한때 Score는 봇 라인에서 킬을 독식했을지 몰라도 요즘은 자기 스코어에 신경 쓰지 않습니다. </p>\n"},"foreignIds":{"drupalId":"2163","ESPORTSTMNT06":"200000341","TRLT3":"200000213"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":769,"slug":"smeb","name":"Smeb","firstName":"Kyungho","lastName":"Song","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smeb-afu7c8ds.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-07-06T14:10:36.000Z","bios":{"en_US":"<p>Kyungho \"Smeb\" Song is the most feared top laner in the world; but it wasn’t always that way. His professional debut with Incredible Miracle in 2013 was disastrous, and he was crushed repeatedly by the LCK’s top lane heavyweights. After Smeb made the move to the ROX Tigers (previously KOO Tigers) in late 2014, he defied his critics, and his play skyrocketed under the tutelage of ROX coach NoFe. Smeb’s endearing ascension gained him fans and respect as one of the most formidable foes on the Rift.</p>\n\n<p>Smeb has continually reached new heights as a player, collecting his second straight LCK MVP award in the 2016 LCK Summer Split, when he led a resilient ROX squad to their first-ever LCK crown. The hype behind Smeb was at a fever pitch heading into Worlds until the Tigers met their bitter rivals, SK Telecom T1, in the Semifinals. Even though Smeb and company fell to SKT in a hardfought battle, his admirable performances left an impression on viewers.</p>","fr_FR":"<p>Kyung-ho « Smeb » Song est aujourd'hui le top laner le plus craint au monde, mais cela n'a pas toujours été le cas. Ses débuts en tant que professionnel avec Incredible Miracle en 2013 ont été désastreux et se sont soldés par de nombreux échecs face aux poids lourds top laners des LCK. Après avoir rejoint les ROX Tigers (anciennement KOO Tigers) fin 2014, il a défié ses détracteurs et ses performances explosèrent sous la houlette de l'entraîneur des ROX, NoFe. Avec son ascension, Smeb a conquis les fans et le respect de ses pairs comme l'un des ennemis les plus imposants de la Faille.</p>\n\n<p>Smeb n'a jamais cessé d'évoluer en tant que joueur, remportant sa deuxième récompense de MVP LCK lors du segment d'été des LCK 2016 quand, grâce à la ténacité de l'équipe, ROX a pu y décrocher sa première couronne. L'engouement derrière Smeb était encore à son comble lors du Mondial jusqu'à la rencontre entre les Tigers et leurs adversaires cinglants, SK Telecom T1, lors de la demi-finale. Même si Smeb et son équipe ont perdu face à SKT après un combat acharné, ses performances incroyables ont fait forte impression sur les spectateurs qui l'ont propulsé sur la scène de l'événement All-Stars 2016 à Barcelone.</p>","pl_PL":"<p>Kyungho „Smeb” Song to budzący największą grozę na świecie gracz górnej alei — ale nie zawsze tak było. Jego profesjonalny debiut w Incredible Miracle w 2013 okazał się katastrofalny. Smeb był raz za razem miażdżony przez weteranów górnej alei z LCK. Gdy Smeb przeniósł się do ROX Tigers (dawniej KOO Tigers) pod koniec 2014 roku, rzucił rękawicę krytykom, a jego gra osiągnęła niebotyczny pułap dzięki opiece trenera ROX, NoFe. Śmiały awans Smeba przysporzył mu fanów oraz zapewnił szacunek należny jednemu z najgroźniejszych przeciwników na Summoner’s Rift.</p>\n<p>\nSmeb nieustannie osiągał nowe wyżyny jako zawodnik, zdobywając drugą z rzędu nagrodę dla Najlepszego Zawodnika LCK, gdy doprowadził mocny skład ROX do ich pierwszego wielkiego zwycięstwa w LCK. Gorączka zachwytów nad Smebem rosła w toku Mistrzostw, aż Tigers spotkali się w półfinałach ze swoimi zaciętymi rywalami, SK Telecom T1. Chociaż Smeb i koledzy ulegli SKT w zażartym boju, jego godny podziwu występ zrobił wrażenie na widzach, którzy wysłali go na wydarzenie All-Star 2016 w Barcelonie.\n","de_DE":"<p>Kyung-ho „Smeb“ Song ist der gefürchtetste Top-Laner der Welt, aber das war nicht immer der Fall. 2013 gab er ein katastrophales Debüt in der professionellen E-Sport-Szene für Incredible Miracle und wurde außerdem immer wieder von anderen Top-Lanern der LCK vernichtet. Nachdem Smeb Ende 2014 zu den ROX Tigers (ehemals KOO Tigers) gewechselt hatte, ließ er seine Kritiker verstummen und verbesserte seine Spielweise unter der Anleitung von ROX’ Coach NoFe ungemein. Smebs Aufstieg brachte ihm Fans und den Respekt der besten Spieler der Kluft ein.</p>\n\n<p>Smeb hat als Spieler immer wieder neue Höhen erreicht und nachdem er beim Sommer-Split 2016 seinen zweiten Titel als MVP der LCK erhalten hatte, führte er ROX zum ersten Sieg in der LCK. Der Hype um Smeb erreichte bei der Weltmeisterschaft seinen Höhepunkt, bis die Tigers im Halbfinale auf ihren größten Rivalen trafen: SK Telecom T1. Obwohl sich Smeb und seine Kameraden SKT nach einem harten Kampf beugen mussten, hinterließ seine Vorstellung bleibenden Eindruck bei den Zuschauern, die ihn jetzt auf der Bühne des All-Stars-Events 2016 in Barcelona sehen wollen.</p>","es_ES":"<p>Kyungho \"Smeb\" Song es considerado el top más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el split de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","pt_BR":"<p>Kyung-ho \"Smeb\" Song é um dos topos mais temidos do mundo, mas nem sempre foi assim. Sua estreia profissional na Incredible Miracle em 2013 foi um desastre e ele era constantemente destruído pelos pesos-pesados da rota do topo na LCK.  Depois de ter entrado para a ROX Tigers (antiga KOO/GE Tigers) no final de 2014, ele desafiou todos os críticos e seu desempenho explodiu sob a tutela do técnico da ROX, NoFe. A ascensão cativante de Smeb ganhou a ele fãs e respeito como um dos inimigos mais formidáveis no Rift.</p>\n\n<p>Smeb continuiu a atingir novos patamares como jogador, conquistando seu segundo prêmio consecutivo como MVP da LCK. O topo liderou a equipe resiliente da ROX a sua primeira coroa na LCK. A animação por trás de Smeb estava altíssima ao entrar no Mundial, até a Tigers encontrar sua rival, a SK Telecom T1, nas Semifinal. Apesar de Smeb e companhia terem perdido para a SKT em uma batalha difícil, seu desempenho admirável deixou uma impressão nos jogadores que os levou a votar nele para o Evento All-Star 2016.</p>","ko_KR":"<p>\"Smeb\" 송경호 선수는 LCK의 최강 탑 라이너 중 한 명입니다. 2013년 Incredible Miracle에서 e스포츠 경력을 시작했지만 별다른 모습을 보여주지 못했던 Smeb 선수는 2014년 말 ROX Tigers에 입단한 후 달라진 모습을 보여주기 시작했습니다. NoFe 코치의 지도를 받아 나르, 럼블, 헤카림을 마스터해 누구보다도 더 능수능란하게 다루는 모습을 보여주었죠. 특히 나르로 뛰어난 모습을 보여 2015 LCK 스프링에서는 나르로 6승 1패를 기록하기도 했습니다.</p>\n<p>ROX Tigers는 카토비체에서 개최된 IEM 시즌 IX 월드 챔피언십에서 World Elite에게 패하기는 했지만, 꾸준히 세계 최강급 팀으로서의 면모를 보여 왔습니다. LCK의 상위권 팀들과 자주 맞붙어야 하는 ROX Tigers에게 있어 Smeb 선수가 탑에서 럼블과 나르로 잠재력을 발휘할 수 있느냐는 팀의 성패와 직결되죠. Smeb 선수가 제 기량만 발휘할 수 있다면 ROX Tigers의 앞날을 밝을 것입니다. </p>\n","es_AR":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","cs_CZ":"<p>Kyungho „Smeb“ je nejobávanějším horním lajnařem na světě, ale nebylo tomu tak vždy. Jeho profesionální debut s Incredible Miracle roku 2013 skončil katastrofou a špičkoví horní lajnaři z LCK si z něj opakovaně dělali fackovacího panáka. Když však koncem roku 2014 přestoupil do ROX Tigers (dříve KOO Tigers), vzal svým kritiků vítr z plachet a pod vedením trenéra NoFea z ROXu se jeho herní schopnosti ohromným tempem zlepšovaly. Svou cílevědomostí a odhodláním si Smeb vysloužil davy fanoušků a pověst jednoho z nejtěžších nepřátel, na jaké lze ve Žlebu narazit.</p>\n\n<p>Smebova hvězda na herním nebi září čím dál jasněji. Během letního splitu LCK 2016 získal podruhé po sobě ocenění pro nejužitečnějšího hráče ligy, a to zcela zaslouženě, neboť dovedl nezdolný tým ROX k jeho historicky prvnímu titulu z LCK. Nadšení jeho fanoušků dosáhlo s příchodem MS neuvěřitelných výšin, studená sprcha však přišla v semifinále, kde Tigers narazili na své úhlavní nepřátele z SK Telecom T1. Smeb a jeho tým sice SKT podlehli, avšak byla to tvrdá bitva a jeho výkony zanechaly v divácích takový dojem, že se rozhodli jej vyslat do Barcelony na turnaj All-Star 2016.</p>","el_GR":"<p>Ο Kyungho \"Smeb\" Song θεωρείται ο πιο επικίνδυνος παίκτης επάνω λωρίδας στον κόσμο. Δεν ήταν πάντα έτσι, όμως. Έκανε το ντεμπούτο του στην επαγγελματική σκηνή με τους Incredible Miracle του 2013 και γνώρισε την απόλυτη αποτυχία, καθώς τον τσαλαπάτησαν όλοι οι δυνατοί παίκτες επάνω λωρίδας του LCK. Όταν ο Smeb πήρε μεταγραφή στους ROX Tigers (προηγουμένως KOO Tigers) στα τέλη του 2014, όχι μόνο διέψευσε τους κριτικούς του, αλλά βελτίωσε θεαματικά το παιχνίδι του με την καθοδήγηση του προπονητή των ROX, NoFe. Η άνοδος του Smeb κέρδισε τη συμπάθεια και το σεβασμό του κόσμου και τον έκανε έναν από τους πιο τρομακτικούς αντιπάλους στο παιχνίδι.</p>\n\n<p>Ο Smeb κατακτά διαρκώς νέες κορυφές ως παίκτης και πρόσφατα κέρδισε το δεύτερό του βραβείο MVP στο Summer Split 2016 του LCK, όπου οδήγησε τους εξαιρετικά ανθεκτικούς ROX στην πρώτη τους κατάκτηση του πρωταθλήματος. Η πορεία του Smeb είχε δημιουργήσει τρομακτικό ενθουσιασμό, μέχρι που οι Tigers συνάντησαν τους αιώνιους αντιπάλους τους, SK Telecom T1, στους Ημιτελικούς. Παρόλο που ο Smeb και η παρέα του ηττήθηκαν μετά από σκληρό αγώνα, οι εκπληκτικές εμφανίσεις του έκαναν θετική εντύπωση στους θεατές, με αποτέλεσμα να κερδίσει μια θέση στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη.</p>","hu_HU":"Kyungho „Smeb” Song ma a világ legrettegettebb felső ösvényese, de ez nem mindig volt így. 2013-as bemutatkozása az Incredible Miracle tagjaként katasztrofálisra sikeredett, és az LCK felső ösvényes nehézsúlyú játékosai sorra kiütötték. Smeb átigazolt a ROX Tigershez (korábban KOO Tigers) 2014 végén. A ROX edzője, NoFe irányítása alatt hatalmasat fejlődött. Smeb üstökösszerű felemelkedése sok rajongót és rengeteg tiszteletet hozott neki, és ma már a Szurdok egyik legkeményebb harcosának számít.\n</p>\nSmeb egyre magasabbra jut játékosként, zsinórban kétszer lett MVP az LCK 2016-os nyári szakaszában, majd megnyerte a ROX csapatával együtt az első LCK-s bajnoki címüket. Smeb menetelése a vb-n is folytatódott, amíg a Tigers nem találkozott legnagyobb riválisával, az SK Telecom T1-nal az elődöntőben. Bár Smeb és csapata kemény küzdelem után elesett az SKT ellen, így is elég népszerűvé vált ahhoz, hogy kijusson a 2016-os All-Star gálára.\n","it_IT":"Oggi Kyungho \"Smeb\" Song è il superiore più temuto al mondo, ma non è stato sempre così. Il suo debutto professionale con gli Incredible Miracle nel 2013 fu disastroso e lui stesso fu schiacciato ripetutamente in corsia superiore dai pesi massimi della LCK. Dopo essere passato ai ROX Tigers (ex KOO Tigers) alla fine del 2014, ha smentito ogni critica portando il suo gioco a livelli stellari sotto la guida del coach dei ROX, NoFe. L'affascinante ascesa di Smeb gli è valsa l'affetto di numerosi fan e il rispetto degli avversari, che lo considerano uno dei più formidabili guerrieri della Landa.\n</p>\nSmeb ha continuato a raggiungere nuove vette come giocatore, ottenendo il secondo premio consecutivo come MVP nella LCK durante il Summer Split 2016, quando ha guidato i ROX al loro primo trofeo LCK. Gli occhi del mondo erano puntati su Smeb durante i Mondiali, soprattutto durante la battaglia in semifinale contro gli acerrimi rivali degli SK Telecom T1. Anche se Smeb e i suoi compagni si sono dovuti arrendere davanti agli SKT dopo un'intensa battaglia, le sue notevoli prestazioni hanno impressionato il pubblico, che ha deciso di mandarlo dritto a Barcellona per l'All-Star.\n","ro_RO":"Kyungho ''Smeb'' Song este unul dintre cei mai temuți jucători de pe culoarul de sus din lume; dar nu a fost mereu așa. Debutul său pe scena profesionistă alături de Incredibile Miracle în 2013 a fost unul dezastruos, iar el a fost învins în repetate rânduri de legendele de pe culoarul de sus din LCK. După ce Smeb a venit la ROX Tigers (cunoscuți anterior drept KOO Tigers) la finalul lui 2014, și-a sfidat criticii și și-a îmbunătățit stilul de joc sub tutela lui NoFe, antrenorul echipei. Ascensiunea lui incredibilă i-a adus fani și respect, fiind considerat acum unul dintre cei mai formidabili adversari din Rift.</p>\n\nSmeb a atins în mod constant noi culmi ca jucător, câștigând al doilea titlu consecutiv de MVP în LCK în etapa de vară LCK 2016, când a condus echipa ROX către primul ei titlu din LCK. Speranțele și entuziasmul fanilor au atins apogeul la începutul Campionatului Mondial, când cei din Tigers și-au întâlnit adversarii înverșunați, SK Telecom T1, în semifinale. Chiar dacă Smeb și echipa lui au fost învinși de SKT într-un meci extrem de dificil, reușitele sale admirabile le-au lăsat spectatorilor o impresie plăcută, care-l aduce pe scena All-Star Event 2016 din Barcelona.\n\n","es_MX":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>"},"foreignIds":{"drupalId":"2151","ESPORTSTMNT06":"200000340","TRLT3":"200000212"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":1659,"slug":"ming","name":"Ming","firstName":"Senming","lastName":"Shi","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:21:00.000Z","updatedAt":"2017-07-06T14:45:29.000Z","bios":{},"foreignIds":{"TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1890,"slug":"y1han","name":"Y1han","firstName":"Zhiwei","lastName":"Hu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/y1han-6z1il2sx.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-04-20T20:17:22.000Z","updatedAt":"2017-06-07T00:02:57.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":1987,"slug":"y4","name":"Y4","firstName":"Nong-Mo","lastName":"Wang","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:07:39.000Z","updatedAt":"2017-07-06T14:38:30.000Z","bios":{},"foreignIds":{"TRLT3":"200000237"},"socialNetworks":{},"champions":[],"liveGameTeam":84},{"id":2050,"slug":"ssun","name":"Ssun","firstName":"Taeyang","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:19:56.000Z","updatedAt":"2017-07-06T14:11:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001523","TRLT3":"200000200"},"socialNetworks":{},"champions":[],"liveGameTeam":105}],"scheduleItems":[{"id":"AV0VpWjcoUG4HPFjOKYB","content":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:match:cfc413a8-977d-48c8-88fc-86a6925c3384","scheduledTime":"2017-07-07T07:00:00.143+0000","tags":{"blockLabel":"2","blockPrefix":"day","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:bracket:9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5"},"match":"cfc413a8-977d-48c8-88fc-86a6925c3384","tournament":"093599e3-e07d-4b43-8430-3e03b644b1f5","bracket":"9c6689e1-2b4f-4a62-b3d7-238037eb1cb3","league":"43"}],"gameIdMappings":[{"id":"5f89d417-394b-43e4-b49e-024b023b921a","gameHash":"5afe18bfc2f19313"}],"videos":[{"id":7766,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:game:5f89d417-394b-43e4-b49e-024b023b921a","source":"https://www.youtube.com/embed/6jemOBvXPuo?wmode=transparent&start=8189&rel=0","createdAt":"2017-07-07T17:33:04.000Z","updatedAt":"2017-07-07T17:33:04.000Z","game":"5f89d417-394b-43e4-b49e-024b023b921a"}],"htmlBlocks":[],"match":{"id":"cfc413a8-977d-48c8-88fc-86a6925c3384","name":"R1M5","position":4,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953","breakpoint":"5ddb962b-44a6-4452-b7d5-8b79d0aab8ac","standing":1},{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}],"games":{"5f89d417-394b-43e4-b49e-024b023b921a":{"id":"5f89d417-394b-43e4-b49e-024b023b921a","name":"G1","generatedName":"KT|RNG|G1|cfc413a8977d48c888fc","input":[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953","breakpoint":"5ddb962b-44a6-4452-b7d5-8b79d0aab8ac","standing":1},{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}],"standings":{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953","breakpoint":"5ddb962b-44a6-4452-b7d5-8b79d0aab8ac","standing":1}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}]],"timestamp":1499449129359,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953","breakpoint":"5ddb962b-44a6-4452-b7d5-8b79d0aab8ac","standing":1}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}]],"timestamp":1499447391892,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953","breakpoint":"5ddb962b-44a6-4452-b7d5-8b79d0aab8ac","standing":1}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1","breakpoint":"00396909-143e-4c51-9124-3b359153223a","standing":1}]],"timestamp":1499447018173,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"180183","gameRealm":"TRLT3","platformId":"TRLT3:180183","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953"}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1"}]],"timestamp":1499449129359,"source":"bestOf","history":[{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953"}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1"}]],"timestamp":1499447391893,"source":"bestOf","closed":true},{"result":[[{"roster":"d2e65a65-2289-493a-bb9a-0fcd1a864953"}],[{"roster":"abe3f9d4-7d41-4e0c-b83e-90a6246900a1"}]],"timestamp":1499447018173,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}