{"teams":[{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]},{"id":105,"slug":"kt-rolster","name":"kt Rolster","guid":"be6e39bf-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/kt-rolster-8rh5ukll.png","acronym":"KT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-01T23:38:44.000Z","bios":{"en_US":"<p>KT Rolster built a name for themselves in Korea through their strong objective control and individual laning talent. If their lanes went poorly, KT relied on their star junglers inSec and KaKAO to bail them out. Unfortunately for KT, their strategy faltered in the wake of inSec and KaKAO leaving to join teams in the LPL.</p>\n\n<p>After years of playing second fiddle to SK telecom T1, KT Rolster knocked their rivals out of the 2016 LCK Summer Playoffs. However, KT lost to ROX in a closely contested LCK Finals match, forcing them to play in the Regional Qualifier, where they were knocked out by Samsung Galaxy. Entering 2017 with a rebuilt roster packed with star power, they'll be sure to compete for the top spot in the LCK.</p>","fr_FR":"KT Rolster s'est fait un nom en Corée avec sa maîtrise des contrôles d'objectifs et l'habileté de ses membres sur les voies. Si la phase de voie se présentait mal, KT pouvait toujours compter sur les junglers inSec et KaKAO pour les sortir du pétrin. Malheureusement pour KT, cette stratégie est entrée dans une impasse quand inSec et KaKAO les ont quittés pour une autre équipe. Cela dit, quand une étoile est passée, une autre monte. Les espoirs de KT Rolster aux LCK reposent désormais sur les épaules des très capables ssumday, Arrow et Nagne.","pl_PL":"KT Rolster zyskało sławę w Korei dzięki swojej niezwykle skutecznej kontroli celów oraz talentowi do walki w alejach. Jeżeli gracze w alejach się nie popisali, KT polegało na swoich dżunglerach, inSecu i KaKAO, aby zaprowadzili porządek. Niestety dla KT strategia ta przestała działać w wyniku odejścia inSeca i KaKAO, którzy dołączyli do drużyn w LPL. Jednakże gdy jedna gwiazda znika, na jej miejscu pojawia się nowa. Marzenia KT Rolster o LCK spoczywają teraz w rękach ssumdaya, Arrowa i Nagne.","de_DE":"KT Rolster haben sich in Korea einen Namen durch ihre starke Objective-Kontrolle und individuellem Talent gemacht. Ssumday ist der Superstar-Top-Laner in Korea und lässt nicht mehr los, sobald er sich einen Vorteil verschaffen kann. Die ersten Minuten der Spiele mit KT zeichnen sich stets durch den immensen Druck des Jungle/Support-Duos aus. Es ist zu erwarten, dass der gegnerische Jungler bei ihrem Anblick in Angstschweiß ausbricht, wenn er nicht weiß, sein Territorium zu verteidigen.","es_ES":"KT Rolster se ha ganado una reputación en Corea por méritos propios gracias a un control férreo de sus objetivos y el talento de sus jugadores. Si en las calles la cosa no iba bien ahí estaba su jungla estrella para solucionar la partida, primero inSec y luego KaKAO. Desafortunadamente para KT, su estrategia falló cuando tanto inSec primero como KaKAO después abandonaron Corea para probar suerte en la LPL china. Pero cuando una estrella se va, otra se alza. Los sueños de KT Rolster residen ahora en ssumday, Arrow y Picaboo, que harán todo lo posible por llevar a su equipo a lo más alto.","pt_BR":"A KT Rolster construiu seu nome na Coreia com um estilo de jogo baseado em forte controle de objetivos e muito talento individual nas rotas. Se eles perdessem na rota, podiam confiar nos caçadores inSec e KaKAO para salvar o dia. Infelizmente, ambos deixaram o time para ir jogar na LPL. Mas quando uma estrela se apaga, outra surge no lugar. Os sonhos da KT agora estão depositados em Ssumday, Arrow e Piccaboo.\n","ko_KR":"<p>KT Rolster는 강력한 오브젝트 관리와 라인전 경기력으로 유명세를 탔습니다. 라인전에서 적팀에 밀리게 돼도 스타 정글러 inSec 선수와 KaKAO 선수가 팀을 승리로 이끌어주었죠. 하지만 두 정글러가 LPL에 진출하며 팀을 떠나자 팀 전략에 구멍이 났습니다. 하지만 별이 떠난 자리에는 다른 별이 뜨기 마련. 이제 KT Rolster는 ssumday 선수와 Arrow 선수를 선두에 내세워 전장에 나서고 있습니다.</p>"},"foreignIds":{"drupalId":"642"},"players":[69,72,304,749,769,2050],"starters":[69,72,304,749,769],"subs":[2050]}],"players":[{"id":69,"slug":"mata","name":"Mata","firstName":"Sehyoung","lastName":"Cho","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mata-7wmee6cg.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-06T14:11:34.000Z","bios":{"en_US":"<p>Sehyoung \"Mata\" Cho is one of the few League players who hardly needs an introduction. Mata is not just a World Champion, but the MVP of the series that won Samsung White the 2014 world title and Summoner's Cup. He’s one of the most well known Thresh players in the world, and his tactical mind is legendary.</p>\n\n<p>On the Rift, Mata is an invaluable addition to Royal Never Give Up, and has achieved an incredible synergy with his hot-headed, wildly-aggressive ADC partner Uzi. Unfortunately, his stellar play wasn’t enough to carve out a win against the eventual World champions, SK Telecom T1. Mata will have a chance to flash hook his way to some redemption in 2017.</p>","es_AR":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","fr_FR":"<p>Se-hyeong « Mata » Cho est l'un des rares joueurs de League of Legends qu'on ne présente plus. Mata n'est pas seulement champion du monde, il est aussi le MVP de la série qui a valu à Samsung White le titre de championne du monde 2014 et la Coupe de l'invocateur. Il est l'un des joueurs de Thresh les plus connus au monde, et son esprit tactique est légendaire.</p>\n\n<p>Sur la Faille, Mata est un ajout de taille pour Royal Never Give Up, et il a établi une synergie extraordinaire avec Uzi, son partenaire ADC impétueux et agressif. Malheureusement, son jeu exemplaire n'a pas suffi à vaincre les futurs champions du monde de SK Telecom T1. Mata trouvera peut-être la rédemption à coups de Saut éclair et de Grappin grâce à sa nomination à l'événement All-Stars 2016 de Barcelone. Accompagné de son partenaire de voie Uzi, la plus grande contribution de Mata se jouera dans sa façon de superviser le champ de bataille de la Faille de l'invocateur. Avec le commandant Mata à la barre, le vaisseau All-Stars de la Chine a une chance de se maintenir à flot, même si les probabilités ne jouent pas en leur faveur.</p>","es_ES":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de League que casi no necesita una presentación. No solo es un campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White ganase el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia increíble con su impulsivo e increíblemente agresivo ADC, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de calle Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>","de_DE":"<p>Se-hyeong „Mata“ Cho gehört zu den wenigen League-Spielern, die man nicht groß vorstellen muss. Mata ist nicht nur ein Weltmeister, er wurde auch noch zum wertvollsten Spieler gewählt, als Samsung White 2014 Weltmeister wurde und den Beschwörerpokal gewann. Er ist einer der bekanntesten Thresh-Spieler der Welt und seine Taktiken sind legendär.</p>\n\n<p>In der Kluft ist Mata für Royal Never Give Up unbezahlbar und harmoniert unglaublich gut mit seinem hitzköpfigen, extrem aggressiven AD-Carry-Partner Uzi. Leider reichte seine überragende Leistung nicht, um die späteren Weltmeister, SK Telecom T1, zu besiegen. Doch Mata hat genug Stimmen bekommen, um am All-Stars-Event 2016 in Barcelona teilzunehmen, wo er die Chance auf Wiedergutmachung bekommt. Zusammen mit seinem Lane-Partner Uzi wird Matas größter Beitrag seine Übersicht in der Kluft der Beschwörer sein. Wenn Mata das Kommando übernimmt, stehen die Chancen gut, dass Chinas All-Stars-Schiff nicht kentern wird, selbst wenn alles gegen sie sprechen sollte.</p>","pl_PL":"Sehyeong „Mata” Cho jest jednym z kilku zawodników League of Legend, których nie trzeba przedstawiać. Mata to nie tylko mistrz świata — był także najlepszym zawodnikiem serii, podczas której zdobył dla Samsung White mistrzostwo i Puchar Przywoływacza w 2014 roku. To jeden z najlepiej znanych na świecie zawodników grających Threshem, a jego taktyczny umysł jest legendarny.</p>\n\nNa Summoner’s Rift Mata stanowi bezcenne uzupełnienie Royal Never Give Up i osiągnął niebywałe zgranie ze swoim porywczym, szaleńczo agresywnym prowadzącym partnerem, Uzim. Niestety jego znakomita gra nie wystarczyła, by zdobyć zwycięstwo przeciwko ostatecznym Mistrzom Świata, SK Telecom T1. Mata będzie miał okazję wyhaczyć swoje odkupienie dzięki nominacji do gry na wydarzeniu All-Star 2016 w Barcelonie. Mając za sobą kolegę z alei, Uziego, największą odpowiedzialnością Maty będzie nadzorowanie przebiegu walki na polu bitwy Summoner’s Rift. Gdy u steru stoi kapitan Mata, chiński okręt na All-Star zawsze będzie miał szanse utrzymać się na powierzchni, nawet w niesprzyjających okolicznościach.\n","pt_BR":"<p>Sehyeong \"Mata\" Cho é um dos poucos jogadores do League que nem precisa de apresentações. Mata não é apenas um Campeão Mundial. Ele é o MVP da série que deu o Campeonato à Samsung White. Ele é um dos jogadores de Thresh mais conhecidos do mundo e seu raciocínio tático é lendário.</p>\n\n<p>Mata é uma adição inestimável para a Royal Never Give Up e alcançou uma incrível sinergia com seu parceiro cabeça-quente e altamente agressivo, o atirador Uzi. Infelizmente, sua mecânica incrível não foi suficiente para arrancar uma vitória contra a campeã do Mundial, a SK Telecom T1. Mata terá uma chance de dar aquele Flash com gancho e agarrar sua redenção após ser eleito para participar do Evento All-Star 2016 em Barcelona. Com Uzi também eleito, a maior contribuição de Mata será em como ele cuida do campo de batalha que é Summoner’s Rift. Com o comandante Mata no manche, o navio All-Star da China tem uma chance de continuar navegando, mesmo se a sorte estiver contra eles.</p>","cs_CZ":"<p>Sehyeong „Mata“ Cho je jedním z mála hráčů League of Legends, kteří nepotřebují žádné zdlouhavé představování. Mata není jen mistr světa, ale také držitel ocenění pro nejužitečnějšího hráče za sérii, ve které Samsung White v roce 2014 vyhrál MS a Vyvolávačův pohár. Je jedním z nejslavnějších hráčů Threshe na světě a o jeho taktických dovednostech se vyprávějí legendy.</p>\n\n<p>Ve Žlebu je Mata nedocenitelnou oporou týmu Royal Never Give Up, s jehož horkokrevným a divoce agresivním ADC Uzim si vybudoval neuvěřitelně dokonalou synergii. Bohužel ani jeho hvězdné výkony nestačily na překonání SK Telecom T1, kteří nakonec letošní mistrovství světa vyhráli. Mata bude mít ještě šanci se se svým hákem pomstít, jelikož byl nominován na turnaj All-Star 2016 v Barceloně. S lajnovým parťákem Uzim v závěsu bude největším Matovým příspěvkem to, jak si dokáže udržovat přehled o celkovém dění na bojišti. Když bude mít na All-Star čínská loď u kormidla kapitána Matu, bude šanci udržet se na vodě, i když nepatří mezi favority.</p>","el_GR":"<p>Ο Sehyeong \"Mata\" Cho ανήκει στην ελίτ των παικτών του League που δεν χρειάζονται συστάσεις. Ο Mata δεν είναι μόνο Παγκόσμιος Πρωταθλητής, αλλά και ο MVP των αγώνων με τους οποίους οι Samsung White κατάκτησαν το Παγκόσμιο Πρωτάθλημα 2014 και το Κύπελλο Επικαλεστή. Είναι ένας από τους πιο διάσημους παίκτες του Θρες στον κόσμο και φημίζεται για τη στρατηγική του σκέψη.</p>\n\n<p>Σε αγωνιστικό επίπεδο, ο Mata είναι μια πολύτιμη προσθήκη στους Royal Never Give Up και έχει καταφέρει να συντονιστεί τέλεια με τον θερμόαιμο και εξαιρετικά επιθετικό ADC της ομάδας, τον Uzi. Δυστυχώς, η καταπληκτική του εμφάνιση δεν ήταν αρκετή για να δώσει τη νίκη στην ομάδα του στον αγώνα με τους SK Telecom T1 που στη συνέχεια θα έπαιρναν το Παγκόσμιο Πρωτάθλημα. Ο Mata θα έχει πάλι μια ευκαιρία να δείξει τι αξίζει, αφού επιλέχθηκε για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Ήδη γυαλίζει το φανάρι και το Φλας του. Μαζί με τον Uzi, τον συμπαίκτη του στη λωρίδα, ο Mata θα είναι ακόμη πιο πολύτιμος στην ομάδα του επειδή γνωρίζει καλύτερα από τον καθένα τη στρατηγική που απαιτεί το Φαράγγι των Επικαλεστών. Με καπετάνιο τον Mata, το πλήρωμα της Κίνας που θα ταξιδέψει στο All-Star έχει καλές πιθανότητες να μην ναυαγήσει, παρόλο που τα στατιστικά δεν είναι με το μέρος του.</p>","hu_HU":"Sehyeong „Mata” Cho a kevés LoL-játékos egyike, aki nem igazán szorul bemutatásra. Mata nem csupán világbajnok, hanem MVP volt egy olyan versenyen, ahol a Samsung White 2014-ben világbajnok lett, és elnyerte az Idézők Kupáját. A világ egyik legismertebb Thresh-játékosának taktikai érzéke legendás.</p>\n\nA Szurdokban Mata a Royal Never Give Up csodafegyvere, és meglepően jól működik együtt a forrófejű, rendkívül agresszív partnerével, Uzival. Sajnos az emberfeletti teljesítménye is kevés volt ahhoz, hogy megverjék a későbbi világbajnok SK Telecom T1-t. Mata most visszavághat, mert beszavazták őt a 2016-os All-Star gála játékosai közé. Állandó társa, Uzi is vele tart, így Mata stratégiai gondolkodása is jobban érvényesülhet az Idézők szurdokában. Mata parancsnokkal a hídon Kína All-Star-hajója akkor sem fog felborulni, ha az esélyek nem nekik kedveznek.\n","it_IT":"Sehyeong \"Mata\" Cho è uno dei pochi giocatori di LoL a non aver bisogno di presentazioni. Mata non è semplicemente un campione del mondo, ma anche il MVP della serie che ha visto i Samsung White conquistare i Mondiali 2014 e la Coppa degli evocatori. È uno dei più celebri giocatori di Thresh al mondo e la sua abilità tattica è leggendaria.</p>\n\nIn Landa, è una risorsa insostituibile dei Royal Never Give Up, tra i quali ha costruito un'incredibile sinergia con il suo aggressivo compagno ADC Uzi. Purtroppo le sue giocate stellari non sono bastate a strappare una vittoria contro i futuri campioni del mondo, gli SK Telecom T1. Mata avrà la possibilità di rifarsi e \"agganciare\" la vittoria all'All-Star 2016 di Barcellona. In compagnia del suo compagno di corsia Uzi, Mata potrebbe contribuire al successo della squadra soprattutto grazie alla sua visione del campo di battaglia. Con il comandante Mata al timone, la squadra cinese avrà sempre una possibilità di rimanere a galla, anche quando sembra che non ci sia via di scampo.\n","ro_RO":"Sehyeong ''Mata'' Cho este unul dintre puținii jucători de LoL care nu mai au nevoie de vreo prezentare. Mata nu este doar Campion Mondial, ci și MVP-ul Campionatului Mondial în care Samsung White a câștigat Cupa Invocatorului în 2014. Este unul dintre cei mai cunoscuți jucători de Thresh din lume, iar manevrele sale tactice sunt legendare.</p>\n\nÎn Rift, Mata este o piesă inestimabilă a echipei Royal Never Give Up și a dezvoltat o sinergie incredibilă cu partenerul său ADC temperamental și foarte agresiv, Uzi. Din păcate, manevrele sale uimitoare nu au fost de ajuns pentru a obține o victorie în fața viitorilor campioni mondiali, SK Telecom T1. Acum că a fost nominalizat să joace la evenimentul All-Star 2016 din Barcelona, Mata va avea ocazia să-și ia revanșa. Avându-l alături de colegul său de culoar, Uzi, cea mai importantă contribuție a lui Mata va fi controlul asupra câmpului de luptă. Cu comandantul Mata la cârmă, vasul All-Star al Chinei se va putea menține la suprafață chiar și atunci când șansele nu sunt favorabile.\n","es_MX":"<p>Sehyeong \"Mata\" Cho es uno de los pocos jugadores de LoL que no necesita presentación. No solo es campeón mundial, sino que también es el MVP de la serie que hizo que Samsung White se llevara el título mundial y la Copa del Invocador en el año 2014. Es uno de los jugadores de Thresh más conocidos del mundo y su visión táctica es legendaria.</p>\n\n<p>En la Griega, Mata es un añadido de valor incalculable para Royal Never Give Up y ha conseguido una sinergia sorprendente con su impulsivo e increíblemente agresivo tirador, Uzi. Desgraciadamente, sus jugadas estelares no fueron suficientes para cosechar una victoria contra el que acabaría siendo el campeón mundial, SK Telecom T1. Mata tendrá la oportunidad de redimirse con su reciente nominación para jugar en el All-Star Event 2016 en Barcelona. Con su compañero de carril Uzi acompañándole, la mayor contribución de Mata será supervisar el campo de batalla de la Grieta del Invocador. Con el comandante Mata al timón, el barco de All-Star de China siempre podrá mantenerse a flote, incluso cuando las probabilidades no estén de su lado.</p>"},"foreignIds":{"drupalId":"682","ESPORTSTMNT06":"200000344","TRLT3":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":72,"slug":"pawn","name":"Pawn","firstName":"Wonseok","lastName":"Heo","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pawn-bwchpx6p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:29.000Z","updatedAt":"2017-07-06T14:11:08.000Z","bios":{"en_US":"<p>\nWonseok “Pawn\" Heo is one of the best known mid laners in the world, with a career dating back to 2013. Pawn is a battle hardened veteran, with some truly impressive games under his belt. Pawn shocked the world when he solo killed Faker in the 2013 WCG Qualifiers, and he hasn’t stopped since. From there, he found himself on Samsung White during one of the most competitive and closely-matched periods in Korea’s history.\n</p>\n<p>\nSSW turned in a dominant performance during the 2014 World Championship, taking the cup home in almost unrivaled fashion. However, the team disintegrated in the aftermath of their success, and Pawn joined Edward Gaming at the end of 2014. Now rejoining the LCK, he'll once again take on Faker in the mid lane.\n</p>","fr_FR":"<p>Won-seok « PawN » Heo est l'un des meilleurs mid laners du monde. Point. Au nombre de ses trophées, on retrouve les play-offs des LPL, le Mid-Season Invitational et le Championnat du monde de League of Legends. Il a également battu Faker et SKT à de nombreuses occasions, notamment lors de la finale du MSI 2015. Et malgré son surnom (qui signifie « pion » en anglais), PawN nous rappelle plutôt une reine, capable de se déplacer où elle veut et semant la destruction dans les rangs ennemis.</p>\n<p>\nPawN a été recruté par Edward Gaming fin 2014, quand toute une vague de vedettes coréennes a migré vers les LPL. PawN a aidé à propulser EDG jusqu'à la 1re place de la Demacia Cup Spring Season 2015 et des play-offs printaniers des LPL 2015. Mais PawN sait que la route est encore longue. « Je trouve que Samsung White était une équipe parfaite », dit PawN, et EDG a encore beaucoup de travail à faire pour parvenir à ce niveau de performance. En attendant, PawN continuera à semer la peur chez ses adversaires chaque fois qu'il arrivera dans la Faille.\n</p>","pl_PL":"<p>\nHeo „PawN” Won-seok jest jednym z najlepszych graczy w środkowej alei na całym świecie. Czemu? Cóż, wygrał parę „drobnych” turniejów, takich jak choćby rozgrywki play-off LPL, turniej Mid-Season InvitationaL i mistrzostwa świata w League of Legends. Wielokrotnie też pokonywał Fakera i SKT – także podczas finałów 2015 MSI. Choć jego ksywka oznacza „pionek”, jego styl gry może bardziej kojarzyć się z królową, która porusza się po planszy w dowolnym kierunku, niszcząc każdego napotkanego przeciwnika.\n</p>\n<p>\nPawN został zwerbowany przez Edward Gaming pod koniec 2014 r. Był jedną z wielu koreańskich gwiazd, które przeszły do LPL. Pomógł EDG wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek play-off 2015 LPL. Pawn wie jednak, że przed nim trudne zadanie. „Wydaje mi się, że Samsung White było drużyną idealną” przyznaje PawN, a EDG czeka dużo pracy, jeżeli zamierzają osiągnąć podobny poziom. W międzyczasie PawN nadal będzie siał postrach w sercach wrogów za każdym razem, gdy wkroczy na Rift.\n</p>","de_DE":"<p>Won-seok „PawN“ Heo, dessen Karriere 2013 begann, ist einer der bekanntesten Mid-Laner der Welt. Obwohl PawN erst 19 Jahre alt ist, ist er bereits ein abgehärteter Veteran, der schon ein paar wirklich beeindruckende Spiele abgeliefert hat. PawN schockierte die Welt, als er Faker bei der Qualifikationsrunde für das WCG 2013 alleine besiegte, und hat seither nicht mehr nachgelassen. Kurz darauf wechselte er in einer der umkämpftesten und knappsten Phasen in Koreas Geschichte zu Samsung White.</p>\n\n<p>SSW lieferte bei der Weltmeisterschaft 2014 eine dominante Leistung ab und konnte sich den Titel beinahe widerstandslos sichern. Nach dem Erfolg brach die Mannschaft jedoch auseinander und PawN wechselte Ende 2014 zu Edward Gaming. Seither hat er EDG zu ein paar ihrer dominantesten Siege geführt. Doch der junge Spieler hat immer wieder mit Krankheiten zu kämpfen. Aber trotz dieser Rückschläge ist er immer noch ein Teil der Mannschaft und fest entschlossen, ihr zu dienen.</p>","es_ES":"<p>Won-seok \"PawN\" Heo es uno de los jugadores de la calle central más conocidos del mundo, con una carrera que data del año 2013. A pesar de tener solo 19 años, PawN es un veterano curtido en batalla que tiene en su haber unas partidas increíbles. Sorprendió a todo el mundo cuando acabó él solo con Faker en el clasificatorio del WCG 2013 y no ha parado desde entonces. Desde aquel momento, se encontraba en Samsung White durante uno de los periodos más competitivos y reñidos en la historia de Corea.</p>\n\n<p>SSW hizo gala de una actuación dominante durante el Campeonato Mundial 2014, hasta el punto de llevarse a casa el trofeo sin que casi nadie les plantase cara. No obstante, el equipo se deshizo como resultado de su éxito y PawN se unió a Edward Gaming a finales de 2014. Desde entonces, ha liderado a EDG en algunas de sus victorias más aplastantes. Aunque el joven jugador ha tenido que enfrentarse a alguna enfermedad. Y, a pesar de esto, sigue en el equipo, dispuesto a actuar.</p>","pt_BR":"<p>Won-seok “PawN” Heo é um dos jogadores do meio mais conhecidos do mundo, com uma carreira iniciada em 2013. Apesar de ter apenas 19 anos, PawN é um veterano experiente na batalha e tem alguns jogos realmente impressionantes no currículo. PawN chocou o mundo quando abateu Faker sozinho nas Classificatórias da WCG 2013 e desde então não parou mais. A partir dali, entrou para a Samsung White durante um dos períodos mais competitivos e disputados na história da Coreia.</p>\n\n<p>A SSW teve uma atuação dominante durante o Campeonato Mundial 2014 e levou a copa para casa de maneira incontestável. No entanto, a equipe se desfez em resultado a todo esse sucesso e PawN foi para a Edward Gaming no final de 2014. Desde então, ele liderou a EDG em algumas de suas vitórias mais sólidas. Porém, o jovem jogador está lutando contra uma doença. Mas apesar das adversidades, ele ainda está na equipe e está determinado a contribuir.</p>","es_AR":"<p>Won-seok “PawN” Heo es uno de los mejores carrileros centrales del mundo, con una carrera que se inició en el 2013. Con tan solo 19 años, PawN es un veterano endurecido por los enfrentamientos, con partidas realmente impresionantes bajo la manga. PawN deslumbró al mundo cuando derrotó a Faker en WCG 2013 y no para desde entonces. A partir de allí, se encontró en Samsung White durante uno de los juegos más competitivos y cerrados en la historia de Corea.</p>\n\n<p>SSW logró un desempeño deslumbrante durante el Campeonato Mundial 2015 y se llevó la copa a casa de una manera inigualable. Sin embargo, el equipo se desintegró después de todo este éxito y PawN se unió a Edward Gaming a finales del 2014. Desde entonces, condujo a EDG a algunas de las victorias más contundentes. Lamentablemente, el joven jugador tiene que hacer frente a una enfermedad. A pesar de esta adversidad, sigue formando parte del equipo y está determinado a seguir adelante.</p>"},"foreignIds":{"drupalId":"983","ESPORTSTMNT06":"200000342","TRLT3":"200000214"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":304,"slug":"deft","name":"Deft","firstName":"Hyeokgyu","lastName":"Kim","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deft-4s8iwywa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:52:59.000Z","updatedAt":"2017-07-06T14:18:47.000Z","bios":{"en_US":"<p>\nThere are many ways to introduce Hyeokgyu “Deft” Kim: Ezreal fanatic, world class AD carry, veteran, hypercarry... Deft has been playing since 2013, earning accolades as a player who could pump out absurd amounts of damage thanks to his ability to duck, dodge, and weave through teamfights.\n</p>\n<p>\nAfter the 2014 World Championship, Deft joined up with Edward Gaming, beginning an era of dominance where the team picked up a series of convincing victories. It started with the 2015 Demacia Cup Spring, and then continued into the 2015 LPL Spring Split, where EDG only dropped six games in total. From there, EDG picked up the top prize at the 2015 Mid-Season Invitational, winning a thrilling Bo5 series against SKTelecom T1, 3-2. Yet through it all, something has eluded Deft...he has yet to take home the greatest prize of all: the World Championship.\n</p>","fr_FR":"<p>Hyuk-kyu « Deft » Kim est réputé pour être l'un des carrys AD les plus agressifs du monde, ce qui nous change de ses débuts professionnels chez Samsung Blue, où il avait plus tendance à fuir un combat qu'à tenter l'affrontement. Mais depuis qu'il a rejoint les LPL, Deft tend à repousser les limites de ses champions (pour ne pas dire qu'il les dépasse de temps en temps). De façon générale, Deft fait preuve de force et de confiance dès qu'il arrive sur la Faille.</p>\n\n<p>Par contraste, Deft, en personne, est plutôt discret, voire effacé. Il suit souvent ses coéquipiers dans la maison d'EDG, ne sachant visiblement pas trop quoi faire par lui-même. Peut-être espère-t-il que la voix douce de Meiko, son partenaire sur la voie du bas, le ramènera à bon port.</p>","pl_PL":"<p>Hyuk-kyu „Deft” Kim uważany jest powszechnie za jednego z najagresywniejszych prowadzących na świecie. Wiele się zmieniło, odkąd zaczynał karierę w Samsung Blue. Wówczas prędzej był gotów uciekać niż nawiązać walkę z przeciwnikiem. Odkąd jednak Deft przeniósł się do LPL, coraz częściej zdarza mu się w pełni wykorzystywać zalety swoich bohaterów (a także podejmować ryzykowne decyzje). Ilekroć Deft wyrusza na Rift, wykazuje się siłą i pewnością siebie.</p>\n\n<p>Z kolei w życiu prywatnym jest osobą cichą, wręcz potulną. Często zdarza mu się chodzić po domu drużynowym za pozostałymi członkami EDG, jakby nie wiedział, co robić, gdy zostaje sam. Być może wyczekuje kojącego głosu Meiko, partnera z dolnej alejki.</p>","de_DE":"<p>Man kann Hyuk-kyu „Deft“ Kim auf viele Arten vorstellen: Als Ezreal-Freak, als Weltklasse-AD-Carry, als Veteran, als Hypercarry … Deft spielt schon seit 2013 und hat als Spieler, der dank seiner schnellen Reflexe in Teamkämpfen unglaublichen Schaden austeilen kann, einige Auszeichnungen gewonnen.\nNach der Weltmeisterschaft 2014 wechselte Deft zu Edward Gaming und leitete damit eine Ära ein, in der die Mannschaft im Frühjahr beim Demacia Cup 2015 und kurz darauf beim Frühjahrs-Split der LPL 2015 einen überzeugenden Sieg nach dem anderen feierte und insgesamt nur sechs Spiele verlor. Danach gewann EDG das spannende Finale des Mid-Season Invitational 2015 gegen SKTelecom T1 mit 3–2. Deft war schon bei vielen internationalen Turnieren, aber eines fehlt ihm immer noch: der Weltmeistertitel. Deft hat bewiesen, dass er immer alles tut, um sein Ziel zu töten. Während sich EDG auf die Weltmeisterschaft vorbereitet, müssen sich die anderen Mannschaften vor seinem beweglichen und riskanten, aber lohnenden Spielstil in Acht nehmen. Eines ist jedenfalls sicher: Solange Deft in der Kluft ist, darf man EDG niemals abschreiben.</p>","es_ES":"<p>Hay muchas maneras de presentar a Hyuk-kyu \"Deft\" Kim: fanático de Ezreal, AD carry de talla mundial, veterano, hypercarry... Deft lleva jugando desde 2013 y ha conseguido elogios como jugador capaz de infligir cantidades ingentes de daño gracias a su capacidad de eludir, esquivar y moverse en los combates de equipo.</p>\n\n<p>Después del Campeonato Mundial 2014, Deft se unió a Edward Gaming, lo que dio comienzo a una era de dominio en la que el equipo se hizo con una serie de victorias convincentes en la 2015 Demacia Cup Spring y en la fase de primavera de la LPL de 2015, donde solo perdieron seis partidas. Después EDG consiguió subir a lo más alto del MSI 2015, tras una emocionante victoria por 3 a 2 en una serie al mejor de 5 contra SK Telecom T1. </p>\n\n<p>Deft ha participado en muchos torneos internacionales, pero todavía le falta por llevarse a casa el mayor premio de todos: el título del Campeonato Mundial. Ha demostrado que cuando tiene un asesinato a la vista, hará todo lo que haga falta para conseguirlo. Con EDG en el Mundial, los rivales tendrán que tener cuidado con su estilo de juego de gran movilidad, gran riesgo y gran recompensa. Una cosa está clara: mientras Deft esté en la Grieta, no se puede dar a EDG por muerto.</p>","pt_BR":"<p>Podemos apresentar Hyuk-kyu “Deft” Kim de várias formas: Fanático por Ezreal, atirador de nível internacional, veterano, hipercarregador... Deft joga desde 2013 e é tido como um jogador que consegue causar quantidades absurdas de dano graças a sua habilidade de se esconder, desviar e driblar em confrontos de equipe.</p>\n<p>Depois do Campeonato Mundial 2014, Deft entrou para a Edward Gaming, iniciando uma era de domínio em que a equipe conquistou uma série de vitórias convincentes na Etapa de Primavera da Demacia Cup 2015 e depois a Série de Primavera da LPL 2015, onde a EDG só perdeu seis jogos no total. Depois disso, a EDG levou o primeiro lugar no MSI 2015, ganhando uma série de melhor de cinco contra a SKTelecom T1 por 3 a 2. Deft já participou de inúmeros torneios internacionais, mas ainda não levou para casa o grande prêmio: o Campeonato Mundial. Mas já demonstrou que quando coloca uma presa na mira, ele faz de tudo para abatê-la. Com a EDG no Mundial, os oponentes precisarão tomar cuidado com seu estilo de jogo de alta mobilidade, alto risco e alta recompensa. Uma coisa é certa: enquanto Deft continuar no Rift, a EDG continua na parada.</p>","es_AR":"<p>Existen muchas maneras de presentar a Hyuk-kyu “Deft” Kim: fanático de Ezreal, ADC de primera categoría, veterano, hiperacarreador... Deft no deja de jugar desde el 2013, consagrándose como un jugador capaz de infligir absurdas cantidades de daño gracias a su habilidad para agacharse, esquivar y eludir peleas en equipo.</p>\n\n<p>Después del Campeonato Mundial 2015, Deft se unió a Edward Gaming y comenzó una era de dominio en la que el equipo consiguió una serie de victorias en la Copa de Verano de Demacia 2015 y luego en la Serie de Primavera de LPL 2015, donde EDG solo perdió seis partidas en total. Después, EDG consiguió el primer premio en el Torneo por Invitación de Mitad de Temporada 2015, ganando por 3-2, una increíble serie al mejor de 5 contra SKTelecom T1. Deft participó en un montón de torneos internacionales, pero aún le falta llevarse a casa el premio más importante de todos: el Campeonato Mundial. Deft demostró que consigue lo que se propone y hará todo lo que esté a su alcance para lograrlo. Cuando EDG llegue al Mundial, los oponentes tendrán que cuidarse de su estilo de juego sumamente ágil, de alto riesgo y altura. Una cosa es segura: siempre que Deft esté parado en la Grieta, no podrás contra EDG.</p>"},"foreignIds":{"drupalId":"985","ESPORTSTMNT06":"200000343","TRLT3":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":749,"slug":"score","name":"Score","firstName":"Dong-bin","lastName":"Ko","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/score-gtlz6pjd.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:20:25.000Z","bios":{"en_US":"<p>Dong-bin \"Score\" Ko, once known as “The Immortal Score,” is one of a select few Korean pros to transition smoothly from playing one role to another. Originally the pre-eminent ADC for KT Rolster, Score had a knack for surviving team fights due to his excellent positioning.\n</p>\n<p>\nScore traded in his guns and rockets for a flask and burrowing kit and moved into the jungle in 2015. Now working with a new roster, he'll have to build synergy with his new all-star laners to find success in 2017.\n</p>","fr_FR":"<p>Dong-bin « Score » Go, naguère surnommé l'« Immortel Score », est un des rares professionnels coréens à avoir su passer de façon fluide d'un rôle à un autre. Quand il était le carry AD par excellence de KT Rolster, Score avait le don pour survivre aux combats d'équipes grâce à son excellent sens du positionnement.\n</p>\n<p>\nScore opéra une reconversion vers la jungle en 2015. Pour l'heure, ce choix a l'air de sourire à KT Rolster. Les ganks de Score sur la voie du haut donnent constamment à ssumday un avantage crucial. Il fut un temps où Score amassait les éliminations sur la voie du bas, mais aujourd'hui je pense qu'on peut dire\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...que son score ne l'intéresse plus. (Phreak par pitié, ne touche pas à mon clavier).</p>","pl_PL":"<p>Dongbin „Score” Go, znany kiedyś jako „The Immortal Score” jest jednym z niewielu koreańskich zawodowców, którzy gładko przeszli z jednej roli w inną. Niegdyś był prowadzącym w KT Rolster i często przeżywał walki drużynowe ze względu na idealne ustawienie.\n</p>\n<p>\nScore przesiadł się z rakiet i broni na mikstury i przeszedł do dżungli w 2015 roku. Chwilowo ruch ten wydaje się służyć KT Rolster. Ganki Score'a na górnej alei zapewniają ssumdayowi przewagę. Chociaż Score niegdyś sam zdobywał zabójstwa na dole, teraz można powiedzieć,..\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n<p>\n...że Score'a nie obchodzi już jego score (wynik). (Phreak, daj spokój, zostaw mój komputer).\n</p>","de_DE":"<p>Dongbin \"Score\" Ko war wie heute schon zu Zeiten von KT Rolster Bullets der Teamkapitän und hat die Kommandos gegeben. Das Bemerkenswerte ist, dass er dies damals als Schütze, also einer sehr mikrolastigen Rolle, machte, was zu dieser Zeit keiner anderer zu diesem Maße mit Erfolg nachmachen konnte. Als Anfang 2015 die beiden Schwesterteams KTA und KTB sich zusammentaten, hat Score seine Rolle zum Jungler gewechselt. Sehr schnell nahm dieser Wechsel eine solide Form an, wobei auch die langjährige Erfahrung eine große Rolle spielte. Score wandelt diese in kluge Jungle-Pfade und Manöver um seine Gegner herum um. Zusammen mit seinem Support Piccaboo bilden diese beiden das beste Jungle/Support-Duo in Korea, das dem Gegner immer und immer wieder klar macht, dass sie keine Führung so leicht aus den Händen geben.</p>","es_ES":"<p>Dong-bin \"Score\" Go, una vez conocido como “El inmortal Score”, es uno de los pocos elegidos coreanos que ha cambiado con éxito su rol dentro del juego. Originalmente en el puesto de tirador para KT Rolster, Score tiene un truco para sobrevivir en todas las peleas gracias a su extraordinario posicionamiento. </p>\n\n<p>Score cambió sus pistolas y cohetes por la mochila de explorador y se fue a la jungla en 2015. Hasta ahora el cambio parece haber funcionado para KT Rolster. Las emboscadas de Score en la calle superior suelen darle ventaja a su compañero ssumday. Hubo un tiempo en el que Score acaparaba los asesinatos de su equipo, aquellos maravillosos años…</p>\n","pt_BR":"<p>Dong-bin \"Score\" Go, uma vez conhecido como \"O Imortal Score\", é um dos poucos jogadores coreanos a transitar tranquilamente de uma posição para outra. Originalmente um proeminente atirador para a KT Rolster, Score era conhecido por sobreviver às lutas com seu excelente posicionamento.\n</p>\n<p>\nScore trocou suas armas e foguetes por um machete e repelentes, e mudou-se para a selva em 2015. Até agora tudo tem dado certo para a KT Rolster. As emboscadas de Score na rota do topo regularmente colocam Ssumday em uma vantagem crucial para a equipe. Enquanto Score antigamente era conhecido por conquistar abates para si próprio na rota de baixo, hoje em dia você pode até dizer que...\n</p>\n<p>\n(•_•) / ( •_•)>⌐■-■ / (⌐■_■)\n</p>\n...ele não se importa muito com seu score (placar). (Phreak pfv, deixe meu computador em paz).\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한때 생존왕이라고 불리기도 했던 \"Score\" 고동빈은 포지션 전향이 순탄하게 이루어진 몇 안 되는 한국 프로게이머들 중 하나입니다. KT Rolster의 탁월한 원거리 딜러였던 Score는 훌륭한 위치 선정으로 팀 전투에서 생존하는 능력이 좋았습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 Score는 총과 로켓 대신 술통과 매복 스킬을 들고 정글로 들어갔습니다. 그의 포지션 전향은 KT Rolster에게 도움이 되고 있는 듯합니다. Score의 탑 라인 갱킹은 Ssumday가 계속해서 우위에 설 수 있게 해줍니다. 한때 Score는 봇 라인에서 킬을 독식했을지 몰라도 요즘은 자기 스코어에 신경 쓰지 않습니다. </p>\n"},"foreignIds":{"drupalId":"2163","ESPORTSTMNT06":"200000341","TRLT3":"200000213"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":769,"slug":"smeb","name":"Smeb","firstName":"Kyungho","lastName":"Song","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smeb-afu7c8ds.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":"","createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-07-06T14:10:36.000Z","bios":{"en_US":"<p>Kyungho \"Smeb\" Song is the most feared top laner in the world; but it wasn’t always that way. His professional debut with Incredible Miracle in 2013 was disastrous, and he was crushed repeatedly by the LCK’s top lane heavyweights. After Smeb made the move to the ROX Tigers (previously KOO Tigers) in late 2014, he defied his critics, and his play skyrocketed under the tutelage of ROX coach NoFe. Smeb’s endearing ascension gained him fans and respect as one of the most formidable foes on the Rift.</p>\n\n<p>Smeb has continually reached new heights as a player, collecting his second straight LCK MVP award in the 2016 LCK Summer Split, when he led a resilient ROX squad to their first-ever LCK crown. The hype behind Smeb was at a fever pitch heading into Worlds until the Tigers met their bitter rivals, SK Telecom T1, in the Semifinals. Even though Smeb and company fell to SKT in a hardfought battle, his admirable performances left an impression on viewers.</p>","fr_FR":"<p>Kyung-ho « Smeb » Song est aujourd'hui le top laner le plus craint au monde, mais cela n'a pas toujours été le cas. Ses débuts en tant que professionnel avec Incredible Miracle en 2013 ont été désastreux et se sont soldés par de nombreux échecs face aux poids lourds top laners des LCK. Après avoir rejoint les ROX Tigers (anciennement KOO Tigers) fin 2014, il a défié ses détracteurs et ses performances explosèrent sous la houlette de l'entraîneur des ROX, NoFe. Avec son ascension, Smeb a conquis les fans et le respect de ses pairs comme l'un des ennemis les plus imposants de la Faille.</p>\n\n<p>Smeb n'a jamais cessé d'évoluer en tant que joueur, remportant sa deuxième récompense de MVP LCK lors du segment d'été des LCK 2016 quand, grâce à la ténacité de l'équipe, ROX a pu y décrocher sa première couronne. L'engouement derrière Smeb était encore à son comble lors du Mondial jusqu'à la rencontre entre les Tigers et leurs adversaires cinglants, SK Telecom T1, lors de la demi-finale. Même si Smeb et son équipe ont perdu face à SKT après un combat acharné, ses performances incroyables ont fait forte impression sur les spectateurs qui l'ont propulsé sur la scène de l'événement All-Stars 2016 à Barcelone.</p>","pl_PL":"<p>Kyungho „Smeb” Song to budzący największą grozę na świecie gracz górnej alei — ale nie zawsze tak było. Jego profesjonalny debiut w Incredible Miracle w 2013 okazał się katastrofalny. Smeb był raz za razem miażdżony przez weteranów górnej alei z LCK. Gdy Smeb przeniósł się do ROX Tigers (dawniej KOO Tigers) pod koniec 2014 roku, rzucił rękawicę krytykom, a jego gra osiągnęła niebotyczny pułap dzięki opiece trenera ROX, NoFe. Śmiały awans Smeba przysporzył mu fanów oraz zapewnił szacunek należny jednemu z najgroźniejszych przeciwników na Summoner’s Rift.</p>\n<p>\nSmeb nieustannie osiągał nowe wyżyny jako zawodnik, zdobywając drugą z rzędu nagrodę dla Najlepszego Zawodnika LCK, gdy doprowadził mocny skład ROX do ich pierwszego wielkiego zwycięstwa w LCK. Gorączka zachwytów nad Smebem rosła w toku Mistrzostw, aż Tigers spotkali się w półfinałach ze swoimi zaciętymi rywalami, SK Telecom T1. Chociaż Smeb i koledzy ulegli SKT w zażartym boju, jego godny podziwu występ zrobił wrażenie na widzach, którzy wysłali go na wydarzenie All-Star 2016 w Barcelonie.\n","de_DE":"<p>Kyung-ho „Smeb“ Song ist der gefürchtetste Top-Laner der Welt, aber das war nicht immer der Fall. 2013 gab er ein katastrophales Debüt in der professionellen E-Sport-Szene für Incredible Miracle und wurde außerdem immer wieder von anderen Top-Lanern der LCK vernichtet. Nachdem Smeb Ende 2014 zu den ROX Tigers (ehemals KOO Tigers) gewechselt hatte, ließ er seine Kritiker verstummen und verbesserte seine Spielweise unter der Anleitung von ROX’ Coach NoFe ungemein. Smebs Aufstieg brachte ihm Fans und den Respekt der besten Spieler der Kluft ein.</p>\n\n<p>Smeb hat als Spieler immer wieder neue Höhen erreicht und nachdem er beim Sommer-Split 2016 seinen zweiten Titel als MVP der LCK erhalten hatte, führte er ROX zum ersten Sieg in der LCK. Der Hype um Smeb erreichte bei der Weltmeisterschaft seinen Höhepunkt, bis die Tigers im Halbfinale auf ihren größten Rivalen trafen: SK Telecom T1. Obwohl sich Smeb und seine Kameraden SKT nach einem harten Kampf beugen mussten, hinterließ seine Vorstellung bleibenden Eindruck bei den Zuschauern, die ihn jetzt auf der Bühne des All-Stars-Events 2016 in Barcelona sehen wollen.</p>","es_ES":"<p>Kyungho \"Smeb\" Song es considerado el top más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el split de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","pt_BR":"<p>Kyung-ho \"Smeb\" Song é um dos topos mais temidos do mundo, mas nem sempre foi assim. Sua estreia profissional na Incredible Miracle em 2013 foi um desastre e ele era constantemente destruído pelos pesos-pesados da rota do topo na LCK.  Depois de ter entrado para a ROX Tigers (antiga KOO/GE Tigers) no final de 2014, ele desafiou todos os críticos e seu desempenho explodiu sob a tutela do técnico da ROX, NoFe. A ascensão cativante de Smeb ganhou a ele fãs e respeito como um dos inimigos mais formidáveis no Rift.</p>\n\n<p>Smeb continuiu a atingir novos patamares como jogador, conquistando seu segundo prêmio consecutivo como MVP da LCK. O topo liderou a equipe resiliente da ROX a sua primeira coroa na LCK. A animação por trás de Smeb estava altíssima ao entrar no Mundial, até a Tigers encontrar sua rival, a SK Telecom T1, nas Semifinal. Apesar de Smeb e companhia terem perdido para a SKT em uma batalha difícil, seu desempenho admirável deixou uma impressão nos jogadores que os levou a votar nele para o Evento All-Star 2016.</p>","ko_KR":"<p>\"Smeb\" 송경호 선수는 LCK의 최강 탑 라이너 중 한 명입니다. 2013년 Incredible Miracle에서 e스포츠 경력을 시작했지만 별다른 모습을 보여주지 못했던 Smeb 선수는 2014년 말 ROX Tigers에 입단한 후 달라진 모습을 보여주기 시작했습니다. NoFe 코치의 지도를 받아 나르, 럼블, 헤카림을 마스터해 누구보다도 더 능수능란하게 다루는 모습을 보여주었죠. 특히 나르로 뛰어난 모습을 보여 2015 LCK 스프링에서는 나르로 6승 1패를 기록하기도 했습니다.</p>\n<p>ROX Tigers는 카토비체에서 개최된 IEM 시즌 IX 월드 챔피언십에서 World Elite에게 패하기는 했지만, 꾸준히 세계 최강급 팀으로서의 면모를 보여 왔습니다. LCK의 상위권 팀들과 자주 맞붙어야 하는 ROX Tigers에게 있어 Smeb 선수가 탑에서 럼블과 나르로 잠재력을 발휘할 수 있느냐는 팀의 성패와 직결되죠. Smeb 선수가 제 기량만 발휘할 수 있다면 ROX Tigers의 앞날을 밝을 것입니다. </p>\n","es_AR":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>","cs_CZ":"<p>Kyungho „Smeb“ je nejobávanějším horním lajnařem na světě, ale nebylo tomu tak vždy. Jeho profesionální debut s Incredible Miracle roku 2013 skončil katastrofou a špičkoví horní lajnaři z LCK si z něj opakovaně dělali fackovacího panáka. Když však koncem roku 2014 přestoupil do ROX Tigers (dříve KOO Tigers), vzal svým kritiků vítr z plachet a pod vedením trenéra NoFea z ROXu se jeho herní schopnosti ohromným tempem zlepšovaly. Svou cílevědomostí a odhodláním si Smeb vysloužil davy fanoušků a pověst jednoho z nejtěžších nepřátel, na jaké lze ve Žlebu narazit.</p>\n\n<p>Smebova hvězda na herním nebi září čím dál jasněji. Během letního splitu LCK 2016 získal podruhé po sobě ocenění pro nejužitečnějšího hráče ligy, a to zcela zaslouženě, neboť dovedl nezdolný tým ROX k jeho historicky prvnímu titulu z LCK. Nadšení jeho fanoušků dosáhlo s příchodem MS neuvěřitelných výšin, studená sprcha však přišla v semifinále, kde Tigers narazili na své úhlavní nepřátele z SK Telecom T1. Smeb a jeho tým sice SKT podlehli, avšak byla to tvrdá bitva a jeho výkony zanechaly v divácích takový dojem, že se rozhodli jej vyslat do Barcelony na turnaj All-Star 2016.</p>","el_GR":"<p>Ο Kyungho \"Smeb\" Song θεωρείται ο πιο επικίνδυνος παίκτης επάνω λωρίδας στον κόσμο. Δεν ήταν πάντα έτσι, όμως. Έκανε το ντεμπούτο του στην επαγγελματική σκηνή με τους Incredible Miracle του 2013 και γνώρισε την απόλυτη αποτυχία, καθώς τον τσαλαπάτησαν όλοι οι δυνατοί παίκτες επάνω λωρίδας του LCK. Όταν ο Smeb πήρε μεταγραφή στους ROX Tigers (προηγουμένως KOO Tigers) στα τέλη του 2014, όχι μόνο διέψευσε τους κριτικούς του, αλλά βελτίωσε θεαματικά το παιχνίδι του με την καθοδήγηση του προπονητή των ROX, NoFe. Η άνοδος του Smeb κέρδισε τη συμπάθεια και το σεβασμό του κόσμου και τον έκανε έναν από τους πιο τρομακτικούς αντιπάλους στο παιχνίδι.</p>\n\n<p>Ο Smeb κατακτά διαρκώς νέες κορυφές ως παίκτης και πρόσφατα κέρδισε το δεύτερό του βραβείο MVP στο Summer Split 2016 του LCK, όπου οδήγησε τους εξαιρετικά ανθεκτικούς ROX στην πρώτη τους κατάκτηση του πρωταθλήματος. Η πορεία του Smeb είχε δημιουργήσει τρομακτικό ενθουσιασμό, μέχρι που οι Tigers συνάντησαν τους αιώνιους αντιπάλους τους, SK Telecom T1, στους Ημιτελικούς. Παρόλο που ο Smeb και η παρέα του ηττήθηκαν μετά από σκληρό αγώνα, οι εκπληκτικές εμφανίσεις του έκαναν θετική εντύπωση στους θεατές, με αποτέλεσμα να κερδίσει μια θέση στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη.</p>","hu_HU":"Kyungho „Smeb” Song ma a világ legrettegettebb felső ösvényese, de ez nem mindig volt így. 2013-as bemutatkozása az Incredible Miracle tagjaként katasztrofálisra sikeredett, és az LCK felső ösvényes nehézsúlyú játékosai sorra kiütötték. Smeb átigazolt a ROX Tigershez (korábban KOO Tigers) 2014 végén. A ROX edzője, NoFe irányítása alatt hatalmasat fejlődött. Smeb üstökösszerű felemelkedése sok rajongót és rengeteg tiszteletet hozott neki, és ma már a Szurdok egyik legkeményebb harcosának számít.\n</p>\nSmeb egyre magasabbra jut játékosként, zsinórban kétszer lett MVP az LCK 2016-os nyári szakaszában, majd megnyerte a ROX csapatával együtt az első LCK-s bajnoki címüket. Smeb menetelése a vb-n is folytatódott, amíg a Tigers nem találkozott legnagyobb riválisával, az SK Telecom T1-nal az elődöntőben. Bár Smeb és csapata kemény küzdelem után elesett az SKT ellen, így is elég népszerűvé vált ahhoz, hogy kijusson a 2016-os All-Star gálára.\n","it_IT":"Oggi Kyungho \"Smeb\" Song è il superiore più temuto al mondo, ma non è stato sempre così. Il suo debutto professionale con gli Incredible Miracle nel 2013 fu disastroso e lui stesso fu schiacciato ripetutamente in corsia superiore dai pesi massimi della LCK. Dopo essere passato ai ROX Tigers (ex KOO Tigers) alla fine del 2014, ha smentito ogni critica portando il suo gioco a livelli stellari sotto la guida del coach dei ROX, NoFe. L'affascinante ascesa di Smeb gli è valsa l'affetto di numerosi fan e il rispetto degli avversari, che lo considerano uno dei più formidabili guerrieri della Landa.\n</p>\nSmeb ha continuato a raggiungere nuove vette come giocatore, ottenendo il secondo premio consecutivo come MVP nella LCK durante il Summer Split 2016, quando ha guidato i ROX al loro primo trofeo LCK. Gli occhi del mondo erano puntati su Smeb durante i Mondiali, soprattutto durante la battaglia in semifinale contro gli acerrimi rivali degli SK Telecom T1. Anche se Smeb e i suoi compagni si sono dovuti arrendere davanti agli SKT dopo un'intensa battaglia, le sue notevoli prestazioni hanno impressionato il pubblico, che ha deciso di mandarlo dritto a Barcellona per l'All-Star.\n","ro_RO":"Kyungho ''Smeb'' Song este unul dintre cei mai temuți jucători de pe culoarul de sus din lume; dar nu a fost mereu așa. Debutul său pe scena profesionistă alături de Incredibile Miracle în 2013 a fost unul dezastruos, iar el a fost învins în repetate rânduri de legendele de pe culoarul de sus din LCK. După ce Smeb a venit la ROX Tigers (cunoscuți anterior drept KOO Tigers) la finalul lui 2014, și-a sfidat criticii și și-a îmbunătățit stilul de joc sub tutela lui NoFe, antrenorul echipei. Ascensiunea lui incredibilă i-a adus fani și respect, fiind considerat acum unul dintre cei mai formidabili adversari din Rift.</p>\n\nSmeb a atins în mod constant noi culmi ca jucător, câștigând al doilea titlu consecutiv de MVP în LCK în etapa de vară LCK 2016, când a condus echipa ROX către primul ei titlu din LCK. Speranțele și entuziasmul fanilor au atins apogeul la începutul Campionatului Mondial, când cei din Tigers și-au întâlnit adversarii înverșunați, SK Telecom T1, în semifinale. Chiar dacă Smeb și echipa lui au fost învinși de SKT într-un meci extrem de dificil, reușitele sale admirabile le-au lăsat spectatorilor o impresie plăcută, care-l aduce pe scena All-Star Event 2016 din Barcelona.\n\n","es_MX":"<p>Kyungho \"Smeb\" Song es considerado el carrilero superior más temido en el mundo, pero no siempre ha sido así. Su debut profesional con Incredible Miracle en 2013 fue desastroso y fue machacado una y otra vez por los pesos pesados de la LCK. Cuando Smeb se trasladó a ROX Tigers (anteriormente llamado KOO Tigers) al final de 2014, desafió las críticas y su estilo de juego se disparó gracias al tutelaje del entrenador de ROX, NoFe. La increíble ascensión de Smeb le hizo ganarse fans y el respeto que se merece uno de los mejores jugadores en la Grieta.</p>\n\n<p>Smeb ha alcanzado continuamente nuevas cimas como jugador, lo que le ha llevado a conseguir su segundo premio MVP en el torneo de verano de la LCK 2016, en el que lideró al resistente grupo de ROX para conseguir ser coronados por primera vez en la LCK. La expectación generada por Smeb alcanzó su punto álgido de camino al Mundial, pero solo hasta que Tigers se tuvo que enfrentar a su mayor rival en las semifinales: SK Telecom T1. Aunque Smeb y sus compañeros fueron derrotados por SKT en una reñida batalla, sus increíbles actuaciones dejaron huella en los espectadores, que lo han elegido para subirse al escenario del All-Star Event 2016 en Barcelona.</p>"},"foreignIds":{"drupalId":"2151","ESPORTSTMNT06":"200000340","TRLT3":"200000212"},"socialNetworks":{},"champions":[],"liveGameTeam":105},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":2050,"slug":"ssun","name":"Ssun","firstName":"Taeyang","lastName":"Kim","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-07-01T23:19:56.000Z","updatedAt":"2017-07-06T14:11:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200001523","TRLT3":"200000200"},"socialNetworks":{},"champions":[],"liveGameTeam":105}],"scheduleItems":[{"id":"AVMfgDVpOPWArxM1l4c8","content":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:match:cfe7702b-7236-47d3-b98d-794ac778002a","scheduledTime":"2016-03-03T08:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:6","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda","blockLabel":"8","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:bracket:9342e2fe-50d2-41dd-bb72-bb12c42fb5c6"},"match":"cfe7702b-7236-47d3-b98d-794ac778002a","tournament":"0a5fb908-70c8-411b-81e0-27a83c167eda","bracket":"9342e2fe-50d2-41dd-bb72-bb12c42fb5c6","league":"6"}],"gameIdMappings":[{"id":"71fba457-0285-4a55-afa9-5cb81f6731d4","gameHash":"3fbd7921ee771c17"},{"id":"f641ca24-88f5-4958-9f6e-e8113a0406a0","gameHash":"d85c821cd5b42048"}],"videos":[{"id":2018,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:f641ca24-88f5-4958-9f6e-e8113a0406a0","source":"https://www.youtube.com/embed/fOQLmEdjL9o?wmode=transparent&start=1268","createdAt":"2016-03-04T03:55:29.000Z","updatedAt":"2016-03-04T03:55:29.000Z","game":"f641ca24-88f5-4958-9f6e-e8113a0406a0"},{"id":2019,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0a5fb908-70c8-411b-81e0-27a83c167eda:game:71fba457-0285-4a55-afa9-5cb81f6731d4","source":"https://www.youtube.com/embed/fOQLmEdjL9o?wmode=transparent&start=5474","createdAt":"2016-03-04T03:53:44.000Z","updatedAt":"2016-03-04T03:53:44.000Z","game":"71fba457-0285-4a55-afa9-5cb81f6731d4"}],"htmlBlocks":[],"match":{"id":"cfe7702b-7236-47d3-b98d-794ac778002a","name":"SSG-vs-KT","position":40,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"},{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],"games":{"f641ca24-88f5-4958-9f6e-e8113a0406a0":{"id":"f641ca24-88f5-4958-9f6e-e8113a0406a0","name":"G1","generatedName":"KT|SSG|G1|cfe7702b723647d3b98d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"},{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],"standings":{"result":[[{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1457006971948,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"990092","gameRealm":"TRKR1","platformId":"TRKR1:990092","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"71fba457-0285-4a55-afa9-5cb81f6731d4":{"id":"71fba457-0285-4a55-afa9-5cb81f6731d4","name":"G2","generatedName":"KT|SSG|G2|cfe7702b723647d3b98d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"},{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],"standings":{"result":[[{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1457007009009,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"990093","gameRealm":"TRKR1","platformId":"TRKR1:990093","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8ef816f2-2033-4a0b-a9d5-b351f7899f2a":{"id":"8ef816f2-2033-4a0b-a9d5-b351f7899f2a","name":"G3","generatedName":"KT|SSG|G3|cfe7702b723647d3b98d","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"},{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"2b3e3312-c98d-4137-8618-27a42c6cd803"}],[{"roster":"cac729cc-d06b-4835-a0c9-c3953ee9c94c"}]],"timestamp":1457007009009,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}