{"teams":[{"id":118,"slug":"cloud9-tempest","name":"Cloud9 Challenger","guid":"be6efb43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"http://assets.lolesports.com/team/cloud9-tempest-8ft3guds.png","acronym":"C9C","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2016-08-03T19:22:39.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1134"},"players":[112,114,116,256,266,1120],"starters":[112,114,116,266,1120],"subs":[256]},{"id":167,"slug":"nrg-esports","name":"NRG Esports","guid":"be704c38-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/nrg-esports-2hxi3sw4.png","acronym":"NRG","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:14:08.000Z","updatedAt":"2016-09-17T19:38:10.000Z","bios":{"de_DE":"<p>„NRG“ ist ein sogenanntes Gramogramm, eine Verkettung aus Buchstaben, die einzeln ausgesprochen zusammen wie ein Wort klingen – In diesem Fall ist dies das englische Wort Energy. Energiegeladen ist das Team allemal, wenn man sich dessen fünf Spieler anschaut. Ende 2015 wurde das Team unter der Führung von Gerard Kelly, Mark Mastrov, und Andy Miller gegründet, mit dem Ziel die Spitze der NA LCS zu erreichen und schließlich zur Weltmeisterschaft 2016 zu fahren. NRG ist keine Organisation, welche sich mithilfe von jungen Einzelranglistentalenten durch die NA Challenger Series gekämpft hat. Vielmehr besteht das Team aus altbackenen Veteranen, wilden Grünschnabel und etwas mittendrin. </p>\t\n\n<p>Eon-Young “Impact” Jeong und Changseok „GBM“ Lee sind zum einen die gebürtigen Koreaner und zum anderen die alten Herren unter den fünf Freunden. Sie haben viele Jahre Erfahrung auf dem Buckel und weisen den Schülern ihren Weg durch ihre eSports-Karriere. Johnny „Altec“ Ru spielte seit 2012 bereits unter vielen Bannern, doch einen internationalen Namen konnte er sich bisher noch nicht machen. An der Seite der zweieinhalb Veteranen stehen Galen „Moon“ Holgate und Kevin „KonKwon“ Kwon, welche noch im LCS-Rampenlicht zu stehen haben, zumindest mehr als vier Spiele. </p>\n\n<p>Auch das Team ist der Community nicht unbekannt. Tadayoshi \"Hermit\" Littleton war im Sommer 2015 noch der Analyst und Trainer Origens und ist nun der Strategiechef bei seinem neuen Zuhause. Charlie „Charlie“ Lipsie, ehemaliger Cloud9-Analyst besetzt die Cheftrainerstelle und Chad \"HISTORY TEACHER\" Smeltz hat seine Streaming-Persönlichkeit aufgegeben, um nun als NRGs Geschäftsführer zu fungieren. </p>\n\n<p>Die Frage ist wie bei vielen Mannschaften verschiedener Sprachen: Wie kommunizieren die Spieler eigentlich untereinander? Impact besitzt nach seinem einjährigen Aufenthalt in Nordamerika bereits über angemessene Englischkenntnisse, welche wiederum nur die nötigsten Wörter und Begriffe abdecken. GBMs Englisch lässt (noch) zu wünschen übrig und weder Altec noch Moon können koreanisch. Doch KonKwon macht das Team möglich. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat. Entweder sprachen alle Spieler eine gemeinsame oder die Kommunikation vereinfachte sich auf simple Ping-Signale. Da KonKwon als Kind in Seoul, Korea, aufgewachsen ist und mit acht Jahren in die USA zog, ist er bilingual und bildet so eine Brücke zwischen den zwei Sprachgruppen im Team. Es ist ein ausgeklügeltes System, welches bis heute noch kein anderes Team angewendet hat.  Wie der Knoten in der Mitte einer Fliege. </p>\n\n<p>Ganz im Ernst: Schaut doch mal auf die Uniformen NRGs. Die sind doch verdammt niedlich, oder? Wie kann man dieses Team und ihre bunten Fliegen nicht mögen? </p>\n","fr_FR":"<p>NRG fait son entrée dans les LCS avec une composition qui a de quoi faire peur. L'équipe a rassemblé certains des meilleurs vétérans et plusieurs des étoiles montantes les plus prometteuses de Corée et d'Amérique du Nord. D'anciens joueurs des LCK comme Chang-suk « GankedByMom » Lee et Eon-young « Impact » Jeong se retrouvent ainsi aux côtés de talents locaux comme Jonny « Altec » Ru. En fin de compte, leurs plus terribles adversaires pourraient bien être... eux-mêmes ! Composer une équipe qui mélange plusieurs cultures et langues différentes n'est pas un mince exploit. Toutefois, avec un tel niveau de maîtrise des mécaniques de jeu dans une seule équipe, on peut s'attendre à ce que RNG fasse sensation.</p>","pl_PL":"<p>Udział w wiosennym sezonie 2016 to debiut organizacji NRG Esports. Została założona, przez Andy’iego Millera i Marka Mastrova, dwóch współwłaścicieli Sacramento King’s – drużyny NBA. Ogłoszenie o powstaniu tej drużyny miało miejsce wkrótce po zakończeniu Mistrzostw Świata - 16 listopada 2015. Założyciele zdecydowali się przenieść swoje doświadczenie ze świata sportów klasycznych do profesjonalnych rozgrywek w League of Legends. Na swojej stronie NRG Esports zapowiedziało, że po debiucie będą dążyć do zdobycia podium NA LCS. Potem ich cel jest tylko jeden – Mistrzostwa Świata 2016.</p>\n<p>\nJak do tego doszło? W wywiadzie Andy Miller udzielił odpowiedzi na wiele nurtujących pytań dotyczących powstania NRG Esports. Opowiadał o tym jak dowiedział się o League of Legends: dwójka jego synów zainteresowała się League of Legends, a on, przysłuchując się im, stwierdził „Wow, to naprawdę interesujące i mainstreamowe!” Akurat wtedy skończył budowę nowego obiektu dla swojej drużyny NBA i zaczął się zastanawiać, dlaczego miałby się ograniczać tylko do klasycznych sportów. Od myśli do czynów, po 6 miesiącach poszukiwań Andy Miller zakupił drużynę Team Coast \ni założył organizację, która zajęła jej miejsce. Całość odbyła się dzięki pomocy Gerarda Kelliego, właściciela Team Imagine, który podzielił się z nim swoją wiedzą na temat gry, zespołów i organizacji. Współwłaściciel NRG Esports wyraził chęć zaangażowania się w marketing związany z League of Legends i zawodnikami, jako przykład podając swoje dotychczasowe sukcesy w świecie sportu. Zapowiedział również, że zamierza użyć doświadczenia zdobytego podczas zarządzania drużyną NBA, do promowania zawodników. Marzy o tym żeby zobaczyć tłumy fanów w koszulkach NRG Esports. Andy Miller już pokochał swoją drużynę. </p>\n<p>\nKolejna cecha charakterystyczna NRG Esports to jej załoga. Członkowie organizacji mają niesamowite zaplecze i wprawę w prowadzeniu profesjonalnej drużyny. Andy Miller i Mark Mastrov nie oszczędzali - wybrali najlepszych dostępnych specjalistów we wszystkich dziedzinach związanych z League of Legends. Dyrektorem generalnym jest Gerard Kelly, założyciel Team Imagine, który prawie dostał się do NA LCS. Jego doświadczenie będzie podstawą dla działań całej organizacji. Menadżerem został Chad “HISTORY TEACHER” Smeltz, dobrze wszystkim znany z opieki nad Team8. Dołączą do niego sławy takie jak: Tadayoshi “Hermit” Littleton, były instruktor Origen i Charlie “Charlie” Lipsie, były trener Cloud9. Wpływ wyżej wymienionych panów widać na występie ich byłych zespołów na Mistrzostwach Świata 2015. Drużyna Origen dostała się aż do półfinału, a Cloud9 pokazało klasę w pierwszym tygodniu meczy grupowych. Taka obsada personelu ma zapewnić graczom możliwie najlepszą kuratelę, żeby mieli pierwszorzędne warunki do rozwoju. Nic tylko pozazdrościć takiej kadry.</p>\n<p>\nNajważniejszym elementem nowej drużyny, z którym fani będą mieli najwięcej do czynienia, są oczywiście zawodnicy. Współzałożyciele NRG Esports wyszli z założenia, że ich perfekcjonizm musi również mieć odniesienie do graczy. Gerard Kelly odpowiada za wybór i zajmuje się rekrutacją najlepszych ze e-sportowców. Wraz z Andym Millerem rozważają nawet rozszerzenie organizacji o oddziały zajmujące się innymi grami. NRG Esports jako organizacja ma wszystko czego potrzeba do stania się potęgą w NA LCS – kochających właścicieli i troskliwą załogę. \n</p>","en_US":"<p>\nNRG entered the NA LCS 2016 Spring Split with a bang, going 3-0 in their first games. Unfortunately, while the roster they put together was jam packed with mechanical talent, they weren’t able to keep their success going. They’re taking a new approach for Summer: only Chang-suk “GankedByMom” Lee remains (along with his bowtie and shade wearing aesthetic), while the rest of the team has been replaced with some of the most dynamic personalities and fan favourites in North America. Quas? Check. Kiwikid? Check. Santorin? Check. Will they be able to translate the likability factor into results? Only time will tell. But at the very least they’ll be a blast to cheer for.\n</p>\n<p>\nCoach: Tadayoshi \"Hermit\" Littleton\n</p>"},"foreignIds":{},"players":[117,121,150,159,169,185,759],"starters":[121,150,159,185,759],"subs":[117,169]}],"players":[{"id":112,"slug":"balls","name":"Balls","firstName":"An","lastName":"Le","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/balls-b8r8b91b.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T00:59:57.000Z","bios":{"en_US":"<p>An \"Balls\" Le has muscled his way back into the NA LCS. Part of the original Cloud9 squad that took the league by storm in 2013. He roamed the top lane for Cloud9 until the 2016 NA LCS Summer Split, when he was replaced by Impact. Balls headed to Cloud9 Challenger, where he joined fellow Cloud9 founding members LemonNation and Hai. The team rampaged through the NA Challenger Series, earning a spot in the NA LCS.</p>\n\n<p>Balls retained his starting spot as the team became FlyQuest under new ownership, and he proved he's still got it against the best top laners in North America. A legendary Rumble player, Balls never hesitates to break out the Mechanized Menace for FlyQuest. Unlike Rumble, though, he doesn't need a robot to do his heavy lifting.</p>","fr_FR":"<p>An « Balls » a réussi à offrir à Cloud9 un remarquable record de 25-3 lors de ses débuts aux LCS NA et il \n\nn'a cessé de jouer son rôle dans le succès de l'équipe. Quel est pour lui le secret de la victoire ? Rumble. \n\nBalls, dès le début de sa carrière, s'est montré l'un des meilleurs joueurs de Rumble au monde, avec un \n\ntaux de victoire de 100% avec ce champion tout au long de la saison 2014 des LCS NA.</p>\n\n<p>Au contraire de son personnage de prédilection, cela dit, Balls n'a pas besoin qu'un robot soulève la \n\nfonte pour lui dans la vie réelle. Son entraînement physique est légendaire. En gros, il n'a pas peur de \n\nl'adversité. Le reste des top laners a intérêt à se préparer, parce que Balls ne refuse jamais un défi.</p>","pl_PL":"<p>Charakterystyczny uśmiech Ballsa, który pojawia się w koszmarach niejednego fana e-sportu, to jeden z symboli Cloud9 i ciężko wyobrazić sobie tę drużynę bez sympatycznego skądinąd top-lanera. Pomimo niewielkiego wzrostu (Balls mierzy tylko 1,60 m) Amerykanin już od niemal czterech lat miażdży przeciwników na górnej alei.</p>\n<p>\nZaczynał od epizodów w mniej znanych drużynach, w których spotkał jednak kilku graczy, z którym miał okazję mierzyć się później na najwyższym poziomie jak chociażby Zachary’ego „Manclouda” Hoschara, Jake’ a „Xmithie’ego” Puchero czy Eugene’a „Pobeltera” Parka. Po roku gry na pół-profesjonalnym poziomie został dostrzeżony przez budujące potęgę C9 i szybko dołączył do obiecującego zespołu. </p>\n<p>\nTam stworzył własną legendę, przez długi czas będąc bezsprzecznie najlepszym top-lanerem w Ameryce. Miał ogromny udział w sukcesach zespołu, w tym dwóch wygranych w NA LCS i ustanowieniu niesamowitego rekordu. Przeciwnicy do dziś czują respekt, widząc w jego rękach Rumble’a. Dość powiedzieć, że pierwszy mecz na profesjonalnej scenie Balls przegrał tym bohaterem dopiero w sezonie 2015. </p>\n<p>\n„Naprawdę ciężko pokonać go na linii. Gra naprawdę mądrze i bardzo agresywnie, dlaczego zawsze mam kłopoty, by za nim nadążyć.” – powiedział o Ballsie top-laner Teamu Curse, Diego „Quas” Ruiz w lutym 2014 roku.</p>\n<p>\nNiestety po fantastycznych występach w 2013 roku i pierwszej połowie 2014, nadszedł czas na problemy. Od drugiej połowy sezonu 4 Balls systematycznie obniżał poziom, a kłopoty zespołu jeszcze pogłębiły słabą dyspozycję top-lanera. W sezonie 2015 prezentował się zdecydowanie poniżej oczekiwań i pojawiały się nawet spekulacje, że odejdzie z drużyny. Tak się jednak nie stało, ale zmiana mid-lanera z Haia „Haia” Lama na Nikolaja „Incarnati0n” Jensena nie pomogła i pogłoski o zmianie na górnej alei powróciły, tym bardziej, że Balls nadal nie potrafił odnaleźć formy ze swoich początków w NA LCS. Przełomem okazały się Mistrzostwa Świata, gdzie amerykański zawodnik spisał się znacznie lepiej, a w kilku spotkaniach to właśnie on prowadził C9 do wygranych – tak jak za dawnych czasów. Niestety Cloud9 szybko odpadło, a w grze Ballsa można było dostrzec pewną nieregularność, choć warto zwrócić uwagę na progres w jego grze.</p>\n<p>\nBalls jest typem gracza agresywnego, która uwielbia dominować na linii. Doskonale potrafi też przekuć swoją przewagę na walki drużynowe i umiejętnie je rozegrać . Kiedy jest w formie, potrafi pociągnąć grę zespołu i wspaniałym zagraniem przechylić szalę zwycięstwa na stronę C9. Jego zaletą jest również wszechstronność co do stylu gry – nie ma problemów z dopasowaniem się do konkretnych strategii i założeń taktycznych zespołu.</p>\n<p>\nCiekawostką jest fakt, że kuzynem Ballsa jest inny zawodnik z NA LCS – występujący w Teamie Dignitas Danny „Shiphtur” Le. Ponadto jego imię i nazwisko znaczy po wietnamsku… „jeść gruszki”.</p>\n<p> \nAmerykański top-laner znany jest też z tego, że dużo ćwiczy na siłowni. W przeszłości grał też w tenisa i biegał przełajowo. Balls był wśród graczy LCS niejako pionierem w łączeniu gry na komputerze z aktywnością fizyczną, co dzisiaj, kiedy drużyny bardziej dbają o zdrowy tryb życia swoich graczy, jest dość powszechną praktyką.\n</p>","de_DE":"An „Balls“ Le konnte sich den Weg zurück in die NA LCS erkämpfen. Er war Teil des ursprünglichen Cloud9-Teams, das die Liga im Jahr 2013 im Sturm eroberte. Er hat die obere Lane für Cloud9 bis zum Sommer-Split der NA LCS 2016 unsicher gemacht, bis er von Impact ersetzt wurde. Balls spielte dann mit den Cloud9-Gründungsmitgliedern LemonNation und Hai bei Cloud9 Challenger. Das Team dominierte die nordamerikanische Challenger Series und hat sich damit einen Platz in der NA LCS verdient.\n<p>\nBalls behält seinen Startplatz, auch wenn das Team unter einem neuen Besitzer zu FlyQuest wird. Er wird zeigen müssen, dass er es immer noch mit den besten Top-Lanern Nordamerikas aufnehmen kann. Balls ist ein legendärer Rumble-Spieler und wir können fest damit rechnen, dass er „Die mechanisierte Bedrohung“ auch bei FlyQuest zum Besten geben wird. Im Gegensatz zu Rumble braucht er allerdings keinen Roboter, der die harte Arbeit für ihn erledigt.\n","es_ES":"<p>An “Balls” Le ayudó a Cloud9 a un increíble récord de 25 victorias y 3 derrotas en su debut en la LCS NA y se ha mantenido como un miembro clave en el éxito del equipo. ¿Cuál es su secreto para la victoria? Rumble. Balls es uno de los mejores jugadores de Rumble del mundo, consiguiendo un 100% de victorias con la Amenaza Mecánica durante la LCS NA 2014. </p>\n\n<p>Aunque a diferencia de Rumble, Balls no necesita ningún robot para que haga el trabajo duro por él en la vida real. Su dedicación al ejercicio es legendaria. Básicamente, si quiere, puede destruirte. Que se preparen el resto de tops, porque Balls no se amedrenta ante los retos. </p>\n","pt_BR":"<p>Balls ajudou a Cloud9 a chegar ao recorde de 25V-3D na estreia do time na LCS NA, e continua sendo um dos pilares de sucesso do time. Mas qual o segredo dele? Rumble. Ele foi um dos melhores do mundo com Rumble no início de sua carreira, e chegou a ter 100% de vitórias com o Campeão na Temporada 2014 da LCS NA.</p>\n<p>\nOs adversários que se preparem, porque Balls não vai fugir de uma boa luta -- e, ao contrário de Rumble, ele não precisa de um robô bolado para dar conta do recado.\n</p>"},"foreignIds":{"drupalId":"328","TRLH1":"200000201","TRLH2":"200000105"},"socialNetworks":{"facebook":"https://facebook.com/c9balls","twitter":"https://twitter.com/c9balls","twitch":"http://www.twitch.tv/manballs"},"champions":[],"liveGameTeam":118},{"id":114,"slug":"hai","name":"Hai","firstName":"Hai","lastName":"Lam","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hai-j1ifitj.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:50.000Z","updatedAt":"2017-05-25T01:11:36.000Z","bios":{"en_US":"<p>Hai “Hai” Lam is a veteran mid laner, jungler, support and shot-caller. While Hai preferred assassin champions in the mid lane, he developed his own unique playstyle in the jungle and at support. When he returned to the mid lane for Cloud9 Challenger, he led the team through the 2017 NA LCS Spring Promotion Tournament to earn a spot in the big league.</p>\n\n<p>Now, Hai serves as the fearless captain for FlyQuest. With LemonNation and Balls there to back him up, it's just like old times, even down to the winning part. He's shown his mechanics still measure up to the competition, and his shotcalling has never been in doubt. Already one of North America's most legendary players, Hai's story is nowhere close to the end.</p>","fr_FR":"<p>Hai « Hai » Lam est un meneur, un vétéran de la voie du milieu qui est ensuite passé jungler pour finir \n\nsupport. Si Hai préférait les assassins lorsqu'il œuvrait sur la voie du milieu, il a su développer son style \n\nde jeu unique en tant que jungler. Des carrys costauds comme Shyvana aux tanks empêcheurs de \n\ntourner en rond comme Nunu en passant par Amumu, Hai a apporté du nouveau dans la jungle. Et voilà \n\nqu'il change tout à nouveau pour devenir support.</p>\n\n<p>Hai joue un tout nouveau rôle dans la Faille, un peu à la façon des nombreux rôles différents qu'il a \n\nendossés pour les Cloud9 au fil des ans. C'est lui qui donne les instructions générales, qui motive, qui \n\npermet de contrer la pression. Mais au-delà de tout ça, c'est aussi leur capitaine inflexible et digne de \n\nconfiance. Au lendemain de son départ au début du segment d'été des LCS NA 2015, Cloud9 semblait \n\nperdue. Leurs combats d'équipes hors norme et leurs spectaculaires rotations sur la carte n'étaient plus \n\nqu'un souvenir. Puis Hai est revenu. Il n'en résulta pas une soudaine vague de victoires permanentes, \n\nmais le changement fut évident. Hai aida Cloud9 à retrouver sa confiance. La preuve en fut administrée \n\nà la fin de la saison, qui vit Cloud9 passer d'une possible relégation à la qualification pour le championnat \n\ndu monde 2015.</p>","pl_PL":"<p>Serce i mózg zespołu w jednym. I to już od… dwóch i pół roku, nie licząc krótkiej przerwy w występach. Hai dał się poznać w tym czasie jako niesamowity shot-caller, który niejednokrotnie potrafił bezbłędnie nawigować w praktycznie przegranych grach, przekuwając je w zwycięstwa.</p>\n<p>\nHai znajdował się na scenie już w pierwszym sezonie, kiedy to był rezerwowym w zespole Epik Gamer i… niemalże pojechał na Mistrzostwa Świata sezonu 1. Ostatecznie jego kariera nabrała rozpędu, gdy w udało mu się przekroczyć 2500 ELO i zająć 5. miejsce w SoloQ sezonu 2. Postanowił stworzyć zespół, który pod różnymi nazwami (nFear Gaming, Orbit Gaming, Quantic Gaming) przetrwał do grudnia 2012 roku. Wtedy Hai i jego drużyna nawiązali współpracę z organizacją Cloud9, która okazała się zupełnie nowym rozdziałem w karierze amerykańskiego mid-lanera. Formacji udało się dostać do NA LCS dopiero w drugim podejściu (po niewielkich zmianach w składzie), a, co ciekawe, Hai w międzyczasie pełnił też rolę rezerwowego w… Teamie Curse.</p>\n<p>\nPotem przyszedł czas na ogromne sukcesy, na które Hai miał wielki wpływ – zarówno znakomitym shot-callingiem, jak i równie fenomenalną grą na środkowej alei, gdzie doskonale radził sobie popularnymi w tym czasie zabójcami. Zmiany w mecie sprawiły jednak, że Amerykanin musiał zweryfikować swój styl gry i zwrócił się w kierunku mid-lanerów wspierających. To właśnie on spopularyzował na środkowej alei Sorakę, która okazała się w tym czasie prawdziwym potworem. Nie bał się również zagrać na midzie Teemo w szlagierowym spotkaniu z Teamem SoloMid, który to mecz… wygrał.</p>\n<p>\nPóźniej przyszły jednak gorsze czasy i Hai miał problemy z nawiązaniem do swojej legendy. Przyplątały się problemy z nadgarstkiem, które znacząco utrudniały pełne zaangażowanie w trening. Mid-laner spisywał się znacznie słabiej, co natychmiast odbiło się na postawie zespołu. Kontuzje nadgarstka nie były jednak jego jedynym problemem – Hai nie zagrał w turnieju All-Star 2013 przez zapadnięte płuco, przez które trafił do szpitala. Następny split zmagań znów nie wyglądał tak, jak można by oczekiwać od zespołu klasy C9. Ostatecznie, po dwukrotnym wygraniu NA LCS, dwukrotnym zajęciu w tych rozgrywkach drugiego miejsca i dwóch występach na Mistrzostwach Świata, przed letnim splitem 2015, Hai zdecydował się zakończyć karierę.</p>\n<p>\nSzybko okazało się jak ważnym elementem Cloud9 był zmysł taktyczny Haia. Zespół pozbawiony swojej najważniejszej postaci zupełnie się pogubił i utknął na samym dole tabeli. Wobec tego, drużyna w trybie natychmiastowym wezwała swojego emerytowanego kapitana, który zmienił pozycję i zastąpił w dżungli Williama „Meteosa” Hartmana. Wrócił tym samym do swojej pierwotnej pozycji, jeszcze z czasów Orbit Gaming i Quantic Gaming. Odnosił sukcesy, grając głównie Rek’sai oraz dość niestandardowymi na tamten moment bohaterami – Shyvaną oraz Rengerem. Hai doprowadził niemalże do cudu – Cloud9 wydostało się ze strefy spadkowej, w dodatkowym, barażowym meczu zapewniło sobie bezpieczną, siódmą pozycję i dzięki temu (oraz drugiemu miejsce na wiosnę) mogło wziąć udział w turnieju o wyjazd na MŚ, który… wygrało. Hai i C9 po raz trzeci zawitali na najważniejszy turniej w karierze każdego gracza. Niestety po dobrym starcie, druga część grupowej rywalizacji była już fatalna i C9 odpadło z rywalizacji.</p>\n<p>\nW tym czasie Hai dał się poznać z tej nieco gorszej strony. Podczas wywiadu przed meczem barażowym o awans do ćwierćfinału, którego udzielali gracze Fnatic, Fabian „Febiven” Diepstraten powiedział, że faworytem są dla niego przeciwnicy C9. Hai, który przygotowywał się na swoim stanowisku usłyszał to i pokazał Holendrowi… środkowy palec, za co został ukarany grzywną. Potem tłumaczono, że to zachowanie miało mieć charakter humorystyczny.</p>\n<p>\nHai miał wrócić na emeryturę po zapewnieniu C9 utrzymania, a potem po występie na MŚ, ale ostatecznie pozostał w zespole na wiosenny split 2016, zmieniając pozycję na supporta. Ma pełnić ją wspólnie z Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity.</p>\n<p>\nCo ciekawe, brat Haia, Bao, jest jednym z założycieli zespołu Ember, który jest uczestnikiem wiosennego splitu NA Challenger Series 2016. Sam Hai jest natomiast Chief Gaming Officerem (CGO) w Cloud9 (funkcję tę pełni od zakończenia kariery w połowie 2015 roku).\n</p>","de_DE":"Hai „Hai“ Lam ist ein Veteran der mittleren Lane, des Dschungels, in der Supporter-Rolle sowie ein erfahrener Spielführer. Hai hat in der mittleren Lane schon immer Assassinen bevorzugt. Im Dschungel und in der Supporter-Rolle hat er seinen ganz eigenen Spielstil entwickelt. Als er bei Cloud9 Challenger in die mittlere Lane zurückkehrte, führte er das Team durch das Aufstiegsturnier der NA LCS 2017 und sicherte dem Team damit einen Platz in der höchsten Liga.\n<p>\nJetzt wird Hai bei FlyQuest die Rolle des furchtlosen Anführers übernehmen. Mit LemonNation und Balls an seiner Seite wird es wie in alten Zeiten werden. Aber es hat sich einiges getan, seit Hai zum letzten Mal in der NA LCS auf der mittleren Lane gespielt hat. Wird er noch mit den aktuellen Mid-Lanern der Liga mithalten können? Wird er sich an das Metaspiel der Saison 2017 auf der mittleren Lane anpassen können? Wenn er mit seinen Spielmechaniken noch immer auf Augenhöhe mit der Konkurrenz ist, könnte er mit seinen Qualitäten als Spielführer den Unterschied für FlyQuest ausmachen, um die Entscheidungsspiele zu erreichen.\n","es_ES":"<p>\nHai ''Hai'' Lam es un veterano calle central y director de juego reconvertido primero en jungla y luego en apoyo. Aunque en la calle central prefería a los asesinos, en su paso por la jungla desarrolló un estilo de juego propio. Un estilo que supuso un soplo de aire fresco para esta posición, lo mismo con carries puros como Shyvana que con tanques centrados en entorpecer el juego del enemigo, como Nunu, y algún que otro Amumu de vez en cuando. Y entonces decidió dejarlo para convertirse en apoyo.\n</p>\n<p>\nLo cierto es que este cambio de papel es algo a lo que ya nos ha acostumbrado en Cloud9 a lo largo de los años. Ha sido el responsable de dirigir el juego, de motivar a sus compañeros y de absorber la presión, así como, en todo momento, el intrépido capitán y el líder siempre fiable del equipo. Tras su retirada, a principios del Split de verano de la LCS de NA 2015, Cloud9 pareció perder el rumbo. Su característica superioridad en los combates de equipo y las rotaciones por todo el mapa se esfumaron. Entonces volvió Hai. No fue un giro de 180° en el que las derrotas se transformaran en victorias de la noche a la mañana, pero sí un cambio más que evidente. Con la ayuda de Hai, Cloud9 recobró la confianza. Y la prueba de ello llegó al final de la temporada regular, cuando el equipo, que había llegado a estar al borde del descenso, consiguió clasificarse para el Campeonato Mundial de 2015. \n</p>","pt_BR":"<p>Hai é um veterano da rota do meio e coordenador de jogadas que recentemente virou caçador. Se na rota do meio ele preferia assassinos, na selva ele desenvolveu um estilo próprio, usando desde carregadores como Shyvana até tanques como Nunu e Amumu para dar uma renovada nas coisas.</p>\n<p>\nMesmo na nova posição, sua função na Cloud9 como equipe continua a mesma. Ele é o coordenador de jogadas, quem bota os jogadores pra cima, quem alivia a pressão. É o capitão sem medo de nada. Pouco depois de se aposentar, ele voltou para botar a Cloud9 nos trilhos. Ok, o time não voltou aos tempos de glória, mas a mudança foi óbvia. No final das contas, a Cloud9 foi de \"praticamente rebaixada da LCS\" para \"classificada ao Mundial 2015\".</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Hai “Hai” Lam은 베테랑 미드라이너인 동시에 메인 오더를 맡다 정글러, 그리고 또 서포터로 전향한 선수입니다. 미드에서 암살자 캐릭터를 선호했던 Hai는 정글에서 자신만의 독특한 플레이 스타일을 개발했습니다. 쉬바나 같은 하드 캐리부터 누누 같은 탱키한 서포터, 그 사이에 낀 아무무까지, Hai는 정글에 신선한 바람을 불어넣었죠. 그리고 이 모든 것을 버리고 서포터가 되었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Hai는 소환사의 협곡에서 새로운 역할을 맡았습니다. 그가 지금까지 Cloud9을 위해 수행했던 다양한 역할들처럼 말이죠. 그는 오더를 하기도 했고 동기부여를 하기도 했고 압박을 흡수하는 역할도 했습니다. 그 모든 과정에서 용감한 대장이자 신뢰받는 리더였죠. 2015 북미 LCS 서머 스플릿이 시작되면서 Hai가 팀을 떠나자 Cloud9은 목적을 잃은 듯 보였습니다. 세계 수준이었던 Cloud9의 팀 교전과 맵 로테이션이 사라졌죠. 그리고 Hai가 돌아왔습니다. 분위기가 180도 바뀌어 연승 행진을 한 것은 아니지만 변화가 확실히 나타났습니다. Hai는 Cloud9이 자신감을 다시 얻을 수 있게 도왔죠. 강등될 위기에 있던 Cloud9을 Hai가 2015 월드 챔피언십 출전까지 이끈 것이 그 증거입니다. </p>\n"},"foreignIds":{"drupalId":"330","TRLH1":"200000203","TRLH2":"200000107"},"socialNetworks":{"twitch":"http://www.twitch.tv/hail9","facebook":"https://www.facebook.com/HaiL92","twitter":"https://twitter.com/Hai_L9"},"champions":[],"liveGameTeam":118},{"id":116,"slug":"lemonnation","name":"LemonNation","firstName":"Daerek","lastName":"Hart","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lemonnation-4le36yhy.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2017-05-25T01:07:12.000Z","bios":{"en_US":"<p>Daerek \"LemonNation\" Hart never goes anywhere without his notebook. As the founding support player for Cloud9, he bent the 2013 Season's meta to his will with unconventional support picks like Zyra and Morgana. After three seasons on the team, he was replaced in Cloud9's roster shuffle prior to the 2016 NA LCS Summer Split. He brought his notebook along as he joined Cloud9 Challenger and assisted the team on its path to an NA LCS berth.</p>\n\n<p>LemonNation and his notebook are back in the NA LCS as members of FlyQuest. He will have to whip out all his notebook has to offer if FlyQuest hopes to keep up. We'll just have to wait and see what secrets he has tucked away in that little book for 2017.</p>","fr_FR":"<p>Daerek « LemonNation » Hart est l'un des membres fondateurs de Cloud9. De façon générale, LemonNation est considéré comme le stratège de Cloud9. Mais ce n'est pas seulement un expert des choix et des bannissements, c'est aussi l'un des meilleurs supports des LCS nord-américaines lorsqu'il s'agit de maîtriser en début de partie les voies et <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">la carte</a>. Et lorsque LemonNation ne réfléchit pas à de nouvelles stratégies, il expérimente la capacité de support de nouveaux champions comme Nautilus et Veigar. Quel lapin tirera-t-il de son chapeau la prochaine fois ?</p>","pl_PL":"<p>Daerek „LemonNation” Hart jest jednym z założycieli Cloud9. Jako oficjalny „Posiadacz Sekretnego Notatnika” LemonNation jest uznawany za stratega Cloud9. Jednakże nie jest on tylko mistrzem wyborów i banów – LemonNation jest jednym z najlepszych wspierających w północnoamerykańskim LCS, jeżeli chodzi o kontrolę nad <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">mapą</a> i aleją we wczesnej fazie gry. A gdy nie zajmuje się wymyślaniem ciekawych strategii, sprawdza nowych bohaterów w roli wspierających, jak chociażby Nautilusa i Veigara. Jakiego bohatera sprawdzi w następnej kolejności?</p>","de_DE":"Daerek „LemonNation“ Hart geht ohne seinen Notizblock nicht aus dem Haus. Als Gründungsmitglied und Supporter von Cloud9 hat er das Metaspiel der Saison 2013 mit unkonventionellen Supportern wie Zyra und Morgana nach Belieben dominiert. Nach drei Saisons im Team wurde er im Zuge einiger Umstrukturierungen im Team vor dem Sommer-Split der NA LCS 2016 ersetzt. Er hat sich zusammen mit seinem Notizblock Cloud9 Challenger angeschlossen, um das Team auf dem Weg zur NA LCS zu unterstützen.\n</p>\nLemonNation und sein Notizblock kehren mit FlyQuest in die NA LCS zurück. Er spielt auf der unteren Lane weiterhin an der Seite von Altec, aber das Duo muss sich auf eine deutlich härtere Konkurrenz als in der Challenger Series einstellen. LemonNation wird alles aus seinem Notizblock rausholen müssen, wenn er mit FlyQuest Erfolg haben will. Die Zeit wird zeigen, welche Geheimnisse er für 2017 in seinem kleinen Büchlein versteckt hält.\n","es_ES":"<p>Daerek “LemonNation” Hart es uno de los fundadores de Cloud9. Al ser el portador oficial de la “Libreta de los Secretos” es considerado el estratega de Cloud9. Aunque es algo más que la mente maestra en la fase de picks y bans - LemonNation es uno de los mejores supports que hay en la LCS NA cuando hablamos del control tanto de calle como <a href=\"https://www.youtube.com/watch?v=wvUpP3nj6mw&feature=youtu.be&t=10m2s\">de mapa</a> al comienzo de cada partida. Y, cuando no está pensando en las diferentes estrategias, nos sorprende con nuevos campeones para el puesto de support como Veigar o Nautilus. ¿Cuál será el siguiente campeón que se sacará de la chistera? </p>","pt_BR":"<p>Ele não é apenas um dos fundadores da Cloud9, mas também o estrategista do time, portador oficial do \"Caderninho Secreto\" da C9. Além de ser o mestre dos \"picks e bans\", LemonNation é um dos melhores suportes da LCS NA quando o assunto é começo de jogo e controle de mapa e rota. Nas horas vagas, ele gosta de trazer alguns Campeões inusitados como Nautilus e Veigar para a roda. O que será que ele vai inventar agora?</p>"},"foreignIds":{"drupalId":"332","TRLH1":"200000205","TRLH2":"200000109"},"socialNetworks":{"twitch":"https://twitch.tv/lemination","facebook":"https://facebook.com/lemonnationlol","twitter":"https://twitter.com/lemonnnation"},"champions":[],"liveGameTeam":118},{"id":117,"slug":"otter","name":"Otter","firstName":"Brian","lastName":"Thomas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/otter-diqco9ek.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:52.000Z","updatedAt":"2016-05-23T19:16:51.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"341","TRLH2":"1001090004","TRLH1":"1001090008","FRA1TMNT1":"375280"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":121,"slug":"ohq","name":"Ohq","firstName":"Gyu-min","lastName":"Oh","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/ohq-ig34tz4k.png","hometown":"South Korea","region":"NA LCS","birthdate":"","createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-07T00:16:15.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2178","FRA1TMNT1":"375200","TRLH1":"1001270014","TRLH2":"1001180001"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":150,"slug":"kiwikid","name":"Kiwikid","firstName":"Alan","lastName":"Nguyen","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kiwikid-hrcovlc7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2016-06-09T21:08:33.000Z","bios":{"en_US":"<p>\nSome legends are remembered for their epic plays, some legends are remembered for their trophies, and others are remembered because well... they’re just so likable! Say hello to Alan “KiWiKiD’ Nguyen, but if you’ve watched nearly any NA LCS broadcast, you’ve already met him. He’s the support for Team Dignitas, or he was until they were knocked out of the NA LCS during the 2016 NA LCS Summer Promotion Tournament. For a sad while, it looked like we might be without our beloved KiWiKiD, but NRG brought him aboard. It wasn’t just because he’s a great chum, he’s also capable of great plays. He’s well known for locking down enemy teams with champions like Annie and Alistar. Sometimes he goes too aggressive or makes a misplay, but he’s always a delight to watch.\n</p>","fr_FR":"<p>Alan « KiWiKiD » Nguyen sera le support de Dignitas pour la saison 6 des LCS. Tout sauf une surprise tant le joueur est un pilier de l'équipe. Il y est en effet depuis 2012, d'abord comme top laner tout au long de la saison 3 puis au poste de support depuis.</p>\n\n<p>Très controversé comme top laner (il détient l'honneur douteux d'être le joueur le plus souvent mort en saison 3, tous postes confondus) le joueur américain a continué d'être sous le feu des critiques lors de sa transition vers son nouveau poste au début de la saison 4. Malgré tout, il a su faire le dos rond et continuer de se concentrer sur son jeu. Alors que d'autres joueurs ont été poussés à la retraite anticipée, incapables de gérer la pression du public, KiWiKiD a toujours semblé imperméable aux remarques et a continué de s'améliorer à son rythme. Bien lui en a pris puisque s'il n'est toujours pas considéré comme un joueur de classe mondiale, loin s'en faut, l'opinion générale s'accorde aujourd'hui sur le fait qu'il a largement le niveau pour jouer dans les LCS NA.</p>\n\n<p>Véritable roc de Dignitas du haut de ses 22 ans, il parvient bien souvent à imposer sa pression sur toute la carte depuis la voie du bas, notamment lorsqu’il peut incarner des supports ayant une forte capacité à engager le combat. Il aime particulièrement prendre l'initiative avec des personnages comme Nautilus ou Tresh qui peuvent se jeter au cœur de la bataille et résister aux assauts de la ligne de front adverse. Cette année encore et cette fois au côté de Apollo « Apollo » Price en voie du bas, ce sera à lui de porter son équipe par son expérience. Dans l'espoir de peut-être enfin côtoyer les sommets et donner à nouveau tort à toutes les critiques.</p>\n","pl_PL":"<p>Zawodnik powszechnie utożsamiany z Team Dignitas, dzięki jego długiemu stażowi w tej organizacji. Przed uzupełnieniem szeregów tej drużyny grał tylko przez ponad rok w UT Austin, uczelnianej drużynie z Texasu. Pochodzi z Austin, w Texasie, więc po prostu brał udział w lokalnych rozgrywkach. W tamtych czasach \"KiWiKiD\" był znany z agresywnego stylu gry. Został zwerbowany do Team Dignitas w grudniu 2012 roku, ze względu na ban ówczesnego junglera. „Crumbzz” przeniósł się do jungli, a Alan Nguyen zastąpił go na top-lanie. </p>\n<p>\nPo wejściu Alana w jego skład, Team Dignitas automatycznie zakwalifikował się do wiosennego sezonu NA LCS 2013. \"KiWiKiD\" brał udział w 3,4 i 5 sezonie NA LCS, co jest niezwykłym osiągnięciem. Na dodatek cały ten czas był w jednej drużynie, co świadczy o niezmienności i stabilności tego zawodnika. Jedyną poważną zmianą było przeniesienie się z pozycji na top-lanie na rolę supporta pod koniec sezonu trzeciego. Dobrze czuje się jako wspierający, aczkolwiek jego ulubionymi postaciami pozostał Renekton i Rumble, co przypomina o jego starej miłości do górnej linii. Na bot-lanie najchętniej gra bohaterami, którzy mają znaczne możliwości kontrolowania przeciwników, jak Thresh, Alistar i Annie. Zyskał znaczącą sławę, dokonując pięcioosobowego podbicia Minotaurem w grze przeciwko Team Fusion. Ponadto jego rozpoznawalność wzrosła kiedy był gościem wśród analityków.</p>\n<p>\nAlan pytany przez rodziców kim zostanie jak dorośnie odpowiadał: profesjonalnym graczem. Gdy wtedy żartował w ten sposób, nie wiedział jak dobrze trafił. Cały czas uważa to za zabawne, jak się potoczył jego los. Kiedy dostał smsa od Williama \"scarra\" Li’a ucieszył się, ale też bał się, że zostanie oszukany. Tym bardziej, że miał się przeprowadzić do Kaliforni. Od razu pochwalił się wszystkim swoim bliskim i okazało się, że rodzice Alana są bardzo zawiedzeni tą wiadomością. Na początku byli bardzo przeciwni, ale to się na szczęście zmieniło z czasem. Pomimo ich opinii na ten temat, \"KiWiKiD\" spakował się w ciągu 30 minut, wsiadł w auto i pojechał na spotkanie przygody z esportową sceną. Teraz uważa, że to co zrobił było trochę szalone, ale bez tego nie osiągnąłby sukcesu.</p>\n"},"foreignIds":{"drupalId":"21","TRLH1":"1001220077","TRLH2":"1001160127"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":159,"slug":"quas","name":"Quas","firstName":"Diego","lastName":"Ruiz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quas-5gucpg5v.png","hometown":"Venezuela","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-07-19T22:10:43.000Z","bios":{"en_US":"<p>\nDiego “Quas” Ruiz left Liquid in late 2015, and it looked like the end to a career. At the time Quas had one of the largest champion pools in North America and incredible mechanical skills to boot. No one expected him to return, but he brought his talents to NRG Esports for the 2016 NA LCS Summer Split.\n</p>\n<p>\nAfter a poor split that saw NRG lose its spot in the NA LCS, Quas will try to earn his way back through the Challenger Series.</p>","fr_FR":"<p>\nHomme de peu de mots, Diego « Quas » Ruiz laisse son jeu parler pour lui. Disposant d'un arsenal de champions parmi les plus importants d'Amérique du Nord, Quas peut aussi bien jouer Carry avec Kennen que protéger la ligne arrière de son équipe avec Maokai sans avoir besoin d'y réfléchir. Il a commencé à faire parler de lui en parvenant au sommet du classement NA depuis le Vénézuela, et il n'a fait que monter encore depuis qu'il participe aux LCS. Alors qu'il a joué avec pas moins de treize champions différents durant le segment du printemps des LCS NA - et remportant des victoires avec neuf d'entre eux - Quas a été le roc sur la voie du haut de Team Liquid.\n</p>\n<p>\nIl a toutefois utilisé un parc moins large de champions cet été. Piglet et Fenix devenant les principaux carrys de l'équipe, Quas s'est concentré sur les tanks et les absorbeurs de dégâts. Mais qu'il s'agisse d'infliger des dégâts ou de les encaisser, Quas est toujours ce dont a besoin son équipe. Et quand la poussière est retombée après la lutte acharnée pour la suprématie, Quas et Team Liquid ont terminé la saison en première place du Segment d'été des LCS NA 2015. \n</p>","pl_PL":"<p>\nDiego „Quas” Ruiz nie lubi zbyt dużo mówić – woli udowodnić swoją wartość w grze. Jako gracz korzystający z najszerszej gamy bohaterów w Północnej Ameryce Quas jest w stanie zarówno pełnić funkcję prowadzącego, grając Kennenem, jak i osłaniać tyły Maokaiem. Po raz pierwszy zwrócił na siebie uwagę, gdy wkrótce po przybyciu z Wenezueli wspiął się na szczyty północnoamerykańskich rankingów. Od czasu dołączenia do LCS jego wartość cały czas wzrasta. Mają na koncie grę trzynastoma różnymi bohaterami podczas wiosennego splitu PA LCS – dziewięcioma z nich zaliczył zwycięstwo – Quas jest dla Team Liquid prawdziwą ostoją w górnej alejce.\n</p>\n<p>\nLatem krąg wykorzystywanych przez niego bohaterów nieco się jednak zawęził. Gdy funkcję głównych prowadzących przejęli Piglet Fenix, Quas zaczął grać obrońcami i innym mięsem armatnim. Niezależnie od tego, czy otrzymuje obrażenia, czy je zadaje, Quas zawsze jest tam, gdzie potrzebuje go jego drużyna. Gdy zażarta walka o pierwszeństwo dobiegła końca, Quas i Team Liquid znajdowali się pod koniec regularnego sezonu na pierwszym miejscu w letnim splicie 2015 NA LCS. \n</p>"},"foreignIds":{"drupalId":"1158","ESPORTSTMNT02":"200000681","TRLH1":"200000307"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":169,"slug":"mancloud","name":"mancloud","firstName":"Zachary","lastName":"Hoschar","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/mancloud-6o5eeywa.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:07.000Z","updatedAt":"2016-08-04T18:26:08.000Z","bios":{"en_US":"Zachary \"mancloud\" Hoschar has showcased his skills as XDG's Mid Lane since the foundation of mTw.NA. Maintaining a varied champion pool, mancloud frequently breaks from convention. His style is a versatile one, playing aggressively, passively, pushing and roaming, all with the intent to counter his opponents’ tactics. When left to his own devices, he often defaults to his excellent Karthus play to carry his team to victory."},"foreignIds":{"drupalId":"36","TRLH1":"1001060001","TRLH2":"1001050002"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":167},{"id":256,"slug":"bubbadub","name":"Bubbadub","firstName":"Royce","lastName":"Newcomb","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/bubbadub_profile.jpg","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-07-12T20:07:14.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1147","TRLH1":"1001220061","TRLH3":"1001160071","TRLH4":"1001160071","TRLH2":"1001160111"},"socialNetworks":{},"champions":[],"liveGameTeam":118},{"id":266,"slug":"altec","name":"Altec","firstName":"Johnny","lastName":"Ru","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/altec-iph42da0.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:17.000Z","updatedAt":"2017-05-26T00:05:35.000Z","bios":{"en_US":"<p>Johnny \"Altec\" Ru is just 20 years old, but it feels like he's been around forever. His NA LCS career began with Evil Geniuses in 2014 when he replaced ADC yellowpete. He stuck around through the team's rebranding to Winterfox, then jumped between Gravity and NRG Esports before landing with Cloud9 Challenger. As the team's starting ADC, he punished his lane opponents and earned a spot in the NA LCS.</p>","de_DE":"Johnny „Altec“ Ru ist nur 19 Jahre alt, aber es fühlt sich so an, als wäre er schon ewig dabei. Seine NA LCS-Karriere hat 2014 bei Evil Geniuses begonnen, wo er den AD-Carry yellowpete ersetzte. Er blieb auch nach der Namensänderung zu Winterfox noch im Team, anschließend wechselte er zwischen Gravity und NRG Esports hin und her, bis er schließlich bei Cloud9 Challenger landete. Als AD-Carry hat er seine Gegner in der Lane in die Schranken gewiesen und sich damit einen Platz in der NA LCS gesichert.\n</p>\nAltec bleibt dem Team 2017 auch nach der Namensänderung zu FlyQuest treu. Er wird bestimmt von den legendären Theorycrafting-Fähigkeiten seines Lane-Partners, dem ehemaligen Cloud9-Supporter LemonNation, profitieren. Wenn es hart auf hart kommt, hat Altec die mechanischen Fähigkeiten, um gegnerische AD-Carrys zu dominieren. Als Teenager hat Altec die besten Voraussetzungen, um sich als eines der größten Talente der unteren Lane in der NA LCS zu etablieren.\n","fr_FR":"<p>Johnny « Altec » Ru a commencé sa carrière e-sportive en tant que remplaçant pour des équipes des LCS \n\net en jouant sur la scène Challenger avec Team SoloMid, Curse Academy et Cloud9 Tempest. Il est \n\nfinalement arrivé jusqu'aux LCS quand il a été recruté par Evil Geniuses en 2014. Après des résultats \n\nmédiocres pendant plusieurs segments avec Evil Geniuses (plus tard renommée Winterfox) puis avec \n\nGravity, Altec a été recruté par NRG juste avant le segment printanier des LCS NA 2016.</p>\n\n<p>Si Gravity offrait à Altec un cadre plus propice à la persévérance, NRG représente un tout nouveau \n\nterrain de jeu. Altec a commencé à devenir un redoutable carry en 2015, et NRG va devoir trouver le \n\nmoyen de continuer à le pousser à s'améliorer, dans l'espoir d'atteindre le sommet des LCS NA.</p>","pl_PL":"<p>Utalentowany AD Carry NRG Esports zaczął jako jeden z najmłodszych zawodników na profesjonalnej scenie. Rozpoczął swoją przygodę z grami już w wieku 8 lat, a grą na profesjonalnej scenie w League of Legends w wieku 15 lat. Pomimo swojego wieku posiada doświadczenie z imponującej ilości zespołów. Curse Academy. Team Solo Mid. Evil Geniouses. Winterfox. To tylko część drużyn, w których barwach wystąpił. Współpraca z wieloma różnymi zawodnikami i organizacjami ostatecznie go zawiodła do Gravity. Współpracując na bot-lanie z Michaelem \"Bunny FuFuu\" Kurylo’em dokonywał cudów, pokonując innych wytrawnych przeciwników. Niestety pomimo starań, przez przegraną z Cloud9, ostatecznie nie dostał szansy żeby pokazać się na Mistrzostwach Świata.  Szkoda, ponieważ powszechny jest pogląd, że jest najbardziej utalentowanym, tak młodym, AD Carry. </p>\n<p>\nJohnny Ru w wywiadzie z Cameronem Gilbertem opisał swoje początki z League of Legends. Odwiedził swojego kuzyna, który akurat zachwycał się dziełem Riot Games. Po krótkich namowach zdecydował się dać tej grze szansę. Wkrótce potem „Altec” codziennie po szkole poświęcał czas na poznawanie świata League of Legends. Oprócz konkurowania z resztą społeczeństwa w grach rankingowych, Johnny uważnie śledził profesjonalną scenę. Przyznał, że olbrzymi wpływ na jego rozwój miały streamy Yilianga \"Doublelift\" Penga i George’a \"HotshotGG\" Georgallidisa. Traktował naukę od najlepszych bardzo poważnie, już wtedy obrał sobie za cel zostanie profesjonalnym graczem. Oglądając ówczesnych zawodowców AD Carry NRG Esports wypracował sobie technikę, która wkrótce pozwoliła mu konkurować z najlepszymi. </p>\n<p>\nZainspirowany legendarnym eks AD Carrym Counter Logic Gaming Johnny \"Altec\" Ru pokochał rolę strzelca. W wyżej wspomnianym wywiadzie wielokrotnie zaznaczał, że na początku uczył się tylko naśladować Yilianga \"Doublelift\" Penga. Dopiero jak opanował do perfekcji jego sposób zabijania stworów przeszedł do kolejnego etapu – ulepszania i modyfikowania tego co już umie. Johnny potrafi wyciągnąć maksimum z każdego strzelca, ale często wybiera konkretnych bohaterów ze względu na kompozycję drużyny. W związku z tym w ostatnim sezonie najczęściej decydował się na Sivir i Tristanę. Na początku sezonu szóstego \"Altec\" będzie musiał się zgrać z nowym supportem, ale pomimo tego w żadnym wypadku nie powinien być niedoceniony ze względu na wiek.\n</p>"},"foreignIds":{"drupalId":"1582","TRLH1":"200000204","TRLH2":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":118},{"id":759,"slug":"gbm","name":"GBM","firstName":"Chang-suk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gbm-o8g887p.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-28T01:24:16.000Z","bios":{"en_US":"","fr_FR":"<p>Ne lui donnez surtout pas Orianna. S'il y a une leçon que tous ceux qui affrontent GBM finissent par \n\nretenir, c'est qu'il ne faut jamais, <em>au grand jamais</em> donner à Chang-seok « GBM » Lee son \n\nchampion préféré, la Demoiselle mécanique. Certaines équipes ont commis cette erreur lors du segment \n\nd'été des LCK 2015, et elles se sont retrouvées face à un monstre avec un KDA de 22. Si GBM parvient à \n\nmaîtriser quelques autres champions aussi bien qu'Orianna, il sera à n'en pas douter un joueur des plus \n\nredoutables sur la voie du milieu.</p>\n\n<p>GBM aura peut-être une nouvelle chance d'exceller avec son champion de prédilection maintenant qu'il \n\nest passé aux LCS NA pendant l'intersaison 2015. C'est un tout autre monde, rempli de mid laners qui ne \n\nsavent pas encore ce dont GBM est capable.</p>","pl_PL":"<p>Mid-laner NRG Esports nie był bardzo popularny poza Koreą – swoją legendę w Ameryce zaczął pisać 16.11.2015, w momencie dołączenia do drużyny Gerarda Kelliego. Jego debiut w NA LCS to wiosenny sezon 2016. W swojej ojczyźnie był uważany za jednego z najlepszych graczy na środkowej alei. Lee \"GBM\" Chang-seok był członkiem dobrze znanych zespołów: CJ Entus Frost i Jin Air Green Wings, więc nie można odmówić mu doświadczenia w grze na najwyższym poziomie. Olbrzymi wpływ na jego rozwój mieli Kang \"Ambition\" Chan-yong i Jung \"RapidStar\" Min-sung. Jungler CJ Entus zainspirował „GBM” do nauki gry Orianną, do wejścia na sam szczyt w pierwszym sezonie. Motywacja była tak silna, że do dzisiaj jest powszechnie uważany za jedną z najlepszych Mechanicznych Baletnic na świecie. Z tego też powodu często jest nazywany „mistrzem Orianny”. Z kolei, emerytowany już, legendarny \"RapidStar\" był jednym z bliższych przyjaciół Lee’a Chang-seoka. Wzajemnie się uczyli, razem ćwiczyli nowe zagrania i dzielili rolę mid-lanera w CJ Entus. Takiego kolegi pozazdrościłby każdy gracz.</p>\n<p>\nWiele osób może się zastanawiać co oznacza przydomek mid-lanera NRG Esports, który na pierwszy rzut oka przypomina przypadkowy zlepek liter. Tymczasem on ma długą i zabawną historię. „GBM” to pierwsze litery oryginalnego nicka Lee’a Chang-seoka – „Ganked By Mom”. Młody Koreańczyk zdecydował się na taki pseudonim, ze względu na to, że został wielokrotnie przyłapany w środku nocy przez swoją matkę na grze w League of Legends. Pierwotnie brzmiał on „mom critical”, ale ze względu liczną publikę z zachodu został zmieniony na „zgankowany przez matkę”. Jak widać troska kochających matek koliduje z planami również wielkich graczy.</p>\n<p>\nJego zasób bohaterów poraża swoim rozmiarem. W piątym sezonie grał ponad 10 różnymi postaciami, a tylko tyloma prawdopodobnie ze względu na ich siłę w obecnej mecie. Oprócz zjawiskowej gry Orianną, wyróżnił się niezwykle skuteczną grą Viktorem i Lulu. Można śmiało powiedzieć, że „GBM” był w lidze koreańskiej jednym z poważanych i uniwersalnych mid-lanerów. Wykształcił swój talent wśród najlepszych i z takim nastawieniem przyjechał do Ameryki. Organizacja NRG, zaraz po ogłoszeniu swojego istnienia, umieściła na stronie jego słowa: „Moim celem jest zawsze być numerem jeden”. W nastawieniu Lee’a \"GBM\" Chang-seoka nie ma niedopowiedzeń.\n</p>","de_DE":"<p>Chang-suk „GBM“ Lee geht 2017 neue Wege. Er hat eine neue Mannschaft, nennt eine neue Region sein Zuhause und spielt auf einer neuen Position. Als seine ehemalige Mannschaft, NRG Esports, aus der NA LCS abstieg, begab sich der langjährige Mid-Laner auf die Reise über den großen Teich, um sich Team Vitality anzuschließen und dort um die Junglerposition zu kämpfen.\n\nEr mutet sich viel zu, denn er will in kürzester Zeit eine neue Rolle lernen und sich auf die LCS vorbereiten, aber GBM sucht im neuen Jahr die Herausforderung. Aber egal, ob er oder Djoko schlussendlich als Jungler eingesetzt wird, der Gewinner ist in jedem Fall Team Vitality.</p>"},"foreignIds":{"drupalId":"2160","TRLH3":"200000129","TRLH4":"200000227","ESPORTSTMNT02":"200002218","TRLH1":"200000714"},"socialNetworks":{},"champions":[],"liveGameTeam":167},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":118}],"scheduleItems":[{"id":"AVZH5kbwQMQFcjhwbQlC","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:d10d52b0-dd7e-432c-9621-2be265fef1af","scheduledTime":"2016-08-06T19:00:01.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"Round 2","subBlockLabel":"1","blockPrefix":"","subBlockPrefix":"round","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:af3ab11e-3162-4ec3-a45d-2c5785fb76e3"},"match":"d10d52b0-dd7e-432c-9621-2be265fef1af","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"af3ab11e-3162-4ec3-a45d-2c5785fb76e3","league":"2"}],"gameIdMappings":[{"id":"d2398fa9-b9fd-44b4-b59a-33a1a1ad3d69","gameHash":"103edbec1f105423"},{"id":"8d03fce6-2eb0-4e09-b770-34e8ab59b4e9","gameHash":"7c5d526938f6231e"},{"id":"afd9b7c6-3792-4c79-9703-3bce171d8d20","gameHash":"dc28fe48431a47e7"}],"videos":[{"id":4111,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:d2398fa9-b9fd-44b4-b59a-33a1a1ad3d69","source":"https://www.youtube.com/embed/avw6JQ880ug?wmode=transparent","createdAt":"2016-08-06T21:16:25.000Z","updatedAt":"2016-08-06T21:16:25.000Z","game":"d2398fa9-b9fd-44b4-b59a-33a1a1ad3d69"},{"id":4113,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:8d03fce6-2eb0-4e09-b770-34e8ab59b4e9","source":"https://www.youtube.com/embed/U2N_F5m0nSA?wmode=transparent","createdAt":"2016-08-06T21:56:06.000Z","updatedAt":"2016-08-06T21:56:06.000Z","game":"8d03fce6-2eb0-4e09-b770-34e8ab59b4e9"},{"id":4115,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:afd9b7c6-3792-4c79-9703-3bce171d8d20","source":"https://www.youtube.com/embed/AGDAv4zFTG4?wmode=transparent","createdAt":"2016-08-06T23:26:07.000Z","updatedAt":"2016-08-06T23:26:07.000Z","game":"afd9b7c6-3792-4c79-9703-3bce171d8d20"}],"htmlBlocks":[],"match":{"id":"d10d52b0-dd7e-432c-9621-2be265fef1af","name":"match-c","position":1,"state":"resolved","groupPosition":1,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0},{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],"games":{"25dcfe3d-75f7-4dd8-b625-b13ea60fb96e":{"id":"25dcfe3d-75f7-4dd8-b625-b13ea60fb96e","name":"G5","generatedName":"C9C|NRG|G5|d10d52b0dd7e432c962","input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0},{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"d2398fa9-b9fd-44b4-b59a-33a1a1ad3d69":{"id":"d2398fa9-b9fd-44b4-b59a-33a1a1ad3d69","name":"G1","generatedName":"C9C|NRG|G1|d10d52b0dd7e432c962","input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0},{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],"standings":{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470518168425,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470513574026,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001790226","gameRealm":"TRLH1","platformId":"TRLH1:1001790226","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"afd9b7c6-3792-4c79-9703-3bce171d8d20":{"id":"afd9b7c6-3792-4c79-9703-3bce171d8d20","name":"G3","generatedName":"C9C|NRG|G3|d10d52b0dd7e432c962","input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0},{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],"standings":{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470525980972,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470519678324,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001790241","gameRealm":"TRLH1","platformId":"TRLH1:1001790241","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"dfe1a127-7294-452b-b295-0552038f8d55":{"id":"dfe1a127-7294-452b-b295-0552038f8d55","name":"G4","generatedName":"C9C|NRG|G4|d10d52b0dd7e432c962","input":[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0},{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"8d03fce6-2eb0-4e09-b770-34e8ab59b4e9":{"id":"8d03fce6-2eb0-4e09-b770-34e8ab59b4e9","name":"G2","generatedName":"C9C|NRG|G2|d10d52b0dd7e432c962","input":[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1},{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}],"standings":{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470520550461,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":1}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656","breakpoint":"65b9b6fc-abbd-45f0-8e66-a6cd11be84b1","standing":0}]],"timestamp":1470516642562,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001790239","gameRealm":"TRLH1","platformId":"TRLH1:1001790239","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1470525980972,"source":"bestOf","history":[{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1470520550462,"source":"bestOf","closed":true},{"result":[[{"roster":"592e0062-9738-4e0d-82c4-956caba01fee"}],[{"roster":"9f260d15-d5b1-4363-bdd7-e71a3d832656"}]],"timestamp":1470519678325,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}