{"teams":[{"id":15,"slug":"fnatic","name":"Fnatic","guid":"be6c86ea-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bjbf9nf7.jpg","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-i09wrkpf.png","acronym":"FNC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fnatic-bkk3xam5.png","createdAt":"2014-08-01T18:45:38.000Z","updatedAt":"2017-07-27T00:51:46.000Z","bios":{"en_US":"<p>As the original League of Legends World Champion, Fnatic was the team to beat in LoL’s infancy. These days, the squad is completely unrecognizable from its original form. With a new roster mixing veteran playmakers like sOAZ and Rekkles plus Caps, their lone rookie, Fnatic is remaking itself. Putting their underwhelming 2016 behind them, Fnatic believe they are building a roster that could make a serious run at the EU LCS trophy.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>\n","fr_FR":"<p>Première détentrice du titre mondial de League of Legends, Fnatic était l'équipe à battre dans la prime enfance de LoL. Mais l'équipe d'aujourd'hui n'a plus rien à voir avec sa forme d'origine. Sa nouvelle formation accueillant à présent des talents coréens, des joueurs européens prometteurs et Rekkles, la star carry AD, Fnatic est en pleine reconstruction. Avec une série de 18 victoires sans défaite durant le segment d'été des LCS EU 2015 et une qualification pour les demi-finales du mondial 2015, l'équipe a prouvé qu'elle pouvait encore obtenir des résultats.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Team Manager: Finlay \"Quaye\" Stewart</p>","pl_PL":"<p>Legendarni obrońcy honoru Europy. Fnatic to jedna z najstarszych drużyn konkurujących w League of Legends. 14 marca 2011 roku ta organizacja, dobrze znana z udziału w innych grach, zaistniała w świecie Runeterry. Świeżo po założeniu, od razu zabrała się za największy kaliber osiągnięć. Żółto-czarni byli jedną z 8 ekip, które zakwalifikowały się do Mistrzostw Riot Games pierwszego sezonu. Dokonali tego zaledwie trzy miesiące po założeniu drużyny, co jak na początkujących, stanowiło imponujący wyczyn. Przez cały turniej przegrali tylko dwa mecze na swojej drodze do zwycięstwa. Dzięki temu osiągnięciu Europa zawdzięcza im swój jedyny dotąd mistrzowski tytuł, a codzienni gracze mogą cieszyć się skinami europejskiego zespołu. Ten historyczny triumf to był dopiero początek wielkich sukcesów tej drużyny.</p>\n\n<p>Doskonałą kondycją Fnatic mógł się pochwalić również w trzecim, czwartym i piątym sezonie, podczas których reprezentował Europę na Mistrzostwach Świata. W 2014 roku nie udało im się wejść do fazy eliminacji, lecz w pozostałych latach pokazali prawdziwą klasę. Podczas MŚ w Stanach Zjednoczonych, w 2013 roku, wyszli ze swojej grupy na pierwszym miejscu, z zawrotnym wynikiem 7:1. W ćwierćfinałach podołali ówcześnie najmocniejszej drużynie Ameryki, Cloud9, na ich własnym terenie. Ulegli dopiero w półfinale z Royal Club, lecz nawet wtedy czarno-żółtym udało się zatriumfować w jednej grze przed ostateczną porażką. Podobnym powodzeniem Fnatic mógł się pochwalić podczas MŚ 2015. Kolejny raz zdominowali fazę grupową, jeszcze raz znajdując się na pierwszym miejscu, tym razem z wynikiem 4:2. W ćwierćfinale stoczyli walkę z pierwszorzędnym chińskim zespołem – Edward Gaming. Warto zauważyć, że był to jeden ze zdecydowanych faworytów tego wydarzenia. Zdominowali ich 3 do 0, nie pozostawiając cienia złudzeń co do tego, kto zasłużył na laur. Odpadli dopiero w półfinale w starciu z koreańską potęga. Patrząc na dorobek Fnatic z Mistrzostw Świata, śmiało można stwierdzić, że mało która organizacja na świecie może pochwalić się tak niezmiennie dobrymi wynikami.\n</p>\n<p>\nO osiągnięciach tej drużyny na pomniejszych turniejach można by napisać książkę. Jednak trzeba zwrócić uwagę na bezsprzecznie niepowtarzalne triumfy zespołu Fnatic. To przede wszystkim stała i niezachwiana dominacja w lidze EU LCS. Ekipa czarno-żółtych zawsze była na pierwszym lub drugim miejscu w rozgrywkach League Championship Series. Niezłomność i permanentna obecność Fnatic na szczycie zasługuje na najwyższe uznanie. Oprócz członkostwa graczy najwyższych lotów, ten sukces wynika także z zapewnionego im troskliwego patronatu przez samą organizację. Na początku piątego sezonu do kadry dołączył Luis „Deilor” Sevilla, który wcześniej był profesjonalnym trenerem pokera. Wiele osób uważa, że w dużej mierze to właśnie on stoi za sukcesem czarno-żółtych na MŚ 2015. Pod jego opiekuńczymi skrzydłami Fnatic rozkwitło. W wiosennym sezonie EU LCS 2015 skończyli z wynikiem 13:5, a w letnim pobili światowy rekord i pozostali niepokonani aż do końca.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Responsable d’équipe: Finlay \"Quaye\" Stewart</p>","de_DE":"<p>Als LoL noch in den Kinderschuhen steckte, war Fnatic, der erste Weltmeister in der Geschichte von League of Legends, die Mannschaft, die es zu schlagen galt. Die heutige Mannschaft hat mit der damaligen nichts mehr gemein. Mit einer Mischung aus erfahrenen Spielern wie sOAZ und Rekkles sowie dem Nachwuchsspieler Caps versucht Fnatic, sich neu zu erfinden. Fnatic hat die Rückschläge des vergangenen Jahrs hinter sich gelassen und glaubt, mit der neuen Aufstellung Chancen auf den Titel in der EU LCS zu haben. Die Spieler sind entschlossen und haben das Zeug dazu, als beste Mannschaft in die langjährige Geschichte Fnatics einzugehen.</p>\n\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Mannschaftsleiter: Finlay \"Quaye\" Stewart</p>\n","es_ES":"<p>Hablar sobre Fnatic es hacerlo sobre éxito, dedicación y superación. El conjunto europeo más laureado de la escena tendrá otro año más que empezar de cero y saber renovarse para intentar emular los resultados del año pasado. Algo que se plantea casi imposible por su inmaculada temporada se tendrá que realizar con nuevos jugadores que a pesar de no ser tan desconocidos como los que comenzaron el año pasado presentan mayores dudas.</p>\n\n<p>El palmarés de Fnatic es impresionante. Desde ganar el primer Campeonato Mundial de League of Legends hasta sólo perder una vez los playoffs de la LCS europea en verano de 2014 contra Alliance. La única mancha de la organización es la no presencia en el Campeonato Mundial 2012, así cómo podría considerarse un pequeño bache no pasar de la fase de grupos en el Campeonato Mundial de 2014. Pero, en el resto de ocasiones, la actuación ha sido espectacular.</p>\n\n<p>Hasta el año pasado, Fnatic mantuvo un núcleo que siempre otorgaba las mismas impresiones. Durante la fase regular, probaban cambios y los resultados les dejaron un poquito al margen, pero lo suficiente como para clasificarse y luego arrasar en los playoffs. Un equipo calculador que en todo momento ha sabido aprovechar sus recursos para poder superar las expectativas de los aficionados.</p>\n\n<p>El año pasado la renovación no sólo fue fructífera, sino inesperada. Los chicos de Luis ‘Deilor’ Sevilla fueron capaces de ganar en primavera después de una fase regular con sensaciones encontradas. La actuación en el Mid Season Invitational motivó a pensar que Fnatic podía plantar cara a los mejores equipos del mundo. Verano no dio lugar a dudas, puesto que ganaron todos los partidos disputados en la fase regular y estuvieron a punto de hacerlo también en los playoffs si no fuera porque Origen les plantó cara en la final y les pudo sacar dos partidos. Pero no fue suficiente, y Fnatic de nuevo se llevó el preciado trofeo.</p>\n\n<p>Muchos críticos tenían curiosidad por ver si este, probablemente el mejor equipo europeo desde Moscow 5, conseguiría plantar cara a equipos internacionales. Y a pesar de un mal inicio en la fase de grupos, remontaron con un gran nivel y se clasificaron a cuartos de final. Allí derrotaron a la potencia china con una facilidad pasmosa, pero los coreanos juegan en otra división y KOO Tigers acabó con sus esperanzas en las semifinales.</p>\n\n<p>Después de los mundiales tanto su top, Heo ‘Huni’ Seung-hoon, como su mid, Kim ‘Reignover’ Yeu-jin, anunciaron su intención de marcharse a américa en busca de un reto nuevo. Pero la esencia real se perdía con la marcha de Bora ‘YellOwStaR’ Kim, líder del grupo que también decidió irse con el mismo objetivo. El equipo quedó huérfano después de casi tres años enteros del francés con la organización.</p>\n\n<p>Hay que mirar hacia adelante. Al igual que el año pasado las exigencias sólo eran de clasificarse al mundial y al final el buen trabajo recompensó, esta temporada hay que ser lo suficientemente humildes para poder aspirar a gestas heroicas. El equipo ha demostrado que es capaz de sacar provecho de plantillas como la actual, pero todavía es muy pronto para saber cómo funcionarán internamente y sólo queda disfrutar del progreso del conjunto.</p>\n<p>Coach: Dylan \"Dylan Falco\" Falco</p>\n<p>Jefe de equipo: Finlay \"Quaye\" Stewart</p>","pt_BR":"O primeiro campeão mundial da história de League era o time a ser batido nos primeiros anos do cenário competitivo. Hoje, porém, a escalação é totalmente diferente daquela formação original. A nova Fnatic combina talentos coreanos com promessas do cenário europeu e uma base sólida com o suporte YellOwStaR. Eles podem estar se reconstruindo ainda, mas os resultados já são inquestionáveis: recorde de 18V-0D na etapa de verão da LCS EU, e primeiro lugar nas eliminatórias.  ","en_GB":""},"foreignIds":{"drupalId":"68"},"players":[94,98,172,344,1107,1111,1264],"starters":[94,98,172,1107,1111],"subs":[344,1264]},{"id":33,"slug":"h2k","name":"H2K","guid":"be6c983d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/h2k-6mbalx6s.png","acronym":"H2K","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:41:20.000Z","bios":{"en_US":"<p>H2K entered the 2016 World Championship as underdogs. They left as the best team from the west. After an up and down performance in the 2016 EU LCS Summer Split, H2K qualified for Worlds on Championship Points. Jankos led the charge to silence the doubters, and H2K made it all the way to the Semifinal round against Samsung Galaxy.</p>\n\n<p>Just when Europe seemed its weakest, H2K showed what they could accomplish on the international stage. With a reworked roster for 2017, they’ll work to earn another spot at Worlds to try and make it even closer to the championship and make their region proud.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra","fr_FR":"<p>La structure H2K a commencé ses activités sur League of Legends en 2011. De nombreux joueurs talentueux comme Johannes « puszu » Uibos, Remigiusz « Overpow » Pusch ou Sebastian « niQ » Robak ont fait étape dans cette structure basée au Royaume-Uni, sans résultats significatifs. C’est en juin 2014 que l’organisation passe à la vitesse supérieure en recrutant quatre anciens de Cloud9 Eclipse : le toplaner roumain Andrei « Odoamne » Pascu, le jungler danois Jonas « Trashy » Andersen, le midlaner néerlandais Fabian « Febiven » Diepstraten et le carry AD suédois Petter « Hjärnan » Freyschuss, rejoints par le support roumain Baltat « AoD » Alin. Ce nouveau collectif remporte les Challengers series mais échoue à se qualifier aux LCS lors du tournoi de promotion. L’aventure aurait pu s’arrêter sur cet échec, mais deux nouvelles places sont mises en jeu dans le cadre de l’augmentation du nombre d’équipes prenant part aux League of Legends Championship Series.</p>\n\n<p>Afin de se préparer au mieux à cette nouvelle échéance, H2K recrute le Français Jean-Victor « loulex » Burgevin pour remplacer Trashy, ainsi que l’Estonien Erih « Voidle » Sommermann, qui retrouve ses ex-coéquipiers et prend la place laissée vacante par AoD. L’ancien joueur professionnel Neil « Pr0lly » Hammad est lui importé des États-Unis pour assurer la fonction de coach. La mayonnaise prend et H2K parvient finalement à se hisser aux LCS ! Febiven reçoit alors une offre de Fnatic, qu’il ne peut pas refuser. Pour palier son départ, H2K fait appel aux services du Coréen Sang-ook « Ryu » Yoo, récemment arrivé en Europe.</p>\n\n<p>Les débuts aux LCS sont difficiles. Lors de la semaine 3, H2K compte 2 victoires pour 4 défaites et occupe la 7e place du classement provisoire. Voidle est alors écarté et Raymond « kaSing » Tsang est appelé pour le remplacer. L’arrivée du Londonien est salvatrice : H2K enchaîne 8 victoires consécutives et remonte le classement jusqu’à atteindre une 3e place qu’elle ne quitte plus, même lors des play-offs. L’équipe joue un jeu calme et calculé dans lequel Hjärnan est le carry principal tandis que Ryu est adepte des assassins. L’impact de Pr0lly dans cette réussite est récompensé quand il obtient le titre de meilleur coach. En saison estivale, H2K réitère et obtient à nouveau la 3e place de la saison régulière et des play-offs. Grâce aux points de circuit, l’équipe est qualifiée pour le mondial mais tombe dans un groupe C au niveau très relevé dont elle ne parvient pas à sortir.</p>\n\n<p>Après une année 2015 d’un très bon cru, H2K reconstruit son équipe autour de deux joueurs qui ont beaucoup contribué à la réussite du collectif, Ryu et Odoamne. Le Polonais Marcin « Jankos » Jankowski (qui a déjà évolué chez H2K en 2013) prend le relais au poste de jungler tandis que le Grec Konstantinos « FORG1VENGRE » Tzortziou-Napoleon et le Polonais Oskar « Vander » Bogdan constituent la nouvelle voie du bas. Pour accompagner cette équipe, H2K recrute l’analyste Michael « Veteran » Archer, qui a déjà travaillé avec Origen, ainsi que Oliver « IzpAH » Steer, qui a été manager pour Fnatic pendant plusieurs années. La première apparition de cette nouvelle composition se fait aux Intel Extreme Masters et se solde par une victoire convaincante face à Cloud9 et une défaite contre les Coréens de Ever, des résultats somme toute encourageants étant donné le peu de temps d’entraînement dont disposait l’équipe.</p>\n<p>Coach:  Neil \"Pr0lly\" Hammad</p>\n<p>Responsable d’équipe: Javier \"J.ZAFRA\" Zafra</p>\n","pl_PL":"<p>H2k to jedna z najstarszych organizacji League of Legends w Europie. Powstała jeszcze w styczniu 2011 roku, ale długo nie potrafiła nawiązać walki z czołowymi zespołami z regionu. \nW latach 2011-2013 formacja odnosiła sukcesy głównie na mniejszych turniejach, a przez jej szeregi przewinęło się wielu interesujących zawodników, którzy później stanowili o sile regionu jak choćby Maik „MoMa” Wallus, Erlend „Nukeduck” Holm, Johannes „puszu” Uibos czy skład znany później jako Kiedyś Miałem Team, a następnie – Team ROCCAT. Żaden z wymienionych graczy nie związał się jednak z organizacją na dłużej i prędzej czy później odchodził.</p>\n\n<p>Przełom nastąpił w połowie 2014 roku, kiedy H2k zdecydowało się zatrudnić skład byłej europejskiej dywizji Cloud9. Do Andreia „Odoamne” Pascu, Fabiana „Febivena” Diepstratena, Jonasa „Trashy’ego” Andersena i Pettera \"Hjärnana\" Freyschussa dołączył także nowy wspierający z Rumunii - Baltat „AoD” Alin, którego jednak szybko zastąpił Belg Bram „wewillfailer” de Winter. Zespół doskonale poradził sobie w EU Challenger Series, wygrywając jedną z letnich edycji rozgrywek 2014. Ostatecznie drużynie udało się zwyciężyć także w decydującym turnieju i przystąpić do baraży, ale porażka w starciu z Copenhagen Wolves znów odsunęła plany dołączenia do elitarnych rozgrywek. Nie wszystko było jednakże stracone, bowiem EU LCS rozszerzało ilość uczestników, a dodatkowy turniej miał wyłonić dwa dodatkowe zespoły. </p>\n\n<p>W międzyczasie w zespole szybko doszło do rotacji, w wyniku których z formacją pożegnali się Trashy i wewillfailer, a w ich miejsce przybyli Jean-Victor „loulex” Burgevin oraz Erih „Voidle” Sommermann. H2k było niewątpliwie jednym z murowanych faworytów Expansion Tournamentu i nie zawiodło, całkowicie miażdżąc konkurencję (3:0 z n!faculty i 3:0 z GIANTS) i awansując do EU LCS.</p>\n\n<p>Wtedy pojawiły się kolejne problemy, bo ofertę Fnatic przyjął najważniejszy zawodnik drużyny – midlaner Fabian „Febiven” Diepstraten. Zastąpił go utytułowany Koreańczyk Yoo “Ryu” Sang-ook, który jednak zdawał się mieć swoje najlepsze czasy za sobą… H2k rozpoczęło wiosenny split dość przeciętnie, ale dołączenie do zespołu Raymonda „KaSinga” Tsanga w miejsce Voidle’a zupełnie odmieniło drużynę, która zanotowała fenomenalną passę ośmiu zwycięstw z rzędu. Formacja ostatecznie skończyła zmagania na trzeciej pozycji w sezonie zasadniczym i na tym samym miejscu zameldowała się w play-offach. Świetny dla H2k okres miał swój dalszy ciąg w lecie, kiedy to formacja obroniła trzecią lokatę i dostała się na Mistrzostwa Świata dzięki Championship Points.</p>\n<p>Tam zespół trafił niestety do grupy z dwoma najwyżej notowanymi zespołami z Korei i Chin – SKT T1 oraz Edward Gaming. Pomimo, że europejska drużyna była z miejsca skazywana na porażkę, powalczyła jeszcze z faworyzowanymi rywalami, choć i tak odpadła z turnieju już po fazie grupowej.</p>\n\n<p>Przerwa między sezonem 2015 a 2016 była dla drużyny bardzo burzliwa. Ekipę opuściło aż trzech graczy: KaSing, Hjärnan oraz loulex. H2k całkowicie przebudowało zespół, godnie zastępując swoich byłych już zawodników. W ich miejsce dołączyli bowiem wyróżniający się gracze Teamu ROCCAT: Oskar „Vander” Bogdan, Marcin „Jankos” Jankowski, a także znakomity, grecki strzelec – Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Team Manager: Javier \"J.ZAFRA\" Zafra\n</p>","de_DE":"<p>H2K fuhr als Außenseiter zur Weltmeisterschaft 2016. Und sie kamen als beste westliche Mannschaft wieder zurück. Nach einer durchwachsenen Vorstellung im Sommer-Split der EU LCS 2016 qualifizierte sich H2K über die Meisterschaftspunkte für die Weltmeisterschaft. Unter der Leitung von Jankos ließ H2K alle Kritiker verstummen und traf im Halbfinale der Weltmeisterschaft auf Samsung Galaxy.\n\nGerade als Europa am Boden zu liegen schien, stellte H2K seine Qualitäten auf der internationalen Bühne unter Beweis. Mit einer neuen Aufstellung werden sie 2017 versuchen, sich erneut für die Weltmeisterschaft zu qualifizieren, um dort dem Weltmeistertitel noch näher zu kommen und ihre Region stolz zu machen.</p>\n\n<p>Coach: Neil “Pr0lly” Hammad</p>\n<p>Mannschaftsleiter: Javier \"J.ZAFRA\" Zafra","es_ES":"<p>H2K se ganó un puesto en la LCS gracias al Expansion Tournament europeo en 2014. Su debut en la LCS EU fue todo un éxito, ya que consiguieron un récord de 12 victorias frente a 6 derrotas durante la temporada regular, lo que los posicionó en el tercer puesto. H2K continuó su potente temporada inicial y consiguió otro tercer puesto en la LCS EU 2015.</p>\n\n<p>En el split de primavera de 2016 también hizo una actuación admirable, pero flaquearon en los playoffs, lo que les hizo perder el tercer puesto contra Fnatic. La historia se repetiría en el split de verano, cuando H2K se derrumbó ante Splyce en un enfrentamiento al mejor de cinco en el que se disputaron todas las partidas. Por suerte para H2K, se clasificaron para el Mundial gracias a los puntos de campeonato. Aun habiendo perdido contra Splyce, H2K se mostró seguro con el experto veterano Konstantinos ''FORG1VEN'' Tzortziou-Napoleon, quien propició lo que parecía otro split perdido. El grupo se clasifica para el Mundial como claros perdedores, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a recuperar el trofeo que Europa perdió hace tanto tiempo.</p>\n<p>Entrenador: Neil ''Pr0lly'' Hammad</p>\n<p>Jefe de equipo: Javier \"J.ZAFRA\" Zafra</p>","pt_BR":"<p>A H2K ganhou sua vaga na LCS através do Torneio de Expansão da EU em 2014. Sua estreia na EU LCS foi um sucesso, alcançando um recorde de 12V-6D no percurso da temporada regular e conquistando o 3º lugar. A H2K continuou sua forte estreia na temporada com mais um 3º lugar na EU LCS em 2015.</p>\n\n<p>A equipe mais uma vez teve um desempenho admirável durante a Etapa de Primavera 2016, mas fraquejaram nas Eliminatórias, perdendo o 3º lugar para a Fnatic. Mas a história se repetiu na Etapa de Verão e a H2K foi derrotada mais uma vez pela Splyce em uma melhor de 5. Felizmente para a H2K, eles conseguiram se qualificar para o Mundial através de seus Pontos de Campeonato. Mesmo depois de sua perda para a Splyce, a H2K voltou de cabeça erguida depois do veterano Konstantinos “FORG1VEN” Tzortziou-Napoleon ter arrancado o que parecia ser outra Etapa perdida. A equipe vai para o Mundial claramente como azarões, mas quem sabe... Talvez este ano, a H2K possa ajudar a Europa a finalmente recuperar o seu troféu.</p>","es_AR":"<p>H2K se ganó un lugar en la LCS tras su actuación en el torneo de expansión de EU en el 2014. Su debut en la LCS EU fue todo un éxito, ya que lograron un récord de 12 victorias contra 6 derrotas en el transcurso de la temporada regular, lo que les otorgó el tercer lugar. Luego de su magnífico debut en la temporada, H2K logró otro tercer lugar en la LCS EU del 2015.</p>\n\n<p>El equipo volvió a desempeñarse de forma admirable en el torneo de apertura del 2016 hasta caer en las eliminatorias, donde perdieron el combate por el tercer puesto contra Fnatic. La historia se repetiría en el torneo de clausura, en el que H2K cayó ante Splyce en un set de cinco partidas que duró hasta el final. Afortunadamente para H2K, clasificaron para el Mundial mediante puntos de campeonato. Incluso habiendo perdido contra Splyce, H2K adoptó una postura nueva y confiada después de que el experimentado veterano Konstantinos \"FORG1VEN\" Tzortziou-Napoleon dio vuelta lo que parecía ya un torneo perdido. El equipo se dirige al Mundial como los menos favoritos, pero ¿quién sabe? Quizás este sea el año en que H2K ayude a Europa a recuperar el trofeo perdido hace tanto tiempo.</p>\n\n<p><strong>Entrenador: Neil \"Pr0lly\" Hammad</strong></p>"},"foreignIds":{"drupalId":"1273"},"players":[188,228,229,739,758,1758,1911],"starters":[188,228,229,739,758],"subs":[1758,1911]}],"players":[{"id":94,"slug":"soaz","name":"sOAZ","firstName":"Paul","lastName":"Boyer","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/soaz-a3dmvmfk.png","hometown":"France","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:38.000Z","updatedAt":"2017-06-09T10:03:16.000Z","bios":{"en_US":"<p>Paul \"sOAZ\" Boyer is a true esports veteran, with a career going back to 2010. Before signing with Origen he had been a rock in the top lane for Fnatic for over two years, joining the squad in two World Championship runs. After the 2014 Season concluded, Fnatic entered a rebuilding process which saw nearly the entire roster head their separate ways. Following his departure from Fnatic, Origen founder and mid laner Enrique \"xPeke\" Cedeño Martínez courted sOAZ to be the final addition to his new Challenger Series venture. sOAZ jumped at the chance, where he was instrumental in Origen's runs through the Challenger circuit, multiple EU LCS Splits, and even a World Championship appearance.</p>\n\n<p>sOAZ decided to return to Fnatic in 2017 as their starting top laner, after another frustrating split for Origen led to many players searching for greener pastures. He brings tons of experience (and his trusty baguette) back to Fnatic where he’s aiming to add to his long list of professional accolades. sOAZ would tell you that he’s got plenty left in the tank for another shot at Worlds, but he’ll have to fight his way through the regular season first. You shouldn’t worry though, it seems like this is something he’s done before.</p>","fr_FR":"<p>Paul « SoaZ » Boyer est un véritable vétéran de l'e-sport, avec une carrière remontant à 2010. Avant de rejoindre Origen, il s'est démarqué comme top laner chez Fnatic pendant plus de deux ans, participant ainsi à deux Championnats du monde. Après la fin de la saison 2014, Fnatic est entrée dans un processus de reconstruction et presque toute la formation a été démantelée. Après son départ de chez Fnatic, le fondateur d'Origen et mid laner Enrique « xPeke » Cedeño Martínez a courtisé Soaz pour qu'il rejoigne sa nouvelle équipe dans les Challenger Series. Soaz a sauté sur l'occasion et a ainsi joué un rôle important dans le succès d'Origen sur le circuit Challenger, dans plusieurs segments des LCS EU et même lors d'une apparition dans le Championnat du monde.</p>\n\n<p>Soaz a été le seul point positif d'un segment d'été catastrophique pour Origen en 2016. Il a décroché des victoires pour Origen à lui seul et a maintenu la compétitivité de l'équipe quand tout espoir semblait perdu. Ses excellentes performances (et ses fans dévoués) lui ont valu un ticket pour Barcelone pour participer à l'événement All-Stars 2016. Ses années d'expérience compensent ses compétences mécaniques limitées. Si l'Europe espère éviter une élimination anticipée, elle devra compter sur le vétéran robuste (et sur sa baguette) pour la guider à travers l'une des compétitions les plus difficiles de la Faille.</p>","pl_PL":"<p>Paul „SoaZ” Boyer to prawdziwy weteran e-sportu, którego kariera sięga 2010 roku. Przed przejściem do Origen był nie do ruszenia na górnej alei Fnatic przez ponad dwa lata, dołączając do składu w dwóch podejściach do Mistrzostw Świata. Po zakończeniu sezonu 2014 Fnatic rozpoczęli proces przebudowy, w wyniku którego rozeszli się niemal wszyscy gracze z początkowego składu. Po odejściu z Fnatic założyciel i środkowy Origen, Enrique „xPeke” Cedeño Martínez, zabiegał o to, by Soaz stał się ostatnim uzupełnieniem jego nowej drużyny w Challenger Series. Soaz chętnie skorzystał z tej okazji i odegrał kluczową rolę w drodze po zwyciestwo Origen podczas Challenger Circuit, kilku splitach EU LCS, a nawet występie na Mistrzostwach Świata.</p>\n\nSoaz był zapewne jedynym jasnym punktem letniego splitu 2016, o którym Origen woleliby zapomnieć. Samodzielnie prowadził Origen do zwycięstw i utrzymywał ich w konkurencyjnej formie, nawet gdy wydawało się, że wszystko już stracone. Jego świetne występy (oraz oddani fani) zapewniły mu bilet do Barcelony i udział w wydarzeniu All-Star 2016. Niedoskonałości umiejętności mechanicznych nadrabia latami doświadczeń. Jeśli Europa chce uniknąć kolejnej pożałowania godnej porażki, będzie musiała polegać na tym niezłomnym weteranie (i jego bagietce), który poprowadzi drużynę do boju przeciwko kilku z najtwardszych rywali na Summoner’s Rift.\n","de_DE":"<p>Paul „sOAZ“ Boyer ist ein wahrer E-Sport-Veteran, dessen Karriere 2010 begann. Vor seinem Wechsel zu Origen war er über zwei Jahre Fnatics Fels auf der oberen Lane, mit denen er auch an zwei Weltmeisterschaften teilgenommen hat. Nach dem Ende der Saison 2014 wurde Fnatic umstrukturiert und die ehemaligen Mitglieder gingen getrennte Wege. sOAZ wurde von Mid-Laner Enrique „xPeke“ Cedeño Martínez, der nach seinem Abgang von Fnatic Origen gegründet hatte, als letztes Mitglied für sein Abenteuer in der Challenger Series angeworben. Er ergriff die Gelegenheit und wurde zu einem wichtigen Bestandteil von Origens Durchmarsch in der Challenger Series, mehreren Splits in der EU LCS und sogar einer Teilnahme an der Weltmeisterschaft.</p>\n\n<p>Nachdem ein weiterer frustrierender Split dazu geführt hatte, dass viele Spieler Origen verließen, kehrte sOAZ zu Fnatic zurück, um für sie auf der oberen Lane zu spielen. Er kommt mit einer Menge Erfahrung (und seinem treuen Baguette) zu Fnatic zurück und wird versuchen, seine Liste mit Auszeichnungen zu erweitern. sOAZ würde sicher sagen, er habe noch genug Reserven, um bei einer weiteren Weltmeisterschaft mitzuspielen, aber dazu muss er sich erst einmal durch den Frühjahrs-Split kämpfen. Aber keine Angst, das ist nichts, was er nicht schon einmal getan hätte.</p>","es_ES":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella de la calle superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomase caminos separados. Tras abandonar Fnatic, el fundador y mid de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito aspirante, en numerosos split de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un split de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","pt_BR":"<p>Paul \"sOAZ\" Boyer é um verdadeiro veterano dos eSports, com uma carreira que começou em 2010. Antes de entrar para a Origen, ele foi o jogador de topo da Fnatic por mais de dois anos, entrando no esquadrão com duas participações do Mundial nas costas. Após o fim da Temporada 2014, a Fnatic entrou em um processo de reconstrução onde viu quase todos os membros da equipe seguirem caminhos distintos. Após a saída da Fnatic, o fundador da Origen, o jogador Enrique “xPeke” Cedeño Martínez considerou sOAZ para ser a peça final em sua aventura pela Challenger Series. Ele entrou e foi essencial na campanha da Origen pelo torneio, nas várias Etapas da LCS EU e até mesmo em uma aparição no Mundial.</p>\n\n<p>sOAZ foi a única salvação de do que foi uma Etapa de Verão triste para a Origen em 2016. Ele conseguiu praticamente sozinho algumas vitórias para a Origen e os manteve no competitivo, mesmo quando tudo parecia estar perdido. Seu desempenho incrível (e seus fãs) lhe conquistou uma vaga no Evento All-Star 2016 em Barcelona. Quando ele não tem domínio mecânico, sua experiência ajuda. Se a Europa quiser evitar perder rapidamente como no Mundial, eles precisam confiar no veterano para guiá-los na competição implacável de Summoner’s Rift.</p>","cs_CZ":"<p>Paul „SoaZ“ Boyer je skutečným veteránem esportů, jeho kariéra se totiž datuje od roku 2010. Ještě než nastoupil do Origenu, byl přes dva roky v horní lajně oporou Fnaticu, se kterým se zúčastnil dvou mistrovství světa. Po skončení sezóny 2014 však Fnatic prošel restrukturalizací, při které se cesty téměř všech jeho bývalých hráčů rozdělily. Po odchodu z Fnaticu oslovil SoaZe zakladatel a středový lajnař Origenu Enrique „xPeke“ Cedeño Martínez, který jej chtěl jako svůj poslední trumf do týmu, který měl vzít šturmem Challenger Series. SoaZ po této šanci s chutí sáhl a velkou měrou přispěl k úspěchům Origenu v seriálu Challenger, několika splitech evropského LCS a dokonce i na mistrovství světa.</p>\n\n<p>SoaZ byl nejspíš tím jediným, co drželo Origen nad vodou během jinak úděsného letního splitu 2016. Sám se snažil dotáhnout tým k výhrám a udržoval jej při životě, i když už vše vypadalo naprosto beznadějně. Jeho špičkové výkony (a zástupy milujících fanoušků) mu zajistily lístek do Barcelony, kde se zúčastní turnaje All-Star 2016. To, co mu schází v čisté herní mechanice, dohání roky zkušeností. Pokud chce Evropa tentokrát držet krok s ostatními týmy, bude se muset při bojích s těmi nejdrsnějšími soupeři opřít o tohoto veterána (a jeho bagetu).</p>","el_GR":"<p>Ο Paul \"SoaZ\" Boyer είναι ένας πραγματικός βετεράνος των esports που ξεκίνησε την καριέρα του ήδη από το 2010. Πριν υπογράψει στους Origen ήταν η άγκυρα των Fnatic στην επάνω λωρίδα για πάνω από δύο χρόνια και μάλιστα είχε λάβει μέλος με την ομάδα σε δύο Παγκόσμια Πρωταθλήματα. Μετά τη λήξη της Σεζόν 2014, έγιναν μεγάλες ανακατατάξεις στους Fnatic, καθώς όλοι σχεδόν οι παλιοί παίκτες της ομάδας τράβηξαν το δικό τους δρόμο. Όταν αποχώρησε από τους Fnatic, ο ιδρυτής και παίκτης μεσαίας λωρίδας των Origen Enrique \"xPeke\" Cedeño Martínez προσέγγισε τον Soaz για να συμπληρώσει το ρόστερ της νέας του προσπάθειας στο Challenger Series. Ο Soaz δέχτηκε με μεγάλη προθυμία και η παρουσία του ήταν καταλυτική στην πορεία των Origen στο Challenger Circuit, αλλά και σε πολλά Split του LCS Ευρώπης, ακόμα και σε μια μοναδική εμφάνιση στο Παγκόσμιο Πρωτάθλημα.</p>\n\n<p>Ο Soaz ήταν ίσως η μοναδική θετική νότα στην καταστροφική πορεία των Origen στο Summer Split 2016. Οδήγησε μόνος του στην ομάδα σε μια σειρά από νίκες και τους κράτησε σε υψηλό επίπεδο, όταν όλα έδειχναν ότι είχαν χαθεί. Αυτές οι εμφανίσεις του κόντρα στο ρεύμα (αλλά και οι θαυμαστές του που τον λατρεύουν) σφράγισαν το εισιτήριό του για το Τουρνουά All-Star 2016 στη Βαρκελώνη. Μπορεί να μην είναι ο κορυφαίος παίκτης του κόσμου στον χειρισμό, αλλά αναπληρώνει αυτό το κενό με την πολυετή του πείρα. Αν η Ευρώπη θέλει να αποφύγει άλλη μια αποκαρδιωτική εμφάνιση, θα πρέπει να βασιστεί στην αυτοπεποίθηση (αλλά και στις οργανωτικές ικανότητες) αυτού του αξιόπιστου βετεράνου για να βρει τον τρόπο να επιβληθεί στους ισχυρότερους παίκτες του κόσμου.</p>","hu_HU":"Paul „SoaZ” Boyer valódi esport-veterán, akinek karrierje 2010-ben kezdődött. Mielőtt az Origenhez szerződött, a Fnatic megbízható felső ösvényese volt két évig, és kétszer is velük tartott a világbajnokságra. A 2014-es szezon után a Fnatic elkezdte újjáépíteni magát, és szinte az összes játékos szétszéledt. A Fnatic elhagyása után az Origen alapítója és középső ösvényese, Enrique „xPeke” Cedeño Martínez próbálta meggyőzni Soazt, hogy csatlakozzon ötödikként a Kihívók Sorozatát megcélzó csapatával. Soaz azonnal ugrott a lehetőségre, és fontos szerepe volt abban, hogy az Origen jól teljesített a Kihívók Sorozatában, az EU LCS szakaszaiban, valamint hogy kijussanak a világbajnokságra.</p>\n\nSoaz volt az egyetlen, aki víz fölött tartotta az Origent a nagyon rosszul alakuló 2016-os nyári szakasz alatt. A legreménytelenebb helyzetekben szinte egymaga harcolt ki győzelmeket az Origennek. Ezek a teljesítmények és a rajongók odaadó szeretete váltotta meg neki a jegyet Barcelonába, a 2016-os All-Star gálára. A nyers képességek helyett a hosszú évek tapasztalata teszi igazán erőssé. Ha Európa nem szeretne ismét halványan szerepelni, akkor a megbízható veteránra (és az elmaradhatatlan bagettjére) fog támaszkodni, amikor a Szurdok legkeményebb arcaival kell szembenézni.\n","it_IT":"Paul \"Soaz\" Boyer è un vero veterano degli eSport la cui carriera è iniziata nel lontano 2010. Prima di unirsi agli Origen è stato una presenza fissa in corsia superiore con i Fnatic per oltre due anni, durante i quali ha partecipato anche a due Mondiali. Al termine della stagione 2014, i Fnatic hanno subito un processo di ristrutturazione che ha separato quasi tutti i loro membri. Dopo la sua partenza dai Fnatic, il fondatore e centrale degli Origen, Enrique \"xPeke\" Cedeño Martínez, lo ha invitato nella sua squadra come ultimo elemento per prendere d'assalto le Challenger Series. Soaz colse l'occasione al volo e divenne un elemento insostituibile degli Origen nel circuito Challenger, in vari split e persino in un Mondiale.</p>\n\nNel 2016, Soaz è stato probabilmente l'unica nota positiva degli Origen in un Summer Split da dimenticare. Ha guidato da solo gli Origen in ogni vittoria e li ha tenuti a galla anche quando tutto sembrava perduto. Le sue giocate eccellenti (e i suoi devoti fan) gli hanno fatto guadagnare il biglietto per Barcellona e la partecipazione all'All-Star. Le sue lacune nella meccanica sono più che compensate dalla sua grande esperienza. Se l'Europa vuole evitare un'altra brutta sconfitta, farà meglio ad affidarsi a questo robusto veterano (e alla sua baguette) per uscire vincitrice contro gli avversari più temibili della Landa.\n","ro_RO":"Paul ''SoaZ'' Boyer este un adevărat veteran eSports, a cărui carieră începe în 2010. Înainte să semneze cu Origen, a fost un jucător de neclintit pe culoarul de sus al celor de la Fnatic mai bine de doi ani, susținându-i în două parcursuri la Campionatul Mondial. După încheierea sezonului 2014, Fnatic a intrat într-un proces de reconstrucție, în urma căruia aproape întreaga echipă a luat-o pe drumuri separate. După plecarea sa de la Fnatic, fondatorul și jucătorul de pe culoarul din mijloc al Origen, Enrique ''xPeke'' Cedeño Martínez, l-a invitat pe Soaz să se alăture echipei sale în noua ei aventură din Seria Challenger. Soaz a profitat de ocazie și a fost un jucător-cheie în parcursul celor de la Origen în competiția Challenger, în multiplele etape din LCS și chiar într-o apariție la Campionatul Mondial.</p>\n\nSoaz a fost, probabil, sigura parte bună a etapei de vară din 2016, pe care Origen își dorește s-o uite. Prin forțele proprii, i-a condus pe cei din Origen către victorii și i-a menținut în competiție chiar și atunci când toate speranțele lor păreau să se fi năruit. Reușitele sale (și fanii loiali) i-au adus un bilet către Barcelona pentru a participa la evenimentul All-Star 2016. Lipsurile mecanice îi sunt compensate de ani și ani de experiență. Dacă Europa își dorește să evite o altă eliminare dezamăgitoare, va avea nevoie de îndrumarea acestui veteran puternic (și a baghetei sale) împotriva celei mai dificile concurențe din Rift.\n","es_AR":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>","es_MX":"<p>Paul \"SoaZ\" Boyer es un auténtico veterano de los esports, con una trayectoria que se remonta al año 2010. Antes de entrar a formar parte de Origen, había sido la estrella del carril superior de Fnatic durante más de dos años, durante los que acompañó al equipo a dos Campeonatos Mundiales. Tras el final de la temporada 2014, Fnatic entró en un proceso de reconstrucción que supuso que casi toda la alineación tomara caminos separados. Tras abandonar Fnatic, el fundador y central de Origen, Enrique \"xPeke\" Cedeño Martínez invitó a SoaZ a convertirse en su último fichaje para su periplo en la Challenger Series. SoaZ aceptó y fue clave en los avances de Origen en el circuito retador, en numerosos torneos de la LCS EU e incluso en una aparición en el Campeonato Mundial.</p>\n\n<p>SoaZ fue sin lugar a dudas el único halo de luz en un torneo de verano catastrófico para Origen en 2016. Él solo guio a Origen hacia las victorias y los mantuvo compitiendo incluso cuando todas las esperanzas parecían perdidas. Sus brillantes actuaciones (y los fans que lo adoran) le han asegurado un vuelo a Barcelona para participar en el All-Star Event 2016. Lo que le falta en destrezas mecánicas, lo cubre con sus años de experiencia. Si Europa quiere evitar otro resultado poco alentador, tendrán que confiar en el fuerte veterano (y su baguette) para liderarlos en una de las competiciones más duras de la Grieta.</p>"},"foreignIds":{"drupalId":"76","TRLH3":"200000055","TRLH4":"200000158"},"socialNetworks":{"azubu":"azubu.tv/soaz","facebook":"https://www.facebook.com/fnaticSOAZ?fref=ts","twitter":"https://twitter.com/sOAZIZGOOD"},"champions":[],"liveGameTeam":15},{"id":98,"slug":"rekkles","name":"Rekkles","firstName":"Martin","lastName":"Larsson","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rekkles-gflgilh4.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-07-28T19:09:40.000Z","updatedAt":"2017-06-09T10:10:40.000Z","bios":{"en_US":"<p>Martin “Rekkles” Larsson is one of the most feared AD carries in the world. Rekkles debuted for Fnatic in late 2012 and immediately garnered attention with his performances at several major tournaments. He also played a key role in unlocking the door to the halls of the immortals for Fnatic, ushering in an unprecedented 18W-0L record in the 2015 EU LCS Summer Split. But after key departures following the 2015 World Championship, Rekkles and Fnatic failed to defend their EU LCS crown in the 2016 Spring Split, falling to the eventual champions G2 Esports en route to a 3rd place finish.Even though the reunion of Rekkles and Yellowstar didn’t produce the results that Fnatic hoped for, Rekkles still performed admirably throughout the 2016 EU LCS Summer Split, accounting for more than a third of his team’s overall damage.</p>\n\n<p>After an exodus of players near the end of 2016, Rekkles stayed on board with Fnatic and helped assemble a new roster filled with crafty veterans and an eager rookie. Rekkles admitted to not performing up to his own standards last year, and the 2017 season is the perfect place to reassert himself as a dominant AD Carry. He’s truly at the helm of the new-look Fnatic and will look to not only guide them, but carry them as well.</p>","fr_FR":"<p>Martin « Rekkles » Larsson compte parmi les carrys AD les plus redoutés du monde. Rekkles a commencé sa carrière chez Fnatic fin 2012 et s'est immédiatement fait remarquer avec d'excellentes performances dans plusieurs tournois majeurs. Il a également aidé Fnatic à entrer dans la légende avec un record inédit de 18 victoires contre 0 défaite lors du segment d'été des LCS EU 2015. Mais après des départs de joueurs déterminants suite au Championnat du monde 2015, Rekkles et Fnatic n'ont pas su défendre leur titre des LCS EU lors du segment de printemps 2016, s'inclinant contre les futurs champions de G2 Esports et finissant ainsi en 3e place.</p>\n\n<p>Même si la réunion entre Rekkles et Yellowstar n'a pas eu l'effet escompté par Fnatic, Rekkles a tout de même joué de façon admirable pendant tout le segment d'été des LCS EU 2016, enregistrant plus d'un tiers des dégâts totaux de l'équipe. Ces chiffres impressionnants ont suffi à lui offrir une place à l'événement All-Stars 2016 de Barcelone, où il affrontera d'autres carrys AD légendaires pour tenter d'arracher l'Europe des ténèbres et de la ramener dans la lumière de l'opinion internationale.</p>","pl_PL":"<p>Jeden z najmłodszych i z tego powodu najbardziej oczekiwanych graczy na scenie esportowej League of Legends. Martin Larsson zaczął grać profesjonalnie w maju 2012 roku, lecz już parę miesięcy później dołączył do jednej z najsławniejszych organizacji – Fnatic. Niestety, ze względu na swój wiek, nie mógł wziąć udziału w EU LCS 2013. Do czasu możliwości pełnoprawnego uczestnictwa w tych rozgrywkach \"Rekkles\" realizował się w innych zespołach. 22 listopada 2013 roku oficjalnie powrócił do szeregów Fnatic i przejął swoje stanowisko AD Carry. Już od swoich wczesnych początków był uważany za jednego z najzdolniejszych mechanicznie graczy.</p>\n<p>Wraz z drużyną Fnatic udało mu się zabłysnąć. Pomijając efektowne występy na pomniejszych turniejach jak IEM, All-Stars czy Dreamhack, to jego największym sukcesem był sezon piąty. Bezpośrednio po jego kolejnym powrocie do czarno-żółtych, razem z nimi pobił światowy rekord – nie przegrał ani jednej gry w letnim sezonie EU LCS 2015. Następnie, podczas kwalifikacji do Mistrzostw Świata 2015 \"Rekkles\" zachwycił widzów swoim pentakillem Tristaną. Po części dzięki jego solidnej grze przeciwko Origenowi, Martin wygrał te rozgrywki. Na MŚ 2015 najbardziej rzucało się w oczy to, że był w stanie konkurować z chińskimi i amerykańskimi oponentami. </p>\n<p>Do osobistych osiągnięć Martina przede wszystkim trzeba zaliczyć wejście do Kręgu Pretendenta w trzech różnych regionach: Europie, Ameryce Północnej i Korei. Udało mu się dotrzeć tak wysoko na pozycji AD Carry, dzięki swoim ulubionym postaciom: Lucianowi, Ezrealowi i Vayne. Wiele osób zastanawiało się, jak uzdolniony sportowiec trafił do świata Runeterry. \"Rekkles\" był utalentowanym piłkarzem, lecz doznał kontuzji nogi. Wtedy po raz pierwszy spróbował gry w League of Legends, w której bardzo szybko świetnie się odnalazł. Podczas zmagań na turniejach inspiracją dla niego był jego ulubiony cytat – „Pudłujesz 100% swoich strzałów, których nigdy nie dokonałeś”. W 2015 roku, w społeczeństwie było bardzo głośno o jego przywiązaniu do innego sławnego AD Carry - Hyuk-kyu’a \"Deft\" Kima. Ich unikatowa znajomość to przykład, że rywalizacja nie zawsze przekreśla przyjaźń.</p>\n","de_DE":"<p>Martin „Rekkles“ Larsson ist einer der gefürchtetsten AD-Carrys der Welt. Rekkles gab sein Debüt für Fnatic Ende 2012 und sorgte mit seinen Leistungen bei mehreren großen Turnieren sofort für Aufsehen. Außerdem spielte er bei Fnatics Einzug in die Halle der Unsterblichen eine entscheidende Rolle, als die Mannschaft den Sommer-Split der EU LCS 2015 mit 18 Siegen ungeschlagen beendete. Als jedoch einige Schlüsselspieler nach der Weltmeisterschaft 2015 die Mannschaft verließen, scheiterten Rekkles und Fnatic im Frühjahrs-Split 2016 am zukünftigen Champion G2 Esports und schafften es nicht, ihre Krone zu verteidigen. Obwohl die Wiedervereinigung von Rekkles und Yellowstar nicht so verlief, wie Fnatic gehofft hatte, lieferte Rekkles im Sommer-Split der EU LCS 2016 eine ansprechende Leistung ab und war für mehr als ein Drittel des gesamten Schadens seiner Mannschaft verantwortlich.</p>\n\n<p>Trotz der Abgänge einiger Spieler Ende 2016 blieb Rekkles Fnatic treu und half mit, aus gewitzten Veteranen und einem eifrigen Nachwuchsspieler eine neue Mannschaft zu formen. Rekkles hat zugegeben, letztes Jahr nicht zu seiner Form gefunden zu haben. Der Frühjahrs-Split der EU LCS 2017 ist für ihn die perfekte Gelegenheit, sich wieder als dominanter AD-Carry zu etablieren. Er ist die Speerspitze des neuen Fnatics und wird nicht nur versuchen, seine Mannschaft zu leiten, sondern auch, sie von einem Sieg zum nächsten zu führen.</p>","es_ES":"<p>Martin \"Rekkles\" Larsson es uno de los AD carry más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el split de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el split de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del split de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros AD carry legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","pt_BR":"<p>Martin “Rekkles” Larsson é um dos atiradores mais temidos do mundo. Rekkles estreou na Fnatic no fim de 2012 e logo ganhou atenção com seu desempenho em vários grandes torneios. Ele também teve um papel fundamental para imortalizar a Fnatic, ajudando no recorde de 18 vitórias e nenhuma derrota na Etapa de Verão 2015 da LCS EU. Porém, após alguns desfalques depois do Campeonato Mundial 2015, Rekkles e a Fnatic falharam em defender a coroa da LCS EU na Etapa de Primavera 2016, perdendo para a campeã G2 Esports e terminando em terceiro lugar.</p>\n\n<p>Apesar da reunião de Rekkles e YellOwStaR não produzir os resultados que a Fnatic esperava, Rekkles ainda teve um desempenho admirável durante toda a Etapa de Verão 2016 da LCS EU, sendo o responsável por mais de um terço do dano de sua equipe. Os números impressionantes foram suficientes para levá-lo a ser o Atirador mais votado da Europa no Evento All-Star 2016, onde ele batalhará contra outros atiradores lendários e vai tentar tirar a Europa do escuro para colocá-la de volta no cenário internacional.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Martin “Rekkles” Larsson는 세계에서 가장 두려운 원거리 딜러 중 하나입니다. Fnatic 소속으로 2012년 후반에 데뷔하자마자 IPL5에서 준우승하는 등 여러 주요 대회에서 엄청난 활약을 하며 주목을 받았습니다. 하지만 e스포츠에서 성공하려면 단순한 개인 기량뿐 아니라 인간 관계가 중요하다는 것 또한 잘 알고 있는 것이 Rekkles 선수입니다. 모델처럼 매력적인 외모와 무서운 파밍 능력을 함께 갖춘 Rekkles는 그런 면에서 완벽한 선수라고 할 수 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">Fnatic이 유례없는 18승 무패로 2015 유럽 LCS 서머 스플릿을 마치는 대기록을 세우는 데에도 Rekkles의 역할이 핵심적이었습니다. 어떻게 그게 가능했을까요? 항상 노력하는 Rekkles 선수와, YellOwStaR 선수의 적절한 서포팅, 어느 한쪽으로 치우치지 않는 킬과 어시스트, 그리고 나서 엄청난 CS 수급력이 합쳐졌기 때문이죠. 실제로 2015 유럽 LCS 서머 스플릿에서 KDA 순위 1, 2위를 Fnatic의 봇 라인 선수 두 명이 합계 27을 기록하며 독점해 버렸습니다. </p>\n<p style=”font-family:”나눔고딕”;\">물론 그렇게 킬을 올렸어도 Isaac \"PePiiNeRo\" Flores 선수의 분노를 피해갈 순 없었죠. 유감입니다. </p>\n","cs_CZ":"<p>Martin „Rekkles“ Larsson je jedním z nejobávanějších ADC na světě. Debutoval koncem roku 2012 v řadách Fnaticu a okamžitě vzbudil pozornost svými výkony na několika významných turnajích. Sehrál také klíčovou roli při uvedení Fnaticu do historie, když jeho tým během letního splitu evropského LCS 2015 dosáhl do té doby nevídané bilance výher 18:0. Ovšem poté, co po mistrovství světa 2015 z celku odešlo několik důležitých členů, Rekkles a Fnatic v jarním splitu EU LCS 2016 už titul neobhájili, podlehli budoucím šampionům z G2 Esports a skončili na 3. místě.</p>\n\n<p>Ačkoliv opětovné shledání Rekklese a Yellowstara nemělo takové výsledky, v jaké Fnatic doufali, podával Rekkles po celou dobu letního splitu EU LCS 2016 působivé výkony a připsal si na konto více než třetinu celkového poškození, jež jeho tým uštědřil. Tato ohromující čísla stačila, aby vyhrál hlasování k turnaji All-Star 2016 v Barceloně, kde se střetne s ostatními legendárními ADC a pokusí se vyvést Evropu z temnoty zpět na světlo mezinárodní slávy.</p>","el_GR":"<p>Ο Martin “Rekkles” Larsson είναι ένας από τους πιο επικίνδυνους AD Carry στον κόσμο. Ο Rekkles έκανε την πρώτη του εμφάνιση με τους Fnatic στα τέλη του 2012 και έστρεψε αμέσως επάνω του τα φώτα της δημοσιότητας με τις εκπληκτικές του εμφανίσεις σε πολλά σημαντικά τουρνουά. Επίσης, έπαιξε σημαντικό ρόλο σε ορισμένα από τα μεγαλύτερα ρεκόρ που έχουν πετύχει οι Fnatic, όπως το ανεπανάληπτο σερί 18 νικών και 0 ηττών Summer Split 2015 του LCS Ευρώπης. Όμως, μετά το Παγκόσμιο Πρωτάθλημα 2015 υπήρξαν ορισμένες πολύ σημαντικές αποχωρήσεις από την ομάδα, με αποτέλεσμα ο Rekkles και οι Fnatic να μην μπορέσουν να υπερασπιστούν τον τίτλο τους στο Spring Split 2016 του LCS Ευρώπης. Γνώρισαν την ήττα από τους G2 Esports, οι οποίοι θα έπαιρναν στη συνέχεια τον τίτλο, και περιορίστηκαν στην 3η θέση.</p>\n\n<p>Παρόλο που η επανένωση του Rekkles και του Yellowstar δεν είχε τα αποτελέσματα που έλπιζαν οι Fnatic, ο Rekkles είχε μια πολύ καλή παρουσία στο Summer Split 2016 του LCS Ευρώπης, καθώς έκανε μόνος του τουλάχιστον το ένα τρίτο της συνολικής ζημιάς της ομάδας. Χάρη στα εντυπωσιακά του στατιστικά, συγκέντρωσε αρκετές ψήφους για να βρεθεί κι αυτός στο Τουρνουά All-Star 2016 στη Βαρκελώνη, όπου θα αναμετρηθεί με άλλους θρυλικούς AD Carry στην προσπάθειά του να φέρει και πάλι την Ευρώπη στο διεθνές προσκήνιο.</p>","hu_HU":"<p>Martin „Rekkles” Larsson a világ egyik legrettegettebb lövésze. Rekkles a Fnaticben kezdte a karrierjét 2012 végén, és hamar felhívta magára a figyelmet a nagy versenyeken nyújtott teljesítményével. Fontos szerepe volt abban is, hogy a Fnatic bekerüljön a halhatatlanok csarnokába, akikkel addig példátlan 18 meccses, veretlen győzelmi sorozatot értek el az EU LCS 2015-ös nyári szakaszában. A csapat fontos embereket veszített el a 2015-ös világbajnokság után, ezért Rekkles és a Fnatic nem tudta megvédeni címét az EU LCS 2016-os tavaszi szakaszában, és végül 3. helyen végzett, valamint kikapott a szakaszt megnyerő G2 Esportstól.</p>\n\nRekkles és Yellowstar jelenléte nem hozta az eredményeket, amelyeket a Fnatic várt, de Rekkles remekül játszott az EU LCS 2016-os nyári szakasza során, a csapat összesített sebzésének több mint harmadát ő okozta. Már csak emiatt is ott a helye a 2016-os All-Star gálán Barcelonában, ahol legendás lövészekkel kell megküzdenie, hogy kiássa Európát a gödörből.\n","it_IT":"<p>Martin \"Rekkles\" Larsson è uno degli ADC più temuti al mondo. Ha debuttato nel tardo 2012 con i Fnatic e ha subito attirato l'attenzione con le sue eccellenti giocate in molti tornei internazionali. È stato anche fondamentale per far entrare i Fnatic nell'olimpo degli immortali con un record mai visto di 18 vittorie e nessuna sconfitta nel Summer Split 2015 della LCS EU. Tuttavia, dopo i grandi abbandoni a seguito dei Mondiali 2015, Rekkles e i Fnatic non sono riusciti a difendere la corona nello Spring Split 2016, inchinandosi davanti ai nuovi campioni, i G2 Esports, e concludendo la stagione al terzo posto.</p>\n\nNonostante la reunion di Rekkles e Yellowstar non abbia prodotto i risultati che i Fnatic speravano, Rekkles si è comunque comportato egregiamente durante il Summer Split 2016 della LCS EU, infliggendo più di un terzo dei danni totali della sua squadra. Queste cifre impressionanti sono state sufficienti a fargli guadagnare i voti necessari a partecipare all'All-Star 2016 di Barcellona, dove si scontrerà con altri ADC leggendari cercando di traghettare l'Europa fuori dalla sua striscia negativa e donarle un nuovo successo internazionale.\n","ro_RO":"<p>Martin ''Rekkles'' Larsson este unul dintre cei mai de temut AD carry din lume. Rekkles a debutat alături de Fnatic la finalul anului 2012 și a atras imediat atenția publicului cu reușitele sale în cadrul câtorva turnee importante. În plus, a jucat un rol important în echipă, ajutându-i pe cei de la Fnatic să intre în istoria LoL și obținând un record fără precedent de 18 victorii și 0 înfrângeri în etapa de vară a LCS EU 2015. Dar în urma plecării unor jucători cheie imediat după Campionatul Mondial 2015, Rekkles și Fnatic nu au reușit să-și apere titlul din LCS EU în etapa de primăvară din 2016, terminând pe locul al treilea ca urmare a unei înfrângeri în fața viitorilor campioni, G2 Esports.</p>\n\nChiar dacă reuniunea lui Rekkles cu Yellowstar nu a adus rezultatele pe care și le-au dorit cei de la Fnatic, Rekkles s-a descurcat admirabil pe parcursul etapei de vară a LCS EU 2016, însumând mai bine de o treime din daunele totale ale echipei sale. Statisticile impresionante i-au adus voturile fanilor și calificarea la evenimentul All-Star 2016 din Barcelona, unde se va înfrunta cu alți AD Carry legendari. Acolo va lupta pentru a pune capăt seriei de nereușite ale Europei la turneele internaționale.\n","en_PL":"<p>Martin „Rekkles” Larsson jest jednym z budzących największy lęk prowadzących na świecie. Rekkles zadebiutował we Fnatic pod koniec 2012 roku i natychmiast zwrócił na siebie uwagę występami na kilku większych turniejach. Odegrał także kluczową rolę w zdobyciu miejsca pośród nieśmiertelnych sław dla Fnatic, osiągając bezprecedensowy wynik 18 zwycięstw przy 0 przegranych podczas letniego splitu EU LCS 2015. Ale gdy po Mistrzostwach Świata 2015 odeszło kilku ważnych zawodników, Rekkles i Fnatic nie zdołali obronić tytułu EU LCS podczas wiosennego splitu 2016, ulegając późniejszym mistrzom, G2 Esports i kończąc na trzecim miejscu.</p>\n\nChociaż ponowne zejście się Rekklesa i Yellowstara nie zapewniło rezultatów, których oczekiwali Fnatic, Rekkles wciąż znakomicie prezentował się w toku letniego splitu EU LCS 2016, zaliczając na swoje konto ponad jedną trzecią ogółu obrażeń zadanych przez drużynę. Te imponujące statystyki wystarczyły, by został wybrany w głosowaniu do uczestnictwa w wydarzeniu All-Star 2016 w Barcelonie, dokąd pojedzie zmierzyć się z innymi legendarnymi prowadzącymi i będzie toczył pojedynki, których stawką jest wyciągnięcie Europy z mroku zapomnienia w światło międzynarodowego uznania.\n","es_AR":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>","es_MX":"<p>Martin \"Rekkles\" Larsson es uno de los tiradores acarreadores más temidos del mundo. Rekkles debutó con Fnatic al final de 2012 e inmediatamente llamó la atención con sus actuaciones en grandes torneos. También cumplió un papel clave para llevar a Fnatic al salón de los inmortales cuando ayudó a conseguir un récord sin precedentes de 18 victorias y 0 derrotas en el torneo de verano de la LCS EU 2015. Pero tras el abandono de algunos jugadores claves tras el Campeonato Mundial 2015, Rekkles y Fnatic no consiguieron defender su corona de la LCS EU en el torneo de primavera de 2016, lo que les costó una derrota contra los campeones de G2 Esports y los colocó finalmente en tercera posición.</p>\n\n<p>Aunque el reencuentro de Rekkles y Yellowstar no produjo los resultados que Fnatic hubiera deseado, Rekkles ofreció igualmente una actuación admirable a lo largo del torneo de verano de la LCS EU 2016 y consiguió más de un tercio del daño infligido por su equipo. Sus increíbles estadísticas han sido más que suficientes para que lo hayan votado para asistir al All-Star Event 2016 en Barcelona, donde se enfrentará contra otros tiradores legendarios para conseguir sacar a Europa de la oscuridad y traerla de vuelta a la luz de la escena internacional.</p>"},"foreignIds":{"drupalId":"1140","TRLH3":"200000058","TRLH4":"200000161"},"socialNetworks":{"twitch":"www.twitch.tv/Rekkles","facebook":"www.facebook.com/Rekkles1?fref=ts","twitter":"https://twitter.com/RekklesLoL"},"champions":[],"liveGameTeam":15},{"id":172,"slug":"jesiz","name":"Jesiz","firstName":"Jesse","lastName":"Le","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jesiz-dsbaxff3.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-06-09T10:12:41.000Z","bios":{"en_US":"<p>Jessie “Jesiz” Le has been on the professional scene since 2013, playing for teams like Coast, Gamers2, and Dignitas. He took a break from professional play in order to become the assistant coach for Immortals in 2016. He ended up trying out for Fnatic at the end of the year and they invited him to become their starting support.</p>\n\n<p>Jesiz is a flexible player that is now playing the third different role of his professional career. After playing as both a mid laner and AD Carry, he made yet another role swap in order to fill Fnatic’s support vacancy. More than anything Fnatic is searching for some continuity at the support position after recent times have been filled with ups and downs. Jesiz certainly brings a wealth of experience with him, but will it turn into wins? Only time will tell.</p>","de_DE":"<p>Jessie „Jesiz“ Le ist bereits seit 2013 fixer Bestandteil der professionellen E-Sport-Szene und hat schon für Mannschaften wie Coast, Gamers2 oder Dignitas gespielt. 2016 nahm er sich jedoch eine Auszeit, um der Co-Trainer der Immortals zu werden. Am Ende des Jahres bewarb er sich dann bei Fnatic und wurde zum Supporter der Mannschaft.\n\nJesiz ist ein flexibler Spieler, der im Verlauf seiner Karriere bereits auf zwei anderen Positionen gespielt hat. Nachdem er bereits als Mid-Laner und AD-Carry gespielt hatte, wechselte er erneut die Rolle, um Fnatics Suche nach einem Supporter zu beenden. Nach den Höhen und Tiefen der letzten beiden Splits braucht Fnatic nichts dringender, als eine gewisse Kontinuität auf der Supporter-Position. Jesiz kann auf einiges an Erfahrung zurückgreifen, aber wird sich das auch in Siegen widerspiegeln? Wir werden es sehen …</p>"},"foreignIds":{"drupalId":"1126","TRLH3":"200000059","TRLH4":"200000162"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":188,"slug":"jankos","name":"Jankos","firstName":"Marcin","lastName":"Jankowski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jankos-inx85lk5.png","hometown":"Poland","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-09T09:46:58.000Z","bios":{"en_US":"<p>There’s a reason Marcin “Jankos” Jankowski earned the nickname of “First Blood King.” Earlier in his career, his aggressive nature meant he was just as likely to surrender first blood as he was to earn it. But he tipped the scales in his favor in the 2016 EU LCS Summer Split, earning H2K a spot at the 2016 World Championship.</p>\n\n<p>Jankos’ high-octane play on Lee Sin and Olaf carried H2K all the way to the Semifinals at Worlds. He brings his explosive nature back to Europe in 2017 looking to set a new record for kills by a jungler. Jankos is the First Blood King, and he reigns supreme in the EU LCS.</p>","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","pl_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","fr_FR":"<p>Marcin « Jankos » Jankowski est l'un des junglers européens les plus agressifs. Il passe autant de temps à combattre les champions dans les voies solo qu'à farmer les monstres neutres dans la jungle. Son style de jeu agressif correspond parfaitement à des champions comme Lee Sin et Elise, capables de mettre la pression sur la carte dès le début des matchs et de déjouer les plans ennemis. Jankos a rejoint ROCCAT en 2014 et a joué un rôle important dans leur survie au sein des LCS EU. Malgré une performance décevante au cours du segment de printemps des LCS EU 2015, Jankos a su garder confiance en lui et a rejoint H2K fin 2015.</p>\n\n<p>H2K s'est révélée être l'équipe parfaite pour le style de jungler explosif de Jankos et celui-ci s'est immédiatement entendu avec les super stars de la formation. Il s'est fait remarqué pendant le Championnat du monde 2016, où il a prouvé son génie mécanique tout en menant H2K jusqu'aux demi-finales avant de s'incliner face à Samsung Galaxy. Ses performances impressionnantes ont conquis le cœur des fans qui l'ont choisi comme jungler principal de l'Europe pour l'événement All-Stars 2016. Jankos arrive à Barcelone avec un énorme potentiel de jeu et nous promet des joutes verbales enflammées (et un jeu original) alors qu'il s'apprête à affronter l'élite du sport sur la Faille.</p>","es_ES":"<p>Marcin ''Jankos'' Jankowski es uno de los junglas más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en las calles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el split de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor jungla de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","es_AR":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>","pt_BR":"<p>Jankos: Marcin “Jankos” Jankowski é um dos caçadores mais agressivos da Europa. Ele gasta tanto tempo lutando campeões nas rotas quanto gasta matando monstros neutros na selva. Seu estilo de jogo agressivo se mescla naturalmente com campeões como Lee Sin e Elise, que conseguem pressionar o mapa logo no início do jogo e fazer contra-jogadas contra seus oponentes. Jankos se juntou à ROCCAT em 2015 e foi essencial para manter a equipe viva na EU LCS. Apesar de seu desempenho decepcionante na Etapa de Primavera da EU LCS 2015, Jankos manteve sua confiança e entrou para a H2K no finalzinho de 2015.</p>\n\n<p>A H2K acabou sendo o lugar perfeito para o estilo elétrico de Janko na selva, e ele imediatamente se sintonizou com as superestrelas já existentes na equipe. Ele deixou sua marca no Campeonato Mundial 2016, onde mostrou seu domínio de mecânica e levou a H2K para as Semifinais, perdendo então contra a Samsung Galaxy. Seu desempenho incrível deixou uma boa impressão nos fãs, que votaram nele como o caçador europeu no Evento All-Star 2016. Jankos traz consigo o potencial de jogadas explosivas para o evento em Barcelona, onde ele vai apimentar a competição.</p>","cs_CZ":"<p>Marcin „Jankos“ Jankowski platí v Evropě za jednoho z nejagresivnějších džunglerů. Bojem se šampiony v sólových lajnách stráví skoro stejné množství času jako farmením příšer v džungli. Jeho agresivní styl hry samozřejmě volá po šampionech jako Lee Sin nebo Elise, kteří dokážou vyvíjet tlak hned z kraje zápasu a dostat se soupeři do zad. Jankos nastoupil do týmu ROCCAT roku 2014 a výrazně se přičinil o jeho udržení v evropském LCS. Navzdory slabému výkonu z jarního splitu evropského LCS 2015 neztratil Jankos nic ze svého sebevědomí a koncem roku 2015 přešel do H2K.</p>\n\n<p>H2K se ukázal být tím pravým místem pro Jankosův vysokooktanový džunglerský styl a okamžitě skvěle zapadl mezi stávající superstars tohoto týmu. Citelně zasáhl i do bojů na mistrovství světa 2016, kde vystavil na odiv svou skvělou herní mechaniku a pomohl H2K na cestě do semifinále, kde ovšem jeho tým podlehl Samsung Galaxy. Fanoušci jeho kvality náležitě ocenili a v hlasování k turnaji All-Star 2016 získal největší podporu ze všech evropských džunglerů. Jankos se v Barceloně jistě postará o množství působivých akcí a všichni se již těší, až se do světové špičky pustí svými herními dovednostmi i drsnými slovy.</p>","el_GR":"<p>Ο Marcin “Jankos” Jankowski είναι ένας από τους πιο επιθετικούς παίκτες ζούγκλας στην Ευρώπη. Δεν διστάζει να διακόψει το φαρμάρισμα ουδέτερων τεράτων στη ζούγκλα για να μονομαχήσει με ήρωες στις σόλο λωρίδες. Το επιθετικό στυλ παιχνιδιού του είναι ιδανικό για ήρωες όπως ο Λι Σιν και η Ελίζ που μπορούν να ασκήσουν από νωρίς πίεση στον χάρτη και να κινούνται πιο γρήγορα από τους αντιπάλους του. Ο Jankos έγινε μέλος των ROCCAT το 2014 και η παρουσία του ήταν καταλυτική στην παραμονή τους στο LCS Ευρώπης. Παρά την απογοητευτική του απόδοση στο Spring Split 2015 του LCS Ευρώπης, ο Jankos δεν έχασε την αυτοπεποίθησή του και πήρε μεταγραφή στους H2K στα τέλη του 2015.</p>\n\n<p>Όπως αποδείχτηκε, οι H2K ήταν η ιδανική επιλογή για το δυναμικό στυλ του Jankos στη ζούγκλα και έδεσε πολύ γρήγορα με τους αστέρες που έπαιζαν ήδη στην ομάδα. Έκανε αισθητή την παρουσία του στο Παγκόσμιο Πρωτάθλημα 2016, όπου έδειξε σε όλους την άριστη γνώση των μηχανισμών που τον χαρακτηρίζει και οδήγησε με την αποφασιστικότητά του τους H2K στους Ημιτελικούς, όπου αποκλείστηκαν από τους Samsung Galaxy. Οι εντυπωσιακές του εμφανίσεις γοήτευσε το κοινό που τον ψήφισε ως τον καλύτερο ευρωπαίο παίκτη ζούγκλας και τον έστειλε στο Τουρνουά All-Star 2016. Στη Βαρκελώνη, ο Jankos θα προσφέρει στην ομάδα του το ταλέντο του στο θεαματικό παιχνίδι, ακόμα και ενάντια στον πανίσχυρο ανταγωνισμό που θα κληθεί να αντιμετωπίσει, αλλά και το θράσος και την επιθετική συμπεριφορά που τον διακρίνουν.</p>","hu_HU":"Marcin „Jankos” Jankowski Európa egyik legagresszívabb dzsungelharcosa. Majdnem annyi időt tölt az ellenséges hősökkel vívott harccal, mint a semleges szörnyek farmolásával a dzsungelben. Az agresszív stílusa remekül összepasszol olyan hősökkel, mint Lee Sin és Elise, akik hamar nyomás alá tudják helyezni a térképet, és ki tudják játszani az ellenfeleket. Jankos 2014-ben csatlakozott a ROCCAT-hez, és részben neki köszönhetik, hogy bent maradtak az EU LCS-ben. Az EU LCS 2015-ös tavaszi szakaszában mutatott, csalódást keltő szereplésük ellenére Jankos nem veszített magabiztosságából, és 2015 végén a H2K-hez igazolt.</p>\n\nA H2K megfelelő helynek bizonyult Jankos pörgős dzsungeltaktikája számára, és azonnal megtalálta a közös hangot a csapat többi szupersztárjával. A 2016-os világbajnokságon is megmutatta játékbeli képességeit, és egészen az elődöntőig segítette a H2K-t, ahol a Samsung Galaxy búcsúztatta őket. Nem felejtették el a lenyűgöző játékát a rajongók, akik a 2016-os All-Star gálára őt küldték Európa legjobb dzsungelharcosaként. Jankos robbanékony, látványos stílust visz Barcelonába, ahol az ellenfél heccelése mellett néhány szép akciót is láthatunk majd tőle.\n","it_IT":"<p>Marcin \"Jankos\" Jankowski è uno dei giocatori di giungla più aggressivi di tutta Europa. Passa il suo tempo farmando i mostri neutrali in giungla e affrontando campioni nelle corsie singole. Il suo stile aggressivo si sposa soprattutto con campioni come Lee Sin o Elise, con i quali riesce a creare pressione sin dalle prime fasi di gioco e superare in astuzia i suoi avversari. Jankos si è unito ai ROCCAT nel 2014 e ha giocato un ruolo fondamentale nel mantenerli a galla nella LCS EU. Nonostante la performance deludente allo Spring Split della LCS EU nel 2015, Jankos non si è perso d'animo e si è trasferito fra gli H2K verso la fine del 2015.</p>\n\nH2K si è dimostrata la squadra perfetta per il fulmineo stile in giungla di Jankos, che si è subito unito perfettamente con le altre superstar del team. Ha fatto sentire la sua presenza ai Mondiali 2016, dove ha mostrato la sua abilità meccanica e ha catapultato gli H2K in semifinale, prima di arrendersi davanti ai Samsung Galaxy. Le sue giocate impressionanti hanno fatto impazzire i suoi fan che lo hanno votato come miglior giocatore della giungla per la partecipazione all'All-Star 2016. Jankos porta con sé a Barcellona un potenziale davvero esplosivo, tante parolacce e qualche giocata incredibile mentre vaga per la Landa affrontando avversari di altissimo livello.\n","en_PL":"Marcin „Jankos” Jankowski jest jednym z najagresywniejszych dżunglerów w Europie. Spędza tyle samo czasu na samotnej walce z bohaterami w alejach, co na farmieniu neutralnych potworów w dżungli. Jego agresywny styl gry w naturalny sposób decyduje o wyborze bohaterów takich jak Lee Sin i Elise, którzy umożliwiają wywieranie presji na mapie we wczesnej fazie gry oraz wymanewrowywanie przeciwników. Jankos dołączył do ROCCAT w 2014 roku i odegrał wielką rolę w utrzymaniu ich w EU LCS. Pomimo rozczarowującego występu w wiosennym splicie EU LCS 2015, Jankos zachował pewność siebie, a pod sam koniec 2015 roku przeniósł się do H2K.</p>\n\nH2K okazali się świetnym usupełnieniem dla energicznego stylu dżunglowania Jankosa, który natychmiast zgrał się z dotychczasowymi supergwiazdami drużyny. Jego obecność była nie do pominięcia podczas Mistrzostw Świata 2016, na których popisywał się swoimi umiejętnościami mechanicznymi i doprowadził H2K do półfinałów, w których ulegli Samsung Galaxy. Imponujące występy Jankosa ucieszyły fanów, którzy zdecydowali swoimi głosami, że na wydarzeniu All-Star 2016 występuje jako najlepszy dżungler Europy. Jankos zabierze do Barcelony z cały swój wybuchowy potencjał i zapewne rozdrażni najwyższej klasy przeciwników na Summoner’s Rift swoimi ciętymi uwagami (i niebywałymi zagrywkami).\n","ro_RO":"Marcin ''Jankos'' Jankowski este unul dintre cei mai agresivi jungleri din Europa. Petrece la fel de mult timp luptându-se cu campioni pe culoare solo cât petrece farmând monștri neutri în junglă. Stilul său de joc agresiv îl îndreaptă spre campioni precum Lee Sin sau Elise, care pot exercita presiune pe hartă încă din faza de început și își pot surprinde adversarii. Jankos s-a alăturat echipei ROCCAT în 2014 și a avut un rol esențial la menținerea lor în LCS EU. În ciuda unui sezon dezamăgitor în etapa de primăvară a LCS EU 2015, Jankos și-a păstrat încrederea și s-a alăturat echipei H2K la sfârșitul anului 2015.</p>\n\nH2K s-a dovedit a fi locul perfect pentru stilul de joc agresiv în junglă al lui Jankos, care s-a adaptat rapid la noii colegi din echipă. Și-a făcut simțită prezenta la Campionatul Mondial 2016, demonstrându-și abilitățile mecanice și conducându-i pe cei din H2K până în semifinală, unde au fost învinși de cei din Samsung Galaxy. Reușitele sale impresionante i-au adus voturile fanilor, care l-au ales să reprezinte Europa în junglă la All-Star Event 2016. Jankos aduce cu el un potențial mare de inițiere la Barcelona, unde-și va provoca verbal adversarii (și va crea faze spectaculoase) în Rift împotriva unor competitori redutabili.\n","es_MX":"<p>Marcin ''Jankos'' Jankowski es uno de los jungleros más agresivos de Europa. Pasa casi tanto tiempo luchando contra campeones en solitario en los carriles como asesinando monstruos neutrales en la jungla. Su estilo de juego agresivo le lleva a elegir campeones como Lee Sin o Elise, que pueden ejercer presión en el mapa desde el principio de la partida y superar a sus oponentes. Jankos se unió a ROCCAT en 2014 y cumplió un papel fundamental para mantenerlos vivos durante la LCS EU. A pesar de su decepcionante actuación en el torneo de primavera de la LCS EU 2015, Jankos no perdió seguridad en sí mismo y se trasladó a H2K a finales de 2015.</p>\n\n<p>H2K resultó ser el lugar perfecto para el potente estilo en la jungla de Jankos e inmediatamente encajó con las superestrellas del equipo. Se hizo notar en el Campeonato Mundial 2016, en el que puso de manifiesto su destreza mecánica y ayudó a que H2K llegase a las semifinales, donde fueron derrotados por Samsung Galaxy. Sus increíbles actuaciones han llamado la atención de los fans que lo han votado para el All-Star Event 2016 como el mejor junglero de Europa. Jankos trae consigo el potencial de grandes jugadas explosivas a Barcelona, donde avasallará y hará gala de sus increíbles estrategias en la Grieta contra los mejores oponentes.</p>"},"foreignIds":{"drupalId":"1114","TRLH3":"200000072","TRLH4":"200000175"},"socialNetworks":{"twitch":"http://www.twitch.tv/jankos","facebook":"https://www.facebook.com/Jankos.lol","twitter":"https://twitter.com/Jankoslol"},"champions":[],"liveGameTeam":33},{"id":228,"slug":"odoamne","name":"Odoamne","firstName":"Andrei","lastName":"Pascu","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/odoamne-fae8wka2.png","hometown":"Romania","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:04.000Z","updatedAt":"2017-06-09T09:59:10.000Z","bios":{"en_US":"<p>Andrei “Odoamne” Pascu quietly made his case for being Europe’s best top laner in 2016. He became the only Romanian player in the EU LCS after H2K picked up the roster of the Cloud9 Eclipse squad back in 2014. With a deep champion pool and ability to escape even the deadliest ganks, Odoamne had a breakout year in 2016.</p>\n\n<p>At the 2016 World Championship, he bested some of the world’s most talented top laners before finally meeting his match against Samsung Galaxy’s CuVee. Odoamne returns to a revamped H2K roster in 2017 looking to defend his title as the cream of the crop of Europe’s top laners.</p>","fr_FR":"<p>Andrei « Odoamne » Pascu s’est fait connaître en Challenger series chez Cloud9 Eclipse. Après avoir échoué à se qualifier aux League of Legends Championship Series, lui et trois de ses coéquipiers rejoignent H2K. Suite à un nouvel échec au tournoi de promotion, il envoie Giants au tapis lors du tournoi d’expansion et qualifie enfin son équipe aux LCS.</p>\n\n<p>Le toplaner se montre particulièrement robuste avec Gnar et Maokai lors de la saison printanière, au point d’obtenir le titre de meilleur joueur de la semaine 7. Grand amateur de champions résistants, le Roumain n’est pas connu pour ses actions étincelantes mais pour sa régularité exceptionnelle. En quasi totale autonomie sur sa voie du haut, Odoamne réussit toujours à tirer son épingle du jeu malgré le peu de ressources qui lui sont allouées. Ses coéquipiers peuvent compter sur un Odoamne qui ne perd jamais car, toujours prudent, il sent venir et prévoit les arrivées du jungler adverse et ne se laisse que très peu avoir. Son utilisation du sort d’invocateur Téléportation est exemplaire : bien souvent utilisé au bon endroit et au bon moment, il permet à son équipe de prendre l’avantage à de nombreuses reprises via les nombreux contrôles de foules dont disposent ses champions, ce qui contribue fortement aux résultats de son équipe qui termine les play-offs à la 3e place.</p>\n\n<p>Odoamne revient en saison estivale en montrant qu’il n’est pas un joueur limité à être de la chair à canon ou un bot à étourdissements. Il expose un Rumble qui devient son champion le plus joué de la saison régulière et avec lequel il excelle tout autant, convertissant le peu de pièces d’or dont il dispose en dégâts gargantuesques. Son équipe atteint à nouveau la 3e place des play-offs, ce qui lui permet d’être qualifié pour le mondial 2015.</p>\n\n<p>Face aux meilleurs toplaners du monde comme Gyeong-Hwan « MaRin » Jang et Tong « Koro1 » Yang, Odoamne étonne en exhibant un niveau de jeu de qualité sur de nouveaux champions comme Fiora, mais ce n’est pas suffisant pour tenir tête à SK Telecom T1 et à Edward Gaming : H2K est éliminée. Le Roumain a cependant gagné toute la confiance de son coach, qui a tenu à le garder pour préparer la saison 2016. Aux côtés d’une nouvelle équipe, Odoamne va devoir prouver qu’il est bien l’un des meilleurs toplaners d’Europe.</p>","pl_PL":"<p>Rumuński top-laner to pierwszy zawodnik ze swojego kraju w LCS. Jego kariera rozpoczęła się w połowie 2013 roku. Jak niemal każdy zawodnik początkowo występował w mniej znanych drużynach, z których na pierwszy plan wybija się dość zasłużone Absolute Legends. W tym czasie wiele osób brało go za słynnego amerykańskiego dżunglera Briana „TheOddOne’a” Wyllie’ego ze względu na zbieżność nicków. Co ciekawe, pseudonim Odoamne znaczy po rumuńsku „O, Boże”.</p>\n\n<p>Ostatecznie najważniejszym momentem w karierze Rumuna było związanie się z Fabianem „Febivenem” Diepstratenem, Petterem „\"Hjärnanem\" Freyschussem, Tri Tinem „k0u” Lamem i Erihem „Voidle’em” Sommermannem. Stworzony przez nich zespół Apples is sour szybko zdominował drużynową kolejkę rankingową i zdobył pierwsze miejsce w tabeli. Nie umknęło to uwadze rzeszy organizacji. Ostatecznie formacja zdecydowała się na dołączenie do Cloud9 Eclipse, które poszukiwało utalentowanych graczy do swojej europejskiej dywizji. Odoamne i jego koledzy powędrowali właśnie tam.</p>\n\n<p>Rumuński top-laner przeszedł z tym zespołem całą drogę – występy w Challenger Series, nieudane baraże, zmianę organizacji na H2k-Gaming, znów dobre występy na zapleczu i kolejną porażkę w barażach. Panowało wtedy przekonanie, że Odoamne, podobnie jak jego kolega z zespołu Febiven, na turniejach offline nie radzi sobie z presją. Nie ulegało bowiem wątpliwości, że rumuński top-laner ma ogromny talent i mechanicznie jest jednym z najlepszych graczy na swojej pozycji w Europie, co regularnie udowadniał w kolejce solowej i turniejach online. Jego znakiem rozpoznawczym była bardzo mocna faza linii, którą zazwyczaj wygrywał. Tymczasem kiedy przychodziło do najważniejszych meczy, Odoamne po prostu nie był tym samym zawodnikiem. Wszystko zmieniło się w Expansion Tournamencie – cały zespół zaprezentował się tak jak od niego oczekiwano i dostał się do EU LCS.</p>\n\n<p>„Naprawdę wierzę, że Odoamne jest jednym z najlepszych top-lanerów w Europie. (…) On jest prawdopodobnie nie tylko graczem H2k, którego warto obserwować, ale graczem, którego warto obserwować spośród wszystkich zawodników LCS” – powiedział o nim przed startem wiosennego splitu 2015 jego były trener Ram „Brokenshard” Djemal.</p>\n\n<p>Tam Odoamne błyskawicznie udowodnił, że Brokenshard faktycznie miał co do niego rację i okazał się objawieniem wiosennego splitu. W tym czasie zdecydowanie sprzyjała mu także meta, która faworyzowała dość wytrzymałe postaci, czyli te, którymi rumuński top-laner czuje się najlepiej. To właśnie Odoamne był zawodnikiem, który w tym czasie przywrócił blask Trundle’owi. Dał się też szerzej poznać jako znakomity gracz Maokaia. Ostatecznie H2k zakończyło split na wysokim, trzecim miejscu, a Rumun był najjaśniejszym punktem drużyny. W lecie nieznacznie spuścił z tonu, ale nadal stanowił ważne ogniwo formacji, która powtórzyła sukces z wiosennej edycji. Odoamne pojechał na Mistrzostwa Świata, które jednak były w jego wykonaniu bardzo nierówne. Świetne gry przeplatał tymi nieco słabszymi, a H2k zakończyło udział w zmaganiach na fazie grupowej.</p>\n\n<p>Przed wiosennym splitem 2016 w zespole dokonało się wiele zmian i Odoamne pozostał ostatnim graczem z pierwotnego składu Apple is sour/C9E/H2k. Co ciekawe, latem 2015 Odoamne był trzecim najczęściej zabijającym top-lanerem w stawce. Miał też bardzo duży udział w obrażeniach drużynowych, wynoszący 24,1%, co daje mu drugą pozycję wśród graczy górnej alei, zaraz za Heo „Hunim” Seung-hoonem.</p>\n","de_DE":"<p>Andrei „Odoamne“ Pascu mauserte sich 2016 still und leise zu einem der besten Top-Laner Europas. Seit der Übernahme von Cloud9 durch H2K 2014 ist Odoamne der einzige rumänische Spieler in der EU LCS. Dank seines umfangreichen Champion-Pools und seines Talents, tödlichen Ganks zu entgehen, hatte Odoamne 2016 ein wirklich gutes Jahr.\n\nBei der Weltmeisterschaft 2016 besiegte er ein paar der talentiertesten Top-Laner der Welt, bevor er schließlich in CuVee von Samsung Galaxy seinen Meister fand. 2017 kehrt Odoamne mit einer veränderten Mannschaft zurück und wird versuchen, seinen Status als der beste Top-Laner Europas zu untermauern.</p>","es_ES":"<p>Andrei ''Odoamne'' Pascu es uno de los jugadores de la calle superior más escurridizos de la LCS EU. Consigue constantemente evitar las emboscadas saltando, deslizándose o directamente asesinando al oponente. Sin embargo, cuando Odoamne abandona su calle, deja a un lado los contoneos y va directo al corazón del equipo enemigo. Cuando usa Teleportar por el flanco con campeones como Hecarim o Gnar, puede cambiar el curso de un combate de equipo en un instante.</p>\n\n<p>Ampliamente considerado uno de los mejores jugadores de la calle superior de Europa, si no del mundo, el rumano sigue evolucionando como jugador. Su gran repertorio de campeones le permite adaptarse a sus oponentes en todo momento. Odoamne ha engrosado su currículum profesional a lo largo de 2016, con grandes actuaciones dentro y fuera del metajuego. Es raro encontrar un jugador en equipo que domine a sus oponentes con tanta frecuencia como lo hace Odoamne. H2K dependerá mucho de él cuando lleguen al escenario más grande de League of Legends. Odoamne ya está familiarizado con los focos internacionales, por lo que su experiencia y entereza serán claves para el éxito de H2K.</p>","pt_BR":"<p>Andrei “Odoamne” Pascu é um dos topos mais escorregadios da EU LCS. Ele constantemente escapa de emboscadas saltando, esquivando ou apenas acabando com seus oponentes. Mas quando deixa sua rota, as brincadeiras acabam e ele mergulha direto no coração da equipe inimiga. Seus flancos de Teleporte com campeões como Hecarim e Gnar podem virar a mesa de um confronto de equipe instantaneamente.</p>\n\n<p>Amplamente considerado como um dos melhores topos da Europa, senão do mundo, Odoamne está sempre evoluindo como jogador. Seu enorme elenco de campeões permite que ele se adapte a seus oponentes para além da seleção de campeões. Odoamne exibiu seus números de carreira por todo ano de 2016, tendo um ótimo desempenho tanto fora e dentro do meta. É raro encontrar um jogador de equipe que consegue dominar seus oponentes tão bem quanto Odoamne. A H2K dependerá fortemente dele para subir no maior palco do League of Legends. Mas ele não é nenhum novato aos holofotes internacionais e sua experiência e forte presença serão chave para o sucesso da H2K.</p>","es_AR":"<p>Andrei \"Odoamne\" Pascu es uno de los carrileros superiores más escurridizos de la LCS EU. Sabe eludir las emboscadas saltando, corriendo o simplemente asesinando a sus rivales. Cuando Odoamne abandona su carril, olvida todo lo demás y se mete directamente en el corazón del equipo enemigo. Las teleportaciones que usa con campeones como Hecarim y Gnar para flanquear a los enemigos pueden dar vuelta un combate en equipo en un instante.</p>\n\n<p>Ampliamente reconocido como uno de los jugadores de carril superior más destacados de Europa, si no del mundo, Odoamne continúa evolucionando su juego. Su gran cantidad de campeones disponibles se adapta a sus rivales en el robo de cartas y más. Odoamne registró buenas cifras para su carrera a lo largo del 2016, y tuvo un buen desempeño tanto en el metajuego como en otros aspectos. No es común encontrar a un jugador de equipo que domine a sus rivales tanto como lo hace Odoamne. H2K pondrá mucha confianza en él mientras se prepara para el escenario más importante de League of Legends. Odoamne ya es muy conocido en el ambiente internacional, donde su experiencia y firme presencia serán clave para el éxito de H2K.</p>"},"foreignIds":{"drupalId":"1385","TRLH3":"200000071","TRLH4":"200000174"},"socialNetworks":{"twitch":"www.twitch.tv/odoamne","facebook":"www.facebook.com/H2kOdoamne","twitter":"https://twitter.com/odoamneLoL"},"champions":[],"liveGameTeam":33},{"id":229,"slug":"febiven","name":"Febiven","firstName":"Fabian","lastName":"Diepstraten","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/febiven-fby8tljm.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:00:20.000Z","bios":{"en_US":"<p>Fabian “Febiven” Diepstraten has the raw talent of an elite mid laner. So far, he’s had trouble focusing that talent on Summoner’s Rift. The 20-year-old showed flashes of greatness after joining Fnatic, but in 2016 the team ended their streak of three straight Worlds appearances, and Febiven faced heavy criticism for his performance.</p>\n\n<p>As the new mid laner for H2K, Febiven has a fresh start. With Jankos’ aggressive jungling style to pair with, Febiven has placed himself in the perfect situation to succeed in 2017. Febiven has a lot to prove in the new season, but one thing he isn’t lacking is talent.</p;>","fr_FR":"<p>Fabian « Febiven » Diepstraten est l'un des mid-laners les plus meurtriers des LCS EU. On le voit souvent arborer son sempiternel sourire : Febiven parvient à s'amuser même dans l'environnement sous haute pression des LCS EU. (À moins qu'il n'existe un lien de causalité entre ses sourires et ses séries d'éliminations ? Hmm...) Bien entendu, si vous étiez arrivé à tuer en solo l'invincible Roi-démon de Corée du Sud, Faker, vous pourriez avoir le même sourire, vous aussi.</p>\n<p>Febiven ne se contente pas de sourire et de faire la preuve de ses compétences techniques sur la voie du milieu. Personne n'a plus soif de compétition que lui. Après avoir participé à l'incroyable série de 18 victoires sans défaite lors du segment d'été des LCS EU 2015 et à une passionnante série de cinq parties contre SKTelecom T1 lors du MSI 2015, de nombreux pros se seraient reposés sur leurs lauriers. Febiven, lui, a plus faim que jamais, comme le prouvent ses performances au mondial 2015, au cours duquel il a aidé Fnatic à atteindre les demi-finales. L'Europe a déjà vu naître de nombreux mid-laners exceptionnels, et Febiven semble bien parti pour perpétuer cette tradition d'excellence.</p>","pl_PL":"<p>Fabian swoją karierę profesjonalnego gracza zaczął w styczniu 2014 roku w drużynie Cloud9 Eclipse. Będąc w tej organizacji miał okazję konkurować z wieloma znanymi zespołami, jak np. Ninjas in Pyjamas czy Denial eSports. Niestety nie udało mu się wejść do rozgrywek LCS. Natomiast wziął udział w wielu pomniejszych turniejach, gdzie pokazał się jako gracz najwyższej klasy. W związku z tym, kiedy tylko Cloud9 Eclipse zostało rozwiązane, \"Febiven\" dostał ofertę od H2k-gaming. Zyskał możliwość dalszego uczestnictwa w wydarzeniach różnej rangi, jak również w Challenger Series. W kwalifikacjach do rozgrywek EU LCS dał prawdziwy popis swoim umiejętnościom i rzadko kiedy jego KDA wynosiło poniżej 10. Ten wyczyn nie uszedł uwadze jednego z najlepszych zespołów Europy. Kiedy Fabian został zaproszony do dołączenia do drużyny Fnatic, szybko wyraził zgodę.</p> \n\n<p>W ciągu sezonu piątego \"Febiven\" z mało znanego stał się jednym z najpopularniejszych graczy w Europie. Zasłużył sobie na taką renomę swoim niezwykle dynamicznym stylem gry. Fabian jest zawodnikiem, który zawsze podejmie wyzwanie – wielokrotnie udowadniał też, że potrafi sprostać kolejnym próbom. Kradzież Barona Nashora przeciwnikom w ostatniej chwili to dla niego betka. Efektem jego fenomenalnej formy był doskonały wiosenny i letni sezon EU LCS 2015 dla drużyny Fnatic. W ostatnim z wymienionych okresów pobił z zespołem światowy rekord – nie przegrał ani jednej gry podczas tych rozgrywek. Aczkolwiek lista jego osiągnięć jest długa. Na MSI wielokrotnie sam zabijał, rzekomo najlepszego mid-lanera świata, Lee’a \"Faker\" Sang-hyeoka. Ten pokaz sił uzmysłowił społeczeństwu League of Legends jak wyborowym mid-lanerem jest \"Febiven\". Później miał okazję potwierdzić to na Mistrzostwach Świata 2015, gdzie po wyjściu z fazy grupowej na pierwszym miejscu, miał okazję zawalczyć z wybitną chińską drużyną, EDward Gaming. Zmierzył się wtedy z mistrzem świata sezonu czwartego – Heo’em \"PawN\" Won-seokiem. Kolejny raz wyszedł zwycięski ze starcia z innym legendarnym graczem, pisząc w ten sposób swoją własną historię znakomitego zawodnika.</p>\n\n\n<p>Razem z rozwojem sławy, stał się znany ze swojej dominacji na mid-lanie, zarówno jako klasyczny mag jak i asasyn. W Kręgu Pretendenta \"Febiven\" zasłynął jako wybitna Riven. To właśnie fascynacji tą postacią zawdzięcza swój pseudonim, ponieważ jest on efektem kombinacji imienia Fabian i Riven. Natomiast po MSI i MŚ 2015, stał się równie poważany jako Zed, LeBlanc i Viktor. Kibice doskonale zapamiętali, że „Faker” zginął od ostrzy jego Władcą Cieni i jak bezbłędnie ukradł Barona Oszustką. Pomimo rzeszy wiernych wielbicieli, największymi fanami Fabiana są jego rodzice. Chodzą na jego mecze żeby głośno mu kibicować, zawsze gotowi żeby go wesprzeć w realizacji jego marzeń.</p>\n","de_DE":"<p>Es gibt einen Grund dafür, warum Marcin „Jankos“ Jankowski den Spitznamen „König des ersten Bluts“ trägt. Zu Beginn seiner Karriere führte sein aggressiver Spielstil dazu, dass sein Blut genauso häufig als Erstes vergossen wurde, wie es ihm gelang, erstes Blut zu vergießen. Aber im Sommer-Split der EU LCS 2016 wendete er das Blatt zu seinen Gunsten und sicherte H2K damit einen Platz bei der Weltmeisterschaft 2016. \n\nJankos’ beeindruckende Vorstellungen mit Lee Sin und Olaf brachten H2K bis ins Halbfinale der Weltmeisterschaft. 2017 kehrt er mit seinem explosiven Naturell nach Europa zurück, um als Jungler einen neuen Tötungsrekord aufzustellen. Jankos ist der König des ersten Bluts und seine Herrschaft in der EU LCS ist uneingeschränkt.</p>","es_ES":"<p>Hace un año Fabian ‘Febiven’ Diepstraten fue considerado una apuesta de futuro que venía de H2k. En tan sólo un año, muchos lo consideran dentro de los cinco primeros mejores mid del mundo e incluso ha sido capaz de en una misma partida de asesinar hasta en dos ocasiones a Lee ‘Faker’ Sang-hyeok en el Mid Season Invitational. El que hace dos años anunció orgulloso ser la mejor Riven de Europa al llegar a Challenger tras abusar con el campeón, a día de hoy ha llegado a unas semifinales de un Campeonato Mundial como el principal baluarte mecánico de su equipo.</p>\n\n<p>Febiven comenzó fuerte 2014 tras fichar por Cloud 9 Eclipse y partido tras partido jugar a un nivel superior al de sus contrincantes. Tanto en Challenger Series como en el torneo de promoción sus actuaciones con Zed, LeBlanc y Nidalee asustaron a sus enemigos. La situación cambió en Junio cuando fichó por H2k. Empezó a jugar más campeones de control como Orianna y Twisted Fate y su Ahri le ayudó a mezclar ambos estilos de juego en los que había sido estrella. Finalmente después de perder el torneo de promoción contra Copenhagen Wolves fueron capaces de arrasar en el trorneo de expansión de primavera para entrar a la LCS sin perder ni un partido.</p>\n\n<p>Las buenas actuaciones del holandés no pasaron desapercibidas y un equipo en total renovación como Fnatic tras la salida de varias estrellas se fijó en él. Pasó de formar parte de un equipo recién ascendido por aquel entonces al equipo más exitoso de Occidente junto a Team SoloMid.</p>\n\n<p>No decepcionó. Su alto nivel con Zed y LeBlanc a principios de primavera anuló a muchos rivales que en aquel entonces no le tenían todavía miedo. Febiven siempre tenía hueco para sacar campeones variopintos como Xerath, Ezreal o Cho’Gath y además a un alto nivel. Su capacidad para ganar cualquier línea le permitió aterrorizar poco a poco a sus enemigos hasta a jugadores de otras regiones. Cassiopeia fue una de las principales razones.</p>\n\n<p>Ese estilo de juego a veces provocaba que a Fnatic se le fuesen de las manos la partidas y necesitaron más estabilidad. Con dicha estabilidad llegaron Azir y Viktor, que permitieron a Febiven colocarse un escalón por encima de sus rivales. Como cuando fichó por H2k, su Orianna también ganó valor a la hora de usar su definitiva “ Onda de Choque “ (R). Una partida para el recuerdo será la que les enfrentó en cuartos de final del Campeonato Mundial 2015 contra Edward Gaming en la que él con su LeBlanc destrozó completamente el encuentro.</p>\n\n<p>A lo largo de la temporada Febiven ha optado principalmente por jugar asesinos o magos de control, y esto le ha provocado una maestría tal con los campeones que si conseguía cierta ventaja nunca se le iba de las manos. Polémico cada vez que habla por su extrema sinceridad, el señor de la línea central tendrá un nuevo rol en Fnatic de experto y tendrá que sacar nuevas virtudes para poder llevar al equipo al éxito. Divertido, entretenido y se podría decir infantil, promete grandes momentos en 2016 al igual que en 2015. Este es el año de la confirmación.</p>","pt_BR":"<p>Febiven é um jogador da rota do meio que consegue se divertir mesmo sob a pressão gigantesca de uma LCS. Mas isso não faz dele um sujeito inofensivo, pelo contrário: quem mais pode se gabar de ter <a href=\"https://youtu.be/x4_rUERsyb8?t=22m11s\">derrubado sozinho</a> ninguém menos que Faker, o Deus Imortal da Coreia?</p>\n<p>Ele é mais que um sorriso bacana e habilidades ninjas na rota do meio. Sua motivação profissional é inigualável. Depois de um recorde de 18-0 na temporada de verão e uma série disputadíssima de cinco jogos contra a SKT no MSI, muitos profissionais teriam se acomodado. Mas Febiven vem com mais sede do que nunca, disposto a continuar o legado europeu de jogadores imbatíveis na rota do meio.</p>\n"},"foreignIds":{"drupalId":"1388","TRLH3":"200000073","TRLH4":"200000176"},"socialNetworks":{"twitch":"http://www.twitch.tv/fabiantje","facebook":"www.facebook.com/Febiven","twitter":"https://twitter.com/FnaticFebiven"},"champions":[],"liveGameTeam":33},{"id":344,"slug":"xyraz","name":"Xyraz","firstName":"Gustav","lastName":"Blomkvist","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xyraz-24ixeasw.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-05-31T21:08:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3684","TRLH3":"200000300","TRLH4":"200000400"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":739,"slug":"nuclear","name":"Nuclear","firstName":"Jung-hyun","lastName":"Shin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nuclear-5h5xglzv.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-09T10:01:58.000Z","bios":{"en_US":"<p>Jung-hyun \"Nuclear\" Shin brings his explosive talent to the EU LCS in 2017. The 19-year-old Korean has already spent almost two full years play competitively for SBENU Sonicboom and SBENU Korea in the LCK and Challengers Korea. With a heavy focus on farming for the late game, Nuclear had the LCK's second best CS per minute of 9.3 in the 2016 Spring Split.</p>\n\n<p>Coming in as the replacement for FORG1VEN, fans will have high expectations for Nuclear in his first split. Nuclear and new support Chei make up H2K's wild card for the 2017 season. When Nuclear goes off, H2K's opponents won't want to get caught in the blast.</p>","de_DE":"<p>Jung-hyun „Nuclear“ Shin wird versuchen, sein explosives Talent 2017 in der EU LCS unter Beweis zu stellen. Der neunzehnjährige Koreaner hat bereits einiges an Erfahrung gesammelt. Er spielte fast zwei Jahre lang bei SBENU Sonicboom und SBENU Korea in der LCK und der koreanischen Challenger Series. Er legt seinen Fokus vor allem auf das Farmen und das späte Spiel, weshalb er im Frühjahrs-Split 2016 mit 9,3 VT (CS) pro Minute auch den zweitbesten Wert der Liga hatte.\n\nDa Nuclear FORG1VEN ersetzt, haben die Fans bereits in seinem ersten Split hohe Erwartungen an ihn. Nuclear und der neue Supporter Chei runden H2Ks Aufstellung für den Frühjahrs-Split der EU LCS 2017 ab. Wenn Nuclear explodiert, sollten H2Ks Gegner lieber so schnell wie möglich das Weite suchen.</p>"},"foreignIds":{"drupalId":"4346","TRLH3":"200000074","TRLH4":"200000177"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":758,"slug":"chei","name":"Chei","firstName":"Seon-Ho ","lastName":"Choi","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chei-bkyp0qc4.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T09:57:19.000Z","bios":{"en_US":"<p>Sun-ho “Chei” Choi is the second half of H2K’s new bot lane. The 20-year-old hails from Korea, where he played two seasons in the LCK for the Jin Air Green Wings. Now he heads to the EU LCS to pair up with H2K’s new ADC, Nuclear. The two young Koreans will have their work cut out for them in 2017 against Europe’s best duos. They’re H2K’s biggest unknown going into the new season; if Chei and Nuclear can perform, H2K should be in for a very successful season.</p>","fr_FR":"<p>\nSeon-ho “Chei” Choi représente quant à lui la partie plus agressive de Jin Air Green Wings. Lorsqu'il est associé à Hyung-woo “Cpt Jack” Kang, Chei se met souvent dans des situations périlleuses en raison son agressivité parfois trop présente. Cependant, les déplacements de Chei sont plus calculés lorsqu'il forme un duo avec Woo-hyung “Pilot” Nah. L'équilibre trouvé entre leurs natures défensives et agressives pourrait bien être la clé du succès pour Jin Air sur la voie du bas. \n</p>","pl_PL":"<p>\nSeon-ho “Chei” Choi jest tym agresywnym z dwojga wspierających Jin Air Green Wings. Gdy jest w parze z Hyung-woo “Cpt Jack” Kang, Chei często wpada kłopoty ze względu na przesadną agresję. Niemniej jednak jego zagrania są lepiej zaplanowane, gdy gra razem z Woo-hyung “Pilot” Nah'em. Zbilansowanie ich agresywnej i defensywnej natury może otworzyć nowe możliwości dla dolnej linii Jin Air.\n</p>","de_DE":"<p>Sun-ho „Chei“ Choi ist die zweite Hälfte von H2Ks neuem Team auf der unteren Lane. Der Zwanzigjährige kommt aus Korea, wo er zwei Saisons lang für Jin Air Green Wings in der LCK spielte. Jetzt bereitet er sich auf die EU LCS vor, um sich dort mit H2Ks neuem AD-Carry Nuclear zusammenzutun. Die beiden Koreaner werden alle Hände voll zu tun haben, wenn sie es 2017 mit den besten Duos Europas zu tun bekommen. Sie sind H2Ks größte Unbekannte in der neuen Saison, aber wenn Chei und Nuclear gute Leistungen abliefern, sollte einem erfolgreichen Frühjahrs-Split nichts mehr im Weg stehen.</p>"},"foreignIds":{"drupalId":"2808","TRLH3":"200000075","TRLH4":"200000178"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1107,"slug":"broxah","name":"Broxah","firstName":"Mads","lastName":"Brock-Pedersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/broxah-ghb4l4xy.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:21:53.000Z","updatedAt":"2017-06-09T10:07:52.000Z","bios":{"en_US":"<p>Mads \"Broxah\" Brock-Pedersen is Fnatic's impressive young jungler. After spending just a month on Fnatic Academy, Broxah was called up to the EU LCS to play for the main squad. He made the most of his opportunity, helping Fnatic to a third-place finish in the 2017 Spring Split. Now with a full split ahead of him, Broxah will try to cement himself as one of Europe's best junglers.</p>"},"foreignIds":{"FRA1TMNT1":"375373","TRLH4":"200000230","TRLH3":"200000225"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1111,"slug":"caps","name":"Caps","firstName":"Rasmus","lastName":"Winther","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/caps-bfsia402.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:29:56.000Z","updatedAt":"2017-06-09T10:06:46.000Z","bios":{"en_US":"<p>Rasmus “Caps” Winther has played in many challenger level leagues over the course of his young career and most recently helped Dark Passage secure first place in the Turkish Champions League before joining European powerhouse, Fnatic. As a player he isn’t afraid to flaunt his skills and make sure that everyone knows that he’s the best Summoner on the Rift.</p>\n\n<p>Caps isn’t shy about his aspirations either. He has openly talked about wanting to follow in the footsteps of other great European mid laners, and even stated he would love to get to the level of Faker. His journey towards greatness begins in the 2017, where he will go heads up with some of the best mid laners Europe has to offer. Good luck, have fun.</p>","de_DE":"<p>Rasmus „Caps“ Winther spielte im Verlauf seiner jungen Karriere bereits bei vielen Mannschaften auf Challenger-Niveau und half vor Kurzem Dark Passage, sich den ersten Platz in der türkischen Champions League zu sichern, bevor er zum europäischen Schwergewicht Fnatic wechselte. Er hat keine Angst, sein Können zur Schau zu stellen und alle wissen zu lassen, dass er der beste Beschwörer in der Kluft ist.\n\nCaps macht auch aus seinen Zielen kein Geheimnis. Er hat offen darüber gesprochen, in die Fußstapfen der großen europäischen Mid-Laner (Bjergsen, damit meine ich dich) zu treten und sogar Fakers Niveau erreichen zu wollen. Sein Weg zu wahrer Größe beginnt im Frühjahrs-Split der EU LCS 2017, wo er auf ein paar der besten Mid-Laner Europas treffen wird. Viel Glück und viel Spaß!</p>"},"foreignIds":{"TRLH4":"200000160","TRLH3":"200000057"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1264,"slug":"special","name":"Special","firstName":"Joran","lastName":"Scheffer","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/special-69mtzco4.png","hometown":"EU","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:15:34.000Z","updatedAt":"2016-07-30T04:57:42.000Z","bios":{},"foreignIds":{"TRLH3":"1001310008","TRLH4":"1001270008","TRLH2":"1001250047","FRA1TMNT2":"25217"},"socialNetworks":{},"champions":[],"liveGameTeam":15},{"id":1758,"slug":"icebeasto","name":"IceBeasto","firstName":"Marcin","lastName":"Lebuda","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/icebeasto-77gp62fw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-31T20:40:44.000Z","updatedAt":"2017-05-31T21:17:50.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200001040","TRLH3":"200000271","TRLH4":"200000323"},"socialNetworks":{},"champions":[],"liveGameTeam":33},{"id":1911,"slug":"proxyfox","name":"ProxyFox","firstName":"Amalie","lastName":"Reisvaag","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/proxyfox-8xe0yf11.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:24:49.000Z","updatedAt":"2017-05-31T21:26:33.000Z","bios":{},"foreignIds":{"TRLH3":"200000302","TRLH4":"200000402"},"socialNetworks":{},"champions":[],"liveGameTeam":33}],"scheduleItems":[{"id":"AVIUlUIXOPWArxM1l4Y6","content":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:match:d13671bc-a0dd-4520-a617-43f7f67a002d","scheduledTime":"2016-02-25T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989","blockLabel":"7","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:bracket:47deb68d-7d32-49b5-9f6a-490ccf9dfee6"},"match":"d13671bc-a0dd-4520-a617-43f7f67a002d","tournament":"33651c33-83f7-48f1-8e2f-9f5a5f641989","bracket":"47deb68d-7d32-49b5-9f6a-490ccf9dfee6","league":"3"}],"gameIdMappings":[{"id":"93982a97-d0f6-4d80-8234-25922dcd94ba","gameHash":"2ba77a5baaef2c3b"}],"videos":[{"id":1056,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:33651c33-83f7-48f1-8e2f-9f5a5f641989:game:93982a97-d0f6-4d80-8234-25922dcd94ba","source":"https://www.youtube.com/embed/faDnlQY0Ajc?wmode=transparent","createdAt":"2016-02-25T21:09:59.000Z","updatedAt":"2016-02-25T21:09:59.000Z","game":"93982a97-d0f6-4d80-8234-25922dcd94ba"}],"htmlBlocks":[],"match":{"id":"d13671bc-a0dd-4520-a617-43f7f67a002d","name":"H2K-vs-FNC","position":37,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"games":{"93982a97-d0f6-4d80-8234-25922dcd94ba":{"id":"93982a97-d0f6-4d80-8234-25922dcd94ba","name":"G1","generatedName":"FNC|H2K|G1|d13671bca0dd4520a61","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"},{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}],"standings":{"result":[[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"}],[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}]],"timestamp":1456430533512,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001530113","gameRealm":"TRLH3","platformId":"TRLH3:1001530113","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"06dff218-3b0e-4843-a5df-3c23d85f3ce8"}],[{"roster":"9fbcd5a6-f61f-48fb-aee3-0087efae854a"}]],"timestamp":1456430533512,"source":"manual","note":"Set in esports HQ","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}