{"teams":[{"id":267,"slug":"big-gods-jackal","name":"Big Gods Jackals","guid":"be72477c-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/big-gods-jackal-gahxh2c5.png","acronym":"BIG","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:06:48.000Z","updatedAt":"2017-07-20T01:45:00.000Z","bios":{"en_US":"<p>Coach: Ednilson \"Jukaah\" Vargas</p>"},"foreignIds":{},"players":[275,365,419,578,666,900,1674],"starters":[275,365,419,578,900],"subs":[666,1674]},{"id":268,"slug":"delta-fox","name":"Delta Fox","guid":"be724864-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/delta-fox-dhv7r8fl.png","acronym":"DFX","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:09:12.000Z","updatedAt":"2017-06-07T17:23:39.000Z","bios":{"en_US":"<p>Coach: Mark \"MarkZ\" Zimmerman</p>"},"foreignIds":{},"players":[58,140,141,148,165,1161,1300],"starters":[58,140,141,148,165],"subs":[1161,1300]}],"players":[{"id":58,"slug":"dyrus","name":"Dyrus","firstName":"Marcus","lastName":"Hill","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/dyrus-67oaen12.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:15.000Z","updatedAt":"2017-06-07T21:47:34.000Z","bios":{"en_US":"<p>Marcus \"Dyrus\" Hill has been a stalwart member of the League of Legends community since the game's beta days. In that time, Dyrus has achieved tremendous success both as a professional player on the Rift and as a fan favorite off it. His combination of raw talent and an absurdly monotone voice make him irresistible to insomniacs everywhere. But even Dyrus can’t help but get excited when he <a href=\"https://youtu.be/hQYG13jnXPo?t=29m7s\" target=\"_blank\">goes full man mode</a> on the enemy team. Sometimes the quiet passion bubbles forth and breaks the surface.\n</p>\n<p>\nDyrus is more than just a friendly baritone, though. His commitment to his fans, his team, and his friends is exemplary. When Dyrus announced his retirement at the 2015 World Championship, there were more than a few tears shed both onstage and in the crowd. Now, he makes his return as part of Delta Fox's dream meme team.\n</p>","fr_FR":"<p>Marcus « Dyrus » Hill est un membre actif de la communauté League of Legends depuis les débuts du jeu en bêta. À cette époque, Dyrus a eu énormément de succès aussi bien en tant que joueur professionnel dans la Faille qu'en termes de popularité auprès des fans. Son talent brut et sa voix absurdement monotone l'ont rendu irrésistible pour tous les insomniaques du monde. Mais même Dyrus ne peut pas s'empêcher d'être excité quand il passe en mode viril pour attaquer l'équipe ennemie. Parfois, la passion bouillonne tellement qu'elle brise la surface.\n</p>\n<p>\nDyrus n'est toutefois pas qu'un baryton sympathique. Il est prêt à tout pour ses fans, son équipe et ses amis. Quand Dyrus a annoncé qu'il prenait sa retraite lors du mondial 2015, la tristesse fut palpable tant sur la scène qu'au sein du public. Et bien que son départ marque la fin d'une ère, Dyrus est là une dernière fois pour participer à l'événement All-Star 2015.\n</p>","pl_PL":"<p>\nMarcus „Dyrus” Hill jest członkiem społeczności League of Legends od samego początku bety. W tym czase Dyrus osiągnął olbrzymi sukces, zarówno jako profesjonalny gracz na Rift, jak i ulubieniec fanów. Połączenie jego talentu z niesamowicie monotonnym głosem powodują, że stał się faworytem ludzi cierpiących na bezsenność. Ale nawet Dyrus musi się podekscytować, gdy całkowicie rozgromi drużynę przeciwną. Czasami jakieś drobinki pasji przedostają się na powierzchnię.\n</p>\n<p>\nJednakże Dyrus nie jest tylko przyjaznym barytonem. Jego oddanie fanom, drużynie i przyjaciołom jest wspaniałe. Gdy ogłosił przejście na emeryturę podczas mistrzostw świata 2015, wylano wiele łez na scenie i trybunach. Mimo że jego odejście oznacza koniec pewnej ery, Dyrus powraca na jedno, ostateczne starcie podczas All-Star Event 2015.\n</p>","de_DE":"<p>\nMarcus „Dyrus“ Hill ist schon seit den Tagen der Betaversion ein treues Mitglied der League of Legends-Community. Seitdem feierte Dyrus sagenhafte Erfolge als professioneller Spieler in der Kluft und auch als Liebling der Fans. Sein schieres Talent in Kombination mit seiner absurd monotonen Stimme macht ihn für die Schlaflosen dieser Welt unwiderstehlich. Doch auch Dyrus selbst ist aufgeregt, wenn er das gegnerische Team so richtig aufmischt. Manchmal sprudelt seine unterdrückte Leidenschaft an die Oberfläche.\n</p>\n<p>\nDoch in Dyrus steckt mehr als nur ein sympathischer Bariton. Sein Engagement seinen Fans, seinem Team und seinen Freunden gegenüber ist beispielhaft. Als Dyrus bei der Weltmeisterschaft 2015 seinen Rücktritt ankündigte, flossen nicht wenige Tränen auf der Bühne und im Publikum. Mit ihm geht eine Ära zu Ende, deshalb wird Dyrus beim All-Star Event 2015 noch seine Abschiedsvorstellung geben.\n</p>","es_ES":"<p>Marcus ''Dyrus'' Hill es un fiel miembro de la comunidad de League of Legends desde los tiempos de la Beta del juego. En este tiempo ha cosechado un tremendo éxito, como jugador en la Grieta pero también entre los aficionados. Su singular combinación de talento puro y voz absurdamente monótona lo ha convertido en el ídolo de gente con problemas de insomnio de todo el mundo. Pero ni siquiera Dyrus puede hacer otra cosa que emocionarse cuando se lanza en ''modo macho'' sobre el equipo enemigo. A veces la burbuja de serenidad estalla y aflora la pasión a la superficie.\n</p>\n<p>\nPero Dyrus es algo más que un encantador barítono. Su compromiso para con sus fans, su equipo y sus amigos es ejemplar. Cuando anunció su retirada en el Campeonato Mundial de 2015 no fueron pocos los que derramaron lágrimas, tanto en el escenario como entre el público. Y aunque es cierto que su marcha señala el final de una era, Dyrus aún volverá para darnos una última lección en el All-Star 2015.\n</p>","pt_BR":"<p>Marcus \"Dyrus\" Hill é um leal membro da comunidade de League of Legends desde o beta do jogo. Desde aquela época, Dyrus conquistou um tremendo sucesso tanto como jogador profissional de Summoner's Rift como sendo um dos jogadores favoritos dos fãs. A combinação de seu grande talento com a absurda voz monótona o transformam em alguém irresistível para os insones procurando por transmissões. Mas mesmo Dyrus não consegue se conter quando coloca <a href=\"https://youtu.be/hQYG13jnXPo?t=29m7s\">todo seu talento</a> na mesa. Algumas vezes, a silenciosa paixão dele aflora e quebra qualquer um.\n</p>\n<p>\nNo entanto, Dyrus é muito mais do que um amigável barítono. Sua dedicação competitiva ao - algumas vezes - rigoroso regime de treinamentos o ajudou a manter-se entre os melhores topos da América do Norte desde o começo. Como o próprio Dyrus diz, \"É tudo tão mais difícil hoje em dia do que era antigamente\", mas ele não está usando a crescente competição como desculpa para cair fora. Dyrus fará tudo o que precisar para <a href=\"http://lolesports.com/articles/dyrus-and-team-solomid-win-2015-na-lcs-spring-split\">colocar a TSM no topo</a>.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Marcus \"Dyrus\" Hill은 리그 오브 레전드 베타 시절부터 커뮤니티 활동을 열심히 했습니다. 당시 Dyrus는 리그 오브 레전드 프로 게이머이자 최고 인기인으로 엄청난 성공을 거뒀습니다. 많은 사람들이 그의 날것 같은 재능과 단조로운 목소리에 매력을 느낍니다. 하지만 Dyrus조차 적팀을 제압할 때는 흥분하지 않을 수 없죠. 때로는 그 조용한 열정이 끓어올라 표면 위로 분출되곤 합니다. </p>\n<p style=”font-family:”나눔고딕”;\">하지만 Dyrus에게는 듬직함과 친숙함 외의 요소도 많습니다. 자신의 팬, 팀, 친구들에 대한 그의 헌신은 모범적이죠. Dyrus가 2015 월드 챔피언십에서 은퇴를 발표했을 때 무대 위와 관중석 모두 눈물을 흘리는 사람들이 적지 않았습니다. 은퇴 발표로 한 시대의 종말을 고한 Dyrus는 2015 올스타전에서 마지막으로 전장에 합류합니다. </p>\n"},"foreignIds":{"drupalId":"11","TRLH1":"1001180053","TRLH2":"1001140049","TRLH3":"1001160079","TRLH4":"1001160079","ESPORTSTMNT02":"200002444"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_dyrus","youtube":"https://www.youtube.com/user/TSirDiesAlot","facebook":"https://www.facebook.com/TSMDYRUSLOL","twitter":"https://twitter.com/LoLDyrus"},"champions":[],"liveGameTeam":268},{"id":140,"slug":"scarra","name":"Scarra","firstName":"William","lastName":"Li","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarra-5x01i56g.png","hometown":"Houston, TX","region":null,"birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-22T22:23:56.000Z","bios":{"en_US":"<p>Wiliam \"Scarra\" Li was the backbone of Team Dignitas from the mid lane, having been with the team along with Imaqtpie since their original inception as ROCK SOLID.  Although he was known for thriving with defensive champions such as Anivia or Karthus, Scarra has shown flexibility, spinning up his old favorites Katarina and Diana while practicing other similarly aggressive champions.</p>\n\n<p>Scarra remains a crowd favorite due to his informative and popular stream; he has been used as an analyst for several major events such as the Season 2 World Championships. During the 2014 spring split, Scarra moved to a substitute, coaching-oriented role. After spending years behind the scenes, he now returns to play for Delta Fox.</p>\n\n"},"foreignIds":{"drupalId":"16","TRLH1":"1000035027","TRLH2":"2000025027","ESPORTSTMNT02":"200002374"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":141,"slug":"imaqtpie","name":"Imaqtpie","firstName":"Michael","lastName":"Santana","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/imaqtpie-a38640hh.png","hometown":"Margate, FL","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-15T15:25:24.000Z","bios":{"en_US":"<p>With his signature long hair, Dignitas’ AD Carry Imaqtpie is instantly recognizable when sitting behind his team’s table. His skill with the Season 2 “holy trinity” of attack damage carry champions – Ezreal, Graves and Corki – was repeatedly illustrated in tournament play. </p>\n\n<p>As one of the league's original pillars, Imaqtpie will need to prove he's still got what it takes to compete with the rest of Delta Fox's meme team.</p>\n"},"foreignIds":{"drupalId":"18","TRLH2":"2000025028","ESPORTSTMNT02":"200002443"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":148,"slug":"shiphtur","name":"Shiphtur","firstName":"Danny","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/shiphtur-3a942emw.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-06-22T22:23:47.000Z","bios":{"en_US":"<p>\nDanny “Shiphtur” Le has been competing professionally since 2012. Known for a deep champion pool, Shiphtur is most effective on mid lane assassins like Ahri and Kassadin, but he can also hold his own with control mages, as evidenced by his fantastic 10.75 KDA on Ziggs in the 2014 NA LCS Summer Split. \n</p>\n<p>\nShiphtur got his first taste of the NA LCS while playing for Team Coast, then wreaked havoc from the mid lane with Team Dignitas. As one of the more experienced players in the LCS, Shiphtur has seen the focus of professional play transition from individual mechanics to coordinated team play. \"It's all about getting down the macro,\" Shiphtur says. \"Honestly in League of Legends right now, you can win a game purely on macro, rotations and such. Individual play really doesn't mean anything right now.\" Now, Shiphtur takes up his place on Delta Fox's new lineup.\n</p>","fr_FR":"<p>Cette saison encore, Danny « Shiphtur » Le tiendra la voie du milieu pour Dignitas. À 22 ans, le Canadien est déjà un vétéran de League of Legends.</p>\n\n<p>Il a débuté sa carrière peu avant la saison 3 et le lancement des LCS. Des LCS qu'il a immédiatement rejoints au sein de Good Game University, aux côtés notamment de Darshan « ZionSpartan » Upadhyaya (aujourd'hui connu sous le pseudonyme de Darshan). Malheureusement pour lui, des problèmes de visa l'ont empêché de jouer avant le début du segment d'été. Ses malheurs ont continué tout au long de la saison puisque l'équipe, rebaptisée Team Coast, a enchaîné les défaites pour finir à la 7e place du classement, synonyme de passage en tournoi de relégation. Une victoire 3 à 2 contre The Walking Zed leur a permis de se maintenir au plus haut niveau pour la saison 4, mais le répit ne fut que de courte durée. Lors du segment de printemps des LCS de la saison 4, Shiphtur et ses comparses n'ont su faire mieux qu'une 6e place puis un retour en tournoi de relégation après deux défaites en play-offs contre Counter Logic Gaming puis Dignitas. Cette fois le couperet est tombé sous la forme d'une défaite face à compLexity.Black, 3 victoires à 1, et le mid laner s'est retrouvé bouté hors des LCS.</p>\n\n<p>C'est le moment qu'a choisi Dignitas pour le recruter, toujours aux côtés de ZionSpartan. Avec sa nouvelle équipe, le joueur canadien s'est retrouvé une fois de plus très proche des relégations, évitées de justesse en fin de saison. L’histoire se répète lors du segment de printemps de la saison 5 des LCS, où l’équipe termine à la 9ème place et doit de nouveau passer par le tournoi de relégation. Malgré une légère amélioration lors du segment d'été, Shiphtur aborde la saison 6 sans aucune certitude. À lui de prouver enfin qu'il mérite véritablement sa place sur le terrain des LCS, face à une compétition chaque année plus relevée.</p>","pl_PL":"<p>Z pochodzenia Kanadyjczyk, z krwi Wietnamczyk, z urodzenia mid-laner. Danny Le sam wybrał tą linię, gdyż uważał, że jest najbliżej centrum wydarzeń i ma największy potencjał. Podczas swojej przygody z League of Legends wielokrotnie udowadniał, że zasługuje na tą pozycję. Pojawił się na scenie esportowej pod koniec drugiego sezonu i do stycznia 2013 roku grał na różnych pozycjach w paru pomniejszych drużynach. Wtedy nastąpił przełom w jego życiu, ponieważ trafił do Good Game University, później znanego jako Team Coast. Aż do kwietnia 2014 roku zespół walczył o przetrwanie w NA LCS, ponieważ wśród innych bardziej doświadczonych drużyn był przysłowiowym chłopcem do bicia. Nie przeszkodziło to Danniemu w pokazaniu się z najlepszej strony na scenie esportowej. Zrobił pentakilla Anivią na wiosennych rozgrywkach kwalifikacyjnych w Challenger Series w styczniu 2013 roku. Niestety w kwietniu 2014 roku porażka z compLexity.Black przesądziła o relegacji Team Coast z powrotem do Challenger Series. Miesiąc później \"Shiphtur\" opuścił tą drużynę, gdyż od razu dostał propozycje od swoich niedawnych konkurentów z NA LCS. W maju 2014 roku dołączył do Team Dignitas, gdzie w swojej pierwszej grze wiosennego sezonu 2014 zrobił kolejnego pentakilla, tym razem LeBlanc. </p>\n<p>\nDanny przysłużył się wszystkim innym graczom, przecierając drogę w oddziałach imigracyjnych Stanów Zjednoczonych. Jako pierwszy zawodnik esportowy otrzymał wizę P-1A, która przysługuje tylko profesjonalnym atletom. Kolejną jego zasługą dla społeczeństwa League of Legends było wprowadzenie Ziggsa do profesjonalnej gry. Wyborem Hextechowego Sapera sprowokował wiele banów w turniejach, lecz mimo tego jest jeszcze parę innych bohaterów, które \"Shiphtur\" uwielbia. Doskonale gra Anivią, co wielokrotnie udowadniał na różnej maści meczach, podobnie traktuje Ahri i Dianę. Szczytem jego możliwości jest Krąg Pretendenta z ponad tysiącem punktów LP. W wywiadzie po Mistrzostwach Świata 2015 Danny oświadczył, że według niego najmocniejszy zespół w NA LCS 2016 będzie miał Team SoloMid. Dodał też, że nie bez powodu pojechał na długi trening do Korei i że ma zamiar godnie stawić im czoła. Całość podsumował, że kocha League of Legends i jest bardzo wdzięczny fanom, którzy przy nim wytrwali. </p>\n"},"foreignIds":{"drupalId":"38","TRLH1":"1001220076","TRLH2":"1001160126","FRA1TMNT1":"375096","ESPORTSTMNT02":"200002373"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":165,"slug":"voyboy","name":"Voyboy","firstName":"Joedat","lastName":"Esfahani","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/voyboy-2ui22t23.png","hometown":"Berkeley, CA","region":"N/A","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-06-15T15:19:48.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"20","TRLH1":"15066","TRLH2":"15066","FRA1TMNT1":"375175","ESPORTSTMNT02":"200002372"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":275,"slug":"cris","name":"Cris","firstName":"Cristian","lastName":"Rosales","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cris-3i7zm388.png","hometown":"Matamoros, Tamaulipas","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2017-06-14T22:17:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"333","TRLH1":"200000198","TRLH2":"200000102","ESPORTSTMNT02":"200000531"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":365,"slug":"fabbbyyy","name":"fabbbyyy","firstName":"Jovani","lastName":"Guillen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fabbbyyy-ggr3o4hr.png","hometown":"USA","region":"NA Challenger Series","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-14T22:16:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1312","ESPORTSTMNT02":"200000743","TRLH1":"200000289"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":419,"slug":"sirt","name":"SirT","firstName":"Thúlio","lastName":"Carlos","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sirt-3sj9ez37.png","hometown":"Recife - PE","region":"CBLOL Brazil","birthdate":"1992-10-20","createdAt":"2015-05-13T21:10:24.000Z","updatedAt":"2017-06-14T22:21:58.000Z","bios":{"pt_BR":"SirT é um dos poucos jogadores que nunca mudou de equipe em sua carreira. Caçador da paiN desde junho de 2012, Thulião sempre esbanjou uma sinergia fora do normal com Kami, e é o grande coordenador de jogadas da equipe. Após um tempo apagado, recuperou a motivação e garantiu seu espaço no cenário, roubando Barões e Dragões em momentos fundamentais. Versátil, deixou um pouco o lado tanque e utilitário para aprender a jogar com caçadores carregadores e rápidos, e hoje em dia domina o meta como poucos caçadores.","en_US":"","fr_FR":"<p>Thúlio « SirT » Carlos a vu passer au fil des ans de nombreux joueurs dans les rangs de paiN Gaming. Et à un moment donné, peut-être un peu après le Championnat brésilien de 2013 remporté par paiN, SirT a perdu sa motivation. Mais l'arrivée de deux joueurs coréens l'an dernier a permis de rallumer la flamme. Son jeu est à nouveau dans le rythme, et la synergie avec le nouveau top laner, Mylon, permet à SirT d'avoir de nouveau un impact sur les voies de à faire tourner les têtes.</p>","pl_PL":"<p>Thúlio „SirT” Carlos całe lata obserwował zmiany w zespole paiN Gaming – każdy rok przynosił nowe twarze. Gdzieś po drodze, prawdopodobnie po Mistrzostwach Brazylii w 2013 r., SirT stracił zapał do gry. Poczuł go znowu w zeszłym roku, gdy do zespołu dołączyło dwóch byłych reprezentantów Korei. Doskonale się dogaduje z walczącym w górnej alei Mylonem, a do tego jest świetnym strategiem, więc jego powrót wróży drużynie paiN same sukcesy.</p>","de_DE":"<p>Thúlio „SirT“ Carlos musste Jahr für Jahr mit anschauen, wie die Spieler von paiN Gaming sich die Klinke in die Hand gaben, jedes Jahr gab es neue Gesichter. Irgendwo auf halber Strecke, vielleicht kurz nach der brasilianischen Meisterschaft, verlor SirT seinen Antrieb. Doch durch den Zuwachs zweier ehemaliger koreanischen Spieler, kam auch SirTs Motivation wieder zurück. Mit seinem neuen, schnellen Makro-Spiel und seiner Zusammenarbeit zwischen ihm und dem neuen Top-Laner Mylon ist er wie neugeboren, und bereit, die Weltmeisterschaft aufzumischen. </p>","es_ES":"<p>Durante años, Thúlio “SirT” Carlos ha visto a multitud de jugadores ir y venir en paiN Gaming, cada temporada plagada de caras nuevas que, al poco tiempo, se volvían a ir. Y en algún punto en el camino, quizás un poco después de la victoria en el Brazilian Championship 2013, SirT perdió las ganas por competir. Aunque la incorporación de dos jugadores coreanos el año pasado hizo  despertar su motivación. Preparado de nuevo y con una sinergia total con su nuevo compañero en la calle superior Mylon, SirT tiene todo lo que necesita para ayudar a su equipo desde la jungla. </p>"},"foreignIds":{"TRLH3":"1001160087","TRLH4":"1001160087","drupalId":"4870","ESPORTSTMNT02":"200001674"},"socialNetworks":{"facebook":"https://www.facebook.com/ThuliosirT","twitter":"https://twitter.com/SirThulio","twitch":"https://www.twitch.tv/sirt"},"champions":[{"id":7,"playerId":419,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"},{"id":8,"playerId":419,"championId":59,"championKey":"JarvanIV","championName":"Jarvan IV","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"},{"id":9,"playerId":419,"championId":107,"championKey":"Rengar","championName":"Rengar","createdAt":"2015-05-13T21:11:51.000Z","updatedAt":"2017-06-14T22:21:58.000Z"}],"liveGameTeam":267},{"id":578,"slug":"pekin-woof","name":"Pekin Woof","firstName":"Isaac","lastName":" Marconis","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pekin-woof-eqae2nyp.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T22:24:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2001","ESPORTSTMNT02":"200000742","TRLH1":"200000288"},"socialNetworks":{},"champions":[],"liveGameTeam":267},{"id":666,"slug":"rf","name":"RF Legendary","firstName":"Oleksii","lastName":"Kuziuta","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rf-6o25dshw.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:12.000Z","updatedAt":"2017-03-08T20:07:05.000Z","bios":{"en_US":"","fr_FR":"<p>Oleksii « RF » Kuziuta (précédemment connu sous le nom de RF Legendary) a voleté sur la scène\n\nChallenger nord-américaine pendant plusieurs années avant d'entrer aux LCS NA en 2016 avec \n\nRenegades. La quantité de dégâts qu'il est capable d'infliger, notamment avec Rumble, fait de RF une \n\ncible prioritaire. Mais il refuse de tomber sans avoir combattu jusqu'au bout.</p>","pl_PL":"<p>Ten młody Ukrainiec, przed dołączeniem do LA Renegades w marcu 2015, był członkiem tylko w drugorzędnych zespołach.  Wiosenny sezon NA LCS 2016 będzie jego debiutem, aczkolwiek jest bardzo doświadczonym graczem, ponieważ oddaje się League of Legends od czasu wydania bety. W swoich pierwszych latach lubił grać Kog’mawem, lecz nie przyniosło mu to sławy. Zyskał uznanie w Kręgu Pretendenta za doskonałe opanowanie Nidalee. Sam wielokrotnie wyznawał swoją miłość do tej postaci, podkreślając, że kocha po równo wszystkie jej skiny. Spytany o powód wyboru właśnie Zwierzęcej Łowczyni odpowiada prosto: „Fajna do gry, fajna do oglądania, trudna do opanowania, ma wysoką szansę na ciekawe zagrania, a poza tym kto by nie chciał grać piękną dziewczyną z takim tańcem, która potrafi zamienić się w kota?” Aczkolwiek na top-lanie, w oczach przeciętnego gracza, nieziemsko radzi sobie każdym bohaterem. Do grona jego ulubionych postaci należy jeszcze Irelia i Renekton.</p>\n<p>\n\"RF Legendary\" jest znany z doskonałego kontaktu ze swoimi fanami. Nigdy ich nie zawodzi i zawsze odpowiada na ich pytania na portalach społecznościowych. Olbrzymie powodzenie wśród całego społeczeństwa League of Legends przyniósł mu film wrzucony do sieci, na którego stworzenie namówili go właśnie wielbiciele. W nim zaleca się do napotkanych w szkole dziewcząt i zachęca do wspólnego powrotu do domu. Przy tym, wymieniając swoje liczne zalety, wspomina, że osiągnął diament / krąg pretendenta w solo que. Śmiałość tego występu absolutnie pobiła rekordy oglądalności, ponieważ jego nagranie obejrzała zawrotna ilość widzów - ponad 500 tysięcy.</p>\n<p>\nW rozmowach z fanami wyjawił jak się czuje w związku z dostaniem się do NA LCS. \"RF Legendary\" grając w Challenger Series czuł się spełniony i szczęśliwy. Po kwalifikacji na szczebel wyżej jest zadowolony, że będzie miał okazję się wykazać na top-lanie i że inni gracze przestali uważać, że jest one-trick pony. Sam o sobie mówi, że jest marzycielem i miłośnikiem kawy. Dzięki temu, że Oleksii urodził się w Mariupolu, na Ukrainie, a dopiero potem przeniósł się do Stanów Zjednoczonych, potrafi mówić płynnie w trzech językach – ukraińskim, rosyjskim i angielskim. </p>\n"},"foreignIds":{"drupalId":"2567","ESPORTSTMNT02":"200000740","TRLH1":"200000286"},"socialNetworks":{"twitch":"http://www.twitch.tv/RfLegendary","youtube":"https://www.youtube.com/user/RFLegendary","facebook":"https://www.facebook.com/RFLegendarylol","twitter":"https://twitter.com/RF_Legendary"},"champions":[],"liveGameTeam":267},{"id":900,"slug":"baiano","name":"Baiano","firstName":"Gustavo","lastName":"Gomes","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/baiano-eiyzgkv9.png","hometown":"Bom Jesus da Lapa (BA)","region":"N/A","birthdate":"1994-04-09","createdAt":"2015-11-03T20:40:59.000Z","updatedAt":"2017-06-14T22:20:49.000Z","bios":{"pt_BR":"Antes de virar profissional, Baiano (ou Owning) era conhecido de longa data pelas filas ranqueadas, e chegou a cumprir um ano de suspensão pela prática de <em>elojob</em> antes de dar prosseguimento à sua carreira. O suporte tem uma visão de jogo apurada, e é quem normalmente faz as chamadas de jogadas da Keyd. Guerreiro, superou um tumor benigno no abdômen no começo de 2016 e retornou para ajudar a Keyd na campanha que culminou no vice-campeonato."},"foreignIds":{"ESPORTSTMNT02":"200000669","TRLH1":"200000291"},"socialNetworks":{"twitch":"","facebook":"https://www.facebook.com/owninglol","azubu":"http://www.azubu.tv/baiano","twitter":"https://twitter.com/baianolol1"},"champions":[{"id":356,"playerId":900,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"},{"id":357,"playerId":900,"championId":25,"championKey":"Morgana","championName":"Morgana","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"},{"id":358,"playerId":900,"championId":432,"championKey":"Bard","championName":"Bard","createdAt":"2016-05-17T19:31:13.000Z","updatedAt":"2017-06-14T22:20:49.000Z"}],"liveGameTeam":267},{"id":1161,"slug":"yoona","name":"Based Yoona","firstName":"Orlando","lastName":"Flota","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yoona-92tiw0of.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-02-13T14:08:30.000Z","updatedAt":"2017-06-07T21:56:12.000Z","bios":{"en_US":"","es_AR":"<p>Orlando 'YoonA' Flota es el tirador suplente de Counter Logic Gaming.</p>"},"foreignIds":{"TRLT3":"45027","TRLH1":"1001380113","TRLH2":"1001280083","ESPORTSTMNT02":"200002445"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":1300,"slug":"fragnat1c","name":"Fragnat1c","firstName":"Cole","lastName":"Gregory","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/fragnat1c-4fe0cohz.png","hometown":"NA","region":"NA LCS","birthdate":null,"createdAt":"2016-05-19T03:06:02.000Z","updatedAt":"2017-06-07T21:58:14.000Z","bios":{},"foreignIds":{"TRLH1":"1001300008","ESPORTSTMNT02":"200002446"},"socialNetworks":{},"champions":[],"liveGameTeam":268},{"id":1674,"slug":"fiku","name":"Fiku","firstName":"Noah","lastName":"Martin","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:37:14.000Z","updatedAt":"2017-03-08T20:07:47.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000668","TRLH1":"200000290"},"socialNetworks":{},"champions":[],"liveGameTeam":267}],"scheduleItems":[{"id":"AVx_dGQUoUG4HPFjOKVe","content":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:match:d2bb53f8-670c-4fbf-812d-1593f0532ab2","scheduledTime":"2017-06-16T00:00:00.046+0000","tags":{"blockLabel":"2","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:bracket:0b471bd2-8c29-42c1-b21e-b6c89f25b55e","leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec"},"match":"d2bb53f8-670c-4fbf-812d-1593f0532ab2","tournament":"885be032-14f9-45bc-bfae-71eecd0213ec","bracket":"0b471bd2-8c29-42c1-b21e-b6c89f25b55e","league":"4"}],"gameIdMappings":[{"id":"aa07e1e1-2c70-4a5a-9dca-2bd07f68d342","gameHash":"a0c476ad16e541b7"},{"id":"a103ff1e-997e-4c9a-8b41-93c21c18e5f2","gameHash":"b01ca4486d97b707"}],"videos":[{"id":7333,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:game:aa07e1e1-2c70-4a5a-9dca-2bd07f68d342","source":"https://www.youtube.com/embed/ubmVZWstW1c?wmode=transparent&rel=0","createdAt":"2017-06-16T01:45:25.000Z","updatedAt":"2017-06-16T01:45:25.000Z","game":"aa07e1e1-2c70-4a5a-9dca-2bd07f68d342"},{"id":7336,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:885be032-14f9-45bc-bfae-71eecd0213ec:game:a103ff1e-997e-4c9a-8b41-93c21c18e5f2","source":"https://www.youtube.com/embed/zSLpYpYttII?wmode=transparent&rel=0","createdAt":"2017-06-16T02:47:39.000Z","updatedAt":"2017-06-16T02:47:39.000Z","game":"a103ff1e-997e-4c9a-8b41-93c21c18e5f2"}],"htmlBlocks":[],"match":{"id":"d2bb53f8-670c-4fbf-812d-1593f0532ab2","name":"DFX-vs-BIG","position":14,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"},{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],"games":{"aa07e1e1-2c70-4a5a-9dca-2bd07f68d342":{"id":"aa07e1e1-2c70-4a5a-9dca-2bd07f68d342","name":"G1","generatedName":"BIG|DFX|G1|d2bb53f8670c4fbf812","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"},{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],"standings":{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497577544639,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497574332592,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"210290","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:210290","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"a103ff1e-997e-4c9a-8b41-93c21c18e5f2":{"id":"a103ff1e-997e-4c9a-8b41-93c21c18e5f2","name":"G2","generatedName":"BIG|DFX|G2|d2bb53f8670c4fbf812","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"},{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],"standings":{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497581022479,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497576911224,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"210299","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:210299","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c868075c-d503-4313-851c-c069c2f202f4":{"id":"c868075c-d503-4313-851c-c069c2f202f4","name":"G3","generatedName":"BIG|DFX|G3|d2bb53f8670c4fbf812","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"},{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497581022479,"source":"bestOf","history":[{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497577544639,"source":"bestOf","closed":true},{"result":[[{"roster":"4a8fad7f-2368-494b-9013-b6577a5eabc6"}],[{"roster":"d1a37047-a0de-4c98-a306-0c17c6f2f692"}]],"timestamp":1497576911225,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"4a8fad7f-2368-494b-9013-b6577a5eabc6":1,"d1a37047-a0de-4c98-a306-0c17c6f2f692":0}}}