{"teams":[{"id":343,"slug":"wind-and-rain","name":"Wind and Rain","guid":"5adbd960-6874-4d38-a219-c84d2469852b","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/wind-and-rain-7m7vximk.png","acronym":"WAR","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2017-06-06T21:48:23.000Z","updatedAt":"2017-07-30T12:48:21.000Z","bios":{},"foreignIds":{},"players":[222,231,244,388,816,1999,2000],"starters":[222,231,244,388,2000],"subs":[816,1999]},{"id":344,"slug":"red-bulls","name":"Team RB","guid":"05506392-acb6-46da-9ad2-23f4120ecf37","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-bulls-g5dlsqzb.png","acronym":"RB","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-bulls-2b49emvx.png","createdAt":"2017-06-06T21:59:19.000Z","updatedAt":"2017-08-06T14:56:40.000Z","bios":{},"foreignIds":{},"players":[206,538,1315,2001,2002,2003,2004],"starters":[206,538,1315,2001,2002],"subs":[2003,2004]}],"players":[{"id":206,"slug":"kasing","name":"KaSing","firstName":"Raymond","lastName":"Tsang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kasing-9lg4fzj5.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2017-08-06T14:36:59.000Z","bios":{"en_US":"<p>\nWith his charming accent and beaming smile, Raymond \"KaSing\" Tsang will brighten your day instantly. Unless of course you're going toe-to-toe against him in lane, then you're in for a world of stuns, hooks, and every other type of unpleasant lockdown imaginable. KaSing's entrance into H2K's lineup in 2015 was a catalytic moment, as the team bounded off to an eight-game win streak. One person who came out looking particularly good during this span was H2K’s AD carry Petter \"Hjarnan\" Freyschuss. When asked during an interview what accounted for the incredible numbers he was putting up during the win streak, he had only one thing to say -- \"KaSing\". KaSing flew into the open arms of Team Vitality in the 2015 offseason, joining a roster full of misfits from other squads -- including his old H2K teammate and bot lane partner Hjarnan. \n</p>\n<p>\nIn 2016 KaSing performed admirably on a Vitality squad laced with talent. It wasn’t enough to save the legendary partnership between KaSing and Hjarnan though, and to the disappointment of fans around the world, their seemingly unbreakable bond was severed as Hjarnan stepped down from his starting role. KaSing’s infectious positivity will be essential in developing his new laning partner, Hyeong-gi “Police” Park. If we’re to believe Hjarnan (and we should), Vitality is left in great hands.\n</p>","fr_FR":"<p>Avec son accent charmant et son sourire rayonnant, Raymond « kaSing » Tsang peut illuminer votre journée en un instant. À moins bien sûr que vous ne soyez sur le point de l'affronter sur une voie, car vous êtes bon dans ce cas pour une série d'étourdissements, d'accrochages et autres contrôles de foule déplaisants. L'arrivée de kaSing chez H2K a eu l'effet d'un catalyseur, et l'équipe est immédiatement partie sur une série de 8 victoires. L'un des joueurs qui a particulièrement brillé durant cette période fut le carry AD d'H2K, Petter « Hjarnan » Freyschuss. Quand on lui a demandé ce qui expliquait les incroyables résultats qu'il obtenait durant cette série, il n'avait qu'une seule réponse à donner : « kaSing ».</p>\n<p>kaSing a été recruté par Team Vitality durant l'intersaison 2015, où il rejoint une formation composée de marginaux venus d'autres équipes, dont son ancien partenaire chez H2K, Hjarnan. Son attitude positive sera essentielle pour aider VIT à intégrer tous ces nouveaux joueurs et à en faire une équipe soudée. « L'environnement de l'équipe est l'un des éléments les plus importants du jeu », aime-t-il déclarer. Ses compétences techniques et ses capacités de meneur de jeu, notamment avec Thresh, lui permettent pratiquement d'être le carry de l'équipe en jouant support. Mais c'est vraiment son attitude qui le différencie des autres supports. kaSing a été élu au sein de l'All Pro 2nd Team du segment d'été des LCS EU 2015 et il a été récompensé du titre de Meilleur joueur de la semaine 4 du même segment.</p>\n<p>Pendant son premier segment de printemps sous la bannière de l’équipe française Vitality, KaSing a montré un bon niveau de jeu mais n’est jamais parvenu à se distinguer de ses homologues. L’étincelle du KaSing des grands jours n’a pas montré le bout de son nez et l’élimination précoce de son équipe des play-offs n’a pas aidé. Mais le joueur n’a pas perdu sa bonne humeur pour autant et s’entraîne dur au quotidien pour s’adapter, le rôle de support n’étant plus forcément celui d’initiateur qu’il était auparavant ! Mais en ce début de segment d’été, les mages semblent reprendre du poil de la bête… ce qui pourrait signer un retour en force du joueur britannique, qui semble avoir une affection tout particulière pour les champions comme Bard et Karma. Depuis le retrait de Hjarnan, KaSing a le luxe d’avoir deux nouveaux joueurs pour l’accompagne sur sa voie. Il pourra ainsi trouver chaussure à son pied plus aisément, même s’il sera obligé de travailler deux fois plus, ce qui ne devrait pas être un problème pour un joueur qui ne manque pas d’abnégation.</p>","pl_PL":"<p>Angielski wspierający to naprawdę doświadczony zawodnik, pomimo że na najwyższym poziomie gra dopiero do półtora roku. W swojej karierze znajdował się w składach aż 16 zespołów i bardzo długo szukał swojego miejsca na scenie.</p>\n<p>\nCo ciekawe, pierwszą drużyną w karierze KaSinga było… H2k, z którym związał się we wrześniu 2012 roku. Potem przyszły epizody w Enemy eSports oraz myRevenge. Wtedy jeszcze Brytyjczyk występował pod nickiem YerrowStarr, ale postanowił zmienić na Yerrow, a nieco później na KaSing, ponieważ wielu ludzi w kolejce solowej brało go za jedno z kont Bory „YellOwStaRa” Kima. W tym czasie wspierający dołączył też do formacji Dexter is actually evil i wraz z nią podjął nieudaną próbę dostania się do EU LCS, po czym ponownie zmienił zespół. Tym razem padło na brytyjską ekipę British Tea Time, która szybko została przyjęta w szeregi organizacji Dignitas, zostając jej europejską dywizją. KaSing spędził tam pół roku, ale zawiedziony brakiem większych sukcesów odszedł do interesującego składu Steve Bakes Cookies, z którym rywalizował w EU Challenger Series, lecz największym sukcesem drużyny okazał się ćwierćfinał turnieju.</p>\n<p>\nTo nie zadowalało angielskiego zawodnika, który opuścił drużynę i w czerwcu 2014 roku związał się z ekipą RoughNex, jednak tam również nie odnalazł swojego miejsca. Przełomem okazała się oferta od Supa Hot Crew, które występowało w tym czasie w EU LCS. Co prawda Anglik grał w tym zespole tylko przez jeden split, ale spisywał się nieźle i to wystarczyło, by jego talent został dostrzeżony. Wkrótce wpłynęła oferta od występującego w EU Challenger Series i mającego duże aspiracje Gamers2, ale niedługo później KaSing dostał jeszcze lepszą propozycję – od H2k, które było beniaminkiem rozgrywek LCS.</p>\n<p>\nSupport nie wahał się długo i po raz drugi dołączył do tej ostatniej formacji, co okazało się to strzałem w dziesiątkę. W tym zespole KaSing spędził niemal rok i przez ten czas święcił swoje największe triumfy, a także zbudował sobie renomę znakomitego wspierającego. Brytyjczyk całkowicie odmienił oblicze formacji, która słabo rozpoczęła wiosenny split EU LCS 2015 i poprowadził ją do dwukrotnego zdobycia trzeciego miejsca w EU LCS oraz wyjazdu na Mistrzostwa Świata. KaSing znalazł się na podium niemal każdej klasyfikacji wśród supportów grających w EU LCS, ale triumfował tylko na jednym polu – co ciekawe, był najczęściej zabijającym wspierającym. Anglik został także uznany przez ekspertów za jednego z trzech najlepszych supportów w stawce, co potwierdziło głosowanie kibiców na reprezentantów Europy na All-Stars 2015. KaSing zajął w nim co prawda drugie miejsce, ale wskutek niedyspozycji YellOwStaRa wziął udział w rywalizacji.</p>\n<p>\nW listopadzie KaSing otrzymał ofertę od jednej z największych zachodnich organizacji – Teamu SoloMid. Brytyjczyk dołączył do formacji i wziął z nią udział w dość nieudanym IEM-ie w San Jose, jednak ostatecznie zawodnik i formacja nie doszli do porozumienia i wspierający nie podpisał kontraktu na wiosenny split. Nowego pracodawcy nie szukał długo – zdecydował się wziąć udział w interesującym projekcie całkowicie nowej na scenie League of Legends organizacji - Teamu Vitality, które zbudowało wokół KaSinga cały zespół na wiosenny split 2016.</p>\n<p>\nInteresujący jest fakt, że ulubioną postacią KaSinga, który jest przecież nominalnym wspierającym, jest LeBlanc. Anglik uwielbia też koty, anime oraz seriale telewizyjne. Ponadto nienawidzi pełnić roli supporta w kolejce solowej.\n</p>","de_DE":"<p>Mit Raymond „kaSing“ Tsang hat sich Vitality einen der besten Support-Spieler der letzten Saison angeln können. Damals war Raymond Tsang noch bei H2K tätig und hat hier mit Hjärnan immer wieder bewiesen, wie stark er auf Champions wie Thresh oder Braum ist. Ihm war es während des Spring Splits zu verdanken, dass das Team damals den Weg in die Weltmeisterschaft geschafft hat. Auch wenn KaSing erst in der vierten Woche zum Team stieß, reichte die Leistung von ihm und Hjärnan aus. </p>\n\n<p>Diese enorme Leistung brachten dem jungen Engländer nicht nur massig Fans, sondern auch einen Platz bei All-Star in Los Angeles im Jahr 2015. Er gilt als besonders ehrgeizig, bleibt dabei aber sehr sympathisch und überzeugt durch seine offene Art. </p>\n\n<i><p>„Ich wollte immer ein Pro-Spieler werden. Ich mag den Lebensstil – das Spielen, das Herumreisen. Es war und ist der Traum-Job eines jeden Fans.“ - Raymond „KaSing“ Tsang</p></i>\n\n<h2><p>Der aggressive Support-Spieler </p></h2>\n\n<p>Auch wenn Raymond sich selbst als aggressiven Support-Spieler bezeichnet, fiel er während der EU LCS Summer Playoffs vor allem durch seine sichere Spielweise auf. Damals besaß er die höchste KDA von allen Spielern im Turnier, weswegen er binnen kürzester Zeit zu den stärksten Supportern der Welt gezählt wurde. </p>\n\n<i><p>„Ich selbst würde mich als aggressiver Spieler bezeichnen, der aber genau weiß, wo die Grenzen vom aggressiven Spielen liegen.“ - Raymond „KaSing“ Tsang</p></i>\n\n<p>Trotz der enormen Beliebtheit, beschreiben ihn seine Mitspieler als bodenständig und freundlich. KaSing hat eine offene Art, die vor allem bei Mitspielern enorm gut ankommt. Er weiß, wie er seine Mitspieler motivieren muss, damit das Spiel noch einmal rumgerissen werden kann. KaSing selbst setzt nur wenig Wert auf Geld und Ruhm – er ist zu Vitality gekommen, um als Spieler besser zu werden. </p>\n\n<p>2016 wird das Ziel sein, dass Vitality es zu der Weltmeisterschaft schafft. KaSing hat bereits Erfahrungen auf diesem Level des kompetitiven Bereiches, weswegen er dem Team einen großen Nutzen bietet! </p>\n\n<h2><p>Interessante Fakten</p></h2>\n<p>•\tBeliebte Champions: Thresh, Braum, Anni  </p>\n<p>•\tBesaß die höchste KDA bei den EU und NA LCS Summer Playoffs</p>\n<p>•\tGehört zu den besten Supportern der Welt \n</p>\n","es_ES":"<p>Puede que en la actualidad Raymond ‘kaSing’ Tsang, cuya sonrisa de oro le está convirtiendo en el Magic Johnson de League of Legends, sea uno de los jugadores más populares y respetados de la LCS EU, pero hasta alcanzar este status el británico no lo ha tenido fácil.</p>\n\n<p>El apoyo ha pasado por trece equipos a lo largo de su carrera, una muestra de lo complicado que le ha resultado encontrar estabilidad en el ámbito competitivo. No sólo ha viajado de alineación en alineación, sino que ha vivido en Hong Kong y Berlín además de en Londres, su ciudad natal. De hecho, decidió hacer de su nombre chino su apodo ya que los aficionados le confundían con Bora ‘YellOwStaR’ Kim cuando usaba el alias con el que jugaba a DotA, ‘YerrowStar’.</p>\n\n<p>Esta considerable fluctuación de equipos puede achacarse a una posible falta de nivel en determinados momentos, pero no a su actitud. Incluso después de varios años sin lograr ningún hito deportivo y sin el apoyo de sus padres, la faz del londinense siempre presentaba una sonrisa. En ocasiones más que justificada, como en su debut en la LCS ante su público como sustituto de SUPA HOT CREW, la primera escuadra en la que permaneció durante más de tres meses.</p>\n\n<p>A pesar de la gran mejora experimentada en el split de verano de 2014, kaSing decidió unirse a Gamers2, una organización que aspiraba a acceder a la máxima competición desde la Challenger Series. Sin embargo, ni siquiera el Torneo de Expansión fue suficiente para la escuadra española, que no alcanzó su objetivo.</p>\n\n<p>Los malos resultados de H2K en el split de primavera de 2015 le proporcionaron a kaSing la oportunidad de regresar a la LCS. El impacto del apoyo no sólo fue inmediato, sino que revolucionó la liga al propulsar al equipo hacia una racha de ocho victorias consecutivas. Su habilidad como creador de jugadas, sobre todo con Thresh, quedó complementada con sus aportaciones comunicativas y, sobre todo, el buen ambiente que implementó en una alineación desmotivada con su comienzo en la liga.</p>\n\n<p>kaSing es un firme creyente de que la dinámica interna de una plantilla es uno de los grandes factores que influyen en la Grieta del Invocador, una teoría que le ha dado la razón en su paso por H2K. Aunque el equipo se quedó a las puertas de la final europea en ambos splits, los puntos acumulados le permitió participar en el Campeonato Mundial 2015 y medirse contra los mejores del planeta.</p>\n\n<p>Después de su primer gran año a nivel competitivo, kaSing probó suerte al otro lado del charco con Team SoloMid. La organización americana tenía un proyecto muy ambicioso, pero el británico prefirió firmar con Team Vitality ya que echaba mucho de menos Europa. Se trata de una nueva aventura, pero kaSing cuenta al menos con su fiel compañero de línea: Petter ‘Hjärnan’ Freyschuss, al cual considera uno de los mejores tiradores con los que ha jugado.</p>\n\n<p>Consolidado como uno de los mejores de su posición y reconocido internacionalmente en eventos como el All-Star, donde se metió al público en el bolsillo con su carisma, su objetivo es conquistar la liga, aunque para ello probablemente tenga que adaptar su estilo de juego a sus nuevos aliados. Lo que no cambiará, por desgracia para los comentaristas, es su tradición de escoger por unos segundos a Zilean en cada fase de selección de campeones.</p>","pt_BR":"<p>Se você encontrar kaSing na rota, pode se preparar para um festival de atordoamentos, ganchos e todo tipo de problema imaginável. A entrada dele na H2K foi fundamental, e o time logo conseguiu uma sequência de oito vitórias seguidas. Quem se destacou nesses jogos foi o atirador Hjarnan, e quando questionado sobre os motivos, ele foi bem claro: \"Graças ao kaSing\". \n</p>\n<p>\nEle teve um impacto positivo dentro de jogo também, com uma atitude positiva na química do time. \"O clima da equipe é uma das coisas mais importantes no jogo\", ele diz. Ele tem mecânicas robustas e é capaz de fazer boas jogadas, principalmente com Thresh.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">매력적인 억양과 환한 미소를 가진 Raymond \"kaSing\" Tsang 선수는 누구든 기분 좋게 하는 재주가 있습니다. 물론 라인에서 맞상대로 만난 게 아니라면 말이죠. .kaSing 선수는 적이라면 기절과 끌어당기기 등 온갖 기분 나쁜 수단을 동원해 손발을 묶어 버립니다. H2K에 kaSing 선수가 합류하자마자 팀은 8연승을 기록하며 승승장구했습니다. 그리고 이때 특히 뛰어난 기량을 보여줬던 선수가 원딜러인 Petter \"Hjarnan\" Freyschuss 선수였는데, 인터뷰에서 어떻게 연승 행진을 하는 동안 그렇게 뛰어난 기록을 냈느냐는 질문에 단 한 마디, “kaSing”으로 대답했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 시즌이 끝나자 kaSing 선수는 대서양을 건너가 서구의 강자가 한데 모인 TSM의 품에 안깁니다. 이 선수의 긍정적인 자세는 새 선수로 팀을 꾸려야 하는 TSM이 결속력을 다지는 데 큰 도움이 될 겁니다. kaSing 선수는 “팀 분위기야말로 경기에서 가장 중요한 부분이다”라고 말한 바 있죠. kaSing 선수의 탄탄한 피지컬과 플레이 메이킹 능력, 특히 쓰레쉬를 잡았을 때의 활약을 보면 서포터로서 팀을 캐리할 수 있으리라 예상합니다. 하지만 이 선수가 다른 서포터와 차별화되는 이유는 바로 자세에 있죠. kaSing 선수는 2015 유럽 LCS 서머 스플릿 올프로 2위 팀에 뽑혔고 4주차 MVP로 선정된 바 있습니다. </p>\n"},"foreignIds":{"drupalId":"1939","TRLH3":"1001220078","TRLH4":"200000474","TRLH1":"1001180011","TRLH2":"1001250064","FRA1TMNT2":"25482","ESPORTSTMNT02":"200002477"},"socialNetworks":{"twitch":"www.twitch.tv/kasinglol","facebook":"www.facebook.com/kasinglol","twitter":"https://twitter.com/kasinglol"},"champions":[],"liveGameTeam":344},{"id":222,"slug":"woolite","name":"Woolite","firstName":"Paweł","lastName":"Pruski","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/woolite-9s090cs8.png","hometown":"Poland","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:02.000Z","updatedAt":"2017-07-30T14:08:30.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1471","TRLH3":"1001000106","TRLH4":"200000326","FRA1TMNT1":"375386","TRNA1":"1000445254","TREU":"1000525069","ESPORTSTMNT02":"200001043"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":231,"slug":"aod","name":"AoD","firstName":"Alin-Ciprian","lastName":"Baltat","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/aod-96ntr0ly.png","hometown":"Timisoara","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-07-30T14:00:07.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"267","TRLH3":"200000229","TRLH4":"200000484"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":244,"slug":"dan","name":"Dan","firstName":"Daniel","lastName":"Hockley","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/dan-ex6b836p.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-07-30T13:55:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2915","FRA1TMNT1":"375391","ESPORTSTMNT02":"200002394","TRLH3":"200000283","TRLH4":"200000481"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":388,"slug":"jwaow","name":"Jwaow","firstName":"Jesper","lastName":"Strandgren","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/jwaow-8wwort3n.png","hometown":"Sweden","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-02-19T18:53:12.000Z","updatedAt":"2017-06-18T18:57:44.000Z","bios":{"en_US":"<p><span id=\"docs-internal-guid-8a6824ff-9b3a-22c0-0bfe-8f4bca178673\"><span>Jesper “Jwaow” Strandgren first rose to prominence while playing with Gamers2 in 2014 before eventually making his way into the LCS with MYM in 2015. Jwaow’s top lane skills created a lot of hype prior to his pickup by MYM, and he was seen as one of Europe’s best developing top laners. When MYM was relegated from the EU LCS after a dismal 2015 EU LCS Spring Split performance, Jwaow was picked up by Elements as their top laner. Known for his Irelia and Maokai picks, Jwaow brings a familar champion pool to the Elements squad.</span></span></p>"},"foreignIds":{"drupalId":"1458","TRLH3":"200000251","TRLH4":"200000303","FRA1TMNT1":"455028","TRNA1":"1000525378","TREU":"1000565106","ESPORTSTMNT02":"200000986"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":538,"slug":"sedrion","name":"Sedrion","firstName":"Tarik","lastName":"Holz","roleSlug":"adcarry","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/MOU-Sedrion-2015eucs.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-06T14:36:31.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1936","ESPORTSTMNT02":"200002476","TRLH4":"200000473"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":816,"slug":"arin1","name":"Arin1","firstName":"Arin","lastName":"Ali","roleSlug":"toplane","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_3.jpg","hometown":"Finland","region":null,"birthdate":null,"createdAt":"2015-07-14T22:59:45.000Z","updatedAt":"2017-07-30T15:10:01.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4734","TRLH4":"200000488"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":1315,"slug":"thai","name":"Thal","firstName":"Kwon-hyuk","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/thai-cs07fd1k.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-03T00:04:44.000Z","updatedAt":"2017-08-06T14:39:04.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"455039","ESPORTSTMNT02":"200002390","TRLH4":"200000470"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":1999,"slug":"kakan","name":"Kakan","firstName":"Elias","lastName":"Edlund","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kakan-caaunhdz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:39:00.000Z","updatedAt":"2017-07-30T14:03:27.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002395","TRLH4":"200000482"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":2000,"slug":"larssen","name":"Larssen","firstName":"Emil","lastName":"Larsson","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/larssen-3gkhvs5.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:47:28.000Z","updatedAt":"2017-07-30T14:10:57.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002383","TRLH4":"200000483"},"socialNetworks":{},"champions":[],"liveGameTeam":343},{"id":2001,"slug":"moojin","name":"MooJin","firstName":"Moo Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moojin-buliff0m.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:04:27.000Z","updatedAt":"2017-08-06T14:46:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002391","TRLH4":"200000471"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2002,"slug":"magifelix","name":"MagiFelix","firstName":"Felix","lastName":"Boström","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/magifelix-38otwdel.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:05:50.000Z","updatedAt":"2017-08-06T14:39:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002392","TRLH4":"200000472"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2003,"slug":"meleks","name":"Meleks","firstName":"Symeon","lastName":"Smejkal","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meleks-gep6ylg0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:07:12.000Z","updatedAt":"2017-08-06T14:43:02.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002478","TRLH4":"200000475"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2004,"slug":"lennart","name":"Lennart","firstName":"Lennart","lastName":"Kunz","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lennart-woydtqc.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:04:36.000Z","updatedAt":"2017-08-06T14:46:45.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002479","TRLH4":"200000476"},"socialNetworks":{},"champions":[],"liveGameTeam":344}],"scheduleItems":[{"id":"AVy2eYeIoUG4HPFjOKWo","content":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31:match:d6a5083e-1eff-4384-86f0-7931e91da523","scheduledTime":"2017-06-25T15:00:00.847+0000","tags":{"blockLabel":"2","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31:bracket:bf0dc88a-b3fa-41e0-9465-4f31868e36b8","leagueLabel":"urn:rg:lolesports:global:league:league:5","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31"},"match":"d6a5083e-1eff-4384-86f0-7931e91da523","tournament":"40b63df3-2e9d-49da-8793-7e2ff9265a31","bracket":"bf0dc88a-b3fa-41e0-9465-4f31868e36b8","league":"5"}],"gameIdMappings":[{"id":"0377be95-eef2-4cf4-8f5d-f401e101a014","gameHash":"ea918ec72b95a116"},{"id":"91f55ac1-a3a4-45d9-a83e-bb69b5832cce","gameHash":"4f27a2b804e192d4"}],"videos":[],"htmlBlocks":[],"match":{"id":"d6a5083e-1eff-4384-86f0-7931e91da523","name":"RB-vs-WAR","position":7,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"}],"games":{"91f55ac1-a3a4-45d9-a83e-bb69b5832cce":{"id":"91f55ac1-a3a4-45d9-a83e-bb69b5832cce","name":"G2","generatedName":"RB|WAR|G2|d6a5083e1eff438486f0","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"}],"standings":{"result":[[{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"}],[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}]],"timestamp":1498439495135,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"230372","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:230372","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0377be95-eef2-4cf4-8f5d-f401e101a014":{"id":"0377be95-eef2-4cf4-8f5d-f401e101a014","name":"G1","generatedName":"RB|WAR|G1|d6a5083e1eff438486f0","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"},{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}],"standings":{"result":[[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}],[{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"}]],"timestamp":1498439492398,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"220360","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:220360","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"51d08c2b-b6a6-4bef-a55e-0203ad5918d4"}]],"timestamp":1498439495135,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"0aa7f203-f1a0-435d-969d-a68b56c52d88":1,"51d08c2b-b6a6-4bef-a55e-0203ad5918d4":1}}}