{"teams":[{"id":185,"slug":"ember","name":"Ember","guid":"be71038e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/ember-4uu51lk6.png","acronym":"MBR","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-01-20T21:19:05.000Z","updatedAt":"2016-03-09T02:08:25.000Z","bios":{},"foreignIds":{},"players":[63,185,250,255,333,529,1105,1120],"starters":[185,250,333,529,1105],"subs":[63,255,1120]},{"id":186,"slug":"dream-team","name":"Dream Team","guid":"be7105b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"http://assets.lolesports.com/team/dream-team-57gx8jw7.png","acronym":"DT","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2016-01-20T22:26:10.000Z","updatedAt":"2017-01-27T16:20:45.000Z","bios":{},"foreignIds":{},"players":[225,272,563,578,774,779,1103,1121],"starters":[578,774,779,1103],"subs":[225,272,563,1121]}],"players":[{"id":63,"slug":"gleeb","name":"Gleeb","firstName":"Nicolas","lastName":"Haddad","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/gleeb-aa87xfc9.png","hometown":null,"region":"NA CS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2016-03-08T00:26:24.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1577","TRLH1":"1001270010","TRLH2":"1001200010","FRA1TMNT1":"375195"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":185,"slug":"santorin","name":"Santorin","firstName":"Lucas","lastName":"Larsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/santorin-irm97vii.png","hometown":"Denmark","region":"NA Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:12.000Z","updatedAt":"2017-06-14T23:17:17.000Z","bios":{"en_US":"<p>\nLucas “Santorin” Tao Kilmer Larsen took home 1st place in the NA LCS once with Team SoloMid. After a disappointing 2016 NA LCS Summer Split with NRG Esports, Santorin is giving it another go. When he isn’t winning trophies, Santorin’s well known for being one of the healthiest players in League. He’s constantly exercising and dieting. Throw in his dashing Danish good looks and friendly smile and watch the crowds swoon. \n</p>","fr_FR":"<p>Lucas « Santorin » Tao Kilmer Larsen pourrait bien être le joueur le plus resplendissant de santé des LCS nord-américaines. Il suit ainsi un régime strict et fait beaucoup d'exercice pour parvenir à atteindre un objectif mystique : « être en forme ». Ajoutez à cela son allure de beau gosse danois et son sourire amical, et le public est en émoi. On adore tous les beaux Danois.\n</p>\n<p>\nMais Santorin ne se contente pas d'être un tueur végétarien. Santorin s'est emparé du titre de meilleur espoir des LCS NA lors de ses débuts, avec un KDA de 6,6 très respectable au cours du Segment du printemps et, malgré sa réputation initiale de campeur de la voie du milieu, Santorin et TSM ont récemment décidé d'adopter une approche plus variée. « Si [Dyrus] m'appelle, je viens, et c'est comme ça qu'on essaie d'être meilleurs dans la partie, en utilisant aussi notre voie du haut », explique Santorin. Parfois, les solutions les plus simples sont les meilleures.\n</p>","pl_PL":"<p>Lucas „Santorin” Tao Kilmer Larsen jest prawdopodobnie najzdrowszym graczem w północnoamerykańskim LCS. Łączy ćwiczenia i ścisłą dietę, aby osiągnąć ten mistyczny stan zwany „byciem zdrowym”. Dodajmy do tego świetny wygląd i przyjacielski uśmiech i możemy podziwiać, jak tłumy mdleją. Wszyscy lubimy przystojnych Duńczyków.\n</p>\n<p>\nAle Santorin jest kimś więcej niż mordercą warzyw. Zdobył on nagrodę wyjątkowego początkującego podczas swojego debiutu w północnoamerykańskim LCS, osiągając stosunek zabić do zgonów wynoszący 6,6 podczas letniego split. Mimo tego, że zasłynął z czajenia się przy środkowej alei, Santorin i TSM ostatnio zróżnicowali swoje podejście do gry. Jak mówi Santorin: „Jeżeli Dyrus mnie wezwie, to do niego pójdę i w taki właśnie sposób chcemy stać się lepsi w grze – wykorzystując także górną aleję”. Czasami najprostsze rozwiązania naprawdę są najlepsze.\n</p>","de_DE":"<p>Lucas „Santorin“ Tao Kilmer Larsen könnte der gesündeste Spieler der NA LCS sein. Er vereint sportliche Tätigkeiten und strikte Diät halten, um ein mystisches Ziel zu erreichen, was sich „fit sein“ nennt. Werfen wir noch sein schneidiges, dänisches Aussehen und das freundliche Lächeln hinzu, fällt das weibliche Publikum schon beinahe in Ohnmacht. </p>\n\n<p>Aber Santorin ist nicht nur ein Veggie-Menü-Vertilger. Santorin angelte sich den „Outstanding Rookie Award“ der NA LCS in seiner ersten Saison mit einer respektablen KDA von 6,6 und das über den Verlauf der Frühlings Saison hinweg und seiner Bekanntheit in der Mid-Lane ein Zelt aufzuschlagen. Santorin und TSM haben sich angenähert und harmonieren besser. „Wenn Dyrus mich benötigt, dann komme ich auch und damit versuchen wir besser im Spiel zu werden, indem wir unsere Top-Lane ebenfalls einsetzen.“ Santorin meint dazu, dass manchmal die einfachen Lösungen auch die Besten sind. </p>\n","es_ES":"<p>Puede que Lucas “Santorin” Tao Kilmer Larsen sea el jugador más sano de la LCS NA. Mezcla ejercicio y una dieta estricta para conseguir ese objetivo mitológico que es “estar en forma”. Nacido en Dinamarca, embelesa al público con su elegante planta y su sonrisa amistosa. Ahora esto va de daneses.\n</p>\n\n<p>Pero Santorin es mucho más que una máquina de comer verduras. Santorin se ganó el premio al mejor novato en su debut en la LCS NA con un más que respetable 6.6 de KDA en el transcurso del Split de primavera. Y, aunque en sus inicios era conocido por emboscar constantemente a la calle central, ahora tanto TSM como su jungla titular han dado variedad a su juego. “Si Dyrus me llama, acudo, y así es como intentamos mejorar en el juego del equipo, usando también a nuestro top”, dice Santorin. A veces, las soluciones simples son las mejores. </p>\n","pt_BR":"<p>Lucas \"Santorin\" Tao Kilmer Larsen é provavelmente o jogador mais saudável da LCS NA. Ele combina exercícios físicos com uma rigorosa dieta alimentar para chegar a um místico objetivo conhecido como \"ser saudável\". Adicione o seu estilo dinamarquês e um sorriso amigável e veja a torcida se derreter. Resumindo: nós <a href=\"http://lolesports.com/articles/player-spotlight-danes-na-lcs\">amamos dinamarqueses</a>.\n</p>\n<p>\nMas Santorin é muito mais do que saudável. Ele conquistou o prêmio de Melhor Novato da LCS NA com um respeitoso A/M/A de 6,6 durante a Temporada de Primavera, e apesar de ser originalmente conhecido por acampar a rota do meio, Santorin e a TSM recentemente adaptaram uma aproximação mais variada. \"Se [Dyrus] me chamar, eu irei, e é assim que estamos tentando melhorar a equipe, utilizando as outras rotas também\", diz Santorin. Algumas vezes a solução mais simples é realmente a melhor.\n</p>"},"foreignIds":{"drupalId":"1873","ESPORTSTMNT02":"200000753","TRLH1":"200000300"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_santorin","facebook":"https://www.facebook.com/SantorinLoL","twitter":"https://twitter.com/SantorinLoL"},"champions":[],"liveGameTeam":185},{"id":225,"slug":"brokenshard","name":"Brokenshard","firstName":"Ram","lastName":"Djemal","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/brokenshard-7zfzy87g.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-12T20:13:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1145","TRLH1":"1001360010","TRLH2":"15080","FRA1TMNT1":"395029"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":272,"slug":"maplestreet","name":"Maplestreet","firstName":"Ainslie","lastName":"Wyllie","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/maplestreet-fmbty1b5.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:18.000Z","updatedAt":"2016-01-14T05:46:13.000Z","bios":{"en_US":"Ainslie “maplestreet8” Wyllie began playing League of Legends late in Season 2, eventually making his way to Team 8 in 2014.  While he’s most commonly known as the brother of TheOddOne, maplestreet8 has credentials that stretch far beyond family ties. Known for his outstanding Draven play, maplestreet8 has also recently developed a very strong Graves, earning a 5.11 KDA on The Outlaw in the 2015 NA LCS Spring Split.\r\n\r\nAinslie “maplestreet8” Wyllie is currently an AD Carry for Renegades in the NA Challenger Series and a substitute AD Carry for Team 8 in the NA LCS."},"foreignIds":{"drupalId":"336","TRLH1":"1001220131","TRLH2":"1001160181"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":333,"slug":"lod","name":"LOD","firstName":"Benjamin","lastName":"deMunck","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lod-2y6a7mwn.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-05-24T23:25:43.000Z","bios":{"en_US":"<p>Benjamin \"LOD\" deMunck tore apart the North American Challenger scene before making his way to the LCS with Team Envy in 2016. Team Envy enjoyed a passable first split, making it to the playoffs before being eliminated by Cloud9. As one of the new members on the revamped Team Dignitas lineup, LOD will have a lot to prove in 2017.</p>\n\n<p>LOD didn’t exactly run rampant in the LCS like some expected him to, but he performed admirably throughout the split. He looked especially good on carries like Sivir and Lucian, gunning through the opposition with ease. Let’s hope to see more of that as he looks to carry Dignitas towards their championship aspirations.</p>","de_DE":"Benjamin „LOD“ deMunck hat die nordamerikanische Challenger Series auf den Kopf gestellt, bevor er mit Team Envy 2016 erstmals in der LCS spielte. Team Envy spielte einen passablen ersten Split und erreichte die Entscheidungsspiele, musste sich dort aber Cloud9 geschlagen geben. LOD ist eines der neuen Mitglieder von Team Dignitas und muss sich 2017 beweisen.\n</p>\nLOD hat in der LCS zwar nicht die überragenden Leistungen abgeliefert, die einige von ihm erwartet hatten, dennoch war seine Vorstellung im Verlauf des Splits bewundernswert. Dabei machte er vor allem mit Carrys wie Sivir und Lucian, mit denen er seinen Gegnern keine Chancen ließ, eine gute Figur. Hoffentlich bekommen wir mehr davon zu sehen, wenn er in diesem Frühjahr versucht, Dignitas zu einem Titel zu führen!\n"},"foreignIds":{"drupalId":"1321","TRLH1":"200000195","TRLH2":"200000099"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":529,"slug":"solo","name":"Solo","firstName":"Colin","lastName":"Earnest","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/solo-7zw2f60c.png","hometown":"USA","region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-14T23:06:21.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2931","TRLH1":"200000299","ESPORTSTMNT02":"200000752"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":563,"slug":"papa-chau","name":"Papa Chau","firstName":"John","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/papa-chau-9zq8r0tz.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-03-08T20:01:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3002","ESPORTSTMNT02":"200000747","TRLH1":"200000297"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":578,"slug":"pekin-woof","name":"Pekin Woof","firstName":"Isaac","lastName":" Marconis","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pekin-woof-eqae2nyp.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-06-14T22:24:10.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2001","ESPORTSTMNT02":"200000742","TRLH1":"200000288"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":774,"slug":"akaadian","name":"Akaadian","firstName":"Matthew","lastName":"Higginbotham","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/akaadian-agev57ed.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T19:36:39.000Z","updatedAt":"2017-05-24T21:43:25.000Z","bios":{"en_US":"<p>Matthew \"Akaadian\" Higginbotham's hard work has finally paid off. Other than a brief NA LCS stint with Winterfox in 2015, Akaadian has bounced from team to team in the Challenger scene for almost two years. He made the NA CS playoffs twice in 2016, first with Team Liquid Academy and then with Dream Team. But both teams came up short of joining the LCS.</p>\n\n<p>Akaadian finally got his shot as an LCS starter with Echo Fox in 2017. He didn't waste it; Akaadian took the NA LCS by storm early in the spring split. Although Echo Fox failed to reach playoffs, Akaadian proved he's got what it takes to be one of the best junglers in North America.</p>","de_DE":"Matthew „Akaadian“ Higginbothams harte Arbeit hat sich endlich bezahlt gemacht. Abgesehen von einem Kurzaufenthalt in der NA LCS mit Winterfox im Jahr 2015, ist Akaadian eher dafür bekannt, in der Challenger-Szene von Team zu Team zu wechseln. Er hat es 2016 gleich zweimal in die Entscheidungsspiele der NA CS geschafft, zuerst mit Team Liquid Academy und anschließend mit Dream Team. Aber beide Teams haben es nicht geschafft, sich für die LCS zu qualifizieren.\n</p>\nAkaadian bekommt 2017 endlich die Chance, sich auf LCS-Ebene bei Echo Fox zu beweisen. Er muss schnell an der Synergie mit seinen neuen Teamkollegen arbeiten, besonders mit Veteran Froggen auf der mittleren Lane. Der Frühjahrs-Split der NA LCS 2017 steht unter dem Zeichen neuer Jungler-Talente – Contractz, Akaadians ehemaliger Gegner, hat den Sprung in die LCS ebenfalls geschafft. Auch wenn es Akaadian endlich in die höchste Liga geschafft hat, steht ihm das härteste Stück Arbeit noch bevor.\n"},"foreignIds":{"drupalId":"2556","TRLH1":"200000208","TRLH2":"200000112"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":186},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":185},{"id":1121,"slug":"bee-sin","name":"Bee Sin","firstName":"Keaton","lastName":"Cryer","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bee-sin-chntpicw.png","hometown":"","region":"N/A","birthdate":null,"createdAt":"2016-01-22T19:26:53.000Z","updatedAt":"2016-07-12T20:14:34.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375427","TRLH1":"1001360012"},"socialNetworks":{},"champions":[],"liveGameTeam":186}],"scheduleItems":[{"id":"AVJnQ41aJTrHluSI14Mk","content":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:match:d74ba8c4-68e0-4be9-ad69-9fb6f14676fb","scheduledTime":"2016-02-18T05:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:4","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3","blockLabel":"4","subBlockLabel":"1","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:bracket:808879a2-c11c-412f-9369-55e87c09e526"},"match":"d74ba8c4-68e0-4be9-ad69-9fb6f14676fb","tournament":"d35712b5-b3b9-4579-b88f-2b3999d9dda3","bracket":"808879a2-c11c-412f-9369-55e87c09e526","league":"4"}],"gameIdMappings":[{"id":"2ceaa7a6-b1c1-48d2-9337-52c33e891ad7","gameHash":"24873d3d9f8ff12e"},{"id":"7eb197bf-d097-43eb-99ac-635d8ca89c34","gameHash":"9f6f3d67ec3bee06"}],"videos":[{"id":918,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:7eb197bf-d097-43eb-99ac-635d8ca89c34","source":"https://www.youtube.com/embed/gkTgcq_K-vw?wmode=transparent","createdAt":"2016-02-18T07:17:58.000Z","updatedAt":"2016-02-18T07:17:58.000Z","game":"7eb197bf-d097-43eb-99ac-635d8ca89c34"},{"id":938,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:d35712b5-b3b9-4579-b88f-2b3999d9dda3:game:2ceaa7a6-b1c1-48d2-9337-52c33e891ad7","source":"https://www.youtube.com/embed/Od5cMvXCt_w?wmode=transparent","createdAt":"2016-02-18T22:15:10.000Z","updatedAt":"2016-02-18T22:15:10.000Z","game":"2ceaa7a6-b1c1-48d2-9337-52c33e891ad7"}],"htmlBlocks":[],"match":{"id":"d74ba8c4-68e0-4be9-ad69-9fb6f14676fb","name":"DT-vs-MBR","position":11,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],"games":{"2ceaa7a6-b1c1-48d2-9337-52c33e891ad7":{"id":"2ceaa7a6-b1c1-48d2-9337-52c33e891ad7","name":"G1","generatedName":"DT|MBR|G1|d74ba8c468e04be9ad69","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"},{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}],"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}]],"timestamp":1455770131193,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"910157","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:910157","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"7eb197bf-d097-43eb-99ac-635d8ca89c34":{"id":"7eb197bf-d097-43eb-99ac-635d8ca89c34","name":"G2","generatedName":"DT|MBR|G2|d74ba8c468e04be9ad69","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"},{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}]],"timestamp":1455773909511,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"910158","gameRealm":"FRA1TMNT1","platformId":"FRA1TMNT1:910158","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"5454d235-8c61-4d9a-ab84-2c08e2c54a99"}],[{"roster":"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf"}]],"timestamp":1455773909511,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"1bb0a6a4-a556-4a45-9b8c-7e7a6c3a66bf":0,"5454d235-8c61-4d9a-ab84-2c08e2c54a99":3}}}