{"teams":[{"id":129,"slug":"dire-wolves","name":"Dire Wolves","guid":"be6f059f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-670hnbxe.png","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/dire-wolves-7ka5aby3.png","acronym":"DW","homeLeague":"urn:rg:lolesports:global:league:league:13","altLogoUrl":null,"createdAt":"2015-09-22T01:39:36.000Z","updatedAt":"2017-06-06T05:03:48.000Z","bios":{"en_US":"<br>\n<a href=\"https://www.facebook.com/direwolvesgg/\" target=\"_blank\">Dire Wolves on Facebook</a>\n<br>\n<a href=\"https://twitter.com/direwolvesgg\" target=\"_blank\">Dire Wolves on Twitter</a>\n<br>\n<a href=\"https://store.direwolves.gg/\" target=\"_blank\">Dire Wolves Store</a>\n<br>\n<a href=\"https://www.hyvio.com/direwolves\" target=\"_blank\">Join the Wolfpack</a>","es_AR":"<p>Después de dos años de quedarse cortos en la OPL, los Dire Wolves por fin reclamaron su primer campeonato de liga. Después de unirse a la OPL en 2015, este equipo nunca había quedado en un lugar menor al cuarto o mejor que el segundo... hasta ahora. Su alineación mejorada demostró ser demasiado para su competencia, en gran parte gracias al regreso del tirador <strong>K1ng</strong>, y derrotaron a Legacy eSports 3-1 en la final de la OPL. Ahora están listos para ir al Mid-Season Invitational 2017, en donde estarán buscando reconocimiento internacional.</p>","de_DE":"Nachdem die Dire Wolves die OPL in den letzten beiden Jahren knapp nicht gewinnen konnten, hat es diesmal endlich gereicht. Die Mannschaft spielt seit 2015 in der OPL und belegte immer die Plätze vier, drei oder zwei – bis jetzt. Mit ihrer neuen Aufstellung und der Rückkehr des berühmten AD-Carrys K1ng waren sie für ihre Konkurrenten einfach eine Nummer zu groß, was sie auch im Finale der OPL bewiesen, in dem sie Legacy eSports 3–1 besiegten. Jetzt sind sie beim Mid-Season Invitational 2017 dabei, wo sie um internationale Anerkennung kämpfen werden.","es_ES":"Tras dos años quedándose a las puertas en la OPL, los Dire Wolves han ganado su primer campeonato de liga. Se unieron en 2015 a la OPL y, desde entonces, nunca han quedado por debajo del cuarto puesto, pero tampoco por encima del segundo... hasta ahora. Su nueva plantilla ha resultado ser demasiado fuerte para sus rivales; en gran parte, gracias al regreso de su ADC titular, K1ng. En la final de la OPL, vencieron 3 a 1 a Legacy eSports. Ahora, en el Mid-Season Invitational 2017, tendrán que luchar para ganarse el reconocimiento internacional.","fr_FR":"Après deux mauvaises années en OPL, les Dire Wolves ont enfin remporté leur premier championnat de League of Legends. Depuis son arrivée dans l'OPL en 2015, l'équipe n'avait jamais fait moins bien que 4e place ni mieux que la 2e place – jusqu'à maintenant. Avec leur nouvelle formation, les Dire Wolves n'ont fait qu'une bouché de la concurrence, en grande partie grâce au retour de la star ADC K1ng, et ont vaincu Legacy eSports à 3-1 lors de la finale de l'OPL. À présent, ils se préparent à disputer le Mid-Season Invitational 2017 et ils ont soif de reconnaissance internationale.","pl_PL":"Po dwóch latach, w których tak niewiele im brakowało, by podbić OPL, Dire Wolves nareszcie zdobyli swoje pierwsze mistrzostwo ligi. Po dołączeniu do OPL w 2015 roku drużyna nigdy nie zajęła pozycji gorszej niż czwarta, ani lepszej niż druga — aż do teraz. Odświeżony skład okazał się zbyt twardym orzechem do zgryzienia dla konkurencji — w dużej mierze dzięki powrotowi gwiazdorskiego prowadzącego, K1nga — i drużyna pokonała Legacy eSports 3-1 w finale OPL. Teraz czas na Mid-Season Invitational 2017, gdzie zamierzają zasłużyć na międzynarodowe uznanie.","pt_BR":"<p>Após dois anos morrendo na praia da OPL, os Dire Wolves finalmente venceram o seu primeiro campeonato. Após entrar para a OPL em 2015, a equipe terminou sempre no mínimo em quarto lugar, mas nunca acima do segundo... Até agora. Seu elenco reformulado provou estar acima dos competidores, em grande parte graças ao retorno do grande atirador, K1ng, e eles derrotaram a Legacy eSports na Final da OPL. Agora é a hora do Mid-Season Invitational 2017, quando eles estarão em busca de reconhecimento internacional.</p>"},"foreignIds":{},"players":[858,865,867,1072,1076,1100],"starters":[858,865,867,1076,1100],"subs":[1072]},{"id":168,"slug":"red-canids","name":"Red Canids","guid":"be70ded3-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-canids-9by71u8p.png","acronym":"RED","homeLeague":"urn:rg:lolesports:global:league:league:14","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-canids-3ci94wz2.png","createdAt":"2016-01-04T16:14:20.000Z","updatedAt":"2017-06-02T16:54:10.000Z","bios":{"pt_BR":"<p>A Red Canids teve uma jornada árdua até ganhar uma vaga definitiva no Mid-Season Invitational 2017. Anteriormente chamada de INTZ Red, a equipe teve pouco sucesso no CBLOL, terminando em 6º e 7º nas temporadas de verão e de inverno respectivamente. No entanto, a baixa temporada de 2016 trouxe grandes mudanças nos integrantes da equipe. Novos acréscimos incluíram o aclamado atirador brTT, da paiN Gaming, e o meio tockers, previamente da INTZ e-Sports. A nova seleção ficou em segundo na temporada regular e foi para as finais, onde a equipe derrotou a Keyd Stars em uma partida decisiva por 3-0. Como o time da casa no MSI 2017 no Rio, eles querem deixar o país orgulhoso e vão tentar provar seu valor no palco internacional.</p>\n\n<p>Técnico: Ram “Brokenshard” Djemal</p>\n\n\n<h2>Histórico em torneios oficiais</h2>\n<p>\n<ul class=\"esp-team-history\">\n<p><li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2017</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>1º lugar</strong> CBLoL - 1ª Etapa</li>\n    </ul>\n  </li>\n<br></p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2016</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>5º lugar</strong> CBLoL - 1ª Etapa</li>\n      <li><strong>7º lugar</strong> CBLoL - 2ª Etapa</li>\n    </ul>\n  </li>\n<br>\n<p>\n  <li class=\"esp-team-history__item\">\n    <h3 class=\"esp-team-history__item__title\">2015</h3>\n    <ul class=\"esp-team-history__item__achievements\">\n      <li><strong>1º lugar</strong> Série de Promoção - 1ª Etapa (INTZ Red)</li>\n      <li><strong>6º lugar</strong> CBLoL - 2ª Etapa (INTZ Red)</li>\n      <li><strong>1º lugar</strong> Série de Promoção - 2ª Etapa (INTZ Red)</li>\n      <li><strong>5-8º lugar</strong> CBLoL - Pós-Temporada (INTZ Red)</li>\n    </ul>\n  </li>\n</ul>","en_US":"<p>The Red Canids have overcome a rocky history to convincingly earn a spot at the 2017 Mid-Season Invitational. Formerly INTZ Red, the team initially saw little success in the CBLOL, finishing 5th and 7th in summer and winter, respectively. The 2016 offseason brought massive roster changes. New additions included paiN Gaming’s acclaimed ADC brTT, as well as mid laner Tockers, formerly of INTZ e-Sports. The new roster finished second in the regular season and went on to the finals, where they defeated Keyd Stars in a decisive 3-0 match. As Brazil’s home team for MSI 2017, they’ll look to do their country proud and prove themselves on the international stage.</p>\n\n<p>Coach: Ram “Brokenshard” Djemal</p>","es_AR":"<p>Los Red Canids han superado una escabrosa historia para ganar sin duda alguna su lugar en el Mid-Season Invitational 2017. Antes llamados INTZ Red, el equipo tuvo poco éxito al principio en el CBLOL, terminando en 6&deg; y 7&deg; lugares en verano e invierno, respectivamente. La temporada baja del 2016 trajo consigo un cambio masivo en sus alineaciones. Se incluyeron nuevos miembros en el equipo, como el aclamado tirador <strong>brTT</strong>, así como a <strong>Tockers</strong> en el carril central, antes miembro de INTZ e-Sports. La nueva alineación terminó en segundo lugar en la temporada regular y fue a las finales, donde venció a Keyd Stars con un decisivo 3 a 0. Como el equipo local de Brasil para el MSI 2017, se esforzarán por enorgullecer a su país y probarse a sí mismos en el escenario internacional.</p>","de_DE":"Der Weg war steinig, aber Red Canids konnte überzeugen und sich einen Platz beim Mid-Season Invitational 2017 sichern. Die Mannschaft, die früher als INTZ Red bekannt war, hatte anfangs Probleme in der CBLOL und beendete die letzten beiden Splits auf dem 6. und 7. Platz. In der Nebensaison 2016 gab es jede Menge Veränderungen an der Aufstellung. Zu den Neuzugängen gehören brTT, der umjubelte AD-Carry von paiN Gaming, sowie der ehemalige Mid-Laner von INTZ e-sports, tockers. Die neu formierte Mannschaft beendete die reguläre Saison auf dem zweiten Platz und bahnte sich ihren Weg ins Finale, wo sie die Keyd Stars mit 3–0 besiegten. Die Brasilianer haben beim MSI 2017 in Rio de Janeiro Heimvorteil und werden alles geben, um ihr Land auf der internationalen Bühne stolz zu machen.","en_AU":"","fr_FR":"Les Red Canids ont connu une histoire tumultueuse mais ils s'en sont sorti en réussissant à décrocher leur billet pour le Mid-Season Invitational 2017. Anciennement connue sous le nom INTZ Red, l'équipe a connu, au départ, un succès limité en CBLOL avec une 6e place lors du segment d'été, puis une 7e place lors du segment d'hiver. Au cours de l'intersaison 2016, la formation a subi de nombreux changements. L'ADC de paiN Gaming, le célèbre brTT, ainsi que l'ancien mid-laner d'INTZ e-Sports, Tockers, ont rejoint l'effectif. La nouvelle formation a terminé deuxième de la saison régulière et a pu accéder à la finale, un match épique lors duquel elle a vaincu Keyd Stars avec un score de 3-0. En tant que représentants du Brésil pour le MSI 2017 à Rio de Janeiro, les Red Canids auront à cœur de faire la fierté de leur pays et de démontrer leur niveau sur la scène internationale.","es_ES":"Red Canids ha superado un historial de obstáculos y se ha hecho con un merecido puesto en el Mid-Season Invitational 2017. El equipo, antes conocido como INTZ Red, no obtuvo buenos resultados en la CBLOL en sus inicios, con un sexto y séptimo puesto en el split de verano y de invierno, respectivamente. Durante la pretemporada 2016, la plantilla sufrió un cambio radical. Fichó a jugadores como el aclamado ADC de paiN Gaming, brTT, así como a tockers, el que fuera mid de INTZ e-Sports. La nueva plantilla quedó segunda en la temporada regular y llegó hasta la final, en la que vencieron 3-0 a Keyd Stars en un enfrentamiento decisivo. Como representante de Brasil en el MSI 2017, Red Canids intentará que su país se sienta orgulloso y se pondrá a prueba en el escenario internacional.","pl_PL":"Red Canids w przekonujący sposób pozbyli się etykietki żółtodziobów, dostając się do Mid-Season Invitational 2017. Występująca wcześniej pod nazwą INTZ Red drużyna miała początkowo trudny start w CBLOL ostatecznie zajmując 6 miejsce w sezonie letnim i 7 w zimowym. Po sezonie 2016 roku w składzie drużyny zaszły głębokie zmiany. Nowe nabytki to przejęty z paiN Gaming osławiony prowadzący brTT, a także środkowy tockers z INTZ e-Sports. W nowym składzie drużyna zajęła drugie miejsce podczas sezonu zasadniczego, dostając się do finału, w którym pokonała Keyd Stars podczas rozstrzygającego meczu z wynikiem 3−0. Jako lokalna drużyna z Brazylii podczas MSI 2017 w Brazylii będą chcieli walczyć o honor swojego kraju i sprawdzić się na międzynarodowej arenie."},"foreignIds":{},"players":[421,422,428,465,471,474,1113],"starters":[421,422,428,465,471],"subs":[474,1113]}],"players":[{"id":421,"slug":"brtt","name":"brTT","firstName":"Felipe","lastName":"Gonçalves","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/brtt-5ae8cs6q.png","hometown":"Rio de Janeiro - RJ","region":"CBLOL Brazil","birthdate":"1991-02-19","createdAt":"2015-05-13T21:17:03.000Z","updatedAt":"2017-05-30T22:06:56.000Z","bios":{"pt_BR":"<p>Pode-se dizer que Felipe \"brTT\" Gonçalves é o Doublelift brasileiro. E ele provavelmente diria que o Doublelift é o brTT norte-americano. Lenda do CBLOL, brTT fez seu nome com jogadas chamativas e balacas próprias durante o seu período na paiN Gaming. Seu Campeão favorito é o Draven, e, vendo ele jogar, dá para entender rapidinho o porquê. Ele nunca perde a oportunidade de ganhar a adoração de seus muitos fãs brasileiros. brTT vai voltar ao palco internacional no MSI frente a uma torcida conterrânea no Rio de Janeiro. Bem-vindos ao League do brTT.</p>\n","en_US":"<p>You might say Felipe “brTT” Gonçalves is the Doublelift of Brazil. He’d probably tell you Doublelift is the brTT of North America. A legend of the CBLOL, brTT made a name for himself with his flashy plays and signature bravado during his time on paiN Gaming. His favorite champion is Draven; watching him play, you’ll quickly understand why. He never backs down from an opportunity to gain the adoration of his many Brazilian fans. He’ll make his return to the international stage at MSI in front of a home crowd. Welcome to the League of brTT.</p>","fr_FR":"Felipe « brTT » Gonçalves est en quelque sort le Doublelift du Brésil. Et il vous dirait probablement que Doublelift est le brTT d'Amérique du Nord. Véritable légende du CBLOL, brTT s'est forgé un nom par ses actions spectaculaires et ses bravades caractéristiques lorsqu'il jouait pour paiN Gaming. Son champion favori est Draven et en le regardant jouer, vous comprendrez rapidement pourquoi. Ce joueur ne manque jamais une opportunité de briller devant ses nombreux fans brésiliens. Il fera son grand retour sur la scène internationale au MSI, sous les encouragements de son public au Brésil. Bienvenue dans League of brTT.\n\n","pl_PL":"Można powiedzieć, że Felipe „brTT” Gonçalves to Doublelift Brazylii. On pewnie powiedziałby, że Doublelift to brTT Ameryki Północnej. Zanim stał się legendą CBLOL, brTT zyskał sobie sławę dzięki efektownym zagrywkom i charakterystycznej brawurze podczas gry z paiN Gaming. Jego ulubionym bohaterem jest Draven, a patrząc na jego grę, szybko zorientujecie się dlaczego. Nigdy nie cofa się przed okazją zdobycia uznania swoich licznych brazylijskich fanów. Z pewnością będzie chciał z fasonem wrócić na międzynarodową scenę MSI na oczach rzeszy kibiców w Brazylii. Witamy w League of brTT","de_DE":"Würde man behaupten, dass Felipe „brTT“ Gonçalves der Doublelift von Brasilien ist. Würde er wahrscheinlich antworten, dass Doublelift der brTT von Nordamerika ist. brTT ist eine Legende der CBLOL und hat sich während seiner Zeit bei paiN Gaming mit seinem auffälligen Spielstil und seiner angeberischen Art einen Namen gemacht. Sein Lieblingschampion ist Draven und wenn man ihm zusieht, weiß man auch schnell, warum. Er lässt keine Gelegenheit aus, sich die Anerkennung seiner vielen brasilianischen Fans zu sichern. Beim diesjährigen MSI wird er vor heimischem Publikum auf die internationale Bühne zurückkehren. Willkommen zu League of brTT.\n","es_ES":"Podría decirse que Felipe ''brTT'' Gonçalves es el Doublelift brasileño. Él seguramente os diría que Doublelift es el brTT de Norteamérica. brTT es una leyenda de la CBLOL que se ha ganado una reputación gracias a sus increíbles jugadas y al estilo bravucón que le caracterizó durante su época en paiN Gaming. Su campeón favorito es Draven. Entenderéis por qué si lo veis jugar con él. Nunca pierde la oportunidad de recibir la adoración de sus numerosos fans brasileños. Volverá a pisar el escenario internacional en el MSI, con sus compatriotas como público en Brasil. Bienvenidos a League of brTT","es_AR":"<p>Se podría decir que <strong>Felipe \"brTT\" Gonçalves</strong> es el <strong>Doublelift</strong> de Brasil. Él tal vez te diga que <strong>Doublelift</strong> es el <strong>brTT</strong> de Norteamérica. <strong>brTT</strong>, una leyenda de CBLOL, se ganó su renombre con sus jugadas llamativas y su bravata característica durante tu época en paiN Gaming. Su campeón favorito es Draven. Al verlo jugar entenderán por qué. Nunca rechaza una oportunidad para ganarse la adoración de sus muchos seguidores brasileños. Regresará al escenario internacional del MSI frente de una audiencia local. Bienvenidos a League of <strong>brTT</strong>.</p>","en_PL":""},"foreignIds":{"TRLH3":"1001160089","TRLH4":"1001160089","drupalId":"4872","TRLT3":"200000013"},"socialNetworks":{"facebook":"https://www.facebook.com/felipebrTT","twitter":"https://twitter.com/brttOficial","twitch":"https://www.twitch.tv/brtt"},"champions":[{"id":13,"playerId":421,"championId":119,"championKey":"Draven","championName":"Draven","createdAt":"2015-05-13T21:18:17.000Z","updatedAt":"2017-05-30T22:06:55.000Z"},{"id":15,"playerId":421,"championId":29,"championKey":"Twitch","championName":"Twitch","createdAt":"2015-05-13T21:18:17.000Z","updatedAt":"2017-05-30T22:06:55.000Z"},{"id":428,"playerId":421,"championId":429,"championKey":"Kalista","championName":"Kalista","createdAt":"2016-05-17T23:10:13.000Z","updatedAt":"2017-05-30T22:06:55.000Z"}],"liveGameTeam":168},{"id":422,"slug":"dioud","name":"Dioud","firstName":"Hugo","lastName":"Padioleau","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dioud-fybalb23.png","hometown":"Barbechat - França","region":"CBLOL Brazil","birthdate":"1990-03-11","createdAt":"2015-05-13T21:18:42.000Z","updatedAt":"2017-05-30T22:09:35.000Z","bios":{"pt_BR":"<p>Hugo \"Dioud\" Padioleau é o responsável pelo suporte à agressão do brTT na rota inferior para a Red Canids. O francês juntou-se à paiN Gaming em 2015, quando jogou com brTT pela primeira vez. Quando ele entrou na Red Canids em 2016, brTT logo fez o mesmo. Para combinar com o estilo de jogo do atirador de sua equipe, ele é conhecido por seus suportes de ataque com o Thresh e o Blitzcrank. Inclusive, Dioud foi retratado como o Grande Golem a Vapor no <strong><a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">papel de parede oficial do CBLoL de 2015.</a></strong></p>","en_US":"<p>Hugo “Dioud” Padioleau is the man tasked with supporting brTT’s aggression in the bot lane for Red Canids. The Frenchman joined paiN Gaming in 2015, where he laned with brTT for the first time. When he joined Red Canids in 2016, brTT soon followed. To match his ADC’s playstyle, he’s known for his offensive supports like Thresh and Blitzcrank. In fact, he was portrayed as the Great Steam Golem in the official CBLOL wallpaper for 2015.</p>","fr_FR":"<Hugo « Dioud » Padioleau est le joueur dont le rôle est de soutenir les agressions de brTT dans la voie du bas pour Red Canids. Ce français a intégré paiN Gaming en 2015 et c'est dans cette équipe qu'il s'est associé à brTT pour la première fois. Il a rejoint les Red Canids en 2016 et brTT l'a suivi peu après. Pour s'accorder au style de jeu de son ADC, il utilise des supports offensifs comme Thresh et Blitzcrank. Dioud a été représenté en Golem de vapeur sur le fond d'écran officiel du CBLOL 2015. ","pl_PL":"Można powiedzieć, że Felipe „brTT” Gonçalves to Doublelift Brazylii. On pewnie powiedziałby, że Doublelift to brTT Ameryki Północnej. Zanim stał się legendą CBLOL, brTT zyskał sobie sławę dzięki efektownym zagrywkom i charakterystycznej brawurze podczas gry z paiN Gaming. Jego ulubionym bohaterem jest Draven, a patrząc na jego grę, szybko zorientujecie się dlaczego. Nigdy nie cofa się przed okazją zdobycia uznania swoich licznych brazylijskich fanów. Z pewnością będzie chciał z fasonem wrócić na międzynarodową scenę MSI na oczach rzeszy kibiców w Brazylii. Witamy w League of brTT","de_DE":"Hugo „Dioud“ Padioleau ist der Mann, der brTT auf RED Canids’ unteren Lane unterstützen soll. Der Franzose wechselte 2015 zu paiN Gaming, wo er das erste Mal auf brTT traf. Als er 2016 zu RED Canids wechselte, dauerte es nicht lange, bis ihm brTT folgte. Diouds Spielweise passt perfekt zum Spielstil seines AD-Carrys und er ist dafür bekannt, bevorzugt offensive Supporter wie Thresh und Blitzcrank zu spielen. Auf dem offiziellen Bildschirmhintergrund der CBLOL 2015 stellte er sogar den großen Dampfgolem dar. ","es_ES":"Hugo ''Dioud'' Padioleau es el encargado de ayudar a brTT en sus jugadas agresivas en la calle inferior. El francés se unió a paiN Gaming en 2015, donde jugó como dúo de brTT por primera vez. Cuando se unió a Red Canids en 2016, brTT no tardaría en seguirlo. Para encajar con el estilo de juego de su ADC, Dioud es famoso por jugar con apoyos ofensivos como Thresh y Blitzcrank. De hecho, lo retrataron como el Gran Gólem de Vapor en el fondo de pantalla oficial de la CBLOL 2015. ","es_AR":"<p><strong>Hugo \"Dioud\" Padioleau</strong> es el encargado de apoyar la agresión de <strong>brTT</strong> en el carril inferior de los Red Canids. El francés se unió a paiN Gaming en 2015 cuando jugó con <strong>brTT</strong> por primera vez. Cuando se unió a los Red Canids en el 2016, <strong>brTT</strong> lo siguió poco después. En concordancia con el estilo de juego de su tirador, se le conoce por sus soportes ofensivos como Thresh y Blitzcrank. Incluso lo representaron como el Gran Gólem de Vapor en el <a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">poster oficial del CBLOL 2015</a>.</p>","en_PL":""},"foreignIds":{"TRLH3":"1001160090","TRLH4":"1001160090","drupalId":"200","TRLT3":"200000014"},"socialNetworks":{"facebook":"https://www.facebook.com/Dioudy","twitter":"https://twitter.com/Dioudlol","twitch":"www.twitch.tv/Dioudlol","youtube":"https://www.youtube.com/channel/UCOLZUkTcdFrg1aiwSr8TAmw"},"champions":[{"id":17,"playerId":422,"championId":40,"championKey":"Janna","championName":"Janna","createdAt":"2015-05-13T21:20:45.000Z","updatedAt":"2017-05-30T22:09:35.000Z"},{"id":18,"playerId":422,"championId":412,"championKey":"Thresh","championName":"Thresh","createdAt":"2015-05-13T21:20:45.000Z","updatedAt":"2017-05-30T22:09:35.000Z"},{"id":398,"playerId":422,"championId":53,"championKey":"Blitzcrank","championName":"Blitzcrank","createdAt":"2016-05-17T21:34:41.000Z","updatedAt":"2017-05-30T22:09:35.000Z"}],"liveGameTeam":168},{"id":428,"slug":"nappon","name":"Nappon","firstName":"Carlos","lastName":"Henrique Rücker","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nappon-axrfoxrj.png","hometown":"Três Passos - RS","region":"CBLOL Brazil","birthdate":"1994-06-04","createdAt":"2015-05-13T22:18:33.000Z","updatedAt":"2017-05-30T22:04:45.000Z","bios":{"pt_BR":"Carlos \"Nappon\" Henrique Rücker é um caçador veterano do CBLoL. Nappon, membro antigo da CNB e-Sports Club, entrou na equipe renovada dos Red Canis em 2017. Seu Campeão mais utilizado até agora foi o Kha’Zix, mas ele é um dos mais conhecidos jogadores brasileiros do Lee Sin e inclusive foi retratado como o Monge Cego no <strong><a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">papel de parede oficial do CBLoL de 2015</a></strong>. Sua mecânica vai ter que ser de primeira se ele quiser competir com os melhores do mundo no MSI.","en_US":"<p>Carlos “Nappon” Henrique Rücker is a veteran jungler of the CBLOL. The longtime CNB e-Sports Club member found himself on Red Canid’s revamped roster for 2017. His most played champion for 2017 so far has been Kha’Zix, but he’s one of Brazil’s most well-known Lee Sin players. He was even portrayed as the Blind Monk on the official CBLOL wallpaper for 2015. His mechanics will have to be top notch if he hopes to compete with the world’s best at MSI.</p>","es_AR":"<p><strong>Carlos \"Nappon\" Henrique Rücker</strong> es un junglero veterano del CBLOL. El antiguo miembro de CNB e-Sports Club se encuentra en la alineación mejorada de Red Canid para el 2017. El campeón que más ha utilizado en el 2017 ha sido Kha'Zix, pero es uno de los jugadores brasileños de Lee Sin más conocidos. Incluso lo representaron como el Monje Ciego en el <a href=\"http://news.cdn.leagueoflegends.com/public/riot-bra/esports/lolesportsbr/julho-2015/1920x1080.jpg\" target=\"_blank\">poster oficial del CBLOL 2015</a>. Su estrategia tendrá que ser perfecta si espera competir contra los mejores del mundo en el MSI.</p>","de_DE":"Carlos „Nappon“ Henrique Rücker ist ein erfahrener Jungler der CBLOL. Das langjährige Mitglied von CNB e-Sports Club wechselte 2017 zu RED Canids. 2017 war Kha’Zix sein meistgespielter Champions, aber er ist auch einer der besten „Lee Sin“-Spieler Brasiliens. Auf dem offiziellen Bildschirmhintergrund der CBLOL 2015 war er sogar als der blinde Mönch abgebildet. Seine Mechaniken müssen erstklassig sein, wenn er sich beim MSI mit den Besten der Welt messen will.","fr_FR":"Carlos « Nappon » Henrique Rücker est un jungler vétéran du CBLOL. Ce membre de longue date de CNB e-Sports Club s'est retrouvé dans la nouvelle formation Red Canids pour l'année 2017. Jusqu'à présent, son champion favori en 2017 est Kha'Zix, mais il fait également partie des joueurs de Lee Sin les plus célèbres au Brésil. Nappon a d'ailleurs été représenté en moine aveugle sur le fond d'écran officiel du CBLOL 2015. Il devra maîtriser parfaitement ses mécaniques s'il veut rivaliser avec les meilleurs joueurs mondiaux au MSI.","en_PL":"","es_ES":"Carlos ''Nappon'' Henrique Rücker es un jungla veterano de la CBLOL. Fue miembro durante mucho tiempo de CNB e-Sports Club, hasta que se sumó a la renovada plantilla de Red Canids en 2017. Su campeón más jugado este año ha sido Kha'Zix, pero es uno de los jugadores de Lee Sin más famosos de Brasil. Incluso lo retrataron como al Monje Ciego en el fondo de pantalla oficial de la CBLOL 2015. Tendrá que sacar el mayor rendimiento a sus mecánicas si quiere competir contra los mejores del mundo en el MSI.","pl_PL":"Carlos „Nappon” Henrique Rücker gra jako dżungler i jest weteranem CBLOL. Ten wieloletni członek CNB e-Sports Club w 2017 roku znalazł się w odnowionym składzie Red Canids. Jak do tej pory najczęściej wykorzystywanym przez niego bohaterem w 2017 r. był Kha’Zix, ale ogólnie jest najbardziej znanym brazylijskim zawodnikiem grającym Lee Sinem. Został nawet sportretowany jako Ślepy Mnich na oficjalnej tapecie CBLOL w 2015 roku. Jeśli chce dorównać najlepszym na świecie podczas MSI, będzie musiał wznieść się na szczyty swoich umiejętności mechanicznych."},"foreignIds":{"TRLT3":"200000012"},"socialNetworks":{"azubu":"","facebook":"https://www.facebook.com/carlosnappon","twitter":"https://twitter.com/nappon_","twitch":"http://www.twitch.tv/napponzera"},"champions":[{"id":25,"playerId":428,"championId":64,"championKey":"LeeSin","championName":"Lee Sin","createdAt":"2015-05-13T22:19:50.000Z","updatedAt":"2017-05-30T22:04:45.000Z"},{"id":217,"playerId":428,"championId":76,"championKey":"Nidalee","championName":"Nidalee","createdAt":"2016-01-15T21:34:07.000Z","updatedAt":"2017-05-30T22:04:45.000Z"},{"id":462,"playerId":428,"championId":203,"championKey":"Kindred","championName":"Kindred","createdAt":"2016-05-18T19:19:18.000Z","updatedAt":"2017-05-30T22:04:45.000Z"}],"liveGameTeam":168},{"id":465,"slug":"tockers","name":"tockers","firstName":"Gabriel","lastName":"Claumann","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/tockers-isxstfmn.png","hometown":"Santa Cruz do Sul - RS","region":"CBLOL Brazil","birthdate":"1996-08-21","createdAt":"2015-05-14T00:51:15.000Z","updatedAt":"2017-05-30T22:21:21.000Z","bios":{"pt_BR":"<p>Gabriel \"tockers\" Claumann é a imagem da consistência na rota do meio. Mesmo nas derrotas, o jogador dá o melhor de si sempre e nem precisa de abates; ele consegue se estabelecer no jogo matando tropas e garantindo objetivos com o restante da equipe. No seu período como membro da INTZ e-Sports Club, ele era considerado um dos melhores meios no CBLoL. Tockers vai se unir ao restante dos Red Canids para representar seu país no MSI no Rio de Janeiro.</p>","en_US":"<p>Gabriel “tockers” Claumann is the picture of consistency in the mid lane. Even in losses, he can be counted on to perform. And he doesn’t even need kills; he can build leads from creep kills and securing objectives with the rest of his team. During his time with INTZ e-Sports Club, he was considered one of the best laning mids in the CBLOL. He’ll be joining the rest of the Red Canids as they represent their country at MSI.</p>","de_DE":"Gabriel „Tockers“ Claumann ist die personifizierte Beständigkeit auf der mittleren Lane. Selbst bei Niederlagen spielt er meistens in Topform. Und er braucht nicht einmal Tötungen. Ihm reichen Vasallentötungen und Ziele, um sich einen Vorteil zu erarbeiten. Während seiner Zeit bei INTZ e-Sports Club galt er als einer der besten Mid-Laner der CBLOL. Er wird sein Land zusammen mit dem Rest von RED Candis beim MSI in Brasilien repräsentieren.","es_AR":"<p><strong>Gabriel \"tockers\" Claumann</strong> es la imagen de la consistencia en el carril central. Incluso en las derrotas, puedes contar con él. Ni siquiera necesita asesinatos, puede obtener ventaja a partir de matar súbditos y asegurar objetivos con el resto de su equipo. Mientras formó parte de INTZ e-Sports Club, se le consideró uno de los mejores carrileros centrales en el CBLOL. Se unirá con el resto de los Red Canids cuando representen a su país en el MSI.</p>","es_ES":"Gabriel ''tockers'' Claumann es la viva imagen de la regularidad en la calle central. Incluso en las derrotas, su buen rendimiento está garantizado. Ni siquiera necesita asesinatos; es capaz de conseguir la ventaja a costa de asesinar monstruos y asegurar objetivos con el resto de su equipo. Durante su paso por INTZ e-Sports Club, se le consideró uno de los mejores mid de la CBLOL. Se unirá al resto de Red Canids para representar a su país en el MSI de Brasil.","fr_FR":"Gabriel « Tockers » Claumann incarne la régularité sur la voie du milieu. Même dans les défaites, son équipe peut toujours compter sur son talent. Tockers n'a pas besoin d'accumuler les éliminations : il peut construire son avance sur la destruction des sbires et sécuriser les objectifs avec son équipe. Au sein d'INTZ e-Sports Club, il était considéré comme l'un des meilleurs mid-laners du CBLOL. Il rejoindra l'effectif des Red Canids qui représentera le Brésil lors du MSI à domicile.","en_PL":"","pl_PL":"Gabriel „tockers” Claumann niezmiennie świetnie spisuje się na środkowej alei. Nawet w przegranych meczach daje znakomite pokazy gry. Nie musi nawet sam zdobywać zabójstw, potrafi budować przewagę dzięki zabitym stworom, aby realizować cele we współpracy z drużyną. W czasach INTZ e-Sports Club był uważany za jednego z najlepszych środkowych CBLOL. Razem z pozostałymi członkami Red Canids będzie reprezentował gospodarzy podczas MSI w Brazylii."},"foreignIds":{"TRLH1":"1001380138","TRLH2":"1001280108","TRLT3":"200000079"},"socialNetworks":{"azubu":"http://www.azubu.tv/tockers","facebook":"https://www.facebook.com/tockers.lol","twitter":"https://twitter.com/tockerslol"},"champions":[{"id":85,"playerId":465,"championId":34,"championKey":"Anivia","championName":"Anivia","createdAt":"2015-05-14T00:52:47.000Z","updatedAt":"2017-05-30T22:21:21.000Z"},{"id":87,"playerId":465,"championId":238,"championKey":"Zed","championName":"Zed","createdAt":"2015-05-14T00:52:47.000Z","updatedAt":"2017-05-30T22:21:21.000Z"},{"id":233,"playerId":465,"championId":4,"championKey":"TwistedFate","championName":"Twisted Fate","createdAt":"2016-01-15T22:21:56.000Z","updatedAt":"2017-05-30T22:21:21.000Z"}],"liveGameTeam":168},{"id":471,"slug":"robo","name":"Robo","firstName":"Leonardo","lastName":"Souza","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/robo-904dzlb5.png","hometown":"São Paulo - SP","region":"CBLOL Brazil","birthdate":"1998-04-22","createdAt":"2015-05-14T13:35:41.000Z","updatedAt":"2017-05-30T22:15:32.000Z","bios":{"pt_BR":"Leonardo \"Robo\" Souza controla a rota superior para os Red Canids. Robo era um dos membros originais da INTZ Red quando a equipe foi formada em 2015, mas saiu do time antes de ganharem o nome de Red Canids. Por causa do estilo agressivo do caçador e da rota inferior da equipe, Robo costuma ser designado como tanque na rota superior. Durante a temporada regular de CBLoL, ele foi invicto com Maokai e Shen.","en_US":"<p>Leonardo “Robo” Souza anchors the top lane for Red Canids. Robo was one of the original members of INTZ Red when the team formed in 2015, but he departed the team before it was renamed to Red Canids. With the aggressive playstyles of his jungler and bot lane, Robo is often tasked with playing tanks in the top lane. During the CBLOL regular season, he was undefeated on Maokai and Shen.</p>","es_AR":"<p><strong>Leonardo \"Robo\" Souza</strong> está en el carril superior de los Red Canids. <strong>Robo</strong> fue uno de los miembros originales de INTZ Red cuando se formó el equipo en 2015, pero lo abandonó antes de que lo renombraran como Red Canids. Con los agresivos estilos de juego de su junglero y su carril inferior, <strong>Robo</strong> a menudo tiene que ser el tanque en el carril superior. Durante la temporada regular de CBLOL, salió invicto con Maokai y Shen.</p>","de_DE":"Leonardo „Robo“ Souza ist RED Canids’ Top-Laner. Robo war bei der Gründung von INTZ Red im Jahr 2015 dabei, verließ die Mannschaft aber wieder, bevor sie in RED Candis umbenannt wurde. Durch den aggressiven Spielstil seines Junglers und der unteren Lane muss Robo auf der oberen Lane häufig einen Tank spielen. Während der regulären Saison der CBLOL verlor er mit Maokai und Shen kein einziges Spiel","fr_FR":"Leonardo « Robo » Souza joue sur la voie du haut pour les Red Canids. Robo était l'un des membres d'origine d'INTZ Red quand l'équipe s'est formée en 2015, mais il l'avait quittée avant qu'elle ne prenne le nom de Red Canids. Son jungler et sa voie du bas ayant un jeu agressif, Robo est souvent chargé de jouer les tanks sur la voie du haut. Lors de la saison régulière du CBLOL, il a été invaincu avec Maokai et Shen","es_ES":"Leonardo ''Robo'' Souza es el responsable de la calle superior de Red Canids. Robo era uno de los miembros originales de INTZ Red cuando el equipo se creó en 2015, pero se marchó antes de que fuese renombrado como Red Canids. Debido al estilo de juego agresivo de su jungla y su dúo de la calle inferior, Robo suele necesitar jugar con tanques en la calle superior. Durante la temporada regular de la CBLOL, quedó invicto con Maokai y Shen.","en_PL":"","pl_PL":"Leonardo „Robo” Souza zabezpiecza w Red Canids górną aleję. Robo należał do oryginalnego składu INTZ Red, gdy drużyna formowała się w 2015 roku, ale opuścił ją, zanim przyjęła nazwę Red Canids. Ze względu na agresywny styl gry dżunglera i dolnego, Robo często ma za zadanie odgrywanie roli obrońcy na górnej alei. Podczas podstawowego sezonu CBLOL był niepokonany, grając Maokaiem i Shenem."},"foreignIds":{"TRLT3":"200000011"},"socialNetworks":{"azubu":"http://www.azubu.tv/robolol","facebook":"https://www.facebook.com/roobolol","twitter":"https://twitter.com/robolol1"},"champions":[{"id":167,"playerId":471,"championId":245,"championKey":"Ekko","championName":"Ekko","createdAt":"2015-11-04T12:14:28.000Z","updatedAt":"2017-05-30T22:15:31.000Z"},{"id":352,"playerId":471,"championId":222,"championKey":"Jinx","championName":"Jinx","createdAt":"2016-05-17T19:24:08.000Z","updatedAt":"2017-05-30T22:15:31.000Z"}],"liveGameTeam":168},{"id":474,"slug":"sacyr","name":"Sacy","firstName":"Gustavo","lastName":"Rossi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sacyr-k4sbrmb.png","hometown":"Jundiaí - SP","region":"CBLOL Brazil","birthdate":"1997-12-02","createdAt":"2015-05-14T13:39:40.000Z","updatedAt":"2017-05-31T00:19:57.000Z","bios":{"pt_BR":"SacyR tem aparições constantes desde 2013, mas parte disso no cenário semi-profissional. Quando finalmente conseguiu chegar à elite, o atirador contou com a sua surpreendente regularidade para atuar ao lado de diversos suportes e manter o alto nível de jogo. Especialista em atiradores de <em>late game</em>, SacyR busca ganhar cada vez mais espaço e despontar no CBLoL em um meta complicado para sua posição.","en_US":""},"foreignIds":{},"socialNetworks":{"azubu":"http://www.azubu.tv/sacylol","facebook":"https://www.facebook.com/sacyadc","twitter":"https://twitter.com/sacylol"},"champions":[{"id":169,"playerId":474,"championId":222,"championKey":"Jinx","championName":"Jinx","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"},{"id":170,"playerId":474,"championId":119,"championKey":"Draven","championName":"Draven","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"},{"id":171,"playerId":474,"championId":67,"championKey":"Vayne","championName":"Vayne","createdAt":"2015-11-04T12:21:35.000Z","updatedAt":"2017-05-31T00:19:57.000Z"}],"liveGameTeam":168},{"id":858,"slug":"destiny","name":"Destiny","firstName":"Mitchell","lastName":"Shaw","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/destiny-h3hdrfj.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:09:07.000Z","updatedAt":"2017-07-14T04:16:04.000Z","bios":{"en_US":"<p>Mitchell “Destiny” Shaw is the support for the OPL’s Dire Wolves. He joined the OPL in 2015 as a support, then role swapped to ADC for the 2016 season. He returned to his original role on Dire Wolves to start the 2017 season. As a former carry player, he sometimes brings that playstyle to support-- he went undefeated in five games on Zyra. He’s also an excellent Nami player when the situation calls for it. He’ll need to be flexible in his champion picks if he wants his team to have the best shot at earning a spot in groups at the 2017 Mid-Season Invitational in Brazil.</p>","es_AR":"<p><strong>Mitchell \"Destiny\" Shaw</strong> es el soporte de los Dire Wolves de la OPL. Se unió a la OPL en 2015 como soporte, pero cambió de papel a tirador para la temporada 2016. Regresó a su papel original en los Dire Wolves al comienzo de la temporada 2017. Como ex tirador, a veces utiliza ese estilo de juego como soporte... salió invicto de cinco partidas con Zyra. Además, es un excelente jugador con Nami cuando la situación lo amerita. Tendrá que ser flexible al escoger a su campeón si quiere que su equipo tenga la mejor oportunidad para ganarse un lugar en la fase de grupos en el Mid-Season Invitational 2017 en Río.</p>","pl_PL":"Mitchell „Destiny” Shaw jest wspierającym Dire Wolves z OPL. W 2015 r. dołączył do OPL jako wspierający, a potem zmienił rolę na prowadzącego w ciągu sezonu 2016. Jednak z początkiem sezonu 2017 powrócił do swojej pierwszej roli w Dire Wolves. Jako były prowadzący czasami wykorzystuje ten styl gry we wsparciu — był niepokonany w pięciu grach Zyrą. Jest także świetnym graczem Nami, gdy wymaga tego sytuacja. Będzie musiał być elastyczny w doborze bohaterów, jeśli chce zapewnić swojej drużynie największe szanse na zdobycie miejsca w grupach podczas Mid-Season Invitational 2017 w Brazylii.","fr_FR":"Mitchell « Destiny » Shaw est le support des Dire Wolves. Il a rejoint l'OPL en 2015 en tant que support, avant de devenir ADC lors de la saison 2016. Il a finalement retrouvé son rôle original chez les Dire Wolves au début de la saison 2017. Son expérience en tant que carry influence parfois son style de jeu en support – il est resté invaincu pendant cinq parties avec Zyra. C'est également un excellent joueur avec Nami lorsque la situation le requiert. Il devra être flexible dans ses choix de champions s'il veut que son équipe ait une chance de décrocher une place lors de la phase de groupe du Mid-Season Invitational 2017 au Brésil.","es_ES":"Mitchell ''Destiny'' Shaw es el apoyo de Dire Wolves. Se unió a la OPL en 2015 como apoyo, pero pasó a jugar como ADC en la temporada 2016. Al comienzo de la temporada 2017 volvió a su rol original con Dire Wolves. Como antiguo carry, aporta parte de ese estilo de juego al rol de apoyo (consiguió mantenerse cinco partidas invicto con Zyra). También es un gran jugador de Nami cuando la situación así lo requiere. Tendrá que ser flexible en su selección de campeones si quiere que su equipo tenga una oportunidad de llegar a la fase de grupos en el Mid-Season Invitational 2017 de Brasil","de_DE":"Mitchell „Destiny“ Shaw ist der Supporter der Dire Wolves. Er begann seine Karriere in der OPL im Jahr 2015 als Supporter, schlüpfte in der Saison 2016 aber in die Rolle des AD-Carrys. Zu Beginn der Saison 2017 übernahm er dann bei den Dire Wolves wieder seine ursprüngliche Rolle. Als ehemaliger Carry legt er auch seine Rolle als Supporter manchmal sehr offensiv an – er schaffte es, mit Zyra fünf Siege ungeschlagen zu bleiben. Außerdem kann er auch mit Nami hervorragend umgehen, wenn es die Situation erfordert. Er wird bei der Championwahl flexibel sein müssen, wenn er mit seiner Mannschaft einen Platz in der Gruppenphase des Mid-Season Invitational 2017 in Brasilien ergattern will.","pt_BR":"<p>Mitchell \"Destiny” Shaw é o suporte dos Dire Wolves da OPL. Ele entrou para a OPL em 2015 como suporte, depois trocou de função para Atirador na temporada 2016. Ele retomou sua função original na Dire Wolves no início da temporada 2017. Como ex-carregador, às vezes ele traz esse estilo de jogo para o suporte; ele passou invicto em cinco jogos como Zyra. E também joga muito bem como Nami quando a situação exige. Ele terá de ser flexível na sua escolha de Campeões se quiser que a sua equipe tenha a chance de avançar no Mid-Season Invitation 2017.</p>"},"foreignIds":{"TRNA1":"1000435440","ESPORTSTMNT03":"200000501","TRLT3":"200000044"},"socialNetworks":{"twitter":"https://twitter.com/DestinyOCE"},"champions":[],"liveGameTeam":129},{"id":865,"slug":"k1ng","name":"k1ng","firstName":"Calvin","lastName":"Truong","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/k1ng-9bm5nq5c.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:32:17.000Z","updatedAt":"2017-07-14T05:22:55.000Z","bios":{"en_US":"<p>Calvin “k1ng” Truong is the star ADC for Dire Wolves. He’s one of the best ADC player in the OPL, and he knows it-- he joined in the league in 2014 under the name “BEST AD.” The 19-year-old left Dire Wolves for a year to play with Legacy eSports, but returned to start the 2017 season. He dominated on lethality-based carries like Varus and Jhin during the regular season, earning a 6.43 KDA that was second best among OPL ADCs. His skills on more traditional ADCs will be tested when he steps onto the international stage for the first time in Brazil.</p>","en_AU":"After spending a year in the much vaunted Legacy system, k1ng has returned home for a real chance to win it all. There are few players in Oceania with a mechanical ceiling as high as k1ng's, and he's in the perfect environment to show it off.","es_AR":"<p><strong>Calvin \"K1ng\" Truong</strong> es el tirador estrella de los Dire Wolves. Es uno de los mejores tiradores de la OPL y lo sabe... se unió a la liga en 2014 con el nombre <strong>\"BEST AD\"</strong>. El chico de 19 años dejó a los Dire Wolves por un año para jugar con Legacy eSports, pero regresó al comienzo de la temporada 2017. Dominó la temporada regular con tiradores basados en letalidad como Varus y Jhin, consiguiendo un KDA de 6.43, el segundo mejor de entre los tiradores de la OPL. Sus habilidades con tiradores más tradicionales se pondrán a prueba en Brasil, cuando suba al escenario internacional por primera vez.</p>","de_DE":"Calvin „K1ng“ Truong ist der Star-AD-Carry der Dire Wolves. Er ist einer der besten AD-Carrys der OPL, und das weiß er auch – 2014 spielte er noch unter dem Namen „BEST AD“. Der 19-jährige verließ die Dire Wolves, um ein Jahr lang bei Legacy eSports zu spielen, kehrte zu Beginn der Saison 2017 aber wieder zu den Wolves zurück. Während der regulären Saison dominierte er mit Carrys wie Varus und Jhin und war mit einer TTU von 6,43 der zweitbeste AD-Carry der OPL. Auf der internationalen Bühne in Brasilien wird er beweisen müssen, dass er auch mit traditionellen AD-Carrys überzeugen kann.","es_ES":"Calvin ''K1ng'' Truong es el famoso ADC de Dire Wolves. Es uno de los mejores ADC de la OPL, y lo sabe. Se unió a la liga en 2014 con el nombre ''BEST AD'' (''El mejor AD''). Este jugador de 19 años dejó Dire Wolves durante un año para jugar con Legacy eSports, pero volvió a comienzos de la temporada 2017. Durante la temporada regular, ha dominado con carries de letalidad como Varus y Jhin, lo que le ha hecho conseguir un A/M/A de 6,43 puntos y le ha colocado como segundo mejor ADC de la OPL. Sus habilidades con los ADC más tradicionales serán puestas a prueba cuando se suba al escenario internacional por primera vez en Brasil.","fr_FR":"Calvin « K1ng » Truong est la star ADC des Dire Wolves. Il est l'un des meilleurs ADC de l'OPL et il se sait : il a intégré le championnat en 2014 sous le pseudo « BEST AD ». Ce joueur de 19 ans a quitté les Dire Wolves pendant un an pour jouer avec Legacy eSports, mais il est revenu au début de la saison 2017. Pendant la saison régulière, il a dominé avec des carrys basés sur la létalité comme Varus et Jhin, ce qui lui a permis d'établir un KDA de 6,43 faisant de lui le deuxième meilleur ADC de l'OPL. Ses compétences avec des ADC plus traditionnels vont maintenant être mises à l'épreuve alors qu'il monte pour la première fois sur la scène internationale au Brésil.","pl_PL":"Calvin „K1ng” Truong to gwiazdorski prowadzący Dire Wolves. Jest jednym z najlepszych prowadzących w OPL i wie o tym — dołączył do ligi w 2014 roku pod pseudonimem „BEST AD”. Ten dziewiętnastolatek opuścił Dire Wolves na rok, by grać z Legacy eSports, ale wrócił z początkiem sezonu 2017. Dominował podczas sezonu zasadniczego, grając opierającymi się na destrukcji prowadzącymi, takimi jak Varus i Jhin, i zdobywając Z/Z/A 6,43 — drugi wynik wśród prowadzących OPL. Jego umiejętności gry bardziej tradycyjnymi prowadzącymi zostaną poddane próbie, gdy po raz pierwszy wkroczy na międzynarodową arenę w Brazylii.","pt_BR":"<p>Calvin \"K1ng” Truong é o principal atirador dos Dire Wolves. Ele é um dos melhores Atiradores na OPL e sabe disso; ele entrou para a liga em 2014 com o nome \"BEST AD”. O jogador de 19 anos deixou a Dire Wolves por um ano para jogar pela Legacy eSports, mas voltou para o início da temporada 2017. Ele dominou com carregadores baseados em Letalidade, como Varus e Jhin, durante a temporada regular, ficando com 6,43 de AMA, segundo melhor entre os Atiradores da OPL. Suas habilidades com Atiradores mais tradicionais serão testadas quando ele passar ao estágio internacional pela primeira vez.</p>"},"foreignIds":{"TRNA1":"1000435426","TRSA1":"465235","ESPORTSTMNT03":"200000426","TRLT3":"200000090"},"socialNetworks":{"twitter":"https://twitter.com/k1ngyb"},"champions":[],"liveGameTeam":129},{"id":867,"slug":"perfection","name":"Phantiks","firstName":"Richard","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/perfection-b62yqjy0.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2015-09-22T02:36:13.000Z","updatedAt":"2017-07-14T04:19:15.000Z","bios":{"en_US":"<p>Richard “Phantiks” Su forms the second half of the Dire Wolves aggressive jungle-mid duo. Phantiks has held down the mid lane for the Dire Wolves since 2015. He’ll pick an assassin whenever the situation allows it; his favorite champions include Kassadin, Fizz and Zed. But he’s equally capable on more traditional mages, which allowed him to lead OPL mid laners with a KDA of 4.94 during the regular season. In his first international appearance at the 2017 Mid-Season Invitational, he’ll have to be careful that his aggression isn’t punished by some of the best mid laners in the world.</p>","en_AU":"Along with Swiffer, Phantiks is perhaps Oceania's most complete mid laner -- but he hasn't been able to translate his raw skill into major success just yet. The rest of the field is catching up with him, but that just might be what he needs to reach the next level.","es_AR":"<p><strong>Richard \"Phantiks\" Su</strong> conforma la segunda mitad del agresivo dúo junglero/central de los Dire Wolves. <strong>Phantiks</strong> defiende el carril central para los Dire Wolves desde el 2015. Escoge un asesino cuando la situación lo permite; sus campeones favoritos incluyen a Kassadin, Fizz y Zed. Pero es igual de eficaz con magos más tradicionales, lo que le ha permitido ser el mejor carrilero medio de la OPL con un KDA de 4.94 durante la temporada regular. En su primera aparición en el Mid-Season Invitational 2017, tendrá que tener cuidado de que su agresividad no sea castigada por algunos de los mejores carrileros centrales del mundo.</p>","pl_PL":"Richard „Phantiks” Su tworzy drugą połowę agresywnego duetu dżungla-środek w Dire Wolves. Broni środkowej alei dla Dire Wolves od 2015 roku. Gdy tylko pozwala mu na to sytuacja, wybiera zabójcę; do jego ulubionych bohaterów należą Kassadin, Fizz i Zed. Równie dobrze jednak radzi sobie, grając bardziej tradycyjnymi magami, co pozwoliło mu znaleźć się na szczycie środkowych OPL z Z/Z/A 4,94 w sezonie zasadniczym. Podczas swojego pierwszego międzynarodowego występu na Mid-Season Invitational 2017 będzie musiał uważać, aby jego agresja nie została ukrócona przez któregoś z najlepszych środkowych na świecie.","fr_FR":"Richard « Phantiks » Su constitue la deuxième moitié de l'agressif duo jungler-midlaner des Dire Wolves. Phantiks tient la voie du milieu pour l'équipe depuis 2015. Il choisit un assassin dès que la situation le permet et ses champions favoris incluent Kassadin, Fizz et Zed. Mais il est également très compétent avec des mages plus traditionnels, ce qui lui a permis de prendre la tête du classement midlaner de l'OPL avec un KDA de 4,94 pendant la saison régulière. Pour sa première apparition internationale au Mid-Season Invitational 2017, il devra éviter que son agressivité ne soit punie par les meilleurs midlaners du monde.","es_ES":"Richard ''Phantiks'' Su es la otra mitad del agresivo dúo jungla-mid de Dire Wolves. Phantiks ocupa el rol de la calle central en Dire Wolves desde 2015. Siempre que la situación lo permite, opta por jugar con asesinos, y sus campeones favoritos son Kassadin, Fizz y Zed. Sin embargo, es igual de bueno con magos tradicionales, lo que le ha permitido destacar entre los mid de la OPL con un A/M/A de 4,94 puntos durante la temporada regular. En su primera aparición internacional en el Mid-Season Invitational 2017, tendrá que tener cuidado para que su agresividad no sea castigada por algunos de los mejores mids de todo el mundo.v","de_DE":"Richard „Phantiks“ Su ist die zweite Hälfte des erfolgreichen Dschungel-Mitte-Duos der Dire Wolves. Phantiks kümmert sich schon seit 2015 um die mittlere Lane der Dire Wolves. Wenn möglich spielt er am liebsten Assassinen, weshalb Kassadin, Fizz und Zed auch zu seinen Lieblingschampions gehören. Er kann aber genauso gut mit traditionellen Magiern umgehen, was er mit einer TTU von 4,94 während der regulären Saison der OPL unter Beweis stellte. Bei seinem ersten internationalen Auftritt beim Mid-Season Invitational 2017 muss er aufpassen, dass seine Aggressivität nicht von den besten Mid-Lanern der Welt bestraft wird.","pt_BR":"<p>Richard \"Phantiks” Su forma a segunda metade da selvagem dupla pelo meio dos Dire Wolves. Phantiks defende o meio dos the Dire Wolves desde 2015. Ele escolhe um assassino sempre que a situação permite; seus Campeões favoritos incluem Kassadin, Fizz e Zed. Mas ele é igualmente capaz com magos mais tradicionais, o que lhe permitiu ficar em primeiro entre jogadores de meio da OPL, com 4,94 de AMA durante a temporada regular. Em sua primeira participação internacional no Mid-Season Invitational 2017, ele terá de cuidar para que sua agressividade não seja punida por alguns dos melhores jogadores de meio do mundo.</p>"},"foreignIds":{"TRNA":"1000435432","TRNA1":"1000435432","TRSA1":"465241","ESPORTSTMNT03":"200000425","TRLT3":"200000043"},"socialNetworks":{"twitter":"https://twitter.com/Phantiks"},"champions":[],"liveGameTeam":129},{"id":1072,"slug":"rippii","name":"Rippii","firstName":"Nathan","lastName":"Mott","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rippii-7g0mtg5y.png","hometown":null,"region":"OCE","birthdate":"1995-12-29","createdAt":"2016-01-20T03:56:51.000Z","updatedAt":"2017-04-27T19:09:04.000Z","bios":{},"foreignIds":{"TRNA1":"1000435436","TRSA1":"465245","ESPORTSTMNT03":"200000502","TRLT3":"200000045"},"socialNetworks":{},"champions":[],"liveGameTeam":129},{"id":1076,"slug":"chippys","name":"Chippys","firstName":"Ryan","lastName":"Short","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chippys-2swnuqsf.png","hometown":"","region":"OCE","birthdate":"1996-12-20","createdAt":"2016-01-21T06:14:29.000Z","updatedAt":"2017-07-14T04:17:51.000Z","bios":{"en_US":"<p>Ryan “Chippys” Short made big leaps forward as a top laner this year. Known for playing carry top laners, including his signature Irelia, he went a combined 8-0 on Camille and Rumble in the OPL regular season. He can also play a tank when needed, and his versatility carried him to an impressive 5.40 KDA, good for second best among OPL top laners. Now his skills as a carry will be put to the test at the 2017 Mid-Season Invitational.</p>","es_AR":"<p>Este año, <strong>Ryan \"Chippys\" Short</strong> se perfiló como el mejor carrilero superior a pasos agigantados. Conocido por jugar con acarreadores de carril superior, incluyendo a su emblemática Irelia, logró sacar un 8-0 combinado entre Camille y Rumble en la temporada regular de la OPL. <strong>Chippys</strong> también puede ser un tanque si es necesario y su versatilidad lo llevó a un impresionante 5.40 de KDA, el segundo mejor entre los carrileros superiores de la OPL. Ahora, sus habilidades como acarreador se podrán a prueba en el Mid-Season Invitational 2017.</p>","pl_PL":"Ryan „Chippys” Short wykonał w tym roku wielki krok naprzód jako górny. Znany jest z gry prowadzącymi górnymi, włącznie z jego sztandarową Irelią. W sezonie zasadniczym osiągnął łączny wynik 8-0, grając Camille i Rumblem. W razie potrzeby potrafi także grać jako obrońca, a wszechstronność pozwoliła mu zdobyć imponujące 5,40 Z/Z/A, zapewniając drugie miejsce wśród najlepszych górnych OPL. Teraz jego umiejętności prowadzącego zostaną przetestowane podczas Mid-Season Invitational 2017.","fr_FR":"Ryan « Chippys » Short a fait d'énormes progrès en tant que toplaner cette année. Connu dans son rôle de carry dans la voie du haut, notamment avec Irelia, il a enregistré une série de victoires combinés de 8-0 avec Camille et Rumble dans la saison régulière de l'OPL. Il sait aussi jouer les tanks au besoin et sa polyvalence lui a permis d'inscrire un KDA impressionnant de 5,40, faisant de lui le deuxième meilleur toplaner de la région. Maintenant, c'est en tant que carry qu'il devra faire ses preuves lors du Mid-Season Invitational 2017.","es_ES":"Ryan ''Chippys'' Short ha hecho grandes avances como jugador de la calle superior este año. Famoso por jugar con carries en top, incluyendo a su predilecta, Irelia, consiguió quedar 8 a 0 con Camille y Rumble en la temporada regular de la OPL. También es capaz de jugar con tanques cuando es necesario, y gracias a su versatilidad ha conseguido un impresionante A/M/A de 5,40 puntos, lo que lo ha colocado como el segundo de los jugadores de la calle superior de la OPL. Ahora tendrá que demostrar sus habilidades como carry en el Mid-Season Invitational 2017","de_DE":"Ryan „Chippys“ Short hat sich in diesem Jahr auf der oberen Lane stark verbessert. Er ist dafür bekannt, auf der oberen Lane gerne Carrys wie seinen Lieblingschampion Irelia zu spielen, und hat in der regulären Saison mit Camille und Rumble insgesamt achtmal gewonnen und nie verloren. Wenn es notwendig ist, hat er auch kein Problem damit, Tanks zu spielen. Diese Vielseitigkeit hat ihm zu einer TTU von 5,40 verholfen, dem zweitbesten Wert aller Top-Laner der OPL. Jetzt muss er beim Mid-Season Invitational 2017 beweisen, wie gut seine Carry-Künste wirklich sind.","pt_BR":"<p>Ryan \"Chippys” Short deu um grande salto de qualidade na rota superior este ano. Conhecido por usar carregadores na rota superior, incluindo sua clássica Irelia, ele fez um agregado de 8-0 em Camille e Rumble na temporada regular da OPL. Ele também pode jogar de tanque quando necessário, e sua versatilidade o levou a impressionantes 5,40 de AMA, ficando em segundo lugar entre jogadores na rota superior da OPL. Agora suas habilidades como carregador serão testadas no Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRNA1":"1000435445","TRSA1":"465254","ESPORTSTMNT03":"200000299","TRLT3":"200000041"},"socialNetworks":{"twitter":"https://twitter.com/ChippysOCE"},"champions":[],"liveGameTeam":129},{"id":1100,"slug":"shernfire","name":"Shernfire","firstName":"Shern","lastName":"Tai","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shernfire-1ogbrwxw.png","hometown":null,"region":"OCE","birthdate":null,"createdAt":"2016-01-21T22:09:01.000Z","updatedAt":"2017-05-31T02:44:03.000Z","bios":{"en_US":"<p>Shern “Shernfire” Tai is the playmaking jungler for the Dire Wolves. The 18-year-old already has over two years of professional experience, first joining the Dire Wolves as a substitute in 2014. After spending two years in the NA Challenger series to little success, Shernfire returned to his first team for the start of 2017. He’s one of the most gold-hungry junglers in the OPL. When the gold is rolling in, his Rengar and Kha’Zix look unstoppable. He’ll have to fight tooth and nail for every jungle camp at the 2017 Mid-Season Invitational, though, where he will face off against some of the world’s best junglers.</p>","es_AR":"<p><strong>Shern \"Shernfire\" Tai</strong> es el junglero que arma jugadas para los Dire Wolves. El chico de 18 años, que se unió a los Dire Wolves como sustituto en 2014, ya tiene más de dos años de experiencia en el juego profesional. Después de pasar dos años en la serie Retador NA con pocos resultados, <strong>Shernfire</strong> regresó a su primer equipo para el comienzo de la temporada 2017. Es uno de los jungleros con más sed de oro en la OPL. Cuando el oro comienza a circular, su Rengar y su Kha'Zix parecen ser imparables. Sin embargo, <strong>Shernfire</strong> tendrá que luchar con garras y dientes por cada campamento de jungla en el Mid-Season Invitational 2017, en donde se enfrentará a algunos de los mejores jungleros del mundo.</p>","de_DE":"Shern „Shernfire“ Tai ist der Spielmacher und Jungler der Dire Wolves. Der 18-jährige, der 2014 als Ersatzspieler zu den Dire Wolves kam, kann bereits auf eine zweijährige Profi-Karriere zurückblicken. Nachdem er zwei erfolglose Jahre in der nordamerikanischen Challenger Series verbracht hatte, kehrte er Anfang 2017 wieder zu seiner alten Mannschaft zurück. Er ist einer der goldgierigsten Jungler in der OPL. Und wenn er genug Gold bekommt, ist er mit Rengar und Kha’Zix nicht zu stoppen. Beim Mid-Season Invitational 2017 wird er sich jedoch mit Händen und Füßen gegen die besten Jungler der Welt zur Wehr setzen müssen.","es_ES":"Shern ''Shernfire'' Tai es el jungla estratega de Dire Wolves. Con solo 18 años, y tras unirse a Dire Wolves en 2014 como suplente, ya cuenta con dos años de experiencia profesional. Tras pasar dos años en la Challenger Series de NA sin mucho éxito, Shernfire volvió a su primer equipo a comienzos de 2017. Es uno de los junglas más hambrientos de oro de la OPL. Cuando abunda el oro, su Rengar y su Kha'Zix son imparables. No obstante, tendrá que luchar con uñas y dientes para hacerse con todos los campamentos de la jungla en el Mid-Season Invitational 2017, donde se enfrentará a algunos de los mejores junglas del mundo.","fr_FR":"Shern « Shernfire » Tai est un jungler qui crée du jeu pour les Dire Wolves. Ce joueur de 18 ans a déjà deux ans d'expérience professionnelle à son actif, ayant rejoint les Dire Wolves pour la première fois en tant que remplaçant en 2014. Après avoir passé deux années dans les Challenger Series NA sans succès ou presque, Shernfire est de retour dans sa première équipe pour le début de l'année 2017. Il est l'un des junglers les plus assoiffés d'or de l'OPL. Et lorsque les PO coulent à flot, ses Rengar et Kha'Zix semblent imbattables. Dans la jungle, il devra lutter pour chaque camp bec et ongles lors du Mid-Season Invitational 2017 face à certains des meilleurs junglers du monde.","pl_PL":"Shern „Shernfire” Tai to rozgrywający dżungler Dire Wolves. Osiemnastolatek ma już za sobą ponad dwa lata profesjonalnego doświadczenia. Po raz pierwszy dołączył do Dire Wolves jako rezerwowy w 2014 roku. Po spędzeniu z niewielkim powodzeniem dwóch lat w NA Challenger Series Shernfire na początku 2017 roku wrócił do swojej pierwszej drużyny. Jest jednym z najbardziej żądnych złota dżunglerów w OPL. Gdy złoto napływa, jego Rengar i Kha’Zix stają się niepowstrzymani. Jednak na Mid-Season Invitational 2017 będzie musiał walczyć na śmierć i życie o każdy obóz w dżungli, stając przeciwko najlepszym dżunglerom na świecie.","pt_BR":"<p>Shern \"Shernfire” Tai é o criador de jogadas dos Dire Wolves. O jovem de 18 anos já tem dois anos de experiência profissional, tendo entrado para os Dire Wolves como substituto em 2014. Após passar dois anos no circuito Desafiante da NA sem muito sucesso, Shernfire voltou à sua primeira equipe para o início de 2017. Ele é um dos melhores caçadores na OPL. Quando o ouro entra, seu Rengar e Kha’Zix parecem invencíveis. Mas ele terá de lutar com unhas e dentes por cada acampamento na selva do Mid-Season Invitational 2017, quando enfrentará alguns dos melhores caçadores do mundo.</p>"},"foreignIds":{"FRA1TMNT1":"375269","ESPORTSTMNT03":"200001275","TRLT3":"200000042"},"socialNetworks":{"twitter":"https://twitter.com/shernfire"},"champions":[],"liveGameTeam":129},{"id":1113,"slug":"rhuckz","name":"rhuckz","firstName":"Rúben ","lastName":"Neves","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rhuckz-h5bx2iqn.png","hometown":"","region":"CBLOL Brazil","birthdate":null,"createdAt":"2016-01-22T18:38:14.000Z","updatedAt":"2017-05-30T22:14:38.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"385024"},"socialNetworks":{"facebook":"https://www.facebook.com/rhuckz/"},"champions":[],"liveGameTeam":168}],"scheduleItems":[{"id":"AVuhncYAQMQFcjhwbQy4","content":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:match:d99631e6-fe25-4a6a-8236-58c5764f61ba","scheduledTime":"2017-04-30T21:00:00.543+0000","tags":{"blockLabel":"Round 1","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:bracket:2aa734c2-34cc-4dca-b12c-8b6d6bc54421","leagueLabel":"urn:rg:lolesports:global:league:league:10","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723"},"match":"d99631e6-fe25-4a6a-8236-58c5764f61ba","tournament":"3ee23264-a557-49de-9b6f-377749144723","bracket":"2aa734c2-34cc-4dca-b12c-8b6d6bc54421","league":"10"}],"gameIdMappings":[{"id":"45c20d55-915c-4747-8eaa-180396d137c0","gameHash":"96c7d65a54d45607"}],"videos":[{"id":6735,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:45c20d55-915c-4747-8eaa-180396d137c0","source":"https://www.youtube.com/embed/9ioRUvhWP-Y","createdAt":"2017-04-30T23:20:38.000Z","updatedAt":"2017-04-30T23:20:38.000Z","game":"45c20d55-915c-4747-8eaa-180396d137c0"},{"id":6740,"slug":null,"label":null,"locale":"es1","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:45c20d55-915c-4747-8eaa-180396d137c0","source":"https://www.youtube.com/watch?v=yDeQv-KJacE&wmode=transparent","createdAt":"2017-05-01T00:48:24.000Z","updatedAt":"2017-05-01T00:48:24.000Z","game":"45c20d55-915c-4747-8eaa-180396d137c0"},{"id":6747,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:45c20d55-915c-4747-8eaa-180396d137c0","source":"https://www.youtube.com/embed/zoQLcH8XSGw?wmode=transparent","createdAt":"2017-05-01T04:18:01.000Z","updatedAt":"2017-05-01T04:18:01.000Z","game":"45c20d55-915c-4747-8eaa-180396d137c0"},{"id":6936,"slug":null,"label":null,"locale":"tr","reference":"urn:rg:lolesports:global:highlander:tournament:3ee23264-a557-49de-9b6f-377749144723:game:45c20d55-915c-4747-8eaa-180396d137c0","source":"https://www.youtube.com/embed/95a67SteCas","createdAt":"2017-05-29T03:38:02.000Z","updatedAt":"2017-05-29T03:38:02.000Z","game":"45c20d55-915c-4747-8eaa-180396d137c0"}],"htmlBlocks":[],"match":{"id":"d99631e6-fe25-4a6a-8236-58c5764f61ba","name":"DW-vs-RED","position":5,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"},{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],"games":{"45c20d55-915c-4747-8eaa-180396d137c0":{"id":"45c20d55-915c-4747-8eaa-180396d137c0","name":"G1","generatedName":"DW|RED|G1|d99631e6fe254a6a8236","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"},{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}],"standings":{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1496028970589,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493612475425,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493599661269,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493594631969,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493590554653,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"120204","gameRealm":"TRLT3","platformId":"TRLT3:120204","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1496028970589,"source":"bestOf","history":[{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493612475426,"source":"bestOf","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493599661270,"source":"bestOf","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493594631969,"source":"bestOf","closed":true},{"result":[[{"roster":"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c"}],[{"roster":"a82b08e8-e605-476a-8218-b516055104a6"}]],"timestamp":1493590554653,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"a82b08e8-e605-476a-8218-b516055104a6":0,"9a75cab1-fabd-4ff6-9cae-8f26e5adbf6c":1}}}