{"teams":[{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]},{"id":98,"slug":"samsung-galaxy","name":"Samsung GALAXY","guid":"be6e1ba8-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/samsung-galaxy-7tdve6e8.png","acronym":"SSG","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-05-25T19:40:23.000Z","bios":{"en_US":"<p>Samsung GALAXY is in the business of defying expectations. After a good-not-great performance in Champions Summer 2016, Samsung shocked KT Rolster in the Regional Qualifier, snagging the final spot at the 2016 World Championship. Once there, the team went on a run that ended just one victory short of the championship.</p>\n\n<p>Despite the loss, Samsung still gave fans the most competitive Worlds Finals match ever. As the team enters a talent-stacked LCK in 2017, one has to ask: are they about to surprise us again?</p>","de_DE":"<p>Samsung Galaxy bestand ursprünglich aus zwei Mannschaften: Samsung Blue und den Weltmeistern Samsung White. Nachdem KeSP den Organisationen verbot, mehrere Aufstellungen an den Start zu schicken, mistete Samsung seine Aufstellungen aus und kehrte mit neuen Spielern zurück, um am Champions Spring 2015 teilzunehmen. Nach mehreren Spielerwechseln hatten sie endlich ihre momentane und erfolgreichste Aufstellung gefunden. Samsung konnte allen Erwartungen zum Trotz im Gauntlet gegen KT Rolster gewinnen und das Ticket zur Weltmeisterschaft 2016 lösen. Während sich die Mannschaft stetig weiterentwickelt, werden auch ihre Ergebnisse immer besser. Und jetzt, wo die Weltmeisterschaft bevorsteht, stellt sich allen eine Frage: Können sie erneut für eine Überraschung sorgen?</p>","es_AR":"<p>Samsung Galaxy estaba formado por dos equipos: Samsung Blue y los campeones mundiales Samsung White. Luego de que KeSPA prohibiera que una organización formara varias alineaciones, Samsung decidió deshacer ambas formaciones y regresó con una alineación totalmente renovada que compitió en la Champions Spring 2015. Varios jugadores pasaron por el equipo, pero ahora llegaron con su exitosa formación actual. Samsung sorprendió a todos cuando derrocó a KT Rolster en el Guantelete y logró obtener un lugar en el Campeonato Mundial 2016. El equipo sigue creciendo y evolucionando, y eso se ve en los resultados. Con la vista puesta en el Mundial, uno se pregunta: ¿Acaso nos sorprenderán de nuevo?</p>\n\n<p><strong>Entrenador: Choi \"DoGGi\" Woo-beom</strong></p>","es_ES":"<p>En sus comienzos, Samsung Galaxy estaba dividido en dos equipos, Samsung Blue y, los campeones mundiales, Samsung White. Después de que KeSPA prohibiera que una organización tuviera varios equipos, Samsung se deshizo de ambas plantillas y volvió con una completamente nueva para competir en Champions Spring 2015.</p>\n\n<p>Tras varias combinaciones de jugadores, consiguieron llegar al equipo actual, el más exitoso. Contra toda probabilidad, vencieron a KT Rolster en el torneo clasificatorio y sellaron el pase al Campeonato Mundial 2016. El equipo y los resultados crecen y evolucionan de la mano. Ahora, con la mira puesta en el Mundial, no queda otra que preguntarse: ¿volverán a sorprendernos otra vez?</p>","pt_BR":"<p>A Samsung Galaxy costumava ser duas equipes: a Samsung Blue e os campeões mundiais, Samsung White. Depois de KeSPA proibir as organizações de criarem várias equipes, a Samsung desfez as duas escalações e voltou com um elenco totalmente novo que competiu na Champions de Primavera 2015. Após várias mudanças de jogadores, eles chegaram à sua equipe atual de maior sucesso. A Samsung surpreendeu ao tirar a KT Rolster da disputa e carimbou o passaporte para o Campeonato Mundial 2016. À medida que a equipe continua a crescer e evoluir, os resultados também. Com a equipe mirando o Mundial, precisamos perguntar: Será que eles vão nos surpreender novamente?</p>"},"foreignIds":{"drupalId":"3642"},"players":[362,718,726,730,745,796,1310,1311],"starters":[362,718,730,745,1311],"subs":[726,796,1310]}],"players":[{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":362,"slug":"corejj","name":"CoreJJ","firstName":"Yongin","lastName":"Jo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/corejj-e1lqotyt.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-07-06T14:23:20.000Z","bios":{"en_US":"<p>\nYongin “CoreJJ” Jo started his career in Korea, but moved to North America to play as the AD Carry for Team Dignitas. After underwhelming team performances in the NA LCS, CoreJJ made his way back to Korea in order to become the starting ADC for Samsung Galaxy.\n</p>\n<p>\nAfter the 2016 LCK Spring Split, CoreJJ decided to pick up playing support when the fresh talent, Ruler, signed on to play ADC for Samsung. He didn’t play much over the split, as he lived in the shadow of Wraith for a majority of the season. He was subbed in for Wraith against the Afreeca Freecs and finally got a chance to show off his impressive growth as a player. He continued to impress at the 2016 World Championship, helping Samsung reach the Worlds Finals.\n</p>","de_DE":"<p>Yong-in „CoreJJ“ Jo begann seine Karriere in Korea, wechselte dann aber nach Nordamerika, um dort bei Team Dignitas zu spielen. Nach einer schlechten Mannschaftsleistung in der NA LCS, kehrte CoreJJ wieder nach Korea zurück, um dort der neue AD-Carry von Samsung Galaxy zu werden.</p>\n\n<p>Nach dem Frühjahrs-Split in der LCK 2016 stieß der AD-Carry Ruler zu Samsung und CoreJJ entschied sich, die Rolle des Supporters zu übernehmen. Während des Splits spielte er jedoch nicht besonders oft, da er den Großteil der Saison in Wraiths Schatten verbringen musste. Doch schließlich ersetzte er Wraith im Spiel gegen die Afreeca Freecs und bekam damit die Gelegenheit, seine beeindruckende Entwicklung als Spieler zu demonstrieren. Seine Leistungen in jüngster Vergangenheit haben ihn auf die wichtigsten Spiele seiner Karriere vorbereitet. Es wird Zeit, den Moment zu ergreifen!</p>","es_AR":"<p>Yong-in \"CoreJJ\" Jo empezó su carrera en Corea, pero se mudó a Norteamérica para jugar como ADC en el equipo Dignitas. Después de unas increíbles actuaciones del equipo en la LCS NA, CoreJJ regresó a Corea para convertirse en el ADC de Samsung Galaxy.</p>\n\n<p>Luego del torneo de apertura de la LCK 2016, CoreJJ decidió ser soporte, ya que el equipo sumó al joven y talentoso Ruler como ADC. No jugó muy bien durante el torneo, ya que estuvo a la sombra de Espectro durante la mayor parte de la temporada. Reemplazó a Espectro contra Afreeca Freecs y finalmente tuvo la oportunidad de demostrar su impresionante crecimiento como jugador. Sus recientes actuaciones le permitieron lograr una participación en los juegos más importantes de su carrera. ¡Es hora de aprovechar las oportunidades!</p>","es_ES":"<p>Yong-in \"CoreJJ\" Jo comenzó su carrera en Corea, pero se mudó a Norteamérica para jugar como AD carry en Team Dignitas. Tras unas actuaciones de equipo decepcionantes en la LCS NA, CoreJJ volvió a Corea para convertirse en el AD carry titular de Samsung Galaxy. </p>\n\n<p>Después del split de primavera de la LCK 2016, CoreJJ decidió convertirse en apoyo cuando el nuevo prodigio, Ruler, firmó para jugar como AD carry en Samsung. No pudo jugar mucho durante el split, ya que vivió a la sombra de Wraith durante la mayor parte de la temporada. Pero sustituyó a Wraith contra Afreeca Freecs y, finalmente, tuvo la oportunidad de demostrar el increíble crecimiento que ha tenido como jugador. Sus actuaciones recientes lo han llevado a algunas de las mejores partidas de su carrera. ¡Ha llegado la hora de aprovechar el momento!</p>","pt_BR":"<p>Yong-in “CoreJJ” Jo começou sua carreira na Coreia, mas se mudou para a América do Norte para jogar como atirador na Team Dignitas. Depois das performances decepcionantes de sua equipe na LCS NA, CoreJJ voltou para a Coreia para ser o atirador titular da Samsung Galaxy. </p>\n\n<p>Depois da Etapa de Primavera da LCK 2016, CoreJJ decidiu começar a jogar como suporte quando o jovem talento, Ruler, assinou contrato para jogar de atirador na Samsung. Ele não jogou muito na etapa, pois ficou à sombra de Wraith na maior parte da temporada. Mas quando teve que substituir Wraith contra a Afreeca Freecs, CoreJJ finalmente teve a chance de mostrar seu crescimento impressionante como jogador. Com suas recentes atuações, ele se sente preparado para a ação nos maiores jogos de sua carreira. É hora de aproveitar o momento!</p>","pl_PL":"<p>Yong-in „CoreJJ” Jo rozpoczął karierę w Korei, ale przeniósł się do Ameryki Północnej, by grać jako prowadzący w Team Dignitas. Po nienajlepszych występach drużyny w NA LCS CoreJJ powrócił do Korei, aby stać się głównym prowadzącym w Samsung Galaxy. </p>\n<p>\nPo wiosennym splicie LCK 2016 CoreJJ zdecydował się wybrać rolę wspierającego, gdy nowy talent, Ruler, dołączył da Samsunga, by grać jako prowadzący. CoreJJ nie grał zbyt wiele podczas splitu, ponieważ przez większość sezonu krył się w cieniu Wraitha. Zastępował Wraitha w meczu przeciwko Afreeca Freecs i w końcu miał szansę zaprezentować swój imponujący rozwój. Jego ostatnie występy pokazują, że jest gotowy do startu w najważniejszych grach w swojej karierze. Pora wykorzystać tę chwilę!</p>\n"},"foreignIds":{"drupalId":"3673","ESPORTSTMNT06":"200000352","TRLT3":"200000221"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":718,"slug":"cuvee","name":"CuVee","firstName":"Sungjin","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cuvee-c14c33j5.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:12:32.000Z","bios":{"en_US":"<p>\nSungjin “CuVee” Lee has spent the entirety of his career with the new iteration of Samsung Galaxy. Being a young player means that CuVee has had to grow quickly on the Rift or get wasted by the opposition. When you’re playing against the likes of Smeb and Ssumday, you’re forced to learn the hard way.\n</p>\n<p>\nHis performances range from brilliant to dismal, although recently he’s started to trend upward.  The growth is encouraging as he searches for just exactly who he is on the Rift. With a Worlds Finals appearance under his belt, he’s going to be under more scrutiny than ever to perform with the spotlight on him.\n</p>","de_DE":"<p>Seong-Jin „CuVee“ Lee hat seine ganze Karriere bei der neuen Mannschaft von Samsung Galaxy verbracht. CuVee ist ein junger Spieler, der sich in der Kluft schnell weiterentwickeln musste, um von seinen Gegnern nicht vernichtet zu werden. Wenn man gegen Spieler wie Smeb und Ssumday spielt, muss man seine Erfahrungen auf die harte Tour machen.</p>\n\n<p>Seine Leistungen reichen von brillant zu jämmerlich, obwohl er in letzter Zeit einen klaren Aufwärtstrend erkennen lässt.  Diese Entwicklung ist vielversprechend, während er immer noch seinen Platz in der Kluft sucht. Doch jetzt, wo er sich mit seiner Mannschaft für die Weltmeisterschaft qualifizieren konnte, wir der noch genauer beobachtet werden. Diamanten werden durch Druck erzeugt, nicht wahr?</p>","es_AR":"<p>Seong-jin \"CuVee\" Lee pasó toda su carrera en la nueva formación de Samsung Galaxy. Al ser un jugador joven, CuVee tuvo crecer rápidamente en la Grieta para no caer ante sus rivales. Cuando uno juega contra personalidades como Smeb y Ssumday, debe aprender a la fuerza.</p>\n\n<p>Sus actuaciones van de brillantes a deprimentes, aunque últimamente ha demostrado una tendencia a mejorar en lugar de empeorar.  Este crecimiento es alentador, ya que CuVee está buscando identificarse como jugador. Con una clasificación al Mundial en el bolsillo, pasará por una prueba mayor con todos los ojos puestos en su actuación. Los diamantes se crean bajo presión, o eso dicen.</p>","es_ES":"<p>Seong-Jin \"CuVee\" Lee ha pasado toda su carrera en la nueva plantilla de Samsung Galaxy. Como era un jugador joven, tuvo que crecer rápidamente en la Grieta para no verse aplastado por los enemigos. Se aprende a las malas cuando te enfrentas a jugadores del calibre de Smeb y Ssumday.</p>\n\n<p>Sus actuaciones copan un amplio espectro, desde brillantes hasta deprimentes, aunque últimamente ha empezado a remontar el vuelo.  Este crecimiento es alentador para la búsqueda de su identidad en la Grieta. Y ahora, con la clasificación para el Mundial, su rendimiento va a estar bajo lupa más que nunca en el escenario más importante. Pero la presión siempre crea diamantes, ¿verdad?</p>","pt_BR":"<p>Seong-jin “CuVee” Lee passou toda a sua carreira na nova formação da Samsung Galaxy. Sendo um jogador novo, CuVee precisou crescer rapidamente no Rift ou seria devastado pelos adversários. Quando você joga contra jogadores como Smeb e Ssumday, você é forçado a aprender do jeito mais difícil.</p>\n\n<p>Suas atuações vão de brilhantes a decepcionantes, embora recentemente ele esteja em uma trajetória de subida em vez de descida.  Esse crescimento é encorajador, pois ele está em busca do que ele é exatamente no Rift. Com uma qualificação para o Mundial no currículo, agora seu desempenho será observado mais de perto do que nunca. Afinal, a pressão sempre cria diamantes.</p>","pl_PL":"<p>Seong-Jin „CuVee” Lee spędził całą swoją karierę w nowej iteracji Samsung Galaxy. Jest młodym zawodnikiem, co oznacza, że CuVee musiał szybko dojrzewać na Summoner’s Rift, aby nie zostać zmiażdżonym przez przeciwników. Gdy gra się przeciwko takim graczom jak Smeb i Ssumday, nauka nie jest lekka.</p>\n\n<p>Jego występy mają różny poziom: od znakomitych po rozczarowujące, chociaż ostatnio tendencja jest raczej zwyżkowa.  Rozwój zawsze motywuje, a CuVee wciąż szuka swojej prawdziwej tożsamości na Summoner’s Rift. Po kwalifikacjach do Mistrzostw zostanie poddany uważniejszej krytyce niż kiedykolwiek wcześniej. Będzie musiał wystąpić w świetle reflektorów. Ale w końcu każdy diament trzeba oszlifować, prawda?</p>\n"},"foreignIds":{"drupalId":"3645","ESPORTSTMNT06":"200000345","TRLT3":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":726,"slug":"wraith","name":"Wraith","firstName":"Jimin","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wraith-23l3i7xz.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-05-31T00:57:02.000Z","bios":{"en_US":"<p>Jimin “Wraith” Kwon started his career all the way back in 2012. He’s played all over for big names like ahq, Jin Air, SKTelecom T1 K, and now Samsung Galaxy. He brings a wealth of high level experience to the young Samsung squad.</p>\n\n<p>After joining Samsung in late 2014 Wraith has become a staple of their meta game. As their core shotcaller, much of what Samsung does relies on his steady hand guiding the team to victory. Although he took a backup role to CoreJJ during Samsung's run at Worlds, he still steps in from time to time and proves he's still got what it takes to set up Ruler to carry.</p>","en_AU":"","de_DE":"","ko_KR":"","es_AR":"<p>Ji-min \"Espectro\" Kwon inició su carrera en el 2012. Desde entonces, ha jugado en equipos reconocidos como ahq, Jin Air y SKTelecom T1 K hasta llegar a Samsung Galaxy. Este jugador aporta una vasta experiencia de alto nivel al joven equipo de Samsung.</p>\n\n<p>Después de unirse a Samsung a finales del 2014, Espectro se convirtió en un elemento fundamental para su metajuego. Como su líder principal, mucho de lo que Samsung hace depende de su mano guiándolos hacia la victoria. Samsung se alimentará de su experiencia mientras se acerca el Mundial. Después de forzar su paso por el guantelete, Samsung está volando alto y dependerá de Espectro mantener las tropas en línea y dirigir a su equipo en los juegos más grandes de su larga carrera - sin presión alguna.</p>","es_ES":"<p>El inicio de la carrera de Ji-min \"Wraith\" Kwon data de 2012. Ha jugado en equipos importantes como ahq, Jin Air, SK Telecom T1 K y ahora Samsung Galaxy. Wraith aporta mucha experiencia al más alto nivel al joven equipo de Samsung.</p>\n\n<p>Se ha convertido en una parte esencial del metajuego de Samsung desde que se unió a finales de 2014. Al ser el líder principal, mucho de lo que hace Samsung depende de que tenga el pulso firme para llevar al equipo hacia la victoria y Samsung se aprovechará de su gran pericia en el Mundial. Después de abrirse camino por el torneo clasificatorio regional, Samsung va con la cabeza bien alta y dependerá de Wraith que no se les suban los humos durante las partidas más importantes de su carrera. Sin presiones.</p>","fr_FR":"","pt_BR":"<p>Ji-min “Wraith” Kwon iniciou sua carreira em 2012. Ele já jogou para grandes nomes como ahq, Jin Air, SKTelecom T1 K, e agora Samsung Galaxy. Ele agrega experiência de alto nível à jovem equipe da Samsung.</p>\n\n<p>Depois de entrar na Samsung no final de 2014, Wraith se tornou o elo dos jogos meta da equipe. Como principal armador da equipe, grande parte do que a Samsung faz depende de como ele lidera a equipe até a vitória. E a Samsung contará com essa sua vasta experiência no Mundial. Depois de conseguir se classificar, a Samsung está sonhando alto e caberá a Wraith manter as tropas alinhadas e comandar a equipe nos maiores jogos de sua longa carreira. Sem pressão.</p>","pl_PL":"<p>Ji-min „Wraith” Kwon rozpoczął karierę już w 2012 roku. Grał w znanych drużynach, takich jak ahq, Jin Air, SKTelecom T1 K, a teraz w Samsung Galaxy. Wnosi wielkie, cenne doświadczenie do młodego składu Samsunga.</p>\n\n<p>Po dołączeniu do Samsunga pod koniec 2014 roku Wraith stał się oparciem dla stylu gry drużyny. Jest liderem drużyny, zatem Samsung w znacznej mierze polega na jego pewnej ręce, którą kieruje drużynę ku zwycięstwu. Samsung bardzo skorzysta z jego wielkiego doświadczenia podczas zbliżających się Mistrzostw. Po przebiciu się przez rozgrywki eliminacyjne Samsung jest na fali i to do Wraitha będzie należało trzymanie zawodników w ryzach oraz dowodzenie drużyną w najważniejszych grach jego długiej kariery — ot, błahostka.\n</p>"},"foreignIds":{"drupalId":"3648","ESPORTSTMNT06":"200000351"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":730,"slug":"crown","name":"Crown","firstName":"Minho","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/crown-92acwmx2.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:22:49.000Z","bios":{"en_US":"<p>\nMinho “Crown” Lee started his professional career in Brazil alongside fellow Korean jungler ReSet. After playing in Brazil briefly, Crown made his way back to Korea in order to become Samsung Galaxy’s starting mid laner.\n</p>\n<p>\nKnown for his excellent play on control mages like Viktor and Azir, Crown manipulates the Rift with seeming ease. Driven by his desire to become one of the greats, he has opened up his champion pool to even include mid lane marksmen like Varus. He shined in his first appearance at the 2016 World Championship, going toe-to-toe with Faker in the Worlds Finals but coming up just shy of the championship.\n</p>","de_DE":"<p>Min-Ho „Crown“ Lee begann seine professionelle Karriere gemeinsam mit dem Jungler ReSet in Brasilien. Nach diesem kurzen Abstecher nach Brasilien wechselte Crown wieder nach Korea, um dort der neue Mid-Laner für Samsung Galaxy zu werden.</p>\n\n<p>Crown ist für seine herausragenden Spielzüge mit Kontroll-Magiern wie Viktor und Azir bekannt, mit denen er die Kluft scheinbar einfach manipuliert. Aber durch sein Verlangen, der Beste zu werden, hat er seinen Champion-Pool sogar um Schützen für die mittlere Lane wie Varus erweitert. Crown wird bei der Weltmeisterschaft 2016 zum ersten Mal die internationale Bühne betreten. Und wenn er zur Legende werden will, wird er andere auf dem Weg zur Spitze stürzen müssen. Jetzt ist seine Zeit, zu glänzen.</p>","es_AR":"<p>Min-ho \"Crown\" Lee comenzó su carrera profesional en Brasil junto a su amigo junglero coreano ReSet. Después de un breve paso por Brasil, Crown regresó a Corea para convertirse en el carrilero central inicial de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego con hechiceros de control como Viktor y Azir, Crown lleva un control de la Grieta sin dificultad aparente. Su deseo de convertirse en uno de los mejores le ha hecho ampliar su grupo de campeones hasta llegar a incluir tiradores del carril central como Varus. Crown hará su primera aparición en un evento internacional en el escenario del Campeonato Mundial 2016. Si quiere convertirse en leyenda, deberá cortar cabezas hasta llegar a lo más alto. Es la hora de brillar.</p>","es_ES":"<p>Min-Ho \"·Crown\" Lee comenzó su carrera profesional en Brasil junto a su compañero coreano en la jungla, ReSet. Después de jugar en Brasil, Crown volvió a Corea para convertirse en el jugador titular de la calle central de Samsung Galaxy.</p>\n\n<p>Conocido por su excelente juego en magos de control como Viktor y Azir, Crown manipula la Grieta con relativa facilidad. Lo mueve su deseo por convertirse en uno de los mejores y ha aumentado su plantel de campeones para incluir hasta tiradores, como Varus. Esta será su primera aparición en un evento internacional, nada más y nada menos que el Campeonato Mundial 2016. Si quiere convertirse en una leyenda, tendrá que destronar a los demás en su camino a la cima. Ahora es el momento de que brille.</p>","pt_BR":"<p>Min-ho “Crown” Lee começou sua carreira profissional no Brasil juntamente com o caçador e compatriota coreano, ReSet. Depois de jogar pouco tempo no Brasil, Crown voltou para a Coreia para se tornar o meio titular da Samsung Galaxy.</p>\n\n<p>Conhecido por jogar muito bem com magos de controle como Viktor e Azir, Crown manipula o Rift com muita facilidade. Motivado pelo desejo de se tornar um dos melhores, ele ampliou seu elenco de campeões para incluir até mesmo atiradores para a rota do meio, como Varus. Crown estará fazendo sua primeira aparição em um evento internacional quando subir ao palco do Campeonato Mundial 2016. Se ele quiser se tornar uma lenda, ele terá que destronar os outros para chegar ao topo. Agora é sua vez de brilhar.</p>","pl_PL":"<p>Min-Ho „Crown” Lee rozpoczął zawodową karierę w Brazylii, razem z koreańskim kolegą, dżunglerem ReSetem. Po swoim krótkim epizodzie w Brazylii Crown powrócił do Korei, aby stać się głównym graczem środkowej alei w Samsung Galaxy.</p>\n\n<p>Znany ze znakomitej gry kontrolującymi magami, takimi jak Viktor i Azir, Crown manipuluje Summoner’s Rift z niezwykłą łatwością. Dążąc do zajęcia miejsca wśród najlepszych, rozszerzył swoją pulę bohaterów, włączając w nią nawet strzelców środkowej alei, takich jak Varus. Wchodząc na scenę Mistrzostw Świata 2016, Crown po raz pierwszy pojawi się na imprezie międzynarodowej. Jeśli chce stać się legendą, będzie musiał zdetronizować innych w swojej drodze na szczyt. To dla niego okazja, aby zabłysnąć.</p>\n"},"foreignIds":{"drupalId":"4389","ESPORTSTMNT06":"200000348","TRLT3":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":745,"slug":"ambition","name":"Ambition","firstName":"Chanyong","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ambition-96rikn4z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-07-06T14:12:46.000Z","bios":{"en_US":"<p>\nChanyong “Ambition” Kang may be the most storied player to never reach the World Championships. He began his career in 2011 and quickly became known as one of the most consistent mid laners in Korea. After years at the position, Ambition changed roles and became the starting jungler for CJ Entus.\n</p>\n<p>\nWhile he was a consistent mid laner, jungle proved to be a challenge for him, and he became known as an easy first blood target. Dedication and hard practice paid off over time and after Ambition made his move to Samsung Galaxy at the tail-end of 2015, his performances finally started improving. After an impressive showing at the 2016 World Championship, he's looking to make a return trip to the biggest stage in 2017.\n</p>","fr_FR":"<p>Chan-yong « Ambition » Kang a récemment rejoint la jungle de CJ Entus, mais il n'est pas moins vétéran que la majorité de ses coéquipiers. Ambition était naguère l'un des mid laners les plus craints de Corée. Il a pénétré dans la jungle lors de la réorganisation en franchises à équipe unique pour la saison 2015.\n</p>\n<p>\nNe croyez pas que le statut de semi-vétéran d'Ambition soit un manque... d'ambition. Ce joueur à des compétences mécaniques à la pelle : il a bâti sa réputation de mid laner sur sa virtuosité technique et sa régularité. À chaque nouvelle exploration de la jungle, Ambition accroît ses connaissances et se rapproche du statut de meilleur jungler de Corée.\n</p>\n<p>\nIl n'a pas choisi son nom au hasard.\n</p>","pl_PL":"<p>Chan-Yong „Ambition” Kang jest być może najbardziej uznanym zawodnikiem spośród tych, którzy nigdy nie dotarli do Mistrzostw Świata. Rozpoczął karierę w 2011 roku i szybko stał się znany jako jeden z najspójniej grających środkowych w Korei. Po latach na tej pozycji Ambition zmienił role i stał się głównym dżunglerem w CJ Entus.</p>\n<p>\nChociaż grał równo jako środkowy, dżungla okazała się dla niego wyzwaniem i traktowano go jako łatwy cel pierwszej krwi. Poświęcenie i ciężkie treningi czasem zaczęły przynosić efekty, a odkąd Ambition przeniósł się do Samsung Galaxy pod sam koniec 2015 roku, jego występy nareszcie zaczęły się poprawiać. Mając w kieszeni bilet na Mistrzostwa Świata 2016, Ambition zechce narobić trochę zamieszania, gdy po raz pierwszy wejdzie na największą arenę League of Legends.\n</p>","de_DE":"<p>Chan-Yong „Ambition“ Kang ist wahrscheinlich der beste Spieler, der es nie zu einer Weltmeisterschaft geschafft hat. Seine Karriere begann 2011 und er wurde schnell zu einem der beständigsten Mid-Laner in Korea. Nachdem er diese Rolle jahrelang ausgefüllt hatte, wechselte er zu CJ Entus und wurde deren Jungler.</p>\n\n<p>Obwohl er ein beständiger Mid-Laner war, erwies sich der Dschungel als Herausforderung für ihn und er wurde zu einem beliebten Ziel für das erste Blut. Doch sein Engagement und das harte Training machten sich mit der Zeit bezahlt und nachdem er Ende 2015 zu Samsung Galaxy gewechselt hatte, begannen sich seine Leistungen zu verbessern. Mit dem Ticket für die Weltmeisterschaft 2016 in der Tasche will Ambition Aufmerksamkeit erregen, wenn er die größte Bühne in League of Legends zum ersten Mal betritt.</p>","es_AR":"<p>Chan-yong \"Ambition\" Kang debe ser el jugador con más historia en llegar al Campeonato Mundial. Comenzó su carrera en el 2011 y rápidamente se hizo conocido como uno de los carrileros centrales más sólidos de Corea. Luego de años en esa posición, Ambition hizo un cambio de rol y pasó a ser junglero inicial para CJ Entus.</p>\n\n<p>Aunque fue un carrilero central sólido, la jungla fue un gran desafío para él y rápidamente pasó a ser carne de cañón. Su dedicación y entrenamiento duro dieron frutos con el tiempo y, luego de que Ambition se pasara a Samsung Galaxy a finales del 2015, sus actuaciones finalmente comenzaron a mejorar. Con un boleto al Campeonato Mundial 2016 en el bolsillo, Ambition buscará hacerse notar en su primera vez en lo que es el escenario más grande de League of Legends.</p>","es_ES":"<p>Chan-Yong \"Ambition\" Kang puede que sea el jugador con más historia en no haber alcanzado nunca los Campeonatos Mundiales. Su carrera comenzó en 2011 y rápidamente se convirtió en uno de los jugadores de la calle central más estables de Corea. Tras pasar años en esa posición, Ambition cambió de rol y se convirtió en el jungla titular para CJ Entus.</p>\n\n<p>Aunque era un jugador de la calle central constante, la jungla le presentó problemas y se hizo famoso por ser un fácil objetivo de primera sangre. La dedicación y los duros entrenamientos sirvieron para algo y, después de que Ambition se uniese a Samsung Galaxy a finales de 2015, sus actuaciones por fin comenzaron a mejorar. Ahora, con el billete para el Campeonato Mundial 2016 en el bolsillo, Ambition pretende hacerse notar cuando se suba, por primera vez, al mayor escenario de League of Legends.</p>","pt_BR":"<p>Chan-yong “Ambition” Kang deve ser um dos jogadores mais experientes que nunca chegou a um Mundial. Ele iniciou sua carreira em 2011 e rapidamente se tornou conhecido como um dos jogadores do meio mais consistentes da Coreia. Depois de anos nessa posição, Ambition trocou de função e se tornou o caçador titular da CJ Entus.</p>\n\n<p>Embora tenha sido um jogador do meio consistente, a selva se mostrou um desafio e ele ficou conhecido por ser um alvo fácil para o first blood. Ao longo do tempo, dedicação e treinos foram recompensados e, depois que Ambition foi para a Samsung Galaxy no final de 2015, suas atuações finalmente começaram a melhorar. Com o passaporte carimbado para o Campeonato Mundial 2016, Ambition está querendo fazer barulho quando pisar no maior palco do League of Legends pela primeira vez.</p>"},"foreignIds":{"drupalId":"372","ESPORTSTMNT06":"200000346","TRLT3":"200000218"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":796,"slug":"stitch","name":"Stitch","firstName":"Seungjoo","lastName":"Lee","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stitch-gudwgmc6.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-19T14:54:55.000Z","updatedAt":"2017-05-31T00:56:51.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4644","ESPORTSTMNT06":"200000350"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1310,"slug":"haru","name":"Haru","firstName":"Minseung ","lastName":"Kang ","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/haru-i19o8vi9.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-24T23:59:22.000Z","updatedAt":"2017-07-06T14:22:34.000Z","bios":{},"foreignIds":{"ESPORTSTMNT06":"200000347","TRLT3":"200000222"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1311,"slug":"ruler","name":"Ruler","firstName":"Jaehyeok","lastName":"Park ","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruler-8cnq7i5z.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-05-25T00:15:44.000Z","updatedAt":"2017-07-06T14:13:27.000Z","bios":{"en_US":"<p>\nJaehyeok “Ruler” Park started his professional career this year, playing for Stardust before joining Samsung Galaxy as their starting AD Carry. Ruler didn’t make the move to Samsung until May, making him the newest member on the roster. Over his short stint with the team he has been a consistent performer.\n</p>\n<p>\nRuler’s consistency makes him an exciting prospect and as he continues to learn his play will only get better. He has a willingness to jump on whatever champion suits the meta and his flexibility allows Samsung to create drafts that play to their strengths, knowing that Ruler can do whatever is asked of him. He’s an exciting prospect, but he's still a young talent who will be facing the test of a lifetime as he comes face to face with the best bot lane duos in the world. Only time will tell if he survives.\n</p>","de_DE":"<p>Jae-hyuk „Ruler“ Park begann seine professionelle Karriere in diesem Jahr bei Stardust, bevor er zu Samsung Galaxy wechselte. Ruler wechselte jedoch erst im Mai zu Samsung und ist damit das neueste Mitglied ihrer Mannschaft. Doch bereits in dieser kurzen Zeit lieferte er immer beständige Leistungen ab.</p>\n\n<p>Und genau diese Beständigkeit macht Ruler zu einem aufregenden Spieler, der weiter lernen und sich verbessern wird. Er ist bereit, jeden Champion zu spielen, der ins Metaspiel passt und seine Flexibilität und die Tatsache, dass er tut, was von ihm verlangt wird, ermöglichen es Samsung, ihre Stärke bei der Championauswahl auszuspielen. Er ist ein Spieler für die Zukunft, aber sein junges Talent wird bald auf die Probe gestellt, wenn er auf die weltbesten Duos auf der unteren Lane trifft. Die Zeit wird zeigen, ob er bestehen kann.</p>","es_AR":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año jugando para Stardust, para luego unirse a Samsung Galaxy como ADC inicial. Ruler llegó a Samsung en mayo, lo que lo hace el miembro más reciente de la alineación. En su corta estadía en el equipo, ha demostrado tener un rendimiento sólido.</p>\n\n<p>Esta solidez indica que tendrá un futuro excelente y, mientras siga aprendiendo, su juego mejorará aún más. Está dispuesto a usar cualquier campeón que sirva para la meta y su flexibilidad le permite a Samsung elegir estrategias adaptadas a sus fuertes, ya que Ruler es capaz de adoptar cualquier rol. Tiene un futuro maravilloso, pero aún es un talento joven que deberá enfrentar una prueba de vida cuando quede cara a cara con la mejor dupla de carriles inferiores del mundo. Solo el tiempo dirá si logrará sobrevivir.</p>","es_ES":"<p>Jae-hyuk \"Ruler\" Park inició su carrera profesional este año en Stardust, donde jugaba antes de convertirse en el AD carry titular de Samsung Galaxy. Ruler no se unió a Samsung hasta mayo, lo que hace que sea el más nuevo en el equipo. A pesar de la corta estancia en el equipo, ha demostrado ser constante en sus actuaciones.</p>\n\n<p>Esta regularidad hace que sea un novato interesante, ya que solo podrá mejorar según va aprendiendo. Ruler está dispuesto a jugar con cualquier campeón que encaje en el metajuego y esta flexibilidad permite que Samsung cree composiciones para explotar sus puntos fuertes, ya que saben que Ruler puede hacer cualquier cosa que se le pida. Tiene un futuro emocionante por delante, pero sigue siendo un prodigio joven que se enfrentará a la prueba más dura de su vida: un cara a cara con los mejores dúos de la calle inferior del mundo. Solo el tiempo dirá si será capaz de sobrevivir.</p>","pt_BR":"<p>Jae-hyuk “Ruler” Park começou sua carreira profissional esse ano, jogando para a Stardust antes de entrar para a Samsung Galaxy como atirador titular. Ruler só se transferiu para a Samsung em maio e portanto é o integrante mais recente do elenco. Durante seu breve período com a equipe, ele tem mostrado atuações convincentes.</p>\n\n<p>A consistência de Ruler o torna uma aposta animadora, pois ele continua a aprender e seu jogo só tem melhorado. Ele está sempre disposto a vestir a roupa de qualquer campeão que se adeque ao meta e sua flexibilidade permite que a Samsung crie composições que favorecem seus pontos fortes, sabendo que Ruler pode fazer o que lhe for pedido. Ele é uma promessa animadora, mas ainda é um jovem talento que enfrentará o teste de sua vida quando ficar cara a cara com os melhores jogadores da rota inferior do Mundo. Só o tempo dirá se ele sobreviverá.</p>","pl_PL":"<p>Jae-hyuk „Ruler” Park rozpoczął zawodową karierę w tym roku grą dla Stardust, zanim dołączył do Samsung Galaxy jako ich główny prowadzący. Ruler przeniósł się do Samsunga dopiero w maju, co czyni z niego najnowszego członka składu. Podczas krótkiego czasu w drużynie zaprezentował równy poziom gry.</p>\n\n<p>To sprawia, że Ruler budzi wielkie nadzieje na przyszłość. Kontynuując naukę gry, będzie stawał się coraz lepszy. Nie ma oporów przez wybraniem dowolnego bohatera, którego wymaga stan gry, a ta elastyczność pozwala Samsungowi tworzyć układy maksymalnie wykorzystujące zalety drużyny, skoro wiadomo, że Ruler zrobi wszystko, o co się go poprosi. Chociaż Ruler budzi wielkie nadzieje na przyszłość, trzeba pamiętać, że to młody talent, który podczas Mistrzostw zmierzy się z życiową próbą, stając twarzą w twarz z najlepszymi duetami dolnej alei. Tylko czas pokaże, czy zdoła przetrwać.</p>\n"},"foreignIds":{"ESPORTSTMNT06":"200000349","TRLT3":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":98},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41}],"scheduleItems":[{"id":"AV0VpWjdoUG4HPFjOKYD","content":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:match:db901320-0c09-44cd-8179-2cc4bc68c1e0","scheduledTime":"2017-07-09T08:00:00.993+0000","tags":{"blockLabel":"Finals","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:bracket:bb4dd67f-bf2d-47c5-8ffc-16ac152e6551","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5"},"match":"db901320-0c09-44cd-8179-2cc4bc68c1e0","tournament":"093599e3-e07d-4b43-8430-3e03b644b1f5","bracket":"bb4dd67f-bf2d-47c5-8ffc-16ac152e6551","league":"43"}],"gameIdMappings":[{"id":"d56b1c88-a7b8-4882-9aa6-324df2b5b007","gameHash":"f39f3d0b647d9c6c"}],"videos":[{"id":7805,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:093599e3-e07d-4b43-8430-3e03b644b1f5:game:d56b1c88-a7b8-4882-9aa6-324df2b5b007","source":"https://www.youtube.com/embed/iIhXn7yWe0g?wmode=transparent&start=4577&rel=0","createdAt":"2017-07-10T07:03:11.000Z","updatedAt":"2017-07-10T07:03:11.000Z","game":"d56b1c88-a7b8-4882-9aa6-324df2b5b007"}],"htmlBlocks":[],"match":{"id":"db901320-0c09-44cd-8179-2cc4bc68c1e0","name":"grand-final-1","position":0,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":0},{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":1}],"games":{"d56b1c88-a7b8-4882-9aa6-324df2b5b007":{"id":"d56b1c88-a7b8-4882-9aa6-324df2b5b007","name":"G1","generatedName":"EDG|SSG|G1|db9013200c0944cd817","input":[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":0},{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":1}],"standings":{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":1}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":0}]],"timestamp":1499670052321,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":1}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":0}]],"timestamp":1499592681699,"source":"manual","note":"Updated from HQ2","closed":true},{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":1}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16","breakpoint":"f84c8022-686f-4b2c-8c26-266836408314","standing":0}]],"timestamp":1499592501393,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"190293","gameRealm":"TRLT3","platformId":"TRLT3:190293","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764"}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16"}]],"timestamp":1499670052321,"source":"bestOf","history":[{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764"}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16"}]],"timestamp":1499592681700,"source":"bestOf","closed":true},{"result":[[{"roster":"7b2061a5-53f8-4466-add0-7e6804ffc764"}],[{"roster":"49474147-89b7-426a-a28f-7ae6e05bcd16"}]],"timestamp":1499592501394,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}