{"teams":[{"id":54,"slug":"giants-gaming","name":"Giants","guid":"be6cac45-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-96kph40s.png","acronym":"GIA","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/giants-gaming-biaz5jt5.png","createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-06-18T09:43:38.000Z","bios":{"en_US":"<p>Giants Gaming launched their first League of Legends squad in 2012 during the infancy of the LCS. They initially started an all-Spaniard roster, leading to GIA's portrayal as Spain’s premier Lolesports organization. However, in recent years they have branched out, adding players from a variety of countries. While GIA have endured several shaky seasons, and were even relegated into the Challenger Series, they always manage to fight their way back into the LCS.</p>\n\n<p>Coach: André \"Guilhoto\" Guilhoto</p>","pl_PL":"<p>GIANTS Gaming to zasłużona hiszpańska organizacja, której korzenie sięgają lipca 2012 roku. Zespół początkowo rywalizował głównie na rodzimej scenie, ale dość szybko zbudował drużynę, która chciała osiągnąć coś w międzynarodowych turniejach. Dlatego przystąpiła do kwalifikacji do pierwszego sezonu EU LCS w historii, które zaskakująco przebrnęła. Co ciekawe jest to jedyna organizacja, która miała w tych rozgrywkach dwa całkowicie różne składy złożone z graczy tej samej narodowości. </p>\n<p>Pierwszy z nich występował w LCS właśnie wiosną 2013 roku, a w jego w skład wchodzili górny Samuel „Samux” Fernandez, dżungler Sebastian „Morden” Esteban, środkowy Juan „Exterminare” Navarro, strzelec Yon „JimBownz” Mangas Cayetano i wspierający Aarón „Babeta” Collados. Formacja nie zabawiła w elitarnych rozgrywkach zbyt długo, ponieważ zajęła dopiero siódme miejsce z bilansem 8-20 i po przegranych barażach odpadła z rywalizacji już po pierwszym, wiosennym splicie. Niemniej była to pierwsza, obok Gambit i Copenhagen Wolves, jednonarodowościowa drużyna w historii rozgrywek.</p>\n<p>Po przygodzie z EU LCS z organizacją dość szybko pożegnał się skład, który osiągnął pierwszy znaczący sukces w jej historii i GIANTS przez niecały rok nie angażowało się w scenie League of Legends. Zmieniło się to dopiero w kwietniu-czerwcu 2014 roku, po znalezieniu odpowiednich graczy. W ten sposób kolejna piątka została drugim, w pełni hiszpańskim składem w historii EU LCS. Formacja zakwalifikowała się do wiosennego splitu EU LCS 2015 dzięki dobremu występowi w turnieju rozszerzającym, w którym pokonała faworyzowane Millenium i Reason Gaming. Zespół GIANTS Gaming, pomimo niezłego startu, dość przeciętnie radził sobie w debiutanckim sezonie. Ostatecznie zajął dziewiąte miejsce, trafił do rozgrywek relegacyjnych, gdzie ponownie rozprawił się z drużyną Reason Gaming. W efekcie czego utrzymał miejsce w rozgrywkach EU LCS.</p>\n<p>W międzyczasie GIANTS przestało być w pełni hiszpańskim zespołem, ponieważ miejsce Rydle’a zajął szwedzki wspierający. Zmiana okazała się bardzo dobrym ruchem. Dzięki temu letnia edycja rozgrywek znów zaczęła się naprawdę nieźle dla hiszpańskiej ekipy. Jednak tym razem drużyna potrafiła utrzymać równą formę przez cały letni okres i zakończyła zasadniczy sezon na dość wysokim, szóstym miejscu, kwalifikując się do baraży. Jednak zarówno rozgrywki barażowe, jak i późniejsze kwalifikacje na Mistrzostwa Świata 2015, zakończyły się dla drużyny bardzo szybko. Nie zmieniło to jednak faktu, że GIANTS udało się pozostać w pierwszorzędnej lidze.</p>\n<p>Przed wiosenną edycją zmagań 2016 w drużynie doszło do kilku roszad, dość zaskakujących ze względu na dobre wyniki w poprzednim sezonie. Z formacją pożegnali się Werlyb i Fr3deric, a na ich miejsce przybyli Peter „Atom” Thomsen oraz Tri Tin „k0u” Lam. Jednak szybko okazało się, że to nie była najlepsza decyzja organizacji. Od pierwszego tygodnia drużyna GIANTS Gaming radziła sobie zdecydowanie gorzej od pozostałych zespołów. Efektem było zajęcie ostatniego miejsce w wiosennym splicie EU LCS 2016 i kolejne trafienie do relegacji. Tym razem drużyna ponownie stanęła na wysokości zadania, wywalczając sobie miejsce w letnich rozgrywkach EU LCS 2016. W przerwie między tymi okresami GIANTS Gaming wymieniło kolejnych zawodników, w efekcie czego hiszpańska organizacji pożegnała ostatniego hiszpańskiego gracza.</p>","es_ES":"<p>España es uno de los países en los que los deportes electrónicos más han crecido durante los últimos años. Una época en la que un club ha destacado por encima del resto: Giants Gaming. Fundada en 2008, la organización española ha sido testigo y protagonista de torneos nacionales e internacionales de muchas disciplinas, sobre todo FIFA, Battlefield y Call of Duty. Pero además de la competición al máximo nivel, Giants Gaming posee una academia en la que forma a nuevos talentos de diversos juegos entre los que, por supuesto, se encuentra League of Legends.</p>\n\n<p>Giants ha tenido proyectos nacionales con varios de los mejores jugadores del país, pero solo dos de los equipos de la organización española duraron lo suficiente com ara conseguir sus objetivos. A principios de 2013, en el clasificatorio para el Split de primavera de la LCS, los gigantes sorprendieron a toda Europa con sus victorias ante Alternate y los favoritos Fnatic, gracias a las que consiguieron el pase a la primera edición de la LCS tras vencer a Mousesports. Durante la fase regular el equipo no consiguió entrar entre los 5 primeros y acabó en el torneo de promoción para jugarse su plaza contra Alternate. El conjunto español no consiguió la victoria y meses después acabó desarmándose.</p>\n\n<p>Un año después la organización encontró otro proyecto con un camino ascendente hacia Europa y el cariño de un público, el español, totalmente entregado a la causa. Un público que vio recompensado su apoyo tras la clasificación para el Split de primavera de 2015. Werlyb, Frederic, Pepiinero, Adryh y Rydle formaron la armada española con el objetivo de lograr la permanencia en la máxima categoría de la región y competir en el Split de verano. Tras mucho sufrimiento Giants consiguió mantener la plaza, además de cara al verano contarían con G0dfred, un jugador de apoyo sueco que cambió la comunicación del equipo de español a inglés y que además ayudó a dirigir en partida. Con estos cambios el conjunto español alcanzó los playoffs, pero no pudieron hacer mucho en cuartos de final y, tras una actuación discreta en las finales regionales, el conjunto cerró su primera temporada en la LCS.</p>\n\n<p>Este año Giants Gaming tiene la ambición de establecerse como una de las organizaciones europeas más importantes. Con League of Legends como gran escaparate al mundo, el club pasa por la mejor etapa de su historia. Una etapa en la que tendrá que demostrar que la excelencia debe ser un hábito.</p>","de_DE":"<p>Giants Gaming haben ihr erstes Team 2012 gegründet, als die LCS noch in den Kinderschuhen steckte. Das ursprüngliche Team bestand ausschließlich aus Spaniern, wodurch GIA zur Hauptorganisation von Lolesports in Spanien wurden. Allerdings haben sie ihre Aufstellung in den letzten Jahren um Spieler aus verschiedenen Ländern erweitert. Obwohl GIA einige wackelige Saisons überstanden hat, und sie sogar in die Challenger Series abgestiegen sind, haben sie es immer geschafft, sich zurück in die LCS zu kämpfen.</p>\n\n<p>Coach: David „Lozark“ Alonso\n</p>","fr_FR":"<p>Depuis son entrée en LCS, Giants Gaming est une équipe qui a peiné à trouver ses marques en compétition. Avec une entrée obtenue pour le segment de printemps 2015, les Giants ont bu la tasse pendant les neuf semaines de compétition pour finalement terminer en neuvième position du classement. C'est avec quelques difficultés que l'équipe a dû, pour la première fois, sauver sa peau durant les promotions d'été. Sortants victorieux contre Reason Gaming, l'équipe est parvenue à rester aux LCS, dans le but de prouver à tous que les Giants sont prêts à en découdre.</p>\n\n<p>C'est avec de bons résultats que les Giants terminent alors en sixième place durant le segment d'été 2015. Guidés et rassurés par les performances impressionnantes du midlaner phare de l'équipe, Isaac « xPepii » Flores. Durant les play-offs, l'équipe se frotte aux H2k-Gaming qui remportent l'affrontement, les Giants se retrouvent alors dotés de vingt points de championnat. De retour pour 2016, les Giants procèdent à plusieurs remaniements d'équipe, avant et pendant le segment de printemps, suite à des résultats contrastés. Malgré tous ces changements, Giants Gaming présentent toujours des difficultés à trouver une bonne cohésion d'équipe et terminent le segment une fois de plus dans le bas de tableau. Ils parviennent une fois de plus à sauver la mise lors des promotions d'été contre la Team Huma qu'ils écrasent trois victoires à une, et conservent ainsi leur place pour le segment d'été.</p>\n\n<p>Tout en gardant dans le viseur la reprise de la compétition, la structure a fait un grand ménage de printemps au sein de l'équipe et c'est avec une toute nouvelle composition que les Giants Gaming fouleront une fois de plus la scène des LCS, Pour enfin, espérer renverser la tendance, décrocher leur ticket pour les play-offs et pourquoi pas, une qualification autant convoité championnat du monde 2016.</p>"},"foreignIds":{"drupalId":"71"},"players":[179,613,1263,1340,1638,2005,2006,2007,2008,2009],"starters":[179,613,1263,1638,2006],"subs":[1340,2005,2007,2008,2009]},{"id":97,"slug":"splyce","name":"Splyce","guid":"be6e1a6a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/splyce-gyo3tr9y.png","acronym":"SPY","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-08-08T09:39:46.000Z","bios":{"en_US":"<p>Splyce started from the bottom. Now they’re here, one of the best teams in Europe. Formerly Team Dignitas EU, Splyce made their debut in the 2016 EU LCS Spring Split and immediately struggled. The young team banded together in the Summer Promotion Tournament, and the very next split took second place in the regular season and earned a spot a Worlds though the Regional Qualifiers.</p>\n\n<p>Like their rivals G2, Splyce played poorly at Worlds. But with the same five members returning for 2017, they’re poised to once again dominate the EU LCS. If there’s any team in the league that knows how to deal with failure and come out on top, it’s Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","pl_PL":"<p>Splyce było na wiosnę 2016 drugą, obok G2 Esports, drużyną, dla której udział w tamtym Splicie był debiutem w LCS-owej stawce. W pełni duński skład awans do elitarnych rozgrywek wywalczył, zwyciężając w letnim splicie europejskiego Challenger Series (EU CS) 2015.</p>\n<p>Historia ekipy jest dość skromna i jej początki sięgają wiosennej edycji rywalizacji w EU CS w 2015 roku. Wtedy to drużynę SK Gaming Prime przejął Team Dignitas EU. W składzie doszło do trzech zmian, które w efekcie sprawiły, że DIG EU od tej pory stało się zespołem jednonarodowościowym – złożonym wyłącznie z Duńczyków. Obiecujący skład miał trudne początki i na wiosnę ledwo co zakwalifikował się do play-offów Challenger Series, w których, co ciekawe, ostatecznie nie wystąpił. Wszystkiemu winne były ograniczenia wiekowe w LCS, których nie spełniała wtedy dwójka zawodników formacji – Martin „Wunderwear” Hansen oraz Chres „Sencux”Laursen. Wobec tego ówczesne DIG EU zmuszone było do gry o uzyskanie ponownej kwalifikacji do EU CS na split letni.</p>\n<p>Od tej pory wszystko szło już jednak znacznie sprawniej i zespół bez problemu znów dostał się do Challenger Series, by następnie bez problemu zakwalifikować się do play-offów i tam pokonać wszystkich rywali, zapewniając sobie awans do LCS na wiosenną edycję w 2016 roku. Warto jednak zauważyć, że triumf ex-Dignitas EU nie należał do przekonujących. Niemniej ekipa ta jest ciekawą mieszanką talentu i młodości (Sencux, Wunderwear) z rutyną i doświadczeniem (Nicolai „Nisbeth” Nisbeth, Jonas „Trashy” Andersen). Ponadto atutem formacji jest oczywiście możliwość komunikacji w rodzimym języku.</p>\n<p>Ostatecznie beniaminek zmagań przystępuje do rywalizacji w zmienionych barwach. Zawodnicy zamienili trykoty Team Dignitas EU na koszulki nowej organizacji - Follow eSports, które ostatecznie przekształciło się w Splyce. W międzyczasie, przed startem wiosennego splitu EU LCS 2016, ekipa nie uniknęła również zmian w składzie, a konkretnie jednej. Dotychczasowego dżunglera, Dennisa \"Obviousa\" Sørensena, który opuścił formację 29 października 2015 roku, dwa tygodnie później zastąpił wracający z Ameryki Jonas \"Trashy\" Andersen. Warto dodać, że Splyce było wtedy dopiero siódmym zespołem w historii LCS złożonym wyłącznie z graczy jednej narodowości i drugim w pełni duńskim.</p>\n<p>Wiosenny split nie spełnił jednak oczekiwań kibiców Splyce ani samej formacji. Drużyna od samego początku zmagań utknęła na dole tabeli i ostatecznie zajęła niskie, ósme miejsce, które sprawiło, że Splyce zmuszone zostało do walki w turnieju barażowym o utrzymanie w stawce. Tam, chociaż nie bez problemów, zespół na szczęście pokonał jednak GIANTS Gaming wynikiem 3-2 i zagwarantował sobie miejsce w EU LCS na letnim split. W składzie drużyny doszło tylko do jednej zmiany – zawodzącego wspierającego Nicolaia „Nisbetha” Nisbetha zastąpił młody i utalentowany słoweński support Mihael „Mikyx” Mehle. Splyce przystąpiło do rywalizacji z nadziejami na awans do play-offów, chociaż eksperci po raz kolejni nie dawali bardzo młodej drużynie dużych szans na osiągnięcie takiego wyniku.</p>\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>\n","es_ES":"<p>Splyce (anteriormente llamado Team Dignitas EU) hicieron su debut en la LCS EU durante el split  de primavera de 2016, y tuvieron un duro comienzo para adaptarse al nivel de la LCS. Como resultado, el equipo tuvo que luchar en el Summer Promotion Tournament, en el que superaron a Giants Gaming en un apasionante enfrentamiento al mejor de cinco y se aseguraron llegar a la LCS EU. Splyce tuvo un exitoso split de verano que le posicionaría en segundo lugar, nada que ver con el de primavera, en el que casi quedaron eliminados. Ahora que han superado los baches de la competición europea, el joven equipo rebosa confianza de camino al Campeonato Mundial 2016. Es hora de demostrarle al mundo que el split de verano no fue suerte sino que Splyce ha llegado para quedarse.</p>\n<p>Entrenador: Hans Christian \"Liq\" Duerr</p>","de_DE":"<p>Splyce fing ganz unten an. Doch heute gehören sie zu den besten Mannschaften Europas. Splyce, ehemals Team Dignitas EU, gab sein Debüt beim Frühjahrs-Split der EU LCS 2016 und hatte sofort Probleme. Doch die junge Mannschaft fand im Sommer-Aufstiegsturnier zueinander, woraufhin sie bereits den nächsten Split auf Platz Zwei beendeten und sich in der regionalen Qualifikationsrunde für die Weltmeisterschaft qualifizieren konnten.</p>\n\n<p>Genau wie ihre Rivalen G2 spielte auch Splyce bei der Weltmeisterschaft schwach. Aber da sich ihre Aufstellung für die Saison 2017 nicht geändert hat, sind sie bereit, die EU LCS erneut zu dominieren. Wenn es in der Liga eine Mannschaft gibt, die weiß, wie man mit Fehlschlägen umgeht und sich wieder an die Spitze kämpft, dann ist das Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","fr_FR":"<p>Nouveaux arrivants en LCS EU, Splyce a racheté cette année la place et l'effectif de Dignitas EU après la qualification de ces derniers en LCS.</p>\n\n<p>L'équipe a d'abord été connue sous le nom de Follow Esports, un site qui se présente comme le « programme télé de l'esport », mais tant le site que l'équipe LCS ont rapidement changé de nom au profit de l'actuel. Peu après l'achat le cofondateur du site a déclaré être très satisfait de son investissement dans League of Legends puisque cela les plaçait dans une « ligue aussi excitante que professionnelle, que ce soit au niveau de l'organisation, des joueurs ou des fans ». Reste à voir quelle place Splyce va occuper dans ces LCS auxquels l'organisation est aussi heureuse d'être associée. Pour la jeune entreprise basée aux Etats-Unis, elle n'a été créée qu'en avril 2015, les LCS sont à coup sur la garantie d'une exposition médiatique plus importante mais qu'en est-il de leurs ambitions sportives ? </p>\n\n<p>L'équipe a un avantage certain, l'absence de la barrière de la langue. En effet l'équipe est entièrement composée de joueurs danois, ce qui facilitera forcément la communication en jeu. Malgré tout, avec un effectif jeune et prometteur mais qui manque cruellement d'expérience, Splyce a un besoin criant d'un encadrement de bonne qualité pour concurrencer des adversaires qui ne leur feront pas de cadeau. L'entreprise semble néanmoins avoir bien cerné ce besoin puisqu'ils ont recruté Jakob « YamatoCannon » Mebdi, ancien entraîneur de Roccat, comme entraîneur et Chris Ehrenreich, ancien entraîneur de CLG en LCS NA, pour l'assister dans la mise en place d'un environnement de travail performant. </p>\n\n<p>Pas sur que cela suffise pour tutoyer les sommets des LCS dès le printemps 2016, mais les joueurs, confrontés au plus haut niveau européen, devraient à tout le moins progresser rapidement tant au niveau individuel qu'en tant qu'équipe. C'est tout le mal qu'on leur souhaite !</p>\n\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>","es_AR":"<p>Splyce (antiguamente llamado Team Dignitas EU) hizo su debut en la LCS EU durante el torneo de clausura del 2016 y pudo experimentar la agresividad del alto nivel de juego que allí se presenta. De esta forma, el equipo tuvo que luchar para salir del torneo de promoción de verano, en el que vencieron a Giants Gaming en un emocionante combate al mejor de cinco para conseguir un pase a la LCS EU. Splyce tuvo un exitoso torneo de clausura en el que consiguieron un segundo lugar, algo totalmente inesperado luego del descenso que sufrieron en primavera. Luego de haber arrasado en la competencia del Guantelete europeo, el joven equipo rebosa de confianza para encarar el Campeonato Mundial 2016. Es hora de mostrarle al mundo que el torneo de clausura no fue una casualidad, y que Splyce ha llegado para quedarse.</p>\n\n<p><strong>Entrenador: Jakob \"YamatoCannon\" Mebdi</strong></p>","pt_BR":"A equipe da Splyce (antiga Team Dignitas EU) fez sua estreia na EU LCS durante a Etapa de Primavera 2016 e teve um choque de realidade com o calibre de jogo da LCS. Como resultado, a equipe teve que passar pelo Torneio de Promoção de Verão, onde conseguiram derrotar a Giants Gaming em uma emocionante melhor de 5, ganhando seus ingressos de volta para a EU LCS. A Splyce então teve uma explosão de sucesso na Etapa de Verão, conseguindo o segundo lugar - um sucesso e tanto depois de sua quase relegação na Etapa de Primavera. Agora que a equipe despachou a competição no cenário europeu, todos estão transbordando de confiança para o Campeonato Mundial 2016. Está na hora de mostrar para o mundo que a Etapa de Verão não foi mera sorte e que a Splyce chegou para ficar.","en_GB":""},"foreignIds":{"drupalId":"4032"},"players":[232,336,387,588,663,954,1771],"starters":[232,336,387,588,954],"subs":[663,1771]}],"players":[{"id":179,"slug":"gilius","name":"Gilius","firstName":"Erberk","lastName":"Demir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gilius-9n1du6ig.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:11.000Z","updatedAt":"2017-08-17T23:46:32.000Z","bios":{"en_US":"<p>\nErberk \"Gilius\" Demir made a name for himself with Unicorns of Love during their run through the 2014 EU Challenger Series Playoffs. His performance in the jungle pushed UOL through the Promotion Tournament and into the EU LCS. \n</p>\n<p>\nAfter spending most of 2015 hopping between teams in the EU Challenger Series, Gilius ended up as the starting jungler for Elements for the 2016 EU LCS Spring Split. Elements’ seed was bought out by FC Schalke 04 and Gilius was kept on as the team’s starting jungler moving into the 2016 EU LCS Summer Split. Unfortunately, Schalke was forced into relegation and lost their spot in the EU LCS.\n</p>","de_DE":"<p>Auch wenn Gilius mit dem Start der sechsten Saison als neues Gesicht von Elements auftritt, ist er bei Weitem keine unbekannte Person für das Team. Ber Demir hat bereits beim Summer Split der EU LCS für Unicorns of Love gespielt, nachdem der ehemalige Spieler Kikis das Team frühzeitig verlassen hatte. Doch war dies nicht der erste Auftritt vom Jungler beim Team. </p>\n\n<p>Schon als es Unicorns of Love in der vierten Saison in die EU LCS geschafft hat, gehörte Berk „Gilius“ Demir zum festen Kader des Teams. Zur damaligen Zeit war er der feste Jungler, wurde dann aber von Kikis abgelöst. Fortan war er nur noch als Ersatzspieler zu sehen. Mit der neuen Saison bekommt Demir noch einmal die Chance sich in der LCS zu beweisen.</p>\n\n<p>Die Vergangenheit hat gezeigt, dass er durchaus das Zeug zum Profi-Jungler hat. Bekannt wurde er vor allem durch seine aggressive Spielweise, welcher er mit passenden Assassinen unterstrich. Gern wird von ihm Lee Sin oder Rengar gewählt. Doch auch mit Jarvan IV oder Gragas weiß der junge Deutsche umzugehen. </p>\n\n<h2><p>Interessante Fakten </p></h2>\n<p>•\tBeliebte Champions: Rengar, Lee Sin, Jarvan IV</p>\n<p>•\tUrsprünglich spielte Gilius bei SK Gaming Prime und bei Gamers2</p>\n","fr_FR":"<p>Berk « Gilius » Demir s'est fait un nom avec les Unicorns of Love durant les play-offs des Challenger Series EU 2014. Ses performances dans la jungle ont permis aux UOL de traverser le tournoi de promotion et de se qualifier pour les LCS EU. Gilius a été remplacé par Kikis après la qualification des UOL, car son style agressif ne convenait plus autant que les choix anticonformistes de Kikis.</p>\n<p>Après avoir passé une grande partie de 2015 à aller d'une équipe à l'autre sur la scène des Challenger Series EU, Gilius a fini par devenir le jungler titulaire des Elements pour le segment printanier des LCS EU 2016. </p>","es_ES":"<p>Berk 'Gilius' Demirse se hizo un nombre en la escena europea de League of Legends jugando con Unicorns of Love en los playoffs de la Challenger Series EU 2014. Su actuación en la jungla aupó a UOL a lo más alto del torneo de promoción, consiguiendo la clasificación para la LCS EU. No obstante, Gilius fue reemplazado por Kikis en la jungla después de la clasificación del equipo, el juego anárquico de Kikis y su abanico de campeones hizo que lo prefirieran a Gilius y su estilo de juego agresivo.</p>\n<p>Después de pasarse la mayor parte de 2015 yendo de un equipo a otro en la Challenger Series EU Gilius terminó como jungla titular de Elements para el Spring de primavera de la LCS EU 2016.</p>","pl_PL":"<p>Pojawił się na wydarzeniu esportowym najwyższej rangi – Mistrzostwach Świata 2014, zupełnie nieznany. Wcześniej tylko na miesiąc, zaczynając w maju 2014 roku, dołączył do SK Gaming Prime. Na podstawie tego, co sobą wtedy zaprezentował, został poproszony do zastępstwa Dennisa \"Svenskeren\" Johnsena na pierwszych trzech meczach MŚ 2014. Wszystkie z nich zostały przegrane przez SK Gaming, a \"Gilius\" pożegnał się z tym towarzystwem. Od czerwca 2014 roku do listopada 2015 roku grał jako członek wielu drużyn walczących w Challenger Series, jak na przykład: Planetkey Dynamics, Meloncats, Gamers2 i mousesports. Jednak z żadną z tych organizacji nie udało mu się dostać do EU LCS, choć wielokrotnie był bardzo blisko. Ostatecznie dołączył do Unicorns Of Love, jako główny jungler w wiosennym sezonie 2016. Zasługiwał  to swojej znajomości z „jednorożcami” i wcześniejszymi występami w ich szeregach, gdyż miał okazję wcześniej grać w jej barwach jako substytut. Czekał na możliwość zaprezentowania  się w rozgrywkach LCS bardzo długo, więc kiedy taka szansa została mu dana, nie omieszkał pokazać swojej radości na wszystkich portalach społecznościowych.</p>\n<p>\nPochodzący z Kolonii Berk uwielbia Elise i Lee Sin’a, lecz od grudnia 2015 roku zarzeka się, że kocha tylko Nidalee. Ma bardzo dobry kontakt z niemieckojęzycznymi wielbicielami, gdyż prowadzi popularnego streama w swoim rodowitym języku. To jeden z najpopularniejszych niemieckich kanałów, prawdopodobnie dlatego, że \"Gilius\" jest świetnym nauczycielem. Podczas jego pokazów można łatwo zrozumieć jak grać w jungli i jak dostał się aż do Kręgu Pretendenta w Europie. Jednak odkąd dołączył do Unicorns of Love coraz częściej na portalach społecznościowych zwraca się do fanów po angielsku. To efekt jego przeświadczenia, że wraz z udziałem w EU LCS liczba jego adoratorów drastycznie się zwiększy. Nawet w grudniu 2015 roku dodał wpis, że nie może się doczekać rzeszy nowych sympatyków. Wielu innych profesjonalnych graczy także zauważyło zmianę nastawienia top-lanera Unicorns of Love. „Amazing” wypowiedział się, że wcześniej Berk był nieznośny i arogancki, a od kiedy dołączył do jednorożców stał się zupełnie innym człowiekiem – miłym i przyjaznym. \n</p>"},"foreignIds":{"drupalId":"2496","ESPORTSTMNT02":"200000675","TRLH1":"200000293","TRLH4":"200000459","TRLH3":"200000360"},"socialNetworks":{"twitch":"http://www.twitch.tv/godgilius"},"champions":[],"liveGameTeam":54},{"id":232,"slug":"trashy","name":"Trashy","firstName":"Jonas ","lastName":"Andersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trashy-epw5lsut.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:40:20.000Z","bios":{"en_US":"<p>Jonas “Trashy” Anderson spent years jumping between teams until everything finally clicked with Splyce. A jungler with a wealth of experience, Trashy even spent time in the NA LCS for Enemy eSports. When he found a home on Splyce, it wasn’t long before he became a top jungler in the EU LCS.</p>\n\n<p>It will take more than a disappointing performance at the 2016 World Championship to stop this jungler from improving. At the helm of what is still a young team, Trashy is poised to take big leaps forward with Splyce in 2017. And if he’s allowed to have his way in the jungler, he’ll be taking the rest of the EU LCS out with the rest of the garbage.</p>","de_DE":"<p>Jonas „Trashy“ Anderson hat immer wieder die Mannschaft gewechselt, bis er endlich bei Splyce landete. Trashy ist ein Jungler mit viel Erfahrung, der eine Zeit lang sogar bei Enemy eSports in der NA LCS spielte. Nachdem er bei Splyce ein neues Zuhause gefunden hatte, dauerte es nicht lange, bis er zu einem der besten Jungler der EU LCS wurde.\n\nEs braucht mehr als eine enttäuschende Vorstellung bei der Weltmeisterschaft 2016, um diesen Jungler daran zu hindern, immer besser zu werden. Trashy ist am Ruder dieser jungen Mannschaft und bereit, mit Splyce 2017 große Sprünge zu machen. Und wenn er im Dschungel ungestört tun und lassen kann, was er will, wird er die anderen Mannschaften in der EU LCS zusammen mit dem Müll entsorgen.</p>","fr_FR":"<p>Jonas « Trashy » Andersen est à la fois le petit nouveau de chez Splyce et l'un des deux seuls de son équipe à avoir déjà fait l'expérience des LCS avant cette année. </p>\n\n<p>Le jungler danois a en effet pris part au segment de printemps des LCS NA en 2015 au sein de l'équipe Enemy eSports. Comme son compatriote Lucas « Santorin » Tao Kilmer Larsen avant lui, Trashy a en effet pris le risque de traverser l'atlantique pour y rejoindre une équipe semi-professionnelle et tenter de devenir joueur professionnel en Amérique du Nord. Après une qualification relativement aisée pour les Challenger Series, son équipe et lui ont entrepris une domination sans partage sur l'antichambre des LCS. Ils n'ont perdu en tout et pour tout qu'un seul match de la saison régulière, face à Team Fusion, eux-même favoris pour la qualification en LCS ! C'est logiquement que Enemy a ensuite dominé les play-off pour empocher la qualification automatique pour le segment d'été des LCS NA. </p>\n\n<p>Malheureusement pour Trashy et les siens, la suite de l'histoire n'a pas été aussi rose, loin de là. Pas suffisamment préparée au niveau d'exigence et de jeu nécessaire au plus haut niveau nord-américain, l'équipe a enchaîné défaite sur défaite. Incapables de hausser leur niveau de jeu, les Enemy ont terminé leur saison à une piteuse 9ème place. Pire, ils ont bu le calice jusqu'à la lie en se faisant éliminer 3 victoires à rien par Team Coast lors du tounoi de relégation. </p>\n\n<p>Une expérience difficile à vivre pour un joueur qui a bien cru que sa carrière allait se terminer là, alors même qu'il était sans doute le meilleur joueur de son ancienne équipe. Il avoue lui même avoir été « surpris » quand Splyce a pris contact avec lui malgré sa récente élimination des LCS NA. Un contact bienheureux pour le joueur donc, un contact remotivant aussi. Trashy a repris espoir et pense aujourd'hui que « jouer avec quatre autres danois est la bonne décision » pour sa carrière et que Splyce « va surprendre beaucoup de monde » en 2016, comme il l'a affirmé au DailyDot. </p>\n\n<p>Quoiqu'il en soit, avec des joueurs prometteurs à ses côtés, Trashy a à présent toutes les armes en main pour réussir. </p>","es_ES":"<p>Jonas ''Trashy'' Andersen llega desde Dinamarca cargado de experiencia. Jugó en equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, además de participar en la LCS NA con Enemy eSports. Pero Trashy no tardaría en echar de menos su casa, así que volvió a la LCS EU al final de 2015 y se unió a Splyce.</p>\n\n<p>Tras probar por primera vez la alta esfera competitiva europea en el split de primavera de la LCS EU 2016, Trashy subió el listón del split y se convirtió en uno de los mejores junglas de Europa. Sus mejoras ayudaron a que Splyce obtuviese el segundo puesto en la temporada regular, y una gran clasificación en el Clasificatorio Regional de la LCS EU. Trashy lidera un equipo que está dispuesto a llegar al cielo. ¿Conseguirán los equipos de alto nivel del Campeonato Mundial 2016 traer a Trashy y a Splyce de vuelta a la tierra, o el joven equipo nos sorprenderá a todos? Pronto lo descubriremos.</p>","pl_PL":"<p>Trashy jest najnowszym nabytkiem formacji (dołączył do drużyny 16 listopada 2015 roku) I jednocześnie najbardziej doświadczonym graczem w zespole. Duński dżungler na profesjonalnej scenie znajduje się już od 2012 roku i w tym trakcie swojej kariery miał okazję występować w składach takich drużyn jak Tricked eSports, Reason Gaming, Cloud 9 Eclipse czy SK Gaming Prime. W tym czasie Trashy występował głównie w Challenger Series, ale próby dostania do EU LCS kończyły się porażką zarówno w przypadku Reason Gaming, jak i SK Gaming Prime. Duńczykowi udało się awansować do najwyższej klasy rozgrywkowej (letni split NA LCS 2015) dopiero z amerykańskim Enemy eSports, choć formacja długa wahała się czy zatrudnić duńskiego leśnika. Co ciekawe, ostatecznie zarząd przekonała deklaracja Trashy’ego, że.. zapłaci za lot z własnej kieszeni, tylko po to, by móc wziąć udział w testach, które organizował zespół. </p>\n<p>\nNiestety amerykańska przygoda Duńczyka zakończyła się na dwóch splitach występów, w tym zaledwie jednym spędzonym w NA LCS i jednym w NA Challenger Series. Jednak w tym czasie duński zawodnik dał się poznać jako jeden z najmocniejszych punktów NME – w większości klasyfikacji indywidualnych znalazł się w pierwszej piątce wśród dżunglerów tamtejszych rozgrywek, a jeśli chodzi o procentowy udział w zabójstwach oraz najmniejszą ilość śmierci udało mu się nawet wskoczyć na podium. Teraz powrócił do Europy skuszony ofertą Splyce i w sumie ciężko się dziwić, że wybór FE padł właśnie na niego. Zespół szukający duńskiego dżunglera nie mógł bowiem trafić lepiej (no może z wyjątkiem Dennisa \"Svenskerena\" Johnsena, który miał jednak inne plany, bowiem dołączył do Teamu SoloMid). </p>\n<p>\nTrashy w trakcie swojej kariery dał się poznać jako znakomity gracz Elise oraz Rengara, choć w letniej edycji NA LCS 2015 najczęściej wybierał Rek’sai oraz Gragasa ze względu na siłę tych postaci. Ciekawostką może być fakt, że Thrashy bardzo dobrze zna się z innym duńskim dżunglerem, który występował w Ameryce – Lucasem \"Santorinem\" Tao Kilmer Larsenem.</p>\n<p>\n„Jestem bardzo zadowolony z dołączenia do byłego DIG EU, teraz Follow eSports… Byłem nieco zaskoczony, kiedy drużyna ta skontaktowała się ze mną po fiasku meczów barażowych w barwach mojego byłego zespołu, NME. Jednak nie mam wątpliwości, że dołączenie do tych czterech duńskich facetów jest właściwą decyzją.” – powiedział Trashy w wywiadzie dla portalu Daily.dot.</p>\n<p>\nZadowolenie Trashy’ego nie może dziwić. Wszak przyznał wcześniej w żartach, że uważa Duńczyków za… Koreańczyków Europy. A tutaj ma ich pod dostatkiem!\n</p>","es_AR":"<p>Oriundo de Dinamarca, Jonas \"Trashy\" Anderson tiene una vasta experiencia. Ha jugado para equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, sin mencionar su paso por la LCS NA con Enemy eSports. Sin embargo, no pasó mucho para que Trashy comience a echar de menos su hogar. Regresó a la LCS EU a finales del 2015 para unirse a la nueva formación de Splyce.</p>\n\n<p>Después de tener su primera experiencia en la competencia europea de primer nivel en el torneo de apertura de la LCS EU 2016, Trashy se esforzó aún más en el torneo de clausura, hasta llegar a ser uno de los mejores jungleros de Europa. Su mejora sirvió para que Splyce llegara al segundo lugar en la temporada regular y tuviera una excelente actuación en la clasificatoria regional de la LCS EU. Trashy dirige el timón de un equipo que va derecho a las nubes. ¿Lograrán los equipos de primer nivel del Campeonato Mundial 2016 enviar a Trashy y Splyce de regreso a la tierra? ¿O acaso el joven equipo conseguirá sorprendernos a todos? Estamos a punto de descubrirlo.</p>"},"foreignIds":{"drupalId":"1409","TRLH4":"200000207","TRLH3":"200000104"},"socialNetworks":{"twitch":"twitch.tv/trashylol","facebook":"facebook.com/Trashylol","twitter":"twitter.com/SPY_Trashy"},"champions":[],"liveGameTeam":97},{"id":336,"slug":"sencux","name":"Sencux","firstName":"Chres","lastName":"Laursen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sencux-efit8ngk.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:50.000Z","updatedAt":"2017-06-09T10:40:39.000Z","bios":{"en_US":"<p>Chres “Sencux” Larsen has the makings of Europe’s next mid lane star. He made his way to Splyce after honing his skills in the Challenger scene. Sencux showed flashes of brilliance early in the 2016 EU LCS Spring Split, and in the Summer took the next step to rival the best mid laners in the league.</p>\n\n<p>At the 2016 World Championship, Sencux couldn’t quite keep up with the best mid laners in the world. But as he returns to the EU LCS with the rest of Splyce for 2017, his time on the international stage should prove to be an invaluable experience. If he can keep up his blazing pace of improvement, it won’t be long at all before he gets another shot at the world’s finest.</p>","de_DE":"<p>Chres „Sencux“ Larsen hat das Zeug zu Europas nächstem großen Star auf der mittleren Lane. Er kam zu Splyce, nachdem er sein Können in der Herausforderer-Szene perfektioniert hatte. Sencux ließ sein Können bereits zu Beginn des Frühjahrs-Splits der EU LCS 2016 aufblitzen und machte im Sommer den nächsten Schritt, um es mit den besten Mid-Lanern der Liga aufzunehmen.\n\nBei der Weltmeisterschaft 2016 konnte Sencux jedoch nicht ganz mit den besten Mid-Lanern der Welt mithalten. Aber wenn er mit dem Rest von Splyce 2017 in die EU LCS zurückkehrt, sollten sich seine Erfahrungen auf der internationalen Bühne bezahlt machen. Wenn er sich weiterhin steigern kann, wir es nicht lange dauern, bis er es wieder mit den Besten der Welt zu tun bekommt.</p>","fr_FR":"<p>Chres « Sencux » Laursen a tout juste 17 ans, joue à League of Legends depuis 4 ans et gravite dans le milieu compétitif depuis 2014. Après une première expérience chez Reason Gaming, il s'apprête à présent à découvrir les LCS accompagné d’une réputation flatteuse. </p>\n\n<p>La plupart des observateurs considèrent que le danois est, avec Luka « PerkZ » Perković de chez G2 Esports, le porte-drapeau d'une nouvelle génération de midlaners européens. Un héritage pas forcément facile à porter ! Sous les couleurs de Splyce, le joueur va en tout cas devoir le défendre face à ceux qui ont porté ce titre avant lui, à l'instar de Fabian « Febiven » Diepstraten. Y est-il prêt ? Pour être honnête et au vu de ce qu'il a montré en Challenger Series, Sencux est sans doute encore un peu tendre. Contrairement à Febiven l'an dernier, il est peu probable que le midlaner de Splyce gagne systématiquement la voie du milieu en 1v1 face à ses adversaires plus expérimentés. Sa prise de décision, particulièrement, est parfois douteuse. Malgré tout le jeune midlaner n'est pas en dessous du niveau attendu en LCS, bien au contraire. Son niveau individuel est même certainement déjà supérieur à celui de certains joueurs LCS. Il lui manque juste quelques ajustements à faire pour atteindre les sommets, mais il a à coup sur le talent nécessaire pour y parvenir. </p>\n\n<p>Il va pouvoir s'appuyer pour cela sur son style de jeu, tout en contrôle. Sur sa confiance en son jeu aussi, lui qui déclarait avant même le segment d'été des Challenger Series : « si Febiven peut passer de challenger à l'un des meilleurs midlaners, pourquoi est-ce que moi je ne pourrais pas faire de même ? » Comme dirait l'autre, y a plus qu'à !</p>","es_ES":"<p>Chres ''Sencux'' Laursen es uno de los jugadores titulares más jóvenes de la LCS EU. AspiranteTras jugar en varios equipos aspirantes diferentes, Sencux llegó a Splyce (anteriormente llamado Team Dignitas EU) y logró hacerse con un puesto en la LCS EU. Su rol en la calle central consiste fundamentalmente en debilitar constantemente a sus oponentes para controlar las batallas de equipo y los objetivos del mapa.</p>\n\n<p>Tras demostrar unas jugadas brillantes en el split de primavera de la LCS EU 2016 (como el asesinato cuádruple con LeBlanc), los espectadores y analistas se preguntaban si tiene lo que hace falta para convertirse la próxima estrella europea de la calle central. Sencux calló las voces de los escépticos y consiguió obtener con Splyce el segundo puesto en el split de verano de la LCS EU 2016 y, por consiguiente, superar la escena europea y asegurarse un puesto en el Mundial. Aunque Sencux sea capaz de lanzar hechizos a los mejores mid de Europa, la escena internacional es completamente diferente. La mayor prueba de Sencux está aún por llegar, y será una batalla a vida o muerte en la Grieta contra los mejores jugadores de League of Legends.</p>","pl_PL":"<p>Sencux to niekwestionowana gwiazda zespołu I jego najważniejszy zawodnik. To właśnie Chres dzięki swoim niesamowitym umiejętnościom i fantastycznym zagraniom najczęściej prowadzi zespół do zwycięstw. Warto jednak zauważyć, że w momencie startu wiosennego splitu EU LCS 2016 Sencux to będzie nadal bardzo młody, 17-letni zawodnik (jest ledwie pół miesiąca starszy od Wunderweara). Ogromnym problemem Duńczyka, niejako związanym z wiekiem, jest gra pod presją, której zawodnik nie zawsze potrafi sprostać. W tym aspekcie od razu nasuwa się porównanie z holenderskim mid-lanerem, Fabianem \"Febivenem\" Diepstratenem sprzed awansu do LCS z drużyną H2k. </p>\n<p>\nJednocześnie Duńczyk ma już całkiem spore doświadczenie, bowiem występuje na scenie od stycznia 2014 roku, co sprawia, że zaczynał jako zaledwie… piętnastolatek. Jego pierwszym przystankiem na drodze do wielkiej kariery był zespół Reason Gaming, gdzie spotkał Jonasa „Trashy’ego” Andersena. Później, wraz z Kasperem \"Kobbe’m\" Kobberupem oraz Martinem „Wunderwearem” Hansenem występował w 4everzenzyg oraz SK Gaming Prime-Dignitas EU, które w końcu przekształciło się w Follow eSports, a następnie w Splyce. Co ciekawe, Nicolai „Nisbeth” Nisbeth jest jedynym zawodnikiem, z którym Chres, grając w SK-DIG-FE, spotkał się po raz pierwszy. </p>\n<p>\nDuńczyk posiada bardzo szeroki champion pool, ale z pewnością największą uwagę należy zwrócić na jego Azira, Viktora oraz Twisted Fate’a, grę którymi opanował do perfekcji. Swego czasu znany był nawet jako tzw. one-trick-pony Viktora, ale gra w Challenger Series 2015 sprawiła, że obecnie większość rywali najbardziej obawia się jego Azira. Sencux powszechnie uważany jest za wielki talent i wielu znawców sceny zastanawia się nad tym jak młody zawodnik poradzi sobie w walce przeciwko najlepszym mid-lanerom na Starym Kontynencie. Jest to bardzo interesujący problem, bo niestety nawet w ostatnim, udanym dla ex-Dignitas EU splicie dało się zauważyć, że Sencuxowi obok znakomitych gier zdarzają się spotkania bardzo przeciętne i takie wahania formy mają ogromny wpływ na postawę całej drużyny, której duński mid-laner jest ważnym punktem.</p>\n<p>\n„Myślę, że Sencux jest bardzo utalentowany mechanicznie. Gra bardzo dobrze, ale ma tendencję do tiltowania dość szybko, jeśli coś nie idzie po jego myśli.” – powiedział o Sencuxie przed finałem letniego splitu EU CS 2015 jego przeciwnik, Julian \"Xioh\" Dumler (mid-laner drużyny mousesports).</p>\n<p>\nCiekawy jest fakt, że nick gracza początkowo miał brzmieć „Sencu”, ale ten pseudonim był już zajęty w momencie, w którym Duńczyk zakładał swoje konto. Wobec tego najprostszym rozwiązaniem było dodanie „x” do ksywki i właśnie tak powstał obecny nick Sencuxa.\n</p>","es_AR":"<p>Chres \"Sencux\" Laursen es uno de los jugadores más jóvenes de la LCS EU. Después de jugar en varios equipos retadores, Sencux logró llegar a Splyce (anteriormente llamado Team Dignitas EU) y se ganó un lugar en la LCS EU. Su papel en el carril central se basa mucho en realizar ataques rápidos contra los enemigos para controlar los combates en equipo y lograr los objetivos de mapa.</p>\n\n<p>Después de demostrar momentos de gran inspiración en el torneo de apertura de la LCS EU 2016 (como un asesinato cuádruple con LeBlanc), tanto espectadores como analistas se preguntaron si tendría lo que hace falta para convertirse en la próxima estrella europea del carril central. Sencux cerró la boca de todos los que dudaron de él cuando, junto a Splyce, logró el segundo lugar en el torneo de clausura de la LCS EU 2016, seguido de una victoria en el Guantelete europeo, que le garantizó un lugar en el Mundial. Aunque Sencux es capaz de lanzar hechizos con los mejores centrales de Europa, la historia es completamente diferente a nivel internacional. La prueba más difícil de Sencux está por venir, y necesitará de gran determinación al llegar a la Grieta para estar a la altura de lo mejor de lo mejor que League of Legends tiene para ofrecer.</p>"},"foreignIds":{"drupalId":"1425","TRLH3":"200000105","TRLH4":"200000208"},"socialNetworks":{"twitch":"http://www.twitch.tv/sencux","facebook":"facebook.com/Sencux","twitter":"twitter.com/\tSPY_Sencux"},"champions":[],"liveGameTeam":97},{"id":387,"slug":"wunderwear","name":"Wunder","firstName":"Martin","lastName":"Hansen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wunderwear-fgro7nyg.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-23T01:17:13.000Z","updatedAt":"2017-06-09T10:41:34.000Z","bios":{"en_US":"<p>Martin “Wunder” Hansen  is a consistent top laner -- consistently aggressive. Even when playing tanks like Nautilus and Maokai, Wunder is more than happy to overextend for a kill. That aggressive playstyle got in him trouble in his rookie split, but he adjusted and became one of the best top laners in the EU LCS.</p>\n\n<p>Wunder struggled against the best top laners in the world at the 2016 World Championship. Back on Splyce in 2017, he’ll have the chance to put what he learned into practice during the regular season. It’s not the first time people have doubted Wunder or Splyce, and Wunder would love nothing more than to silence the haters.</p>","de_DE":"<p>Martin „Wunder“ Hansen ist ein verlässlicher Top-Laner – verlässlich aggressiv. Selbst mit Tanks wie Nautilus und Maokai geht Wunder für eine Tötung gerne mal etwas mehr Risiko ein. Dieser aggressive Spielstil bereitete ihm in seinem ersten Split große Probleme, doch er passte sich an und wurde einer der besten Top-Laner in der EU LCS.\n\nBei der Weltmeisterschaft 2016 hatte Wunder Probleme, mit den besten Top-Lanern der Welt mitzuhalten. 2017 hat er mit Splyce die Gelegenheit, sein neu erlangtes Wissen während der regulären Saison in die Praxis umzusetzen. Es ist nicht das erste Mal, dass die Leute an Wunder oder Splyce gezweifelt haben, und Wunder würde nichts lieber tun, als den Kritikern den Wind aus den Segeln zu nehmen.</p>","fr_FR":"<p>Martin « Wunderwear » Hansen a tout juste 17 ans et s'apprête à découvrir les LCS EU en tant que toplaner de Splyce. Il peut en être d'autant plus fier que, comme la majeure partie de son équipe, il y est parvenu à la seule force de son talent, par le biais de la qualification en Challenger Series, puis en LCS.</p>\n\n<p>Après une première expérience en Challenger Series à l'été 2014 au sein de l'équipe danoise 4everzenzyg, déjà en compagnie de Chres « Sencux » Laursen et Kasper « Kobbe » Kobberup, qui s'est soldée par une défaite en demi-finales des Challenger Series, Wunderwear s'est lancé début 2015 dans la conquête d'une place en LCS. Cela est passé par une qualification en Challenger Series avec sa nouvelle équipe, SK Prime, au détriment de l'équipe française Thunderbot Sparta. La qualification en poche l'équipe, rachetée et renommée Dignitas EU entre temps, a terminé à la 4ème place du segment de printemps et... n'a pas pris part aux play-off ! En effet ni Sencux ni Wunderwear n'avaient atteint leurs 17 ans à ce moment. Sure de la force de ses jeunes joueurs, l'équipe a alors préféré faire l'impasse sur les play-off et sur une possible participation au tournoi de promotion et attendre le segment d'été tranquillement. </p>\n\n<p>Wunderwear a bien rendu la confiance qui lui a été ainsi accordée et a été une part importante de la réussite de son équipe lors du segment d'été, terminé avec 8 victoires et seulement 2 défaites. Terminé surtout avec une qualification en LCS après deux victoires étriquées en play-off contre Denial Esports et Mousesports. </p>\n\n<p>A présent le jeune toplaner danois s'apprête à vivre sa première saison au plus haut niveau européen et à réaliser que son parcours de l'an dernier n'a été, in fine, qu'une longue introduction. De ce qu'il a montré l'an dernier, il est encore un peu tendre pour faire face à quelqu'un comme Paul « SoaZ » Boyer mais a largement le potentiel pour combler ses lacunes d'ici à la fin du segment de printemps. A condition, bien sur, de ne pas se relâcher !</p>\n","es_ES":"<p>Martin ''Wunder'' Hansen es constante en la calle superior. Constantemente agresivo. Incluso cuando juega con tanques como Nautilus o Maokai, Wunder está encantado de arriesgarse por un asesinato. Sus jugadas le hicieron conseguir una A/M/A de 5,2 puntos en el split de verano de la Challenger Series europea. Aun así, su estilo de juego agresivo tuvo resultados variados en el primer split de la LCS EU. Con demasiada frecuencia, traspasó el límite entre una agresividad calculada y una jugada demasiado arriesgada.</p>\n\n<p>Aprendió la lección, y en el split de verano de la LCS EU 2016, Wunder y Splyce eran de lo mejor que Europa tenía que ofrecer. El crecimiento era innegable, y Wunder se convirtió en una amenaza que había que aniquilar para evitar que llevase a su equipo directo a la victoria. Puede que Wunder destaque en Europa, pero enfrentarse a jugadores de la calle superior colosales como Smeb, Duke o Looper será un reto a superar. Nadie creía antes en Wunder ni en Splyce, y nada le gustaría más que volver a silenciar a los escépticos.</p>","pl_PL":"<p>Duński, zaledwie 17-letni top-laner jest najmłodszym zawodnikiem w LCS. Dość powiedzieć, że wymagane do udziału w tych rozgrywkach siedemnaście wiosen skończył dopiero w listopadzie 2015 roku. Na profesjonalnej scenie po raz pierwszy usłyszano o nim w czerwcu 2014 roku, kiedy dołączył do 4everzenzyg wraz z… Chresem „Sencuxem” Larsenem i Kasperem „Kobbe’m” Kobberuppem, obecnymi kolegami z drużyny. Jednak dopiero przeniesienie się do SK Gaming Prime (później Team Dignitas EU), gdzie dalej występował razem z Sencuxem, sprawiło, że kariera młodego Duńczyka nabrała rozpędu. Pierwszych występów w Challenger Series, już pod banderą organizacji Dignitas, Wunderwear nie może zaliczyć do udanych. Wielu ekspertów uważało, że był w tym czasie jednym z najsłabszych ogniw zespołu i nie do końca radził sobie z presją, która towarzyszyła zmaganiom na tym poziomie. Niemniej w ciągu dwóch splitów zmagań w EU CS zrobił duży postęp i wielki talent, który od dawna jest mu przypisywany wreszcie zaczął się w pełni ujawniać. A występy przeciwko najlepszym europejskim graczom górnej alei to coś, co z pewnością pomaga jeszcze podnieść już i tak niemałe umiejętności.</p>\n<p>\nJednocześnie Wunderwear był w letnim splicie EU Challenger Series 2015 jednym z najlepszych, o ile nie najlepszym graczem górnej alei w tych rozgrywkach, co udowadniają statystyki – najwięcej asyst, prawie najwięcej zabójstw, najwyższe KDA i prawie najwyższy udział w zabójstwach wśród top-lanerów. Duński gracz górnej alei zyskał pewność w grze i regularność.</p>\n<p>\nCo ciekawe, Wunderwear ma tendencję do grania niekiedy dość nietypowymi postaciami. To właśnie duński top-laner był pierwszym zawodnikiem, który na profesjonalnej, czy też pół-profesjonalnej, scenie zdecydował się na wybór Gankplanka po reworku tego bohatera. Dał się też poznać jako doskonały gracz Tahm Kencha na górnej alei - po rzecznego potwora sięgał kilkukrotnie, nie bojąc się wybrać tego bohatera nawet w najważniejszych spotkaniach. Widzieliśmy w rękach Duńczyka także chociażby Nautilusa czy Karmę. Można więc wnioskować, że Wunderwear jest w stanie porwać za sobą tłumy europejskich kibiców, którzy przecież uwielbiają zawodników grających niestandardowymi postaciami, o czym przekonaliśmy się poprzez ogromny wzrost popularności zespołu Unicorns of Love po barażach o grę w LCS 2015 i IEM-ie w San Jose w tym samym roku.\n</p>","es_AR":"<p>Martin \"Wunderwear\" Hansen es sólido en el carril superior... sólido y agresivo. Incluso jugando con Nautilus y Maokai, a Wunderwear le encanta lograr una cantidad exagerada de asesinatos. Sus locuras le merecieron un KDA de 5.2 puntos en el torneo de clausura de la Challenger Series EU 2015. Aún así, su estilo de juego agresivo tuvo resultados muy variados en su primer torneo de la LCS EU. Casi siempre ha combinado una agresión calculada con un accionar totalmente temerario.</p>\n\n<p>Aprendió su lección, y en el torneo de clausura de la LCS EU 2016, Wunder y Splyce se convirtieron en lo mejor que Europa tenía para ofrecer. Su crecimiento era indiscutible, y Wunder pasó a ser una amenaza que sus rivales debían neutralizar si querían evitar que llevara a su equipo directo hacia la victoria. Puede que Wunder se destaque en Europa, pero jugar contra colosales carriles centrales superiores como Smeb, Duke y Looper será un reto totalmente diferente. Nadie creyó en Wunder y Splyce antes, y este jugador muere por silenciar una vez más la boca de aquellos que dudaron de él.</p>"},"foreignIds":{"drupalId":"2895","TRLH3":"200000103","TRLH4":"200000206"},"socialNetworks":{"twitter":"twitter.com/SPY_WUNDERLOLXD","twitch":"twitch.tv/Wunderwearisfame","facebook":"http://facebook.com/Wunderwearlol"},"champions":[],"liveGameTeam":97},{"id":588,"slug":"kobbe","name":"Kobbe","firstName":"Kasper","lastName":"Kobberup","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kobbe-adbtha0l.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-09T10:31:56.000Z","bios":{"en_US":"<p>Kasper “Kobbe” Kobberup didn’t always want to be a professional gamer. He was dedicated to football before an injury sent him to the sideline and he had to rethink his options. Luckily for Splyce, Kobbe took up League of Legends. Before long, he became one of the best up-and-coming ADCs in Europe.</p>\n\n<p>Like the rest of Splyce, Kobbe was disappointed by his performance at the 2016 World Championship. But the international experience should make Kobbe and Splyce even better if they can learn from it. The next time elite opponents stare him down, Kobbe will be ready to blow right past them.</p>","de_DE":"<p>Kasper „Kobbe“ Kobberup wollte nicht immer ein professioneller Spieler werden. Er war ein leidenschaftlicher Fußballspieler, bevor ihn eine Verletzung auf die Ersatzbank zwang und er seine Optionen überdenken musste. Zum Glück für Splyce begann Koppe, League of Legends zu spielen. Es dauerte nicht lange, bis er zu einem der besten Nachwuchs-ADCs Europas wurde.\n\nWie der Rest von Splyce war auch Kobbe mit seiner Vorstellung bei der Weltmeisterschaft 2016 nicht zufrieden. Aber wenn Kobbe und Splyce aus der internationalen Erfahrung lernen konnten, sollten sie jetzt sogar noch besser sein. Wenn er das nächste Mal von Elite-Gegnern finster angestarrt wird, kann Kobbe einfach vorbeistürmen.</p>","fr_FR":"<p>Kasper « Kobbe » Kobberup sera-t-il le nouveau Jesper « Niels » Svenningsen ? C’est probablement la question qui sera posée dorénavant à chaque nouveau carry ad qui arrive en LCS EU. Sans lui imposer une trop forte pression sur les épaules, on peut déjà estimer que Kobbe a les moyens de se faire un nom pour lui-même. Le joueur danois, passé par Gamers 2 mais aussi brièvement par la structure française Millenium en 2015 a véritablement explosé sur la scène challenger au printemps de l’année écoulée quand il a rejoint son équipe actuelle. Ce qui était à l’époque Dignitas EU a eu le nez creux en recrutant deux semaines après le début des Challenger Series son nouveau carry AD. Celui-ci, alors en duo avec Erih « Voidle » Sommermann sur la voie du bas, n’a pourtant pas révélé tout de suite l’étendue de son talent. Il a fallu pour cela attendre le segment d’été des Challenger Series et l’arrivée à ses côtés d’un nouveau support, Nicolai « Nisbeth » Nisbeth. Les deux danois ont trouvé une synergie très efficace, qui leur a permis de surclasser la concurrence et d’être de l’avis général le meilleur binôme carry AD/Support de la scène challenger.   Une synergie qui va néanmoins être mise à rude épreuve face à celle de duos LCS plus expérimentés. Malgré tout, s’il est peu probable de retrouver dès cette année Splyce et Kobbe en demi –finale des championnats du monde, le joueur a largement les moyens d’imposer son style de jeu et son nom en bonne place aux côtés de ses glorieux ainés. </p>","es_ES":"<p>Antes de jugar a League of Legends, Kasper ''Kobbe'' Kobberup se dedicaba al fútbol. Cuando una lesión lo obligó a retirarse, reconsideró sus opciones, y por suerte para nosotros, el fin de un sueño es el momento perfecto para el inicio de otro. Kobbe dedicó su tiempo en el banquillo de fútbol a convertirse en jugador profesional de videojuegos.</p>\n\n<p>Tras una actuación dominante en la Challenger Series europea de 2015, Kobbe llegó a la LCS EU. Aunque estuvieron a punto de ser eliminados, Kobbe y Splyce sorprendieron a todo el mundo y obtuvieron un segundo puesto en el split de verano de la LCS EU 2016. Además de eso, ayudó a asegurarle un puesto a Splyce en el Mundial en su segundo split en acción en la LCS EU. Señalado como uno de los AD carries más prometedores de Europa, Kobbe tiene ahora la oportunidad de medir su entereza con la élite internacional. Es una lucha a vida o muerte para Kobbe, y si tomamos el pasado como referencia, llegado el momento de la partida, elegirá vivir.</p>","pl_PL":"<p>Gra urodzonego w 1996 roku Duńczyka nie jest może tak widowiskowa jak chociażby jego kolegi z drużyny Chresa „Sencuxa” Larsena, ale Kobbe jest niesamowicie regularnym graczem, a także bardzo istotnym elementem zespołu. Jego opanowanie i zdolność do utrzymania przez długi czas wysokiego poziomu doskonale równoważy wahania formy duńskiego i mid-lanera i sprawia, że ekipa Splyce ma na kim oprzeć swoją grę, podczas gdy Sencuxowi przydarzy się gorsza gra. Kobbe to na pierwszy rzut oka bardzo niepozorny strzelec, ale w letnim splicie Challenger Series 2015 nie było żadnego gracza na jego pozycji, który mógłby równać się z Duńczykiem. Najwięcej zabójstw i asyst, najmniej śmierci i niesamowite KDA na poziomie 10,5 sprawiają, że Kobbe wydaje się być najbardziej niedocenianym zawodnikiem w składzie beniaminka EU LCS. </p>\n<p>\nJednocześnie warto zauważyć, że Kobbe zwrócił uwagę czołowych drużyn w Europie już nieco wcześniej, gdy udało mu się dostać do pierwszej dziesiątki SoloQ zachodnio-europejskiego serwera. Miało to miejsce w trakcie letniego splitu 2015 i wtedy też pojawiały się pogłoski o tym, że miałby dołączyć do Teamu ROCCAT, który szukał strzelca w miejsce Pawła „Woolite’a” Pruskiego. Ostatecznie jednak Kobbe pozostał w Dignitas EU, a ROC sięgnął po Rasmusa „MrRalleza” Skinneholma. </p>\n<p>\nAle gdy my sięgniemy jeszcze dalej w przeszłość, zobaczymy, że Kobbe już od dłuższego czasu kręcił się najpierw w okolicach Challenger Series z Denial eSports i 4everzenzyg (od maja do listopada 2014), a później poczynał sobie coraz śmielej i występował w kilku ciekawych zespołach o LCS-owych aspiracjach. Wymienić tu można chociażby Gamers2, gdzie Kobbe przez krótki czas grał u boku m.in. obecnego wspierającego Teamu SoloMid – Raymonda „KaSinga” Tsanga czy późniejszego dżunglera Dignitas EU – Dennisa „Obviousa” Sørensena. Kolejnym przystankiem na drodze duńskiego strzelca było Millenium, ale także tutaj nie zabawił zbyt długo i wkrótce dołączył do Teamu Dignitas EU, z którym to po dwóch splitach zmagań w Challenger Series, w końcu udało mu się dostać do LCS-u na wiosenną edycję 2016. Konsekwencja, której nie brakuje Kobbe’mu także na Polach Sprawiedliwości w końcu zaowocowała.</p>\n<p>\n„Jest naprawdę dobrym strzelcem z solidną fazą linii i umiejętnością gry w zespole. Doskonale wie jak pozycjonować się w walkach drużynowych” – powiedział o swoim byłym koledze z drużyny francuski top-laner Julian „GoB” Treguer dla portalu Millenium.org.</p>\n<p>\nCiekawostką jest fakt, że Kobbe na wysokim poziomie gra nie tylko w League of Legends. Duński ADC, którego graniem w gry zaraził brat, był w przeszłości miłośnikiem Warcrafta 3, World of Warcraft oraz Diablo 2, a do tej pory zdarza mu się zagrać w CS:GO, gdzie udało mu się zdobyć najwyższą możliwą rangę – Global Elite.\n</p>","es_AR":"<p>Antes de jugar League of Legends, Kasper \"Kobbe\" Kobberup se dedicaba al fútbol. Luego de una lesión que lo dejó fuera del campo de juego, tuvo que reconsiderar sus opciones para el futuro. Por suerte para nosotros, el final de un sueño puede ser el comienzo de otro. Kobbe aprovechó el tiempo que pasó en el banco de suplentes para convertirse en video jugador profesional.</p>\n\n<p>Luego de una actuación dominante en la Challenger Series EU 2015, Kobbe pasó a formar parte de la LCS EU. Después de casi descender, Kobbe y Splyce sorprendieron a todos con un segundo lugar en el torneo de clausura de la LCS EU 2016. Además de esto, ayudó a Splyce a guardarse un lugar en el Mundial en su segundo torneo dentro de la escena de la LCS EU. Aclamado como uno de los mejores y prometedores ADC de Europa, Kobbe tiene la oportunidad de probar su valía contra enemigos internacionales de élite. Para Kobbe, las opciones son matar o morir, y su historia indica que escogerá la primera llegado el momento de jugar.</p>"},"foreignIds":{"drupalId":"2699","TRLH3":"200000106","TRLH4":"200000209"},"socialNetworks":{"twitch":"twitch.tv/kobbelol","facebook":"facebook.com/Kobbelol","twitter":"twitter.com/SPY_Kobbe"},"champions":[],"liveGameTeam":97},{"id":613,"slug":"jactroll","name":"Jactroll","firstName":"Jakub","lastName":"Skurzyński","roleSlug":"support","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/templateSilhoutte_4.jpg","hometown":null,"region":null,"birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-08-17T23:47:22.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4425","ESPORTSTMNT02":"200002474","TRLH4":"200000465","TRLH3":"200000366"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":663,"slug":"gripex","name":"Gripex","firstName":"Jesper","lastName":"Terkildsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gripex-6b756abo.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-18T21:24:08.000Z","bios":{"en_US":"","es_AR":"<p>Jesper \"Gripex\" Terkildsen es el junglero suplente de Splyce.</p>"},"foreignIds":{"drupalId":"4545","TRLH4":"200000211","TRLH3":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":954,"slug":"mikyx","name":"Mikyx","firstName":"Mihael","lastName":"Mehle","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikyx-dbj14d9y.png","hometown":"","region":"EU LCS","birthdate":"","createdAt":"2016-01-05T19:47:13.000Z","updatedAt":"2017-06-09T11:10:17.000Z","bios":{"en_US":"<p>Mihael \"Mikyx\" Mehle is a support prodigy for Splyce. He's the only member of Splyce who wasn't on the team when they clawed their way out of the 2016 EU LCS Summer Promotion Tournament. As a rookie in the Summer Split, he brought a new level of playmaking to Splyce from the support position. Despite his inexperience, he helped Splyce go from rags to riches and earn a spot at the 2016 World Championship.</p>\n\n<p>At Worlds, Mikyx finally showed weakness. As he returns with the rest of Splyce for 2017, he'll get his first full season in the EU LCS to improve his talents. With his career still in its infancy, Mikyx has plans to attend Worlds for many years to come.</p>","de_DE":"<p>Mihael „Mikyx“ Mehle ist das Supporter-Wunderkind von Splyce. Er ist das einzige Mitglied, das beim erbitterten Kampf der Mannschaft im Sommer-Aufstiegsturnier der EU LCS 2016 nicht dabei war. Er ging als Nachwuchsspieler in den Sommer-Split und schaffte es dennoch, die Rolle des Spielmachers neu zu definieren. Trotz seiner geringen Erfahrung half er Splyce dabei, einen fulminanten Aufstieg hinzulegen und sich einen Platz bei der Weltmeisterschaft 2016 zu sichern.\n\nBei der Weltmeisterschaft zeigte Mikyx dann erstmals Schwäche. Wenn er 2017 mit dem Rest von Splyce zurückkehrt, kann er sein Können in seiner ersten kompletten Saison in der EU LCS verbessern. Da seine Karriere immer noch in den Kinderschuhen steckt, hat Mikyx vor, noch an vielen Weltmeisterschaften teilzunehmen.</p>","fr_FR":"<p>Mihael « Mikyx » Mehle a rejoint les rangs de Splyce en tant que support titulaire au début du segment d’été 2016. D’origine slovène il a été le support remplaçant de Fnatic durant le segment de printemps. Néanmoins, il n’a jamais été titularisé et ce sera donc avec Splyce qu’il fera ses premiers pas sur la scène compétitive des LCS durant ce segment d’été. </p>","pl_PL":"<p>Mihael „Mikyx” Mehle to zawodnik ze Słowenii, który swoje pierwsze kroki w profesjonalnym graniu stawiał w rodzimym zespole Bottled Water. Interesującym momentem w jego karierze okazało się dołączenie do legendarnego Fnatic w roli rezerwowego wspierającego. Wtedy 18-latek dał się poznać jako doskonały zawodnik soloQ, a jego talent chwalili tak znakomici zawodnicy jak Lee „Spirit” Da-yoon czy Jesper „Zven” Svenningsen, jednocześnie zwracając jednak uwagę na wąski champion pool młodego gracza. We Fnatic jednak Mikyx nie miał szans na grę, a dodatkowo jego sytuację skomplikował powrót do zespołu Bory „YellOwStaR’a” Kima.</p>\n<p>W tym czasie Mikyx otrzymał jednak ofertę ze Splyce, które dawało mu szansę sprawdzenia się na najwyższym europejskim poziomie rozgrywkowym – w EU LCS, z której to propozycji Słoweniec oczywiście skorzystał. W nowym zespole zastąpił Nicolaia „Nisbetha” Nisbetha i sprawił, że dotychczas jednonarodowościowy skład przestał być w pełni duński. Zarówno zawodnicy, jak i kibicie wierzą jednak, że Słoweniec będzie wzmocnieniem dla drużyny i że z w nim w składzie Splyce powalczy o coś więcej niż utrzymanie. Co ciekawe, Mikyx już wcześniej często grał w dynamicznej kolejce razem z Chresem „Sencuxem” Laursenem i Kasperem „Kobbe’em” Kobberupem, dzięki czemu zawodnicy ci zdążyli już zbudować podstawy synergii. Dotychczas Słoweniec dał się poznać przede wszystkim jako znakomity gracz Thresha i Morgany.</p>\n<p>„Mikyx ma wszelkie cechy, które w mojej opinii tworzą najlepszych zawodników w LCS. Posiada pasję i jest zmotywowany, by ciągle stawać się lepszym. Okazuje też wielki szacunek dla gry i samych graczy. Żeby nie wspomnieć o ogromnym talencie, który posiada.” – powiedział o swoim nowym zawodniku trener Splyce Jakob  „YamatoCannon” Mebdi.</p>\n","es_AR":"<p>Mihael \"Mikyx\" Mehle es la nueva edición del plantel inicial de Splyce. Al llegar a lo más alto del juego en solitario en nivel Aspirante, fue descubierto por Fnatic y escogido como soporte suplente para el torneo de apertura de la LCS EU 2016.</p>\n\n<p>En abril, Mikyx dejó Fnatic para convertirse en el nuevo soporte inicial de Splyce luego de que Nicolai \"Nisbeth\" Nisbeth se hiciera a un lado, y hay que decir que su presencia se hizo notar. La suerte se puso aún más del lado de Splyce durante el torneo de clausura, en el que la dupla de carriles inferiores formada por Kobbe y Mikyx estuvo asombrosamente afilada. Mikyx demostró una gran habilidad para crear jugadas con campeones como el Bardo, y lanzó habilidades definitivas determinantes por toda la Grieta con gran facilidad. Es muy poco común ver a un jugador principiante tan talentoso como Mikyx en los Mundiales. Su actuación le ha dado una oportunidad de jugar con las leyendas que el siempre ha querido ser.</p>","es_ES":"<p>Mihael ''Mikyx'' Mehle es el miembro más nuevo de la alineación principal de Splyce. Destacaba en el juego en solitario en el nivel Aspirante, así que Fnatic lo tuvo en cuenta y lo fichó como apoyo suplente durante el split de primavera de la LCS EU.</p>\n\n<p>En abril, Mikyx dejó Fnatic y pasó a ser el apoyo titular de Splyce, en sustitución de Nicolai ''Nisbeth'' Nisbeth, y lo dio todo en sus jugadas. La suerte de Splyce mejoró en el split de verano, ya que el dúo de la calle inferior, Kobbe y Mikyx, estuvo increíblemente avispado. Mikyx demostró una gran habilidad para facilitar jugadas con campeones como Bardo, con quien es capaz de lanzar fácilmente su definitiva desde la otra punta de la Grieta y propiciar así un giro en la partida. Es raro ver talentos como Mikyx en el escenario del Mundial tan pronto en su trayectoria profesional, pero se ha ganado esta oportunidad de jugar con las leyendas en las que se quiere convertir.</p>"},"foreignIds":{"TRLH3":"200000107","TRLH4":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1263,"slug":"night","name":"NighT","firstName":"Gun-woo","lastName":"Na","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/night-1h7mtavw.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-05-18T16:13:54.000Z","updatedAt":"2017-06-18T19:37:28.000Z","bios":{"en_US":"<p>Gun-woo \"NightT\" Na was one of the best surprises in the 2016 EU LCS Summer Split. Originally from South Korea, he made his way to Europe in order to jumpstart his career with Giants. He wasted no time in showcasing his electric play style. His ability to completely take control of games dazzled viewers and peers alike. In his first LCS Split, he took home the honor of the league’s Most Outstanding Rookie award. With a largely new supporting cast around him, Night will look to carry Giants through another split against the greatest teams in Europe. Don’t sleep on him -- we’ve already made that mistake once.</p>","de_DE":"<p>Gun-woo „NightT“ Na war eine der größten Überraschung des EU LCS Sommer-Splits 2016. Um seiner Karriere mit den Giants auf die Sprünge zu helfen, ist er von Südkorea nach Europa gezogen und hat umgehend seinen elektrisierenden Spielstil präsentiert. Seine Fähigkeit, ein Spiel komplett unter seine Kontrolle zu bringen, begeisterten Zuschauer und Kollegen gleichermaßen. In seinem ersten LCS-Split wurde er mit dem Titel „Herausragendster Nachwuchsspieler“ geehrt. Mit großteils neuen Spielern in seinem Team wird er in diesem Split erneut versuchen, die Giants gegen die besten Teams Europas zum Sieg zu führen. Man sollte ihn auf keinen Fall abschreiben – diesen Fehler haben wir schon einmal gemacht.</p>","fr_FR":"<p>Gun-woo « NighT » Na est un joueur professionnel originaire de Corée. Il débute sa carrière en mars 2015 au sein de l'équipe Winners qui devient plus tard Ever8 Winners. NighT et ses équipiers échouent à se qualifier en LCK et le midlaner décide alors de venir en Europe.</p>\n\n<p>C'est dans l'équipe Giants Gaming qu'il trouve un nid, suite au départ du midlaner Isaac « xPepii » Flores. En plus de s'adapter à de nouveaux équipiers, NighT devra remplacer la figure de proue de l'équipe qui était plutôt populaire en compétition européenne.</p>\n","pl_PL":"<p>Młody i utalentowany środkowy, Gun-woo „NightT” Na, został odkryty dopiero w trakcie trwania piątego sezonu. Został zauważony w marcu 2015 roku przez zespół Winners, który zdecydował się dać mu szansę gry na środkowej linii. Podczas członkostwa w tej organizacji, w styczniu 2016 roku przemianowanej na Ever8 Winners, pokazał, ile jest naprawdę wart. W jej szeregach miał okazję konkurować w drugorzędnej koreańskiej lidze o kwalifikację do zdecydowanie bardziej prestiżowej – LCK. Największym osiągnięciem było zajęcie pierwszego miejsca w Challengers Korea Spring 2015 Series 2, dzięki czemu mógł zawalczyć o awans. W kwalifikacjach odbywających się w maju 2015 roku został pokonany. Aczkolwiek to nie zaważyło na jego woli walki, ponieważ wziął udział w dwóch kolejnych sezonach drugorzędnych koreańskich rozgrywek, próbując dostać się do ligi LCK. Niestety dla niego, Gun-woo „Night” Na dwukrotnie skończył na trzecim miejscu, które nie dawało szansy na walkę o awans. Dlatego w maju 2016 roku zdecydował się opuścić drużynę Ever8 Winners i poszukać szczęścia gdzie indziej.</p>\n<p>Podczas swoich występów w Korei Południowej, od marca 2015 roku do maja 2016 roku, dał się zapamiętać widzom jako znakomity środkowy. Jego zdolności często decydowały o wyniku meczu, w szczególności, kiedy grał swoimi ulubionymi bohaterami. Gun-woo „Night” Na zasługuje na szczególne uznanie ze względu na fantastyczne wyniki na scenie esportowej w grze Zileanem. Statystyki mówią same za siebie. Koreańczyk wygrał wszystkie osiem meczów, w których wybrał Strażnika Czasu, osiągając zawrotny udział w zabójstwach całej drużyny – prawie 70%. Stać go było na równie fenomenalne wyniki innymi postaciami. Corkim też udało mu się uzyskać 100% zwycięstw, a Azirem brał udział w 81% zabójstw drużyny i zabijał średnio 450 stworów na grę. Podobnie rewelacyjne wyniki miał innymi magami, takimi jak Cassiopeia czy Veigar. Te wyniki robiły wrażenie na wszystkich zainteresowanych e-sportem, co sprawiło, że został zauważony przez drużynę Giants Gaming.</p>\n<p>W maju 2016 roku Gun-woo „Night” Na dostał od hiszpańskiej organizacji propozycję gry w europejskiej lidze EU LCS, ponieważ został wypatrzony przez jej łowcę talentów. Analityk wyraził się o utalentowanym środkowym w samych superlatywach. Według niego nadawał się nawet do czołowych drużyn z ligi LCK, lecz wolał walczyć w zespole Ever8 Winners wraz ze swoimi przyjaciółmi. Przeprowadzka z rodzimej Korei do Europy na pewno była poważnym wyzwaniem, lecz okazja zagrania w pierwszorzędnej lidze skusiła młodego Koreańczyka. Oczywiście przenosiny wiązały się z podjęciem przez niego zajęć z języka angielskiego i pojawieniem się na portalach społecznościowych. </p>\n","en_AU":"","el_GR":"","es_AR":"","cs_CZ":"","hu_HU":"","en_GB":"","it_IT":"","ko_KR":"","pt_BR":"","ro_RO":"","ru_RU":"","en_PL":"","es_MX":""},"foreignIds":{"TRLH3":"200000097","TRLH4":"200000200","ESPORTSTMNT02":"200002475"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1340,"slug":"jiizuke","name":"Jiizuke","firstName":"Daniele","lastName":"Di Mauro","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jiizuké-3ahsxss5.png","hometown":"Italy","region":"EU CS","birthdate":null,"createdAt":"2016-06-03T17:14:16.000Z","updatedAt":"2017-08-17T23:46:44.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"435054","TRNA1":"1000525112","TREU":"1000565128","ESPORTSTMNT02":"200001981","TRLH4":"200000460","TRLH3":"200000361"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1638,"slug":"th3antonio","name":"Th3Antonio","firstName":"Antonio","lastName":"Espinosa Bejarano","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/th3antonio-1ld47lwj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:31:18.000Z","updatedAt":"2017-06-18T19:34:37.000Z","bios":{},"foreignIds":{"TRLH3":"200000101","TRLH4":"200000204","ESPORTSTMNT02":"200002382"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":1771,"slug":"annes","name":"Annes","firstName":"Annes","lastName":"Ravkic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/annes-47wl5dqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-02-10T15:25:24.000Z","updatedAt":"2017-05-31T21:46:49.000Z","bios":{},"foreignIds":{"TRLH3":"200000226","TRLH4":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":2005,"slug":"ruin","name":"Ruin","firstName":"HyongMing","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ruin-5x5ydttj.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:10:01.000Z","updatedAt":"2017-08-17T23:48:00.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002470","TRLH4":"200000458","TRLH3":"200000359"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2006,"slug":"minitroupax","name":"Minitroupax","firstName":"Amadeu","lastName":"Carvalho","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/minitroupax-dxct0i67.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:20:24.000Z","updatedAt":"2017-08-17T23:34:16.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002381","TRLH4":"200000461","TRLH3":"200000362"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2007,"slug":"rayito","name":"Rayito","firstName":"Michael","lastName":"Curtet","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rayito-bja13v00.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:14:53.000Z","updatedAt":"2017-07-30T13:45:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002471","TRLH4":"200000462"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2008,"slug":"razork","name":"Razork","firstName":"Iván","lastName":"Martin","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/razork-1ixthp1c.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:23:54.000Z","updatedAt":"2017-07-30T13:46:23.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002472","TRLH4":"200000463"},"socialNetworks":{},"champions":[],"liveGameTeam":54},{"id":2009,"slug":"joo","name":"Joo","firstName":"Joao","lastName":"Pereira","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/joo-ignlaqyd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:18:03.000Z","updatedAt":"2017-07-30T13:47:29.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002473","TRLH4":"200000464"},"socialNetworks":{},"champions":[],"liveGameTeam":54}],"scheduleItems":[{"id":"AVmJu7gdoUG4HPFjOKIm","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:dcaf17f6-75e8-4460-bf1b-8418d7537540","scheduledTime":"2017-03-03T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"6","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:612571e5-a5ba-4462-8221-9ed073eebeb5"},"match":"dcaf17f6-75e8-4460-bf1b-8418d7537540","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"612571e5-a5ba-4462-8221-9ed073eebeb5","league":"3"}],"gameIdMappings":[{"id":"33549413-81af-4f2c-b851-e29f24c89b14","gameHash":"c6b5c01233cdf54c"},{"id":"41edc3fa-bd23-4a91-aa53-e4de107b75bb","gameHash":"0c8bb595be5bb54e"}],"videos":[{"id":5836,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:41edc3fa-bd23-4a91-aa53-e4de107b75bb","source":"https://www.youtube.com/embed/Xk7mDjFAuAg?wmode=transparent","createdAt":"2017-03-03T19:41:53.000Z","updatedAt":"2017-03-03T19:41:53.000Z","game":"41edc3fa-bd23-4a91-aa53-e4de107b75bb"},{"id":5855,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:33549413-81af-4f2c-b851-e29f24c89b14","source":"https://www.youtube.com/embed/l2wZwN4rJHk?wmode=transparent","createdAt":"2017-03-04T05:18:29.000Z","updatedAt":"2017-03-04T05:18:29.000Z","game":"33549413-81af-4f2c-b851-e29f24c89b14"}],"htmlBlocks":[],"match":{"id":"dcaf17f6-75e8-4460-bf1b-8418d7537540","name":"SPY-vs-GIA","position":20,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"games":{"9d69d61b-ed9c-43e3-aa5a-2aeb844d3944":{"id":"9d69d61b-ed9c-43e3-aa5a-2aeb844d3944","name":"G3","generatedName":"GIA|SPY|G3|dcaf17f675e84460bf1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"33549413-81af-4f2c-b851-e29f24c89b14":{"id":"33549413-81af-4f2c-b851-e29f24c89b14","name":"G2","generatedName":"GIA|SPY|G2|dcaf17f675e84460bf1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"},{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}],"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488604517582,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488569762010,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001980215","gameRealm":"TRLH3","platformId":"TRLH3:1001980215","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"41edc3fa-bd23-4a91-aa53-e4de107b75bb":{"id":"41edc3fa-bd23-4a91-aa53-e4de107b75bb","name":"G1","generatedName":"GIA|SPY|G1|dcaf17f675e84460bf1","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"},{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488569922337,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488566982353,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001980208","gameRealm":"TRLH3","platformId":"TRLH3:1001980208","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488604517582,"source":"bestOf","history":[{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488569922337,"source":"bestOf","closed":true},{"result":[[{"roster":"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf"}],[{"roster":"0dba28fa-f921-4b54-87f5-d68be03505ff"}]],"timestamp":1488569762010,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"6cbf7e94-8c4d-4e84-b97e-56ea60e720cf":1,"0dba28fa-f921-4b54-87f5-d68be03505ff":0}}}