{"teams":[{"id":18,"slug":"cloud9","name":"Cloud9 ","guid":"be6c8a00-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cloud9-gnd9b0gn.png","acronym":"C9","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-01T18:45:39.000Z","updatedAt":"2017-08-02T22:06:55.000Z","bios":{"en_US":"<p>The dream meme team is back for 2017 with some promising new additions. Although Cloud9 performed the best of any North American team at the 2016 World Championship, they weren’t satisfied with their quick exit in the quarterfinals. Former Challenger scene standout Contractz was handed the reigns to the jungle in his rookie season. The team also acquired Ray, Apex Gaming’s former playmaking top laner. \n\n<p>Despite a strong split, the team once again fell to TSM in the 2017 NA LCS Spring Split finals. Heading into summer, if Cloud9's young players can hone their raw talent, the team could rise to new heights this year.</p>\n\n<p>Coach: Han-gyu \"Reapered\" Bok<p>","fr_FR":"<p>Cloud9 a fait une entrée fracassante sur la scène compétitive de League of Legends pendant la saison 3, lors du segment d'été des LCS NA, avec un score astronomique de 25-3. Suite à ses débuts spectaculaires, l'équipe a fait plusieurs apparitions lors de championnats régionaux et internationaux, allant des play-offs régionaux des LCS NA au Championnat du monde. Toutefois, Cloud9 est tombée de son piédestal en 2015, retombant à la 7e place du segment d'été des LCS NA 2015. Malgré un parcours bien ficelé jusqu'en finale du tournoi régional NA 2015 qui a valu à C9 de se qualifier pour le Championnat du monde 2015, les performances de l'équipe ont soulevé de nombreuses questions. Reste à savoir si ses membres possèdent encore le talent nécessaire pour s'imposer comme ils ont su le faire par le passé.</p>","pl_PL":"<p>C9 to, obok Teamu SoloMid, najbardziej utytułowana amerykańska organizacja w historii. Cloud9 znane jest z utrzymywania nieustannie wysokiego poziomu oraz przywiązania do graczy. Podczas gdy inne drużyny dokonują co najmniej kilku zmian rocznie, w zespole, której symbolem jest niebieska chmurka, przez pierwsze dwa lata współpracy… nie było żadnych rotacji.</p>\n<p> \nZaczęło się zwyczajnie, od przygody z Quantic Gaming, gdzie w 2012 roku występował obiecujący skład złożony z Haia, LemonNationa, Nientosoha, Wild Turtle’a i Yazukiego. Pierwsze podejście drużyny do NA LCS było nieudane, ale na początku 2013 roku gracze i organizacja zdecydowali się dać sobie drugą szansę w nieco zmienionym składzie, a do zespołu dołączyli Balls, Meteos i Sneaky. Formacja bez trudu przeszła eliminacje i po zwycięstwie w meczu barażowym dostała się do letniego splitu NA LCS 2013. Miała to być dopiero druga edycja rozgrywek, a jednocześnie początek legendy Cloud9.</p>\n<p>\nByło powszechnie wiadomo, że nowy zespół w stawce jest naprawdę dobry, ale nie że aż tak dobry. Cloud9 całkowicie zdominowało rozgrywki, ustanawiając niewyobrażalny rekord 25-3, bo tyle wynosił bilans drużyny na koniec sezonu zasadniczego. C9 nie zamierzało jednak poprzestawać na wygraniu sezonu zasadniczego i w play-offach poszło za ciosem – 2:0 z Dignitas i 3:0 z TSM-em w finale zapewniły beniaminkowi triumf w debiutanckim splicie w NA LCS.</p>\n<p>\nTo z kolei pozwoliło Cloud9 na wyjazd na Mistrzostwa Świata. Oczekiwania kibiców były ogromne, ale zespół nie sprostał presji, odpadając z rywalizacji w swoim pierwszym meczu, w ćwierćfinale przeciwko Fnatic. Tę klęskę C9 powetowało sobie na krajowym podwórku – rok 2014 znów stał pod znakiem niebieskobarwnej dominacji, czego dowodzi kolejny fantastyczny split zakończony wynikiem 24-4 i triumf w wiosennych play-offach. Latem z formą zespołu było już nieco gorzej, a wygranie fazy zasadniczej przyszło C9 z dużym trudem. Ostatecznie w finale play-offów Cloud9 było zmuszone uznać wyższość Teamu SoloMid. Wystarczyło to, by po raz kolejny pojechać na światowy czempionat i niestety po raz kolejny zawodnicy C9 wracali ze spuszczonymi głowami po odpadnięciu w ćwierćfinale.</p>\n<p>\nWiosna 2015 była już łabędzim śpiewem formacji, której po raz kolejny udało się dostać do finału play-offów NA LCS. Tam jednak nie sprostali świetnie dysponowanemu Teamowi SoloMid, który po raz drugi z rzędu zwyciężył w rozgrywkach, jednocześnie po raz drugi spychając C9 na drugą pozycję.</p>\n<p>\nTo jednak był dopiero początek problemów zespołu, który coraz bardziej oddalał się od swoich najlepszych czasów. Narastające wewnętrzne problemy oraz uciążliwe kontuzje zmusiły Haia „Haia” Lama do rezygnacji z występów. Legendę zespołu zastąpił na środkowej alei ogromny duński talent, Nikolaj „Incarnati0n” Jensen, który został właśnie dopuszczony do grania na profesjonalnej scenie. Szybko okazało się jednak, że Incarnati0n potrzebuje trochę czasu na aklimatyzację, a cały zespół – Haia. Zastąpienie doświadczonego shot-callera okazało się niemożliwe i gra zespołu, który okupował dolne rejony tabeli, nie wyglądała najlepiej. Hai wrócił, zastępując Williama „Meteosa” Hartmana w roli dżunglera i doprowadził formację do utrzymania, a dzięki niezłej wiośnie, drużyna dostała się również do baraży o wyjazd na Mistrzostwa Świata. I znów – udało się. Co ciekawe, C9 było w tym splicie bliskie odpadnięcia z rywalizacji, a bezpieczne, siódme miejsce wywalczyło dopiero w dodatkowym meczu barażowym przeciwko Teamowi 8.</p>\n<p>\nNa MŚ, po pierwszej rundzie fazy grupowej, wydawało się, że sen C9 będzie trwał – drużyna wygrała wszystkie trzy mecze i mogło było odnieść wrażenie, że tylko kataklizm może pozbawić ją miejsca w ćwierćfinale. No cóż – trzy porażki i przegrana w barażach o drugie miejsce okazały się właśnie takim kataklizmem. Nie udało się. Zespół przygotowuje się do sezonu 2016 bogatszy o ostatnie doświadczenia i zamierza powrócić na pierwsze miejsce, a pomóc mają interesujące zmiany w składzie.</p>\n<p>\nW przerwie między rozgrywkami Hai przeniósł się na pozycję wspierającego, którą pełnić będzie wespół z utalentowanym Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity. Pozycję dżunglera zajął natomiast rozchwytywany po rozpadzie Teamu Impulse Koreańczyk Lee „Rush” Yoon-jae, który był objawieniem sezonu 2015 w NA LCS.</p>\n","de_DE":"Das Meme-Dream-Team kehrt 2017 mit einigen vielversprechenden Neuzugängen zurück. Obwohl Cloud9 das beste nordamerikanische Team bei der Weltmeisterschaft 2016 war, gaben sie sich mit dem schnellen Ausscheiden im Halbfinale nicht zufrieden. Contractz, der vor allem durch seine Leistungen in der Challenger Series bekannt wurde, übernimmt in seiner ersten Saison die Führung im Dschungel. Das Team hat außerdem Ray aufgenommen, der früher als Spielmacher bei Apex Gaming in der oberen Lane tätig war. Wenn sie es schaffen, ihr rohes Talent mit den Führungsqualitäten der Veteranen zu kombinieren, könnte Cloud9 dieses Jahr neue Höhen erklimmen.</p>\n<p>\nCoach: Trainer: Han-gyu „Reapered“ Bok</p>\n","es_ES":"<p>Nadie puede discutir que el camino para llegar al Mundial de Cloud9 ha sido más duro que el de ningún otro equipo. Tras una dolorosa derrota contra TSM en la final de la LCS NA, el equipo consiguió una vez más superar el clasificatorio regional y reservarse el último puesto para representar a Norteamérica en el Mundial. Ha sido un viaje agotador, pero la experiencia seguro que no tiene precio. Cloud9 ya ha jugado cinco enfrentamientos al mejor de 5 sin haber pisado aún siquiera el escenario del Mundial.</p> \n<p>Tras una temporada regular durante la que tuvieron problemas de coordinación en algunos momentos, han jugador de forma mucho más coherente durante los playoffs. Si pueden sacar provecho de su arduo camino hasta el Mundial, van a ser una fuerza a tener en cuenta en el escenario internacional.</p>","pt_BR":"É difícil negar que alguma outra equipe teve um caminho mais árduo para o Mundial do que a Cloud9. Depois de uma derrota arrasadora para a TSM nas Finais de Verão da NA LCS, a equipe se reergueu e lutou mais uma vez pelas Classificatórias Regionais para conseguir a última vaga da América do Norte para o Mundial. A jornada foi difícil, mas a experiência pode ter sido de grande valor. Cloud9 agora já jogou cinco partidas separadas de Melhor de 5 antes mesmo de ir para o Mundial. Depois de uma temporada regular que mostrou algumas dificuldades em sinergia, eles estavam muito mais coesos nas eliminatórias. Se eles puderem usar seu árduo caminho para o Mundial como uma vantagem, eles certamente serão uma força a ser reconhecida no palco internacional","es_AR":"<p>Es muy difícil encontrar un equipo que haya luchado más que Cloud9 para llegar al Mundial. Después de una desgarradora derrota ante TSM en la final del torneo de clausura de la LCS NA, el equipo se repuso y volvió a competir en las clasificatorias regionales para ganarse el último boleto de Norteamérica al Mundial. Fue una hazaña agotadora, pero la experiencia obtenida es una recompensa invaluable. Cloud9 ya ha jugado cinco combates al mejor de cinco antes de aparecer en el Mundial. Aunque tuvieron problemas para trabajar bien en grupo en la temporada regular, supieron complementarse mucho más en las eliminatorias. Si saben aprovechar la experiencia obtenida en el arduo camino que atravesaron para llegar al Mundial, serán una fuerza que dejará su huella en el escenario internacional.</p>\n\n<p><strong>Entrenador: Han-gyu \"Reapered\" Bok</strong></p>"},"foreignIds":{"drupalId":"304"},"players":[45,115,163,255,482,499,508,1120],"starters":[45,115,482,499,1120],"subs":[163,255,508]},{"id":53,"slug":"team-liquid","name":"Team Liquid","guid":"be6cab43-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-liquid-3g983dra.png","acronym":"TL","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-08-05T20:07:01.000Z","bios":{"en_US":"<p>Formed in the wake of the Team Liquid and Team Curse organizations merging, Liquid debuted in the NA LCS 2015 Spring Split. After a tumultuous Spring Split, where they lost three of their tested talents and replaced them with rookies Lourlo, Dardoch, and Matt, many players thought that they’d struggle to avoid the bottom of the rankings. Instead, the team stepped up huge and outperformed expectations.</p>\n\n<p>Unfortunately, all good things must come to an end and Liquid released some of their top talent at the end of 2016. The team acquired a couple of new players (including world class jungler Reignover) and a returning world champion in Piglet. With a new outlook and the air successfully cleared after a rough split, Liquid is ready to make a run at playoffs.</p>\n\n<p>Coach: Nu-ri \"Cain\" Jang</p>","fr_FR":"<p>Née de la fusion entre Team Liquid et Team Curse, Liquid a fait ses débuts dans le segment de printemps des LCS NA 2015. Malgré un départ un peu poussif, avec un score de 9 victoires pour 9 défaites lors de la saison, TL est remontée à un score final de 11 victoires après s'être battue bec et ongles pour arracher la 3e place. Le roster de Liquid est resté quasi-intact au fil des péripéties connues par l'équipe depuis ses débuts, et les fans espèrent que les quelques nouveaux éléments intégrés au roster sauront s'adapter rapidement, en particulier leur nouveau top laner, Lourlo, qui doit encore faire ses preuves.</p>","pl_PL":"<p>Ta organizacja założona w 2010 roku w Holandii zrzesza graczy z całego świata. Posiada swoje oddziały w większości gier gdzie istnieje scena esportowa, więc naturalną koleją rzeczy jej pragnieniem było dołączenie do nich League of Legends. Taka okazja nadarzyła się 6 stycznia 2015 roku – drużyna Team Curse dokonała fuzji z organizacją Liquid. W ten sposób zespół sięgający swoimi korzeniami do pierwszego sezonu zmienił nazwę na Team Liquid. Ze względu na integrację kadra pozostała bez zmian, tylko nadzór nad nią i jej wsparcie uległy modyfikacji.</p>\n<p>\nJej właścicielami są Victor \"Nazgul\" Goossens i Steve \"LiQuiD112\" Arhancet, którzy aktywnie biorą udział w życiu drużyny. Victor to założyciel Team Liquid i były profesjonalny gracz strategicznych produkcji. 1 maja 2001 roku powstała strona dotycząca gier tej kategorii. W kolejnych latach jego organizacja rozwijała się o kolejne gry różnych typów. W momencie fuzji była poważaną instytucją zrzeszającą graczy z całego świata. Steve był częścią sceny esportowej League of Legends w pierwszym i drugim sezonie. Uwielbiał grać jako support, w szczególności Soraką. Posiada wykształcenie z zakresu finansów, co po 12 latach pracy w biznesie, zdecydował się połączyć ze swoją pasją. W sierpniu 2011 roku, po tym jak jego drużyna dostała się pod skrzydła Curse Gaming, został Dyrektorem do spraw esportu w Curse Inc. Po fuzji automatycznie stał się współwłaścicielem Team Liquid. Często można go zobaczyć na filmach przedstawiających życie zawodników, jak i również w spotach reklamowych organizacji. Razem z Victorem dbają o wizerunek i potrzeby swojej wspólnej drużyny.</p>\n<p>                                             \nDebiut Team Liquid, jako marki, w NA LCS miał miejsce w piątym sezonie. W okresie wiosennym poradzili sobie przyzwoicie, kończąc na szóstym miejscu z wynikiem 9:9. Biało-niebiescy zawodnicy zdobyli tytuł najbardziej wartościowego gracza aż dwukrotnie w tym okresie. Swoją prawdziwą siłę pokazali dopiero w letnim sezonie NA LCS 2015. Zadziwiające jest to, że udało im się tego dokonać bez żadnych zmian w składzie osobowym.Drużyna Team Liquid skończyła z najlepszym wynikiem – 13:5, zajęła pierwsze miejsce w tabeli ex aequo z Counter Logic Gaming. Jednak w dogrywce nie pozostawiła złudzeń, że to właśnie jej należy się pierwsze miejsce i pokonała CLG. W tym okresie, oprócz kolejnych dwóch laurów MVP, nagrodzony został trener Team Liquid - Peter Zhang. Na zdobyciu szczytu w letnim sezonie NA LCS 2015 skończyła się dobra passa biało-niebieskich. Po rozegraniu meczy kwalifikacyjnych do Mistrzostw Świata, niestety nie udało im się przejść dalej. Jednak Team Liquid pomyślnie wykreował swój wizerunek na scenie esportowej, gdyż po sezonie piątym jej popularność wśród społeczeństwa League of Legends zdecydowanie wzrosła. Przez fanów postrzegana jest jako nowoczesna i prężna organizacja, po której zawsze można się spodziewać czegoś dobrego.</p>\n","de_DE":"Liquid entstand aus der Fusion von Team Liquid und Team Curse, und sie traten zum ersten Mal im Frühjahrs-Split der nordamerikanischen LCS 2015 auf den Plan. Nach einem turbulenten Frühjahrs-Split, in dem sie drei ihrer erfahrenen Talente verloren hatten und sie mit den Nachwuchsspielern Lourlo, Dardoch und Matt ersetzen mussten, dachten viele Spieler, sie würden am Ende der Tabelle landen. Stattdessen machte die Mannschaft einen großen Sprung und übertraf alle Erwartungen.</p>\n<p>\nLeider hat alles Gute einmal ein Ende und Team Liquid musste Ende 2016 ein paar seiner besten Spieler ziehen lassen. Die Mannschaft verpflichtete ein paar neue Spieler (dazu gehört auch der Weltklasse-Jungler Reignover) sowie den Weltmeister Piglet. Dank der neuen Aufstellung und einem sauberen Schnitt nach dem Sommer-Split 2016 ist Team Liquid bereit, um die Krone der LCS mitzuspielen.\n<p>\nCoach: David „Varsix“ Lim\n"},"foreignIds":{"drupalId":"3654"},"players":[44,250,326,372,395,558,626,777,969,2081],"starters":[44,558,626,777,969],"subs":[250,326,372,395,2081]}],"players":[{"id":44,"slug":"piglet","name":"Piglet","firstName":"Gwang-jin","lastName":"Chae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/piglet-4smmppa.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-05-25T17:21:49.000Z","bios":{"en_US":"<p>Gwang-jin “Piglet” Chae experienced the highest highs a League of Legends pro player can experience when he took home the Summoner’s Cup at the 2014 World Championship. But he has since had to endure some of the lowest lows to get another shot at glory. He struck out into the unknown and joined Liquid. It’s been a rocky road which eventually led to Piglet stepping down to play with Team Liquid Academy.</p>\n\n<p>After opting to play largely with Team Liquid Academy in 2016, Piglet is finally making his return to Team Liquid and the NA LCS. Piglet’s mechanical skill is the stuff of legends, and he’s renown for his ability to make even the most skillful plays look deceptively easy. Quite simply: Piglet is a playmaker that Team Liquid has gone far too long without. The kind of firepower that Piglet is capable of unleashing has the potential to make Team Liquid an instant contender for the NA LCS throne. Bot lane beware -- Piglet is back.</p>","fr_FR":"<p>Gwang-jin « Piglet » Chae a vécu ce qu'un joueur pro de League of Legends peut vivre de plus\n\nfantastique ; il a rapporté chez lui la Coupe de l'invocateur du mondial 2014. Mais depuis, il a dû \n\nsupporter le pire du pire dans l'espoir de revivre cette heure de gloire. Après s'être lancé dans l'inconnu \n\nen rejoignant Team Liquid de l'autre côté de l'océan, Piglet s'est pris un mur. Les choses ne se passaient \n\npas comme prévu. Au lieu de mener son équipe au sommet des LCS, il s'est retrouvé sur le banc de \n\ntouche pendant qu'un jeune n'ayant pratiquement aucune expérience pro jouait son rôle.</p>\n\n<p>Mais Piglet n'a pas été champion du monde par hasard et il a su relever ce nouveau défi. S'entraînant \n\nencore plus qu'avant, donnant tout pour établir une vraie synergie avec ses coéquipiers, Piglet et Liquid \n\nsont finalement parvenus à se fondre dans une entité efficace. Malgré quelques difficultés persistantes, \n\nPiglet retrouve peu à peu sa forme d'antan. Profitant pleinement des compétences techniques qui lui \n\navaient permis de remporter le championnat du monde, Piglet ne vise plus qu'un seul objectif : revenir \n\nune fois encore sur la plus grande scène que l'e-sport de LoL puisse offrir.</p>","pl_PL":"<p>Ten utalentowany AD Carry pojawił się na scenie esportowej League of Legends w lutym 2013 roku. Jako debiutant, doświadczony tylko w solo que, dołączył do SK Telecom T1 2. Ten skład został utworzony wokoło  Lee’a \"Faker\" Sang-hyeoka, jako siostrzana drużyna SK Telecom T1 1. \"Piglet\" wraz z ekipą osiągnęli powodzenie już na pierwszym turnieju, pomimo tego, że w większości byli nowicjuszami. Co prawda zajęli tylko trzecie miejsce, ale dzięki temu zaistnieli wśród najlepszych w Korei, pokonując m.in. CJ Entus Frost. Zaledwie parę miesięcy później pokazali na co naprawdę ich stać, wygrywając HOT6iX Champions Summer 2013. Dzięki zdobytym punktom na tym wydarzeniu, zdecydowane zwycięstwozagwarantowało Chae’owi \" Gwang-jinowi wejście do Mistrzostw Świata 2013 z trzeciego miejsca w Korei. Tam, na arenie międczynarodowej, \"Piglet\" pokazał jak bardzo wybitnym jest AD Carrym. Z grupy SKT T1 wyszło z wynikiem 7:1, tracąc tylko jedną grę przeciwko OMG. W fazie eliminacji tylko Najin Black Swordz powodzeniem stawiło czoła ich potędze, przegrywając z SKT T1 2:3. Tytuł mistrza świata to zdecydowanie największy sukces Chae’a Gwang-jina.</p>\n<p>\nCzwarty sezon w Korei rozpoczął kolejnymi triumfami, lecz wraz z upływem czasu SKT T1 coraz gorzej sobie radziło. Ostatecznie, we wrześniu 2014 roku, \"Piglet\" i jego partner \"PoohManDu\"  pożegnali się z tą organizacją. Wspomnieniem po tej współpracy pozostały skarpetki Chae’a Gwang-jina z Kubusiem Puchatkiem, które nosił podczas meczów ze swoim supportem, ponieważ przynosiły mu szczęście. Taki talent nie mógł zostać wolnym strzelcem zbyt długo, już październiku 2014 roku dostał ofertę od Team Curse. Po przeprowadzce do Stanów Zjednoczonych czekało go dużo pracy – pokonanie bariery językowej, problemy z wizą i zyskanie komunikacji z nowym kolegami. Jednak znany z zaangażowania \"Piglet\" dał z siebie wszystko. W końcu, w letnim sezonie 2015, już pod marką Team Liquid, udało mu się znaleźć na szczycie NA LCS.</p>\n<p> \nDo jego osobistych osiągnięć przede wszystkim należy nagroda za najlepszego AD Carry podczas 2013 Korea e-Sports Awards. Dokonał tego głównie grając swoją ulubioną postacią – Vayne. Poza nią, częściej od innych bohaterów, wybiera Ezreala, Corkiego i Caitlyn.Wspominając swoje najszczęśliwsze momenty w życiu, jako pierwszy przytacza dostanie się do SKT T1, a jako drugi z kolei wygranie OGN Summer 2013. Słynie ze swojego niezmiennego, defensywnego stylu gry i godnej podziwu pozycji w walkach drużynowych. To bardzo dumny zawodnik, poważnie traktujący rywalizację z AD Carry z innych zespołów, w szczególności z Gu’em \"Imp\" Seung-binem. Wśród innych graczy wyróżnia go sumienność i pracowitość. Przez to, że sypiał po 4 do 5 godzin i ćwiczył swoje umiejętności w League of Legends przez kolejne 15 do 16, zyskał przydomek „Practice Worm”. Można również o nim powiedzieć, że jest emocjonalny. Wielokrotnie reagował na krytykę lub porażkę bardzo silnie, w szczególności w kontaktach ze swoimi trenerami i menadżerami.\n</p>","de_DE":"Gwang-jin „Piglet“ Chae hat alle Höhen eines professionellen „League of Legends“-Spieler erlebt, als er die Weltmeisterschaft 2014 gewann und den Beschwörerpokal mit nach Hause nahm. Seither musste er jedoch auch einige Tiefen verkraften, um wieder eine Chance auf Ruhm und Ehre zu bekommen. Er machte sich auf ins Unbekannte und wechselte zu Liquid. Es war ein steiniger Weg, der schließlich dazu führte, dass sich Piglet zurückzog und für Team Liquid Academy spielte. \n</p>\nNachdem Piglet sich entschieden hatte, 2016 hauptsächlich für Team Liquid Academy zu spielen, kehrt er schließlich wieder zu Team Liquid in die NA LCS zurück. Piglets mechanisches Können ist legendär, und er ist bekannt dafür, selbst die schwierigsten Spielzüge ganz einfach aussehen zu lassen. Es ist ganz einfach: Piglet ist der Spielmacher, auf den Team Liquid zu lange verzichten musste. Die Feuerkraft, die in Piglet steckt, kann Team Liquid sofort zu einem Anwärter auf den Thron der NA LCS machen. Die untere Lane sei gewarnt – Piglet ist zurück.\n"},"foreignIds":{"drupalId":"690","TRLH1":"200000244","TRLH2":"200000148"},"socialNetworks":{"twitch":"","twitter":"https://twitter.com/LiquidPiglett"},"champions":[],"liveGameTeam":53},{"id":45,"slug":"impact","name":"Impact","firstName":"Eonyoung","lastName":"Jeong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/impact-8a44ib2j.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-07-04T19:26:43.000Z","bios":{"en_US":"<p>Former World Champion Eonyoung “Impact” Jeong isn’t quite ready to hang up the mouse and keyboard. The former SK Telecom T1 top laner put on a show in the 2016 NA LCS Playoffs, proving no other top laner in North America measured up. While his regular season was uninspiring, he almost singlehandedly earned Cloud9 a spot at the 2016 World Championship.</p>\n\n<p>Unfortunately, Impact struggled to find his groove on the world stage. Cloud9 was the only NA team to earn a quarterfinals berth, but they were quickly eliminated by Samsung Galaxy. As the shield to Ray's sword, the dynamic duo dominated the competition in the 2017 NA LCS Spring Split. With such talent in the top lane, Cloud9’s opponents’ nightmares will be just two words, repeating forever: “top die.”</p>","fr_FR":"<p>L'ancien champion du monde Eonyoung \"Impact\" Jeong n'est pas prêt à raccrocher souris et clavier. Après un segment d'été des LCS NA peu inspiré, l'ancien top laner de SK Telecom T1 a eu le vent en poupe durant les play-offs. Aucun autre top laner en Amérique du Nord n'est arrivé à la hauteur de ses performances lors des play-offs, et Cloud9 doit une grande partie de son succès post-saison à son jeu spectaculaire, ce qui a également permis de mettre un terme aux problèmes de communication qui affectaient Cloud9.</p>\n\n<p>En dépit de sa domination régionale, Impact a eu du mal à trouver ses marques dans le Championnat du monde cette année. Alors qu'il s'est montré inébranlable sur la voie du haut pour Cloud9 durant les play-offs, il a trouvé des adversaires à sa hauteur avec les top laners Duke de SK Telecom T1 et CuVee de Samsung Galaxy. Toutefois, Impact et les autres joueurs de Cloud9 ont le mérite d'être la seule équipe d'Amérique du Nord à avoir atteint les quarts de finale, et Impact les représentera lors de l'événement All-Stars. Avec 41,7 pour cent du vote top laner, il aura une chance supplémentaire cette année de \"déchirer la voie du haut\".</p>","pl_PL":"Były Mistrz Świata, Eonyoung „Impact” Jeong, nie zamierza jeszcze zawiesić na kołku mysz i klawiatury. Po niezbyt udanych występach w letnim splicie NA LCS dawny górny SKTelecom T1 szalał w fazie pucharowej. Żaden inny górny w Ameryce Północnej nie dorównywał formą Impactowi podczas playoffów, a Cloud9 zawdzięczają w dużej mierze swój sukces po sezonie jego znakomitej grze. Rozwiały się także wątpliwości dotyczące problemów z komunikacją wewnątrz Cloud9.\n</p>\nPomimo dominacji w regionie, Impact nie potrafił odnaleźć się w tym roku na Mistrzostwach Świata. Chociaż podczas fazy pucharowej na górnej alei Cloud9 był nie do ruszenia, znalazł równych sobie w postaci górnego SK Telecom T1, Duke’a i CuVee z Samsung Galaxy. Mimo to, Impact i reszta Cloud9 zasługują na uznanie jako jedyna drużyna z Ameryki Północnej, która dotarła do ćwierćfinałów. Wkrótce Impact będzie ją reprezentował na wydarzeniu All-Star. Mając 41,7 procenta głosów na górnego, dostanie w tym roku jeszcze jedną szansę, by pokazać jak „góra umiera”.\n","de_DE":"Der ehemalige Weltmeister Eonyoung „Impact“ Jeong ist noch nicht bereit, Maus und Tastatur an den Nagel zu hängen. Der ehemalige Top-Laner von SK Telecom T1 hat bei den Entscheidungsspielen der NA LCS 2016 eine Show abgeliefert und damit bewiesen, dass ihm kein Top-Laner in Nordamerika das Wasser reichen kann. Obwohl seine Leistungen in der regulären Saison uninspiriert waren, hat er Cloud9 fast im Alleingang zur Weltmeisterschaft 2016 geführt.</p>\n<p>\nLeider hatte Impact bei der Weltmeisterschaft Probleme damit, seinen Rhythmus zu finden. Cloud9 war das einzige nordamerikanische Team, das sich einen Platz im Viertelfinale sichern konnte, allerdings sind sie anschließend direkt an Samsung Galaxy gescheitert. In diesem Frühjahrs-Split wird Impact versuchen, auf einem noch höheren Level zu spielen. Darüber hinaus wird er Ray, seinen neuen Teamkollegen, unter seine Fittiche nehmen. Der talentierte Top-Laner wird den Gegnern von Cloud9 Albträume bescheren, in denen sich zwei Worte unendlich wiederholen: „top die“.\n","es_AR":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","es_ES":"<p>Aún no ha llegado el momento de que el que fuera campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del split de verano de la LCS NA poco inspirado, el exjugador de la calle superior de SK Telecom T1 lo dio todo en los playoffs. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallan las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en la calle superior para Cloud9 durante los playoffs, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su jugador de la calle superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para la calle superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","pt_BR":"<p>Ex-campeão do mundo, Eoyoung “Impact” Jeong ainda não está preparado para pendurar o mouse e o teclado. Após um começo nada inspirador na Etapa de Verão da NA LCS, o ex-topo da SK Telecom T1 arrasou nas eliminatórias. Nenhum outro jogador de topo da América do Norte chegou perto de seu desempenho, e a Cloud9 deve de seu sucesso de pós-temporada à sua mecânica incrível, que também acabou com as preocupações de comunicação interna da equipe.</p>\n\n<p>Apesar da dominância regional, Impact teve dificuldades em se manter constantemente bem no Campeonato Mundial deste ano. Apesar de ter sido imprescindível na rota do topo para a Cloud9 durante as eliminatórias, ele encontrou adversários à altura como Duke, da SK Telecom T1 e CuVee, da Samsung Galaxy. Impact e o restante da Cloud9 merecem o crédito de terem sido a única equipe da América do Norte a chegar nas quartas-de-final, fazendo dele o representante da equipe para o Evento All-Star. Com 41,7% dos votos da rota do topo, ele terá mais uma chance de acabar com o topo.</p>","cs_CZ":"<p>Bývalý mistr světa Eonyoung „Impact“ Jeong ještě není připraven pověsit klávesnici a myš na hřebík. Po neslaném nemastném letním splitu severoamerického LCS se v play-off tento dřívější horní lajnař z SK Telecom T1 doslova utrhl ze řetězu. Žádný jiný horní lajnař ze Severní Ameriky se s jeho formou ve vyřazovací části turnaje nemohl měřit a Cloud9 za svůj úspěch z velké části vděčili právě jeho hvězdným výkonům, čímž navíc vzaly zasvé obavy, že se Cloud9 potýká s komunikačními problémy.</p>\n\n<p>Ačkoliv ve svém regionu řádil Impact jako černá ruka, na letošním mistrovství světa se mu už tak skvěle nedařilo. Během vyřazovacích zápasů byl sice v horní lajně pro Cloud9 cennou oporou, našel však sobě rovné v Dukovi z SK Telecom T1 a v CuVeem ze Samsung Galaxy. Přesto si Impact a zbytek Cloud9 zaslouží uznání za to, že se stali jediným severoamerickým týmem, který se probojoval do čtvrtfinále, a Impact bude tento region reprezentovat i na turnaji All-Star. Z hráčů v horní lajně obdržel 41,7 % hlasů a bude tak mít letos ještě jednu šanci provést svůj klasický „top die“.</p>","el_GR":"<p>Ο πρώην Παγκόσμιος Πρωταθλητής Eonyoung “Impact” Jeong δεν είναι ακόμα έτοιμος να κρεμάσει το ποντίκι και το πληκτρολόγιό του. Μετά από ένα απογοητευτικό Summer Split στο LCS Βόρειας Αμερικής, ο πρώην παίκτης επάνω λωρίδας των SK Telecom T1 έκανε μια καταπληκτική εμφάνιση στα πλέι οφ. Κανένας άλλος παίκτης επάνω λωρίδας στη Βόρεια Αμερική δεν μπόρεσε να συγκριθεί μαζί του στα πλέι οφ και οι Cloud9 οφείλουν μεγάλο μέρος της επιτυχίας τους στους αγώνες μετά το τέλος της σεζόν στην εκπληκτική του φόρμα, αποστομώνοντας και όσους έλεγαν ότι οι Cloud9 είχαν προβλήματα επικοινωνίας.</p>\n\n<p>Παρά την κυριαρχία του σε τοπικό επίπεδο, ο Impact δυσκολεύτηκε πολύ να βρει το ρυθμό του στο φετινό Παγκόσμιο Πρωτάθλημα. Παρόλο που ήταν πραγματικός τοίχος στην επάνω λωρίδα των Cloud9 κατά τη διάρκεια των πλέι οφ, δυσκολεύτηκε πολύ ενάντια σε άλλους δυνατούς παίκτες επάνω λωρίδας, όπως τον Duke των SK Telecom T1 και τον CuVee των Samsung Galaxy. Ωστόσο, ο Impact και οι υπόλοιποι Cloud9 αξίζουν ένα μεγάλο «μπράβο» που ήταν η μοναδική ομάδα από τη Βόρεια Αμερική που κατάφερε να φτάσει στους προημιτελικούς. Μάλιστα, ο Impact θα εκπροσωπήσει την ομάδα του και στο Τουρνουά All-Star. Άλλωστε, ήταν ο παίκτης που συγκέντρωσε το 41,7% των ψήφων για την επάνω λωρίδα, άρα θα έχει την ευκαιρία να δείξει αν είναι όντως ο καλύτερος στη θέση του.</p>","hu_HU":"A korábbi világbajnok Eonyoung „Impact” Jeong még nem szeretné szögre akasztani az egeret és a billentyűzetet. Az NA LCS gyenge nyári szakasza után az SK Telecom T1 egykori felső ösvényese nagyon rákapcsolt a rájátszásban. Egyetlen másik észak-amerikai játékos sem tudott felérni hozzá, és a Cloud9 jórészt neki köszönheti a szezon utáni sikereit, amivel egyébként sikerült eloszlatni a Cloud9 kommunikációs problémáival kapcsolatos pletykákat is.\n</p>\nA regionális sikerek ellenére Impact nehezen talált magára az idei világbajnokságon. Bár a Cloud9 felső ösvényén nem akadt ellenfélre a rájátszás során, a vb-n olyanokkal kellett szembenéznie, mint Duke (SK Telecom T1) és CuVee (Samsung Galaxy). Impact és a Cloud9 többi tagja egyedüli észak-amerikai csapatként jutott a negyeddöntőig, és Impact képviselheti őket az All-Star gálán. A felső ösvényesekre leadott szavaztok 41,7%-át söpörte be, így idén kap még egy utolsó esélyt, hogy bizonyítson.\n","it_IT":"L'ex campione del mondo Eonyoung \"Impact\" Jeong sembra non avere ancora intenzione di appendere mouse e tastiera al chiodo. Dopo un Summer Split LCS NA poco ispirato, l'ex superiore di SK Telecom T1 si è fatto valere durante i playoff. Nessun altro giocatore top in Nord America è riuscito a tenergli testa durante questo periodo e Cloud9 deve gran parte del suo successo post-stagionale alle sue giocate stellari, che hanno messo anche a tacere le voci che parlavano di problemi di comunicazione interni alla squadra.\n</p>\nNonostante il predominio nella sua regione, Impact ha sofferto molto per trovare il giusto ritmo ai Mondiali di quest'anno. Pur essendo un elemento immancabile nella corsia superiore dei Cloud9 durante i playoff, ha avuto filo da torcere contro giocatori nel suo stesso ruolo del calibro di Duke degli SK Telecom T1 e CuVee dei Samsung Galaxy. In ogni caso, Impact e i suoi compagni dei Cloud9 meritano un encomio per essere stati l'unico team nordamericano a raggiungere i quarti di finale, e sarà proprio Impact a rappresentarli nell'evento All-Star. Forte del 41,7% dei voti per la categoria Superiore, ora avrà un'altra occasione per dominare la sua corsia.\n","ro_RO":"Fostul Campion Mondial Eonyoung ''Impact'' Jeong nu e încă pregătit să lase deoparte mouse-ul și tastatura. După o etapa de vară neinspirată în LCS NA, fostul jucător de pe culoarul de sus al SK Telecom T1 a avut parte de o serie de victorii în playoff-uri. Niciun alt jucător de pe culoarul de sus din America de Nord nu s-a ridicat la forma sa din playoff-uri. Cloud9 datorează o mare parte din succesul său de după sezon manevrelor excepționale ale lui Impact, care au pus capăt neliniștilor legate de problemele de comunicare ale echipei.\n</p>\nÎn ciuda dominației sale regionale, Impact nu a reușit să se facă remarcat la Campionatul Mondial din acest an. Cu toate că a fost o forță de neoprit pe culoarul de sus pentru Cloud9 în timpul playoff-urilor, și-a întâlnit nașii în Duke de la SK Telecom T1 și în CuVee de la Samsung Galaxy. Însă cei din Cloud9 merită apreciați pentru că au fost singura echipă din America de Nord care a ajuns în sferturile de finală, iar Impact își va reprezenta regiunea la All-Star Event. Cu 41,7 la sută din voturile pentru culoarul de sus, va mai avea o șansă anul acesta să-și omoare adversarii de unul singur, fără ajutorul nimănui.\n","ko_KR":"","es_MX":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>"},"foreignIds":{"drupalId":"691","TRLH1":"200000172","TRLH2":"200000076","TRLH3":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":115,"slug":"sneaky","name":"Sneaky","firstName":"Zachary ","lastName":"Scuderi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sneaky-3c359lbn.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:51.000Z","updatedAt":"2017-07-04T19:27:36.000Z","bios":{"en_US":"<p>The man, the meme, the legend. Zachary “Sneaky” Scuderi might be the class clown of the NA LCS, but his play is no joke. He’s consistently been a top ADC since he took the league by storm with Cloud9 in Season 3 with his meta-defying Ashe picks. During the 2016 NA LCS Summer Split, he led ADCs and was fourth overall in KDA with 6.3, and he also led ADCs with a 75.7% kill participation rate.</p>\n\n<p><i>“I’ve been getting a lot of memes, as of recent, about my laning phase. It doesn’t really mean anything. But there’s memes, and I could destroy them.” - Sneaky</i></p>\n\nSneaky put up a middling performance in lane and out of it at the 2016 World Championship before Cloud9 was eliminated. He brings a veteran presence to Cloud9’s retooled roster, looking to prove his detractors wrong. What memes will be destroyed or born in 2017? We’ll just have to wait and see.</p>","fr_FR":"<p>Zachary « Sneaky » Scuderi est l'un des carrys AD les plus mortels des LCS NA. Ne vous laissez\n\npar ses singeries, car Sneaky répond présent quand Cloud9 a besoin d'un exploit. Il est parvenu à obtenir \n\nun KDA de 7,2 lors du segment printanier des LCS NA 2015, le deuxième meilleur de la ligue, et il \n\ncontinue de voler de victoire en victoire depuis lors.</p>\n\n<p>L'ascension de Sneaky vers la célébrité a commencé pendant la Saison 3, quand sa décision de choisir \n\nAshe contre la logique de la metagame a propulsé Cloud9 au sommet du classement des LCS NA. Depuis, \n\nSneaky est devenu un fantastique carry AD polyvalent. Il joue désormais admirablement Corki, Tristana \n\net Lucian, et il empoche régulièrement les ratios KDA les plus élevés des LCS NA. Il est probablement le \n\njoueur professionnel de LoL qui propage le plus de memes usés jusqu'à la corde. « Same ».</p>","pl_PL":"<p>Gdyby zorganizować konkurs na najbardziej niedocenianego gracza w NA LCS Sneaky miałby bardzo dużą szansę, by zgarnąć trofeum. Na najwyższym poziomie gra już od ponad dwóch lat, ale nigdy nie dorównywał popularnością Doubleliftowi czy chociażby Wild Turtle’owi. Nie zmienia to faktu, że jest doskonałym strzelcem, być może najlepszym w Ameryce.</p>\n<p>\nSneaky jak niemal każdy zawodnik zaczynał w niewielkich organizacjach. Pierwszym przystankiem na jego drodze na szczyt był zespół Ordinance Gaming, w którym w 2012 roku pełnił rolę… mid-lanera i gdzie spotkał m.in. Roberta „RobertaXLee” Lee. Później przyszedł czas na zmianę pozycji – środkową aleję Sneaky zamienił na pozycję strzelca, w której to roli rozpoczął przygody z Absolute Legends NA oraz Pulse Esports. Dobra postawa Sneaky’ego nie umknęła większym organizacjom i lutym 2013 roku Zachary dołączył do Teamu Dignitas, ale spędził tam tylko pół roku. Pojawiła się oferta z Quantic Gaming, późniejszego Cloud9, którą zaakceptował.</p>\n<p>\nSzybko okazało się, że była to znakomita decyzja. Sneaky wraz z kolegami dwukrotnie sięgał po trofeum dla najlepszego zespołu w NA LCS i dwukrotnie zajmował w tych rozgrywkach drugie miejsce. Początkowo Zachary preferował strzelców, którzy posiadali efekty kontroli tłumu, bo tego wymagała od niego taktyka zespołu. Jego flagową bohaterką stała się w tym czasie Ashe. Co jednak oczywiste, grając tym typem czempionów nie mógł pokazać pełni swoich możliwość. Zmieniło się to wraz z modyfikacją strategii drużyny, która w 2014 roku postanowiła odciążyć nieco Haia „Haia” Lama na środkowej alei i bardziej skupić się na dolnej alei, gdzie potencjał do prowadzenia gier miał właśnie Sneaky. Kiedy po wielkich sukcesach, przyszedł mniej udany okres, Sneaky był tak naprawdę jedynym zawodnikiem C9, który nigdy nie zawodził i nierzadko to właśnie jego fenomenalna postawa i znakomite umiejętności mechaniczne pozwalały Cloud9 wygrywać gry. W wiosennym splicie 2015 Zachary miał najwyższe KDA (7,2), zadał najwięcej procentowych obrażeń (33,9%) i ginął najrzadziej spośród wszystkich zawodników NA LCS (25 śmierci). Co prawda amerykański strzelec miał nieznacznie gorszy letni split 2015, ale to nadal jest zawodnik, na którego C9 zawsze może liczyć.</p>\n<p>\nSneaky nigdy nie wygrał jednak głosowanie na najlepszego ADC w Ameryce, a w plebiscycie z listopada 2015 roku zajął drugie miejsce z wynikiem 20,3%, tracąc do zwycięzcy, Yilanga „Doublelifta” Penga, aż 32,5% głosów.</p>\n<p>\nW trakcie swojej kariery najbardziej wsławić się grą Ezrealem, Gravesem i Corkim. Ciężko też nie zauważyć sentymentu dla Ashe, bowiem Sneaky był jednym z dwóch ADC w Ameryce, który zdecydował się na kilkukrotny wybór tej bohaterki w meczach NA LCS po jej reworku. Co ciekawe, Sneaky jest… daltonistą, co sprawia, że nie potrafi odróżniać pewnych (nie wszystkich) kolorów. Na początku swojej kariery posługiwał się nickiem „SnEaKyCaStRoO”, ale zmienił go natychmiast, gdy dowiedział się, co znaczy to wyrażenie.\n</p>","de_DE":"Der Mann, das Meme, die Legende. Zachary „Sneaky“ Scuderi ist zwar der Klassenclown der NA LCS, aber wenn er spielt, ist Schluss mit lustig. Seit er durch seine Leistungen mit Ashe das Metaspiel veränderte und die Liga im Sturm eroberte, gehört Sneaky, der in Saison 3 bei Cloud9 unterschrieb, zu den besten ADCs. Beim Sommer-Split der NA LCS 2016 führte er die ADCs mit einer Tötungsbeteiligung von 75,7 % an und landete mit einer TTU (KDA) von 6,3 auf dem vierten Platz aller Spieler.</p>\n\n„Ich bekomme in letzter Zeit jede Menge Memes, die sich auf meine Anfangsphase beziehen. Das hat eigentlich nichts zu bedeuten. Aber es gibt sie und ich könnte sie zerstören.“ – Sneaky\n</p>\nSneaky hat bei der Weltmeisterschaft 2016 in der Lane und abseits davon nur eine mittelmäßige Leistung abgeliefert, bis Cloud9 ausgeschieden ist. Er wird seine Erfahrung in die Aufstellung von Cloud9 einbringen und versuchen, seine Kritiker Lügen zu strafen. Welche Memes werden 2017 wohl zerstört werden und welche neuen werden entstehen? Die Zeit wird es zeigen.\n","es_ES":"<p>El hombre, el meme, la leyenda. Zachary ''Sneaky'' Scuderi puede que sea el payaso de la clase de la LCS NA, pero sus jugadas no son un chiste. No ha dejado de ser un ADC de primera desde que llegó a la liga pisando fuerte con Cloud9 en la temporada 3, cuando seleccionaba a Ashe en contra de la lógica del metajuego. Durante el split de verano de la LCS NA 2016, destacó entre los ADC y quedó en cuarto lugar con una A/M/A de 6,3 puntos. También destacó entre ellos por su 75,7 % de participación en asesinatos.</p>\n\n<p>''Últimamente han hecho muchos memes de mí, por mi fase de calles. No significa nada para mí en realidad. Pero los memes están ahí, y yo podría destruirlos''.</p>\n\n<p>Sneaky ha tenido que soportar críticas por sus jugadas en la fase de calles, pero su tendencia a los pentakills a final de partida camufla cualquier fallo del principio. Destaca con campeones ADC de utilidad como Ashe y Sivir, y su Jhin es temido universalmente, lo que ha suscitado que lo bloqueen o que lo seleccionen el primero durante los playoffs. Intentará demostrar que sus detractores se equivocaban consiguiendo un pentakill en el escenario internacional, destruyendo algunos memes y, quizás, si tenemos suerte, creando otros nuevos.</p>","pt_BR":"<p>O homem, o meme, a lenda. Zachary “Sneaky” Scuderi pode ser o palhaço da turma na NA LCS, mas suas jogadas não são nenhuma piada. Ele tem sido consistentemente um dos melhores atiradores desde que saiu destruindo com a Cloud9 na 3º Temporada com suas escolhas de Ashe que desafiavam as leis do meta. Durante a Etapa de Verão da NA LCS 2016, ele esteve na liderança entre os atiradores e ficou em quarto lugar geral com um AMA de 6,3 e também ficou entre os primeiros em participação em abates com 75,7%.</p>\n\n<p>“Tenho ouvido muitas piadas sobre minha fase de rotas recentemente. Eu não as levo a sério e sei que posso destruí-las” - Sneaky</p>\n\n<p>Sneaky já recebeu muitas críticas por seu estilo de jogo na fase de rotas, mas sua propensão a Pentakills no fim de jogo compensa qualquer começo ruim. Ele se sobressai em atiradores de utilidade como Ashe e Sivir, e seu Jhin é universalmente temido, levando a ser banido ou escolhido em primeiro durante as eliminatórias. Ele fará de tudo para desmentir seus difamadores indo atrás do Pentakill no palco internacional, destruindo alguns memes e quem sabe (se tivermos sorte) criando alguns novos.</p>","es_AR":"<p>El hombre, el meme, la legenda. Zachary \"Sneaky\" Scuderi es quien hace reír a todos con sus bromas en la LCS NA, pero su juego no es ningún chiste. Ha sido uno de los mejores tiradores desde que sacudió la liga entera con Cloud9 en la temporada 3 jugando con su revolucionaria Ashe. Durante el torneo de clausura de la LCS NA 2016, jugó de tirador y quedó en cuarto lugar con 6.3 puntos de KDA. Además, logró un 75.7% de participación en asesinatos como tirador.</p>\n\n<p><i>\"Me han hecho muchos memes recientemente sobre mi etapa en los carriles. En realidad eso no quiere decir nada. Pero hay memes, y puedo destruirlos\".</i></p>\n\n<p>Sneaky ha soportado críticas por su juego en la fase de carriles, pero su tendencia a lograr pentakills en las últimas partes de los combates compensa los errores al comienzo. Se destaca con tiradores de utilidad como Ashe y Sivir, y su juego con Jhin es temido por todos, ya que logra bloqueos y primeras selecciones durante las eliminatorias. Buscará demostrar a sus detractores que estaban equivocados logrando un pentakill en el escenario internacional, destruyendo algunos memes y, quizás (si tenemos suerte), hasta creando algunos nuevos.</p>"},"foreignIds":{"drupalId":"331","TRLH1":"200000175","TRLH2":"200000079","TRLH3":"200000339"},"socialNetworks":{"twitch":"https://twitch.tv/c9sneaky","facebook":"https://facebook.com/c9sneaky","twitter":"https://twitter.com/c9sneaky"},"champions":[],"liveGameTeam":18},{"id":163,"slug":"bunny-fufuu","name":"Bunny FuFuu","firstName":"Michael","lastName":"Kurylo","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bunny-fufuu-b4cl3hl3.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-25T17:02:59.000Z","bios":{"en_US":"<p>\nKnown for his Thresh picks, Michael “Bunny Fufuu” Kurylo is a long time support player in the NA scene. Bunny Fufuu originally played support for Curse during the 2014 NA LCS Spring Split before moving to Curse Academy, which later rebranded as Gravity. The move served both him and Gravity well, with his skills in the bot lane steadily improving until he was regarded as one of the best supports in North America.\n</p>\n<p>\nBunny Fufuu's impact in the bot lane caught the attention of more than a few teams, and he was scooped up by Cloud9 in the 2015 offseason.\n</p>\n<p>\nLearn more about Bunny FuFuu's journey in the competitive scene in his <a href=\"https://www.youtube.com/watch?v=G0uDn46IUxE\" target=\"_blank\">Drive episode</a>.\n</p>","fr_FR":"<p>Support bien connu sur la scène nord-américaine, Michael « Bunny Fufuu » est réputé pour son Thresh. \n\nBunny Fufuu jouait à l'origine support pour Curse, lors du segment printanier des LCS NA 2014, avant de \n\npasser chez Curse Academy, qui a ensuite changé de nom pour devenir Gravity. Ce changement a été \n\nfructueux pour lui comme pour Gravity, et ses compétences sur la voie du bas se sont constamment \n\naméliorées jusqu'à ce qu'il soit considéré comme l'un des meilleurs supports d'Amérique du Nord.</p>\n\n<p>L'impact de Bunny Fufuu sur la voie du bas a attiré l'attention de plusieurs équipes et il a fini par être \n\nrecruté par Cloud9 durant l'intersaison 2015. Il travaille en étroite collaboration avec Hai, qui est sans \n\ndoute l'un des meilleurs meneurs nord-américains, avec qui il partage le poste de support chez C9. \n\nProfitant des conseils stratégiques de LemonNation et d'un puissant partenaire en la personne de \n\nSneaky, Bunny Fufuu continuera forcément de faire forte impression lors des LCS NA. </p>\n\n<p>Pour en savoir plus sur le parcours de Bunny Fufuu sur la scène compétitive, regardez l'épisode de Drive \n\nqui lui est consacré.</p>","pl_PL":"<p>Michael Kurylo przedstawił się szerszej publiczności w 2014 roku, kiedy to zasłynął w amerykańskim SoloQ nieprawdopodobną grą Threshem.</p>\n<p> \nVideo: https://www.youtube.com/watch?v=KVIj1t5duP8</p>\n<p>\nNa półprofesjonalnej scenie swoich sił próbował już wcześniej w mniej znanych formacjach, ale to właśnie sezon 2014 okazał się przełomowy. Co prawda w składzie Curse utalentowanemu wspierającemu nie udało się zaistnieć. Najpierw rywalizował z Georgem „Zekentem” Liu i Brandonem „Saintviciousem” DiMarco w szalonym wiosennym splicie 2014. Ciekawostką jest fakt, że Michael występował wtedy w LCS i jednocześnie… uczęszczał do szkoły. Później do zespołu dołączył wyrzucony z TSM-u Alex „Xpecial” Chu. Obydwaj zawodnicy rywalizowali o miejsce w składzie formacji, ale ostatecznie, pomimo pozytywnych recenzji, jakie BunnyFuFuu otrzymał za wiosenne występy, to były gracz TSM-u wygrał ten pojedynek. </p>\n<p>\nNiemniej kariera Michaela potoczyła się w myśl przysłowia „co się odwlecze, to nie uciecze”. BunnyFuFuu dołączył do występującego w NA Challenger Series Curse Academy i to właśnie wokół niego przebudowana została drużyna. </p>\n<p>\n- W ciągu roku BunnyFuFuu będzie lepszy od Xpeciala – powiedział jednak w sierpniu 2014 roku legendarny amerykański dżungler Saintvicious, który występował z Bunny’m w CA.</p>\n<p>\nCurse Academy udało się zebrać naprawdę silny skład i zespół był jednym z faworytów do awansu do LCS. Początki były trudne, ale ostatecznie cel udało się spełnić od razu w pierwszym splicie. Michael i jego koledzy z drużyny byli zmuszeni zmienić organizację i do wiosennej edycji rozgrywek 2015 przystąpili pod banderą Gravity.</p>\n<p>\nZespół zaskoczył znakomitym startem w wiosennym splicie 2015, a BunnyFuFuu, zgodnie z oczekiwaniami, był jednym z filarów zespołu. Ostatecznie drużyna zadomowiła się w środku tabeli i to był na tamten moment szczyt możliwości Michaela i jego kolegów. W przerwie między splitami zmienił się jednak partner Bunny’ego na dolnej alei – Davida „Copa” Robertsona zastąpił obiecujący Johny „Altec” Ru. W związku z tą rotacją uwaga drużyny skupiła się głównie na dolnej alei, gdzie duet młokosów radził sobie fenomenalnie, prowadząc zespół do walki o najwyższe lokaty. Gravity przez moment było nawet liderem rozgrywek, ale ostatecznie skończyło letnią edycję na czwartej pozycji i szybko odpadło w play-offach.</p>\n<p>\nBunnyFuFuu nadal słynie z nieprawdopodobnej gry Threshem, ale w ciągu ostatniego roku jego champion pool znacznie się rozszerzył – amerykański wspierający niemal równie chętnie sięgał po Shena, Alistara, Jannę czy Brauma. Ewidentnie ma jednak tendencję do gry wytrzymałymi wspierającymi. W letnim splicie 2015 BunnyFuFuu był czwartym najczęściej asystującym zawodnikiem w NA LCS. Tę samą lokatę zajął w klasyfikacji supportów obejmującej KDA. Był również drugim najczęściej wardującym graczem w amerykańskich rozgrywkach. Co ciekawe, nick Michaela początkowo miał brzmieć „BunnyFuFu”, ale był on zajęty, wobec czego gracz zdecydował się po prostu dodać drugie „u” i tak powstał obecny pseudonim.</p>\n<p>\nW przerwie przed sezonem 2016 wspierający dołączył do Cloud9, gdzie ma pełnić rolę supporta wymiennie z Haiem „Haiem” Lamem.\n</p>"},"foreignIds":{"drupalId":"1341","TRLH1":"1001220059","TRLH2":"1001160109"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":250,"slug":"goldenglue","name":"Goldenglue","firstName":"Greyson","lastName":"Gilmer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/goldenglue-u8pe0ow.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-29T02:25:49.000Z","bios":{"en_US":"<p>Greyson “Goldenglue” Gilmer has a rich history in competitive League of Legends. He has played for many Challenger and LCS level teams dating back to 2014. After Team Liquid released their starting mid laner Fenix, Goldenglue was called up from their challenger squad to become the team’s starting mid laner.</p>\n\n<p>Goldenglue’s first taste of action as a member of Team Liquid was at IEM Gyeonggi in December 2016. His results were a mixed bag, but he showed that he definitely has the mettle to square up against top flight international competition. His former LCS experience with teams like Echo Fox and Team 8 has prepared him for the pressure that comes with playing on stage against the best players in North America. Does he have what it takes to succeed in mid against the top tier players like Bjergsen and Jensen? We’re about to find out.</p>","de_DE":"Greyson „Goldenglue“ Gilmer hat eine ereignisreiche Vergangenheit in der professionellen „League of Legends“-Szene hinter sich. Er spielt seit 2014 immer wieder für Mannschaften in der Challenger Series und der LCS. Nachdem sich Team Liquid von ihrem Mid-Laner, Fenix, getrennt hatte, holten sie Goldenglue aus ihrer Schwestermannschaft und machten ihn zum neuen Mid-Laner. </p>\nGoldenglue spielte beim IEM Gyeonggi im Dezember 2016 zum ersten Mal für Team Liquid. Er lieferte zwar keine beständige Vorstellung ab, zeigte aber, dass er es mit der internationalen Konkurrenz aufnehmen kann. Seine Erfahrungen bei Mannschaften wie Echo Fox und Team 8 haben ihn auf den Druck, auf der Bühne gegen die besten Spieler Nordamerikas anzutreten, vorbereitet. Hat er das Zeug dazu, sich auf der mittleren Lane gegen Spieler wie Bjergsen und Jensen zu behaupten? Wir werden es bald herausfinden.\n"},"foreignIds":{"drupalId":"1381","TRLH1":"200000243","TRLH2":"200000147"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":326,"slug":"reignover","name":"Reignover","firstName":"Yeu-Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reignover-cswdikvi.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-01-29T02:29:09.000Z","bios":{"en_US":"<p>Yeu-jin “Reignover” Kim has left his mark on both the EU and NA LCS. After guiding Fnatic to an INSANE (incredible, amazing, eye-popping) 18-0 record in 2015, Reignover took a flight across the pond to play for the newly-formed Immortals squad. That team was wildly successful during regular seasons, where Reignover earned himself MVP honors in the 2016 NA LCS Spring Split. Their inability to win in the postseason led to most players, including Reignover, to seek opportunities elsewhere.</p>\n\n<p>Reignover became Team Liquid’s biggest acquisition of the offseason after they parted ways with troubled jungler, Dardoch. He’ll look to continue his dominant ways in 2017 as part of the revamped Team Liquid squad. His arrival coupled with the return of powerhouse AD Carry, Piglet, has given Team Liquid fans more than enough reason to get pumped for the upcoming split. Whether he’s cleaving enemies to death as Olaf, or tunneling his way to victory with Rek’Sai, rest assured that Reignover is going to put on one hell of a show.</p>","pl_PL":"Yeu-jin „Reignover” Kim w tym roku odcisnął swoje piętno na NA LCS. Chociaż Immortals nie udało się zakwalifikować do Mistrzostw, występy Reignovera podczas splitów wiosennego i letniego zapadły w pamięci głosujących, którzy przyznali mu 36 procent głosów na dżunglera. Najwyraźniej fani wierzą, że chociaż Reignover nie pojawił się na Mistrzostwach, bez problemów dorówna reszcie najlepszych dżunglerów świata. </p>\n\nPo odejściu z legendarnej europejskiej drużyny, Fnatic, Reignover podbił Amerykę Północną szturmem, gdy poprowadził dopiero co utworzonych Immortals przez zakończony wynikiem 17-1 sezon zasadniczy i zdobył tytuł najlepszego zawodnika wiosennego splitu NA LCS 2016. Utrzymywał dominację podczas letniego splitu, a Immortals przez cały sezon siedzieli na ogonie zdobywców pierwszego miejsca, TSM. Jednak pomimo stałej dominacji w sezonie zasadniczym, Reignover oraz Immortals zawiedli w fazie pucharowej i kwalifikacjach regionalnych. Podczas wydarzenia All-Star 2016 będzie mógł raz jeszcze pokazać, na co go stać i przypomnieć fanom, dlaczego jest uważany za jednego z najlepszych dżunglerów na świecie.\n","fr_FR":"<p>Yeu-jin \"Reignover\" Kim a marqué les LCS NA cette année. Même si Immortals n'a pas réussi à se qualifier pour le Mondial, les performances de Reignover durant les segments de printemps et d'été sont restés gravées dans les esprits, ce qui lui a valu de remporter 36 pour cent du vote jungler. Les fans pensent clairement que même si Reignover n'a pas participé au Mondial, il aurait été à la hauteur des autres meilleurs junglers du monde.</p>\n\n<p>Après avoir quitté Fnatic, l'équipe européenne historique, Reignover a pris d'assaut l'Amérique du Nord lorsqu'il a permis à l'équipe nouvellement créée des Immortals d'établir un record de 17-1 pendant la saison régulière, ce qui lui a valu le titre de MVP du segment de printemps des LCS NA 2016. Il a continué de dominer le segment d'été, permettant aux Immortals d'être toujours dans la course derrière l'équipe TSM, premiers durant toute la saison. Malgré leur domination dans la saison régulière, Reignover et les Immortals ont échoué lors des play-offs et des qualifications régionales. Au cours de l'événement All-Stars 2016, il va devoir de nouveau faire ses preuves et rappeler aux fans pourquoi il est l'un des meilleurs junglers du monde.</p>","de_DE":"Yeu-jin „Reignover“ Kim hat sowohl der EU LCS als auch der NA LCS seinen Stempel aufgedrückt. Nachdem er Fnatic 2015 zu einem Rekord von 18–0 geführt hatte, zog es Reignover über den großen Teich, um für die neu formierten Immortals zu spielen. Die Mannschaft war in der regulären Saison außerordentlich erfolgreich und Reignover wurde zum MVP des Frühjahrs-Split der NA LCS 2016 gewählt. Doch da die Immortals in der Nachsaison kein Spiel mehr gewinnen konnten, suchten die meisten Spieler, inklusive Reignover, ihr Glück bei anderen Mannschaften.\n<p>\nReignover wurde Team Liquids größte Neuverpflichtung in der Nebensaison, nachdem sie sich von ihrem Jungler, Dardoch, aufgrund von Problemen verabschiedet hatten. Als Teil der neuen Aufstellung von Team Liquid wird Reignover 2017 versuchen, seine Dominanz fortzusetzen. Zusammen mit der Rückkehr des AD-Carrys Piglet hat er dafür gesorgt, dass es die Fans von Team Liquid kaum noch erwarten können, bis der Frühjahrs-Split endlich beginnt. Egal, ob er seine Gegner mit Olaf in Stücke hackt oder sich mit Rek’Sai zum Sieg gräbt, Reignover wird eine verdammt gute Vorstellung abliefern.\n","es_ES":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los split de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores junglas del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviese un récord de 17-1 durante la temporada regular. Además, el jungla ganó el premio al mejor jugador del split de primavera de la LCS NA 2016. Durante el split de verano siguió dominando e hizo que Immortals le pisase los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en los playoffs y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores junglas del mundo.</p>","pt_BR":"<p>Yeu-jin “Reignover” Kim deixou sua marca na LCS NA deste ano. Apesar da Immortals não conseguir a vaga no Mundial, o desempenho de Reignover durante as duas etapas da temporada ficou na cabeça dos jogadores, deixando-o com 36% dos votos da Selva. Fãs claramente acreditam que, apesar de não ter aparecido no Mundial, o rapaz teria se saído tão bem quanto o restante dos melhores caçadores do mundo. </p>\n\n<p>Após sair da europeia Fnatic, Reignover tomou a América do Norte de assalto, liderando a recém-formada Immortals a uma temporada regular com um placar de 17 a 1 e recebendo o prêmio de Jogador Mais Valioso da Etapa de Primavera da LCS NA 2016. Ele continuou a dominar na Etapa de Verão, mantendo a Immortals na cola da líder, TSM, por toda a temporada. Apesar de dominar a fase regular, Reignover e a Immortals não conseguiram se dar bem nas Eliminatórias e classificatórias regionais. No Evento All-Star 2016, ele poderá nos mostrar do que é capaz novamente e lembrar seus fãs do porque ele é um dos melhores caçadores do mundo.</p>","cs_CZ":"<p>Yeu-jin „Reignover“ Kim během letošních bojů v severoamerickém LCS rozhodně nestál v koutě. Immortals se sice na MS nekvalifikovali, Reignoverovy výkony z jarního a letního splitu se ovšem do paměti účastníků hlasování vryly natolik, že získal v kategorii džunglerů 36 % hlasů. Fanoušci očividně věří, že i když se nezúčastnil MS, dokáže se bez obav poprat se světovou džunglerskou špičkou.</p>\n\n<p>Po svém odchodu z věhlasného evropského týmu Fnatic vzal Reignover Severní Ameriku útokem. Nově vytvořené Immortals dovedl k bilanci ze základní sezóny 17:1 a sám získal ocenění pro nejužitečnějšího hráče jarního splitu severoamerického LCS 2016. Jeho dominance pokračovala i v letní části soutěže, během níž Immortals neustále šlapali na paty prvním TSM. Navzdory úspěchům ze základní sezóny však Reignover a Immortals při play-off a regionálních kvalifikacích vypadli z formy. Na turnaji All-Star 2016 tak bude moci opět předvést, co umí, a připomenout fanouškům, proč je označován za jednoho z nejlepších džunglerů na světě.</p>","el_GR":"<p>Ο Yeu-jin “Reignover” Kim άφησε το σημάδι του στο φετινό LCS Βόρειας Αμερικής. Παρόλο που οι Immortals δεν κατάφεραν να προκριθούν στο Παγκόσμιο Πρωτάθλημα, η απόδοση του Reignover στο Spring Split και στο Summer Split έμεινε χαραγμένη στη μνήμη των ψηφοφόρων, με αποτέλεσμα να πάρει το 36% των ψήφων για το ρόλο του παίκτη ζούγκλας. Προφανώς, το κοινό πιστεύει ότι, αν τα κατάφερνε να εμφανιστεί στο Παγκόσμιο Πρωτάθλημα, ο Reignover θα τα πήγαινα μια χαρά σε μια αναμέτρηση με τους καλύτερους παίκτες ζούγκλας του κόσμου.</p> \n\n<p>Μετά την αποχώρησή του από τους Fnatic, μιας από τις ποιο ιστορικές ομάδες της Ευρώπης, ο Reignover γνώρισε τεράστια επιτυχία στη Βόρεια Αμερική όταν οδήγησε τους νεοφώτιστους Immortals σε ένα εκπληκτικό σερί 17-1 στην κανονική σεζόν, κατακτώντας στην πορεία και το βραβείο του MVP για το Spring Split 2016 του LCS Βόρειας Αμερικής. Η ασταμάτητη πορεία του συνεχίστηκε και στο Summer Split, με αποτέλεσμα να κρατήσει τους Immortals σε μικρή διαφορά από τους πρώτους TSM σε όλη τη διάρκεια της σεζόν. Παρά την καταπληκτική τους πορεία στην κανονική σεζόν, ο Reignover και οι Immortals δεν κατάφεραν να προχωρήσουν στα πλέι οφ και στους περιφερειακούς προκριματικούς. Στο Τουρνουά All-Star 2016, θα έχει την ευκαιρία να δείξει και πάλι τι αξίζει και να υπενθυμίσει στους φίλους του παιχνιδιού γιατί είναι ένας από τους καλύτερους παίκτες ζούγκλας στον κόσμο.</p>","hu_HU":"Yeu-jin „Reignover” Kim idén fontos szereplője volt az NA LCS-nek. Bár az Immortals nem jutott ki a vb-re, Reignover tavaszi és nyári teljesítménye olyan mély nyomott hagyott a szavazókban, hogy a dzsungelharcosokra leadott szavazatok 36%-a landolt nála. A rajongók szilárdan hisznek abban, hogy bár Reignover nem játszott a vb-n, állta volna a sarat a világ legjobb dzsungelharcosai ellen. \n</p>\nA legendás európai csapat, a Fnatic elhagyása után Reignover bevette Észak-Amerikát, az újonnan alakult Immortals élén 17-1-es eredményt ért el az alapszakaszban, és ő lett az NA LCS 2016-os tavaszi szakaszának legértékesebb játékosa (MVP). A nyári szakaszban is remekül folytatta, az Immortals végig az első helyen álló TSM nyakában loholt. Az alapszakaszbeli kiváló játékuk ellenére Reignover és az Immortals a rájátszásban és a regionális selejtezőkben is rosszul szerepelt. A 2016-os All-Star gálán ismét bizonyíthat, és megmutathatja, hogy ő a világ legjobb dzsungelharcosa.\n","it_IT":"Quest'anno Yeu-jin \"Reignover\" Kim ha davvero lasciato il segno nella LCS NA. Anche se gli Immortals non sono riusciti a qualificarsi per i Mondiali, le sue prestazioni durante lo Spring e il Summer Split hanno fatto decisamente colpo sui votanti, che lo hanno premiato con il 36% dei voti per la categoria Giungla. È evidente per i fan che, nonostante la sua assenza ai Mondiali, Reignover abbia le carte in regola per duellare con i giocatori da giungla più abili al mondo. </p>\n\nDopo aver lasciato lo storico team europeo di Fnatic, Reignover ha fatto furore in Nord America guidando i neonati Immortals a un record stagionale di ben 17-1, guadagnandosi il riconoscimento di MVP nello Spring Split LCS NA 2016. Il suo predominio è proseguito durante il Summer Split, in cui è riuscito a tenere la sua squadra sempre alle calcagna della capolista TSM per l'intera stagione. Nonostante le loro eccellenti prestazioni nella stagione regolare, Reignover e gli Immortals hanno ceduto durante i playoff e le qualificazioni regionali. Nell'All-Star 2016 Reignover potrà mostrare nuovamente le sue abilità e ricordare ai suoi ammiratori che rimane sempre uno dei migliori giocatori di giungla del mondo.\n\n","ro_RO":"Yeu-jin ''Reignover'' Kim și-a pus amprenta anul acesta pe LCS NA. Cu toate că cei din Immortals n-au reușit să se califice la Mondiale, reușitele lui Reignover din etapele de primăvară și de vară au rămas întipărite în mintea celor care l-au votat, obținându-i 36 la sută din voturile pentru junglă. E clar că fanii sunt de părere că, deși nu a participat la Mondiale, s-ar fi descurcat foarte bine împotriva celorlalți jungleri de top ai lumii. </p>\n\nDupă ce a părăsit Fnatic, echipa europeană care a făcut istorie, Reignover a luat cu asalt America de Nord și a reușit să conducă echipa nou-formată Immortals către un record de 17-1 în sezonul normal, obținând titlul de cel mai valoros jucător (MVP) în etapa de primăvară LCS NA 2016. A continuat să domine și în etapa de vară, Immortals rămânând foarte aproape de TSM, echipa de pe primul loc, de-a lungul întregului sezon. Însă chiar dacă și-au distrus adversarii în sezonul normal, cei din Immortals au dat greș în playoff-uri și la calificările regionale. La All-Star 2016, Reignover va avea șansa să demonstreze de ce e în stare și să le reamintească fanilor de ce e unul dintre cei mai buni jungleri din lume.\n","es_AR":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>","es_MX":"<p>Yeu-jin \"Reignover\" Kim dejó su huella en la LCS NA de este año. Aunque Immortals no logró clasificarse para el Mundial, la actuación de Reignover durante los torneos de primavera y verano quedó grabada en las mentes de los votantes, lo que le ha supuesto un 36 % de los votos para el puesto de la jungla. No cabe duda de que los fans creen que, aunque Reignover no llegó al Mundial, se habría podido enfrentar sin problema al resto de los mejores jungleros del mundo.</p>\n\n<p>Tras abandonar el histórico equipo europeo Fnatic, Reignover arrasó en Norteamérica cuando logró que el equipo recién creado de Immortals obtuviera un récord de 17-1 durante la temporada regular. Además, el junglero ganó el premio al mejor jugador del torneo de primavera de la LCS NA 2016. Durante el verano siguió dominando e hizo que Immortals le pisara los talones durante toda la temporada a los primeros, TSM. A pesar de su dominación durante la temporada regular, Reignover e Immortals se quedaron cortos en la fase eliminatoria y en los Regional Qualifiers. En el All-Star Event 2016, tendrá la oportunidad de demostrar de qué es capaz una vez más y de recordarle a los fans por qué es uno de los mejores jungleros del mundo.</p>"},"foreignIds":{"drupalId":"885","TRLH1":"200000242","TRLH2":"200000146"},"socialNetworks":{"twitch":"","facebook":"www.facebook.com/pages/Yeujin-Reignover-Kim/1572697482942877","twitter":"https://twitter.com/FnaticReignover"},"champions":[],"liveGameTeam":53},{"id":372,"slug":"inori","name":"Inori","firstName":"Rami","lastName":"Charagh","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/inori-1sztspha.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-01-20T00:14:11.000Z","updatedAt":"2017-08-04T00:04:15.000Z","bios":{"en_US":"<p>Rami \"Inori\" Charagh is Phoenix1's fearless jungler. Phoenix1's 2016 NA LCS Summer Split looked like it was played by two entirely different teams. Before Inori joined, the team looked lost. After he arrived, they found a leader. While it wasn't enough to avoid the 2017 NA LCS Promotion tournament, Inori helped the team easily escape relegation.</p>","de_DE":"Rami „Inori“ Charagh ist der furchtlose Jungler von Phoenix1. Beim Sommer-Split der NA LCS 2016 von Phoenix1 hatte man das Gefühl, dass zwei komplett verschiedene Mannschaften an den Start gingen. Vor Inoris Beitritt wirkte das Team verloren. Aber mit ihm haben sie einen neuen Anführer gefunden. Auch wenn es nicht ganz gereicht hatte, das Aufstiegsturnier der NA LCS 2017 zu verhindern, konnten sie mit Inoris Hilfe dem Abstieg mit Leichtigkeit entgehen.\n<p>\nDamit können Inori und Phoenix1 den gesamten Split 2017 ohne Rückstand in Angriff nehmen. Wenn es die neue Mannschaft schafft, seinen aggressiven Spielstil im Dschungel mit Champions wie Rengar und Hecarim zu unterstützen, werden sie ein harter Gegner für jedes Team der NA LCS. Inori ist für seinen Raubtierinstinkt bekannt, und wenn er sich erst einmal einen Vorteil erarbeitet hat, wird er nicht zögern, seinem Gegner den Todesstoß zu versetzen.\n"},"foreignIds":{"drupalId":"2580","TRLH1":"200000233","TRLH2":"200000137"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":395,"slug":"konkwon","name":"konkwon","firstName":"Koo Hyuk","lastName":"Kwon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/konkwon-33wfotlt.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2015-03-21T18:53:34.000Z","updatedAt":"2017-06-24T21:04:16.000Z","bios":{"en_US":"","de_DE":"<p>Trotz seiner jungen Karriere, ist Kevin „KonKwon“ Kwon nicht aus NRG wegzudenken. Er wuchs in Korea und Japan auf und zog nach der achten Klassenstufe in die USA um, wo er den eSports für sich entdeckte. Da er sowohl der koreanischen Sprache, als auch der englischen Sprache mächtig ist, bildet das Support-Talent das Bindeglied zwischen den beiden Parteien Changseok „GBM“ Lee, Eon-Young „Impact“ Jeong und Johnny „Altec“ Ru beziehungsweise Galen „Moon“ Holgate. </p>\n\n<p>Den Großteil seiner kurzen Laufbahn verbrachte KonKwon bei Team Coast in der NA Challenger Series und spielte eine wichtige Schlüsselrolle in den vielzähligen Siegen zu dieser Zeit. Ende 2015 qualifizierte er sich innerhalb Rekordzeit für die NA LCS und konnte somit bereits einen großen Erfolg verbuchen. Allerdings war es nicht das erste Mal in der Erstliga der Nordamerikaner.</p>\n\n<p>Bereits im selben Jahr, hatte der braunhaarige Amateur einen Platz bei dem frisch für die LCS qualifizierten Team Dragon Knights gefunden, wo er einen Monat lang wertvolle Erfahrung sammeln konnte. </p>\n\n<p>Sein Arsenal beinhaltet die verschiedensten Supports und damit verbundenen Spielweisen, so können sich Tanks wie Braum, Nautilus und Alistar sich glücklich schätzen, zum Löwenanteil der gesamten Auswahl zu gehören. Janna und ein wenig Thresh dürfen ebenso öfters unter der Führung des Jünglings, das Licht der Kluft zu sehen bekommen. \nKonKwons Weg hat erst seinen Anfang genommen und noch ist nirgendwo das Ende in Sicht. Hoffen wir an seiner spannenden und ungewissen Geschichte teilhaben zu können und mögen uns seine Manöver begeistern, sodass uns die Kinnlade herunterfällt.</p>","fr_FR":"<p>Kevin « KonKwon » Kwon a laissé son empreinte sur les Challenger Series NA 2015 avec Team Coast, \n\npassant ainsi devant NME pour se catapulter jusqu'aux LCS NA 2016. L'heure de gloire de Coast fut de \n\ncourte durée, et sa place pour les LCS fut acquise par une nouvelle équipe, NRG, fin 2015. KonKwon est \n\nle seul membre de CST à avoir été conservé suite au rachat. Son excellente performance en première \n\nsemaine des Challenger Series NA 2015 (KDA de 29) lui a valu de figurer dans une équipe des LCS NA. \n\nKonKwon n'a plus maintenant qu'à prouver qu'il mérite sa place.</p>","pl_PL":"<p>Support NRG Esports to jedyna pozostałość po Team Coast. Dotychczas grał w znanych zespołach, jak: Team Dragon Knights, Final Five i Team Coast. Niestety nie były faworytami tłumów, ze względu na to, że przeważnie zajmowały miejsce na dole tabeli. Nie zmienia to faktu, że Kevin to uznany support w amerykańskiej lidze. Do jego sukcesów należy zaliczyć doskonały sezon piąty drużyny Team Coast w Kręgu Pretendenta, zwieńczony wynikiem ośmiu zwycięstw i tylko dwóch porażek. Następnie, bo miesiąc później, miał bezpośredni udział w wygranej z Enemy eSports i ponownej kwalifikacji Team Coast do NA LCS. Szczyt osiągnięć nowego supporta NRG Esports to Krąg Pretendenta w Ameryce Północnej.</p>\n<p>\nDroga Kevina \"KonKwon\" Kwona do Ameryki była nietypowa. Urodził się w Seulu w Południowej Korei, ale wychował się w Tokio w Japonii. Wkrótce potem, po ukończeniu pewnego etapu nauki, przeniósł się do USA. Dzięki częstych przeprowadzkach może się pochwalić tym, że potrafi mówić płynnie po koreańsku, japoński i angielsku. Poliglota na karierę profesjonalnego gracza zdecydował się podczas studiów biznesowych na Rutgers University. W związku z czym zdecydował się wziąć przerwę od nauki, aby móc się spełnić grając w League of Legends. Kolejną przeszkodą było dla niego nastawienie jego rodziców, którzy oświadczyli, że nie przeszkodzą mu w pogoni za marzeniami, ale też nie będą finansować jego grania. Brak wsparcia rodziny lub zaplecza finansowego jest dla każdego problemem, ale Kevin mimo tego potrafi o tym zapomnieć i dać z siebie wszystko grając w NA LCS.</p>\n<p>\nDoświadczenie z wielu innych gier jest widoczne w stylu gry Kevina \"KonKwon\" Kwona. Grając w Solo Que nie boi się eksperymentować i odejść od obecnej mety. Dla przykładu lubi grać w Jungli Blitzcrankiem lub Amumu. Na profesjonalnej scenie radzi sobie dobrze większością supportów, jednak najlepiej czuje się Lulu i Janną. Kevin \"KonKwon\" Kwon na początku wiosennego sezonu 2016 wymownie wyraził się o swoich umiejętnościach i planach: „Mam nadzieję przewyższyć wszystkich oczekiwania i zostać najlepszym supportem w Północnej Ameryce.”</p>\n"},"foreignIds":{"drupalId":"4056","ESPORTSTMNT02":"200000744","TRLH1":"200000601"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":482,"slug":"incarnati0n","name":"Jensen","firstName":"Nicolaj","lastName":"Jensen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/incarnati0n-e5bzh5bb.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2015-05-15T18:24:28.000Z","updatedAt":"2017-07-04T19:27:23.000Z","bios":{"en_US":"<p>Nicolaj “Jensen” Jensen is out to prove there’s more than one great Danish mid laner in the NA LCS. After initially struggling when he joined Cloud9 in 2015 to replace departing Hai, he’s done more than just gain his footing: he’s become one of the most dangerous mid laners in the league. During the 2016 NA LCS Summer Split, he led the league in kills with 207 and set a new LCS record with 20 kills in a single game in the playoffs.</p>\n\n<p>Like the rest of Cloud9, Jensen was unsatisfied with the team’s performance at Worlds. Joining a retooled roster for 2017, he had to build synergy with his new jungler, Contractz. A strong season for Jensen and Cloud9 was unfortunately capped by a crushing defeat to TSM in the 2017 NA LCS Spring Split finals. With a clean slate for summer, Jensen will be looking to body fools on his way to the 2017 World Championship. </p>","fr_FR":"<p>Nicolaj « Jensen » Jensen est un mid laner danois de haut niveau, connu pour préférer des assassins \n\ncomme Zed et Fizz. Jensen a commencé sa carrière e-sportive avec Team Solo Mebdi en 2012, lors des \n\nqualifications pour les LCS EU de la Saison 3. Cependant, l'équipe a été disqualifiée du tournoi et s'est \n\nséparée au début de l'année 2013.</p>\n\n<p>Jensen est revenu à la compétition en 2015 quand Cloud9 l'a choisi pour remplacer son mid laner sur le \n\ndépart, Hai. Au début, Jensen a eu du mal dans le nouvel environnement des LCS NA, mais son KDA s'est \n\namélioré considérablement au fur et à mesure qu'il s'habituait au style de jeu de l'équipe et à la scène \n\ndes LCS NA. Jensen a terminé son premier segment professionnel en participant au mondial 2015, au \n\ncours duquel Cloud9 a été éliminée dès la phase de groupe.</p>","pl_PL":"<p>Nikolaj Jensen, bardziej znany jako Incarnati0n, to jedna z najbardziej kontrowersyjnych postaci na profesjonalnej scenie. Głośno o Duńczyku po raz pierwszy zrobiło się w 2012 roku, przed eliminacjami do pierwszego splitu EU LCS w historii. Incarnati0n całkowicie zdominował w tym czasie europejskie SoloQ i jego drużyna była jednym z faworytów do zdobycia miejsca w elitarnych rozgrywkach. Kilka dni przed zawodami sceną wstrząsnęła jednak zaskakująca wiadomość – Incarnati0n (znany wtedy pod pseudonimem Veigodx), a także jego kolega z zespołu Simon „Rayt3rch” Näslund zostali ukarani dożywotnią dyskwalifikacją, a ich formacja (Team Solo Mebdi) wykluczona z turnieju.</p>\n<p>\nSzybko na jaw wyszły na jaw powody tej decyzji. Nikolaj zbudował sobie rozległą kartotekę związaną z łamaniem Kodeksu Przywoływacza. Kara nie sprawiła jednak, że Incarnati0n porzucił League of Legends. Duńczyk tworzył kolejne konta, które były co jakiś czas eliminowane: Vizikodex, Quas0, Suq, Reversio, Apdo Dog2 czy najbardziej znane Wizikx. Mid-laner niejednokrotnie udowadniał ogromną skalę talentu, regularnie dostając się na najwyższe lokaty w europejskim SoloQ. W końcu, po niemal dwóch latach trwania tego procederu, w 2014 roku, Riot zobaczył znaczącą poprawę w postępowaniu gracza i pozwolił mu na pracę z SK Gaming w roli trenera. Niemniej, biorąc pod uwagę powody dyskwalifikacji Duńczyka, Riot pozostawał nieugięty, jeśli chodzi o występy Incarnati0na jako gracza. </p>\n<p>\nTymczasem SK Gaming, od czasu zatrudnienia Nikolaja, odnotowało niesamowity postęp i wygrało fazę zasadniczą wiosennego splitu 2014, zajmując też drugą pozycję w play-offach i trzecią na koniec letniej edycji. Formacji udało się też pojechać na Mistrzostwa Świata. Ogromny progres był widoczny w postawie mid-lanera drużyny Jesse’ego „Jesiza” Le. Wszystko wskazuje na to, że Duńczyk fantastycznie odnalazł się w nowej roli. Nie ulega jednak wątpliwości, że to rozwiązanie go nie satysfakcjonowało – chciał grać.</p>\n<p>\nIncarnati0n skupił się więc na swojej karierze jako zawodnika. Mid-laner potrzebował jeszcze dwóch podejść do aktualizacji jego sprawy. Dopiero w maju 2015 roku przekonał Riot co do swojej przemiany i został dopuszczony do gry na najwyższym poziomie. Ta sprawa podzieliła społeczność na zwolenników drugiej szansy dla utalentowanego zawodnika i przeciwników tej decyzji, wskazujących na skrajnie toksyczną przeszłość. Ostatecznie jednak nie miało to większego znaczenia, bo decyzja była wiążąca i po Duńczyka zgłosiła się chmara chętnych. Od początku faworytem w wyścigu po podpis Incarnati0na było jednak Cloud9 i to właśnie tam trafił obiecujący gracz.</p>\n<p>\n„W dziesięciostopniowej skali, przyjmując za 10 Fakera, myślę, żę Bjergsen i Incarnati0n są prawdopodobnie około ósemki. Pozostali mid-lanerzy z NA LCS oscylują w większości w przedziale 6-7.” – powiedział William „Scarra” Li przed startem splitu, stawiając Incarnati0na obok Bjergsena.</p>\n<p>\nPoczątki nie były jednak łatwe. Incarnati0n miał problemy z zaaklimatyzowaniem się na tak wysokim poziomie i ze spełnieniem wygórowanych oczekiwań kibiców. Kilka pierwszych kolejek było bardzo przeciętne w jego wykonaniu, co spowodowało falę krytyki ze strony fanów, ale później z każdym meczem radził sobie lepiej. Na pewno bardzo pomógł mu powrót do drużyny Haia „Haia” Lama, bowiem od zmiany dżunglera progres był jeszcze wyraźniejszy. Pod koniec splitu Incarnati0n był już mocnym punktem zespołu i miał spory udział w sensacyjnym wywalczeniu przez Cloud9 awansu na Mistrzostwa Świata. Trudy debiutu już więc za nim, a rok 2016 powinien być dla niego znacznie bardziej udany.</p>\n<p>\nW czasach dominacji SoloQ Incarnati0na zasłynął z niezwykle efektywnej gry zabójcami – przede wszystkim Fizzem i Zedem. Na profesjonalnej scenie jego styl gry znacznie się jednak zmienił w związku z wymogami dynamicznie ewoluującej mety. W lecie najczęściej grał Orianną, Azirem i Viktorem, co całkowicie zrozumiałem, gdyż te postaci były w tym czasie najmocniejsze. Jego pocket-pickiem był natomiast AP Kog’Maw. Co ciekawe, spośród graczy NA LCS, Duńczyk najlepiej dogaduje się z Johnym „Altec’iem” Ru i Christianem „IWillDominate” Riverą.\n </p>","de_DE":"Nicolaj „Jensen“ Jensen will allen beweisen, dass es nicht nur einen überragenden dänischen Mid-Laner gibt. Nachdem er anfangs Probleme hatte, als er 2015 als Ersatz für Hai zu Cloud9 gekommen war, konnte er mehr als nur Fuß fassen: Er wurde zu einem der gefährlichsten Mid-Laner der Liga. Beim Sommer-Split der NA LCS 2016 führte er die Liga mit 207 Tötungen an und stellte in den Entscheidungsspielen mit 20 Tötungen in einem einzigen Spiel einen neuen Rekord auf.</p>\n\nJensen war, wie der Rest von Cloud9, mit der Leistung bei der Weltmeisterschaft unzufrieden. In der neuen Aufstellung für den Frühjahrs-Split 2017 muss er an der Synergie zwischen ihm und seinem neuen Jungler, Contractz, arbeiten. Eine gute Harmonie zwischen Mid-Laner und Jungler ist das Erfolgsrezept vieler Top-Teams. Sollten sie es schaffen, gut zusammenzuarbeiten, ist kaum abzusehen, was Jensen 2017 alles erreichen kann.\n","es_ES":"<p>Nicolaj ''Jensen'' Jensen va a demostrar que no solo hay un jugador danés fantástico en la calle central de la LCS NA. Tras tener algunos problemas inicialmente cuando se unió a Cloud9 en 2015 para reemplazar a Hai, no solo se ha ganado su posición, sino que se ha convertido en uno de los mid más peligrosos de la liga. Durante el split de verano de la LCS NA 2016, despuntó en la liga con 207 asesinatos y ha establecido un nuevo récord en la LCS con 20 asesinatos en una sola partida durante los playoffs. También destacó por el número de súbditos asesinados por minuto, alcanzando una media de 9,5.</p>\n\n<p>Tras una dura derrota contra TSM en la final de verano de la LCS NA 2016, Jensen tomó las riendas de su equipo y derrotó a Immortals de nuevo en un enfrentamiento al mejor de 5, lo que significaría su clasificación para el Mundial. Aunque se hizo un nombre jugando asesinos como Zed y LeBlanc, también ha destacado con selecciones específicas como Vel'Koz y Syndra. Si Cloud9 quiere superar la fase de grupos este Mundial, a diferencia del año pasado, Jensen tendrá que deshacerse de los recuerdos de las derrotas del pasado. Puede que las emociones sean el rival más duro para Jensen en el escenario internacional; si consigue dominarlas, su límite serán las nubes.</p>","pt_BR":"<p>Nicolaj “Jensen” Jensen veio para provar que há mais do que só um grande jogador dinamarquês na rota do meio na NA LCS. Após um começo difícil quando entrou para a Cloud9 em 2015 para substituir Hai, ele fez muito mais do que só conquistar o seu lugar: ele se tornou um dos meios mais perigosos do League. Durante a Etapa de Verão da NA LCS 2016, ele ficou na liderança em número de abates marcando 207 e alcançou um novo recorde na LCS com 20 abates em um único jogo nas eliminatórias. Ele também ficou em primeiro em abates de tropa por minuto, marcando 9,5.</p>\n\n<p>Depois de uma derrota esmagadora para a TSM na Final da Etapa de Verão da NA LCS, Jensen reuniu sua equipe, que conseguiu derrotar mais uma vez a Immortals em uma melhor de 5, qualificando-se assim para o Mundial. Apesar de ter feito seu nome jogando com assassinos como Zed e LeBlanc, ele também se sobressai em escolhas mais específicas como Vel’Koz e Syndra. Se a Cloud9 espera superar sua saída na Fase de Grupos do Mundial do ano passado, Jensen vai ter que superar as derrotas do passado. As emoções talvez sejam um de seus piores inimigos no palco internacional. Se ele conseguir controlá-las, o céu é o limite.</p>","es_AR":"<p>Nicolaj \"Jensen\" Jensen ha venido para demostrar que hay más de un carrilero central danés habilidoso en la LCS NA. Después de un arduo inicio en Cloud9 como reemplazo de Hai en el 2015, ha logrado más que ganarse su lugar: se ha convertido en uno de los carrileros centrales más poderosos de la liga. Durante el torneo de clausura de la LCS NA 2016, encabezaba la liga con 207 asesinatos y registró una marca inédita de la LCS con 20 asesinatos en un solo combate durante las eliminatorias. También lideró la liga con 9.5 CS por minuto.</p>\n\n<p>Después de una aplastante derrota ante TSM en la final del torneo de clausura de la LCS NA 2016, Jensen reunió a su equipo para derrotar a Immortals una vez más en un combate al mejor de cinco y clasificar al Mundial. A pesar de que se hizo reconocido jugando con asesinos como Zed y Leblanc, también se destacó usando personajes especializados como Vel’Koz y Syndra. Si Cloud9 espera mejorar luego de su salida en la fase de grupos del Mundial del año pasado, Jensen deberá despejar los fantasmas de las derrotas anteriores. Quizás las emociones sean el rival más duro de Jensen en el escenario internacional. Si logra dominarlas, su límite será el cielo.</p>"},"foreignIds":{"drupalId":"4330","TRLH1":"200000174","TRLH2":"200000078","TRLH3":"200000338"},"socialNetworks":{"facebook":"https://www.facebook.com/c9incarnati0n","twitch":"https://twitch.tv/incarnati0n","twitter":"https://twitter.com/Incarnati0nLoL"},"champions":[],"liveGameTeam":18},{"id":499,"slug":"smoothie","name":"Smoothie","firstName":"Andy","lastName":"Ta","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smoothie-5yeikqg2.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:10.000Z","updatedAt":"2017-07-04T19:27:48.000Z","bios":{"en_US":"<p>Andy “Smoothie” Ta offers Cloud9 the perfect blend of support attributes -- control of the map, and protection of carries. After spending most of the 2016 Summer Split sharing time in the support role, Smoothie took over the job full time near the end of the split and never looked back. Despite limited playtime, Smoothie had the third best support KDA in the league for the Summer Split.</p>\n\n<p>In less than a year, Smoothie went from bouncing around the NA Challenger scene all the way to the 2016 World Championship. While the rookie was overshadowed by some of the world’s finest, he’s one of the best young supports in the scene. He’ll have his sophomore season to level up his skills and take another shot at greatness on the world stage.</p>","fr_FR":"<p>Andy « Smoothie » Ta a rejoint Team Liquid en 2015 après ses débuts aux LCS avec Team Dragon \n\nKnights, plus tôt dans l'année. Bien que ce support ait été plutôt discret dans sa première année aux LCS, \n\nSmoothie a impressionné les dirigeants de TL au point que ces derniers lui ont proposé une place dans \n\nl'équipe ; équipe qui a fini à la première place de la saison régulière du segment d'été des LCS NA 2015. \n\nIl ne tient qu'à lui de prouver qu'il est capable de conserver son poste.</p>","pl_PL":"<p>Pochodzący z Calgary, w Kanadzie, \"Smoothie\" zainteresował się profesjonalną sceną dopiero w sezonie piątym. Dołączył do Team Dragon Knights w lutym 2015 roku, zastępując poprzedniego supporta. Zamiana zbiegła się w czasie z początkiem wiosennego sezonu NA Challenger Series 2015. Andy, wraz z drużyną, skończył go na drugim miejscu z wynikiem 7:3. Po zajęciu też drugiego miejsca w rozgrywkach barażowych zakwalifikował się do Summer Promotion Tournament. TDK zostało wybrane przez Winterfox, lecz udało im się zwyciężyć, pomimo substytucji mid-lanera. Niestety „rycerze” nie poradzili sobie najlepiej w letnim sezonie NA LCS 2015, kończąc na ostatnim miejscu z wynikiem 3:15. Przez pozycję na samym dnie zostali automatycznie przeniesieni z powrotem do NA Challenger Series. Dlatego \"Smoothie\" opuścił szeregi Team Dragon Knights w październiku 2015 roku. Jednak umiejętności Kanadyjczyka zaprezentowane w tym okresie zrobiły wrażenie na wielu osobach – w efekcie dostał zaproszenie do Team Liquid.</p>\n<p>\nPrzyjęcie Andiego do drużyny zostało ogłoszone 16.10.2015 poprzez film w internecie pt. „Team Liquid Smoothie Challenge”. W nim czterech członków organizacji ściera się w konkursie na zrobienie najlepszego koktajlu, a o zwycięzcę ma wyłonić tajemniczy sędzia. Oczywiście sędzia to Andy, który oświadcza, że jest tylko jeden prawdziwy „Smoothie” i że będzie supportem w  Team Liquid. Fakt, że zastępuje doświadczonego Alexa \"Xpecial\" Chu’a, bardzo dobrze o nim świadczy.</p>\n<p>\nZa swojego ulubionego bohatera uważa Thresha, jednak cieszy go też gra Janną i Annie. W letnim sezonie NA LCS 2015 można także było zobaczyć jego imponującą grę Nautilusem. Pomimo krótkiego stażu na scenie esportowej posiada sporą ilość wielbicieli, co jest główną zasługą jego aktywności na portalach społecznościowych. Lubi umieszczać w internecie zdjęcia swojego autorstwa, np. swoich z innymi ludźmi lub potraw. Aż 1500 osób śledzi jego dzieła sztuki fotografii. Poza tym przepada za komentowaniem bieżących wydarzeń na świecie. Wszystko zapowiada, że będzie miał doskonały kontakt z fanami.\n</p>","de_DE":"Andy „Smoothie“ Ta bietet Cloud9 die perfekte Mischung an Supporter-Attributen: Er sorgt dafür, dass seine Mannschaft die Kontrolle über die Karte hat und beschützt die Carrys. Nachdem Smoothie die Supporter-Rolle für einen Großteil des Sommer-Splits 2016 teilen musste, ist er seit Ende der Saison alleine für das Wohl seiner Mitspieler verantwortlich. Trotz der beschränkten Spielzeit erreichte Smoothie die drittbeste Supporter-TTU (KDA) des Sommer-Splits.\n</p>\nIn weniger als einem Jahr hat es Smoothie von der nordamerikanischen Challenger-Szene bis zur Weltmeisterschaft 2016 geschafft. Auch wenn er von einigen der besten Spieler der Welt überschattet wurde, gehört er trotzdem zu den besten jungen Supportern der Szene. In seiner zweiten Saison hat er die Chance, weiter an seinen Fähigkeiten zu arbeiten und erneut zu versuchen, auf der WM-Bühne zu brillieren.\n","es_AR":"<p>Andy \"Smoothie\" Ta ofrece a Cloud9 la combinación perfecta de atributos de un soporte: control del mapa y protección de acarreadores. Después de pasar la mayor parte de la temporada regular del 2016 jugando parcialmente en ese rol con Bunny FuFuu, Smoothie comenzó a desempeñar esta tarea de tiempo completo para el final de la temporada y sin mirar atrás. A pesar de que su tiempo de juego fue limitado durante la mayor parte del torneo, Smoothie obtuvo el tercer mejor KDA de un soporte en la liga con 5.6 puntos. Se destacó con el Bardo durante la temporada regular, y su Tahm Kench ayudó a sellar la victoria del quinto combate contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha tenido un largo recorrido desde sus días en la escena de retadores de NA durante los últimos dos años. En el juego temprano, su fuerte carril protege a Sneaky y permite que el acarreador principal de C9 sobreviva intacto hasta el final del combate. Aunque Smoothie suele quedar opacado por Biofrost, otro gran soporte novato, tuvo un desempeño increíble para alguien con tan poca experiencia profesional. La falta de experiencia se pondrá a prueba en el Mundial. Allí se debilitará y perderá, o permanecerá firme y ganará bajo las brillantes luces del escenario internacional.</p>","es_ES":"<p>Andy ''Smoothie'' Ta ofrece a Cloud9 la mezcla perfecta de atributos de apoyo: control del mapa y protección para los carries. Tras pasar la mayor parte de la temporada regular de 2016 compartiendo el rol de apoyo con Bunny FuFuu, Smoothie acabó por ocupar el puesto a tiempo completo al final de la temporada, y no ha mirado atrás desde entonces. A pesar de haber contado con tiempo limitado de juego la mayor parte del split, Smoothie consiguió la tercera mejor A/M/A de apoyo de la liga, con una puntuación de 5,6. Durante la temporada regular destacó con Bardo, y su Tahm Kench ayudó a conseguir la victoria en la quinta partida contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha recorrido un largo camino desde que frecuentara la escena Aspirante de Norteamérica durante los últimos dos años. Al principio de la partida, su potente actividad en calle protege a Sneaky, lo que ayuda que el carry principal de C9 llegue a final de partida de una pieza. Aunque Biofrost, otro apoyo principiante, suele hacerle sombra, Smoothie lo hace increíblemente bien para tener tan poca experiencia profesional. Su escasa experiencia será puesta a prueba en el Mundial, donde podrá derrumbarse y perder, o mantenerse como un témpano de hielo y ganar bajo los ardientes focos del escenario internacional.</p>","pt_BR":"<p>Andy “Smoothie” Ta oferece à Cloud9 a mistura de atributos perfeita para um suporte: controle de mapa e proteção de carregadores. Após passar grande parte da temporada regular de 2016 dividindo a função de suporte com Bunny FuFuu, Smoothie passou a exercer a função em tempo integral próximo do final da temporada e nunca mais olhou para trás. Apesar de seu pouco tempo de jogo em grande parte da Etapa, Smoothie alcançou o terceiro melhor AMA entre os suportes da liga, marcando 5,6. Ele se sobressaiu de Bardo durante a temporada regular e seu Tahm Kench ajudou a fechar o último jogo contra a Immortals nas Semifinais.</p>\n\n<p>Smoothie trilhou um longo caminho desde a época em que se aventurava no cenário Desafiante na NA até esses últimos dois anos. No início do jogo, sua poderosa fase de rotas consegue proteger Sneaky e ajudar que o principal carregador da C9 chegue inteiro no fim de jogo. Apesar de Smoothie muitas vezes ser ofuscado por Biofrost, outro suporte novato incrível, ele ainda tem um desempenho excelente para alguém com tão pouca experiência no cenário profissional. Mas essa falta de experiência será posta à prova no Mundial, onde ele só terá duas opções: ser massacrado e perder ou manter a calma e vencer sob os enormes holofotes do palco internacional.</p>"},"foreignIds":{"drupalId":"3799","TRLH2":"200000080","TRLH1":"200000176","TRLH3":"200000340"},"socialNetworks":{"twitter":"https://twitter.com/LiquidSmoothiee"},"champions":[],"liveGameTeam":18},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":558,"slug":"mickey","name":"Mickey","firstName":"Youngmin","lastName":"Son","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mickey-emcoa162.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-05T21:03:01.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3190","ESPORTSTMNT06":"200000962","TRLH1":"200000719"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":626,"slug":"lourlo","name":"Lourlo","firstName":"Samson","lastName":"Jackson","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lourlo-fmal547y.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-01-29T02:26:38.000Z","bios":{"en_US":"<p>Samson \"Lourlo\" Jackson made his LCS debut in the 2016 NA LCS Spring Split when he was known as Lourlo. His previous experience with CLG Black prepared him for the jump from semi-pro to pro, and while he didn’t stand out, it’s hard to blame him - with Dardoch and Piglet on your team, it’s hard to get attention.</p>\n\n<p>Yet analysts and fans noticed Lourlo’s rock solid dedication. Even when Liquid had a rough game, Lourlo was playing his heart out. His commitment to constantly bettering himself led to him netting more consistent performances. He may not be the flashiest player on the Rift, but you’d be hard pressed to find anyone that works harder. Team Liquid kept him on board during their roster shuffle, cementing that they believe Lourlo still has heaps of potential that they’re keen to unlock.</p>","fr_FR":"<p>Sam « Lourlo » Jackson fait ses débuts dans les LCS NA en participant à ce segment de printemps 2016. Son expérience passée auprès de CLG Black l'a préparé pour son passage du statut de semi-pro à pro véritable, mais rien ne vaut un premier segment pour réellement faire la distinction entre le bon et la brute (ou le truand). Étant donné que Lourlo est actuellement en 26e place du serveur NA, il devrait à tout le moins être capable de s'affirmer au niveau des mécaniques de jeu.</p>\n<p>Nous n'avons pas vu Lourlo participer à un événement majeur de League of Legends depuis les Challenger Series du printemps 2015. Impossible de prévoir quel genre de nouveauté il pourrait apporter à la méta aujourd'hui ! D'après ses performances en file solo, il maîtrise une multitude de champions, parmi lesquels figurent Riven, Irelia, Nidalee et Rumble.</p>","pl_PL":"<p>\"Lourlo\" zaczął grać w League of Legends w pierwszym sezonie, lecz na grę w profesjonalnym zespole zdecydował się dopiero we wrześniu 2014 roku. Był jednym z założycieli drużyny Storm, wraz z takimi znanymi zawodnikami jak: Zachary \"mancloud\" Allan Hoschar i Terry \"BIG\" Chuong. Planowali zakwalifikować się do wiosennego sezonu NA LCS 2015, lecz Samson jeszcze nie miał wtedy skończonych 17 lat. Dlatego ostatecznie cała drużyna pozostała na scenie Kręgu Pretendenta. Jednak już w lutym 2015 roku zdecydował się grać w Challenger Series dla innej organizacji – Counter Logic Gaming Black. Nie osiągnął za wiele w ich szeregach, gdyż skończył wiosenny okres na 6 pozycji, co było dosyć przeciętnym wynikiem. Jednak \"Lourlo\" dokonał najważniejszej rzeczy dla niego samego – pokazał się wśród profesjonalistów. Swoimi wynikami w Challenger Series zachęcił poważną organizację, Team Liquid, do zaproszenia go do pierwszego składu. Sam powiedział, że gra w CLG Black pozwoliła mu zdobyć doświadczenie na profesjonalnej scenie i rozwinąć swój zasób bohaterów, co było niezbędne dla przejścia do wyższej ligi.</p>\n<p>W wywiadzie dla theScore eSports Samson opowiedział o swoich uczuciach związanych z objęciem tak odpowiedzialnej pozycji. Przyznał, że w tak wczesnym etapie jego kariery, taki „awans” to dla niego olbrzymia nobilitacja. Uważa, że dla debiutanta zastąpienie takiego weterana jak Diego \"Quas\" Ruiz to zaszczyt i jednocześnie wyzwanie. \"Lourlo\" przyznał, że „ma nadzieję, że sprosta tej próbie sił i dowiedzie swoich umiejętności wśród najlepszych zawodników”. Wiele osób opisuje Samsona jako niezwykle agresywnego top-lanera, który zawsze podejmuje próbę carrowania swojej drużyny. Jednak zaraz po dołączeniu do Team Liquid, on sam zaznaczył, że dostosuje się do nowego zespołu i jeśli zajdzie potrzeba zmieni swój styl gry. Wywiad podsumował stwierdzeniem, że w wiosennym sezonie NA LCS 2016 da z siebie wszystko. </p>\n<p>Pseudonim Samsona pochodzi z czasów kiedy grał w inne gry. Spędzał tak czas ze swoim bratem, który jest profesjonalnym zawodnikiem innych komputerowych tytułów. Na swoją pozycję najbardziej lubi wybierać Nidalee i Irelię, ponieważ docenia ich możliwości w agresywnych zagraniach. Wojowniczym postaciom na top-lanie zawdzięcza wejście do Kręgu Pretendenta w Ameryce Północnej. Jednak, gdy pojawia się konieczność, świetnie sobie radzi takimi bohaterami jak Sion czy Maokai. </p>\n","de_DE":"Sam „Lourlo“ Jackson gab sein LCS-Debüt im Frühjahrs-Split der nordamerikanischen LCS 2016. Seine Erfahrungen mit CLG Black haben ihn auf den Sprung vom Halbprofi zum Profi vorbereitet und obwohl er keine überragende Leistung ablieferte, kann man ihm nichts vorwerfen – wenn Dardoch und Piglet in deiner Mannschaft sind, ist es schwer, Aufmerksamkeit zu erregen.\n</p>\nDennoch fiel den Analysten und Fans Lourlos unglaubliches Engagement auf. Selbst in schwierigen Spielen gab Lourlo alles. Seine Hingabe, sich ständig selbst zu verbessern, führte dazu, dass er immer beständigere Leistungen ablieferte. Er ist vielleicht nicht der auffälligste Spieler in der Kluft, aber man muss schon ziemlich lange suchen, um jemanden zu finden, der härter arbeitet als er. Team Liquid hat an Lourlo festgehalten und die Entscheidung damit gerechtfertigt, dass er ihrer Meinung nach noch unglaublich viel Potenzial hat, das sie gerne entfesseln würden.\n"},"foreignIds":{"drupalId":"3814","TRLH1":"200000241","TRLH2":"200000145"},"socialNetworks":{"twitch":"http://www.twitch.tv/lourlo","twitter":"https://twitter.com/LiquidLourlo"},"champions":[],"liveGameTeam":53},{"id":777,"slug":"dardoch","name":"Dardoch","firstName":"Joshua","lastName":"Hartnett","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dardoch-h91p55co.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:26:47.000Z","updatedAt":"2017-08-04T00:04:43.000Z","bios":{"en_US":"Joshua “Dardoch” Hartnett is a true competitor. He demonstrated that in his impressive rookie season that saw him carry and trash talk with the best of them. But his obsession with winning over all else caused problems during a tumultuous Summer Split for Liquid, and he was forced off the team.\n</p>\n<p>Talent has never been a question for Dardoch. If he can work his team, his competitive drive could carry them to new heights.</p>\n\n","de_DE":"Joshua „Dardoch“ Hartnett ist ein echter Wettkämpfer. In seiner beeindruckenden ersten Saison hat er gezeigt, dass er Spiele im Alleingang entscheiden und auch die Besten der Besten gegen die Wand reden kann. Aber seine Versessenheit darauf, um jeden Preis zu gewinnen, hat während des turbulenten Sommer-Splits für Probleme bei Liquid gesorgt, weshalb er auch aus dem Team geworfen wurde.\n</p>\nDie Immortals bieten Dardoch im Jahr 2017 die Chance auf einen Neuanfang. Nach den Umbrüchen in der gesamten NA LCS ist der Titel des Frühjahrs-Splits 2017 reif für die Ernte. Dardochs Talent steht außer Frage. Wenn er mit seinem neuen Team harmoniert, könnte er den Immortals mit seiner wettkampforientierten Einstellung zu neuen Höchstleistungen verhelfen.\n"},"foreignIds":{"drupalId":"3835","TRLH1":"200000216","TRLH2":"200000120"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":969,"slug":"matt","name":"Matt","firstName":"Matt","lastName":"Elento","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/matt-g07k92st.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-05T20:10:14.000Z","updatedAt":"2017-01-29T02:27:14.000Z","bios":{"en_US":"<p>Matt \"Matt\" Elento is a Hawaiian who often wears a huge smile and a relaxed attitude. If you saw him out of game, you might not realize that you’re looking at one of the best Bard players around. Stand near a wall? Matt’s going to get you. Group up in a bad location? Ult incoming. Playing a mechanically intensive and unorthodox champion is rough at the best of times -- now imagine you’re doing it in your rookie season, and oh yeah, you’re playing with a World Champion in your lane. Welcome to Matt’s life.</p>\n\n<p>Matt has proven that he has big play potential on the LCS stage, but he has admittedly questioned his own decision making in game which lead to fluctuating performances in the 2016 NA LCS Summer Split. If the first step to fixing yourself is admitting your faults, Matt is well on his way to improving his play. He comes into 2017 with his explosive laning buddy Piglet back by his side and has the chance to make good on his promises to improve. He has the ability to make electric plays -- now it’s time to hit the Rift and prove it.</p>\n\n<p>Learn more about Matt in his <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">Drive documentary.</a></p>","de_DE":"Matt „Matt“ Elento ist ein Hawaiianer, der meistens mit einem breiten Grinsen und einer entspannten Grundhaltung zu sehen ist. Wenn man ihm außerhalb des Spiels begegnet, merkt man nicht, dass man gerade vor einem der besten Bard-Spieler der Welt steht. Du stehst neben einer Mauer? Matt wird dich schnappen. Du hast dich mit deinem Team an einem schlechten Ort versammelt? Schon kommt der Ult. Es ist meistens schwierig, einen mechanisch anspruchsvollen, unkonventionellen Champion zu spielen – und jetzt stell dir vor, du machst das in deiner ersten Saison und dein Partner auf der Lane ist ein Weltmeister. Willkommen in Matts Leben.\n</p>\nMatt hat auf der Bühne der LCS bewiesen, dass er großes Potenzial hat, aber er hat auch seine eigenen Entscheidungen im Spiel hinterfragt, die zu durchwachsenen Leistungen im Sommer-Split der NA LCS 2016 geführt haben. Wenn der erste Schritt zur Besserung die Selbsterkenntnis ist, dann ist Matt auf dem besten Weg, sich als Spieler zu verbessern. 2017 hat er mit Piglet einen explosiven Partner auf der Lane und die Chance, sein Versprechen, sich zu verbessern, in die Tat umzusetzen. Er ist imstande, elektrisierende Spielzüge auszuführen – und jetzt wird es Zeit, sein Können in der Kluft unter Beweis zu stellen.</p>\n<p>Erfahre mehr über Matt in seiner  <a href=\"https://www.youtube.com/watch?v=onxIIQTXfXo&index=2&list=PLPZ7h6L6LC7UTKoZFdqlQohnk2fISgReK\" target=\"blank\">DRIVE-Geschichte.</a></p>"},"foreignIds":{"TRLH1":"200000245","TRLH2":"200000149"},"socialNetworks":{},"champions":[],"liveGameTeam":53},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":2081,"slug":"insanity","name":"Insanity","firstName":"David","lastName":"Challe","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/insanity-5ba0sw13.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-07-28T01:25:57.000Z","updatedAt":"2017-07-28T01:42:26.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":53}],"scheduleItems":[{"id":"AVw2eygqoUG4HPFjOKQg","content":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:match:dd963c44-73f5-4876-be4d-bbf30357e721","scheduledTime":"2017-06-24T22:00:00.129+0000","tags":{"blockLabel":"4","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:bracket:056f01c3-bc2a-4a52-b538-0088fc0df178","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056"},"match":"dd963c44-73f5-4876-be4d-bbf30357e721","tournament":"9c67f1fe-34d8-445b-a93f-d93e0ecd0056","bracket":"056f01c3-bc2a-4a52-b538-0088fc0df178","league":"2"}],"gameIdMappings":[{"id":"9cc572f9-60b3-4acb-af9d-80e9dea23e91","gameHash":"aa1f2fec0eb2832f"},{"id":"833265ab-141f-4aa1-b640-4ca012b76791","gameHash":"c65da8e6c38ac76b"}],"videos":[{"id":7537,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:9cc572f9-60b3-4acb-af9d-80e9dea23e91","source":"https://www.youtube.com/embed/6Xoet2Kb9Zo?wmode=transparent&rel=0","createdAt":"2017-06-24T22:33:19.000Z","updatedAt":"2017-06-24T22:33:19.000Z","game":"9cc572f9-60b3-4acb-af9d-80e9dea23e91"},{"id":7539,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:9c67f1fe-34d8-445b-a93f-d93e0ecd0056:game:833265ab-141f-4aa1-b640-4ca012b76791","source":"https://www.youtube.com/embed/jP7mEblp6SU?wmode=transparent&rel=0","createdAt":"2017-06-24T23:55:37.000Z","updatedAt":"2017-06-24T23:55:37.000Z","game":"833265ab-141f-4aa1-b640-4ca012b76791"}],"htmlBlocks":[],"match":{"id":"dd963c44-73f5-4876-be4d-bbf30357e721","name":"C9-vs-TL","position":33,"state":"resolved","groupPosition":1,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"games":{"9cc572f9-60b3-4acb-af9d-80e9dea23e91":{"id":"9cc572f9-60b3-4acb-af9d-80e9dea23e91","name":"G1","generatedName":"C9|TL|G1|dd963c4473f54876be4db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498343912192,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498340507755,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002250078","gameRealm":"TRLH1","platformId":"TRLH1:1002250078","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"43f2f4d6-d142-4d83-a006-8053b6e435fc":{"id":"43f2f4d6-d142-4d83-a006-8053b6e435fc","name":"G3","generatedName":"C9|TL|G3|dd963c4473f54876be4db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"},{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"833265ab-141f-4aa1-b640-4ca012b76791":{"id":"833265ab-141f-4aa1-b640-4ca012b76791","name":"G2","generatedName":"C9|TL|G2|dd963c4473f54876be4db","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"},{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498348411992,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498344191481,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002250085","gameRealm":"TRLH1","platformId":"TRLH1:1002250085","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498348411993,"source":"bestOf","history":[{"result":[[{"roster":"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9"}],[{"roster":"96bc625c-e07d-48d2-9fa5-cfbcd5c60659"}]],"timestamp":1498344191481,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"96bc625c-e07d-48d2-9fa5-cfbcd5c60659":0,"d6bed7e0-d6ce-4da4-8e36-6e5b3a34efb9":1}}}