{"teams":[{"id":77,"slug":"qiao-gu","name":"NewBee","guid":"be6df6f7-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/qiao-gu-4kmc55n8.png","acronym":"NB","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:03:29.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4380"},"players":[131,139,573,577,582,707,1283,1648,1651,1986],"starters":[131,573,577,582,1283],"subs":[139,707,1648,1651,1986]},{"id":78,"slug":"vici-gaming","name":"Vici Gaming","guid":"be6dfa03-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/vici-gaming-hzibc6u0.png","acronym":"VG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-01-09T23:34:54.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3753"},"players":[47,402,550,638,649,653,1034,1297,1662,1663],"starters":[47,402,550,649,1034],"subs":[638,653,1297,1662,1663]}],"players":[{"id":47,"slug":"bengi","name":"Bengi","firstName":"Seongung","lastName":"Bae","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bengi-bv0g2g0j.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2016-12-10T16:23:42.000Z","bios":{"en_US":"<p>Seongung \"Bengi\" Bae is a League of Legends World Champion and star jungler for SK Telecom T1. His quiet attitude aligns perfectly with his playstyle. Bengi is a core component in the Faker terror train, focusing his efforts on feeding SKT’s solo lanes instead of getting himself ahead. Multiple Korean coaches believe Bengi was the key factor behind SKT’s incredible run during 2013-2014 Champions Winter. He exerts an enormous amount of pressure throughout the map, keeping his opponents on their toes.</p>\n\n<p>After achieving first place multiple times in the LCK, and winning his third World Championship title in 2016, Bengi has just about done it all. The fans decided that wasn’t the case though, and they voted the wily veteran into the 2016 All-Star event over LCK young blood, Peanut. He might be an old dog, but the fans believe he doesn’t need any new tricks to be successful.</p>","fr_FR":"<p>Seong-woong « Bengi » Bae est un champion du monde de League of Legends et le jungler vedette de SK Telecom T1. Son tempérament calme est en parfaite adéquation avec son style de jeu. Bengi est un élément central du succès spectaculaire de l'équipe de Faker, car sa tactique est de « feed » les voies solo de SKT au lieu de prendre lui-même l'avantage. De nombreux entraîneurs coréens pensent que Bengi est le facteur clé derrière le parcours spectaculaire de SKT durant le tournoi Champions Winter 2013-2014. Il exerce une pression exceptionnelle sur la carte, obligeant ses adversaires à la prudence.</p>\n\n<p>Après avoir décroché la première place plusieurs fois aux LCK et avoir remporté son troisième titre de champion du monde en 2016, Bengi n'a plus grand chose à prouver. Mais les fans en ont décidé autrement et ils ont voté pour la participation du vétéran rusé à l'événement All-Stars 2016, plutôt que pour le petit nouveau de LCK, Peanut. Les fans estiment que ce vieux singe n'a plus besoin d'apprendre de nouveaux tours pour réussir.</p>","pl_PL":"Seongung „Bengi” Bae jest byłym mistrzem świata League of Legends i gwiazdorskim dżunglerem SK Telecom T1. Jego spokojne usposobienie idealnie pasuje do prezentowanego stylu gry. Bengi stanowi podstawowy element machiny terroru rozpędzanej przez Fakera, starając się zapewnić przewagę jemu i Smebowi, zamiast skupiać się na sobie. Wielu koreańskich trenerów uważa, że Bengi miał kluczowe znaczenie dla niesamowitych występów SKT podczas Champions Winter 2013-2014. Wywiera niesamowitą presję na całej mapie, nie dając przeciwnikom ani chwili spokoju.</p>\n\nPo kilkukrotnym zdobyciu pierwszego miejsca w LCK i wygraniu trzeciego Mistrzostwa Świata w 2016 roku Bengi osiągnął już właściwie wszystko. Jednak fani zdecydowali, że tak nie jest i wybrali chytrego weterana na wydarzenie All-Star 2016, zapewniając mu przewagę głosów nad młodą krwią LCK, Peanutem. Być może Bengi ma ograny repertuar, ale fani są zdania, że nie musi uczyć się żadnych nowych sztuczek, by osiągnąć sukces.\ns. Zdecydowanie nie. Nigdy.</p>","de_DE":"<p>Seong-ung „Bengi“ Bae ist ein „League of Legends“-Weltmeister und der Jungler von SK Telecom T1. Seine ruhige Art passt perfekt zu seinem Spielstil. Bengi ist ein Hauptbestandteil von Fakers furchteinflößender Bande und konzentriert sich mehr darauf, SKTs Solo-Lanes zu unterstützen als selbst voranzukommen. Viele koreanische Coaches glauben, dass Bengi der Schlüssel zu SKTs unglaublichem Durchlauf beim Champions Winter 2013–2014 war. Er baut auf der gesamten Karte einen unglaublichen Druck auf und sorgt dafür, dass sich seine Gegner keine Sekunde ausruhen können.</p>\n\n<p>Nach mehreren ersten Plätzen in der LCK und dem dritten Weltmeistertitel 2016 hat Bengi so gut wie alles erreicht. Die Fans sahen das jedoch anders und wollen den Veteranen anstelle des jungen Peanut beim All-Stars-Event 2016 sehen. Er ist vielleicht ein alter Hund, aber die Fans sind der Meinung, dass er keine neuen Tricks mehr lernen muss, um erfolgreich zu sein.</p>","es_ES":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el jungla estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que centra sus esfuerzos en hacer avanzar las calles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Puede que sea un veterano de costumbres, pero sus fans consideran que no necesita cambiarlas para llegar hasta lo más alto.</p>","pt_BR":"<p>Seongung \"Bengi\" Bae é um tricampeão mundial de League of Legends e o ex-caçador da SK Telecom T1. Sua atitude calma se alinha perfeitamente com seu estilo de jogo. Bengi era um componente essencial para o trem do terror de Faker, focando seus esforços em feedar as rotas solo da SKT em vez de acumular recursos para ele mesmo. Muitos técnicos coreanos acreditam que Bengi foi o fator chave para o incrível sucesso da SKT durante o Inverno da Champions 2013-2014. Ele exerce uma enorme pressão no mapa, mantendo seus inimigos aos seus pés.</p>\n\n<p>Depois de alcançar o primeiro lugar diversas vezes na LCK e três vezes no Campeonato Mundial, Bengi já provou o que tinha que provar. Os fãs decidiram que não era esse o caso, e votaram no veterano para o Evento All-Star 2015. Ele pode ser um cão velho, mas ele não precisa de nenhum novo truque para mostrar do que é capaz.</p>","es_AR":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el junglero estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que concentra sus esfuerzos en hacer avanzar los carriles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Quizá sea un veterano, pero sus fans consideran que no necesita cambiar nada para llegar hasta lo más alto.</p>","cs_CZ":"<p>Seongung „Bengi“ Bae je trojnásobný mistr světa v League of Legends a hvězdný džungler týmu SK Telecom T1. Jeho tichá nátura skvěle ladí s jeho herním stylem. Bengi je nedílnou součástí Fakerova vlaku hrůzy a místo aby se snažil získat náskok sám pro sebe, upíná veškeré své úsilí ke krmení sólových lajn SKT. Celá řada korejských trenérů se domnívá, že to byl právě Bengi, kdo sehrál klíčovou roli v oné úžasné sérii výher SKT na turnaji Champions Winter 2013–2014. Dokáže vyvíjet enormní tlak po celé mapě a nedá svým soupeřům ani na okamžik vydechnout.</p>\n\n<p>S množstvím trofejí z LCK a třetím titulem mistra světa, který získal roku 2016, by už Bengi mohl klidně odejít na odpočinek. Fanoušci si to ovšem nepřejí a dali v hlasování k turnaji All-Star 2016 přednost tomuto prohnanému veteránovi před Peanutem, jenž je představitelem mladé krve v LCK. Bengi je sice už starý pes, ale jeho příznivci se domnívají, že k úspěchu žádné nové kousky nepotřebuje.</p>","el_GR":"<p>Ο Seongung \"Bengi\" Bae είναι Παγκόσμιος Πρωταθλητής του League of Legends και διάσημος παίκτης ζούγκλας για τους SK Telecom T1. Ο συγκρατημένος χαρακτήρας του ταιριάζει τέλεια με το στυλ παιχνιδιού του. Ο Bengi είναι ένας από τους πιο σημαντικούς βοηθούς του οδοστρωτήρα που λέγεται Faker, καθώς εστιάζει τις προσπάθειές του στις σόλο λωρίδες των SKT και όχι στο δικό του προβάδισμα. Πολλοί Κορεάτες προπονητές θεωρούν ότι ο Bengi ήταν ο βασικός παράγοντας που επέτρεψε στους SKT να ισοπεδώσουν τα πάντα στο πέρασμά τους στο Champions Winter 2013-2014. Έχει τη δυνατότητα να ασκεί τεράστια πίεση σε όλα τα μήκη και τα πλάτη του χάρτη και δεν αφήνει ποτέ τους αντιπάλους του να ησυχάσουν.</p>\n\n<p>Ο Bengi έχει τερματίσει πρώτος πολλές φορές στο LCK και το 2016 κατέκτησε το τρίτο του Παγκόσμιο Πρωτάθλημα. Θα έλεγε κανείς, λοιπόν, ότι έχει πετύχει τα πάντα. Όμως οι φίλοι του παιχνιδιού αποφάσισαν ότι αυτό δεν είναι αρκετό και έτσι τον ψήφισαν για να πάει στο Τουρνουά All-Star 2016, αντί για τον Peanut, τον νεοφώτιστο του LCK. Μπορεί να μην έχει τη φρεσκάδα ενός νέου παίκτη, αλλά ο κόσμος προφανώς πιστεύει ότι δεν τη χρειάζεται.</p>","hu_HU":"Seongung „Bengi” Bae League of Legends-világbajnok és az SK Telecom T1 dzsungelharcos sztárja. Csendes viselkedése jól illik a játékstílusához. Faker terrorvonatán bizony Bengi a masiniszta, és előszeretettel segíti az SKT egyéni ösvényeit a saját hősének erősítése helyett. Több koreai edző szerint is Bengi volt a kulcsa az SKT elképesztő szereplésének a Champions 2013-2014-es téli szakaszában. Az egész térképet nyomás alatt tartja, így az ellenfelek sosem lehetnek nyugodtak.</p>\n\nMiután többször is bajnok lett az LCK-ben, és háromszoros világbajnok lett 2016-ban, Bengi már igazán nem hajkurássza a címeket. A rajongók viszont szeretnék újra látni őt, a 2016-os All-Star gálára az LCK-s újonc Peanut helyett őt szavazták be. Lehet, hogy nem a legújabb modell, de a nézők imádják.\n","it_IT":"Seongung \"Bengi\" Bae è la stella della giungla degli SK Telecom T1, gli attuali campioni del mondo di League of Legends. Il suo atteggiamento tranquillo si abbina perfettamente al suo stile di gioco. Bengi è una componente fondamentale della squadra letale di Faker e preferisce concentrare i suoi sforzi nel dare uccisioni alle corsie singole piuttosto che prenderle per sé. Molti allenatori coreani sostengono che sia Bengi il fattore chiave alla base dell'incredibile cavalcata degli SKT durante il Champions Winter 2013-2014. È in grado di esercitare un'immensa pressione su tutta la mappa, tenendo sempre gli avversari sulla spine.</p>\n\nOra che si è piazzato più volte al primo posto nella LCK e ha vinto il suo terzo titolo mondiale nel 2016, Bengi sembra aver conquistato tutto il conquistabile. I fan però hanno deciso che per lui non era ancora arrivato il momento dei saluti e hanno votato in massa per la sua partecipazione all'All-Star 2016 a scapito della giovane promessa della LCK, Peanut. A quanto pare questo veterano è ancora in grado di far sognare in grande i suoi fan.\n","ro_RO":"Seongung \"Bengi\" Bae este un Campion Mondial de League of Legends și junglerul excepțional din SK Telecom T1. Atitudinea sa liniștită se potrivește perfect stilului său de joc. Bengi este un element important al aurei de teroare a lui Faker, concentrându-se să le asigure asasinate culoarelor solo din SKT, în loc s-o ia chiar el înainte. Mulți antrenori coreeni sunt de părere că Bengi este factorul cheie din spatele performanțelor incredibile ale SKT de la Champions Winter 2013-2014. Exercită o presiune enormă pe hartă, ținându-și mereu adversarii în alertă.</p>\n\nDupă ce a obținut de mai multe ori primul loc în LCK și a câștigat al treilea titlu de Campion Mondial în 2016, Bengi a obținut cam tot ce se poate obține. Fanii au decis însă că merită și mai mult și l-au votat pe veteranul viclean la All-Star Event 2016 în detrimentul tânărului star din LCK, Peanut. Poate că e de multă vreme pe scena profesionistă, dar fanii cred că succesul se bazează pe experiență.\n","es_MX":"<p>Seongung \"Bengi\" Bae es campeón mundial de League of Legends y el junglero estrella de SK Telecom T1. Su actitud tranquila encaja perfectamente con su estilo de juego. Bengi es un componente clave para el tren del terror de Faker, ya que concentra sus esfuerzos en hacer avanzar los carriles individuales en lugar de destacar él mismo. Muchos de los entrenadores coreanos consideran que Bengi fue el factor clave detrás de la increíble actuación de SKT en el Champions Winter de 2013-2014. Ejerce una cantidad enorme de presión por todo el mapa, lo que obliga a sus oponentes a permanecer alerta.</p>\n\n<p>Tras conseguir el primer lugar en múltiples ocasiones en la LCK y ganar su tercer Campeonato Mundial 2016, Bengi ya no necesita demostrar mucho más. Sin embargo, los fans han decidido que no es así y han votado para que el astuto veterano asista al All-Star Event 2016 en detrimento del joven Peanut de la LCK. Quizá sea un veterano, pero sus fans consideran que no necesita cambiar nada para llegar hasta lo más alto.</p>"},"foreignIds":{"drupalId":"693","TRLH1":"1001380057","TRLH2":"1001280027","TRLH3":"1001360052","TRLH4":"1001310052","TRKR1":"225040","TRLT3":"35089"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":131,"slug":"corn","name":"Corn","firstName":"Wen","lastName":"Lei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/corn-a770ewam.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:58.000Z","updatedAt":"2017-06-06T23:59:26.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"3171","TRLH1":"1000185034","TRLH3":"1000205037"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":139,"slug":"vasilii","name":"Vasilii","firstName":"Wei-jun","lastName":"Li","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/vasilii-33axmst.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-07T00:04:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1304","TRLH1":"1000045032","TRLH2":"2000045027"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":402,"slug":"easyhoon","name":"Easyhoon","firstName":"Ji-hoon","lastName":"Lee","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/easyhoon-du1h26yq.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2016-02-02T00:58:59.000Z","bios":{"en_US":"<p>Ji-hoon “EasyHoon” Lee has bumped heads in the mid lane with some of the best players in the world, including Faker, Ambition, Ryu, and more.He currently plies his trade for SKT T1, operating as a dynamic mid lane substitute in tandem with Faker. EasyHoon’s control-mage focused style compliments Faker’s assassin play perfectly, allowing SKT to prepare a diverse set of strategies. Easyhoon is also Faker’s go-to practice partner for testing new champions. Lest we forget, only the apprentice has a chance to defeat the master. </p>","fr_FR":"<p>Ji-hoon « EasyHoon » Lee a fait jeu égal sur la voie du milieu avec quelques-uns des meilleurs joueurs du monde, y compris Faker, Ambition, Ryu et d'autres encore. Il partage aujourd'hui la destinée de SKT T1, opérant avec énergie comme substitut sur la voie du milieu, en tandem avec Faker. EasyHoon, avec son style fondé sur les mages de contrôle, complète parfaitement les assassins de Faker, ce qui offre à SKT un vaste éventail de stratégies. Easyhoon est également le partenaire d'entraînement de Faker lorsqu'il teste de nouveaux champions. La tradition veut que seul l'apprenti puisse battre le maître. </p>","pl_PL":"<p>Ji-hoon „EasyHoon” Lee ścierał się na środku z jednymi z najlepszych graczy na świecie, takimi jak Faker, Ambition, Ryu i wielu innych. Aktualnie swoje zadanie wypełnia dla SKT T1, działając jako zastępczy środkowy do spółki z Fakerem. Styl EasyHoona, który gra magami skupiającymi się na kontroli, doskonale uzupełnia się z zabójczym stylem Fakera, co pozwala SKT na przygotowanie zróżnicowanych strategii. Easyhoon jest także partnerem Fakera podczas testowania nowych bohaterów. Nie zapominajmy, że tylko uczeń może przerosnąć mistrza. </p>","de_DE":"<p>Ji-hoon “EasyHoon” Lee ist wahrscheinlich der beste Spieler Korea, der auf der Bank sitzt. Er sitzt zwar auch im Schatten Fakers, doch ist er immer noch einer der besten Mid-Laner der Welt, wenn es um Kontrollmagier geht. In der vierten Saison hat er unter dem SKT T1 S-Banner in fast jedem Spiel Ziggs-Banns auf sich gezogen und somit seine Freunde um sich herum entlastet. Heute besteht sein Championpool weiterhin aus ähnlichen Facetten wie Cassiopeia und Azir, mit welchem er ohne Frage mit Faker mithalten kann.</p>","es_ES":"<p>Ji-hoon “Easyhoon” Lee se ha medido en la calle central a algunos de los mejores jugadores del mundo, Faker, Ambition, Ryu, y muchos más. Hoy día ha puesto su ratón al servicio de SKT T1, como mid suplente formando un tándem con el titular, Faker. La preferencia de Easyhoon por magos que pueden controlar al enemigo se complementa muy bien con el estilo de Faker, al que le gustan más los asesinos, permitiendo así a SKT T1 tener más variedad en las estrategias. Easyhoon además es el compañero de prácticas de Faker a la hora de probar nuevos campeones. Y no nos olvidemos, solamente el aprendiz puede superar al maestro. </p>","pt_BR":"<p>EasyHoon já enfrentou alguns dos melhores jogadores do mundo na rota do meio, como Faker, Ambition, Ryu e outros. Atualmente, ele se reveza com Faker na rota do meio, como um reserva de luxo que pode entrar a qualquer momento. Seu estilo voltado para magos complementa muito bem o estilo de Assassinos de Faker, permitindo que a SKT diversifique suas estratégias. Ele também é o parceiro de treinos oficial de Faker para testar novos Campeões. Não se esqueça: apenas o aprendiz tem a chance de derrotar o mestre.</p>"},"foreignIds":{"drupalId":"880","TRLH1":"1001100020","TRLH2":"1001080020","TRLH3":"1001160015","TRLH4":"1001160015"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":550,"slug":"loong","name":"Loong","firstName":"Xiao-long","lastName":"Zhu","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/loong-gcrqxsjf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2016-02-02T01:00:56.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4515"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":573,"slug":"swift","name":"Swift","firstName":"Da-hun","lastName":"Baek","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/swift-8ph5i88w.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:02:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nDa-hoon « Swift » Baek est l'un des jeunes talents les plus dynamiques de la LPL. Depuis qu'il a rejoint QiaoGu, Swift a démontré qu'il était effectivement plus vif que ses adversaires. Swift est un véritable maître quand il s'agit de deviner les coups de l'adversaire, et parfois on a même l'impression qu'il a deux coups d'avance sur eux.\n</p>\n<p>\nPour ses débuts lors du Segment d'été des LPL 2015, Swift a démontré qu'il pouvait non seulement profiter pleinement d'un avantage pour ses coéquipiers, mais aussi qu'il pouvait farmer et déjouer la plupart des autres junglers. Son parcours dans la jungle est toujours un peu plus efficace et il arrive toujours le premier sur les ganks. Son farming est également toujours quelques PO en avance, ce qui lui permet d'acheter les gros objets en premier. Son armure est aussi un peu plus brillante et lui permet d'absorber un peu plus des rayons gamma du soleil, et donc de balancer son super uppercut de l'aigle majestueux qui projette ses ennemis dans la stratosphère. \n</p>","pl_PL":"<p>\nDa-hoon „Swift” Baek jest jednym z najprężniej rozwijających się młodych talentów w LPL. Dołączywszy do Qiao Gu, Swift udowodnił, że – jak wskazuje jego ksywka – jest zdecydowanie szybszy od konkurentów (niezbyt wysoko ustawiona poprzeczka). Swift jest absolutnym mistrzem, jeśli chodzi o przewidywanie posunięć swoich przeciwników. Chwilami można by odnieść wrażenie, że wyprzedza ich o dwa kroki.\n</p>\n<p>\nDebiutując w letnim splicie 2015 LPL, Swift udowodnił, że nie tylko potrafi wykorzystać przewagę swojej drużyny, ale też zdobyć więcej złota i pokonać większość dżunglerów. W dżungli radzi sobie lepiej niż pozostali, w związku z tym zazwyczaj jako pierwszy zastawia zasadzki. Zawsze ma na koncie o kilka zabitych stworów więcej, dzięki czemu ma okazję kupować potężne przedmioty jako pierwszy. Jego pancerz jest nieco jaśniejszy od innych, dzięki czemu pochłania więcej promieniowania gamma, co sprawia, iż staje się supersilny i jest w stanie wybijać przeciwników na orbitę za pomocą potężnego ciosu wzlatującego orła. \n</p>"},"foreignIds":{"drupalId":"1014"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":577,"slug":"tct","name":"Mor","firstName":"Hong-Wei","lastName":"Zhang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/tct-9wpmbdee.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:51:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nLes fans des LCS NA reconnaîtront peut-être en Zhang « TcT » Hong Wei l'ancien support des LMQ, dont le pseudo était Mor. Lors de sa première année en ligue nord-américaine, il est passé avec le reste des LMQ des séries Challenger NA aux LCS NA, pour aller jusqu'au Championnat du monde de la Saison 4. À l'époque, on avait remarqué TcT pour son style de jeu désintéressé, toujours prêt à se sacrifier pour permettre à un de ses coéquipiers de survivre.\n</p>\n<p>\nMais quand LMQ a échoué à franchir les phases de groupe pour le Championnat du monde, TcT a décidé de retourner en Chine et de recommencer à jouer avec son ancien partenaire de duo, TcT, chez QiaoGu. Leur combo sur la voie du bas s'est épanouie, notamment grâce à leurs intenses sessions d'entraînement. Il n'est pas rare qu'ils se lèvent à 5 heures du matin pour jouer ensemble en file duo. Avec l'aide de TnT, TcT a perdu cette mentalité de chair à canon qu'il avait développée dans les ligues NA. Il choisit maintenant des champions qui offrent de vraies options de désengagement, comme Janna, qui lui permettent de protéger ses coéquipiers sans devoir mourir en boucle. Oh, et de parvenir au passage à un joli KDA.\n</p>","pl_PL":"<p>\nFani PA LCS znają zapewne Zhanga „TcT” Hong Weia, byłego zawodnika wsparcia LMQ, wówczas posługującego się ksywką Mor. W trakcie pierwszego roku rozgrywek północnoamerykańskich razem z resztą LMQ zdołał awansować z serii pretendentów do PA LCS, a potem do Mistrzostw Świata Sezonu Czwartego. TcT znany był wówczas z ofiarnego stylu gry – zawsze gotów był poświęcić swoje życie, by ratować kolegów z drużyny.\n</p>\n<p>\nGdy LMQ nie zdołało przejść przez grupowy etap mistrzostw świata, TcT postanowił wrócić do Chin i ponownie dołączyć do swojego dawnego partnera z drużyny Qiao Gu. Wspólnymi siłami zaczęli dominować w dolnej alei, co było zasługą przede wszystkim regularnych treningów. Zdarzało im się wstawać o piątej rano, by rozegrać mecz w duecie. Z pomocą TnT, TcT oduczył się odgrywania roli kozła ofiarnego, której nauczył się Ameryce Północnej. Obecnie wybiera bohaterów skutecznie wycofujących się z walki, takich jak Janna, co pozwala mu chronić kolegów z drużyny, unikając jednocześnie śmierci. Aha, jego stosunek zabić do zgonów znacznie na tym zyskał.\n</p>"},"foreignIds":{"drupalId":"4524"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":582,"slug":"v","name":"V","firstName":"Bo","lastName":"Bao","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/v-d6ylt7bf.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:01:54.000Z","bios":{"en_US":"","fr_FR":"<p>\nBao « V » Bo est un top discret mais particulièrement doué. Le top de QiaoGu a commencé le Segment d'été des LPL 2015 avec des champions de type carry, comme Irelia, mais il a depuis fait machine arrière. Il joue maintenant ce dont son équipe a besoin. Si les tanks sont dans la meta, il va jouer tank. Si les mages sont dans la meta, il va jouer mage. Ses choix ont fini par se rapprocher de sa tendance discrète à rentrer dans le rang.\n</p>\n<p>\nPour ce qui est de la cohésion de son équipe, QiaoGu a fait le choix, heu... classieux de leur faire tous se teindre les cheveux en même temps. V a suivi sa nature profonde et a choisi de se teindre les cheveux dans une teinte châtain, alors que ses coéquipiers ont choisi des violets vifs et des verts flashy. Il est sans doute le moins bruyant de son équipe, mais ça ne l'empêche pas de dominer sur sa voie. Même si lui, il n'a pas l'élément « GOD » dans son pseudo.\n</p>","pl_PL":"<p>\nBao „V” Bo jest cichym, ale utalentowanym zawodnikiem górnej alei. Zaczynał podczas letniego splitu 2015 LPL, korzystając z bohaterów prowadzących, takich jak Irelia, od tamtej pory zarzucił jednak podejście, jakiego nabrał w czasach kolejki solowej. Teraz gra tak, jak chce jego drużyna. Jeśli potrzebni są obrońcy, będzie grać obrońcami, jeśli magowie – wybierze magów. Swoje wybory zaczął dostosowywać do oczekiwań drużyny, co z uwagi na jego charakter nie było dla niego problemem.\n</p>\n<p>\nW kwestii budowania poczucia więzi w drużynie Qiao Gu zdecydowali się postawić na, ekhm, styl i solidarnie ufarbować włosy. V postąpił zgodnie ze swoją naturą, wybierając zachowawczy odcień brązu, gdy koledzy z zespołu zdecydowali się na krzykliwą purpurę i neonową zieleń. Choć w drużynie nieczęsto zabiera głos, nie przeszkadza mu to być jednym z najbardziej dominujących zawodników w alejach. Kto by pomyślał?\n</p>"},"foreignIds":{"drupalId":"4526"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":638,"slug":"hetong","name":"HeTong","firstName":"Wang","lastName":"Bin","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/hetong-2kxssfsn.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2015-10-26T18:35:53.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3780"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":649,"slug":"endless","name":"Endless","firstName":"Xu","lastName":"Hao","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/endless-7zp3yn9q.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2016-02-02T01:01:34.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4518"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":653,"slug":"peng","name":"Peng","firstName":"Yi-bo","lastName":"Peng","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/peng-8q44wtkl.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2015-10-26T18:32:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4519"},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":707,"slug":"skye","name":"Skye","firstName":"Qi-Fang","lastName":"Fan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/skye-8gfzbr83.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-06T23:57:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3771"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1034,"slug":"duan","name":"Caveman","firstName":"Duan","lastName":"Deliang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/duan-d0j88gim.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:28.000Z","updatedAt":"2016-05-19T00:02:48.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1283,"slug":"happyy","name":"Happy","firstName":"Rui","lastName":"Yu","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:34:16.000Z","updatedAt":"2017-01-09T23:01:46.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1297,"slug":"xuanxuanpi","name":"XuanXuanPI","firstName":"Pi","lastName":"Xiaoxuan","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-05-19T00:03:16.000Z","updatedAt":"2016-05-19T00:03:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1648,"slug":"lwx","name":"Lwx","firstName":"Weixiang","lastName":"Lin","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:53:31.000Z","updatedAt":"2017-01-09T22:53:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1651,"slug":"pinus","name":"Pinus","firstName":"Qingsong","lastName":"Liu","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:02:32.000Z","updatedAt":"2017-01-09T23:02:32.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1662,"slug":"ocean","name":"Ocean","firstName":"Haiqin","lastName":"Tang","roleSlug":"jungle","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:31:17.000Z","updatedAt":"2017-01-09T23:31:17.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1663,"slug":"onion","name":"OniOn","firstName":"Songxi","lastName":"Liang","roleSlug":"toplane","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:33:27.000Z","updatedAt":"2017-01-09T23:33:27.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":78},{"id":1986,"slug":"hanxuan","name":"HanXuan","firstName":"Hao","lastName":"Hong","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:53:06.000Z","updatedAt":"2017-06-06T23:53:06.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77}],"scheduleItems":[{"id":"AVmFU8o8QMQFcjhwbQrm","content":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:match:de60e6bb-8649-4797-9e13-c55eba9a456d","scheduledTime":"2017-01-22T08:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696","blockLabel":"1","subBlockLabel":"4","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:bracket:648cda91-d24b-44a6-89ab-a909067e32d2"},"match":"de60e6bb-8649-4797-9e13-c55eba9a456d","tournament":"5ca2f3d5-3682-4635-bac2-87f5a7f41696","bracket":"648cda91-d24b-44a6-89ab-a909067e32d2","league":"7"}],"gameIdMappings":[],"videos":[{"id":5135,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:09750162-79cb-495c-817f-ab93a96b9eb0","source":"https://www.youtube.com/embed/33XJosVHUpg?wmode=transparent&start=12096","createdAt":"2017-01-22T22:47:26.000Z","updatedAt":"2017-01-22T22:47:26.000Z","game":"09750162-79cb-495c-817f-ab93a96b9eb0"},{"id":5136,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:a1585b96-2413-40fa-8111-1d4a6e0a8622","source":"https://www.youtube.com/embed/33XJosVHUpg?wmode=transparent&start=15696","createdAt":"2017-01-22T22:50:44.000Z","updatedAt":"2017-01-22T22:50:44.000Z","game":"a1585b96-2413-40fa-8111-1d4a6e0a8622"},{"id":5137,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:5ca2f3d5-3682-4635-bac2-87f5a7f41696:game:8107e916-e765-4bec-a3ae-007716e335d7","source":"https://www.youtube.com/embed/33XJosVHUpg?wmode=transparent&start=22280","createdAt":"2017-01-22T22:52:17.000Z","updatedAt":"2017-01-22T22:52:17.000Z","game":"8107e916-e765-4bec-a3ae-007716e335d7"}],"htmlBlocks":[],"match":{"id":"de60e6bb-8649-4797-9e13-c55eba9a456d","name":"VG-vs-NB","position":7,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"},{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],"games":{"8107e916-e765-4bec-a3ae-007716e335d7":{"id":"8107e916-e765-4bec-a3ae-007716e335d7","name":"G3","generatedName":"NB|VG|G3|de60e6bb864947979e13c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"},{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],"standings":{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485125455830,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485113483280,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"a1585b96-2413-40fa-8111-1d4a6e0a8622":{"id":"a1585b96-2413-40fa-8111-1d4a6e0a8622","name":"G2","generatedName":"NB|VG|G2|de60e6bb864947979e13c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"},{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],"standings":{"result":[[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1485125343008,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}]],"timestamp":1485113529457,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"09750162-79cb-495c-817f-ab93a96b9eb0":{"id":"09750162-79cb-495c-817f-ab93a96b9eb0","name":"G1","generatedName":"NB|VG|G1|de60e6bb864947979e13c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"},{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}],"standings":{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485125344880,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485113530344,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485125455830,"source":"bestOf","history":[{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485125343008,"source":"bestOf","closed":true},{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485125344880,"source":"bestOf","closed":true},{"result":[[{"roster":"02f0a8c7-0e55-4d87-a88f-d3cca64f8786"}],[{"roster":"6e6a4224-4641-4131-a733-5ea1cad4a329"}]],"timestamp":1485113483280,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"02f0a8c7-0e55-4d87-a88f-d3cca64f8786":1,"6e6a4224-4641-4131-a733-5ea1cad4a329":0}}}