{"teams":[{"id":215,"slug":"team-envy","name":"Team Envy","guid":"be713b5f-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-1tyrikdl.png","acronym":"NV","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-envy-i4es8cq5.png","createdAt":"2016-05-18T22:11:40.000Z","updatedAt":"2017-07-19T23:33:05.000Z","bios":{"en_US":"<p>Team Envy burst into the NA LCS in 2016 after acquiring the slot of Renegades. Their team fared well, gaining a playoff berth in their first split as an organization. The honeymoon period quickly ended though, and the team switched up their roster ahead of the 2017 Spring Split, adding veterans Lira and Apollo into the mix. After narrowly avoiding relegation, Envy will build around their breakout jungler Lira as they head into the summer split.</p>\n<p>Coach: Dong Hwan \"Violet\" Kim</p>","de_DE":"Team Envy stürmte 2016 in die NA LCS, nachdem sie den Platz der Renegades ergattert hatten. Die Mannschaft präsentierte sich gut und schaffte es gleich in ihrem ersten Split, in die Entscheidungsspiele einzuziehen. Kurz darauf endete die Hochphase jedoch und die Mannschaft ergänzte ihre Aufstellung für den Frühjahrs-Split 2017 um die Veteranen Lira und Apollo. Die beiden stoßen gerade noch rechtzeitig zum Rest der Mannschaft, um vor dem Beginn des Frühjahrs-Splits, in dem sie wieder die Entscheidungsspiele erreichen wollen, trainieren zu können."},"foreignIds":{},"players":[149,160,247,347,545,680,1449],"starters":[160,247,545,680,1449],"subs":[149,347]},{"id":270,"slug":"eunited","name":"eUnited","guid":"be724d58-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/eunited-bqjs59ch.png","acronym":"EUN","homeLeague":"urn:rg:lolesports:global:league:league:4","altLogoUrl":null,"createdAt":"2017-01-06T22:12:06.000Z","updatedAt":"2017-06-07T17:30:34.000Z","bios":{"en_US":"<p>Coach: Tadayoshi \"Hermit\" Littleton</p>"},"foreignIds":{},"players":[68,563,759,1375,1383,1384,1385,1995],"starters":[68,759,1375,1383,1385],"subs":[563,1384,1995]}],"players":[{"id":68,"slug":"dandy","name":"DanDy","firstName":"Ingyu","lastName":"Choi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dandy-hf99jhl8.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2014-07-28T19:09:28.000Z","updatedAt":"2017-07-28T01:24:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"679","TRLH3":"1000205078","TRLH1":"200000712","ESPORTSTMNT02":"200002217"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":149,"slug":"nien8","name":"Nientonsoh","firstName":"Zach","lastName":"Malhas","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/nien8-cf8vutwb.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:03.000Z","updatedAt":"2017-01-19T22:31:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"176","TRLH1":"200000231","TRLH2":"200000135"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":160,"slug":"seraph","name":"Seraph","firstName":"Woo-Yeong","lastName":"Shin","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/seraph-eyclmz72.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-24T23:26:39.000Z","bios":{"en_US":"<p>Wu-Yeong \"Seraph\" Shin has already made his mark on League. He’s a veteran of the game, from his beginnings as a humble sub in Korea to recently serving as a pillar of the Renegades. He even had a layover with CLG. Now that he’s finally found his confidence in North America, he is one of the strongest points of Team Envy. Seraph and company had a successful campaign in the 2016 NA LCS Summer Split where they made the playoffs in their first split together. After narrowly avoiding relegation following the 2017 NA LCS Spring Split, Seraph will need to work closely with his jungler Lira to build advantages in the top lane and carry Envy to c victory.</p>","de_DE":"Shin „Seraph“ Wu-Yeong hat League bereits seinen Stempel aufgedrückt. Er ist ein Veteran des Spiels, der sich von einem koreanischen Ersatzspieler zu einer wichtigen Stütze für die Renegades entwickelte. Er spielte sogar kurze Zeit für CLG. Jetzt, wo er sich endlich in Nordamerika zu Hause fühlt, ist er einer der stärksten Spieler von Team Envy. Seraph und seine Kameraden schafften es, in ihrem ersten Split in die Entscheidungsspiele des Sommer-Splits der NA LCS 2016 einzuziehen. Seine Karriere erlebt einen Aufschwung, und Seraph ist bereit, hart zu arbeiten, um sich weiter zu verbessern."},"foreignIds":{"drupalId":"2583","TRLH2":"200000128","TRLH1":"200000224"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":247,"slug":"apollo","name":"Apollo","firstName":"Apollo","lastName":"Price","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/apollo-f14y0upb.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:11.000Z","updatedAt":"2017-01-30T02:19:20.000Z","bios":{"en_US":"<p>Previously known as Wizfujiin, Apollo \"Apollo\" Price joined Team Impulse as their AD Carry in 2014 before moving to Team Dignitas in 2015. He then made another move to Apex in 2016 before landing on Team Envy for the 2017 Spring Split.</p>\n\n<p>Even though some pundits view him as a downgrade from LOD, Apollo is a more than capable replacement. His rock solid mechanics allow him to play champions like Ezreal at the highest level with no problem. Apollo will attempt to put the ghosts of his past behind him and simultaneously silence critics as he takes over at AD Carry for Team Envy in 2017.</p>","fr_FR":"<p>Carry AD américain, Apollo « Apollo » Price portera pour la première fois en saison 6 des LCS NA les couleurs de Dignitas.</p>\n\n<p>Il n'arrive néanmoins pas en terrain inconnu puisqu'il y retrouvera Danny « Shiphtur » Le aux côtés duquel il a joué pendant le segment de printemps de la saison 4 des LCS NA. Les deux comparses étaient alors sous la bannière de Team Coast et le carry AD arborait fièrement le pseudonyme de WizFujiiN. Un nom qui n'a pas eu l'heur de lui porter chance puisque l'équipe s'est retrouvée confrontée à l'épreuve des relégations avant d'être éliminée des LCS, avec 3 défaites pour 2 victoires face à compLexity.Black.</p>\n\n<p>Considéré alors par le grand public comme indigne du niveau LCS, Apollo a pourtant retrouvé une place au plus haut niveau après un bref passage par la scène challenger. Il a en effet été recruté le 31 décembre 2014 par Team Impulse, auparavant connue comme LMQ, qui achevait là un profond remaniement de son roster. Nouvellement renommé lui aussi (Apollo a lancé la mode de jouer avec son véritable prénom en guise de pseudonyme) il n'a pas immédiatement suscité l'enthousiasme des foules, loin s'en faut. Avant le début des LCS saison 5, il est surtout apparu aux yeux de l'opinion publique comme le maillon faible de son équipe, celui que son top laner Jung « Impact » Eon-yeong, ancien champion du monde, et son jungler Lee « Rush » Yoon-jae, star de la file solo coréenne à la réputation flatteuse, allaient devoir porter à bout de bras pour espérer une victoire. Mais l'Américain a rapidement prouvé que s'il n'est pas de ceux qui mènent seuls leur équipe au sommet, il n'est pas pour autant un poids mort.</p>\n\n<p>Joueur solide à défaut d'être brillant, Apollo a gagné ses lettres de noblesse pendant la saison 5. En saison 6, au sein d'une équipe qui est sur le papier plus faible que sa précédente, il va désormais devoir se montrer à la hauteur du titre de carry AD.</p>","pl_PL":"<p>W wywiadzie dla LoL Esports Apollo w krótkim zdaniu określił siebie samego i drużynę TiP: „Zawsze chcemy walczyć”. Rozwój tego uzdolnionego AD Carry doskonale widać patrząc na drużyny, w których występował od stycznie 2013 roku. Rozpoczynał w nieznanej drużynie Team Summon, lecz wkrótce znalazł się w Team Coast. Tam nabył trochę doświadczenia i świat League of Legends usłyszał o nim. Wraz z nimi pierwszy raz miał okazję zawalczyć w NA LCS przeciwko weteranom sceny esportowej. Niestety jego epizod z Team Coast był krótki, trwał zaledwie parę miesięcy, ponieważ w pod koniec letniego sezonu zostali relegowani z powrotem do Challenger Series. Do grudnia 2014 roku próbował szczęścia w różnych zespołach, aż do przyjęcia do Team Impulse. </p>\n<p>\nPo dołączeniu do ich organizacji Team Dignitas przeprowadził wywiad z Apollem Pricem o jego odczuciach w związku ze zmianą drużyny. \"Apollo\" najpierw przedstawił wybór, przed którym został postawiony – pieniądze albo drużyna, która da mu szansę na wejście do Mistrzostw Świata 2016. Zrezygnował z finansów i dołączył do Team Dignitas żeby zrealizować swoje marzenia. Napomknął też, że zmiany w strzelcach trochę go zaskoczyły i na początku nie wiedział nawet co kupować, lecz trening w Korei rozwiał jego wątpliwości. Apollo Price najlepiej się czuje grając Lucianem albo Varusem, ale jak na gracza tego kalibru przystało, doskonale radzi sobie wszystkimi bohaterami jako AD Carry. Na przykład w sezonie piątym najczęściej wybierał Sivir.</p>\n<p>\nApollo pochodzi z Everett w stanie Waszyngton. Pomimo tego, że urodził się w Stanach Zjednoczonych, może się pochwalić, że jest w połowie Japończykiem. Przed dołączeniem do Team Coast studiował na University of Washington. Wcześniej planował ukończenie kierunku informatycznego, ale opuścił szkołę, decydując się na życie profesjonalnego gracza. \"Apollo\" nie żałuje swojej decyzji w najmniejszym stopniu. Na święto dziękczynienia w 2015 roku na portalach społecznościowych napisał, że przede wszystkim jest wdzięczny za to, że może być profesjonalnym graczem.\n</p>","de_DE":"Apollo „Apollo“ Price, ehemals bekannt als Wizfujiin, begann seine Karriere 2014 als AD-Carry für Team Impulse, bevor er 2015 zu Team Dignitas wechselte. 2016 wechselte er dann zu Apex, bevor er schließlich bei Team Envy landete.\n</p>\nEinige Experten sind zwar der Meinung, dass er LOD nicht das Wasser reichen kann, aber Apollo ist ein mehr als nur würdiger Ersatz. Seine soliden Mechaniken ermöglichen es ihm, Champions wie Ezreal problemlos auf höchstem Niveau zu spielen. Apollo wird versuchen, die Geister seiner Vergangenheit hinter sich zu lassen und gleichzeitig seine Kritiker zum Schweigen zu bringen, wenn er die Kluft 2017 als AD-Carry für Team Envy betritt.\n\n"},"foreignIds":{"drupalId":"1157","TRLH1":"200000227","TRLH2":"200000131"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":347,"slug":"alex-ich","name":"Alex Ich","firstName":"Alexey","lastName":"Ichetovkin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alex-ich-6gaypyie.png","hometown":"Russia","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-01-30T02:18:49.000Z","bios":{"en_US":"<p>\nOne of the most skilled and famous players in Europe, Aleksei “Alex Ich” Ichetovkin recently moved to the US to participate in the NA League of Legends scene. Best known for his run with Moscow Five (later Gambit Gaming), Alex Ich is dominant on both AP casters and mid lane assassins. With over five years of competitive experience, including several years spent as a shot-caller, Alex Ich has an immense amount of game knowledge.\n</p>","fr_FR":"<p>Aleksei « Alex Ich » Ichetovkin est l'un des joueurs européens les plus connus et les plus talentueux. Il a \n\nrécemment déménagé aux États-Unis pour participer à la scène nord-américaine de League of Legends. \n\nSurtout connu pour sa contribution à Moscow Five (devenue Gambit Gaming), Alex Ich excelle avec des \n\nmages et des assassins sur la voie du milieu. Avec plus de cinq années d'expérience au niveau compétitif, \n\ny compris plusieurs années en tant que meneur, Alex Ich connaît le jeu comme sa poche.</p>\n\n<p>Le talent d'Alexy « Alex Ich » Ichetovkin a été plus apparent que jamais lors de la participation des \n\nRenegades aux Challenger Series NA 2015, où il a obtenu un KDA de 6 lors des play-offs. Maintenant \n\nqu'il est de retour aux LCS, nous avons hâte de le voir aux prises avec les meilleurs mid laners \n\nd'Amérique du Nord.</p>","pl_PL":"<p>Jedna z legend światowej sceny League of Legends. Historia Alexeya jest tak obfita, że naprawdę ciężko mu dorównać w doświadczeniu i osiągnięciach. Pochodzący z Kamenki w Rosji, \"Alex Ich\" jest częścią League of Legends od 2009 roku. Przed dołączeniem do Team Empire w październiku 2011 roku, grał w drugoplanowych zespołach. Zaistniał na profesjonalnej scenie esportowej podczas turnieju kwalifikacyjnego szóstego sezonu IEM. Wraz z drużyną pokonał SK Gaming w wyjątkowo spektakularny sposób – łącząc obszarowe umiejętności bohaterów. Następnie cała drużyna została zrekrutowana przez Moscow Five. W tej organizacji odniósł wiele imponujących osiągnięć: pierwsze miejsce na IEM Kijów w styczniu 2012 roku, drugie miejsce na zawodach Kings of Europe i bardzo ważne pierwsze miejsce na Mistrzostwach Świata IEM w Hannoverze. W ostatnim wspomnianym turnieju nie przegrali ani jednej gry. Największym osiągnięciem Alexeya Ichetovkina w M5 było dostanie się na Mistrzostwa Świata drugiego sezonu z pierwszego miejsca, a następnie zajęcie 3-4 miejsca. Jego drużyna według wielu analityków była zdecydowanym faworytem tego wydarzenia. Przegrali w pół finale z przyszłymi mistrzami 2:1. </p>\n<p>\n14 stycznia 2013 r. cała drużyna została wykupiona przez Gambit Gaming, gdzie \"Alex Ich\" kontynuował swoją karierę. W chwili, gdy dołączał do tej organizacji, był już doskonale znany w Europie jako jeden z pierwszoplanowych mid-lanerów, często też był nazywany najlepszym. Nowa marka rozszerzyła jego sławę na cały świat. Powodem tego była kolejna edycja zawodów IEM –Katowice, którą drużyna Alexeya kolejny raz wygrała. Jednak tym razem zwycięstwo było dużo bardziej satysfakcjonujące, gdyż Gambit Gaming pokonało dwie z najlepszych koreańskich drużyn – Azubu Frost i Azubu Blaze. To utwierdziło tylko fanów, że rosyjski zespół to jedyny zachodni zespół, który jest w stanie konkurować z Azjatami. Nic co piękne nie może też trwać wiecznie. Ostatecznie Alexey odszedł z Gambit Gaming w maju 2014 roku, ze względu na negatywny wpływ ciągłych podróży na jego życie rodzinne. Później nadszedł dla niego czas poszukiwań, który przyniósł mu uczestnictwo w wielu zespołach, jednak w żadnym nie zagrzał miejsca na dłużej. Dopiero 9 marca 2015 założył wraz z Albertem \"Crumbz\" Rengifem zespół Misfits, później przemianowany na LA Renegades. Wraz z nimi udało mu się zakwalifikować do wiosennego sezonu NA LCS 2016. Aczkolwiek dla niego, jak sam nieraz powtarzał, najważniejsze było to, że udało mu się ustatkować wraz z rodziną w Stanach Zjednoczonych.</p>\n<p> \t\n\"Alex Ich\" to całkowicie wyjątkowy przypadek na scenie esportowej. Jest wzorem dla milionów graczy. Poza grą w League of Legends jest kochającym ojcem i mężem, co wyróżnia go na tle innych graczy, którzy nawet nie myślą o ustatkowaniu się. Ożenił się w wieku 20 lat, co dla większości społeczeństwa jest nie do pomyślenia. Jego żona, Ekaterina „Pandorka” Ichetovkina, bardzo wspiera jego pasję. Często była gościem wywiadów związanych z profesją swojego męża, jednak głównie po rosyjsku. Alexey regularnie umieszcza zdjęcia swojego syna, Dimitra, na portalach społecznościowych, co spotyka się z wielkim aplauzem jego wielbicieli. Szczególnie wtedy kiedy \"Alex Ich\" udaje, że uczy go grać w League of Legends i nazywa go „Little Ich”. Pomimo swojego stanu cywilnego pozostał pierwszorzędnym graczem, dzieląc swój czas między grę i rodzinę, za co jest bardzo szanowany w Korei.</p>\n<p>\nAlexeya charakteryzuje różnorodność wyborów postaci. W 2011 roku był uważany za jednego z najlepszych Kassadinów na świecie. W sezonie trzecim potwierdził swoje skłonności do gry asasynami, często wybierając Zeda i Kha’zixa na mid-lane i konsekwentnie dominując nimi przeciwników. Jego zdecydowanie najsłynniejszym zagraniem to zrobienie pentakilla w grze przeciwko drużynie Evil Geniouses (EU LCS 2013 w ósmym tygodniu) grając Kha'zixem. \"Alex Ich\" dowiódł, jak bardzo śmiercionośny potrafi być, jeśli jest niepilnowany. To jednak nie koniec tego co potrafi. Niejednokrotnie pokazał, że uwielbia grać również magami, stworzonymi do farmienia, jak Ryze czy Mordekaiser. Na Dreamhacku 2012, grając Galio, pobił rekord świata zabitych stworów w 25 minucie. Alexey często też zaskakuje publikę bezsprzecznie wyjątkowymi wyborami, grając na mid-lanie, na turniejach, Masterem Yi albo Zileanem, co czyni go niesamowicie nieprzewidywalnym przeciwnikiem.</p>\n"},"foreignIds":{"drupalId":"89","TRLH1":"200000230","TRLH2":"200000134"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":545,"slug":"lira","name":"LirA","firstName":"Taeyou","lastName":"Nam","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lira-8wdoxm79.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-25T23:33:32.000Z","bios":{"en_US":"<p>Tae-yoo \"LirA\" Nam has been on his jungle game ever since 2013. A veteran of Korea’s LCK, he’s played for teams like CJ Entus, KT Rolster, and the Afreeca Freecs. LirA has impressed while on the Rift, and he’s only gotten better with age. Even though his play improved over time, he began sharing his role with SeongHwan while on the Afreeca Freecs.</p>\n\n<p>The uncertainty with his role going forward lead LirA to look for opportunities elsewhere and soon enough he was on a flight headed to Los Angeles. He joined up with Team Envy as their new starting jungler and looks like a star. Despite a disappointing record, Lira's play in the jungle earned his team leads early in many games. If he can help convert just some of those early leads to late-game ones, LirA and Team Envy can run with the best of them.</p>","de_DE":"Tae-yoo „Lira“ Nam dominiert schon seit 2013 im Dschungel. Als Veteran der koreanischen LCK hat er schon bei CJ Entus, KT Rolster und Afreeca Freecs gespielt. Lira hat in der Kluft beeindruckende Leistungen abgeliefert und er wurde mit dem Alter nur besser. Obwohl er mit der Zeit immer besser wurde, teilte er sich seinen Platz bei den Afreeca Freecs mit SeongHwan.\n</p>\nDa er sich seines Arbeitsplatzes nicht mehr sicher sein konnte, schaute er sich nach anderen Möglichkeiten um, und nur kurze Zeit später saß er in einem Flugzeug Richtung Los Angeles. Er hat sich Team Envy angeschlossen und wie es scheint, ist er eine unmittelbare Verbesserung im Dschungel. Er beherrscht jeden Champion von Lee Sin bis Kindred, es geht nur darum, was sein Team gerade braucht. Liras Reichtum an Wissen und Erfahrung wird es dem neuen Team Envy ermöglichen, im Frühjahrs-Split 2017 wieder um den Einzug in die Entscheidungsspiele zu kämpfen.\n"},"foreignIds":{"drupalId":"4332","TRLH1":"200000225","TRLH2":"200000129"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":563,"slug":"papa-chau","name":"Papa Chau","firstName":"John","lastName":"Le","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/papa-chau-9zq8r0tz.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2015-06-02T19:55:10.000Z","updatedAt":"2017-03-08T20:01:06.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3002","ESPORTSTMNT02":"200000747","TRLH1":"200000297"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":680,"slug":"hakuho","name":"Hakuho","firstName":"Nickolas","lastName":"Surgent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hakuho-8v4158c2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:13.000Z","updatedAt":"2017-06-14T20:25:04.000Z","bios":{"en_US":"<p>An avid cat lover, Bastion fan, and memester, Nickolas “Hakuho” Surgent joined Team Envy in 2016. Before that, he played on the Renegades in the NA LCS as well as a variety of Challenger teams. Hakuho loves supports with big hearts and even bigger punches. Need a shield? Stand behind Braum. What about a beefy tank killer? Trundle incoming. Team-wide disruption and dives? Pulverize ‘em with Alistar.  Hakuho punched, stunned, disabled his way into the playoffs with Team Envy in their inaugural split. They’ll be looking for a repeat and even better performances from Hakuho -- he’ll be more than happy to oblige.</p>","de_DE":"Der Katzenliebhaber, Bastion-Fan und Meister der Memes Nickolas „Hakuho“ Surgent hat sich Team Envy im Jahr 2016 angeschlossen. Vorher hat er bei den Renegades in der NA LCS und bei einer Vielzahl an Challenger-Teams gespielt. Hakuho liebt Supporter mit großem Herz und noch größerer Schlagkraft. Schild gefällig? Stell dich hinter Braum! Wie wär’s mit einem zähen Tank-Killer? Trundle im Anmarsch. Ein ganzes Team stören und unter Türmen kämpfen? Pulverisiere sie mit Alistar.  Hakuho schaffte es gleich im ersten Split, sich mit Team Envy in die Entscheidungsspiele zu kämpfen. Sie hoffen auf eine ähnliche Leistung und eine noch besser Vorstellung von Hakuho – damit wäre er bestimmt auch zufrieden."},"foreignIds":{"drupalId":"2557","TRLH1":"200000228","TRLH2":"200000132"},"socialNetworks":{},"champions":[],"liveGameTeam":215},{"id":759,"slug":"gbm","name":"GBM","firstName":"Chang-suk","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gbm-o8g887p.png","hometown":"South Korea","region":"EU LCS","birthdate":"","createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-07-28T01:24:16.000Z","bios":{"en_US":"","fr_FR":"<p>Ne lui donnez surtout pas Orianna. S'il y a une leçon que tous ceux qui affrontent GBM finissent par \n\nretenir, c'est qu'il ne faut jamais, <em>au grand jamais</em> donner à Chang-seok « GBM » Lee son \n\nchampion préféré, la Demoiselle mécanique. Certaines équipes ont commis cette erreur lors du segment \n\nd'été des LCK 2015, et elles se sont retrouvées face à un monstre avec un KDA de 22. Si GBM parvient à \n\nmaîtriser quelques autres champions aussi bien qu'Orianna, il sera à n'en pas douter un joueur des plus \n\nredoutables sur la voie du milieu.</p>\n\n<p>GBM aura peut-être une nouvelle chance d'exceller avec son champion de prédilection maintenant qu'il \n\nest passé aux LCS NA pendant l'intersaison 2015. C'est un tout autre monde, rempli de mid laners qui ne \n\nsavent pas encore ce dont GBM est capable.</p>","pl_PL":"<p>Mid-laner NRG Esports nie był bardzo popularny poza Koreą – swoją legendę w Ameryce zaczął pisać 16.11.2015, w momencie dołączenia do drużyny Gerarda Kelliego. Jego debiut w NA LCS to wiosenny sezon 2016. W swojej ojczyźnie był uważany za jednego z najlepszych graczy na środkowej alei. Lee \"GBM\" Chang-seok był członkiem dobrze znanych zespołów: CJ Entus Frost i Jin Air Green Wings, więc nie można odmówić mu doświadczenia w grze na najwyższym poziomie. Olbrzymi wpływ na jego rozwój mieli Kang \"Ambition\" Chan-yong i Jung \"RapidStar\" Min-sung. Jungler CJ Entus zainspirował „GBM” do nauki gry Orianną, do wejścia na sam szczyt w pierwszym sezonie. Motywacja była tak silna, że do dzisiaj jest powszechnie uważany za jedną z najlepszych Mechanicznych Baletnic na świecie. Z tego też powodu często jest nazywany „mistrzem Orianny”. Z kolei, emerytowany już, legendarny \"RapidStar\" był jednym z bliższych przyjaciół Lee’a Chang-seoka. Wzajemnie się uczyli, razem ćwiczyli nowe zagrania i dzielili rolę mid-lanera w CJ Entus. Takiego kolegi pozazdrościłby każdy gracz.</p>\n<p>\nWiele osób może się zastanawiać co oznacza przydomek mid-lanera NRG Esports, który na pierwszy rzut oka przypomina przypadkowy zlepek liter. Tymczasem on ma długą i zabawną historię. „GBM” to pierwsze litery oryginalnego nicka Lee’a Chang-seoka – „Ganked By Mom”. Młody Koreańczyk zdecydował się na taki pseudonim, ze względu na to, że został wielokrotnie przyłapany w środku nocy przez swoją matkę na grze w League of Legends. Pierwotnie brzmiał on „mom critical”, ale ze względu liczną publikę z zachodu został zmieniony na „zgankowany przez matkę”. Jak widać troska kochających matek koliduje z planami również wielkich graczy.</p>\n<p>\nJego zasób bohaterów poraża swoim rozmiarem. W piątym sezonie grał ponad 10 różnymi postaciami, a tylko tyloma prawdopodobnie ze względu na ich siłę w obecnej mecie. Oprócz zjawiskowej gry Orianną, wyróżnił się niezwykle skuteczną grą Viktorem i Lulu. Można śmiało powiedzieć, że „GBM” był w lidze koreańskiej jednym z poważanych i uniwersalnych mid-lanerów. Wykształcił swój talent wśród najlepszych i z takim nastawieniem przyjechał do Ameryki. Organizacja NRG, zaraz po ogłoszeniu swojego istnienia, umieściła na stronie jego słowa: „Moim celem jest zawsze być numerem jeden”. W nastawieniu Lee’a \"GBM\" Chang-seoka nie ma niedopowiedzeń.\n</p>","de_DE":"<p>Chang-suk „GBM“ Lee geht 2017 neue Wege. Er hat eine neue Mannschaft, nennt eine neue Region sein Zuhause und spielt auf einer neuen Position. Als seine ehemalige Mannschaft, NRG Esports, aus der NA LCS abstieg, begab sich der langjährige Mid-Laner auf die Reise über den großen Teich, um sich Team Vitality anzuschließen und dort um die Junglerposition zu kämpfen.\n\nEr mutet sich viel zu, denn er will in kürzester Zeit eine neue Rolle lernen und sich auf die LCS vorbereiten, aber GBM sucht im neuen Jahr die Herausforderung. Aber egal, ob er oder Djoko schlussendlich als Jungler eingesetzt wird, der Gewinner ist in jedem Fall Team Vitality.</p>"},"foreignIds":{"drupalId":"2160","TRLH3":"200000129","TRLH4":"200000227","ESPORTSTMNT02":"200002218","TRLH1":"200000714"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":1375,"slug":"deftly","name":"Deftly","firstName":"Matthew","lastName":"Chen","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/deftly-p7mrimw.png","hometown":"","region":"NA Challenger Series","birthdate":null,"createdAt":"2016-06-17T20:09:01.000Z","updatedAt":"2017-06-14T21:38:38.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000745","TRLH1":"200000295"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":1383,"slug":"licorice","name":"Licorice","firstName":"Eric","lastName":"Ritchie","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/licorice-27l992ij.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-07-13T17:21:18.000Z","updatedAt":"2017-06-14T21:35:13.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000674","TRLH1":"200000292"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":1384,"slug":"bobqinxd","name":"bobqinXD","firstName":"Boyuan","lastName":"Qin","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bobqinxd-a59n0o0l.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-07-13T17:31:57.000Z","updatedAt":"2017-06-14T21:38:30.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000748","TRLH1":"200000298"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":1385,"slug":"zeyzal","name":"Zeyzal","firstName":"Tristan","lastName":"Stidam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zeyzal-h6gnpczx.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-07-13T23:56:02.000Z","updatedAt":"2017-06-14T21:29:52.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000746","TRLH1":"200000296"},"socialNetworks":{},"champions":[],"liveGameTeam":270},{"id":1449,"slug":"nisqy","name":"Nisqy","firstName":"Yasin","lastName":"Dincer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nisqy-cm449pca.png","hometown":null,"region":"EU Challenger Series","birthdate":"1998-07-28","createdAt":"2016-10-11T13:26:08.000Z","updatedAt":"2017-07-19T20:26:54.000Z","bios":{"en_US":"","fr_FR":"<p>Nisqy a commencé sa carrière e-sport en saison 3 dans l'équipe Punchline, accompagné de Nerroh. Considéré comme un des meilleurs joueur de Zilean d'Europe, très vite, l'équipe se concentre autour de Nerroh et lui. Ils seront le coeur de plusieurs équipes dont InFamous et Melty. Nisqy nourrit de grandes ambitions et entend bien rapidement prendre sa revanche après avoir frôlé les Challenger Series récemment.</p>"},"foreignIds":{"FRA1TMNT2":"75126","ESPORTSTMNT02":"200001034","TRLH3":"200000265","TRLH4":"200000317","TRLH1":"200000600","TRLH2":"200000519"},"socialNetworks":{"twitter":"https://twitter.com/Nisqylol?lang=fr"},"champions":[],"liveGameTeam":215},{"id":1995,"slug":"potluck","name":"PotLuck","firstName":"Nicholas","lastName":"Pollock","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/potluck-86mixan2.png","hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T17:29:03.000Z","updatedAt":"2017-06-14T21:35:55.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000751"},"socialNetworks":{},"champions":[],"liveGameTeam":270}],"scheduleItems":[{"id":"AVsXrCaqoUG4HPFjOKMX","content":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:match:de80a32c-97d7-4640-a02d-84ab703805fb","scheduledTime":"2017-04-01T19:00:01.136+0000","tags":{"blockLabel":"Summer Promotion","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:bracket:64f713cc-5953-4810-bf36-927bcf33f12f","leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4"},"match":"de80a32c-97d7-4640-a02d-84ab703805fb","tournament":"ce8e57ab-9804-496d-941a-9d04558f7bb4","bracket":"64f713cc-5953-4810-bf36-927bcf33f12f","league":"2"}],"gameIdMappings":[{"id":"74afdbe6-7052-42aa-ae56-94b7e2e9169a","gameHash":"02a2c7526e44d83e"},{"id":"f1ce223a-d4f9-4b20-9769-761dbe7969bd","gameHash":"9cff601ea31e2676"},{"id":"299479ab-db4c-4a2a-8d05-db9e88f47de1","gameHash":"72277ace0c70ee2e"},{"id":"4df27922-af86-4edf-ac35-54aed5c7369e","gameHash":"b4e2c8cf2f3886e2"}],"videos":[{"id":6433,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:4df27922-af86-4edf-ac35-54aed5c7369e","source":"https://www.youtube.com/embed/fhDlvizvLQk?wmode=transparent","createdAt":"2017-04-01T22:07:09.000Z","updatedAt":"2017-04-01T22:07:09.000Z","game":"4df27922-af86-4edf-ac35-54aed5c7369e"},{"id":6434,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:f1ce223a-d4f9-4b20-9769-761dbe7969bd","source":"https://www.youtube.com/embed/O9x6HryzrwI?wmode=transparent","createdAt":"2017-04-01T22:08:50.000Z","updatedAt":"2017-04-01T22:08:50.000Z","game":"f1ce223a-d4f9-4b20-9769-761dbe7969bd"},{"id":6436,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:299479ab-db4c-4a2a-8d05-db9e88f47de1","source":"https://www.youtube.com/embed/cXDzAWEPRIA?wmode=transparent","createdAt":"2017-04-01T23:26:01.000Z","updatedAt":"2017-04-01T23:26:01.000Z","game":"299479ab-db4c-4a2a-8d05-db9e88f47de1"},{"id":6445,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ce8e57ab-9804-496d-941a-9d04558f7bb4:game:74afdbe6-7052-42aa-ae56-94b7e2e9169a","source":"https://www.youtube.com/embed/Yg8_UF2fNt8?wmode=transparent","createdAt":"2017-04-02T00:04:49.000Z","updatedAt":"2017-04-02T00:04:49.000Z","game":"74afdbe6-7052-42aa-ae56-94b7e2e9169a"}],"htmlBlocks":[],"match":{"id":"de80a32c-97d7-4640-a02d-84ab703805fb","name":"match-c","position":2,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0},{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],"games":{"74afdbe6-7052-42aa-ae56-94b7e2e9169a":{"id":"74afdbe6-7052-42aa-ae56-94b7e2e9169a","name":"G4","generatedName":"EUN|NV|G4|de80a32c97d74640a02d","input":[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1},{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491091662853,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491085295661,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120440","gameRealm":"TRLH1","platformId":"TRLH1:1002120440","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"f1ce223a-d4f9-4b20-9769-761dbe7969bd":{"id":"f1ce223a-d4f9-4b20-9769-761dbe7969bd","name":"G2","generatedName":"EUN|NV|G2|de80a32c97d74640a02d","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0},{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],"standings":{"result":[[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}]],"timestamp":1491084268032,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}]],"timestamp":1491079366478,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120438","gameRealm":"TRLH1","platformId":"TRLH1:1002120438","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4df27922-af86-4edf-ac35-54aed5c7369e":{"id":"4df27922-af86-4edf-ac35-54aed5c7369e","name":"G1","generatedName":"EUN|NV|G1|de80a32c97d74640a02d","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0},{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491084193898,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491076571842,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120428","gameRealm":"TRLH1","platformId":"TRLH1:1002120428","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"299479ab-db4c-4a2a-8d05-db9e88f47de1":{"id":"299479ab-db4c-4a2a-8d05-db9e88f47de1","name":"G3","generatedName":"EUN|NV|G3|de80a32c97d74640a02d","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0},{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491089347837,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}]],"timestamp":1491082441298,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120439","gameRealm":"TRLH1","platformId":"TRLH1:1002120439","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"7cb62178-850c-4230-b783-5d2d1431fd01":{"id":"7cb62178-850c-4230-b783-5d2d1431fd01","name":"G5","generatedName":"EUN|NV|G5|de80a32c97d74640a02d","input":[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":0},{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187","breakpoint":"ac1bdec2-2d56-455a-8594-b8f95f91b978","standing":1}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912"}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187"}]],"timestamp":1491091662854,"source":"bestOf","history":[{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912"}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187"}]],"timestamp":1491089347837,"source":"bestOf","closed":true},{"result":[[{"roster":"e62a152a-f6a7-4b9e-8f74-ef951775d912"}],[{"roster":"bb502e04-78cb-45a8-8272-f1acc71c3187"}]],"timestamp":1491085295661,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}