{"teams":[{"id":55,"slug":"fc-schalke-04","name":"FC Schalke 04","guid":"be6cad42-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/fc-schalke-04-h992ofkj.png","acronym":"S04","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":null,"createdAt":"2015-01-19T23:39:45.000Z","updatedAt":"2017-07-06T22:27:08.000Z","bios":{"en_US":"<p>\nFC Schalke 04 bought Elements’  EU LCS seed just before the beginning of the 2016 EU LCS Summer Split. The team's remained largely the same, aside from a key addition in the mid lane with Hampus “Fox” Myhre. \n</p>\n<p>\nSchalke has a long history in organized sports, dating back to the early 1900s. This marks their first foray into the world of League of Legends esports. With a group that finished 7th last split, Schalke is looking to turn around the team’s fortunes and carve a name for themselves in the esports world.\n</p>\n<p>\nCoach: Michael \"Veteran\" Archer\n</p>","pl_PL":"<p>Organizacja, która istnieje dzięki zaangażowaniu graczy udzielających się w League of Legends od jej początków. Drużyna Elements powstała z Alliance, po której odziedziczyła miejsce w wiosennym sezonie EU LCS 2015. Przymusowa przemiana była spowodowana zmianami praw dotyczących zespołów, zbiegła się również ze zmianami w składzie osobowym drużyny. W sezonie piątym cała drużyna został zbudowana w około Henrika \"Froggen\" Hansena, jednego z najpopularniejszych graczy Europy. Stworzeniu organizacji towarzyszyła ciekawa i bardzo oryginalna kampania reklamująca jej członków. W sieci pojawiła się seria zdjęć przedstawiająca buty każdego z zawodników, dzięki czemu część z nich została rozpoznana przez fanów przed oficjalnym ogłoszeniem całej ekipy. Pojawił się również ich znak firmowy – logo przedstawiające pięć żywiołów. Dzięki znanym i lubianym graczom, którzy znaleźli się w szeregach organizacji, rzesza wielbicieli kibicowała kolejnym ujawnianym informacjom o powstającej drużynie.</p>\n<p>\nPo nowo utworzonej organizacji fani spodziewali się wyników, które zagwarantują Elements podium. Niestety rzeczywistość i poważna konkurencja zweryfikowały te oczekiwania. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 żywiołowej ekipie poszło przeciętnie. Dwukrotnie znaleźli się na siódmej pozycji mało imponującym wynikiem 7:11. Zwolennicy nie byli w pełni zawiedzeni, gdyż zespół Elements nie radził sobie najgorzej na tle innych drużyn. Jednak wszyscy, analitycy i fani, spodziewali się dużo więcej po tak hucznie ogłoszonym składzie graczy. Pozytywnym aspektem ich pozycji było znalezienie się poza trzema zespołami trafiającymi do rozgrywek relegacyjnych. Niestety będąc na siódmym miejscu nie mogli wziąć udziału w meczach barażowych.</p>\n<p>\nWłaściciel organizacji Elements, Jacob Toft-Andersen, w sezonie piątym starał się żeby polepszyć wyniki swojej drużyny. Wiele zmian osobowych wynikało z jego troski, lecz prawdopodobnie w tym okresie było ich zbyt dużo. Na przykład po wiosennym sezonie został wymieniony cały skład, oprócz mid-lanera.  Zawodnicy nie zdążyli się zgrać, w efekcie czego nie poprawiła się ani pozycja ani kondycja zespołu. Ostatecznie nie był zadowolony z osiągnięć Elements, w związku z czym podjął próbę sprzedania miejsca w wiosennym sezonie EU LCS 2016. Nieszczęśliwie dla Jacoba, nie znalazł się żaden chętny. Dlatego zdecydował się podjąć wyzwanie w czołowych europejskich rozgrywkach w 2016 roku. </p>\n","de_DE":"<p>Nachdem Alliance als erstes Team seit Entstehung der LCS Fnatic vom ersten Platz stieß, kam der Namenswechsel zum heutigen Elements. Mit lediglich einem Wechsel der Schützen Position von Erik \"Tabzz\" Van Helvert auf Martin \"Rekkles\" Larsson sollte ein Team entstehen, das fortan die europäische Liga dominieren sollte. Zu den erwünschten Resultaten kam es jedoch nie. Seit der Entstehung Anfang 2015 wurden nur mittelmäßige Erfolge erzielt. </p>\n<p><h2>Änderung sind nötig</p></h2>\n<p>Schon zum Spring Split 2015 nahm das Team um den damaligen Captain Henrik \"Froggen\" Hansen erste Änderungen vor, nachdem es das Team nicht schaffte, sich vom Mittelfeld im Ranking zu lösen. Ergebnis des Splits: Ein siebter Platz und damit verbunden erste große Spielerwechsel. Es wurden abgesehen von der Mitte und dem Support alle Positionen ausgetauscht, weiterhin mit Froggen als Kernspieler. Zu diesem Zeitpunkt stieß mit Hampus \"promisQ\" Abrahamsson, erstmals ein unbeschriebenes Blatt, zum Team. </p>\n<p>Die Resultate blieben weiterhin nicht zufriedenstellend. So hatte das Team nach einem erneuten siebten Platz im Summer Split keine Chance mehr, sich bei den Playoffs für die Weltmeisterschaft zu qualifizieren. Weitere Änderungen in der Teamaufstellung waren also schon zu erwarten. </p>\n<p><h2>Eine Legende verschwindet</p></h2>\n<p>Das Team hat nun seine bisher größte Änderung erfahren. Mit dem Wechsel von vier Spielern, darunter auch Froggen, ist die neue Stärke nur sehr schwer einzuschätzen. Bisher war eines der großen Probleme, dass das Team die Spiele möglichst in die Länge ziehen musste, um einen Sieg zu erreichen. Die neue Aufstellung sollte nun eine gute Gelegenheit bieten, mit neuen Taktiken in die Kluft der Beschwörer zu ziehen. Mit Patrick \"Nyph\" Funke steht in jedem Fall ein sehr erfahrener Spieler als Coach hinter den Spielern. </p>\n<p>Die sechste Saison wird in jedem Fall eine große Herausforderung werden. Elements wird als einer der Underdogs ins Rennen gehen und sich seinen Platz hart erkämpfen müssen. Die Priorität sollte darauf liegen, sich erst einmal aufeinander einzuspielen und mit gutem Teamwork zu überzeugen. Erst nachdem die Spieler gewisse Konsistenz unter Beweis gestellt haben, würde sich eine weitere Spezialisierung auf die Konkurrenz lohnen. </p>\n<p> Im Sommer wurde das Team nun von dem Bundesliga-Club Schalke 04 übernommen und dadurch größte Aufmerksamkeit erreicht. Wie sich das neue Team schlagen wird, muss man in den nächsten Wochen beobachten.</p>\n<p>Zu hoch gesteckte Ziele haben in der Vergangenheit eher einen gegenteiligen Effekt zum gewünschten Erfolg gebracht. Stattdessen haben die Spieler nun die Chance, bei niedrigen Erwartungen die Zuschauer zu überraschen. </p>\n","es_ES":"<p>Elements es uno de los equipos con más historia dentro de la LCS EU, historia que se remonta hasta CLG.EU en el año 2012. Como Alliance en 2014 consiguieron la victoria en los playoffs de verano de la LCS EU 2014, lo que los coronó como el mejor equipo de Europa por aquel entonces, y un equipo a tener en cuenta en el Campeonato Mundial de ese mismo año. Pero todo se vino abajo cuando fueron eliminados en la fase de grupos al perder con el equipo brasileño KaBuM! e-Sports, algo que todavía queda en la memoria de los aficionados.</p>\n\n<p>2015 no empezó mejor para el equipo europeo que después de ganar la LCS no pudo pasar del séptimo puesto en el Split de primavera de 2015, algo decepcionante que hizo retumbar los cimientos de la organización. El Split de verano iba a ser otro nuevo comienzo para Elements, pero no pudieron más que repetir la séptima posición. Para esta nueva temporada todo ha cambiado, en la LCS 2016 Elements busca una nueva dirección. ¿Conseguirán reconducir la dinámica negativa de la última temporada?</p>","fr_FR":"<p>Le FC Schalke 04 a une histoire très riche. Ce club sportif allemand a fêté son centenaire en 2004 et est le deuxième plus grand club d’Allemagne. Rien que ça. Plus de 100 000 membres y sont licenciés et le club possède des sections dans les plus grandes disciplines sportives comme le basket-ball, le handball, l’athlétisme, le tennis de Table et évidemment le football. Et depuis le mois de mai 2016, le FC Schalke 04 a mis un pied dans l’e-sport en choisissant d’investir dans une équipe League of Legends, rachetant l’équipe Elements et devenant le second club sportif à acheter une équipe League of Legends après l’équipe turque Beşiktaş au début de l’année 2015.</p> \n\n<p>Seul un joueur a été remplacé lors de la transition : le Français Jérémy « Eika » Valdenaire, au profit du Suédois Hampus « Fox » Myhre. Fox rejoint donc le cinq majeur dont les autres membres sont le Français Etienne « Steve » Michels au top, l’Allemand Berk « Gilius » Demir dans la jungle, le Danois Rasmus « MrRallez » Skinneholm en botlane et le Suédois Hampus « sprattel » Abrahamsson en support.</p>  \n\n<p>Ces joueurs vont pouvoir profiter d’un encadrement expérimenté qui devrait les mettre dans les meilleures conditions pour préparer leur saison. Le centre de formation de l’équipe de football a formé certains des meilleurs joueurs du monde, le club sait donc comment donner les armes à ses joueurs pour exprimer leur plein potentiel. L’avenir nous dira si le même destin attend la section League of Legends !</p> \n"},"foreignIds":{"drupalId":"3659"},"players":[233,490,824,1337,1376,1377,1752,2013],"starters":[233,824,1337,1376,1377],"subs":[490,1752,2013]},{"id":344,"slug":"red-bulls","name":"Team RB","guid":"05506392-acb6-46da-9ad2-23f4120ecf37","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-bulls-g5dlsqzb.png","acronym":"RB","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/red-bulls-2b49emvx.png","createdAt":"2017-06-06T21:59:19.000Z","updatedAt":"2017-08-06T14:56:40.000Z","bios":{},"foreignIds":{},"players":[206,538,1315,2001,2002,2003,2004],"starters":[206,538,1315,2001,2002],"subs":[2003,2004]}],"players":[{"id":206,"slug":"kasing","name":"KaSing","firstName":"Raymond","lastName":"Tsang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/kasing-9lg4fzj5.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2014-08-22T19:17:15.000Z","updatedAt":"2017-08-06T14:36:59.000Z","bios":{"en_US":"<p>\nWith his charming accent and beaming smile, Raymond \"KaSing\" Tsang will brighten your day instantly. Unless of course you're going toe-to-toe against him in lane, then you're in for a world of stuns, hooks, and every other type of unpleasant lockdown imaginable. KaSing's entrance into H2K's lineup in 2015 was a catalytic moment, as the team bounded off to an eight-game win streak. One person who came out looking particularly good during this span was H2K’s AD carry Petter \"Hjarnan\" Freyschuss. When asked during an interview what accounted for the incredible numbers he was putting up during the win streak, he had only one thing to say -- \"KaSing\". KaSing flew into the open arms of Team Vitality in the 2015 offseason, joining a roster full of misfits from other squads -- including his old H2K teammate and bot lane partner Hjarnan. \n</p>\n<p>\nIn 2016 KaSing performed admirably on a Vitality squad laced with talent. It wasn’t enough to save the legendary partnership between KaSing and Hjarnan though, and to the disappointment of fans around the world, their seemingly unbreakable bond was severed as Hjarnan stepped down from his starting role. KaSing’s infectious positivity will be essential in developing his new laning partner, Hyeong-gi “Police” Park. If we’re to believe Hjarnan (and we should), Vitality is left in great hands.\n</p>","fr_FR":"<p>Avec son accent charmant et son sourire rayonnant, Raymond « kaSing » Tsang peut illuminer votre journée en un instant. À moins bien sûr que vous ne soyez sur le point de l'affronter sur une voie, car vous êtes bon dans ce cas pour une série d'étourdissements, d'accrochages et autres contrôles de foule déplaisants. L'arrivée de kaSing chez H2K a eu l'effet d'un catalyseur, et l'équipe est immédiatement partie sur une série de 8 victoires. L'un des joueurs qui a particulièrement brillé durant cette période fut le carry AD d'H2K, Petter « Hjarnan » Freyschuss. Quand on lui a demandé ce qui expliquait les incroyables résultats qu'il obtenait durant cette série, il n'avait qu'une seule réponse à donner : « kaSing ».</p>\n<p>kaSing a été recruté par Team Vitality durant l'intersaison 2015, où il rejoint une formation composée de marginaux venus d'autres équipes, dont son ancien partenaire chez H2K, Hjarnan. Son attitude positive sera essentielle pour aider VIT à intégrer tous ces nouveaux joueurs et à en faire une équipe soudée. « L'environnement de l'équipe est l'un des éléments les plus importants du jeu », aime-t-il déclarer. Ses compétences techniques et ses capacités de meneur de jeu, notamment avec Thresh, lui permettent pratiquement d'être le carry de l'équipe en jouant support. Mais c'est vraiment son attitude qui le différencie des autres supports. kaSing a été élu au sein de l'All Pro 2nd Team du segment d'été des LCS EU 2015 et il a été récompensé du titre de Meilleur joueur de la semaine 4 du même segment.</p>\n<p>Pendant son premier segment de printemps sous la bannière de l’équipe française Vitality, KaSing a montré un bon niveau de jeu mais n’est jamais parvenu à se distinguer de ses homologues. L’étincelle du KaSing des grands jours n’a pas montré le bout de son nez et l’élimination précoce de son équipe des play-offs n’a pas aidé. Mais le joueur n’a pas perdu sa bonne humeur pour autant et s’entraîne dur au quotidien pour s’adapter, le rôle de support n’étant plus forcément celui d’initiateur qu’il était auparavant ! Mais en ce début de segment d’été, les mages semblent reprendre du poil de la bête… ce qui pourrait signer un retour en force du joueur britannique, qui semble avoir une affection tout particulière pour les champions comme Bard et Karma. Depuis le retrait de Hjarnan, KaSing a le luxe d’avoir deux nouveaux joueurs pour l’accompagne sur sa voie. Il pourra ainsi trouver chaussure à son pied plus aisément, même s’il sera obligé de travailler deux fois plus, ce qui ne devrait pas être un problème pour un joueur qui ne manque pas d’abnégation.</p>","pl_PL":"<p>Angielski wspierający to naprawdę doświadczony zawodnik, pomimo że na najwyższym poziomie gra dopiero do półtora roku. W swojej karierze znajdował się w składach aż 16 zespołów i bardzo długo szukał swojego miejsca na scenie.</p>\n<p>\nCo ciekawe, pierwszą drużyną w karierze KaSinga było… H2k, z którym związał się we wrześniu 2012 roku. Potem przyszły epizody w Enemy eSports oraz myRevenge. Wtedy jeszcze Brytyjczyk występował pod nickiem YerrowStarr, ale postanowił zmienić na Yerrow, a nieco później na KaSing, ponieważ wielu ludzi w kolejce solowej brało go za jedno z kont Bory „YellOwStaRa” Kima. W tym czasie wspierający dołączył też do formacji Dexter is actually evil i wraz z nią podjął nieudaną próbę dostania się do EU LCS, po czym ponownie zmienił zespół. Tym razem padło na brytyjską ekipę British Tea Time, która szybko została przyjęta w szeregi organizacji Dignitas, zostając jej europejską dywizją. KaSing spędził tam pół roku, ale zawiedziony brakiem większych sukcesów odszedł do interesującego składu Steve Bakes Cookies, z którym rywalizował w EU Challenger Series, lecz największym sukcesem drużyny okazał się ćwierćfinał turnieju.</p>\n<p>\nTo nie zadowalało angielskiego zawodnika, który opuścił drużynę i w czerwcu 2014 roku związał się z ekipą RoughNex, jednak tam również nie odnalazł swojego miejsca. Przełomem okazała się oferta od Supa Hot Crew, które występowało w tym czasie w EU LCS. Co prawda Anglik grał w tym zespole tylko przez jeden split, ale spisywał się nieźle i to wystarczyło, by jego talent został dostrzeżony. Wkrótce wpłynęła oferta od występującego w EU Challenger Series i mającego duże aspiracje Gamers2, ale niedługo później KaSing dostał jeszcze lepszą propozycję – od H2k, które było beniaminkiem rozgrywek LCS.</p>\n<p>\nSupport nie wahał się długo i po raz drugi dołączył do tej ostatniej formacji, co okazało się to strzałem w dziesiątkę. W tym zespole KaSing spędził niemal rok i przez ten czas święcił swoje największe triumfy, a także zbudował sobie renomę znakomitego wspierającego. Brytyjczyk całkowicie odmienił oblicze formacji, która słabo rozpoczęła wiosenny split EU LCS 2015 i poprowadził ją do dwukrotnego zdobycia trzeciego miejsca w EU LCS oraz wyjazdu na Mistrzostwa Świata. KaSing znalazł się na podium niemal każdej klasyfikacji wśród supportów grających w EU LCS, ale triumfował tylko na jednym polu – co ciekawe, był najczęściej zabijającym wspierającym. Anglik został także uznany przez ekspertów za jednego z trzech najlepszych supportów w stawce, co potwierdziło głosowanie kibiców na reprezentantów Europy na All-Stars 2015. KaSing zajął w nim co prawda drugie miejsce, ale wskutek niedyspozycji YellOwStaRa wziął udział w rywalizacji.</p>\n<p>\nW listopadzie KaSing otrzymał ofertę od jednej z największych zachodnich organizacji – Teamu SoloMid. Brytyjczyk dołączył do formacji i wziął z nią udział w dość nieudanym IEM-ie w San Jose, jednak ostatecznie zawodnik i formacja nie doszli do porozumienia i wspierający nie podpisał kontraktu na wiosenny split. Nowego pracodawcy nie szukał długo – zdecydował się wziąć udział w interesującym projekcie całkowicie nowej na scenie League of Legends organizacji - Teamu Vitality, które zbudowało wokół KaSinga cały zespół na wiosenny split 2016.</p>\n<p>\nInteresujący jest fakt, że ulubioną postacią KaSinga, który jest przecież nominalnym wspierającym, jest LeBlanc. Anglik uwielbia też koty, anime oraz seriale telewizyjne. Ponadto nienawidzi pełnić roli supporta w kolejce solowej.\n</p>","de_DE":"<p>Mit Raymond „kaSing“ Tsang hat sich Vitality einen der besten Support-Spieler der letzten Saison angeln können. Damals war Raymond Tsang noch bei H2K tätig und hat hier mit Hjärnan immer wieder bewiesen, wie stark er auf Champions wie Thresh oder Braum ist. Ihm war es während des Spring Splits zu verdanken, dass das Team damals den Weg in die Weltmeisterschaft geschafft hat. Auch wenn KaSing erst in der vierten Woche zum Team stieß, reichte die Leistung von ihm und Hjärnan aus. </p>\n\n<p>Diese enorme Leistung brachten dem jungen Engländer nicht nur massig Fans, sondern auch einen Platz bei All-Star in Los Angeles im Jahr 2015. Er gilt als besonders ehrgeizig, bleibt dabei aber sehr sympathisch und überzeugt durch seine offene Art. </p>\n\n<i><p>„Ich wollte immer ein Pro-Spieler werden. Ich mag den Lebensstil – das Spielen, das Herumreisen. Es war und ist der Traum-Job eines jeden Fans.“ - Raymond „KaSing“ Tsang</p></i>\n\n<h2><p>Der aggressive Support-Spieler </p></h2>\n\n<p>Auch wenn Raymond sich selbst als aggressiven Support-Spieler bezeichnet, fiel er während der EU LCS Summer Playoffs vor allem durch seine sichere Spielweise auf. Damals besaß er die höchste KDA von allen Spielern im Turnier, weswegen er binnen kürzester Zeit zu den stärksten Supportern der Welt gezählt wurde. </p>\n\n<i><p>„Ich selbst würde mich als aggressiver Spieler bezeichnen, der aber genau weiß, wo die Grenzen vom aggressiven Spielen liegen.“ - Raymond „KaSing“ Tsang</p></i>\n\n<p>Trotz der enormen Beliebtheit, beschreiben ihn seine Mitspieler als bodenständig und freundlich. KaSing hat eine offene Art, die vor allem bei Mitspielern enorm gut ankommt. Er weiß, wie er seine Mitspieler motivieren muss, damit das Spiel noch einmal rumgerissen werden kann. KaSing selbst setzt nur wenig Wert auf Geld und Ruhm – er ist zu Vitality gekommen, um als Spieler besser zu werden. </p>\n\n<p>2016 wird das Ziel sein, dass Vitality es zu der Weltmeisterschaft schafft. KaSing hat bereits Erfahrungen auf diesem Level des kompetitiven Bereiches, weswegen er dem Team einen großen Nutzen bietet! </p>\n\n<h2><p>Interessante Fakten</p></h2>\n<p>•\tBeliebte Champions: Thresh, Braum, Anni  </p>\n<p>•\tBesaß die höchste KDA bei den EU und NA LCS Summer Playoffs</p>\n<p>•\tGehört zu den besten Supportern der Welt \n</p>\n","es_ES":"<p>Puede que en la actualidad Raymond ‘kaSing’ Tsang, cuya sonrisa de oro le está convirtiendo en el Magic Johnson de League of Legends, sea uno de los jugadores más populares y respetados de la LCS EU, pero hasta alcanzar este status el británico no lo ha tenido fácil.</p>\n\n<p>El apoyo ha pasado por trece equipos a lo largo de su carrera, una muestra de lo complicado que le ha resultado encontrar estabilidad en el ámbito competitivo. No sólo ha viajado de alineación en alineación, sino que ha vivido en Hong Kong y Berlín además de en Londres, su ciudad natal. De hecho, decidió hacer de su nombre chino su apodo ya que los aficionados le confundían con Bora ‘YellOwStaR’ Kim cuando usaba el alias con el que jugaba a DotA, ‘YerrowStar’.</p>\n\n<p>Esta considerable fluctuación de equipos puede achacarse a una posible falta de nivel en determinados momentos, pero no a su actitud. Incluso después de varios años sin lograr ningún hito deportivo y sin el apoyo de sus padres, la faz del londinense siempre presentaba una sonrisa. En ocasiones más que justificada, como en su debut en la LCS ante su público como sustituto de SUPA HOT CREW, la primera escuadra en la que permaneció durante más de tres meses.</p>\n\n<p>A pesar de la gran mejora experimentada en el split de verano de 2014, kaSing decidió unirse a Gamers2, una organización que aspiraba a acceder a la máxima competición desde la Challenger Series. Sin embargo, ni siquiera el Torneo de Expansión fue suficiente para la escuadra española, que no alcanzó su objetivo.</p>\n\n<p>Los malos resultados de H2K en el split de primavera de 2015 le proporcionaron a kaSing la oportunidad de regresar a la LCS. El impacto del apoyo no sólo fue inmediato, sino que revolucionó la liga al propulsar al equipo hacia una racha de ocho victorias consecutivas. Su habilidad como creador de jugadas, sobre todo con Thresh, quedó complementada con sus aportaciones comunicativas y, sobre todo, el buen ambiente que implementó en una alineación desmotivada con su comienzo en la liga.</p>\n\n<p>kaSing es un firme creyente de que la dinámica interna de una plantilla es uno de los grandes factores que influyen en la Grieta del Invocador, una teoría que le ha dado la razón en su paso por H2K. Aunque el equipo se quedó a las puertas de la final europea en ambos splits, los puntos acumulados le permitió participar en el Campeonato Mundial 2015 y medirse contra los mejores del planeta.</p>\n\n<p>Después de su primer gran año a nivel competitivo, kaSing probó suerte al otro lado del charco con Team SoloMid. La organización americana tenía un proyecto muy ambicioso, pero el británico prefirió firmar con Team Vitality ya que echaba mucho de menos Europa. Se trata de una nueva aventura, pero kaSing cuenta al menos con su fiel compañero de línea: Petter ‘Hjärnan’ Freyschuss, al cual considera uno de los mejores tiradores con los que ha jugado.</p>\n\n<p>Consolidado como uno de los mejores de su posición y reconocido internacionalmente en eventos como el All-Star, donde se metió al público en el bolsillo con su carisma, su objetivo es conquistar la liga, aunque para ello probablemente tenga que adaptar su estilo de juego a sus nuevos aliados. Lo que no cambiará, por desgracia para los comentaristas, es su tradición de escoger por unos segundos a Zilean en cada fase de selección de campeones.</p>","pt_BR":"<p>Se você encontrar kaSing na rota, pode se preparar para um festival de atordoamentos, ganchos e todo tipo de problema imaginável. A entrada dele na H2K foi fundamental, e o time logo conseguiu uma sequência de oito vitórias seguidas. Quem se destacou nesses jogos foi o atirador Hjarnan, e quando questionado sobre os motivos, ele foi bem claro: \"Graças ao kaSing\". \n</p>\n<p>\nEle teve um impacto positivo dentro de jogo também, com uma atitude positiva na química do time. \"O clima da equipe é uma das coisas mais importantes no jogo\", ele diz. Ele tem mecânicas robustas e é capaz de fazer boas jogadas, principalmente com Thresh.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">매력적인 억양과 환한 미소를 가진 Raymond \"kaSing\" Tsang 선수는 누구든 기분 좋게 하는 재주가 있습니다. 물론 라인에서 맞상대로 만난 게 아니라면 말이죠. .kaSing 선수는 적이라면 기절과 끌어당기기 등 온갖 기분 나쁜 수단을 동원해 손발을 묶어 버립니다. H2K에 kaSing 선수가 합류하자마자 팀은 8연승을 기록하며 승승장구했습니다. 그리고 이때 특히 뛰어난 기량을 보여줬던 선수가 원딜러인 Petter \"Hjarnan\" Freyschuss 선수였는데, 인터뷰에서 어떻게 연승 행진을 하는 동안 그렇게 뛰어난 기록을 냈느냐는 질문에 단 한 마디, “kaSing”으로 대답했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">2015년 시즌이 끝나자 kaSing 선수는 대서양을 건너가 서구의 강자가 한데 모인 TSM의 품에 안깁니다. 이 선수의 긍정적인 자세는 새 선수로 팀을 꾸려야 하는 TSM이 결속력을 다지는 데 큰 도움이 될 겁니다. kaSing 선수는 “팀 분위기야말로 경기에서 가장 중요한 부분이다”라고 말한 바 있죠. kaSing 선수의 탄탄한 피지컬과 플레이 메이킹 능력, 특히 쓰레쉬를 잡았을 때의 활약을 보면 서포터로서 팀을 캐리할 수 있으리라 예상합니다. 하지만 이 선수가 다른 서포터와 차별화되는 이유는 바로 자세에 있죠. kaSing 선수는 2015 유럽 LCS 서머 스플릿 올프로 2위 팀에 뽑혔고 4주차 MVP로 선정된 바 있습니다. </p>\n"},"foreignIds":{"drupalId":"1939","TRLH3":"1001220078","TRLH4":"200000474","TRLH1":"1001180011","TRLH2":"1001250064","FRA1TMNT2":"25482","ESPORTSTMNT02":"200002477"},"socialNetworks":{"twitch":"www.twitch.tv/kasinglol","facebook":"www.facebook.com/kasinglol","twitter":"https://twitter.com/kasinglol"},"champions":[],"liveGameTeam":344},{"id":233,"slug":"smittyj","name":"Smittyj","firstName":"Lennart ","lastName":"Warkus","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smittyj-8owo56ml.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2014-09-09T16:42:06.000Z","updatedAt":"2017-03-28T15:13:21.000Z","bios":{"en_US":"<p>\nLennart \"SmittyJ\" Warkus isn't afraid to hop, jump, dive, or charge his way into the enemy team. SmittyJ's aggression often has a purpose though -- if he causes enough chaos in the enemy ranks, his teammates can cut through them like a knife through warm butter.\nUnfortunately for SmittyJ, his dives often leave him up the proverbial creek without a paddle. Or, maybe more accurately, stranded in the Baron pit without a dash to escape over the wall. \n</p>\n<p>\nAfter a short stint in North America with Team Dignitas, Smittyj headed home to Europe to compete with Giants Gaming. They hope to turn his aggression into something special, but his aggression may be punished heading into his first full EU LCS Split.\n</p>","fr_FR":"<p>Lennart « Smittyj » Warkus est le nouveau top laner de Dignitas, tout droit débarqué des Challenger series... européennes ! Comme de nombreux joueurs professionnels et semi-professionnels ces dernières années, Smittyj a traversé l'Atlantique pour rejoindre une équipe nord-américaine.</p>\n\n<p>Auparavant, ce joueur allemand de 19 ans a passé pas loin de deux ans à arpenter la deuxième division professionnelle dans l'espoir de percer au plus haut niveau. En saison 4, avec SK Prime, le jeune joueur est parvenu à se qualifier en deuxième position pour le tournoi de promotion/relégation, mais a dû s'avouer vaincu face à des Gambit Gaming largement supérieurs. Même scénario lors du segment de printemps de la saison 5, cette fois en tant que top laner de Gamers 2. Pire, lors de cette saison des Challenger series, Smittyj et ses camarades n'ont même pas réussi à se qualifier pour le tournoi de promotion/relégation, ratant la 3e place qualificative de peu, lors d'une défaite 2 victoires à 1 face à Reason Gaming.</p>\n\n<p>Qu'à cela ne tienne, l'Allemand ne s'est pas découragé et a eu de nouveau l'occasion de toucher le graal à l'issue de la saison estivale des Challenger series de la saison 5. Une fois de plus, son équipe et lui ont perdu en demi-finale des play-offs face à Dignitas, par la suite qualifiée aux LCS EU, mais ils ont cette fois su se reprendre à temps pour arracher la troisième place qualificative des mains de Denial Esports. Au niveau individuel, Smittyj en a profité pour remporter sa voie par deux fois face à Mike « Wickd » Petersen, ancienne gloire de League of Legends. Tout un symbole.\nAutre symbole, la victoire de Gamers 2 et SmittyJ en tournoi de relégation face à l'une des plus anciennes organisations européennes du jeu, SK Gaming, vaincus 3-2 et boutés hors des LCS par le jeune top laner et ses coéquipiers.</p>\n\n<p>Sa qualification au plus haut niveau enfin en poche, Smittyj aurait pu tranquillement se préparer à découvrir les LCS EU, mais il a préféré repartir à nouveau à l'aventure, cette fois sur le serveur nord-américain au sein de l'équipe Dignitas, ce qui implique forcément beaucoup plus de pression de la part des fans et du grand public. Changement de rythme assez brutal pour le joueur qui, avec son manque d'expérience en LCS, peine à obtenir des résultats suffisants dans l'écurie Dignitas. Peu à peu, son style de jeu se confirme et bientôt, SmittyJ devient un joueur agressif, n'ayant pas peur de s'engouffrer dans des situations hasardeuses sur la voie du haut.</p>\n\n<p>Après une année en dents de scie en Amérique, le joueur revient en Europe en tant que toplaner titulaire pour les Giants Gaming. SmittyJ est prêt à relever le défi une nouvelle fois, avec une place en LCS Europe qu'il a longuement attendu.</p>\n","pl_PL":"<p>Lennart \"Smittyj\" Warkus  jest członkiem profesjonalnych drużyn League of Legends od początku czwartego sezonu. Zaczynał w lutym 2014 roku, w mało znanej drużynie COREPLAY, lecz już po miesiącu trafił do SK Gaming Prime. Pod skrzydłami tej organizacji nabrał doświadczenia na esportowej scenie. Jednak po połowie roku stwierdził, że tam nie odniesie sukcesu, więc opuścił tą drużynę i szukał szczęścia gdzie indziej. Ostatecznie, w lutym 2015 roku, dołączył do Gamers2, później przemianowanych na G2 Esports. Dopiero w tym zespole \"Smittyj\" miał okazję się zrealizować, biorąc udział w Challenger Series. W tych rozgrywkach pokazał jak umiejętnym jest zawodnikiem, kończąc na szczycie tabeli z wynikiem 8:2. Równie dobrze poszło mu w meczach barażowych, aż w końcu stanął przeciwko weteranom EU LCS – SK Gaming.</p>\n<p>\nPrzed grą z SK Gaming o wejście do EU LCS \"Smittyj\" był bardzo pewny siebie i swoich umiejętności. W nagraniu internetowym G2 Esports „Road to LCS” oświadczył, że pokona junglera przeciwników z łatwością. Co prawda nie była to dziecinna igraszka, jak zapowiadał, ale i tak bardzo doświadczony \"fredy122\" został przez niego znokautowany. Dzięki wygranej 3:2 z SK Gaming zakwalifikował się wraz z drużyną do wiosennego sezonu 2016 EU LCS, co było jego największym osiągnięciem w karierze gracza.</p>\n<p>\nNie dane mu jednak było wystąpić w Europie, gdyż jego umiejętności zaimponowały również analitykom zza oceanu. \"Smittyj\" został przez nich nazwany „niedocenianym, młodym talentem, który może wkrótce rozkwitnąć”. W listopadzie 2015 roku dołączył do Team Dignitas, jednej z najstarszych i niezatapialnych drużyn w League of Legends. Wiązało się to oczywiście z przeprowadzką młodego Niemca do Stanów Zjednoczonych, co przyjął zaskakująco dobrze. Jego debiut w ich szeregach miał miejsce na top-lanie w wiosennym sezonie 2016 NA LCS. </p>\n<p>\nZ wszystkich bohaterów najbardziej przepada za Riven, aczkolwiek równie dobrze gra innym postaciami na top-lanie. Wszechstronność jest zaletą Lennarta - świetnie sobie radzi zarówno asasynami jak i obrońcami, bądź molochami. Opierając się na swoich umiejętnościach udało mu się dostać do Kręgu Pretendenta w Europie. Oprócz uniwersalności w League of Legends wyróżnia go wrażliwość na ludzką krzywdę. Aktywnie bierze udział w streamowaniu na rzecz dzieci współpracując z organizacjami charytatywnymi. </p>\n","de_DE":"<p>Der Deutsche Lennart \"SmittyJ\" Warkus startete ursprünglich mit G2 im Jahr 2015 durch, spielte im letzten Split für Team Dignitas und ist nun Top-Laner für Giants! Gaming. Er konnte viel Erfahrung in den letzten Monaten sammeln und ist kein Neuling mehr in der Szene. SmittyJ ist bekannt für sein Selbstvertrauen, denn laut ihm ist er der beste Top-Laner den es gibt. Im ist keine Herausforderung zu groß, und die nächste Aufgabe ist es, die Giants wieder ins Spiel zu bringen. Mit seinen Lieblingschampions Maokai und Fiora hat SmittyJ eine Killbeteiligung von über 75% und ist oftmals die tragende Kraft in den Teamkämpfen. Er bezeichnet sich selber als guten Shotcaller und erweitert stets seine Auswahl an Champions – ihm sind keine Grenzen gesetzt. </p>\n\n<p>“Was ich für das Team mitbringe? Ich kann ziemlich gut shotcallen, außerdem bin ich einfach gut, also..das bringe ich mit.” - Lennart \"SmittyJ\" Warkus</p>\n"},"foreignIds":{"drupalId":"2902","TRLH1":"1001220074","TRLH2":"1001160124","TRLH3":"200000230","TRLH4":"200000082","FRA1TMNT2":"25044","ESPORTSTMNT02":"200001004"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":490,"slug":"steve","name":"Steve","firstName":"Etienne","lastName":"Michels","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/steve-homsdwkp.png","hometown":"France","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-05-20T14:49:17.000Z","updatedAt":"2017-03-26T09:35:58.000Z","bios":{"en_US":"<p>\nEtienne “Steve” Michels launched his career with ROCCAT during the 2015 EU LCS Summer Preseason, replacing Overpow as their starting top laner. Steve brought several years of amateur experience, but he was still an EU LCS rookie and had the inconsistent play to prove it. In 2016, Steve and Schalke were huge underdogs heading into the Spring Split. Their play was enough to hang onto 7th place and re-qualify for the Summer Split.\n</p>\n<p>\nSteve has always been a crowd favorite though, making a name for himself as a great split pusher and all-around team player. This split will be a test to find out just where Steve lies in Europe’s sea of talent. Schalke has remained largely the same, paving the way for Steve to make this Split a proving grounds for himself. Let there be no doubt, the chants of “Steeeeeeeeeeeeve!” will still be heard around the world, let’s just hope he answers the call.\n</p>","fr_FR":"<p>La France est particulièrement bien fournie en toplaners. Après le vétéran Paul « sOAZ » Boyer et Lucas « Cabochard » Simon-Meslet, le public a pu découvrir Etienne « Steve » Michels. Ayant débuté sur League of Legends dès ses prémices, Steve n’a pas tout de suite été tenté par la compétition, mettant ses études au premier plan. En 2015, il rejoint le projet Sparta, dans le but de tenter la qualification aux LCS via le tournoi d’expansion. L’équipe ayant échoué dans son entreprise, Steve rejoint l’équipe LDLC pour continuer à jouer au niveau français. C’est à ce moment-là que sa carrière décolle. Steve est repéré par l’équipe ROCCAT lors de la pré-saison estivale des LCS EU 2015, qui lui propose de remplacer Overpow au poste de toplaner titulaire. Il avait dans ses bagages quelques légères années d'expérience sur la scène amateur, mais il restait néanmoins un débutant propulsé aux LCS EU. Son inexpérience au niveau professionnel lui a coûté cher dès les premières semaines du segment d'été et les équipes adverses en abusaient.</p>\n<p>Mais très vite, le Français a redressé la tête durant la seconde moitié de la saison et son KDA moyen est passé de 1,9 (semaines 1 à 5) à 4,4 (semaines 6 à 10). Sa confiance en ses capacités et, plus important encore, la confiance que ses équipiers plaçaient en lui étaient bien plus grandes. Les spectateurs berlinois ont également soutenu le toplaner dès ses premières apparitions, visiblement séduits par son sourire permanent. Les progrès de Steve ont hissé permis à ROCCAT d’atteindre la 5e place du segment d'été des LCS EU 2015 et de participer aux play-offs. </p>\n<p>Début 2016, Steve rejoint l’équipe Elements in-extremis. Aux côtés de son compatriote Jérémy « Eika » Valdenaire, il donne le meilleur de lui-même dans un championnat très disputé mais le milieu de saison est très difficile. L’équipe parvient tout de même à sécuriser la 7e place, qui n’offre pas de ticket pour les play-offs mais qui dispense de tournoi de relégation. À l’intersaison, le spot Elements est racheté par l’équipe sportive FC Schalke 04. Fort d’un encadrement très sérieux et expérimenté, Steve pourra peut-être enfin s’épanouir cette saison !\n</p>","es_ES":"<p>Etienne 'Steve' Michaels comenzó su carrera profesional durante la pretemporada del Split de verano de la LCS EU 2015, reemplazando a Overpow como el top titular. Steve traía bajo el brazo varios años de experiencia en la competición amateur, pero no dejaba de ser un novato, cosa que pagó en las primeras semanas del Split de verano de la LCS EU 2015 con una actuación lejos del nivel esperado.</p>\n<p>Pero Steve no cejó en su empeño y mejoró sensiblemente su rendimiento en la segunda mitad de la temporada, pasando de un KDA de 1.9 (jornadas 1 a 5) a 4.4 (jornadas 6 a 10). Con un aumento significativo no sólo en su confianza sino en la del resto del equipo. La mejora de Steve llevó a ROCCAT a la tercera posición en el Split de verano de la LCS EU 2015, y eventualmente aseguró una plaza en un nuevo equipo de cara al Split de primavera de la LCS EU 2016, Elements. No podemos esperar a ver a los aficionados aclamarlo con su grito preferido: \"¡¡Steeeeevveeeeeeee!!\".</p>","pl_PL":"<p>Etienne rozpoczął swoją przygodę z League of Legends bardzo wcześnie, gdyż zdominował amerykański serwer przed powstaniem europejskiego. Zanim się przeniósł na ten drugi, udało mu się znaleźć wśród 30 najlepszych graczy w regionie. Na amatorskiej scenie pojawił się w 2013 roku, grając w wielu drużynach konkurujących w Kręgu Pretendenta. Przed zaangażowaniem się w rozgrywki 5v5, w pierwszym i drugim sezonie „Steve” uznawał za swoją główną rolę AD Carry. Dopiero udział w drużynowych konkurencjach sprawił, że przeniósł się na top-lane. Posunął się nawet do tego, że po liceum wziął rok wolnego żeby się skupić na swojej karierze profesjonalnego gracza. Jednak ani przenosiny na inną linię ani rezygnacja z pójścia na studia nie przyniosły mu upragnionych osiągnięć. Dopiero kiedy wrócił na studia fizyki w inżynierii dostał szansę na wykazanie się od drużyny Sparta. W październiku 2014 roku przeniósł się do domu graczy w Paryżu należącego do tej organizacji. Wraz z nią wziął udział w Europejskim turnieju rozszerzającym ilość drużyn w rozgrywkach LCS. Niestety znowu bez sukcesu. </p>\n<p>\n„Steve” miał okazję pokazać się społeczeństwu dopiero kiedy zastąpił Remigiusza \"Overpow\" Puscha w zespole Roccat. Od maja 2015 roku przejął górną aleję w tej ekipie i wreszcie miał okazję zaprezentować co potrafi szerszej publice. W szeregach „niebieskiego kota” osiągnął największy sukces – zajął piąte miejsce w letnim sezonie EU LCS 2015. Jak na debiutanta to naprawdę imponujący wyczyn. Jednak nie pozostawił widzom wątpliwości, że w pełni zasłużył na podziw. Wielokrotnie broniony przez Etienna top-lane stawał się ostoją całej drużyny, pomimo tego, że nie grał swoimi ulubionymi bohaterami – Ryzem i Irelią. Stał się znany z niesamowitych zagrań Maokaiem, którego najczęściej można było podziwiać właśnie w jego wydaniu. Wielu fanów utrzymuje, że największe wrażenie na nich zrobiła jego gra Ekko – w lecie wygrał wszystkie mecze, w których wybrał Chłopca, Który Ujarzmił Czas.</p>\n<p>\n„Steve”, pomimo tego, że urodził się we Francji, miał okazję mieszkać w Belgii i Arabii Saudyjskiej – co bardzo wyróżnia go wśród innych graczy. Kolejnym znaczącym kontrastem była jego zdolność do połączenia pasji gry na komputerze z klasycznym sportem. W swoim regionie osiągnął wiele w lidze badmintona.\n</p>","de_DE":"<p> „Er ist sehr bescheiden.“ Worte, mit denen Jakob \"YamatoCannon\" Mebdi seinen damaligen Top-Laner beschrieb. Ein Attribut, was nicht vielen Spielern der oberen Liga zugutekommt, da mit guten Spielern oftmals ein großes Ego einhergeht. Mit Nettigkeit kommt man nicht voran? Steve beweist das Gegenteil, denn hinter dem sanften Gemüt steckt viel Ehrgeiz und die feste Entscheidung im eSports etwas zu erreichen. </p>\n<h2><p>Ein steiniger Weg</p></h2>\n<p>Doch der Weg war kein leichter. Sein Eintritt in League war gleich zu Beginn des Spiels im Jahre 2009. Ohne weitere Hintergedanken kam er schnell unter die Top 200 und erste Gedanken an eine Karriere kamen auf. Mit Beginn der dritten Saison kam der erste große Schritt zur Umsetzung des Plans. Er wählte die Top-Lane zu seiner Bestimmung, da er Jarvan IV. sehr gerne spielte und hielt erstmals nach Amateurteams Ausschau. </p>\n<p>Wie bei so Vielen folgte ein langer Weg vom einen Challenger Team zum nächsten, da sich die Teams schon nach den ersten Misserfolgen wieder schnell auflösten. Unter anderem auch die Eigenkreationen des Hobbykeksbäckers mit seinem Team „Steve Bakes Cookies“. So richtig los ging es erst, als YamatoCannon auf ihn aufmerksam wurde, nachdem er durch seine Art immer wieder von ehemaligen Kollegen empfohlen wurde. </p>\n<p>Wohlgleich noch der Franzose noch sehr unvertraut mit dem von da an immer größer werdenden Publikum war, lieferte er einen sehr starken Split ab. Er war maßgeblich an dem zufriedenstellenden fünften Platz seitens ROCCAT beteiligt. Vor allem durch sein starkes Erscheinen auf Maokai und Ekko verhalf er dem Team vermehrt zu Siegen. Nicht ohne Grund waren die „Steeeeve“ Rufe im LCS Stream nicht zu überhören. </p>\n<p>Die Reise geht nun weiter. Das ruhige Gemüt wird zukünftig eines der fünf Elemente in Elements sein. Nicht als Feuer und Flamme, sondern als standfestes Rückgrat des Teams. Während des Spiels, aber auch danach im persönlichen Zusammenleben mit seinen wieder einmal neuen Kollegen. </p>\n"},"foreignIds":{"drupalId":"1940","TRLH3":"200000255","TRLH4":"200000307","TRLH2":"1001250001","FRA1TMNT2":"25416","ESPORTSTMNT02":"200001025"},"socialNetworks":{"twitch":"http://www.twitch.tv/rocsteve","facebook":"https://www.facebook.com/LolIAmSteve?_rdr=p"},"champions":[],"liveGameTeam":55},{"id":538,"slug":"sedrion","name":"Sedrion","firstName":"Tarik","lastName":"Holz","roleSlug":"adcarry","photoUrl":"http://riot-web-cdn.s3-us-west-1.amazonaws.com/lolesports/s3fs-public/MOU-Sedrion-2015eucs.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-08-06T14:36:31.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"1936","ESPORTSTMNT02":"200002476","TRLH4":"200000473"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":824,"slug":"caedrel","name":"Caedrel","firstName":"Marc","lastName":"Lamont","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/caedrel-h53dck4h.png","hometown":"United Kingdom","region":"EU Challenger Series","birthdate":null,"createdAt":"2015-07-21T20:45:03.000Z","updatedAt":"2017-06-21T21:25:03.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4760","TRLH4":"200000180","TRLH3":"200000077","ESPORTSTMNT02":"200002452"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1315,"slug":"thai","name":"Thal","firstName":"Kwon-hyuk","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/thai-cs07fd1k.png","hometown":"South Korea","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-03T00:04:44.000Z","updatedAt":"2017-08-06T14:39:04.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"455039","ESPORTSTMNT02":"200002390","TRLH4":"200000470"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":1337,"slug":"memento","name":"Memento","firstName":"Jonas","lastName":"Elmarghichi","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/memento-2s3o4ejq.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:46:29.000Z","updatedAt":"2017-06-18T19:39:23.000Z","bios":{"en_US":"<p>Jonas \"Memento\" Elmarghichi was originally a solo queue star before kickstarting his professional career in 2015. He then joined Team ROCCAT as their starting jungler in mid 2016. He, along with the entire team, struggled in the LCS and eventually had to play in the EU LCS Promotion Tournament in order to re-enter the league. After struggling with ROCCAT, Memento looked for other opportunities to showcase his abilities and landed with Giants Gaming in early 2017. While his play hasn’t been astounding by any stretch, he’ll have another shot to prove that he belongs with the best in Europe when spring rolls around.</p>","de_DE":"<p>Jonas „Memento“ Elmarghichi war ursprünglich ein Star der Solo-Warteschlange, bevor er seine Profikarriere 2015 gestartet hat. Er ist Mitte 2016 Team ROCCAT als Jungler beigetreten. Allerdings hatten er und der Rest des Teams große Schwierigkeiten in der LCS und schließlich mussten sie sich im „EU LCS“-Aufstiegsturnier den Weg zurück in die Liga erkämpfen. Nach den Problemen mit ROCCAT hat sich Memento nach anderen Möglichkeiten umgesehen, um seine Fähigkeiten zu zeigen. Anfang 2017 ist er dann bei Giants Gaming gelandet. Obwohl seine Leistung nicht außergewöhnlich war, kann er im Frühjahr erneut beweisen, dass er zu den Besten Europas gehört.</p>"},"foreignIds":{"TRLH4":"200000199","TRLH3":"200000096","ESPORTSTMNT02":"200002451"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1376,"slug":"norskeren","name":"Norskeren","firstName":"Tore","lastName":"Hoel Eilertsen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/norskeren-f5d7bkuf.png","hometown":null,"region":"Challenge France","birthdate":null,"createdAt":"2016-06-17T20:14:37.000Z","updatedAt":"2017-08-17T15:27:52.000Z","bios":{"en_US":"","fr_FR":"Dans son pays d'origine, le joueur norvégien a joué dans plusieurs équipes, participant à des tournois nationaux et des LANs. C'est en avril 2016 qu'il rejoint la structure professionnelle allemande mousesport. Finalement, il préférera retourner en Norvège pour jouer dans l'équipe Riddle eSports, la meilleure équipe du pays. \n<br />\nRéperé par Millenium grâce à ses performances sur le classement et ses nombreuses parties en support des meilleurs Carry AD d'Europe, il travaillera avec P1noy pour ne laisser aucun moment de répit à ses adversaires."},"foreignIds":{"TRLH1":"1001360009","esportstmnt05":"200000939","ESPORTSTMNT02":"200002448","TRLH4":"200000354","TRLH3":"200000354"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1377,"slug":"upset","name":"Upset","firstName":"Elias","lastName":"Lipp","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/upset-f4z7h6wr.png","hometown":"Germany","region":"EU Challenger Series","birthdate":null,"createdAt":"2016-06-20T17:58:58.000Z","updatedAt":"2017-05-09T22:41:05.000Z","bios":{},"foreignIds":{"TREU1":"1000585051","TREU":"1000585051","ESPORTSTMNT02":"200001007","TRLH3":"200000233","TRLH4":"200000085","TRLH1":"200000423"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":1752,"slug":"rexxx","name":"1 Rexxx","firstName":"Erik","lastName":"Reisswig","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rexxx-5uhnncsw.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-30T20:08:17.000Z","updatedAt":"2017-07-07T18:06:26.000Z","bios":{},"foreignIds":{"TRLH3":"200000235","TRLH4":"200000087"},"socialNetworks":{},"champions":[],"liveGameTeam":55},{"id":2001,"slug":"moojin","name":"MooJin","firstName":"Moo Jin","lastName":"Kim","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/moojin-buliff0m.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:04:27.000Z","updatedAt":"2017-08-06T14:46:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002391","TRLH4":"200000471"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2002,"slug":"magifelix","name":"MagiFelix","firstName":"Felix","lastName":"Boström","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/magifelix-38otwdel.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:05:50.000Z","updatedAt":"2017-08-06T14:39:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002392","TRLH4":"200000472"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2003,"slug":"meleks","name":"Meleks","firstName":"Symeon","lastName":"Smejkal","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meleks-gep6ylg0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:07:12.000Z","updatedAt":"2017-08-06T14:43:02.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002478","TRLH4":"200000475"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2004,"slug":"lennart","name":"Lennart","firstName":"Lennart","lastName":"Kunz","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/lennart-woydtqc.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-08T01:04:36.000Z","updatedAt":"2017-08-06T14:46:45.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002479","TRLH4":"200000476"},"socialNetworks":{},"champions":[],"liveGameTeam":344},{"id":2013,"slug":"nikola-senpai","name":"Nikola Senpai","firstName":"Nikola","lastName":"Djordjevic","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nikola-senpai-3z4qiutz.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:23:59.000Z","updatedAt":"2017-08-06T14:35:58.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002453","TRLH4":"200000454"},"socialNetworks":{},"champions":[],"liveGameTeam":55}],"scheduleItems":[{"id":"AVyjeL77QMQFcjhwbQ70","content":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31:match:e0036b37-390e-4126-ae79-800ffca8d642","scheduledTime":"2017-06-18T13:00:00.414+0000","tags":{"blockLabel":"1","blockPrefix":"week","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31:bracket:bf0dc88a-b3fa-41e0-9465-4f31868e36b8","leagueLabel":"urn:rg:lolesports:global:league:league:5","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:40b63df3-2e9d-49da-8793-7e2ff9265a31"},"match":"e0036b37-390e-4126-ae79-800ffca8d642","tournament":"40b63df3-2e9d-49da-8793-7e2ff9265a31","bracket":"bf0dc88a-b3fa-41e0-9465-4f31868e36b8","league":"5"}],"gameIdMappings":[{"id":"de415c8a-b977-4a12-b881-b99142c48aa3","gameHash":"6b3dcbbf4bda0d6a"},{"id":"871d9d58-3cf9-4021-aa4b-451d77a28db2","gameHash":"e3ee3a0dacf17b6c"}],"videos":[],"htmlBlocks":[],"match":{"id":"e0036b37-390e-4126-ae79-800ffca8d642","name":"RB-vs-S04","position":8,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}],"games":{"de415c8a-b977-4a12-b881-b99142c48aa3":{"id":"de415c8a-b977-4a12-b881-b99142c48aa3","name":"G2","generatedName":"RB|S04|G2|e0036b37390e4126ae79","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}],"standings":{"result":[[{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}],[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}]],"timestamp":1497812496769,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"gameId":"200367","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:200367","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"871d9d58-3cf9-4021-aa4b-451d77a28db2":{"id":"871d9d58-3cf9-4021-aa4b-451d77a28db2","name":"G1","generatedName":"RB|S04|G1|e0036b37390e4126ae79","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"},{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}],"standings":{"result":[[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}],[{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}]],"timestamp":1497812501934,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}],[{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"}]],"timestamp":1497796665197,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"210349","gameRealm":"ESPORTSTMNT02","platformId":"ESPORTSTMNT02:210349","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e0c895f7-ea59-4bf8-96c9-ea5578045d32"},{"roster":"0aa7f203-f1a0-435d-969d-a68b56c52d88"}]],"timestamp":1497812496770,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"ties","options":{"points":[3,0],"tiedPoints":1}},"scores":{"e0c895f7-ea59-4bf8-96c9-ea5578045d32":1,"0aa7f203-f1a0-435d-969d-a68b56c52d88":1}}}