{"teams":[{"id":82,"slug":"team-we","name":"Team WE","guid":"be6e0936-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-we-ei826ceg.png","acronym":"WE","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-07T22:21:53.000Z","bios":{"en_US":"","pl_PL":"Team WE są znani w chińskim e-sporcie od pradziejów. Jako pionierska organizacja e-sportowa zasłynęli w świecie ze swoich drużyn Warcrafta i StarCrafta, zanim w 2011 roku przestawili się na League of Legends. Po latach przeplatających się serii sukcesów i porażek Team WE w 2017 roku naprawdę się odnaleźli. Łącząc stare talenty z nowicjuszami, Team WE zdominowali wiosenny split LPL 2017, osiągając wynik 12–4 w fazie grupowej. Nie spoczęli na laurach i wkrótce przebili się przez konkurencję w play-offach, przegrywając tylko jedną grę w drodze po tytuł wiosennego splitu. Ich zwycięstwo 3–0 z Royal Never Give Up w finale stanowiło ukoronowanie znakomitego sezonu drużyny. Teraz szykują się do Rio, gdzie zamierzają wielokrotnie wykradać Barona oraz eliminować najlepsze drużyny świata na Mid-Season Invitational 2017. \n\nTrener: Namhoon „HooN” Kim\n","es_ES":"Team WE es una vieja leyenda china de los esports. Como organización de esports pionera, ya era famosa mundialmente por sus equipos de Warcraft y Starcraft antes de que se uniera a League of Legends en 2011. Tras años alternando éxitos y fracasos, Team WE ha conseguido establecerse en 2017. Con una mezcla de viejos talentos y jugadores recién llegados, Team WE ha arrasado en el split de primavera de la LPL 2017, en la que batió un récord de 12 victorias frente a 4 derrotas en la fase de grupos. Pero la cosa no se quedó en eso. El equipo no tardaría en abrirse paso en los playoffs y en reclamar la corona del split de primavera con tan solo una derrota en su haber. Su resultado 3-0 en la final contra Royal Never Give Up es el colofón de una temporada estelar. Los jugadores de Team WE ahora se dirigen a Río y están preparados para robar el Barón y machacar a sus adversarios cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017. \n\nEntrenador: Namhoon ''HooN'' Kim\n","de_DE":"Team WE ist eine chinesische E-Sport-Legende, die so alt ist wie die Zeit selbst. Die E-Sport-Organisation gilt als Pionier auf diesem Gebiet und war für ihre Warcraft- und StarCraft-Mannschaften bekannt, bevor sie 2011 auf League of Legends umstieg. Nach Jahren voller Höhen und Tiefen scheint Team WE 2017 endlich einen guten Rhythmus gefunden zu haben. Dank einer Mischung aus alten Talenten und Neulingen konnte Team WE den Frühjahrs-Split der LPL dominieren und beendete die Gruppenphase mit 12 Siegen bei nur 4 Niederlagen. Doch das war ihnen noch nicht genug. Sie marschierten durch die Entscheidungsspiele und verloren auf dem Weg zum Titel nur ein einziges Spiel. Die Krönung ihrer sensationellen Saison war der 3–0 Sieg über Royal Never Give Up im Finale des Frühjahrs-Splits. Jetzt konzentrieren sie sich ganz auf Rio, wo sie den ein oder anderen Baron stehlen und ihre Gegner aufmischen wollen, wenn sie sich beim Mid-Season Invitational 2017 mit den besten Mannschaften der Welt messen. \n\nTrainer: Namhoon „HooN“ Kim\n","pt_BR":"<p>A história da Team WE nos e-Sports chineses é tão antiga quanto o tempo. Como uma organização pioneira na área de e-Sports, eles já haviam alcançado renome internacional com suas equipes de Warcraft e Starcraft quando fizeram o salto para League of Legends em 2011. Após passar anos intercalando sucessos e fracassos, a Team WE encontrou de vez o seu caminho em 2017. Misturando talentos experientes com novatos promissores, a Team WE dominou a Etapa de Primavera da LPL 2017 com um recorde de 12-4 na fase de grupos. Sem parar por aí, eles logo abriram caminho entre a competição das eliminatórias, perdendo apenas um jogo na sua jornada até a coroa da Etapa de Primavera. A surra de 3-0 que deram na Royal Never Give Up na final colocou um ponto de exclamação na sua já extraordinária temporada. Agora, seu foco está no Rio e eles pretendem roubar Barões e mostrar a que vieram em seus confrontos contra as melhores equipes do mundo no Mid-Season Invitational 2017. </p>\n\n<p>Técnico: Namhoon “HooN” Kim</p>","es_AR":"<p>El Team WE es un cuento de Esports tan viejo como el tiempo. Como una organización pionera de Esports, se volvieron conocidos internacionalmente por sus equipos de Warcraft y Starcraft antes de entrar a LoL en el 2011. Después de años de éxitos y fracasos, el Team WE encontró su ritmo en 2017. Al mezclar talento viejo con nuevo, el Team WE dominó el Torneo de Apertura LPL de 2017 y alcanzó un récord de 12-4 en la fase de grupos. No se detuvieron ahí. En cuanto llegaron a las eliminatorias solo perdieron una partida en su camino a la victoria del Torneo de Apertura. Su aplastante 3-0 en el Royal Never Give Up en las finales fue la cereza del pastel en su temporada. Ahora tienen los ojos puestos en Río y están listos para robar barones y aplastar a sus oponentes cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"1849"},"players":[132,511,516,517,603,692,1038,1428,1991,1992],"starters":[132,516,517,692,1038],"subs":[511,603,1428,1991,1992]},{"id":218,"slug":"i-may","name":"I May","guid":"be7140e4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/i-may-g9vriddl.png","acronym":"IM","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-05-18T20:51:23.000Z","updatedAt":"2017-06-06T23:41:14.000Z","bios":{"en_US":"","de_DE":"<p>I MAY ist ein Name, der Hoffnung ausstrahlt. Und das passt zum Ursprung dieser Mannschaft. IM war ursprünglich die zweite Mannschaft von Edward Gaming in der LSPL – ein bescheidener Anfang für eine Mannschaft, die jetzt zur WM fährt. Die Mannschaft, die damals noch als EDE bekannt war, gewann die LSPL und trat als I MAY beim Sommer-Split der LPL an. Ihr Erfolgslauf setzte sich im Sommer-Split fort und gipfelte in einem 3–2 Sieg über Team WE, mit dem sie sich für die Weltmeisterschaft qualifizierten. IM hat es allen Zweiflern und Kritikern gezeigt, die sich sichern waren, dass sie wegen ihres knappen Aufstiegs in die LPL niemals das höchste spielerische Niveau erreichen würden. Doch IM ließ sich von dieser Einschätzung nicht abschrecken und konnte in den Schlüsselmomenten Siege einfahren. Jetzt fährt die Mannschaft zur größten Bühne von League, um herauszufinden, ob sie mit ihrer verwegenen Art weitere überraschende Siege einfahren können.</p>","es_AR":"<p>I MAY es un nombre que denota esperanza, más que nada si se tiene en cuenta el origen de este equipo. IM comenzó en la LSPL como el segundo equipo de Edward Gaming, y sus comienzos fueron bastante humildes para ser un equipo que esté camino al Mundial. El equipo, conocido como EDE, logró salir del LSPL con un boleto al torneo de clausura de la LPL y bajo el nombre de I MAY. Su maravillosa actuación continuó a lo largo del torneo de clausura y terminó con una victoria por 3-2 contra Team WE y un pase al Campeonato Mundial. IM despejó las dudas de los escépticos y los críticos que sugerían que su casual ascenso a la LPL demostraba que nunca lograrían llegar a los más altos niveles de competición. Sin dejarse llevar por estos comentarios, IM continuó con su perfil bajo y obteniendo victorias en momentos clave. Ahora deberán saborear el escenario más grande de League of Legends y ver si pueden continuar con su audaz empresa de obtener más victorias de estas inesperadas.</p>\n\n<p><strong>Entrenador: Son \"Kezman\" Dae-young</strong></p>","pt_BR":"I MAY, \"eu posso\" em inglês, é um nome que irradia esperança e reflete as origens do time. A IM começou na LSPL com o segundo time da Edward Gaming -- começo humilde para uma equipe que agora vai para o Mundial. A equipe, antes conhecida como EDE, conseguiu sair da LSPL e chegou à Etapa de Verão da LPL como I MAY. Sua jornada de sucesso continuou até a Etapa de Verão, culminando com a classificação para o Mundial com uma vitória por 3 a 2 contra a WE. A IM calou a boca dos críticos e céticos que sugeriam que sua disputada ascensão à LPL era a prova de que eles não conseguiriam chegar aos níveis mais altos da competição. Sem temer essa percepção, a IM manteve a cabeça erguida e continuou vencendo em momentos cruciais. Agora chegou a hora da equipe vivenciar o nível máximo de League e ver se consegue dar continuidade a ousada tendência de abocanhar vitórias surpreendentes."},"foreignIds":{},"players":[293,505,507,974,1051,1278,1643,1983],"starters":[505,507,974,1051,1278],"subs":[293,1643,1983]}],"players":[{"id":132,"slug":"zero","name":"Zero","firstName":"Kyungsub","lastName":"Yun","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zero-bpm8z97p.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:59.000Z","updatedAt":"2017-07-07T22:22:17.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2165","TRLH1":"200000404","TRLH3":"1000205039","TRLT3":"200000232"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":293,"slug":"ff","name":"FF","firstName":"Kui","lastName":"Xie","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ff-db69okzf.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-02-23T00:50:59.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3173"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":505,"slug":"amazingj","name":"AmazingJ","firstName":"Waiho","lastName":"Shek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazingj-9y5n6mpk.png","hometown":"Hong Kong","region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:16.000Z","updatedAt":"2017-06-06T23:41:30.000Z","bios":{"en_US":"","fr_FR":"<p>\nWaiho « AmazingJ » Shek est un féroce invocateur de requins (ou de lamantins). AmazingJ a obtenu un record de 11/1/2 (et de multiples doublés) en jouant Fizz dans son tout premier match, contre Edward Gaming. D'abord engagé comme top laner remplaçant, AmazingJ a réussi une telle performance qu'il a gagné le droit de démontrer son talent dans d'autres parties tout au long de la saison de la LPL 2015. Il est arrivé au bout du segment d'été avec un score de 8 victoires contre 4 défaites. \n</p>","es_ES":"<p>\nWaiho ''AmazingJ'' Shek es un feroz invocador de tiburones (o manatíes). En su debut con Edward Gaming se marcó un 11/1/2 (con varios asesinatos dobles) con Fizz, el Gamberro de las Mareas. Aunque llegó al equipo como suplente, su magnífico rendimiento en las procelosas aguas de la LPL le ha llevado a ser titular varias veces durante la temporada 2015. Terminó el Split de verano con un registro de 8V-4D.\n</p>","pl_PL":"<p>\nWaiho „AmazingJ” Shek jest zaciekłym przywoływaczem rekinów (oraz manatów). AmazingJ osiągnął zachwycający wynik 11/1/2 (a także wiele podwójnych zabójstw), grając Fizzem, Szachrajem Sztormów, podczas swojego debiutanckiego meczu z Edward Gaming. AmazingJ pierwotnie odgrywał rolę zawodnika z górnej alei. Jego pierwszy występ sprawił, że wystąpił jeszcze wielokrotnie podczas LPL 2015. Zakończył letni split z wynikiem ośmiu zwycięstw do czterech porażek. \n</p>","de_DE":"<p>Shek „AmazingJ“ Wai Ho marschiert in seinem eigenen Takt. AmazingJ, der wegen seiner Liebe für einen gewissen patriotischen Demacianer auch „Garen-Bro“ genannt wird, schwor zu Beginn seiner Karriere in der LPL, dass er seine Mannschaft zur Weltmeisterschaft führen würde. Nach dem knappen Einzug in die LPL war das eine ziemlich gewagte Aussage, aber AmazingJ hielt sein Versprechen. Er lieferte bei der regionalen Qualifikationsrunde eine gigantische Leistung gegen World Elite ab, beendete das Spiel mit einer unglaublichen Teleportation und sicherte seiner Mannschaft so einen Platz bei der Weltmeisterschaft. AmazingJ hat allen gezeigt, wie gerne er mit dem Zeitbrecher spielt, und Ekko im Verlauf des Sommer-Splits 10-mal ausgewählt. Aber er kann seine Mannschaft auch mit Irelia tragen oder mit Shen die Karte kontrollieren. Jetzt, wo AmazingJ seine Mannschaft zur Weltmeisterschaft geführt hat, muss er noch besser spielen, um allen zu beweisen, dass I MAY auch gegen die Besten bestehen kann.</p>","pt_BR":"<p>Shek \"AmazingJ\" Wai Ho tem o seu próprio ritmo e tende a se manter nele. Além de ser chamado de \"Mano Garen\" por amar um certo patriota demaciano, AmazingJ iniciou sua carreira na LPL jurando que levaria sua equipe ao Mundial. Foi uma declaração bem ousada para alguém que teve dificuldades em chegar à LPL, mas ele cumpriu sua promessa. Ele jogou as Classificatórias Regionais na raça contra a World Elite, e conseguiu executar um teleporte incrível para encerrar o jogo e se classificar para o Mundial. AmazingJ se mostrou muito confiante com o Rapaz que Estilhaçou o Tempo, usando e abusando de Ekko em dez jogos da Etapa de Verão. Mas ele também consegue jogar com Irelia ou exercer pressão no mapa com Shen. Agora que AmazingJ levou seu time ao Mundial, ele precisa jogar mais do que nunca para provar que a I MAY pode brilhar no ambiente mais competitivo que pode existir.</p>","es_AR":"<p>Shek \"AmazingJ\" Wai Ho marcha al ritmo de su propio tambor. No solo es conocido como el \"hermano de Garen\" por su amor típico de buen patriota demaciano, sino por haber comenzado su carrera en la LPL jurando que llevaría al equipo al Campeonato Mundial. Fue una declaración jugada luego de haber llegado con lo justo a la LPL, pero AmazingJ cumplió con su promesa. Transpiró mucho la camiseta en las clasificatorias regionales contra World Elite, y logró una asombrosa jugada de teleportación para acabar la partida y calificar para el Campeonato Mundial. AmazingJ se ha sentido muy cómodo con el Joven que Fragmentó el Tiempo, y arrasó con Ekko en diez partidas durante el torneo de clausura. De todas formas, también acarrea muy bien con Irelia y aplica presión en el mapa con Shen. Ahora que AmazingJ ha llevado a su equipo al Campeonato Mundial, deberá jugar más duro que nunca para probar que I MAY puede prosperar en el evento más competitivo de todos.</p>"},"foreignIds":{"drupalId":"2083","TRLH3":"1001160042","TRLH4":"1001160042","TRLH1":"1001380045","TRLH2":"1001280015"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":507,"slug":"jinjiao","name":"Jinjiao","firstName":"Jinshan","lastName":"Xie","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jinjiao-djee7q8y.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-06-06T23:40:37.000Z","bios":{"en_US":"","de_DE":"<p>Xie „Jinjiao“ Jin-Shan spielte sowohl in der LSPL als auch in der LPL, bevor er bei I MAY ein neues Zuhause fand. Dieser AD-Carry spielt bevorzugt Jhin und Sivir, die er im Verlauf des Sommer-Splits der LPL 2016 jeweils 12- und 11-mal auswählte. Aber falls der Virtuose und die Kampfmeisterin einmal gebannt werden, kann sich Jinjiao wie jeder andere professionelle AD-Carry anpassen. Er hat in seiner Karriere auch schon mit Ashe, Lucian und einmal sogar mit Kog’Maw gespielt.\nJinjiao ist ein ADC, der von seinem Supporter abhängig ist – er ist dafür bekannt, unglaubliche Schadensmengen auszuteilen, wenn er mit einem defensiven Supporter auf der Lane ist, der ihn unterstützt und ihm riskante Spielzüge ermöglicht. Jetzt, wo Jinjiao in I MAY ein neues Zuhause gefunden hat und mit Road an seiner Seite zur Weltmeisterschaft fährt, sind alle Siegesbedingungen erfüllt.</p>","es_AR":"<p>Xie \"Jinjiao\" Jin-Shan jugó tanto en la LSPL como en la LPL antes de encontrar su hogar en el plantel de I MAY. Este ADC se inclina por Jhin y Sivir, con los que jugó en 12 y 11 partidas respectivamente durante el torneo de clausura de la LPL 2016. Pero al igual que otros ADC profesionales, si le sacas a el Virtuoso y la Señora de la Batalla, Jinjiao se adapta igual. Ha jugado con Ashe y Lucian, y hasta usó a Kog’Maw en algunas partidas durante su carrera.</p>\n\n<p>Jinjiao es un ADC que vive exclusivamente de su soporte. Es conocido por infligir una enorme cantidad de daño cuando se lo pone a la par de un soporte defensivo que pueda cubrirlo y permitirle hacer sus jugadas riesgosas. Ahora que Jinjiao ha encontrado su hogar en I MAY y se dirige al Campeonato Mundial con su soporte Road, puede decirse que ha logrado la condición de ganador.</p>","pt_BR":"<p>Xie \"Jinjiao\" Jin-Shan já jogou na LSPL e na LPL, e encontrou um lar no elenco da I MAY. Esse Atirador prefere Jhin e Sivir e jogou com eles em 12 e 11 jogos respectivamente na Etapa de Verão de 2016 da LPL. Mas como vários outros Atiradores profissionais, se o Virtuoso e a Mestra da Batalha não estiverem disponíveis, Jinjiao se adapta. Ele já jogou com Ashe e Lucian, e até já se aventurou com Kog’Maw em alguns jogos da sua carreira.</p>\n\n<p>Jinjiao é um Atirador que vive e morre ao lado do seu suporte - ele é conhecido por causar uma quantidade de dano impressionante quando joga em parceria com um suporte defensivo que o proteja e possibilite suas jogadas arriscadas. Agora que Jinjiao encontrou seu lar na I MAY e está a caminho do Mundial com Road como suporte, ele finalmente está em condições de vencer.</p>"},"foreignIds":{"drupalId":"4215","TRLH1":"1001380048","TRLH2":"1001280018"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":511,"slug":"conan","name":"conan","firstName":"Yi","lastName":"Ke","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/conan-hcob1n8b.png","hometown":"Tianmen, China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-05-09T23:21:19.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2079","TRLH1":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":516,"slug":"xiye","name":"xiye","firstName":"Hanwei","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiye-4520r7ee.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:43.000Z","bios":{"en_US":"<p>Hanwei “xiye” Su is the model student for consistency in the mid lane. He joined up with the WE organization in 2013 as part of their developmental squad but was promoted in early 2015 to their main roster as the starting mid laner. His consistency across a variety of play styles has become his calling card in the LPL. Need a mage that can lock down and annihilate squishy targets? Check, xiye has got you covered. What about an assassin that can dice the enemy team down to size? No problem.</p>\n\n<p>Xiye’s steady performances combined with an ocean deep champion pool means that the enemy never quite knows what composition Team WE could build -- this makes prepping to play against xiye a nightmare. Without an easy way to ban him out, xiye can easily meld his play to whatever mid laner is required. He’ll be the rock that Team WE rely on as they step up their game at the 2017 Mid-Season Invitational in Rio. </p>","de_DE":"Hanwei „xiye“ Su ist das perfekte Beispiel für Beständigkeit auf der mittleren Lane. Er wechselte im Jahr 2013 zu WE und spielte in deren Entwicklungsmannschaft, wurde Anfang 2015 aber zum Mid-Laner der Hauptmannschaft gemacht. Durch seine Beständigkeit und seine unterschiedlichen Spielstile machte er sich schnell einen Namen in der LPL. Brauchst du einen Magier, der verletzliche Ziele jagen und vernichten kann? Kein Problem, xiye ist genau der Richtige dafür. Wie wäre es mit einem Assassinen, der die gegnerische Mannschaft in Stück reißt? Auch kein Problem. Dank xiyes konstanten Leistungen und seines umfangreichen Championpools wissen seine Gegner nie genau, was sie erwartet, und dadurch wird es unglaublich schwer, sich auf xiye vorzubereiten. Es ist schwierig, xiye mit Bannen zu schwächen, denn er kann auf der mittleren Lane so gut wie jeden Champion spielen. In Rio wird er Team WEs Fels in der Brandung sein, wenn sich die Mannschaft für das Mid-Season Invitational 2017 bereit macht. ","es_ES":"Hanwei ''xiye'' Su es el alumno modelo en términos de estabilidad en la calle central. Se unió a la organización de WE en 2013 como parte de su grupo en desarrollo, pero ascendió al principio de 2015 a la plantilla principal como mid titular. Sus resultados positivos con diversos estilos de juego se han convertido en su tarjeta de presentación en la LPL. ¿Su equipo necesita un mago que pueda inmovilizar y aniquilar a los objetivos más débiles? Sin problema, para eso está xiye. ¿Y si conviene más jugar con un asesino que pueda trocear al equipo enemigo? Todo controlado. El desempeño estable de xiye combinado con su gran repertorio de campeones hacen que el equipo enemigo casi nunca pueda prever cuál será la composición de Team WE (eso provoca que prepararse para jugar contra xiye sea toda una pesadilla). Como bloquear su selecciones no es tarea fácil, xiye puede adaptar sin problema su estilo de juego según el mid que mejor encaje. Team WE confiará en sus habilidades cuando se suban al escenario del Mid-Season Invitational 2017 en Río. ","pl_PL":"Hanwei „xiye” Su daje wzór konsekwentnej gry na środkowej alei. Dołączył do organizacji WE w 2013 roku jako część składu rozwojowego, a na początku 2015 roku został awansowany do głównego składu jako pierwszy środkowy. Umiejętna gra różnymi stylami stała się jego wyróżnikiem w LPL. Potrzebny jest mag, który umie blokować i anihilować delikatne cel? Jasne, xiye załatwi sprawę. A co z zabójcą, który potrafi ukrócić zapędy wrogiej drużyny? Żaden problem. Spójne występy xiye w połączeniu z rozległą jak ocean pulą bohaterów oznaczają, że wróg nigdy nie wie, jaką kompozycję wybierze Team WE — a to sprawia, że przygotowanie do gry przeciwko xiye jest koszmarem. Ponieważ nie ma łatwego sposobu, by go zbanować, xiye może szybko dostosować swoją grę do stylu wymaganego w danej sytuacji od środkowego. Jest opoką, na której wesprą się Team WE, by pokazać, na co ich stać na Mid-Season Invitational 2017 w Rio. ","pt_BR":"<p>Hanwei “xiye” Su é o modelo de consistência na rota do meio. Ele entrou para a organização WE em 2013 como parte da sua equipe em formação, mas foi promovido no início de 2015 à sua seleção principal para jogar na rota do meio. Sua consistência em vários estilos de jogo se tornou seu principal trunfo na LPL. Precisam de um mago que imobilize e acabe com alvos frágeis? Pode deixar, o xiye dá conta. E que tal um assassino que possa dar uma podada na equipe inimiga? Sem problema.</p> \n\n<p>Os desempenhos estáveis de xiye e o seu impressionante leque de Campeões fazem com que seus oponentes jamais saibam que composição a Team WE vai montar, o que é um verdadeiro pesadelo para quem precisa se preparar para enfrentá-lo. Sem uma maneira fácil de banir suas principais escolhas, xiye pode facilmente adequar seu estilo de jogo ao de qualquer Campeão da rota do meio que seja necessário. Ele será o alicerce em que a Team WE se apoiará para avançar no Mid-Season Invitational 2017 no Rio. </p>","es_AR":"<p><strong>Hanwei \"xiye\" Su</strong> es la imagen de la coherencia en el carril central. Se unió a la organización WE en 2013 como parte de su escuadrón de desarrollo, pero fue ascendido a inicios de 2015 a su arsenal principal como su carrilero central principal. Su coherencia a lo largo de una variedad de estilos de juego se convirtió en su marco en el LPL. ¿Necesitas a un mago que atrape y aniquile a los objetivos aplastables? Bueno, <strong>xiye</strong> se encarga. ¿Qué hay de un asesino que reduzca a la mitad al equipo enemigo? No hay problema. El desempeño estable de <strong>xiye</strong>, combinado con una profunda agrupación de campeones significa que el enemigo nunca sabe cuál será la composición del Team WE. Esto hace que prepararse para pelear contra <strong>xiye</strong> sea una pesadilla. Sin una forma sencilla de eliminarlo, <strong>xiye</strong> puede adaptarse con facilidad a lo que el carrilero central necesite. Será la roca sobre la cual se base el Team WE cuando se preparen para el Mid-Season Invitational 2017 en Río.</p>"},"foreignIds":{"drupalId":"3186","TRLH1":"200000402","TRLH2":"200000302","TRLT3":"200000230"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":517,"slug":"mystic","name":"Mystic","firstName":"Seongjun","lastName":"Jin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mystic-cktg9mzr.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:57.000Z","bios":{"en_US":"<p>Seongjun “Mystic” Jin started his professional career in his native South Korea with the Jin Air Stealths in 2013. Near the tail-end of 2014 he decided to make the move to China and Team WE Academy. It was here that he made the perilous switch from jungle to AD carry. He acclimated quickly to the new role and Team WE took notice. They promoted Mystic to their roster as a sub and not long after he was promoted yet again to their starting AD carry position where he’s been since the spring of 2015.</p>\n\n<p>He’s comfortable on a variety of champions, from the initiation of Ashe’s Crystal Arrow to the raw carry potential of Piltover’s finest, Caitlyn -- Mystic can play it all. Team WE will rely on his versatility when they come face-to-face with some of the Rift’s most feared bot lane duos at the 2017 Mid-Season Invitational.</p>","pl_PL":"Seongjun „Mystic” Jin zaczął profesjonalną karierę w ojczystej Korei Południowej z Jin Air Stealths w 2013 roku. Pod sam koniec 2014 roku zdecydował się przeprowadzić do Chin i drużyny Team WE Academy. Tam dokonał ryzykownego przejścia z dżungli do roli prowadzącego. Szybko zaaklimatyzował się na nowej pozycji, a Team WE to zauważyli. Dołączyli Mystica do swojego składu jako rezerwowego, a niedługo później ponownie awansowali na pozycję prowadzącego w pierwszym składzie, którą zajmuje od wiosny 2015 roku. Dobrze sobie radzi z różnorakimi bohaterami od inicjującej Kryształowej Strzały Ashe po potencjalnie prowadzącą sławę z Piltover, Caitlyn — Mystic potrafi grać wszystkimi. Team WE będą polegali na jego wszechstronności, gdy staną twarzą w twarz z kilkoma z najgroźniejszych duetów dolnej alei Summoner’s Rift podczas Mid-Season Invitational 2017.","es_ES":"Seongjun ''Mystic'' Jin comenzó su trayectoria profesional en su Corea del Sur natal con Jin Air Stealths en 2013. Al final de 2014, decidió trasladarse a China para formar parte de Team WE Academy. Fue en ese momento cuando hizo un arriesgado cambio de rol: de jungla a AD carry. No tardaría en adaptarse a su nueva posición, y Team WE lo tuvo en cuenta. Lo ascendieron a su plantilla principal como suplente y, poco después, pasaría a ser AD carry titular, posición que ha ocupado desde la primavera de 2015. Se siente cómodo con una gran variedad de campeones: desde la capacidad de iniciación de la Flecha de cristal de Ashe, al potencial para dominar la partida de la sheriff más sofisticada de Piltover, Caitlyn. Mystic es capaz de jugar con cualquier campeón. Team WE confiará en su versatilidad cuando se enfrenten cara a cara contra algunos de los dúos de bot más temidos de la Grieta en el Mid-Season Invitational 2017.","de_DE":"Seongjun „Mystic“ Jin begann seine professionelle Karriere 2013 in seiner Heimat, Südkorea, bei Jin Air Stealths. Gegen Ende des Jahres 2014 entschied er sich aber, nach China zu Team WE Academy zu wechseln. Dort wechselte er auch aus dem Dschungel auf die untere Lane, um dort als AD-Carry zu spielen. Er fand sich schnell in seine neue Rolle ein und machte so Team WE auf sich aufmerksam. Sie nahmen Mystic als Ersatzspieler in ihre Aufstellung auf und machten ihn im Frühjahr 2015 zum Haupt-AD-Carry. Er kommt mit vielen Champions zurecht: Von Ashes Kristallpfeil bis zur brutalen Schadensmaschine aus Piltover, Caitlyn – Mystic kann alles spielen. Team WE wird seine Vielseitigkeit brauchen, wenn sie es beim Mid-Season Invitational 2017 mit den gefürchtetsten Duos auf der unteren Lane zu tun bekommen.v","pt_BR":"<p>Seongjun “Mystic” Jin começou sua carreira profissional na Coreia do Sul, sua terra natal, com a Jin Air Stealths em 2013. Perto do fim de 2014, ele decidiu se mudar para a China e entrou para a Team WE Academy. Foi lá que ele fez a arriscada mudança de caçador para atirador. Ele se acostumou rapidamente à nova função, chamando a atenção da Team WE. Eles então promoveram Mystic à sua seleção como reserva e, pouco tempo depois, ele foi novamente promovido para a posição de atirador principal, que ocupa desde a metade inicial de 2015.</p>\n\n<p>Ele joga com diversos Campeões, sentindo-se confortável tanto com a iniciação da Flecha de Cristal da Ashe quanto com o potencial de carregar partidas da defensora de Piltover, Caitlyn. Mystic é a versatilidade em pessoa. A Team WE vai depender do grande repertório dele quando ficar cara a cara com algumas das duplas da rota inferior mais temidas do Rift no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Seongjun \"Mystic\" Jin</strong> comenzó su carrera profesional en su Corea del Sur nativa con los Jin Air Stealths en 2013. Cerca de finales de 2014 decidió mudarse a China y entrar a la academia del Team WE. Aquí hizo el peligroso cambio de junglero a tirador. Se acostumbró rápidamente al nuevo rol y el Team WE lo notó. Ascendieron a <strong>Mystic</strong> a su arsenal como suplente y no mucho después fue ascendido nuevamente a tirador principal, puesto en el cual ha permanecido desde la primavera de 2015. Se siente cómodo con una variedad de campeones, desde la iniciación de la Flecha de Cristal de Ashe, hasta el potencial de acarreador de la mejor de Piltóver: Caitlyn. <strong>Mystic</strong> puede jugar con todos. El Team WE confía en su versatilidad cuando se enfrenten a los dúos de carril inferior más temidos de la Grieta en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"994","TRLH1":"200000403","TRLH2":"200000303","TRLT3":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":603,"slug":"raison","name":"Raison","firstName":"Soobeen","lastName":"Jeong","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/raison-9vqm9g4s.png","hometown":"","region":"LMS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-09T23:20:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4366","TRLH1":"200000405"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":692,"slug":"condi","name":"Condi","firstName":"Renjie","lastName":"Xiang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/condi-9gseaajf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-07-07T18:00:19.000Z","bios":{"en_US":"<p>Renjie “Condi” Xiang is China’s resident Baron steal specialist, stealing more of the purple monster’s powers than any other jungler in the LPL since 2015. Since joining Team WE, Condi has been instrumental to their success. His in-your-face style, counter-jungling prowess, and potent dueling make him one of the most fearsome players on the Rift. With his aggressive style, he tends to favor dueling champions like Graves, Lee Sin, and Rek’Sai.</p>\n\n<p>Condi was instrumental in Team WE’s dismantling of Royals Never Give Up in the 2017 LPL Spring Split Finals. He consistently sliced through the enemy frontline and deleted the enemy damage dealers, turning even fights into blowouts. After the match, a tearful Condi couldn’t find any words except “I am so grateful to my teammates!” Let’s hope we see the same type of emotion and dominance as Condi travels to Rio to take on the world’s best at the 2017 Mid-Season Invitational.</p>","pl_PL":"Renjie „Condi” Xiang to chiński specjalista od wykradania Baronów. Skradł więcej mocy purpurowego potwora niż jakikolwiek inny dżungler w LPL od 2015 roku. Odkąd dołączył do Team WE, Condi stał się motorem sukcesu drużyny. Jego bezpośredni styl gry, sprawność w kontrowaniu dżunglowania i świetne umiejętności pojedynkowe sprawiają, że jest jednym z najgroźniejszych graczy na Summoner’s Rift. Ze względu na swój agresywny styl najchętniej wybiera pojedynkujących się bohaterów, takich jak Graves, Lee Sin i Rek’Sai. Condi odegrał główną rolę w rozbiciu przez Team WE drużyny Royal Never Give Up w finale wiosennego splitu LPL 2017. Regularnie przebijał się przez wrogą linię frontu i kasował zadających obrażenia przeciwników, zmieniając wyrównane walki w prawdziwą rzeź. Po meczu Condi ze łzami w oczach nie potrafił znaleźć innych słów niż: „Jestem tak bardzo wdzięczny moim kolegom z drużyny!”. Mamy nadzieję zobaczyć podobne emocje i dominację, gdy Condi wyruszy do Rio, by walczyć z najlepszymi na świecie podczas Mid-Season Invitational 2017.","es_ES":"Renjie ''Condi'' Xiang es el ladrón de Barones chino por excelencia, pues ha conseguido robar los efectos del monstruo morado más que ningún otro jungla de la LPL desde 2015. Desde que se unió a Team WE, Condi ha sido fundamental para el éxito del equipo. Su estilo enérgico, su habilidad para robar la jungla enemiga y su potente capacidad para batirse en duelo lo convierten en uno de los jugadores más temidos de la Grieta. Como su estilo es agresivo, suele optar por campeones capaces de batirse en duelo como Graves, Lee Sin o Rek'Sai. Condi fue una pieza clave para la victoria de Team WE contra Royal Never Give Up en la final del split de primavera de la LPL 2017. Consiguió de forma sistemática ignorar al frente enemigo y aplastar a sus campeones de daño, cambiando las tornas del combate a su favor. Tras la partida, con lágrimas en los ojos, Condi solo pudo articular las siguientes palabras: ''¡Les doy gracias infinitas a mis compañeros de equipo!''. Esperamos que se muestre igual de emocionado y dominante cuando viaje a Río para derrotar a los mejores del mundo en el Mid-Season Invitational 2017.","de_DE":"Renjie „Condi“ Xiang ist Chinas Experte, wenn es um das Stehlen von Barons geht (seit 2015 hat er sich die Kräfte des violetten Monsters häufiger zunutze gemacht, als alle anderen Jungler in der LPL)  Seit seinem Wechsel zu Team WE ist Condi für den Erfolg der Mannschaft unerlässlich. Sein aggressiver Stil, seine Stärke im gegnerischen Dschungel und seine Entscheidungen in Duellen machen ihn zu einem der gefährlichsten Spieler in der Kluft. Durch seine Aggressivität bevorzugt er Champions wie Graves, Lee Sin und Rek’Sai. Condi war maßgeblich daran beteiligt, dass Team WE Royal Never Give Up im Finale des Frühjahrs-Splits der LPL 2017 vernichten konnte. Er kämpfte sich immer wieder durch die Frontlinie seiner Gegner, vernichtete die feindlichen Carrys und machte aus ausgeglichenen Kämpfen Gemetzel. Das Einzige, was der überwältigte Condi nach dem Spiel sagen konnte war: „Ich bin meinen Mannschaftskameraden so dankbar!“ Hoffentlich sehen wir auch beim Mid-Season Invitational 2017 so viel Emotion und Dominanz, wo es Condi mit den Besten der Welt zu tun bekommt.","pt_BR":"<p>Renjie “Condi” Xiang é o especialista em roubos de Barão na China, tendo roubado o poder do monstro roxo mais vezes do que qualquer outro caçador da selva na LPL desde 2015. Desde que entrou para a Team WE, Condi tem sido crucial para o seu sucesso. Seu estilo de partir para cima, sua proeza em invasões da selva e seu forte desempenho em duelos fazem dele um dos jogadores mais temíveis no Rift. Com seu estilo agressivo, ele costuma preferir Campeões como Graves, Lee Sin e Rek’Sai. </p>\n\n<p>Condi foi fundamental para o desmantelamento da Royal Never Give Up por parte da Team WE na final da Etapa de Primavera da LPL 2017. Ele consistentemente rasgava a linha de frente inimiga e destruía os causadores de dano, transformando lutas equilibradas em vitórias unilaterais. Depois da partida, com lágrimas nos olhos, Condi conseguiu dizer apenas: “Sou muito grato aos meus companheiros de equipe!” Vamos torcer para ver o mesmo tipo de emoção e dominação agora que Condi viaja ao Rio para enfrentar os melhores do mundo no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Renjie “Condi” Xiang</strong> es el experto en robos de Barón de China, logra robar más de los poderes del monstruo morado que ningún otro junglero en el LPL desde 2015. Desde que se unió al Team WE, <strong>Condi</strong> ha sido clave para su éxito. Tiene un estilo de juego provocativo, destreza para el contrajungleo y es un duelista muy fuerte, lo que lo hace uno de los jugadores más atemorizantes de la Grieta. Con su estilo agresivo tiende a favorecer a los campeones duelistas como Graves, Lee Sin y Rek’Sai. Condi fue clave para el desmantelamiento de los Royal Never Give Up en manos del Team WE en las finales del 2017 del Torneo de Apertura LPL. Abrió la línea frontal del enemigo constantemente y eliminó a todos los enemigos que infligían daño para convertir las peleas justas en palizas. Después de la partida, <strong>Condi</strong> estaba lleno de lágrimas y no podía decir otra cosa más que: <i>\"¡Estoy tan agradecido con mis compañeros!\"</i> Esperamos ver el mismo tipo de emoción y dominio mientras <strong>Condi</strong> viaja a Río para participar en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"4218","TRLH1":"200000401","TRLH2":"200000301","TRLT3":"200000229"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":974,"slug":"athena","name":"Athena","firstName":"Ha-woon","lastName":"Kang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/athena-2yuxd9y6.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T20:39:28.000Z","updatedAt":"2017-06-06T23:34:39.000Z","bios":{"en_US":"","de_DE":"<p>Athena ist dank seiner Zeit bei der koreanischen Mannschaft Ever einer der bekanntesten Spieler bei I MAY. Nach der Weltmeisterschaft in Saison 5 setzte Ever mit einem 2–0 Sieg beim LoL KeSPA Cup 2015 über SKTelecom T1 ein Ausrufezeichen und konnte am Ende mit einem 3–0 Sieg über CJ Entus sogar den Titel gewinnen. Doch nach diesem Erfolg verschwand Athena aus dem Rampenlicht. Für manche Fans war er eher Pawns Ersatz als ein eigenständiger Spieler. Aber dann heuerte er bei I MAY an.</p>\n\n<p>Athena war eine Schlüsselfigur beim kometenhaften Aufstieg der Mannschaft, die es in einem Split von der LSPL zur Weltmeisterschaft geschafft hatte. Er agiert lieber aus den hinteren Reihen, anstatt mit Assassinen oder robusten Champions in die Schlacht zu ziehen. Athena wird versuchen, allen zu beweisen, dass er ein eigenständiger Mid-Laner ist, der sich nicht in Pawns Schatten verstecken muss. Er ist einer der Veteranen in der Mannschaft und er weiß genau, wie hart es wird – aber er ist gerüstet und bereit, seinen Wert auf der größten Bühne der Welt unter Beweis zu stellen.</p>","es_AR":"<p>Athena es uno de los jugadores más conocidos del equipo de novatos de I MAY, gracias a su paso por el equipo coreano Ever. Después del Campeonato Mundial de la temporada 5, Ever pasó a la historia al derrotar a SKTelecom T1 por 2-0 en la Copa KeSPA de LoL en el 2015, para luego llevarse el campeonato entero con una victoria por 3-0 ante CJ Entus. Desde ese éxito inicial, Athena pasó a tener una presencia débil. Algunos simpatizantes lo veían más como un sustituto de Pawn que como un jugador hecho y derecho. Hasta que se unió a I MAY.</p>\n\n<p>Athena fue fundamental en el ascenso astronómico del equipo de la LSPL al Campeonato Mundial en un solo torneo. Se lo conoce mucho por su contribución desde la retaguardia, lanzando hechizos con campeones de golpes en lugar de dirigirse a la escaramuza con personajes asesinos o tanques. Athena intentará probar que es un carrilero central digno de ver, y no solo un rostro opacado por la figura de Pawn. Como uno de los veteranos del equipo, sabe lo dura que será lucha, pero, aún así, está preparado y listo para probar su valía en el escenario mundial.</p>","pt_BR":"<p>Athena é um dos jogadores mais conhecidos do elenco de calouros da I May, graças à sua equipe coreana, Ever. Depois do Campeonato Mundial de 2015, a Ever deixou sua marca ao derrotar a SKTelecom T1 por 2 a 0 na KeSPA Cup 2015, para no final levar o campeonato com uma vitória de 3 a 0 sobre a CJ Entus. Depois daquele sucesso inicial, Athena caiu no esquecimento. Alguns torcedores o viam mais como o substituto de Pawn do que como um jogador com méritos próprios. Foi aí que ele entrou na I MAY.</p>\n\n<p>Athena foi essencial para a ascensão meteórica da equipe, que saiu da LSPL para o Mundial em apenas uma Etapa. Ele é conhecido por suas contribuições na retaguarda, lançando feitiços em campeões de assalto em vez de entrar na briga com assassinos ou tanques. Athena tentará provar que ele é um jogador de meio que vale a pena ser observado, e não só um rostinho colado à sombra de Pawn. Como um dos veteranos da equipe, ele sabe que vai ser muito difícil - mas ele também está preparado e ponto para provar seu valor no palco mundial.</p>"},"foreignIds":{"TRLH1":"1001380047","TRLH2":"1001280017"},"socialNetworks":{},"champions":[{"id":213,"playerId":974,"championId":268,"championKey":"Azir","championName":"Azir","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":214,"playerId":974,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":215,"playerId":974,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"}],"liveGameTeam":218},{"id":1038,"slug":"957","name":"957","firstName":"Changyu","lastName":"Ke","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/957-fcqbzhtx.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:09.000Z","updatedAt":"2017-07-07T17:52:32.000Z","bios":{"en_US":"<p>Changyu “957” Ke kicked off his career in 2015 as the starting top laner for Team WE’s developmental squad, Team WE Future. It was there that he established himself as a reliable option and as his repertoire grew, his sister team began to take notice. In early 2016, 957 made the jump to Team WE’s LPL squad where he made an immediate difference. His steady, low maintenance play on stalwarts like Maokai, Poppy, and Nautilus provided Team WE with a dependable presence in the top lane.</p>\n\n<p>He requires notoriously low resources in game, freeing up his teammates to farm gold and kills to their heart’s content. He doesn’t mind though, because once opponents come up against him late game, chances are that he’s already an unkillable mega tank. 957’s consistency will truly be tested as he heads to Rio to clash with the best top laners the world has to offer at the 2017 Mid-Season Invitational.</p>","de_DE":"Changyu „957“ Ke begann seine Karriere 2015 als Top-Laner für die Entwicklungsmannschaft von Team WE, Team WE Future. Dort konnte er sich als verlässliche Option etablieren und als er sich weiter steigerte, wurde seine Schwestermannschaft auf ihn aufmerksam. Anfang des Jahres 2016 wechselte 957 schließlich zu Team WE in die LPL, wo er sofort einen Unterschied ausmachte. Seine stabilen Leistungen mit Champions wie Maokai, Poppy und Nautilus verliehen Team WE eine verlässliche Präsenz auf der oberen Lane. Er benötigt nur sehr wenige Ressourcen und überlässt das Gold und die Tötungen seinen Mannschaftskameraden. Aber das stört ihn nicht, denn wenn die Gegner ihm im späten Spiel zu Leibe rücken, ist er in der Regel bereits ein unsterblicher Mega-Tank. Beim Mid-Season Invitational 2017 in Rio wird 957s Beständigkeit auf die Probe gestellt, wenn er es mit den besten Top-Lanern der Welt zu tun bekommt.","es_ES":"Changyu ''957'' Ke comenzó su trayectoria en 2015 como top titular del grupo en desarrollo de Team WE, Team WE Future. A partir de entonces, demostró ser una opción fiable y, a medida que él fue aumentando su repertorio de campeones, el equipo hermano de Team WE comenzó a hacerse notar. A comienzos de 2016, 957 se unió al grupo de la LPL de Team WE y no tardaría en marcar la diferencia. Su estilo de juego estable y de bajo mantenimiento, con campeones resistentes como Maokai, Poppy y Nautilus, aportó a Team WE una presencia de fiar en la calle superior. Necesita muy pocos recursos durante la partida, lo que permite que sus compañeros de equipo puedan farmear y llevarse asesinatos libremente. Y eso no es algo que le afecte, pues cuando los oponentes intenten enfrentarse a él al final de la partida, es probable que ya sea un megatanque inmortal. La estabilidad de 957 será puesta a prueba en Río cuando se enfrente a los mejores jugadores de la calle superior del mundo en el Mid-Season Invitational 2017.","fr_FR":"Changyu „957” Ke rozpoczął karierę w 2015 roku jako główny górny rozwojowego składu Team WE, Team WE Future. Tam pokazał, że jest solidnym zawodnikiem i gdy rozszerzył swój repertuar, siostrzana drużyna zaczęła na niego zwracać uwagę. Na początku 2016 roku 957 przeszedł do występującego w LPL składu Team WE i osiągnięcia drużyny natychmiast się poprawiły. Jego równa, zużywająca niewiele zasobów gra podporami drużyny, takimi jak Maokai, Poppy i Nautilus, zapewniła Team WE stałą obecność na górnej alei. 957 w dalszym ciągu zużywa niewiele zasobów w grze, umożliwiając kolegom farmienie złota i zabójstw, ile dusza zapragnie. Nie przeszkadza mu to wcale, ponieważ gdy przeciwnicy ruszą przeciwko niemu w późnej fazie gry, są duże szanse na to, że będzie już wtedy niemożliwym do zabicia megaobrońcą. Konsekwentny styl gry 957 zostanie poddany prawdziwej próbie, gdy zawodnik pojedzie do Rio, by zetrzeć się z najlepszymi górnymi, jakich ma do zaoferowania świat, na Mid-Season Invitational 2017.","pt_BR":"<p>Changyu “957” Ke começou sua carreira em 2015 como o jogador da rota superior da equipe de formação da Team WE, a Team WE Future. Foi lá que ele se estabeleceu como uma opção confiável, e à medida que seu repertório cresceu, sua equipe irmã começou a prestar atenção nele. No início de 2016, 957 foi transferido para a equipe da LPL da Team WE, onde logo de cara fez a diferença. Seu desempenho estável e econômico com Campeões como Maokai, Poppy e Nautilus fez dele uma presença sustentadora para a Team WE na rota superior. </p><p>Ele consome pouquíssimos recursos no jogo, permitindo que seus companheiros de equipe coletem ouro e abates à vontade. E ele não se importa, porque quando seus oponentes o enfrentam nos estágios mais avançados do jogo, ele geralmente já virou um mega tanque simplesmente invencível. A consistência de 957 será colocada à prova em seu rumo ao Rio, onde ele enfrentará os melhores jogadores da rota superior que o mundo tem a oferecer no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Changyu \"957\" Ke</strong> comenzó su carrera en 2015 como el carrilero superior del escuadrón en desarrollo del Team WE, el Team WE Future. Ahí se estableció como una opción confiable y mientras su repertorio crecía su equipo hermano comenzó a notarlo. A principios del 2016, <strong>957</strong> pasó al escuadrón LPL del Team WE, en donde hizo una diferencia inmediatamente. Su juego firme, pero de bajo mantenimiento con opciones fuertes como Maokai, Poppy y Nautilus brindan al Team WE una presencia confiable en el carril superior. Él necesita recursos increíblemente bajos en una partida, lo que permite que sus compañeros coleccionen oro y asesinatos como les apetezca. No le molesta porque cuando los oponentes lo enfrentan en el juego tardío, es probable que ya sea un megatanque inmortal. La coherencia de <strong>957</strong> será puesta a prueba mientras se dirige hacia Río para enfrentarse con los mejores carrileros superiores del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000400","TRLH2":"200000300","TRLT3":"200000228"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1051,"slug":"flawless","name":"Flawless","firstName":"Yeon-joon","lastName":"Seong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flawless-5i9ua7sb.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:20:35.000Z","updatedAt":"2017-02-23T00:52:00.000Z","bios":{},"foreignIds":{"TRKR1":"225085"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1278,"slug":"road","name":"Road","firstName":"Hankil","lastName":"Yoon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/road-hcih3cbd.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:27:35.000Z","updatedAt":"2017-06-06T23:42:38.000Z","bios":{"en_US":"","de_DE":"<p>Ein paar der legendärsten Supporter in League fahren zur Weltmeisterschaft 2016 und Yun „Road“ Han-gi ist gleich in seinem ersten Jahr mit dabei. Und er hofft immer noch, dass er sich einen Namen machen kann. Road hat sich an Jinjiao, den erfahreneren Spieler auf seiner Lane, angepasst und sich zu einem defensiven Supporter entwickelt, der seinem ADC immer den Rücken freihält. Road, der bei den Fans nach der überraschenden Auswahl von Leona während des Mid-Season Invitational noch beliebter geworden sein dürfte, spielt am liebsten den strahlenden Sonnenaufgang sowie Thresh und Braum. \nAber egal, welchen Champion Road auswählt, er hat eine schwierige Aufgabe vor sich. Er ist immer noch ein Anfänger und fährt mit einer Mannschaft, die sich gerade erst für die LPL qualifizieren konnte, zur Weltmeisterschaft. Sein Name war niemals passender, dann er ist kurz davor, den wichtigsten Weg seines Lebens anzutreten.</p>","es_AR":"<p>Algunos de los soportes más legendarios de League of Legends se dirigen al Campeonato Mundial 2016, y Yun \"Road\" Han-gi se les unirá en su torneo de novatos. En esta ocasión, espera hacer historia. Road ha sabido complementarse con el jugador más experimentado del carril, Jinjiao, y se ha convertido en un soporte defensivo que siempre cuenta con un ADC que lo cubre. Los simpatizantes que lo vitorearon ante su sorpresiva elección de Leona en el Torneo por Invitación de Mitad de Temporada comienzan a identificarse con él. Se lo conoce más por inclinarse por el Radiante Amanecer, como también Thresh y Braum.</p>\n\n<p>Sin importar el campeón que elija, Road tiene un duro camino por delante. Sigue siendo un novato que va al Campeonato Mundial con un equipo que simplemente clasificó para la LPL. Su nombre no podría ser más adecuado, ya que este será el recorrido más importante en toda su carrera.</p>","pt_BR":"<p>Alguns dos suportes mais lendários de League estarão no Mundial 2016 e Yun \"Road\" Han-gi estará junto a eles em sua Etapa de estreia. E ele espera conseguir deixar sua marca. Road aprendeu a se entrosar com o jogador mais experiente da sua rota, Jinjiao, e se tornou um suporte defensivo que está sempre preparado para proteger seu Atirador. Os torcedores que gostaram a escolha surpresa de Leona no MSI vão gostar de Road; ele é conhecido por preferir a Alvorada Radiante, bem como Thresh e Braum.</p>\n \n<p>Não importa que campeão ele escolha, Road tem um caminho difícil pela frente. Ele ainda é um calouro indo para o Mundial com uma equipe que acabou de se classificar para a LPL. Seu nome nunca foi tão oportuno, pois esse é o caminho mais importante que ele já trilhou.</p>"},"foreignIds":{"TRLH1":"1001380049","TRLH2":"1001280019"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1428,"slug":"ben","name":"Ben","firstName":"Donghyun","lastName":"Nam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben-1yppxrjt.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:25:24.000Z","updatedAt":"2017-07-07T22:23:11.000Z","bios":{"en_US":"<p>Donghyun “Ben” Nam started his professional career in the summer of 2016 when he was signed by Invictus Gaming. He unfortunately didn’t have many chances to showcase his talent when he was with Invictus, but since joining Team WE in late 2016, he’s been able to show glimpses of his mechanical prowess on the Rift. He was largely unknown before joining up with Team WE, but the LPL has been abuzz with his name ever since.</p>\n\n<p>It took him awhile to sync up with lane mate Mystic, but with his mechanical ceiling many fans are clamoring for more from him. After helping his team sweep Royal Never Give Up in the finals, Ben has the chance to show the world how supports can carry games. He’s looking to shine as he squares off against international competition for the first time at the 2017 Mid-Season Invitational.</p>","de_DE":"Donghyun „Ben“ Nam begann seine professionelle Karriere im Sommer 2016, als er bei Invictus Gaming unterschrieb. Leider konnte er bei Invictus sein Talent nur selten unter Beweis stellen, aber seit seinem Wechsel zu Team WE Ende 2016 stellte er immer wieder sein mechanisches Können unter Beweis. Vor seinem Wechsel zu Team WE war er noch Großteils unbekannt, aber seither kennt die ganze LPL seinen Namen. Es hat eine Weile gedauert, bis er sich auf seinen Lane-Partner Mystic eingestellt hatte, aber aufgrund seines mechanischen Könnens erwarten viele Fans noch mehr von ihm. Nachdem er seiner Mannschaft im Finale des Frühjahrs-Splits der LPL geholfen hat, mit Royal Never Give Up den Boden aufzuwischen, bekommt Ben jetzt die Chance, der Welt zu zeigen, wie man als Supporter Spiele entscheidet. Er wird sein Bestes geben, wenn er beim Mid-Season Invitational 2017 auf die internationale Konkurrenz trifft.","es_ES":"Donghyun ''Ben'' Nam comenzó su carrera profesional en el verano de 2016, cuando fue fichado por Invictus Gaming. Por desgracia, no tuvo muchas oportunidades para mostrar su talento cuando jugó con Invictus, pero desde que se unió a Team WE al final de 2016, ha podido hacer gala de sus destrezas en la Grieta. No era apenas conocido cuando se unió a Team WE, pero su nombre no ha dejado de repetirse en la LPL desde entonces. Tardó un tiempo en congeniar con su compañero de calle, Mystic, pero sus capacidades mecánicas son tan buenas que sus fans aún quieren más. Tras ayudar a su equipo a vencer a Royal Never Give Up en la final, Ben ahora tiene la oportunidad de demostrarle al mundo que los apoyos también pueden liderar a su equipo hasta la victoria. Intentará darlo todo cuando pise el escenario internacional por primera vez en el Mid-Season Invitational 2017.","pl_PL":"Donghyun „Ben” Nam zaczął profesjonalną karierę latem 2016 roku, gdy został zwerbowany przez Invictus Gaming. Niestety nie miał wielu okazji, by zademonstrować swój talent, grając z Invictus, dopiero odkąd dołączył do Team WE pod koniec 2016 roku może się popisywać umiejętnościami mechanicznymi na Summoner’s Rift. Przed dołączeniem do Team WE nie był szerzej znany, ale od tamtej pory LPL nie przestaje o nim mówić. Zgranie się z kolegą z alei, Mysticem, zajęło mu trochę czasu, jednak teraz fani domagają się od niego jeszcze więcej, znając górny pułap jego umiejętności mechanicznych. Po tym, jak pomógł swojej drużynie zmieść Royal Never Give Up w finale, Ben ma szansę pokazać światu, że wspierający także potrafią prowadzić do zwycięstwa w grach. Podczas swojego pierwszego starcia z rywalami z całego świata na Mid-Season Invitational 2017 na pewno spróbuje zabłysnąć.","pt_BR":"<p>Donghyun “Ben” Nam começou sua carreira profissional na metade de 2016, quando foi contratado pela Invictus Gaming. Ele infelizmente não teve muitas oportunidades de demonstrar seu talento enquanto esteve na Invictus, mas desde que entrou para a Team WE no final de 2016, temos tido vislumbres da sua proeza mecânica no Rift. Ele era bastante desconhecido antes de se juntar à Team WE, mas desde então seu nome é um dos mais citados na LPL. </p>\n\n<p>Sua sincronia com seu companheiro de rota, Mystic, não foi imediata, mas com seu alto nível de mecânica, muitos fãs estão ansiosos para vê-lo jogar mais. Após ter ajudado sua equipe a massacrar a Royal Never Give Up na final, Ben agora tem a chance de mostrar ao mundo como suportes podem carregar partidas. Ele pretende brilhar no Mid-Season Invitational 2017, onde enfrentará competidores internacionais pela primeira vez.</p>","es_AR":"<p><strong>Donghyun \"Ben\" Nam</strong> comenzó su carrera profesional en el verano de 2016 cuando entró a Invictus Gaming. Por desgracia, no tuvo muchas oportunidades de demostrar su talento cuando estuvo en Invictus, pero desde que se unió al Team WE a fines de 2016, ha podido mostrar destellos de su poderío mecánico en la Grieta. No era famoso antes de unirse al Team WE, pero LPL no deja de oír su nombre desde entonces. Le tomó un tiempo sincronizarse con su compañero de carril, <strong>Mystic</strong>, pero debido a sus habilidades mecánicas muchos seguidores lo aclaman. Después de ayudar a su equipo a ganar el Royal Never Give Up en las finales, <strong>Ben</strong> tuvo la oportunidad de mostrarle al mundo cómo los soportes pueden ser acarreadores en las partidas. Busca destacar en la competencia internacional por primera vez en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000406","TRLH2":"200000306"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1643,"slug":"ben4","name":"Ben4","firstName":"Xincheng","lastName":"Tu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben4-6j90qcxn.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:24:59.000Z","updatedAt":"2017-06-06T23:34:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1983,"slug":"starlight","name":"Starlight","firstName":"Shun-Jie","lastName":"Li","roleSlug":"support","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:39:34.000Z","updatedAt":"2017-06-06T23:39:34.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1991,"slug":"zbb","name":"Zbb","firstName":"Zhi","lastName":"Ke","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:24:21.000Z","updatedAt":"2017-06-07T00:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1992,"slug":"laozhou","name":"Laozhou","firstName":"Chao","lastName":"Zhou","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:17:21.000Z","updatedAt":"2017-07-07T17:53:44.000Z","bios":{},"foreignIds":{"TRLT3":"200000233"},"socialNetworks":{},"champions":[],"liveGameTeam":82}],"scheduleItems":[{"id":"AVTGvJjiQMQFcjhwbQiy","content":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:match:e01875eb-88f5-4cfb-ba58-08be5f81c0f7","scheduledTime":"2016-07-29T09:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","blockLabel":"9","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:bracket:af2a82ed-c2c7-40d1-bfb3-a1d541899994"},"match":"e01875eb-88f5-4cfb-ba58-08be5f81c0f7","tournament":"ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","bracket":"af2a82ed-c2c7-40d1-bfb3-a1d541899994","league":"7"}],"gameIdMappings":[],"videos":[{"id":3972,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:b048feaf-5005-44f6-91c0-63681a0924c0","source":"https://www.youtube.com/embed/FV8oHEM2NLk?wmode=transparent&start=1705","createdAt":"2016-07-29T21:44:21.000Z","updatedAt":"2016-07-29T21:44:21.000Z","game":"b048feaf-5005-44f6-91c0-63681a0924c0"},{"id":3973,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:60268100-42ef-427a-8877-e0c5a8599641","source":"https://www.youtube.com/embed/FV8oHEM2NLk?wmode=transparent&start=5417","createdAt":"2016-07-29T21:45:31.000Z","updatedAt":"2016-07-29T21:45:31.000Z","game":"60268100-42ef-427a-8877-e0c5a8599641"},{"id":3974,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:45bb257e-6c07-4881-9ed7-effec561cec0","source":"https://www.youtube.com/embed/FV8oHEM2NLk?wmode=transparent&start=8663","createdAt":"2016-07-29T21:46:40.000Z","updatedAt":"2016-07-29T21:46:40.000Z","game":"45bb257e-6c07-4881-9ed7-effec561cec0"}],"htmlBlocks":[],"match":{"id":"e01875eb-88f5-4cfb-ba58-08be5f81c0f7","name":"WE-vs-IM","position":32,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"},{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],"games":{"b048feaf-5005-44f6-91c0-63681a0924c0":{"id":"b048feaf-5005-44f6-91c0-63681a0924c0","name":"G1","generatedName":"IM|WE|G1|e01875eb88f54cfbba580","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"},{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],"standings":{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}]],"timestamp":1469828724385,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}]],"timestamp":1469813082188,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"45bb257e-6c07-4881-9ed7-effec561cec0":{"id":"45bb257e-6c07-4881-9ed7-effec561cec0","name":"G3","generatedName":"IM|WE|G3|e01875eb88f54cfbba580","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"},{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],"standings":{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469828863818,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469813117935,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"60268100-42ef-427a-8877-e0c5a8599641":{"id":"60268100-42ef-427a-8877-e0c5a8599641","name":"G2","generatedName":"IM|WE|G2|e01875eb88f54cfbba580","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"},{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],"standings":{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469828800279,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469813317122,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469828863819,"source":"bestOf","history":[{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469828800279,"source":"bestOf","closed":true},{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469828724385,"source":"bestOf","closed":true},{"result":[[{"roster":"449a466d-9f57-4161-afff-e6bed32954bc"}],[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}]],"timestamp":1469813117936,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"449a466d-9f57-4161-afff-e6bed32954bc":1,"39554053-1d29-4e8b-9021-20a7c651e646":0}}}