{"teams":[{"id":71,"slug":"origen","name":"Origen","guid":"be6de8f4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-fwyv5cpc.png","acronym":"OG","homeLeague":"urn:rg:lolesports:global:league:league:5","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/origen-353d41ul.png","createdAt":"2015-05-26T21:11:27.000Z","updatedAt":"2017-07-06T22:25:00.000Z","bios":{"en_US":"<p>Founded by former Fnatic star xPeke in 2014, Origen is one of the newest teams in the EU esports scene. OG rampaged through the 2015 EU Challenger Series Spring Split in their debut season with a 9W-1L record culminating in 1st place in the CS Spring Playoffs. Their results secured a spot in the EU LCS. OG didn’t stop there, though. They went on to claim 2nd place in the 2015 EU LCS Summer Split. They then battled their way through the 2015 EU Regional Qualifier to claim a Semifinal appearance at the 2015 World Championship.</p>\n\n<p>Origen’s struggles in 2016 led to a mass exodus of its players and the organization was forced to rebuild their team from scratch. Fielding a roster mixed with wily veterans and youngsters bursting with talent, Origen is building a team that can win now, but should improve well into the future. Under the guidance of 2016 All-Star mid laner xPeke, Origen is looking to avoid their past mistakes while securing their future. We’re about to see how it all unfolds.</p>\n\n<p>Coach: Titus \"LeDuck\" Hafner","fr_FR":"<p>Fondée en décembre 2014, la structure Origen est le fruit d’un pari osé. Après un mondial décevant, Enrique « xPeke » Cedeño-Martinez décide de quitter Fnatic, la maison qui l’a vu naître, évoluer pendant quatre saisons et remporter de nombreuses compétitions. L’Espagnol emboîte ainsi le pas à son homologue et compatriote Carlos « ocelote » Rodríguez Santiago en créant à son tour sa propre structure. En quittant Fnatic, xPeke abandonne la stabilité qu’octroie une place en LCS et doit construire de nouvelles bases. Pour ce faire, le joueur star réussi à rallier des joueurs d’expérience à sa cause. De retour d’une aventure outre-Atlantique au sein de la formation Team SoloMid, Maurice « Amazing » Stückenschneider rejoint l’équipe au poste de jungler. Récemment amnistié et fort d’une expérience mondiale avec Lemondogs, le support Alfonso « Mithy » Aguirre Rodriguez répond également à l’appel. Pour remplir le rôle de carry AD, xPeke déroge à sa règle et, sur les conseils de son ancien coéquipier Martin « Rekkles » Larsson, fait appel à un jeune espoir de 17 ans : Jesper « Niels » Svenningsen, aujourd’hui connu sous le pseudo de Zven. À la mi-janvier, le Français Paul « sOAZ » Boyer rejoint son ami et coéquipier de toujours dans cette nouvelle aventure.</p>\n\n<p>En très peu de temps, Origen crée une équipe classée et parvient à se hisser à la 9e place du classement par équipe avec un ratio impressionnant de 70 victoires pour seulement 6 défaites. Après s’être qualifiés pour les Challenger series, xPeke et ses hommes réalisent une saison parfaite avant de remporter leur premier match des play-offs. Étant donné que toutes ces parties ont été jouées en ligne, confortablement installés dans leur Gaming House sous le soleil de Tenerife dans les Îles Canaries, les joueurs décident de participer à la très réputée Gamers Assembly, la plus grosse LAN française, afin de se réhabituer à la pression de la scène. Origen remporte la compétition haut la main et deux jours plus tard se qualifie pour les League of Legends Championship Series en renvoyant les Copenhagen Wolves Academy à la niche.</p>\n\n<p>À peine débarquée en LCS, l’équipe Origen montre de quel bois elle se chauffe en enchaînant 5 victoires consécutives avant de tomber une première fois face à ROCCAT. En début de saison, l’équipe se distingue par une redoutable agressivité dans les premiers instants de la partie, portant un intérêt particulier au Dragon. Origen termine la saison régulière à la 2e place, avec 12 victoires pour 6 défaites. À l’approche de play-offs, le style de jeu d’Origen évolue. Plus porté sur la fin de partie, les prises de risques sont habilement calculées et le jeu devient de plus en plus tactique. Zven gagne brillamment la confiance totale de ses coéquipiers, qui n’hésitent pas à jouer autour de lui. Une stratégie gagnante puisque Origen passe à deux doigts de remporter le segment d’été après s’être incliné 2 à 3 face à des Fnatic alors invaincus.</p>\n\n<p>Pour se qualifier au mondial 2015, Origen participe au tournoi de qualification régional, élimine sa Némésis ROCCAT 3 à 2 puis se défait d’Unicorns of Love sans encaisser la moindre défaite. Placés dans un groupe D au niveau relevé, les joueurs Origen font une entrée fracassante en s’imposant face à LGD Gaming et finissent à la deuxième place, derrière des KT Rolster à qui ils ont pris une manche. Origen élimine par la suite les Taïwanais de Flash Wolves en quart de finale avec une certaine aisance avant de s’incliner face à SK Telecom T1 en demi-finale. Pendant l’intersaison, le mid lanerTristan « PowerOfEvil » Schrage est recruté en tant que sixième joueur.</p>\n","pl_PL":"<p>Organizacja została założona przez Enrique’a \"xPeke\" Cedeño Martíneza 7 grudnia 2014r. Stworzenie Origen sprzęgło się z jego odejściem z drużyny Fnatic, której był członkiem aż od pierwszego sezonu. Głównym powodem kreacji zespołu Origen było jego marzenie, żeby założyć drużynę. Przed odejściem oświadczył: „Jedynym powodem mojego opuszczenia drużyny Fnatic jest chęć realizacji mojej fantazji, która mi towarzyszy już od dłuższego czasu. Moim pragnieniem jest założyć własną drużynę i uważam, że to jest najlepszy moment na zrobienie tego.” Sugerował też, że ważnym bodźcem do utworzenia Origen, było odejście innych graczy z Fnatic.</p>\n<p>\nZe względu na olbrzymią popularność Enrique’a \"xPeke\" Cedeño Martíneza wiadomość o tworzonym przez niego zespole obiegła społeczeństwo League of Legends z prędkością światła. Zainteresowanie nowością było na tyle duże, że na Gamergy w Hiszpanii doszło do wycieku zdjęć z przyszłym logiem drużyny. \"xPeke\" zapewnił Origen rzesze fanów od samych narodzin drużyny. Już parę miesięcy po narodzinach organizacji można było zobaczyć podczas rozgrywek LCS tłumy wielbicieli w bluzach organizacji. Najlepszym zwiastunem dla tego zespołu jest to, że ich liczba ciągle rośnie.</p>\n<p>\nOrigen jako organizacja została stworzona w celu zrzeszenia graczy grających w League of Legends i nie przewidywała oddziałów w innych grach. Pomimo tego, że została stworzona 7 grudnia dostała się do letniego sezonu 2015 w EU LCS. Niewątpliwym sukcesem Origen było uzyskanie 2nd miejsca w tym okresie, pomimo tego, że był to jej debiut. Tymczasem biało-czarnym udało się osiągnąć jeszcze więcej. Byli ekipą, która skończyła rekordowo długą serię zwycięstw Fnatic. Kolejnym wyczynem, wyjątkowym dla zespołu, który dopiero co dołączył do EU LCS, była kwalifikacja do Mistrzostw Świata 2015. Na nich miało miejsce kolejne zaskoczenie – drużyna Origen doskonale poradziła sobie w fazie grupowej. Wykluczyła z dalszej gry światowej sławy drużyny: Team SoloMid i LGD Gaming. Jednak prawdziwym triumfem tej załogi było przejście aż do półfinałów. Udało im się pokonać Flash Wolves w ćwierćfinałach, a następnie stanąć w szranki z mistrzami świata sezonu trzeciego i piątego – SKT T1.</p>\n<p>\nJednak Origen nie spoczął na laurach po Mistrzostwach Świata 2015 i bezpośrednio po nich wziął udział w trzeciej części 10 sezonu IEM w San Jose. Jeśli biało-czarni zawodnicy chcieli pokazać światu, że ten zespół jest stworzony do wygrywania, to udało się to im idealnie. \"xPeke\" wystąpił jako trener ze względu na przyjęcie szóstego zawodnika do swojego grona. Pomimo tego, że nie mieli zbyt dużo czasu na przetestowanie nowego gracza, rozłożyli na łopatki Counter Logic Gaming i Team SoloMid – dwa najbardziej doświadczone amerykańskie zespoły. Dodatkiem do tego pokazu siły, było dokonanie tego bez ani jednego przegranego meczu.</p>\n","de_DE":"<p>Origen wurde 2014 vom früheren Fnatic-Star xPeke gegründet, was es zu einem der jüngsten Teams der europäischen E-Sport-Szene macht. OG marschierten in ihrer Debüt-Saison durch den Frühjahrs-Split der EU Challenger Series 2015, den sie schließlich mit neun Siegen und nur einer Niederlage gewannen. Mit diesem Ergebnis haben sie sich einen Platz in der EU LCS gesichert. Das hat OG allerdings noch nicht gereicht. Sie erreichten den zweiten Platz im Sommer-Split der EU LCS 2015. Dann haben sie sich den Weg durch die regionale Qualifikationsrunde der EU 2015 gebahnt und sich damit die Halbfinalteilnahme an der Weltmeisterschaft 2015 gesichert.</p>\n\n<p>2016 hatte Origen mit starken Problemen zu kämpfen, was zu einer Massenflucht der Spieler führte. Dadurch war die Organisation gezwungen, das gesamte Team neu aufzubauen. Mit der aktuellen Aufstellung aus routinierten Veteranen und jungen Spielern, die nur so vor Talent strotzen, hat Origen eine Mannschaft aufgestellt, die gewinnen kann und für die Zukunft noch viel Luft nach oben hat. Unter der Führung des All-Star Mid-Laners xPeke soll Origen die Fehler der Vergangenheit vermeiden und gleichzeitig die eigene Zukunft sichern. Bald wird sich zeigen, wie sich alles entwickelt.</p>","es_ES":"<p>Decidir el nombre de una nueva organización no es una tarea sencilla, pero Enrique ‘xPeke Cedeño lo tuvo claro: Origen. Después de una trayectoria legendaria en Fnatic, el ambiente viciado que reinaba en la plantilla al término del Campeonato Mundial 2014 y la retirada de Lauri ‘Cyanide’ Happonen, uno de sus mejores amigos, llevaron al español a renovarse y materializar una idea que residía en lo más recóndito de su ser desde hace tiempo.</p>\n\n<p>xPeke se lanzó a la piscina sin comprobar si había agua en el fondo y anunció durante la segunda edición de Gamergy el significativo nombre del proyecto. No sólo suponía un comienzo desde cero, sin mayor seguridad que la calidad de los jugadores a los que atrajo, sino que implicaba llegar a lo más alto bajo sus propias condiciones.</p>\n\n<p>Por fortuna para los intereses del murciano, el primer año de existencia de Origen ha sido un éxito rotundo. La organización no sólo ha tenido una excelente acogida desde el primer momento, en buena parte debido a la popularidad de su fundador, sino que se ha establecido como una de las más punteras a nivel deportivo en el viejo continente.</p>\n\n<p>El ascenso a la LCS fue un mero trámite para Origen, cuyo traspiés contra Millenium en el clasificatorio para la Challenger Series hizo temblar las aspiraciones del equipo pero no impidió que dominara sin romper a sudar la competición secundaria de Riot Games. Aunque acceder a los Playoffs de la máxima liga europea ya era un hito para los jugadores, el gran desempeño de Origen durante la fase regular les situó como uno de los favoritos para hacerse con el título. El pronóstico no era desacertado, pero Fnatic logró imponerse en la quinta y última partida de la final.</p>\n\n<p>Debido a su ausencia en el split de primavera, Origen carecía de los puntos de campeonato suficientes para asegurar su pase al Campeonato Mundial 2015. No obstante, el regional le brindó la oportunidad necesaria para, aunque con más dificultades de las esperadas, sellar su clasificación y unirse a los mejores del planeta.</p>\n\n<p>Si las expectativas de los jugadores ya habían quedado superadas, el rendimiento del equipo en el mayor evento anual de League of Legends fue el broche de oro de su primer año de vida. Origen no partía como principal candidato para pasar a los cuartos de final, pero el cataclismo de los representantes chinos y las horas de práctica en la concentración previa posibilitaron unos resultados imprevistos. La suerte le sonrió al emparejarle con Flash Wolves, pero SK Telecom T1 fue un obstáculo impenetrable para los europeos en la semifinal.</p>\n\n<p>Con un año de experiencia a sus espaldas, Origen afronta la Temporada 2016 como una de las potencias del continente. Aunque xPeke planea enfocar sus esfuerzos a los despachos, la incorporación de Tristan ‘PowerOfEvil’ Schrage ya ha pagado dividendos en forma de triunfo en la Intel Extreme Masters San José. Puede que el equipo necesite algo de tiempo para incorporar al alemán, que aporta una nueva amenaza a la alineación, pero aspira a aprovechar la reconstrucción de Fnatic para reinar en Europa.</p>","pt_BR":"Fundada pelo ex-astro da Fnatic xPeke em 2014, a Origen é um dos mais novos times no cenário europeu. Eles não tomaram conhecimento dos adversário na Série Desafiante da etapa de primavera 2015, fazendo 9V-1D e terminando em primeiro lugar nas eliminatórias. Conquistaram a vaga na LCS EU, mas não pararam por aí. Fizeram uma boa etapa de verão, e terminaram em segundo lugar. E não pararam por aí mais uma vez. Passaram pela classificatória regional da Europa e conquistaram a vaga no Mundial. De Desafiante a uma vaga no Mundial em apenas um ano? #TheDream\n"},"foreignIds":{"drupalId":"3862"},"players":[1549,1708,1800,1997,1998,2014,2015,2016,2017,2073],"starters":[1708,1800,2014,2016,2073],"subs":[1549,1997,1998,2015,2017]},{"id":228,"slug":"misfits","name":"Misfits","guid":"be7195b4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/misfits-8fnvxt30.png","acronym":"MSF","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2016-06-03T15:47:57.000Z","updatedAt":"2017-06-07T08:47:16.000Z","bios":{"en_US":"<p>Misfits performed extremely well in the European Challenger circuit, amassing win after win on their way to punching their EU LCS tickets. After making it into the LCS, the team underwent some roster changes, adding PowerOfEvil, and the surprise signing of veteran KaKAO. The team spent time in Korea bootcamping in order to prepare themselves for the next level of competition. With a great mix of veteran leadership and fresh faces, Misfits has a chance to make an unexpected splash this season.</p>\n\n<p>Coach: Hussain Moosvi</p>\n<p> Team Manager: Andy \"CrazyCaps\" Walda</p>","de_DE":"<p>Die Misfits wurden aus der Asche der Renegade: Banditos geboren, nachdem deren Dachgesellschaft aus der LCS verbannt worden war. Die Einheit schlug sich in der europäischen Challenger Series extrem gut und gewann ein Spiel nach dem anderen, bevor sie endlich das Ticket für die EU LCS lösen konnte. Nachdem es die Mannschaft in die LCS geschafft hatte, veränderte sich ihre Aufstellung durch die Zugänge von PowerOfEvil und dem Veteranen KaKAO. Die Mannschaft verbrachte einige Zeit in Korea, um dort zu trainieren und sich auf die Konkurrenz vorzubereiten. Dank der großartigen Mischung aus erfahrenen Anführern und frischen Gesichtern könnten die Misfits diesen Frühling für die ein oder andere Überraschung sorgen.</p>\n<p>Coach: Hussain \"Hussain\" Moosvi</p>\n<p>Mannschaftsleiter: Andy \"CrazyCaps\" Walda</p>","es_ES":"<p>Misfits rindió extremadamente bien en el Challenger Series europeo al conseguir una victoria tras otra en su camino hasta la LCS EU. Después de llegar a la LCS, Misfits ha sufrido algunos cambios de plantel con la adquisición de PowerOfEvil y el sorprendente fichaje del veterano KaKAO. El equipo ha estado en Corea entrenando para prepararse para el siguiente nivel de la competición. Con una gran mezcla de liderazgo veterano y rostros nuevos, Misfits tiene la oportunidad de dejar huella de forma inesperada durante esta temporada.</p>\n\n<p>Entrenador principal: Hussain Moosvi</p>\n<p>Jefe de equipo: Andy \"CrazyCaps\" Walda</p>\n","fr_FR":"<p>Les Misfits ont enregistré d'excellentes performances dans le circuit Challenger européen, enchaînant les victoires et décrochant ainsi leur place aux LCS EU. Après sa sélection pour les LCS, l'équipe a procédé à quelques changements de formation, avec l'ajout de PowerOfEvil et l'arrivée surprise du vétéran KaKAO. L'équipe a passé du temps à s'entraîner en Corée afin de se préparer à un niveau de compétition supérieur. En mélangeant des leaders vétérans et de nouveaux visages, Misfits a une chance de faire un coup d'éclat inattendu cette saison.</p>\n\n<p>Entraîneur principal : Hussain Moosvi</p>\n<p>Responsable d'équipe : Andy « CrazyCaps » Walda</p>\n","pl_PL":"<p>Misfits spisali się naprawdę dobrze podczas europejskich rozgrywek serii Pretendenta, zdobywając jedno zwycięstwo po drugim i zapewniając sobie wstęp do EU LCS. Po dostaniu się do LCS drużyna przeszła kilka zmian składu, dodając PowerOfEvila i zaskakując wszystkich podpisaniem kontraktu z weteranem KaKAO. Drużyna spędziła nieco czasu na obozie treningowym w Korei, chcąc przygotować się do walki na nowym poziomie rywalizacji. Dzięki świetnemu połączeniu przywództwa weteranów i entuzjazmu świeżej krwi, Misfits mają szanse osiągnąć niespodziewany sukces podczas tego sezonu.</p>\n\n<p>Główny trener: Hussain Moosvi</p>\n<p>Menedżer drużyny: Andy „CrazyCaps” Walda</p>\n"},"foreignIds":{},"players":[87,243,357,392,628,1090,1334],"starters":[243,357,628,1090,1334],"subs":[87,392]}],"players":[{"id":87,"slug":"h1iva","name":"H1Iva","firstName":"Aleksi","lastName":"Kaikkonen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/h1iva-3d3cbqxm.png","hometown":null,"region":"Challenge France","birthdate":"1994-08-31","createdAt":"2014-07-28T19:09:35.000Z","updatedAt":"2017-05-27T01:11:02.000Z","bios":{"en_US":"","fr_FR":"<p> H1iva est un support de niveau Challenger. C'est un joueur qui connaît bien la scène professionnelle de League of Legends, après avoir joué dans les équipes Gamers 2 ou Renegades en Challenger Series. Pour cette saison 2016-2017, il rejoint l'équipe Millenium aux objectifs européens.\nSes exploits avec la Team Forge et Renegades ont permis au finlandais de se démarquer et d'acquérir une certaine renommée dans son pays d'origine. Très bon joueur de Tresh, il compte bien prouver à la communauté française qu'il saura être au niveau et mener ses coéquipiers vers la victoire. </p>","cs_CZ":""},"foreignIds":{"drupalId":"1496","TRLH3":"1000145041","TRLH4":"1000125041","FRA1TMNT1":"375321","TRNA1":"1000525385","TREU":"1000565129","FRA1TMNT2":"25245"},"socialNetworks":{"twitter":"https://twitter.com/HiivaLoL"},"champions":[],"liveGameTeam":228},{"id":243,"slug":"powerofevil","name":"PowerOfEvil","firstName":"Tristan","lastName":"Schrage","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/powerofevil-dvzrzaxn.png","hometown":"Germany","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T10:20:35.000Z","bios":{"en_US":"<p>Tristan “PowerOfEvil” Schrage has skill well beyond his years. PowerOfEvil is best known for his mechanical outplays, especially on Cassiopeia, Syndra, and Orianna. And if you don't know him for his mechanical ability, you probably know him for his bizarre champion picks in the mid lane -- we're looking at you, Smite Kayle... with Devourer. PowerOfEvil's success led him to a new team at the end of 2015 -- Origen.</p>\n\n<p>Even under the tutoring of 2016 All-Star mid laner xPeke, PowerOfEvil struggled to find his groove and eventually left Origen at the end of the year. He’s still brimming with untapped potential, and Misfits decided to pick him up in order to bolster their roster. A change of scenery may finally unlock all the talent that has only been seen in spurts since his move to Origen. The time has come for PowerOfEvil to show that his resilience has lead to growth. It’s now or never for the youngster and the stakes can’t get much higher.</p>","pl_PL":"<p>Tristan rozpoczął piąć się w górę w czwartym sezonie, kiedy zaczął być rozpoznawalny w społeczeństwie League of Legends jako naprawdę silny mid-laner. Co prawda grał w różnych drużynach, lecz skupiał się głównie na grze ESL Pro Series i Challenger Series. Jego celem było dostanie się do rozgrywek EU LCS. Ostatecznie dołączył do zespołu Unicorns Of Love, jednak po przegranej z Ninjas in Pyjamas opuścił go na miesiąc. Po tym meczu bardzo pozytywnie wypowiedział się o nim „Alex Ich”, weteran sceny esportowej, będący pod wrażeniem jego umiejętności na mid-lanie. Kiedy \"PowerOfEvil\" wrócił do różowej drużyny, ona w międzyczasie dostała się do turniej kwalifikacyjnego do wiosennego sezonu LCS 2015. To zmobilizowało go do poprawy swoich wyników. Pomimo przegranej z H2K, udało mu się dokonać zemsty na zespole NiP, wygrywając z nim. Dzięki temu zwycięstwu znalazł się w EU LCS 2015.</p>\n<p>\nKiedy \"PowerOfEvil\" znalazł się na profesjonalnej scenie, miał okazję zademonstrować publice swoje najsilniejsze strony. Poprowadził Unicorns Of Love do wielu zwycięstw w wiosennym sezonie 2015, bezlitośnie niszcząc przeciwników Syndrą i Cassiopeią – jednymi ze swoich ulubionych bohaterów. Jego zdolność do zdobywania przewagi samemu, bez dużej pomocy drużyny, sprawiła, że miał też dużą swobodę np. w wyborze postaci. Dzięki dominującej postawie Tristana UOL skończył ten okres na piątym miejscu, czyli naprawdę przyzwoicie. On sam dwukrotnie został wytypowany MVP tygodnia w tym semestrze LCS. Z kolei w letnim sezonie 2015 \"PowerOfEvil\" pokazał jak bardzo niebezpieczny jest grając Orianną i Kog’mawem. Tym razem udało mu się wnieść swoją różową drużynę aż na czwarte miejsce w tym okresie, co jak na gracza, który dopiero w tym roku znalazł się w EU LCS, było niezwykłym osiągnięciem.</p>\n<p>\nNa początku sezonu 6, 13 listopada 2015, Tristan dołączył do zespołu Origen jako szósty zawodnik. Został uznany za tak dobrego mid-lanera, że został z otwartym ramionami przyjęty do drużyny, która dotarła aż do półfinału na ostatnich Mistrzostwach Świata. Swoje członkostwo w nowej organizacji zaczął od sukcesów – wraz z nią wygrał trzecią część 10 sezonu IEM w San Jose. Pokonał tam doświadczone amerykańskie zespoły Team SoloMid i Counter Logic Gaming, nie przegrywając ani jednej gry. To jego pierwsze i prawdopodobnie nie ostatnie tak zdecydowanie zwycięstwo.</p>\n<p>\nPoza mid-lanem PowerOfEvil\" lubi też grać na top-lanie i jako support, lecz zapowiedział już, że na pewno nie zmieni swojej roli. Tak samo jak swojego pseudonimu, którego używał w innych grach przed swoją karierą świecie Runeterry. Jest dumny ze swojej odporności na porażki i panowania nad własnymi emocjami. Na co dzień \" Tristan jest chłopakiem z Bad Soden, w Niemczech, który niegdyś marzył o zostaniu pilotem i lataniu po całym świecie. Zamiast tego, starszy brat zachęcił go do gry w League of Legends, więc realizuje swoje marzenia latając na i wygrywając turnieje. Poza grą na komputerze lubi grać w tenisa i piłkę nożną z przyjaciółmi. Ma szczęście posiadając rodziców, którzy pomimo tego, że woleliby żeby skończył szkołę, wspierają go i pomagają osiągnąć jego cele. </p>\n","es_ES":"<p>Integrante de una familia de ávidos jugones, no es de extrañar que Tristan ‘PowerOfEvil’ Schrage tenga un instinto natural para los videojuegos. Su hermano siguió la estela de su padre, que desde pequeño le introdujo al mundillo ya que acudía a concentraciones de jugadores, y se convirtió en su mentor tras enseñarle el universo de Runaterra.</p>\n\n<p>El alumno, que ocupó la calle central al ser el único rol disponible entre sus amigos, no tardó mucho en superar al maestro. Aunque ambos escalaron posiciones en el ránking hasta alcanzar el rango Aspirante y se iniciaron juntos en el ámbito competitivo con Team Mistral, Gunnar Schrage decidió centrarse en sus estudios. Por contrapartida, PowerOfEvil persiguió la carrera del jugador profesional.</p>\n\n<p>El alemán se unió a EYES ON U, una modesta entidad cuya división europea compitió en la Challenger Series durante la primera mitad de la edición primaveral. Descontento con los mediocres resultados del equipo, que no alcanzó los Playoffs, PowerOfEvil pasó a jugar en dos escuadras al mismo tiempo: por un lado participaba en la ESL Pro Series con Planetkey Dynamics; por otro, ingresó en las filas de Unicorns of Love para volver a competir en la Challenger Series.</p>\n\n<p>Aunque esta vez sí alcanzó la fase eliminatoria, la derrota contra Ninjas in Pyjamas en los cuartos de final le hizo abandonar a los equinos. Para cuando decidió volver a Unicorns of Love, el equipo había logrado la clasificación para los Playoffs de verano. Esta vez galoparon por encima de los ninjas suecos, que les habían derrotado en dos ediciones consecutivas, y consiguieron el pase al Torneo de Promoción.</p>\n\n<p>Aquella eliminatoria contra Millenium supuso la eclosión de Unicorns of Love, que se metió al público en el bolsillo con una quinta partida épica en la que PowerOfEvil destruyó el nexo de los franceses con los últimos puntos de vida que le quedaban a su emblemática Cassiopeia. Sin embargo, fue la primera Intel Extreme Masters celebrada en San José la que catapultó definitivamente a PowerOfEvil al estrellato.</p>\n\n<p>Unicorns of Love acudió al evento gracias a la votación en masa de sus nuevos seguidores, pero aun así llegaba como tapado. Puede que por esta razón el cuerpo técnico de Team SoloMid pasara por alto a Syndra en la fase de selección de campeones, algo que el alemán aprovechó para destrozar a Søren ‘Bjergsen’ Bjerg. Los unicornios no se llevaron el trofeo a casa, pero el joven que quería ser piloto voló de vuelta a casa con una legión de aficionados a sus espaldas.</p>\n\n<p>Ya en la LCS, PowerOfEvil se consolidó como la mayor amenaza de Unicorns of Love, que hizo historia al ganar en los Playoffs al primer clasificado de la fase regular, SK Gaming, gracias a un crucial robo de Barón del mid con Orianna. En la final contra Fnatic sorprendió con Varus, una de sus innovadoras aportaciones al metajuego, pero no fue suficiente para llevarse la corona. Durante el split de verano de la LCS EU 2015, PowerOfEvil continuó siendo el motor de los suyos con campeones relevantes en fases tardías de la partida, como Kog’Maw u Orianna.</p>\n\n<p>Aunque los unicornios no emularon su exitoso paso por los Playoffs, el buen rendimiento del alemán captó la atención de Origen, el equipo que le privó de participar en el Campeonato Mundial 2015. Con sus nuevos compañeros regresó a San José para, esta vez sí, conquistar el campeonato como reemplazo de Enrique ‘xPeke’ Cedeño, uno de los jugadores a los que admira y con el que compartirá el puesto en 2016.</p>","fr_FR":"<p>Le jeune espoir Tristan « PowerOfEvil » Schrage est la première recrue d’Origen depuis la création de la structure. En 2014, le mid laner participe aux Challengers series mais son équipe ne signe pas une grande prestation. Plus tard, il rejoint la formation avec laquelle il se fera connaître : Unicorns of Love. Malgré des résultats discutables, UoL parvient à se qualifier sur le fil pour les play-offs des Challenger series. C’est à ce moment-là que le vent tourne. Plus motivé que jamais, UoL et celui qui se fait surnommer PoE réussissent à obtenir la 3e place en écrasant une équipe Ninjas in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et Aleš « Freeze » Kněžínek, ne cédant que face aux H2k de Fabian « Febiven » Diepstraten.\n\n<p>PowerOfEvil doit alors remporter un match en trois manches gagnantes s’il veut accéder aux League of Legends Championship Series. La victoire semble compromise puisque Millenium, l’équipe adverse, s’offre trois balles de match après avoir remporté les deux premières parties. Mais à ce moment-là, UoL décide de sortir sa botte secrète, Poppy top, et réussit l’impensable, se qualifiant de justesse au segment de printemps 2015.\n\n<p>Devant cette remontée fantastique, un style de jeu osé, des champions atypiques et un nom d’équipe attachant, les invocateurs décident de voter à 48% pour Unicorns of Love afin qu’ils participent aux Intel Extreme Masters San Jose. PowerOfEvil et ses coéquipiers font honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, PoE signe un tournoi exemplaire en se faisant particulièrement remarquer avec LeBlanc et Syndra.\n\n<p>En LCS, le mid laner impressionne encore et obtient le titre de meilleur joueur de la semaine à deux reprises. Il hisse son équipe à la très correcte 5e place de la saison régulière et arrive aux play-offs en tant qu’outsider, mais lui et son équipe démontrent très vite qu’ils sont déterminés en éliminant Gambit Gaming sans trembler. PowerOfEvil ne s’arrête pas en si bon chemin et s’impose face au premier de la saison régulière, SK Gaming, avant de donner du fil à retordre à Fnatic en finale.\n\n<p>Plus qu’un bon joueur, PowerOfEvil aime l’innovation et n’hésite pas à sortir des sentiers battus. Lors du segment de printemps, il joue Orianna avec Châtiment pour s’équiper de l’enchantement Glaive Runique et réussit un quintuplé. Cependant, ses expériences ne sont pas toujours un succès, en témoigne sa Kayle équipée d’un enchantement Dévoreur. Pendant le segment d’été, Unicorns of Love réitère une bonne performance mais échoue à obtenir la troisième place de play-offs. UoL se fait ensuite balayer par Origen et perd toute chance d’accéder au mondial 2015.\n\n<p>Fin novembre, lors des IEM San Jose, PowerOfEvil dispute ses premières rencontres au sein d’Origen, sa nouvelle équipe. Aux commandes de champions qu’il connaît bien, l’Allemand permet à sa nouvelle équipe d’éliminer TSM puis de remporter la finale face à Counter Logic Gaming, sans encaisser la moindre défaite et en montrant un niveau de jeu très convaincant. Ce début est de bonne augure et PoE devrait profiter de l’expérience de Enrique « xPeke » Cedeño-Martinez pour atteindre son plein potentiel cette année.\n","de_DE":"<p>Tristan „PowerOfEvil“ Schrage ist in seinen jungen Jahren bereits extrem talentiert. PowerOfEvil ist vor allem dafür bekannt, seine Gegner mit Cassiopeia, Syndra und Orianna in Sachen Spielmechanik zu übertreffen. Und wer ihn nicht deshalb kennt, kennt ihn wahrscheinlich aufgrund seiner seltsamen Championwahlen für die mittlere Lane – damit meinen wir vor allem Kayle mit Zerschmettern … und Verschlinger. Ende 2015 führte der Erfolg PowerOfEvil zu einer neuen Mannschaft – Origen.\n\nBei Origen hatte PowerOfEvil jedoch trotz der Hilfe des Mid-Laners des All-Stars-Events 2016, xPeke, Probleme, seinen Rhythmus zu finden, weshalb er die Mannschaft am Ende des Jahres wieder verließ. Er steckt immer noch voller Potenzial und die Misfits haben ihn aufgenommen, um ihre Aufstellung zu verstärken. Dieser Tapetenwechsel könnte sein Talent endgültig zum Vorschein bringen, das in seiner Zeit bei Origen nur selten zu sehen war. PowerOfEvil muss jetzt beweisen, dass er sich dank seiner Belastbarkeit verbessern konnte. Der Einsatz ist hoch und für ihn heißt es jetzt: „Alles oder nichts.“</p>"},"foreignIds":{"drupalId":"1455","TRLH3":"200000051","TRLH4":"200000154"},"socialNetworks":{"facebook":"www.facebook.com/thepowerofevil","twitter":"https://twitter.com/PowerOfEvilLoL"},"champions":[],"liveGameTeam":228},{"id":357,"slug":"ignar","name":"IgNar","firstName":"Dong-geun","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ignar-5rj4dfc4.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:14:09.000Z","updatedAt":"2017-06-09T11:01:30.000Z","bios":{"en_US":"Dong-geun \"IgNar\" Lee hails from South Korea but got his professional start in North America with Winterfox, although he didn’t appear in a single game for them. He eventually moved back to Korea and played with both Incredible Miracle and KT Rolster, gaining valuable top tier competitive experience.\n\nAfter proving that he could hang with the best in Korea, IgNar once again moved continents, except this time he made his way to Europe to play for the EUCS squad Misfits. He excelled as their support and helped them into the EU LCS. While assisting his team in cutting the Challenger competition down to size, IgNar played Braum, Bard and everything in-between. His wide champion pool should help give Misfits a fighting chance against the best teams Europe has to offer.</p>","de_DE":"<p>Dong-geun „IgNar“ Lee stammt aus Südkorea, hat seine professionelle Karriere aber bei Winterfox in Nordamerika begonnen (obwohl er für die Mannschaft kein einziges Spiel bestritten hat). Daraufhin ging er zurück nach Korea, wo er sowohl mit Incredible Miracle als auch mit KT Rolster Erfahrungen sammeln konnte.\n\nNachdem er bewiesen hatte, dass er es mit den besten Spielern Koreas aufnehmen konnte, zog IgNar nach Europa, um dort in der EU CS für die Misfits zu spielen. Dort lieferte er eine überragende Leistung als Supporter ab und half der Mannschaft, in die EU LCS einzuziehen. IgNar spielte sämtliche Champions von Braum bis Bard und half seiner Mannschaft, die Konkurrenz in der Challenger Series dem Erdboden gleich zu machen. Sein umfangreicher Champion-Pool sollte den Misfits helfen, gegen die besten Mannschaften Europas bestehen zu können.</p>"},"foreignIds":{"drupalId":"3777","TRLH4":"200000156","TRLH3":"200000053"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":392,"slug":"paragon","name":"Paragon","firstName":"Hyun-Il","lastName":"Choi","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/paragon-6qnhxpgh.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-03-07T19:18:45.000Z","updatedAt":"2017-05-31T21:00:50.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"2126","TRLH1":"1001070001","ESPORTSTMNT02":"200000987","TRLH3":"200000252","TRLH4":"200000304"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":628,"slug":"maxlore","name":"Maxlore","firstName":"Nubar","lastName":"Sarafian","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/maxlore-esgl6viu.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:07.000Z","updatedAt":"2017-06-09T10:14:04.000Z","bios":{"en_US":"<p>Nubar “Maxlore” Sarafian is the jungler that’s always there when his teammates need him. His play in the EU Challenger Series earned him a spot on Giants Gaming for the 2016 EU LCS Summer Split, and he helped lead the team on a late-season surge that saw them qualify for the playoffs.</p>\n\n<p>With some of his best performances coming on durable junglers like Gragas and Rek’Sai, Maxlore will look to absorb damage for Misfits in the Summer Split and body slam the team up the standings.</p>","de_DE":"<p>Nubar „Maxlore“ Sarafian ist der Jungler, der immer da ist, wenn ihn seine Teammitglieder brauchen. Dank seiner guten Leistungen in der europäischen Challenger Series erhielt er die Möglichkeit, mit Giants Gaming am Sommer-Split der EU LCS 2016 teilzunehmen, und half der Mannschaft, sich für die Entscheidungsspiele zu qualifizieren.\n\n2017 kann Maxlore sein Talent als Teil der neuen Aufstellung von ROCCAT unter Beweis stellen. Maxlore hat seine besten Leistungen mit zähen Champions wie Gragas und Rek’sai abgeliefert und wird versuchen, im Frühjahrs-Split möglichst viel Schaden zu absorbieren, um ROCCAT mit einem Bauchrammer nach oben zu katapultieren.</p>","fr_FR":"<p>Nubar « Maxlore » Safarian est un joueur d'origine britannique qui fait son entrée pour le segment d'été en compétition LCS. Après avoir vagabondé au sein d'une multitude d'équipes challenger entre 2014 et aujourd'hui, Maxlore a trouvé confort au sein des Inspire Gaming depuis la rentrée 2016. L'équipe a obtenu d'excellents résultats en compétition challenger et a manqué de battre Huma (2-3) durant les play-offs de printemps.</p>\n\n<p>C'est avec d'excellentes performances montrées durant ces play-offs que Maxlore a été repéré et invité à rejoindre les Giants Gaming pour le segment d'été. Le joueur a beaucoup à prouver pour cette saison car malgré une longue expérience, il arrive aujourd'hui aux LCS en terre inconnue.</p>\n","pl_PL":"Nubar „Maxlore” Sarafian\n<p>Pochodzącemu z Anglii Nubarowi „Maxlore” Sarafianowi nie można odmówić doświadczenia w grze na wysokim poziomie. Od rozpoczęcia pisania swojej legendy na scenie e-sportowej w październiku 2014 roku był członkiem ponad 10 różnych zespołów. Występował zarówno w barwach półprofesjonalnych drużyn, jak i powszechnie rozpoznawalnych organizacji. Pierwsze kroki stawiał w Perilous Gaming Rift, jednak po dwóch miesiącach zdecydował się opuścić jej szeregi. Podobny okres uczestnictwa w zespołach stał się dla niego swoistą regułą, gdyż nie udało mu się zostać w żadnym dłużej niż cztery miesiące. W lipcu 2015 roku miał okazję być rezerwowym graczem dla Gamers2, które właśnie wtedy było na etapie wywalczania sobie miejsca w lidze EU LCS. Jednak wkrótce, w październiku 2015 roku, odszedł z drużyny. </p>\n<p>Cały czas kontynuował poszukiwania idealnego zespołu, na dłużej zatrzymał się dopiero w Inspire eSports w grudniu 2015 roku. W jego szeregach miał okazję wykorzystać zebrane doświadczenie w drugorzędnej europejskiej lidze – EU CS. Podczas regularnego wiosennego splitu siał postrach grając Gravesem, osiągając nim imponujący współczynnik zwycięstw 71,4%. Dzięki tak dobrym wynikom udało mu się dostać do turnieju promocyjnego, w którym nagrodą był udział w kwalifikacjach do EU LCS. Nubar „Maxlore” Sarafian dał z siebie wszystko, pokazując niesamowity poziom w grze Nidalee, kiedy prowadził swoją drużynę do zwycięstwa. Jednak to nie wystarczyło – w wyjątkowo zaciekłym starciu przegrał z zespołem Huma. W marcu 2016 roku zdecydował się odejść z Inspire eSports.</p>\n<p>Kolejny rozdział w życiu Nubara „Maxlore” Sarafiana był bezpośrednim efektem jego wyczynów w poprzednich zespołach. W maju 2016 roku dostał ofertę zostania dżunglerem w drużynie Giants Gaming. Oczywiście skorzystał z okazji, ponieważ to oznaczało dla niego występ w pierwszorzędnej lidze EU LCS. O samym Angliku można się wiele dowiedzieć z jego portali społecznościowych, na których bardzo często się udziela. Dżungler Giants Gaming chętnie dzieli się z innymi swoimi doświadczeniami i opiniami. Szczególnie często jest pytany o rady jak grać jego ulubionymi postaciami: Lee Sinem, Nidalee i Rengarem. Zasłynął w grze nimi, kiedy dostał się do Kręgu Pretendenta w Europie.</p>"},"foreignIds":{"drupalId":"4435","TRLH4":"200000183","TRLH3":"200000080"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1090,"slug":"liv","name":"Hanssama","firstName":"Steven","lastName":"Liv","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/liv-a4dgwahi.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-21T21:14:43.000Z","updatedAt":"2017-06-09T10:54:49.000Z","bios":{"en_US":"<p>Steven \"Hans sama\" Liv got his competitive start in 2015, where he joined up with Milenium. Soon after Milenium lost in the EUCS playoffs, Hans sama made his way to Misfits in June of 2016. He helped propel them through Challenger and into the EU LCS for the 2017 Spring Split.</p>\n\n<p>Hans sama comes into the EU LCS at just 17 years old. Largely unproven and lacking the years of experience that many players have at this level, he will have to learn to adapt quickly and step his game up accordingly. Playing against tried and tested world class talent like Rekkles and Zven will prove to be one of the biggest hurdles of his career. He will need to stand up to the best or get swept aside like the rest. Game on.</p>","de_DE":"<p>Steven „Hans Sama“ Liv begann seine professionelle Karriere 2015, als er von Millenium aufgenommen wurde. Im Juni 2016 wechselte Hans Sama kurz nach der Niederlage von Millenium in den Entscheidungsspielen der EU CS zu den Misfits. Er half der Mannschaft, sich über die Challenger Series für den Frühjahrs-Split der EU LCS 2017 zu qualifizieren.\n\nHans Sama ist gerade einmal 17 Jahre alt, wenn er zum ersten Mal in der EU LCS spielen wird. Ihm fehlt die langjährige Erfahrung der meisten Spieler auf diesem Niveau und er wird lernen müssen, sich schnell anzupassen und zu verbessern. Dabei werden die Spiele gegen herausragende Talente wie Rekkles und Zven zu den größten Hürden seiner bisherigen Karriere. Er wird sich gegen die Besten behaupten müssen, sonst wird er wie der Rest aus der Kluft gefegt. Das Spiel kann beginnen.</p>"},"foreignIds":{"TRLH4":"200000155","TRLH3":"200000052"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1334,"slug":"alphari","name":"Alphari","firstName":"Barney","lastName":"Morris","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/alphari-3ozuf4zl.png","hometown":"UK","region":"EU LCS","birthdate":null,"createdAt":"2016-06-03T16:04:28.000Z","updatedAt":"2017-06-09T10:15:34.000Z","bios":{"en_US":"<p>Barney \"Alphari\" Morris began his career in 2015 and his play attracted the attention of Misfits who picked him up for their Challenger squad in 2016. He helped them carve a path through Europe’s Challenger scene and straight into the 2017 EU LCS Spring Split.</p>\n\n<p>Alphari spent time in Korea with his teammates in order to prepare for the challenge of playing at the highest level in Europe. He’ll need to come out of the gate swinging in order to keep up with hardened veterans in the top lane. It’ll largely be a trial by fire for the young talent, but the team’s bootcamp, coupled with tutelage from their veteran players, will play a key role in his development as he steps into one of the greatest challenges of his young career.</p>","de_DE":"<p>Barney „Alphari“ Morris begann seine Karriere 2015 und erregte mit seiner Spielweise die Aufmerksamkeit der Misfits, die ihn 2016 in die Mannschaft aufnahmen. Daraufhin half er der Mannschaft, sich einen Weg durch die europäische Challenger Series zu bahnen und den Frühjahrs-Split der EU LCS 2017 zu erreichen. \n\nAlphari verbrachte mit seinen Teamkameraden einige Zeit in Korea, um sich dort auf die kommenden Herausforderungen in Europa vorzubereiten. Er wird sein Bestes geben müssen, wenn er mit den abgehärteten Veteranen auf der oberen Lane mithalten will. Das junge Talent muss gleich eine Feuerprobe bestehen, wenn die größte Herausforderung seiner bisherigen Karriere beginnt, aber das Training mit der Mannschaft und die Hilfe der Veteranen sollten seine Entwicklung vorangetrieben haben.</p>"},"foreignIds":{"TRLH4":"200000152","TRLH3":"200000049"},"socialNetworks":{},"champions":[],"liveGameTeam":228},{"id":1549,"slug":"xani","name":"xani","firstName":"Nikola","lastName":"Zrinjski","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xani-hyhk8tx4.png","hometown":"Hırvatistan","region":"Turkey Championship League","birthdate":null,"createdAt":"2017-01-08T20:57:39.000Z","updatedAt":"2017-06-18T19:25:31.000Z","bios":{},"foreignIds":{"ESPORTSTMNT03":"200001260","ESPORTSTMNT02":"200002463"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1708,"slug":"iluzjonist","name":"Iluzjonist","firstName":"Ireneusz","lastName":"Opalinski","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/iluzjonist-7y1i5ny3.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-01-17T19:23:06.000Z","updatedAt":"2017-06-18T19:26:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002465"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1800,"slug":"saulius","name":"Saulius","firstName":"Saulius","lastName":"Lukosius","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/saulius-6di5vd8d.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-14T08:47:10.000Z","updatedAt":"2017-06-18T19:19:15.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000911"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1997,"slug":"darkside","name":"DarkSide","firstName":"Alejandro","lastName":"Gonzalez","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/darkside-c1utds31.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:38:38.000Z","updatedAt":"2017-07-22T13:16:01.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002483","ESPORTSTMNT03":"200001594"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":1998,"slug":"quixeth","name":"Quixeth","firstName":"August","lastName":"Nyheim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/quixeth-23nuqdyf.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-07T19:41:44.000Z","updatedAt":"2017-06-18T18:36:29.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2014,"slug":"dan-dan","name":"Dan Dan","firstName":"Danny","lastName":"Le Comte","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/dan-dan-3iu5iqv0.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:26:46.000Z","updatedAt":"2017-06-18T19:25:05.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002462"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2015,"slug":"scarletredhands","name":"ScarletRedHands","firstName":"Marcel","lastName":"Wiederhofer","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scarletredhands-e319a6um.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:31:14.000Z","updatedAt":"2017-06-18T19:24:14.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002464"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2016,"slug":"neon","name":"Neon","firstName":"Matus","lastName":"Jakubcik","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/neon-1a3sh94t.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:34:10.000Z","updatedAt":"2017-06-18T19:24:53.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002450"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2017,"slug":"yurner0s","name":"Yurner0s","firstName":"Mario","lastName":"Gonzalez","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/yurner0s-al9g9zx8.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-06-18T09:36:27.000Z","updatedAt":"2017-06-18T19:26:44.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200002466"},"socialNetworks":{},"champions":[],"liveGameTeam":71},{"id":2073,"slug":"sevenarmy","name":"SevenArmy","firstName":"Jan","lastName":"Fragstein","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sevenarmy-18fxuyzd.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-07-06T19:22:23.000Z","updatedAt":"2017-07-06T19:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":71}],"scheduleItems":[{"id":"AVmJu7glQMQFcjhwbQsn","content":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:match:e237c0e0-a095-4ed4-91a5-37e9f471f49d","scheduledTime":"2017-03-04T15:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0","blockLabel":"6","subBlockLabel":"3","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:bracket:612571e5-a5ba-4462-8221-9ed073eebeb5"},"match":"e237c0e0-a095-4ed4-91a5-37e9f471f49d","tournament":"56fcc0fc-3311-4e04-aa05-9cb386e64bc0","bracket":"612571e5-a5ba-4462-8221-9ed073eebeb5","league":"3"}],"gameIdMappings":[{"id":"ad777041-78d6-48da-8c79-a22e6d3ec894","gameHash":"47c9899fad0db995"},{"id":"0e7e7fe0-0863-404d-bf45-118b6fc817e5","gameHash":"1093bf6a2a8b4fb6"}],"videos":[{"id":5861,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:ad777041-78d6-48da-8c79-a22e6d3ec894","source":"https://www.youtube.com/embed/yqJb5DHz_d0?wmode=transparent","createdAt":"2017-03-04T18:38:03.000Z","updatedAt":"2017-03-04T18:38:03.000Z","game":"ad777041-78d6-48da-8c79-a22e6d3ec894"},{"id":5862,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:56fcc0fc-3311-4e04-aa05-9cb386e64bc0:game:0e7e7fe0-0863-404d-bf45-118b6fc817e5","source":"https://www.youtube.com/embed/1Pt2qPeNN3Q?wmode=transparent","createdAt":"2017-03-04T18:38:22.000Z","updatedAt":"2017-03-04T18:38:22.000Z","game":"0e7e7fe0-0863-404d-bf45-118b6fc817e5"}],"htmlBlocks":[],"match":{"id":"e237c0e0-a095-4ed4-91a5-37e9f471f49d","name":"OG-vs-MSF","position":33,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"},{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],"games":{"100363e3-6fdb-4ac0-9e6d-061b46ce0d0d":{"id":"100363e3-6fdb-4ac0-9e6d-061b46ce0d0d","name":"G3","generatedName":"MSF|OG|G3|e237c0e0a0954ed491a5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"ad777041-78d6-48da-8c79-a22e6d3ec894":{"id":"ad777041-78d6-48da-8c79-a22e6d3ec894","name":"G1","generatedName":"MSF|OG|G1|e237c0e0a0954ed491a5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"},{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}],"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488652806397,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488642904500,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001980228","gameRealm":"TRLH3","platformId":"TRLH3:1001980228","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0e7e7fe0-0863-404d-bf45-118b6fc817e5":{"id":"0e7e7fe0-0863-404d-bf45-118b6fc817e5","name":"G2","generatedName":"MSF|OG|G2|e237c0e0a0954ed491a5","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"},{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488652824857,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488646141905,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001980234","gameRealm":"TRLH3","platformId":"TRLH3:1001980234","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488652824858,"source":"bestOf","history":[{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488652806398,"source":"bestOf","closed":true},{"result":[[{"roster":"79bb0bed-3873-4a6c-91a2-b1098c381512"}],[{"roster":"1b468c86-d18a-4ead-bad5-e848189e9fa8"}]],"timestamp":1488646141905,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"1b468c86-d18a-4ead-bad5-e848189e9fa8":0,"79bb0bed-3873-4a6c-91a2-b1098c381512":1}}}