{"teams":[{"id":18,"slug":"cloud9","name":"Cloud9 ","guid":"be6c8a00-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/cloud9-gnd9b0gn.png","acronym":"C9","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2014-08-01T18:45:39.000Z","updatedAt":"2017-08-02T22:06:55.000Z","bios":{"en_US":"<p>The dream meme team is back for 2017 with some promising new additions. Although Cloud9 performed the best of any North American team at the 2016 World Championship, they weren’t satisfied with their quick exit in the quarterfinals. Former Challenger scene standout Contractz was handed the reigns to the jungle in his rookie season. The team also acquired Ray, Apex Gaming’s former playmaking top laner. \n\n<p>Despite a strong split, the team once again fell to TSM in the 2017 NA LCS Spring Split finals. Heading into summer, if Cloud9's young players can hone their raw talent, the team could rise to new heights this year.</p>\n\n<p>Coach: Han-gyu \"Reapered\" Bok<p>","fr_FR":"<p>Cloud9 a fait une entrée fracassante sur la scène compétitive de League of Legends pendant la saison 3, lors du segment d'été des LCS NA, avec un score astronomique de 25-3. Suite à ses débuts spectaculaires, l'équipe a fait plusieurs apparitions lors de championnats régionaux et internationaux, allant des play-offs régionaux des LCS NA au Championnat du monde. Toutefois, Cloud9 est tombée de son piédestal en 2015, retombant à la 7e place du segment d'été des LCS NA 2015. Malgré un parcours bien ficelé jusqu'en finale du tournoi régional NA 2015 qui a valu à C9 de se qualifier pour le Championnat du monde 2015, les performances de l'équipe ont soulevé de nombreuses questions. Reste à savoir si ses membres possèdent encore le talent nécessaire pour s'imposer comme ils ont su le faire par le passé.</p>","pl_PL":"<p>C9 to, obok Teamu SoloMid, najbardziej utytułowana amerykańska organizacja w historii. Cloud9 znane jest z utrzymywania nieustannie wysokiego poziomu oraz przywiązania do graczy. Podczas gdy inne drużyny dokonują co najmniej kilku zmian rocznie, w zespole, której symbolem jest niebieska chmurka, przez pierwsze dwa lata współpracy… nie było żadnych rotacji.</p>\n<p> \nZaczęło się zwyczajnie, od przygody z Quantic Gaming, gdzie w 2012 roku występował obiecujący skład złożony z Haia, LemonNationa, Nientosoha, Wild Turtle’a i Yazukiego. Pierwsze podejście drużyny do NA LCS było nieudane, ale na początku 2013 roku gracze i organizacja zdecydowali się dać sobie drugą szansę w nieco zmienionym składzie, a do zespołu dołączyli Balls, Meteos i Sneaky. Formacja bez trudu przeszła eliminacje i po zwycięstwie w meczu barażowym dostała się do letniego splitu NA LCS 2013. Miała to być dopiero druga edycja rozgrywek, a jednocześnie początek legendy Cloud9.</p>\n<p>\nByło powszechnie wiadomo, że nowy zespół w stawce jest naprawdę dobry, ale nie że aż tak dobry. Cloud9 całkowicie zdominowało rozgrywki, ustanawiając niewyobrażalny rekord 25-3, bo tyle wynosił bilans drużyny na koniec sezonu zasadniczego. C9 nie zamierzało jednak poprzestawać na wygraniu sezonu zasadniczego i w play-offach poszło za ciosem – 2:0 z Dignitas i 3:0 z TSM-em w finale zapewniły beniaminkowi triumf w debiutanckim splicie w NA LCS.</p>\n<p>\nTo z kolei pozwoliło Cloud9 na wyjazd na Mistrzostwa Świata. Oczekiwania kibiców były ogromne, ale zespół nie sprostał presji, odpadając z rywalizacji w swoim pierwszym meczu, w ćwierćfinale przeciwko Fnatic. Tę klęskę C9 powetowało sobie na krajowym podwórku – rok 2014 znów stał pod znakiem niebieskobarwnej dominacji, czego dowodzi kolejny fantastyczny split zakończony wynikiem 24-4 i triumf w wiosennych play-offach. Latem z formą zespołu było już nieco gorzej, a wygranie fazy zasadniczej przyszło C9 z dużym trudem. Ostatecznie w finale play-offów Cloud9 było zmuszone uznać wyższość Teamu SoloMid. Wystarczyło to, by po raz kolejny pojechać na światowy czempionat i niestety po raz kolejny zawodnicy C9 wracali ze spuszczonymi głowami po odpadnięciu w ćwierćfinale.</p>\n<p>\nWiosna 2015 była już łabędzim śpiewem formacji, której po raz kolejny udało się dostać do finału play-offów NA LCS. Tam jednak nie sprostali świetnie dysponowanemu Teamowi SoloMid, który po raz drugi z rzędu zwyciężył w rozgrywkach, jednocześnie po raz drugi spychając C9 na drugą pozycję.</p>\n<p>\nTo jednak był dopiero początek problemów zespołu, który coraz bardziej oddalał się od swoich najlepszych czasów. Narastające wewnętrzne problemy oraz uciążliwe kontuzje zmusiły Haia „Haia” Lama do rezygnacji z występów. Legendę zespołu zastąpił na środkowej alei ogromny duński talent, Nikolaj „Incarnati0n” Jensen, który został właśnie dopuszczony do grania na profesjonalnej scenie. Szybko okazało się jednak, że Incarnati0n potrzebuje trochę czasu na aklimatyzację, a cały zespół – Haia. Zastąpienie doświadczonego shot-callera okazało się niemożliwe i gra zespołu, który okupował dolne rejony tabeli, nie wyglądała najlepiej. Hai wrócił, zastępując Williama „Meteosa” Hartmana w roli dżunglera i doprowadził formację do utrzymania, a dzięki niezłej wiośnie, drużyna dostała się również do baraży o wyjazd na Mistrzostwa Świata. I znów – udało się. Co ciekawe, C9 było w tym splicie bliskie odpadnięcia z rywalizacji, a bezpieczne, siódme miejsce wywalczyło dopiero w dodatkowym meczu barażowym przeciwko Teamowi 8.</p>\n<p>\nNa MŚ, po pierwszej rundzie fazy grupowej, wydawało się, że sen C9 będzie trwał – drużyna wygrała wszystkie trzy mecze i mogło było odnieść wrażenie, że tylko kataklizm może pozbawić ją miejsca w ćwierćfinale. No cóż – trzy porażki i przegrana w barażach o drugie miejsce okazały się właśnie takim kataklizmem. Nie udało się. Zespół przygotowuje się do sezonu 2016 bogatszy o ostatnie doświadczenia i zamierza powrócić na pierwsze miejsce, a pomóc mają interesujące zmiany w składzie.</p>\n<p>\nW przerwie między rozgrywkami Hai przeniósł się na pozycję wspierającego, którą pełnić będzie wespół z utalentowanym Michaelem „BunnyFuFuu” Kurylo, który przybył z Gravity. Pozycję dżunglera zajął natomiast rozchwytywany po rozpadzie Teamu Impulse Koreańczyk Lee „Rush” Yoon-jae, który był objawieniem sezonu 2015 w NA LCS.</p>\n","de_DE":"Das Meme-Dream-Team kehrt 2017 mit einigen vielversprechenden Neuzugängen zurück. Obwohl Cloud9 das beste nordamerikanische Team bei der Weltmeisterschaft 2016 war, gaben sie sich mit dem schnellen Ausscheiden im Halbfinale nicht zufrieden. Contractz, der vor allem durch seine Leistungen in der Challenger Series bekannt wurde, übernimmt in seiner ersten Saison die Führung im Dschungel. Das Team hat außerdem Ray aufgenommen, der früher als Spielmacher bei Apex Gaming in der oberen Lane tätig war. Wenn sie es schaffen, ihr rohes Talent mit den Führungsqualitäten der Veteranen zu kombinieren, könnte Cloud9 dieses Jahr neue Höhen erklimmen.</p>\n<p>\nCoach: Trainer: Han-gyu „Reapered“ Bok</p>\n","es_ES":"<p>Nadie puede discutir que el camino para llegar al Mundial de Cloud9 ha sido más duro que el de ningún otro equipo. Tras una dolorosa derrota contra TSM en la final de la LCS NA, el equipo consiguió una vez más superar el clasificatorio regional y reservarse el último puesto para representar a Norteamérica en el Mundial. Ha sido un viaje agotador, pero la experiencia seguro que no tiene precio. Cloud9 ya ha jugado cinco enfrentamientos al mejor de 5 sin haber pisado aún siquiera el escenario del Mundial.</p> \n<p>Tras una temporada regular durante la que tuvieron problemas de coordinación en algunos momentos, han jugador de forma mucho más coherente durante los playoffs. Si pueden sacar provecho de su arduo camino hasta el Mundial, van a ser una fuerza a tener en cuenta en el escenario internacional.</p>","pt_BR":"É difícil negar que alguma outra equipe teve um caminho mais árduo para o Mundial do que a Cloud9. Depois de uma derrota arrasadora para a TSM nas Finais de Verão da NA LCS, a equipe se reergueu e lutou mais uma vez pelas Classificatórias Regionais para conseguir a última vaga da América do Norte para o Mundial. A jornada foi difícil, mas a experiência pode ter sido de grande valor. Cloud9 agora já jogou cinco partidas separadas de Melhor de 5 antes mesmo de ir para o Mundial. Depois de uma temporada regular que mostrou algumas dificuldades em sinergia, eles estavam muito mais coesos nas eliminatórias. Se eles puderem usar seu árduo caminho para o Mundial como uma vantagem, eles certamente serão uma força a ser reconhecida no palco internacional","es_AR":"<p>Es muy difícil encontrar un equipo que haya luchado más que Cloud9 para llegar al Mundial. Después de una desgarradora derrota ante TSM en la final del torneo de clausura de la LCS NA, el equipo se repuso y volvió a competir en las clasificatorias regionales para ganarse el último boleto de Norteamérica al Mundial. Fue una hazaña agotadora, pero la experiencia obtenida es una recompensa invaluable. Cloud9 ya ha jugado cinco combates al mejor de cinco antes de aparecer en el Mundial. Aunque tuvieron problemas para trabajar bien en grupo en la temporada regular, supieron complementarse mucho más en las eliminatorias. Si saben aprovechar la experiencia obtenida en el arduo camino que atravesaron para llegar al Mundial, serán una fuerza que dejará su huella en el escenario internacional.</p>\n\n<p><strong>Entrenador: Han-gyu \"Reapered\" Bok</strong></p>"},"foreignIds":{"drupalId":"304"},"players":[45,115,163,255,482,499,508,1120],"starters":[45,115,482,499,1120],"subs":[163,255,508]},{"id":166,"slug":"immortals","name":"Immortals","guid":"be704ab6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/immortals-7frapkxr.png","acronym":"IMT","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":null,"createdAt":"2015-12-14T18:13:38.000Z","updatedAt":"2017-05-25T18:14:48.000Z","bios":{"fr_FR":"<p>Nouveaux venus sur la scène de l’e-sport, l’équipe des Immortals participera pour la première fois en saison 6 aux LCS NA après avoir racheté la place de Team 8 dans la ligue. Un changement d'équipe, mais aussi un changement d'échelle symptomatique de l'évolution de l'e-sport en général. Ainsi, là où Team 8 a toujours été une petite organisation fondée à l'origine par un groupe de joueurs et portés par le charisme de son top laner Steven « CaliTrlolz » Kim, Immortals entend bien faire très vite partie des poids lourds de l'e-sport mondial.</p>\n\n<p>Sous l'impulsion de son PDG, Noah Whinston, l'organisation entend « être une entreprise profitable et ayant réussi sur le long terme, quitte à ne pas faire de profit pendant les six premiers mois ou même la première année de son existence », comme il l'a déclaré en novembre 2015 au DailyDot. Pour cela Noah Whinston a mis les moyens, ou plutôt a su faire venir et rassembler les moyens nécessaires. Immortals est en effet la première équipe LCS dont la constitution a été financée par un consortium d'investisseurs extérieurs, venant aussi bien des sports traditionnels (comme Steve Kaplan, actionnaire d'une équipe NBA) que d'entreprises impliquées dans le web ou les nouvelles technologies. Par ce seul fait, Immortals se distingue de la majorité des équipes LCS et participe pleinement à l'évolution actuelle de l'e-sport. Sur le plan sportif justement, l'entreprise a su rassembler une équipe de stars confirmées ou en devenir et peut donc légitimement nourrir de grands espoirs pour la saison 6 des LCS NA.</p>\n\n<p>Désormais, seul le plus dur reste à faire : confirmer ces ambitions et répondre aux attentes des fans.</p>\n","en_US":"<p>Immortals’ first roster couldn’t live forever. Despite a combined regular season record of 33-3 in the 2016 NA LCS Spring and Summer splits, the league’s newest juggernaut twice failed to get rolling in the playoffs. First, they were shocked by TSM in the spring, then left stunned by Cloud9 in the summer. Regular season success wasn’t enough; something had to change.</p>\n\n<p>Immortals almost completely upended their roster to start 2017. Pobelter was the only returning member from the previous squad. With so many new members, Immortals took time to mesh, but eventually found a groove late in the season. With yet another new member in Xmithie, Immortals will have to adjust more quickly to have a shot at playoffs this summer.</p>\n\n<p>Coach: Sang-soo \"Ssong\" Kim</p>","pl_PL":"<p>Wejście Immortals na scenę esportową zostało ogłoszone 7 października 2015 roku. Organizacja wywodzi się z drużyny Team 8, której miejsce zajęła w rozgrywkach NA LCS. Stworzenie prekursora ekipy „nieśmiertelnych” miało miejsce 2 lata wcześniej – w grudniu 2013 roku. Do rozgrywek NA LCS dostała się aż po roku zmagań w Challenger Series, brała udział w tych zmaganiach w wiosennym i letnim sezonie 2015. Pod koniec sezonu piątego otarła się o relegacje, co było powodem zmiany właściciela całej drużyny. Pierwotnie przejęciu miał ulec również skład tego zespołu, lecz ostatecznie zawodnicy znani z Team 8 odeszli. Został tylko support, który na dodatek przeszedł do kadry zajmującej się graczami. Kang \"Dodo8\" Jun-hyeok został głównym menadżerem zajmującym się zupełnie nowym składem personalnym drużyny.</p>\n<p>\nNowa organizacja, zaraz po hucznym ogłoszeniu nowych zawodników swojej drużyny 8 grudnia 2015 roku, zaczęła się bardzo aktywnie udzielać na portalach społecznościowych. Najpierw zabrała się za prezentację graczy – krótkich form filmowych publikowanych w internecie. Trzeba przyznać, że wyróżniła się tą akcją wśród innych stowarzyszeń, gdyż dotychczas żadna nie zrobiła takiej kampanii reklamowej swoim członkom. Internet zapełnił się zdjęciami z codziennego życia graczy, pomimo bardzo młodego wieku drużyny. Sami zawodnicy przyciągnęli do zespołu rzesze swoich fanów, dzięki czemu dyskusje i moralne wsparcie dla Immortals w sieci kwitną. W szczególności, że pierwotny skład uwzględnia graczy o zawrotnie rosnącej sławie, jak na przykład Heo \"Huni\" Seung-hoon. Wielbiciele i spora część analityków uważa, że na początku sezonu 6 ‘nieśmiertelni’ to najlepszy skład Ameryki Północnej.</p>\n<p>\nWiele sekretów z początków organizacji ujrzało światło dzienne w wywiadzie z dyrektorem generalnym Immortals - Noahem Whinstonem. Opowiadał o tym jak to jest być osobą decyzyjną w stowarzyszeniu, pomimo nieznajomości wszystkich szczegółów. Według niego ta drużyna nie jest projektem opartym na jego marzeniach, tylko na biznesowych wyliczeniach. Jego zadanie polega na zadbaniu żeby drużyna się rozwijała, a zawodnikom niczego nie brakowało - czuje się bardzo odpowiedzialny za sukces Immortals. Noah zamierza się aktywnie udzielać w życiu League of Legends. Jedną z pierwszych rzeczy po oficjalnym ogłoszeniu założenia organizacji, którą zrobił to poparcie ujawnienia listy płac zawodników. Swoim stanowiskiem dąży do pokazania, że e-sport w większej ilości kategorii trzeba traktować jak klasyczny sport. \n</p>","de_DE":"Die erste Aufstellung der Immortals war nicht unsterblich. Obwohl sie im Frühjahrs- und Sommer-Split der NA LCS 2016 einen Saisonrekord von 33–3 aufstellten, ist der neueste Riese der Liga bereits zweimal an den Entscheidungsspielen gescheitert. Zuerst wurden sie im Frühling von TSM geschockt und im Sommer hat sie Cloud9 auf den Boden der Tatsachen zurückgeholt. Der Erfolg in der regulären Saison war nicht genug, es musste sich etwas ändern.\n</p>\nDie Immortals haben ihre Aufstellung für 2017 beinahe gänzlich umgekrempelt. Pobelter ist das einzige Mitglied, das vom alten Team übrig ist. Mit so vielen Neuzugängen kann man nur schwer abschätzen, wozu die Immortals in der Lage sind, über eine Menge Potenzial verfügen sie aber allemal. Wenn es eine Mannschaft gibt, die die Immortals zu ihrem ersten Sieg in den Entscheidungsspielen führen kann, dann diese.\n</p>\nCoach: David „Hermes“ Tu\n"},"foreignIds":{},"players":[89,265,597,598,779,1103,1105],"starters":[89,265,597,598,779],"subs":[1103,1105]}],"players":[{"id":45,"slug":"impact","name":"Impact","firstName":"Eonyoung","lastName":"Jeong","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/impact-8a44ib2j.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:10.000Z","updatedAt":"2017-07-04T19:26:43.000Z","bios":{"en_US":"<p>Former World Champion Eonyoung “Impact” Jeong isn’t quite ready to hang up the mouse and keyboard. The former SK Telecom T1 top laner put on a show in the 2016 NA LCS Playoffs, proving no other top laner in North America measured up. While his regular season was uninspiring, he almost singlehandedly earned Cloud9 a spot at the 2016 World Championship.</p>\n\n<p>Unfortunately, Impact struggled to find his groove on the world stage. Cloud9 was the only NA team to earn a quarterfinals berth, but they were quickly eliminated by Samsung Galaxy. As the shield to Ray's sword, the dynamic duo dominated the competition in the 2017 NA LCS Spring Split. With such talent in the top lane, Cloud9’s opponents’ nightmares will be just two words, repeating forever: “top die.”</p>","fr_FR":"<p>L'ancien champion du monde Eonyoung \"Impact\" Jeong n'est pas prêt à raccrocher souris et clavier. Après un segment d'été des LCS NA peu inspiré, l'ancien top laner de SK Telecom T1 a eu le vent en poupe durant les play-offs. Aucun autre top laner en Amérique du Nord n'est arrivé à la hauteur de ses performances lors des play-offs, et Cloud9 doit une grande partie de son succès post-saison à son jeu spectaculaire, ce qui a également permis de mettre un terme aux problèmes de communication qui affectaient Cloud9.</p>\n\n<p>En dépit de sa domination régionale, Impact a eu du mal à trouver ses marques dans le Championnat du monde cette année. Alors qu'il s'est montré inébranlable sur la voie du haut pour Cloud9 durant les play-offs, il a trouvé des adversaires à sa hauteur avec les top laners Duke de SK Telecom T1 et CuVee de Samsung Galaxy. Toutefois, Impact et les autres joueurs de Cloud9 ont le mérite d'être la seule équipe d'Amérique du Nord à avoir atteint les quarts de finale, et Impact les représentera lors de l'événement All-Stars. Avec 41,7 pour cent du vote top laner, il aura une chance supplémentaire cette année de \"déchirer la voie du haut\".</p>","pl_PL":"Były Mistrz Świata, Eonyoung „Impact” Jeong, nie zamierza jeszcze zawiesić na kołku mysz i klawiatury. Po niezbyt udanych występach w letnim splicie NA LCS dawny górny SKTelecom T1 szalał w fazie pucharowej. Żaden inny górny w Ameryce Północnej nie dorównywał formą Impactowi podczas playoffów, a Cloud9 zawdzięczają w dużej mierze swój sukces po sezonie jego znakomitej grze. Rozwiały się także wątpliwości dotyczące problemów z komunikacją wewnątrz Cloud9.\n</p>\nPomimo dominacji w regionie, Impact nie potrafił odnaleźć się w tym roku na Mistrzostwach Świata. Chociaż podczas fazy pucharowej na górnej alei Cloud9 był nie do ruszenia, znalazł równych sobie w postaci górnego SK Telecom T1, Duke’a i CuVee z Samsung Galaxy. Mimo to, Impact i reszta Cloud9 zasługują na uznanie jako jedyna drużyna z Ameryki Północnej, która dotarła do ćwierćfinałów. Wkrótce Impact będzie ją reprezentował na wydarzeniu All-Star. Mając 41,7 procenta głosów na górnego, dostanie w tym roku jeszcze jedną szansę, by pokazać jak „góra umiera”.\n","de_DE":"Der ehemalige Weltmeister Eonyoung „Impact“ Jeong ist noch nicht bereit, Maus und Tastatur an den Nagel zu hängen. Der ehemalige Top-Laner von SK Telecom T1 hat bei den Entscheidungsspielen der NA LCS 2016 eine Show abgeliefert und damit bewiesen, dass ihm kein Top-Laner in Nordamerika das Wasser reichen kann. Obwohl seine Leistungen in der regulären Saison uninspiriert waren, hat er Cloud9 fast im Alleingang zur Weltmeisterschaft 2016 geführt.</p>\n<p>\nLeider hatte Impact bei der Weltmeisterschaft Probleme damit, seinen Rhythmus zu finden. Cloud9 war das einzige nordamerikanische Team, das sich einen Platz im Viertelfinale sichern konnte, allerdings sind sie anschließend direkt an Samsung Galaxy gescheitert. In diesem Frühjahrs-Split wird Impact versuchen, auf einem noch höheren Level zu spielen. Darüber hinaus wird er Ray, seinen neuen Teamkollegen, unter seine Fittiche nehmen. Der talentierte Top-Laner wird den Gegnern von Cloud9 Albträume bescheren, in denen sich zwei Worte unendlich wiederholen: „top die“.\n","es_AR":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","es_ES":"<p>Aún no ha llegado el momento de que el que fuera campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del split de verano de la LCS NA poco inspirado, el exjugador de la calle superior de SK Telecom T1 lo dio todo en los playoffs. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallan las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en la calle superior para Cloud9 durante los playoffs, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su jugador de la calle superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para la calle superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>","pt_BR":"<p>Ex-campeão do mundo, Eoyoung “Impact” Jeong ainda não está preparado para pendurar o mouse e o teclado. Após um começo nada inspirador na Etapa de Verão da NA LCS, o ex-topo da SK Telecom T1 arrasou nas eliminatórias. Nenhum outro jogador de topo da América do Norte chegou perto de seu desempenho, e a Cloud9 deve de seu sucesso de pós-temporada à sua mecânica incrível, que também acabou com as preocupações de comunicação interna da equipe.</p>\n\n<p>Apesar da dominância regional, Impact teve dificuldades em se manter constantemente bem no Campeonato Mundial deste ano. Apesar de ter sido imprescindível na rota do topo para a Cloud9 durante as eliminatórias, ele encontrou adversários à altura como Duke, da SK Telecom T1 e CuVee, da Samsung Galaxy. Impact e o restante da Cloud9 merecem o crédito de terem sido a única equipe da América do Norte a chegar nas quartas-de-final, fazendo dele o representante da equipe para o Evento All-Star. Com 41,7% dos votos da rota do topo, ele terá mais uma chance de acabar com o topo.</p>","cs_CZ":"<p>Bývalý mistr světa Eonyoung „Impact“ Jeong ještě není připraven pověsit klávesnici a myš na hřebík. Po neslaném nemastném letním splitu severoamerického LCS se v play-off tento dřívější horní lajnař z SK Telecom T1 doslova utrhl ze řetězu. Žádný jiný horní lajnař ze Severní Ameriky se s jeho formou ve vyřazovací části turnaje nemohl měřit a Cloud9 za svůj úspěch z velké části vděčili právě jeho hvězdným výkonům, čímž navíc vzaly zasvé obavy, že se Cloud9 potýká s komunikačními problémy.</p>\n\n<p>Ačkoliv ve svém regionu řádil Impact jako černá ruka, na letošním mistrovství světa se mu už tak skvěle nedařilo. Během vyřazovacích zápasů byl sice v horní lajně pro Cloud9 cennou oporou, našel však sobě rovné v Dukovi z SK Telecom T1 a v CuVeem ze Samsung Galaxy. Přesto si Impact a zbytek Cloud9 zaslouží uznání za to, že se stali jediným severoamerickým týmem, který se probojoval do čtvrtfinále, a Impact bude tento region reprezentovat i na turnaji All-Star. Z hráčů v horní lajně obdržel 41,7 % hlasů a bude tak mít letos ještě jednu šanci provést svůj klasický „top die“.</p>","el_GR":"<p>Ο πρώην Παγκόσμιος Πρωταθλητής Eonyoung “Impact” Jeong δεν είναι ακόμα έτοιμος να κρεμάσει το ποντίκι και το πληκτρολόγιό του. Μετά από ένα απογοητευτικό Summer Split στο LCS Βόρειας Αμερικής, ο πρώην παίκτης επάνω λωρίδας των SK Telecom T1 έκανε μια καταπληκτική εμφάνιση στα πλέι οφ. Κανένας άλλος παίκτης επάνω λωρίδας στη Βόρεια Αμερική δεν μπόρεσε να συγκριθεί μαζί του στα πλέι οφ και οι Cloud9 οφείλουν μεγάλο μέρος της επιτυχίας τους στους αγώνες μετά το τέλος της σεζόν στην εκπληκτική του φόρμα, αποστομώνοντας και όσους έλεγαν ότι οι Cloud9 είχαν προβλήματα επικοινωνίας.</p>\n\n<p>Παρά την κυριαρχία του σε τοπικό επίπεδο, ο Impact δυσκολεύτηκε πολύ να βρει το ρυθμό του στο φετινό Παγκόσμιο Πρωτάθλημα. Παρόλο που ήταν πραγματικός τοίχος στην επάνω λωρίδα των Cloud9 κατά τη διάρκεια των πλέι οφ, δυσκολεύτηκε πολύ ενάντια σε άλλους δυνατούς παίκτες επάνω λωρίδας, όπως τον Duke των SK Telecom T1 και τον CuVee των Samsung Galaxy. Ωστόσο, ο Impact και οι υπόλοιποι Cloud9 αξίζουν ένα μεγάλο «μπράβο» που ήταν η μοναδική ομάδα από τη Βόρεια Αμερική που κατάφερε να φτάσει στους προημιτελικούς. Μάλιστα, ο Impact θα εκπροσωπήσει την ομάδα του και στο Τουρνουά All-Star. Άλλωστε, ήταν ο παίκτης που συγκέντρωσε το 41,7% των ψήφων για την επάνω λωρίδα, άρα θα έχει την ευκαιρία να δείξει αν είναι όντως ο καλύτερος στη θέση του.</p>","hu_HU":"A korábbi világbajnok Eonyoung „Impact” Jeong még nem szeretné szögre akasztani az egeret és a billentyűzetet. Az NA LCS gyenge nyári szakasza után az SK Telecom T1 egykori felső ösvényese nagyon rákapcsolt a rájátszásban. Egyetlen másik észak-amerikai játékos sem tudott felérni hozzá, és a Cloud9 jórészt neki köszönheti a szezon utáni sikereit, amivel egyébként sikerült eloszlatni a Cloud9 kommunikációs problémáival kapcsolatos pletykákat is.\n</p>\nA regionális sikerek ellenére Impact nehezen talált magára az idei világbajnokságon. Bár a Cloud9 felső ösvényén nem akadt ellenfélre a rájátszás során, a vb-n olyanokkal kellett szembenéznie, mint Duke (SK Telecom T1) és CuVee (Samsung Galaxy). Impact és a Cloud9 többi tagja egyedüli észak-amerikai csapatként jutott a negyeddöntőig, és Impact képviselheti őket az All-Star gálán. A felső ösvényesekre leadott szavaztok 41,7%-át söpörte be, így idén kap még egy utolsó esélyt, hogy bizonyítson.\n","it_IT":"L'ex campione del mondo Eonyoung \"Impact\" Jeong sembra non avere ancora intenzione di appendere mouse e tastiera al chiodo. Dopo un Summer Split LCS NA poco ispirato, l'ex superiore di SK Telecom T1 si è fatto valere durante i playoff. Nessun altro giocatore top in Nord America è riuscito a tenergli testa durante questo periodo e Cloud9 deve gran parte del suo successo post-stagionale alle sue giocate stellari, che hanno messo anche a tacere le voci che parlavano di problemi di comunicazione interni alla squadra.\n</p>\nNonostante il predominio nella sua regione, Impact ha sofferto molto per trovare il giusto ritmo ai Mondiali di quest'anno. Pur essendo un elemento immancabile nella corsia superiore dei Cloud9 durante i playoff, ha avuto filo da torcere contro giocatori nel suo stesso ruolo del calibro di Duke degli SK Telecom T1 e CuVee dei Samsung Galaxy. In ogni caso, Impact e i suoi compagni dei Cloud9 meritano un encomio per essere stati l'unico team nordamericano a raggiungere i quarti di finale, e sarà proprio Impact a rappresentarli nell'evento All-Star. Forte del 41,7% dei voti per la categoria Superiore, ora avrà un'altra occasione per dominare la sua corsia.\n","ro_RO":"Fostul Campion Mondial Eonyoung ''Impact'' Jeong nu e încă pregătit să lase deoparte mouse-ul și tastatura. După o etapa de vară neinspirată în LCS NA, fostul jucător de pe culoarul de sus al SK Telecom T1 a avut parte de o serie de victorii în playoff-uri. Niciun alt jucător de pe culoarul de sus din America de Nord nu s-a ridicat la forma sa din playoff-uri. Cloud9 datorează o mare parte din succesul său de după sezon manevrelor excepționale ale lui Impact, care au pus capăt neliniștilor legate de problemele de comunicare ale echipei.\n</p>\nÎn ciuda dominației sale regionale, Impact nu a reușit să se facă remarcat la Campionatul Mondial din acest an. Cu toate că a fost o forță de neoprit pe culoarul de sus pentru Cloud9 în timpul playoff-urilor, și-a întâlnit nașii în Duke de la SK Telecom T1 și în CuVee de la Samsung Galaxy. Însă cei din Cloud9 merită apreciați pentru că au fost singura echipă din America de Nord care a ajuns în sferturile de finală, iar Impact își va reprezenta regiunea la All-Star Event. Cu 41,7 la sută din voturile pentru culoarul de sus, va mai avea o șansă anul acesta să-și omoare adversarii de unul singur, fără ajutorul nimănui.\n","ko_KR":"","es_MX":"<p>Aún no ha llegado el momento de que el antiguo campeón del mundo, Eonyoung \"Impact\" Jeong, cuelgue el ratón y el teclado. Tras un comienzo del torneo de verano de la LCS NA poco inspirado, el exjugador del carril superior de SK Telecom T1 lo dio todo en la fase eliminatoria. Ningún otro top de Norteamérica pudo equiparar su actuación en los playoffs y Cloud9 le debe gran parte de sus éxitos tras la temporada regular a sus jugadas estelares, que también acallaron las preocupaciones sobre los problemas de comunicación del equipo.</p>\n\n<p>A pesar de su dominación regional, Impact no consiguió encontrar su mejor nivel en el Campeonato Mundial de este año. Aunque fue esencial en el carril superior para Cloud9 durante las fases eliminatorias, las complicaciones llegaron al enfrentarse en el Mundial a los top de SK Telecom T1, Duke, y Samsung Galaxy, CuVee. Sin embargo, Impact y el resto de Cloud9 se merecen el reconocimiento de ser el único equipo de Norteamérica que llegó a los cuartos de final y será su carrilero superior quien los represente en el All-Star Event. Con un 41,7 % de los votos para el superior, tendrá una nueva oportunidad este año de continuar con su \"top die\" (top muerto).</p>"},"foreignIds":{"drupalId":"691","TRLH1":"200000172","TRLH2":"200000076","TRLH3":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":89,"slug":"xmithie","name":"Xmithie","firstName":"Jake","lastName":"Puchero","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xmithie-4jnznvb3.png","hometown":"Philippines","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:36.000Z","updatedAt":"2017-06-02T18:40:01.000Z","bios":{"en_US":"<p>Jake “Xmithie” Puchero is a longtime jungler in the NA League of Legends scene. He’s been a quiet workhorse for Counter Logic Gaming, always ready to pick the champion or build the items that his team needs. As Doublelift says of his former teammate, \"He’s just a really smart player. A lot of the time he'll stop their back line from doing damage and that's all you need. A player that's extremely disruptive. He doesn't get all the farm, he doesn't get all the kills, he doesn't make flashy plays. But he's really consistent and really smart and puts in a lot of work.”</p>\n\n<p>After another admirable split for CLG to start 2017, change is coming for Xmithie. As the new jungler for Immortals, he'll join his former teammates Pobelter and top lane icon Flame. Consistency has always been the name of the game for Xmithie-- look for him to be the calm amidst the storm as Immortals fight for a spot in the playoffs this summer.</p>","fr_FR":"<p>Jake « Xmithie » Puchero est un jungler bien connu de la scène nord-américaine de League of Legends. Il \n\nest une force tranquille et polyvalente pour Counter Logic Gaming, toujours prêt à accepter le champion \n\nou les objets dont son équipe a besoin. Comme le dit Doublelift de son ancien coéquipier : « C'est un \n\njoueur très intelligent. Souvent, il va empêcher la ligne arrière de l'adversaire d'infliger des dégâts, et \n\nc'est exactement ce dont vous avez besoin. D'un joueur qui gêne vraiment l'adversaire. Ce n'est pas lui \n\nqui farme le plus, ce n'est pas lui qui fait tous les kills, il n'a pas un jeu spectaculaire. Mais il est toujours \n\nfiable, très intelligent, et il travaille beaucoup. » Et pour une équipe comme CLG, qui possède déjà des \n\ncarrys menaçants comme Darshan et HuHi, un jungler tourné vers les besoins de l'équipe est un \n\ncomplément idéal. Xmithie est le héros dont ils ont besoin.</p>\n\n<p>N'allez toutefois pas croire à l'attitude discrète de Xmithie qu'il n'est pas capable de jouer carry. Il a \n\nacquis une certaine réputation de tueur de combattants, comme Vi et Lee Sin, et il a obtenu un \n\nincroyable KDA de 9,6 avec Gragas lors du segment d'été des LCS NA 2015.</p>","pl_PL":"<p>J\"Xmithie\" zaczął się fascynować grami w bardzo młodym wieku, ponieważ jego ojciec posiadał sklep komputerowy. Miał okazję grać na większości dostępnych wtedy konsoli, początkowo interesując się głównie tytułami FPS. Kiedy znudziły mu się „strzelanki”, wciągnął się w pozycje typu MOBA na stacjonarnym komputerze. Jake zaczął przygodę z League of Legends w pierwszym sezonie, grając ze swoją dziewczyną. Wkrótce potem znalazł się w środowisku najlepszych graczy i dołączył do swojej pierwszej poważnej drużyny – ApictureOfAGoose, którą poznał podczas pomniejszego turnieju Go4LoL. Brał wtedy udział w kwalifikacjach do szóstego sezonu IEM Kiev, lecz ostatecznie nie dostał się dalej. Kolejnym przełomem w jego historii było członkostwo w zespole Team Vulcun, później przemianowanym na XDG Gaming. Tam rozwinął swoje skrzydła i został zauważony wśród innych graczy, przez społeczeństwo League of Legends. W wiosennym sezonie NA LCS 2013 zajął z drużyną piąte miejsce w tabeli, lecz podczas rozgrywek barażowych znaleźli się na podium. Lepszym rezultatem mogli się pochwalić podczas letniego sezonu NA LCS 2013, gdzie zespół Team Vulcun zajął drugą pozycję. W ten sposób okazał się być lepszy od doświadczonych amerykańskich zespołów, takich jak Team SoloMid czy Team Curse. Wyżej wymienione wydarzenia w karierze oraz umiejętności Jake’a sprawiły, że został uznany za jednego z lepszych junglerów w Ameryce. Jednak jego największym osiągnięciem było dostanie się na Mistrzostwa Świata 2013. Wygrał z takimi zespołami jak Fnatic i Mineski, lecz pomimo tego nie udało mu się wyjść z fazy grupowej. Ostatecznie odnalazł swoje miejsce w grudniu 2014 roku w Counter Logic Gaming, gdzie spędził cały sezon piąty i wiosenną część szóstego.</p>\n<p>\nJake’a najlepiej opisał Zaqueri \"Aphromoo\" Black, kolega z zespołu. W wywiadze dla theScore eSports stwierdził, że \"Xmithie\" to jeden z najbardziej bezproblemowych zawodników, z jakimi pracował. Nigdy nie miał trudności z przyjmowaniem krytyki i zachowuje się poważnie kiedy gra. Robił to nie bacząc na swoją naturę, bo poza meczami jest w 100% żartownisiem. Dodatkowo Jake jest również głosem rozsądku drużyny, ponieważ przeważnie to właśnie on powstrzymuje kolegów z zespołu od porywczych zagrań. Jako jungler \"Xmithie\" to nie tylko anioł stróż pozostałych graczy, który pomaga w potrzebie, ale także oczy całej ekipy. W CLG wraz z \"Aphromoo\" dbają o wizję i informują resztę o rotacjach przeciwników.</p>\n<p>\nJake urodził się na Filipinach, do Stanów Zjednoczonych przeniósł się dopiero w wieku 16 lat. O ile adaptacja do nowych warunków kiedyś mogła być dla niego przeszkodą, to teraz wygląda i mówi jak rodowity Amerykanin. W swojej karierze grał na różnych pozycjach, lecz jego główną pozostaje jungla, w której najlepiej czuje się Lee Sinem. Jednak są takie mecze, gdzie Ślepy Mnich zostaje zbanowany – wtedy \"Xmithie\" wybiera Xeratha. Grając swoimi ulubionym postaciam doszedł aż do Kręgu Pretendenta w Ameryce Północnej.\n</p>","de_DE":"Jake „Xmithie“ Puchero ist ein langjähriger Jungler in der nordamerikanischen „League of Legends“-Szene. Er ist das Arbeitspferd von Counter Logic Gaming, stets bereit, die Champions zu wählen oder Gegenstände zu bauen, die sein Team benötigt. Oder wie Doublelift über seinen ehemaligen Teamkameraden sagt: „Er ist einfach ein sehr cleverer Spieler. Oft hindert er nur die hintere Reihe daran, Schaden zu verursachen, und das ist alles, was man braucht. Ein Spieler, der enorm lästig ist. Er bekommt nicht das ganze Gold, er bekommt nicht alle Tötungen, er macht auch keine auffälligen Spielzüge. Aber er ist äußerst beständig, unheimlich clever und steckt eine Menge Arbeit hinein.“ Und zu einem Team wie CLG, das mit Darshan und HuHi bereits brandgefährliche Carrys hat, passt ein teamorientierter Jungler perfekt. Xmithie ist der Held, den sie brauchen.\n<p>\n2016 hat Xmithie mit seinen Leistungen wieder bewiesen, dass er CLGs Ruhepol ist. Auch 2017 wird Xmithie wieder alles in seiner Macht stehende tun, um CLG einen Sieg nach dem anderen zu ermöglichen. Sein ruhiges Auftreten verbirgt manchmal sein unglaubliches Spielverständnis und sein Talent, in der Kluft die richtigen Entscheidungen zu treffen, aber der stille Veteran kann alles. Xmithie wird die Ruhe im Auge des Sturms sein, wenn CLG darum kämpft, die Spitze Nordamerikas zu erklimmen.\n","es_ES":"<p>Jake \"Xmithie\" Puchero es un jungla veterano de League of Legends en Norteamérica. Silencioso y trabajador, siempre está preparado para utilizar el campeón y los objetos que su equipo necesite más. Doublelift opina sobre su excompañero: \"Es un jugador muy inteligente. Muchas veces evita que la retaguardia enemiga inflija daño y eso es lo importante. Es un jugador extremadamente disruptivo. No se lleva todos los súbditos, no se lleva todos los asesinatos, no busca jugadas épicas. Pero es muy sólido, inteligente y se esfuerza mucho\". Y para un equipo como CLG, que ya tiene suficientes amenazas como Darshan y HuHi, un jungla dedicado al equipo encaja a la perfección. Xmithie es el héroe que necesitan.</p>\n\n<p>Eso sí, que la actitud taimada de Xmithie no os haga creer que no puede llevar las riendas de la partida. Tiene reputación de ser la destrucción personificada con luchadores como Vi y Lee Sin, y ha dominado en muchas de sus actuaciones con Gragas, el Camorrista.</p>","pt_BR":"<p>Jake “Xmithie” Puchero já é caçador há muito tempo no cenário de League of Legends da NA. Ele é um pacato burro de carga para a Counter Logic Gaming, sempre pronto para escolher o campeão ou os itens que sua equipe precisa. \"Ele é um jogador muito inteligente\", disse Doublelift sobre seu companheiro de equipe. \"Muitas vezes ele impede que a retaguarda inimiga cause dano e às vezes isso é tudo que você precisa. Ele é um jogador muito decisivo. Ele não acumula muito, ele não executa muitos abates, ele não faz jogadas espetaculares. Mas ele é muito consistente e inteligente e se dedica bastante.\" E para uma equipe como a CLG, que já tem carregadores agressivos como Darshan e HuHi, um caçador que joga voltado para a equipe é o complemento perfeito. Xmithie é o herói que eles precisam.</p>\n\n<p>Porém, não deixe a atitude pacata de Xmithie fazer você acreditar que ele não pode ser agressivo. Ele tem uma reputação de destruição com lutadores como Vi e Lee Sin e já dominou de Gragas, o Badernista, várias vezes.</p>","es_AR":"<p>Jake “Xmithie” Puchero es un junglero veterano en NA en la escena League of Legends. Es una callada bestia de carga en Counter Logic Gaming, siempre listo para escoger al campeón o construir objetos cuando su equipo lo necesita. Como dice Doublelift de su antes compañero, <i>\"Es un jugador muy listo. Durante mucho tiempo se dedicó a detener la línea trasera enemiga y eso es todo lo que necesitas. Un jugador que es extremadamente problemático. No recibe todo el botín, no recibe todos los asesinatos, no hace jugadas presumidas. Pero es muy consistente, muy inteligente y hace mucho trabajo\"</i>. Y para un equipo como CLG que ya tiene amenazas como Darshan y HuHi, un junglero preocupado por el equipo es perfecto. Xmithie es el héroe que necesitan.</p>\n\n<p>No dejes que la actitud silenciosa de Xmithie te haga pensar que no puede acarrear. Tiene una reputación de destructor con luchadores como Vi y Lee Sin, y ha dominado consistentemente a Gragas, el Revoltoso.</p>"},"foreignIds":{"drupalId":"41","TRLH1":"200000182","TRLH2":"200000086"},"socialNetworks":{"twitch":"twitch.tv/xmithie","twitter":"https://twitter.com/LoLXmithie"},"champions":[],"liveGameTeam":166},{"id":115,"slug":"sneaky","name":"Sneaky","firstName":"Zachary ","lastName":"Scuderi","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sneaky-3c359lbn.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:51.000Z","updatedAt":"2017-07-04T19:27:36.000Z","bios":{"en_US":"<p>The man, the meme, the legend. Zachary “Sneaky” Scuderi might be the class clown of the NA LCS, but his play is no joke. He’s consistently been a top ADC since he took the league by storm with Cloud9 in Season 3 with his meta-defying Ashe picks. During the 2016 NA LCS Summer Split, he led ADCs and was fourth overall in KDA with 6.3, and he also led ADCs with a 75.7% kill participation rate.</p>\n\n<p><i>“I’ve been getting a lot of memes, as of recent, about my laning phase. It doesn’t really mean anything. But there’s memes, and I could destroy them.” - Sneaky</i></p>\n\nSneaky put up a middling performance in lane and out of it at the 2016 World Championship before Cloud9 was eliminated. He brings a veteran presence to Cloud9’s retooled roster, looking to prove his detractors wrong. What memes will be destroyed or born in 2017? We’ll just have to wait and see.</p>","fr_FR":"<p>Zachary « Sneaky » Scuderi est l'un des carrys AD les plus mortels des LCS NA. Ne vous laissez\n\npar ses singeries, car Sneaky répond présent quand Cloud9 a besoin d'un exploit. Il est parvenu à obtenir \n\nun KDA de 7,2 lors du segment printanier des LCS NA 2015, le deuxième meilleur de la ligue, et il \n\ncontinue de voler de victoire en victoire depuis lors.</p>\n\n<p>L'ascension de Sneaky vers la célébrité a commencé pendant la Saison 3, quand sa décision de choisir \n\nAshe contre la logique de la metagame a propulsé Cloud9 au sommet du classement des LCS NA. Depuis, \n\nSneaky est devenu un fantastique carry AD polyvalent. Il joue désormais admirablement Corki, Tristana \n\net Lucian, et il empoche régulièrement les ratios KDA les plus élevés des LCS NA. Il est probablement le \n\njoueur professionnel de LoL qui propage le plus de memes usés jusqu'à la corde. « Same ».</p>","pl_PL":"<p>Gdyby zorganizować konkurs na najbardziej niedocenianego gracza w NA LCS Sneaky miałby bardzo dużą szansę, by zgarnąć trofeum. Na najwyższym poziomie gra już od ponad dwóch lat, ale nigdy nie dorównywał popularnością Doubleliftowi czy chociażby Wild Turtle’owi. Nie zmienia to faktu, że jest doskonałym strzelcem, być może najlepszym w Ameryce.</p>\n<p>\nSneaky jak niemal każdy zawodnik zaczynał w niewielkich organizacjach. Pierwszym przystankiem na jego drodze na szczyt był zespół Ordinance Gaming, w którym w 2012 roku pełnił rolę… mid-lanera i gdzie spotkał m.in. Roberta „RobertaXLee” Lee. Później przyszedł czas na zmianę pozycji – środkową aleję Sneaky zamienił na pozycję strzelca, w której to roli rozpoczął przygody z Absolute Legends NA oraz Pulse Esports. Dobra postawa Sneaky’ego nie umknęła większym organizacjom i lutym 2013 roku Zachary dołączył do Teamu Dignitas, ale spędził tam tylko pół roku. Pojawiła się oferta z Quantic Gaming, późniejszego Cloud9, którą zaakceptował.</p>\n<p>\nSzybko okazało się, że była to znakomita decyzja. Sneaky wraz z kolegami dwukrotnie sięgał po trofeum dla najlepszego zespołu w NA LCS i dwukrotnie zajmował w tych rozgrywkach drugie miejsce. Początkowo Zachary preferował strzelców, którzy posiadali efekty kontroli tłumu, bo tego wymagała od niego taktyka zespołu. Jego flagową bohaterką stała się w tym czasie Ashe. Co jednak oczywiste, grając tym typem czempionów nie mógł pokazać pełni swoich możliwość. Zmieniło się to wraz z modyfikacją strategii drużyny, która w 2014 roku postanowiła odciążyć nieco Haia „Haia” Lama na środkowej alei i bardziej skupić się na dolnej alei, gdzie potencjał do prowadzenia gier miał właśnie Sneaky. Kiedy po wielkich sukcesach, przyszedł mniej udany okres, Sneaky był tak naprawdę jedynym zawodnikiem C9, który nigdy nie zawodził i nierzadko to właśnie jego fenomenalna postawa i znakomite umiejętności mechaniczne pozwalały Cloud9 wygrywać gry. W wiosennym splicie 2015 Zachary miał najwyższe KDA (7,2), zadał najwięcej procentowych obrażeń (33,9%) i ginął najrzadziej spośród wszystkich zawodników NA LCS (25 śmierci). Co prawda amerykański strzelec miał nieznacznie gorszy letni split 2015, ale to nadal jest zawodnik, na którego C9 zawsze może liczyć.</p>\n<p>\nSneaky nigdy nie wygrał jednak głosowanie na najlepszego ADC w Ameryce, a w plebiscycie z listopada 2015 roku zajął drugie miejsce z wynikiem 20,3%, tracąc do zwycięzcy, Yilanga „Doublelifta” Penga, aż 32,5% głosów.</p>\n<p>\nW trakcie swojej kariery najbardziej wsławić się grą Ezrealem, Gravesem i Corkim. Ciężko też nie zauważyć sentymentu dla Ashe, bowiem Sneaky był jednym z dwóch ADC w Ameryce, który zdecydował się na kilkukrotny wybór tej bohaterki w meczach NA LCS po jej reworku. Co ciekawe, Sneaky jest… daltonistą, co sprawia, że nie potrafi odróżniać pewnych (nie wszystkich) kolorów. Na początku swojej kariery posługiwał się nickiem „SnEaKyCaStRoO”, ale zmienił go natychmiast, gdy dowiedział się, co znaczy to wyrażenie.\n</p>","de_DE":"Der Mann, das Meme, die Legende. Zachary „Sneaky“ Scuderi ist zwar der Klassenclown der NA LCS, aber wenn er spielt, ist Schluss mit lustig. Seit er durch seine Leistungen mit Ashe das Metaspiel veränderte und die Liga im Sturm eroberte, gehört Sneaky, der in Saison 3 bei Cloud9 unterschrieb, zu den besten ADCs. Beim Sommer-Split der NA LCS 2016 führte er die ADCs mit einer Tötungsbeteiligung von 75,7 % an und landete mit einer TTU (KDA) von 6,3 auf dem vierten Platz aller Spieler.</p>\n\n„Ich bekomme in letzter Zeit jede Menge Memes, die sich auf meine Anfangsphase beziehen. Das hat eigentlich nichts zu bedeuten. Aber es gibt sie und ich könnte sie zerstören.“ – Sneaky\n</p>\nSneaky hat bei der Weltmeisterschaft 2016 in der Lane und abseits davon nur eine mittelmäßige Leistung abgeliefert, bis Cloud9 ausgeschieden ist. Er wird seine Erfahrung in die Aufstellung von Cloud9 einbringen und versuchen, seine Kritiker Lügen zu strafen. Welche Memes werden 2017 wohl zerstört werden und welche neuen werden entstehen? Die Zeit wird es zeigen.\n","es_ES":"<p>El hombre, el meme, la leyenda. Zachary ''Sneaky'' Scuderi puede que sea el payaso de la clase de la LCS NA, pero sus jugadas no son un chiste. No ha dejado de ser un ADC de primera desde que llegó a la liga pisando fuerte con Cloud9 en la temporada 3, cuando seleccionaba a Ashe en contra de la lógica del metajuego. Durante el split de verano de la LCS NA 2016, destacó entre los ADC y quedó en cuarto lugar con una A/M/A de 6,3 puntos. También destacó entre ellos por su 75,7 % de participación en asesinatos.</p>\n\n<p>''Últimamente han hecho muchos memes de mí, por mi fase de calles. No significa nada para mí en realidad. Pero los memes están ahí, y yo podría destruirlos''.</p>\n\n<p>Sneaky ha tenido que soportar críticas por sus jugadas en la fase de calles, pero su tendencia a los pentakills a final de partida camufla cualquier fallo del principio. Destaca con campeones ADC de utilidad como Ashe y Sivir, y su Jhin es temido universalmente, lo que ha suscitado que lo bloqueen o que lo seleccionen el primero durante los playoffs. Intentará demostrar que sus detractores se equivocaban consiguiendo un pentakill en el escenario internacional, destruyendo algunos memes y, quizás, si tenemos suerte, creando otros nuevos.</p>","pt_BR":"<p>O homem, o meme, a lenda. Zachary “Sneaky” Scuderi pode ser o palhaço da turma na NA LCS, mas suas jogadas não são nenhuma piada. Ele tem sido consistentemente um dos melhores atiradores desde que saiu destruindo com a Cloud9 na 3º Temporada com suas escolhas de Ashe que desafiavam as leis do meta. Durante a Etapa de Verão da NA LCS 2016, ele esteve na liderança entre os atiradores e ficou em quarto lugar geral com um AMA de 6,3 e também ficou entre os primeiros em participação em abates com 75,7%.</p>\n\n<p>“Tenho ouvido muitas piadas sobre minha fase de rotas recentemente. Eu não as levo a sério e sei que posso destruí-las” - Sneaky</p>\n\n<p>Sneaky já recebeu muitas críticas por seu estilo de jogo na fase de rotas, mas sua propensão a Pentakills no fim de jogo compensa qualquer começo ruim. Ele se sobressai em atiradores de utilidade como Ashe e Sivir, e seu Jhin é universalmente temido, levando a ser banido ou escolhido em primeiro durante as eliminatórias. Ele fará de tudo para desmentir seus difamadores indo atrás do Pentakill no palco internacional, destruindo alguns memes e quem sabe (se tivermos sorte) criando alguns novos.</p>","es_AR":"<p>El hombre, el meme, la legenda. Zachary \"Sneaky\" Scuderi es quien hace reír a todos con sus bromas en la LCS NA, pero su juego no es ningún chiste. Ha sido uno de los mejores tiradores desde que sacudió la liga entera con Cloud9 en la temporada 3 jugando con su revolucionaria Ashe. Durante el torneo de clausura de la LCS NA 2016, jugó de tirador y quedó en cuarto lugar con 6.3 puntos de KDA. Además, logró un 75.7% de participación en asesinatos como tirador.</p>\n\n<p><i>\"Me han hecho muchos memes recientemente sobre mi etapa en los carriles. En realidad eso no quiere decir nada. Pero hay memes, y puedo destruirlos\".</i></p>\n\n<p>Sneaky ha soportado críticas por su juego en la fase de carriles, pero su tendencia a lograr pentakills en las últimas partes de los combates compensa los errores al comienzo. Se destaca con tiradores de utilidad como Ashe y Sivir, y su juego con Jhin es temido por todos, ya que logra bloqueos y primeras selecciones durante las eliminatorias. Buscará demostrar a sus detractores que estaban equivocados logrando un pentakill en el escenario internacional, destruyendo algunos memes y, quizás (si tenemos suerte), hasta creando algunos nuevos.</p>"},"foreignIds":{"drupalId":"331","TRLH1":"200000175","TRLH2":"200000079","TRLH3":"200000339"},"socialNetworks":{"twitch":"https://twitch.tv/c9sneaky","facebook":"https://facebook.com/c9sneaky","twitter":"https://twitter.com/c9sneaky"},"champions":[],"liveGameTeam":18},{"id":163,"slug":"bunny-fufuu","name":"Bunny FuFuu","firstName":"Michael","lastName":"Kurylo","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/bunny-fufuu-b4cl3hl3.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:05.000Z","updatedAt":"2017-05-25T17:02:59.000Z","bios":{"en_US":"<p>\nKnown for his Thresh picks, Michael “Bunny Fufuu” Kurylo is a long time support player in the NA scene. Bunny Fufuu originally played support for Curse during the 2014 NA LCS Spring Split before moving to Curse Academy, which later rebranded as Gravity. The move served both him and Gravity well, with his skills in the bot lane steadily improving until he was regarded as one of the best supports in North America.\n</p>\n<p>\nBunny Fufuu's impact in the bot lane caught the attention of more than a few teams, and he was scooped up by Cloud9 in the 2015 offseason.\n</p>\n<p>\nLearn more about Bunny FuFuu's journey in the competitive scene in his <a href=\"https://www.youtube.com/watch?v=G0uDn46IUxE\" target=\"_blank\">Drive episode</a>.\n</p>","fr_FR":"<p>Support bien connu sur la scène nord-américaine, Michael « Bunny Fufuu » est réputé pour son Thresh. \n\nBunny Fufuu jouait à l'origine support pour Curse, lors du segment printanier des LCS NA 2014, avant de \n\npasser chez Curse Academy, qui a ensuite changé de nom pour devenir Gravity. Ce changement a été \n\nfructueux pour lui comme pour Gravity, et ses compétences sur la voie du bas se sont constamment \n\naméliorées jusqu'à ce qu'il soit considéré comme l'un des meilleurs supports d'Amérique du Nord.</p>\n\n<p>L'impact de Bunny Fufuu sur la voie du bas a attiré l'attention de plusieurs équipes et il a fini par être \n\nrecruté par Cloud9 durant l'intersaison 2015. Il travaille en étroite collaboration avec Hai, qui est sans \n\ndoute l'un des meilleurs meneurs nord-américains, avec qui il partage le poste de support chez C9. \n\nProfitant des conseils stratégiques de LemonNation et d'un puissant partenaire en la personne de \n\nSneaky, Bunny Fufuu continuera forcément de faire forte impression lors des LCS NA. </p>\n\n<p>Pour en savoir plus sur le parcours de Bunny Fufuu sur la scène compétitive, regardez l'épisode de Drive \n\nqui lui est consacré.</p>","pl_PL":"<p>Michael Kurylo przedstawił się szerszej publiczności w 2014 roku, kiedy to zasłynął w amerykańskim SoloQ nieprawdopodobną grą Threshem.</p>\n<p> \nVideo: https://www.youtube.com/watch?v=KVIj1t5duP8</p>\n<p>\nNa półprofesjonalnej scenie swoich sił próbował już wcześniej w mniej znanych formacjach, ale to właśnie sezon 2014 okazał się przełomowy. Co prawda w składzie Curse utalentowanemu wspierającemu nie udało się zaistnieć. Najpierw rywalizował z Georgem „Zekentem” Liu i Brandonem „Saintviciousem” DiMarco w szalonym wiosennym splicie 2014. Ciekawostką jest fakt, że Michael występował wtedy w LCS i jednocześnie… uczęszczał do szkoły. Później do zespołu dołączył wyrzucony z TSM-u Alex „Xpecial” Chu. Obydwaj zawodnicy rywalizowali o miejsce w składzie formacji, ale ostatecznie, pomimo pozytywnych recenzji, jakie BunnyFuFuu otrzymał za wiosenne występy, to były gracz TSM-u wygrał ten pojedynek. </p>\n<p>\nNiemniej kariera Michaela potoczyła się w myśl przysłowia „co się odwlecze, to nie uciecze”. BunnyFuFuu dołączył do występującego w NA Challenger Series Curse Academy i to właśnie wokół niego przebudowana została drużyna. </p>\n<p>\n- W ciągu roku BunnyFuFuu będzie lepszy od Xpeciala – powiedział jednak w sierpniu 2014 roku legendarny amerykański dżungler Saintvicious, który występował z Bunny’m w CA.</p>\n<p>\nCurse Academy udało się zebrać naprawdę silny skład i zespół był jednym z faworytów do awansu do LCS. Początki były trudne, ale ostatecznie cel udało się spełnić od razu w pierwszym splicie. Michael i jego koledzy z drużyny byli zmuszeni zmienić organizację i do wiosennej edycji rozgrywek 2015 przystąpili pod banderą Gravity.</p>\n<p>\nZespół zaskoczył znakomitym startem w wiosennym splicie 2015, a BunnyFuFuu, zgodnie z oczekiwaniami, był jednym z filarów zespołu. Ostatecznie drużyna zadomowiła się w środku tabeli i to był na tamten moment szczyt możliwości Michaela i jego kolegów. W przerwie między splitami zmienił się jednak partner Bunny’ego na dolnej alei – Davida „Copa” Robertsona zastąpił obiecujący Johny „Altec” Ru. W związku z tą rotacją uwaga drużyny skupiła się głównie na dolnej alei, gdzie duet młokosów radził sobie fenomenalnie, prowadząc zespół do walki o najwyższe lokaty. Gravity przez moment było nawet liderem rozgrywek, ale ostatecznie skończyło letnią edycję na czwartej pozycji i szybko odpadło w play-offach.</p>\n<p>\nBunnyFuFuu nadal słynie z nieprawdopodobnej gry Threshem, ale w ciągu ostatniego roku jego champion pool znacznie się rozszerzył – amerykański wspierający niemal równie chętnie sięgał po Shena, Alistara, Jannę czy Brauma. Ewidentnie ma jednak tendencję do gry wytrzymałymi wspierającymi. W letnim splicie 2015 BunnyFuFuu był czwartym najczęściej asystującym zawodnikiem w NA LCS. Tę samą lokatę zajął w klasyfikacji supportów obejmującej KDA. Był również drugim najczęściej wardującym graczem w amerykańskich rozgrywkach. Co ciekawe, nick Michaela początkowo miał brzmieć „BunnyFuFu”, ale był on zajęty, wobec czego gracz zdecydował się po prostu dodać drugie „u” i tak powstał obecny pseudonim.</p>\n<p>\nW przerwie przed sezonem 2016 wspierający dołączył do Cloud9, gdzie ma pełnić rolę supporta wymiennie z Haiem „Haiem” Lamem.\n</p>"},"foreignIds":{"drupalId":"1341","TRLH1":"1001220059","TRLH2":"1001160109"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":255,"slug":"westrice","name":"Westrice","firstName":"Jonathan","lastName":"Nguyen","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/westrice-1zjulpwi.png","hometown":"USA","region":"NA CS","birthdate":null,"createdAt":"2014-09-09T16:42:14.000Z","updatedAt":"2016-03-08T00:25:54.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1144","TRLH1":"1001270025","TRLH2":"1001200025","FRA1TMNT1":"375424"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":265,"slug":"pobelter","name":"Pobelter","firstName":"Eugene","lastName":"Park","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pobelter-fhjggnk7.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-09-09T16:42:16.000Z","updatedAt":"2017-01-29T02:23:26.000Z","bios":{"en_US":"<p>Eugene “Pobelter” Park is the poster child for homegrown NA talent. One of the few native mid laners in the NA LCS, Pobelter competed with the best at the 2015 World Championship as a member of Counter Logic Gaming. He joined Immortals in 2016 and dominated the regular season, but fell short in the playoffs of both splits.</p>\n\n<p>The Notorious P.O.B. is back with brand new teammates for 2017. As the only returning member of the old Immortals roster, he’ll find himself in a position of leadership with his new squad. Immortals isn’t the Huni and Reignover show any more, and Pobelter will have to put that 200 IQ to the test if he wants Immortals to succeed this year.</p>","fr_FR":"<p>Mid laner d'Immortals, Eugene « Pobelter » Park est à 19 ans déjà un habitué des LCS NA. S'il n'a pas pu intégrer le plus haut niveau dès la saison 3 car il était alors encore trop jeune pour se consacrer au jeu à plein temps, il était déjà à cette époque un nom connu des fans de League of Legends.</p>\n\n<p>Rien d’étonnant, donc, à ce qu’il ait suscité beaucoup d'attentes lorsqu'il a rejoint pour la première fois les LCS en saison 4 au sein d'Evil Geniuses, nouvellement arrivés en Amérique du Nord. Malheureusement pour lui et pour le reste de l'équipe, les résultats n'ont pas été à la hauteur des espoirs suscités, loin de là. Evil Geniuses a terminé son premier segment en NA à la 7e place, avec un ratio de 20 défaites pour seulement 8 victoires. Malgré une requalification assez facile en LCS, Pobelter et son équipe n'ont pas montré d'amélioration de leur niveau lors du segment d'été et sont promptement retournés en tournoi de relégation, lors duquel ils se sont tout aussi promptement requalifiés face à une très faible équipe de Coast. Entre les saisons 4 et 5, Evil Geniuses a changé de nom pour devenir Winterfox, mais n’a pas su se défaire de ses mauvaises habitudes. Le segment de printemps a dû avoir comme un triste goût de déjà-vu pour le mid laner américain, qui s'est retrouvé une fois de plus en relégations et n'a cette fois pas pu échapper à une sortie sans gloire des LCS NA aux mains de Team Dragon Knights.</p>\n\n<p>Considéré à ce moment de sa carrière comme une star de file solo incapable de transposer son talent à la scène compétitive, Pobelter a néanmoins retrouvé immédiatement une place dans les LCS NA au sein de Counter Logic Gaming. Un pari gagnant tant pour l'organisation que pour lui puisque CLG et Pobelter sont parvenus lors du segment d'été à remporter leur premier titre de champions des LCS NA et leur ticket de participation au Championnat du monde de la saison 5. Malgré une bonne première semaine de compétition lors du mondial, CLG a perdu leurs trois matchs de poule en deuxième semaine et par là même sa chance de se qualifier pour les quarts de finale.</p>\n\n<p>Malgré tout, cette saison a au moins permis à Pobelter de montrer qu'il pouvait être compétitif en équipe et pas seulement en file solo. À lui de le prouver définitivement en saison 6.</p>","pl_PL":"<p>Eugene zaczął się interesować League of Legends w bardzo młodym wieku. Bierze aktywny udział na scenie esportowej od pierwszego sezonu, więc wypada nazwać go weteranem. Grał profesjonalnie w wielu drużynach, zarówno w mało znanych jak i bardzo popularnych – np. Team Curse, Evil Geniouses i Counter Logic Gaming. Wśród kibiców stał się powszechnie znany dopiero, gdy dołączył do europejskiej ekipy EG w grudniu 2013 roku, kiedy ta przeniosła się do Ameryki. Wtedy pokazał swoje niebywałe umiejętności na mid-lanie szerszej publice niż Krąg Pretendenta. Zademonstrował szeroki wachlarz swoich możliwości, grają nie tylko klasycznymi magami, ale również asasynami. Przeciwnicy zaczęli się bać Eugena Parka, kiedy zobaczyli jak gra swoimi ulubionym postaciami – Zedem, Ahri i Fizzem.</p>\n<p>\n\"Pobelter\" najwięcej osiągnął w szeregach Counter Logic Gaming. Głównie ze względu na to, że jego udział w Evil Geniouses, a później Winterfox, przypominał walkę o przetrwanie w NA LCS. Tymczasem w CLG brał udział tylko w letnim sezonie NA LCS 2015, lecz to właśnie w tej organizacji pokazał ile naprawdę jest warty. Eugene jasno przedstawił swój cel w tej drużynie – „CLG jest znane z dobrych początków i tragicznych zakończeń sezonu. Chcę to zmienić.”  Pierwszym sukcesem było zajęcie pierwszego miejsca w letnim okresie, a następnie utwierdzenie się na tej pozycji podczas rozgrywek barażowych. Na Madison Square w finale pokonał odwiecznego wroga CLG – Team SoloMid. To historyczne już zwycięstwo zagwarantowało mu kwalifikację do Mistrzostw Świata 2015, największy zaszczyt i sukces dla każdego profesjonalnego zawodnika. Jednak występ Eugena na tym wielkim wydarzeniu nie przebiegł pomyślnie. Pomimo trafienia do grupy powszechnie uważanej za najłatwiejszą, CLG nie dostało się do kolejnego etapu. </p>\n<p>\nOprócz sukcesów w rozgrywkach LCS i na scenie międzynarodowej, doskonale prezentował się też na pomniejszych wydarzeniach. Do takich zalicza zwycięstwo na charytatywnej imprezie – „Best Zed NA”, w którym zdominował Władcą Cieni wszystkich pozostałych zawodników. \"Pobelter\" jest uważany za jednego z najbardziej wszechstronnych graczy. Podczas swojej profesjonalnej kariery zajmował również pozycję na top-lanie. To nie jedyna ciekawostka, która nie pasuje do jego wizerunku z sezonu 6 – kiedy zaczynał grać poważnie, był znany ze swoich umiejętności Zileanem i Jaxem.\n</p>","de_DE":"Eugene „Pobelter“ Park ist der Inbegriff eines talentierten einheimischen NA-Spielers. Als Mitglied von Counter Logic Gaming hat sich Pobelter bei der Weltmeisterschaft 2015 als einer der wenigen einheimischen Mid-Laner der NA LCS mit den Besten der Welt gemessen. Er hat sich den Immortals im Jahr 2016 angeschlossen und in der regulären Saison dominiert, aber in den Entscheidungsspielen ist er in beiden Splits hinter den Erwartungen geblieben.\n</p>\nThe Notorious P.O.B kehrt 2017 mit einem brandneuen Team zurück. Als einziger Verbleibender der alten Immortals-Aufstellung wird er die Führungsrolle in der neuen Mannschaft übernehmen. Die Immortals sind jetzt keine Huni-Reignover-Show mehr und Pobelter wird seinen IQ von 200 gut einsetzen müssen, wenn er dieses Jahr mit den Immortals erfolgreich sein will.\n\n","es_ES":"<p>Eugene “Pobelter” Park es uno de los mid más habilidosos que hay en Norteamérica. Su debut en la LCS NA vino de la mano de Evil Geniuses, cuando se unió a las estrellas europeas Krepo, Snoopeh y Yellowpete, pero no se vió todo su potencial hasta que no entró en CLG en 2015. Jugador de equipo por naturaleza, Pobelter es uno de los mids más altruistas en la LCS. “Por fin he conseguido jugar en un equipo que juega como un equipo”, dijo Pobelter cuando se unió a CLG. Con múltiples carries en un equipo con ZionSpartan y Doublelift, a Pobelter no le importa escoger a un campeón que se ajuste a las necesidades de CLG sobre otros campeones que puedan ser más decisivos por sí mismos. ¿Los resultados? CLG campeón del Split de verano de la LCS NA 2015 y primer clasificado de su región para el Campeonato Mundial. </p>\n\n<p>Si queréis saber más acerca de Pobelter y su historia podéis hacerlo en este <a href=\"https://www.youtube.com/watch?v=wk9ZI0TQJgY/\">video</a> (inglés)</p>","pt_BR":"<p>Pobelter é um dos jogadores do meio mais habilidosos da América do Norte. Ele já fez barulho na Europa, quando fez parte da Evil Geniuses ao lado de estrelas como Krepo, Snoopeh e Yellowpete. Em 2015 ele se juntou à CLG, trazendo o seu melhor: trabalho em equipe e zero egoísmo.</p>\n<p>Como o time já tem carregadores como ZionSpartan e Doublelift, cabe a Pobelter escolher Campeões que atendam o time, e ele não tem problema com isso. O resultado? CLG campeã da LCS NA, e pronta para o Mundial.</p>\n"},"foreignIds":{"drupalId":"1132","TRLH1":"200000217","TRLH2":"200000121"},"socialNetworks":{"twitch":"twitch.tv/Pobelter","facebook":"https://facebook.com/LoLPobelter","twitter":"https://twitter.com/Pobelter"},"champions":[],"liveGameTeam":166},{"id":482,"slug":"incarnati0n","name":"Jensen","firstName":"Nicolaj","lastName":"Jensen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/incarnati0n-e5bzh5bb.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2015-05-15T18:24:28.000Z","updatedAt":"2017-07-04T19:27:23.000Z","bios":{"en_US":"<p>Nicolaj “Jensen” Jensen is out to prove there’s more than one great Danish mid laner in the NA LCS. After initially struggling when he joined Cloud9 in 2015 to replace departing Hai, he’s done more than just gain his footing: he’s become one of the most dangerous mid laners in the league. During the 2016 NA LCS Summer Split, he led the league in kills with 207 and set a new LCS record with 20 kills in a single game in the playoffs.</p>\n\n<p>Like the rest of Cloud9, Jensen was unsatisfied with the team’s performance at Worlds. Joining a retooled roster for 2017, he had to build synergy with his new jungler, Contractz. A strong season for Jensen and Cloud9 was unfortunately capped by a crushing defeat to TSM in the 2017 NA LCS Spring Split finals. With a clean slate for summer, Jensen will be looking to body fools on his way to the 2017 World Championship. </p>","fr_FR":"<p>Nicolaj « Jensen » Jensen est un mid laner danois de haut niveau, connu pour préférer des assassins \n\ncomme Zed et Fizz. Jensen a commencé sa carrière e-sportive avec Team Solo Mebdi en 2012, lors des \n\nqualifications pour les LCS EU de la Saison 3. Cependant, l'équipe a été disqualifiée du tournoi et s'est \n\nséparée au début de l'année 2013.</p>\n\n<p>Jensen est revenu à la compétition en 2015 quand Cloud9 l'a choisi pour remplacer son mid laner sur le \n\ndépart, Hai. Au début, Jensen a eu du mal dans le nouvel environnement des LCS NA, mais son KDA s'est \n\namélioré considérablement au fur et à mesure qu'il s'habituait au style de jeu de l'équipe et à la scène \n\ndes LCS NA. Jensen a terminé son premier segment professionnel en participant au mondial 2015, au \n\ncours duquel Cloud9 a été éliminée dès la phase de groupe.</p>","pl_PL":"<p>Nikolaj Jensen, bardziej znany jako Incarnati0n, to jedna z najbardziej kontrowersyjnych postaci na profesjonalnej scenie. Głośno o Duńczyku po raz pierwszy zrobiło się w 2012 roku, przed eliminacjami do pierwszego splitu EU LCS w historii. Incarnati0n całkowicie zdominował w tym czasie europejskie SoloQ i jego drużyna była jednym z faworytów do zdobycia miejsca w elitarnych rozgrywkach. Kilka dni przed zawodami sceną wstrząsnęła jednak zaskakująca wiadomość – Incarnati0n (znany wtedy pod pseudonimem Veigodx), a także jego kolega z zespołu Simon „Rayt3rch” Näslund zostali ukarani dożywotnią dyskwalifikacją, a ich formacja (Team Solo Mebdi) wykluczona z turnieju.</p>\n<p>\nSzybko na jaw wyszły na jaw powody tej decyzji. Nikolaj zbudował sobie rozległą kartotekę związaną z łamaniem Kodeksu Przywoływacza. Kara nie sprawiła jednak, że Incarnati0n porzucił League of Legends. Duńczyk tworzył kolejne konta, które były co jakiś czas eliminowane: Vizikodex, Quas0, Suq, Reversio, Apdo Dog2 czy najbardziej znane Wizikx. Mid-laner niejednokrotnie udowadniał ogromną skalę talentu, regularnie dostając się na najwyższe lokaty w europejskim SoloQ. W końcu, po niemal dwóch latach trwania tego procederu, w 2014 roku, Riot zobaczył znaczącą poprawę w postępowaniu gracza i pozwolił mu na pracę z SK Gaming w roli trenera. Niemniej, biorąc pod uwagę powody dyskwalifikacji Duńczyka, Riot pozostawał nieugięty, jeśli chodzi o występy Incarnati0na jako gracza. </p>\n<p>\nTymczasem SK Gaming, od czasu zatrudnienia Nikolaja, odnotowało niesamowity postęp i wygrało fazę zasadniczą wiosennego splitu 2014, zajmując też drugą pozycję w play-offach i trzecią na koniec letniej edycji. Formacji udało się też pojechać na Mistrzostwa Świata. Ogromny progres był widoczny w postawie mid-lanera drużyny Jesse’ego „Jesiza” Le. Wszystko wskazuje na to, że Duńczyk fantastycznie odnalazł się w nowej roli. Nie ulega jednak wątpliwości, że to rozwiązanie go nie satysfakcjonowało – chciał grać.</p>\n<p>\nIncarnati0n skupił się więc na swojej karierze jako zawodnika. Mid-laner potrzebował jeszcze dwóch podejść do aktualizacji jego sprawy. Dopiero w maju 2015 roku przekonał Riot co do swojej przemiany i został dopuszczony do gry na najwyższym poziomie. Ta sprawa podzieliła społeczność na zwolenników drugiej szansy dla utalentowanego zawodnika i przeciwników tej decyzji, wskazujących na skrajnie toksyczną przeszłość. Ostatecznie jednak nie miało to większego znaczenia, bo decyzja była wiążąca i po Duńczyka zgłosiła się chmara chętnych. Od początku faworytem w wyścigu po podpis Incarnati0na było jednak Cloud9 i to właśnie tam trafił obiecujący gracz.</p>\n<p>\n„W dziesięciostopniowej skali, przyjmując za 10 Fakera, myślę, żę Bjergsen i Incarnati0n są prawdopodobnie około ósemki. Pozostali mid-lanerzy z NA LCS oscylują w większości w przedziale 6-7.” – powiedział William „Scarra” Li przed startem splitu, stawiając Incarnati0na obok Bjergsena.</p>\n<p>\nPoczątki nie były jednak łatwe. Incarnati0n miał problemy z zaaklimatyzowaniem się na tak wysokim poziomie i ze spełnieniem wygórowanych oczekiwań kibiców. Kilka pierwszych kolejek było bardzo przeciętne w jego wykonaniu, co spowodowało falę krytyki ze strony fanów, ale później z każdym meczem radził sobie lepiej. Na pewno bardzo pomógł mu powrót do drużyny Haia „Haia” Lama, bowiem od zmiany dżunglera progres był jeszcze wyraźniejszy. Pod koniec splitu Incarnati0n był już mocnym punktem zespołu i miał spory udział w sensacyjnym wywalczeniu przez Cloud9 awansu na Mistrzostwa Świata. Trudy debiutu już więc za nim, a rok 2016 powinien być dla niego znacznie bardziej udany.</p>\n<p>\nW czasach dominacji SoloQ Incarnati0na zasłynął z niezwykle efektywnej gry zabójcami – przede wszystkim Fizzem i Zedem. Na profesjonalnej scenie jego styl gry znacznie się jednak zmienił w związku z wymogami dynamicznie ewoluującej mety. W lecie najczęściej grał Orianną, Azirem i Viktorem, co całkowicie zrozumiałem, gdyż te postaci były w tym czasie najmocniejsze. Jego pocket-pickiem był natomiast AP Kog’Maw. Co ciekawe, spośród graczy NA LCS, Duńczyk najlepiej dogaduje się z Johnym „Altec’iem” Ru i Christianem „IWillDominate” Riverą.\n </p>","de_DE":"Nicolaj „Jensen“ Jensen will allen beweisen, dass es nicht nur einen überragenden dänischen Mid-Laner gibt. Nachdem er anfangs Probleme hatte, als er 2015 als Ersatz für Hai zu Cloud9 gekommen war, konnte er mehr als nur Fuß fassen: Er wurde zu einem der gefährlichsten Mid-Laner der Liga. Beim Sommer-Split der NA LCS 2016 führte er die Liga mit 207 Tötungen an und stellte in den Entscheidungsspielen mit 20 Tötungen in einem einzigen Spiel einen neuen Rekord auf.</p>\n\nJensen war, wie der Rest von Cloud9, mit der Leistung bei der Weltmeisterschaft unzufrieden. In der neuen Aufstellung für den Frühjahrs-Split 2017 muss er an der Synergie zwischen ihm und seinem neuen Jungler, Contractz, arbeiten. Eine gute Harmonie zwischen Mid-Laner und Jungler ist das Erfolgsrezept vieler Top-Teams. Sollten sie es schaffen, gut zusammenzuarbeiten, ist kaum abzusehen, was Jensen 2017 alles erreichen kann.\n","es_ES":"<p>Nicolaj ''Jensen'' Jensen va a demostrar que no solo hay un jugador danés fantástico en la calle central de la LCS NA. Tras tener algunos problemas inicialmente cuando se unió a Cloud9 en 2015 para reemplazar a Hai, no solo se ha ganado su posición, sino que se ha convertido en uno de los mid más peligrosos de la liga. Durante el split de verano de la LCS NA 2016, despuntó en la liga con 207 asesinatos y ha establecido un nuevo récord en la LCS con 20 asesinatos en una sola partida durante los playoffs. También destacó por el número de súbditos asesinados por minuto, alcanzando una media de 9,5.</p>\n\n<p>Tras una dura derrota contra TSM en la final de verano de la LCS NA 2016, Jensen tomó las riendas de su equipo y derrotó a Immortals de nuevo en un enfrentamiento al mejor de 5, lo que significaría su clasificación para el Mundial. Aunque se hizo un nombre jugando asesinos como Zed y LeBlanc, también ha destacado con selecciones específicas como Vel'Koz y Syndra. Si Cloud9 quiere superar la fase de grupos este Mundial, a diferencia del año pasado, Jensen tendrá que deshacerse de los recuerdos de las derrotas del pasado. Puede que las emociones sean el rival más duro para Jensen en el escenario internacional; si consigue dominarlas, su límite serán las nubes.</p>","pt_BR":"<p>Nicolaj “Jensen” Jensen veio para provar que há mais do que só um grande jogador dinamarquês na rota do meio na NA LCS. Após um começo difícil quando entrou para a Cloud9 em 2015 para substituir Hai, ele fez muito mais do que só conquistar o seu lugar: ele se tornou um dos meios mais perigosos do League. Durante a Etapa de Verão da NA LCS 2016, ele ficou na liderança em número de abates marcando 207 e alcançou um novo recorde na LCS com 20 abates em um único jogo nas eliminatórias. Ele também ficou em primeiro em abates de tropa por minuto, marcando 9,5.</p>\n\n<p>Depois de uma derrota esmagadora para a TSM na Final da Etapa de Verão da NA LCS, Jensen reuniu sua equipe, que conseguiu derrotar mais uma vez a Immortals em uma melhor de 5, qualificando-se assim para o Mundial. Apesar de ter feito seu nome jogando com assassinos como Zed e LeBlanc, ele também se sobressai em escolhas mais específicas como Vel’Koz e Syndra. Se a Cloud9 espera superar sua saída na Fase de Grupos do Mundial do ano passado, Jensen vai ter que superar as derrotas do passado. As emoções talvez sejam um de seus piores inimigos no palco internacional. Se ele conseguir controlá-las, o céu é o limite.</p>","es_AR":"<p>Nicolaj \"Jensen\" Jensen ha venido para demostrar que hay más de un carrilero central danés habilidoso en la LCS NA. Después de un arduo inicio en Cloud9 como reemplazo de Hai en el 2015, ha logrado más que ganarse su lugar: se ha convertido en uno de los carrileros centrales más poderosos de la liga. Durante el torneo de clausura de la LCS NA 2016, encabezaba la liga con 207 asesinatos y registró una marca inédita de la LCS con 20 asesinatos en un solo combate durante las eliminatorias. También lideró la liga con 9.5 CS por minuto.</p>\n\n<p>Después de una aplastante derrota ante TSM en la final del torneo de clausura de la LCS NA 2016, Jensen reunió a su equipo para derrotar a Immortals una vez más en un combate al mejor de cinco y clasificar al Mundial. A pesar de que se hizo reconocido jugando con asesinos como Zed y Leblanc, también se destacó usando personajes especializados como Vel’Koz y Syndra. Si Cloud9 espera mejorar luego de su salida en la fase de grupos del Mundial del año pasado, Jensen deberá despejar los fantasmas de las derrotas anteriores. Quizás las emociones sean el rival más duro de Jensen en el escenario internacional. Si logra dominarlas, su límite será el cielo.</p>"},"foreignIds":{"drupalId":"4330","TRLH1":"200000174","TRLH2":"200000078","TRLH3":"200000338"},"socialNetworks":{"facebook":"https://www.facebook.com/c9incarnati0n","twitch":"https://twitch.tv/incarnati0n","twitter":"https://twitter.com/Incarnati0nLoL"},"champions":[],"liveGameTeam":18},{"id":499,"slug":"smoothie","name":"Smoothie","firstName":"Andy","lastName":"Ta","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/smoothie-5yeikqg2.png","hometown":"Canada","region":"NA LCS","birthdate":null,"createdAt":"2015-05-26T21:14:10.000Z","updatedAt":"2017-07-04T19:27:48.000Z","bios":{"en_US":"<p>Andy “Smoothie” Ta offers Cloud9 the perfect blend of support attributes -- control of the map, and protection of carries. After spending most of the 2016 Summer Split sharing time in the support role, Smoothie took over the job full time near the end of the split and never looked back. Despite limited playtime, Smoothie had the third best support KDA in the league for the Summer Split.</p>\n\n<p>In less than a year, Smoothie went from bouncing around the NA Challenger scene all the way to the 2016 World Championship. While the rookie was overshadowed by some of the world’s finest, he’s one of the best young supports in the scene. He’ll have his sophomore season to level up his skills and take another shot at greatness on the world stage.</p>","fr_FR":"<p>Andy « Smoothie » Ta a rejoint Team Liquid en 2015 après ses débuts aux LCS avec Team Dragon \n\nKnights, plus tôt dans l'année. Bien que ce support ait été plutôt discret dans sa première année aux LCS, \n\nSmoothie a impressionné les dirigeants de TL au point que ces derniers lui ont proposé une place dans \n\nl'équipe ; équipe qui a fini à la première place de la saison régulière du segment d'été des LCS NA 2015. \n\nIl ne tient qu'à lui de prouver qu'il est capable de conserver son poste.</p>","pl_PL":"<p>Pochodzący z Calgary, w Kanadzie, \"Smoothie\" zainteresował się profesjonalną sceną dopiero w sezonie piątym. Dołączył do Team Dragon Knights w lutym 2015 roku, zastępując poprzedniego supporta. Zamiana zbiegła się w czasie z początkiem wiosennego sezonu NA Challenger Series 2015. Andy, wraz z drużyną, skończył go na drugim miejscu z wynikiem 7:3. Po zajęciu też drugiego miejsca w rozgrywkach barażowych zakwalifikował się do Summer Promotion Tournament. TDK zostało wybrane przez Winterfox, lecz udało im się zwyciężyć, pomimo substytucji mid-lanera. Niestety „rycerze” nie poradzili sobie najlepiej w letnim sezonie NA LCS 2015, kończąc na ostatnim miejscu z wynikiem 3:15. Przez pozycję na samym dnie zostali automatycznie przeniesieni z powrotem do NA Challenger Series. Dlatego \"Smoothie\" opuścił szeregi Team Dragon Knights w październiku 2015 roku. Jednak umiejętności Kanadyjczyka zaprezentowane w tym okresie zrobiły wrażenie na wielu osobach – w efekcie dostał zaproszenie do Team Liquid.</p>\n<p>\nPrzyjęcie Andiego do drużyny zostało ogłoszone 16.10.2015 poprzez film w internecie pt. „Team Liquid Smoothie Challenge”. W nim czterech członków organizacji ściera się w konkursie na zrobienie najlepszego koktajlu, a o zwycięzcę ma wyłonić tajemniczy sędzia. Oczywiście sędzia to Andy, który oświadcza, że jest tylko jeden prawdziwy „Smoothie” i że będzie supportem w  Team Liquid. Fakt, że zastępuje doświadczonego Alexa \"Xpecial\" Chu’a, bardzo dobrze o nim świadczy.</p>\n<p>\nZa swojego ulubionego bohatera uważa Thresha, jednak cieszy go też gra Janną i Annie. W letnim sezonie NA LCS 2015 można także było zobaczyć jego imponującą grę Nautilusem. Pomimo krótkiego stażu na scenie esportowej posiada sporą ilość wielbicieli, co jest główną zasługą jego aktywności na portalach społecznościowych. Lubi umieszczać w internecie zdjęcia swojego autorstwa, np. swoich z innymi ludźmi lub potraw. Aż 1500 osób śledzi jego dzieła sztuki fotografii. Poza tym przepada za komentowaniem bieżących wydarzeń na świecie. Wszystko zapowiada, że będzie miał doskonały kontakt z fanami.\n</p>","de_DE":"Andy „Smoothie“ Ta bietet Cloud9 die perfekte Mischung an Supporter-Attributen: Er sorgt dafür, dass seine Mannschaft die Kontrolle über die Karte hat und beschützt die Carrys. Nachdem Smoothie die Supporter-Rolle für einen Großteil des Sommer-Splits 2016 teilen musste, ist er seit Ende der Saison alleine für das Wohl seiner Mitspieler verantwortlich. Trotz der beschränkten Spielzeit erreichte Smoothie die drittbeste Supporter-TTU (KDA) des Sommer-Splits.\n</p>\nIn weniger als einem Jahr hat es Smoothie von der nordamerikanischen Challenger-Szene bis zur Weltmeisterschaft 2016 geschafft. Auch wenn er von einigen der besten Spieler der Welt überschattet wurde, gehört er trotzdem zu den besten jungen Supportern der Szene. In seiner zweiten Saison hat er die Chance, weiter an seinen Fähigkeiten zu arbeiten und erneut zu versuchen, auf der WM-Bühne zu brillieren.\n","es_AR":"<p>Andy \"Smoothie\" Ta ofrece a Cloud9 la combinación perfecta de atributos de un soporte: control del mapa y protección de acarreadores. Después de pasar la mayor parte de la temporada regular del 2016 jugando parcialmente en ese rol con Bunny FuFuu, Smoothie comenzó a desempeñar esta tarea de tiempo completo para el final de la temporada y sin mirar atrás. A pesar de que su tiempo de juego fue limitado durante la mayor parte del torneo, Smoothie obtuvo el tercer mejor KDA de un soporte en la liga con 5.6 puntos. Se destacó con el Bardo durante la temporada regular, y su Tahm Kench ayudó a sellar la victoria del quinto combate contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha tenido un largo recorrido desde sus días en la escena de retadores de NA durante los últimos dos años. En el juego temprano, su fuerte carril protege a Sneaky y permite que el acarreador principal de C9 sobreviva intacto hasta el final del combate. Aunque Smoothie suele quedar opacado por Biofrost, otro gran soporte novato, tuvo un desempeño increíble para alguien con tan poca experiencia profesional. La falta de experiencia se pondrá a prueba en el Mundial. Allí se debilitará y perderá, o permanecerá firme y ganará bajo las brillantes luces del escenario internacional.</p>","es_ES":"<p>Andy ''Smoothie'' Ta ofrece a Cloud9 la mezcla perfecta de atributos de apoyo: control del mapa y protección para los carries. Tras pasar la mayor parte de la temporada regular de 2016 compartiendo el rol de apoyo con Bunny FuFuu, Smoothie acabó por ocupar el puesto a tiempo completo al final de la temporada, y no ha mirado atrás desde entonces. A pesar de haber contado con tiempo limitado de juego la mayor parte del split, Smoothie consiguió la tercera mejor A/M/A de apoyo de la liga, con una puntuación de 5,6. Durante la temporada regular destacó con Bardo, y su Tahm Kench ayudó a conseguir la victoria en la quinta partida contra Immortals en la semifinal.</p>\n\n<p>Smoothie ha recorrido un largo camino desde que frecuentara la escena Aspirante de Norteamérica durante los últimos dos años. Al principio de la partida, su potente actividad en calle protege a Sneaky, lo que ayuda que el carry principal de C9 llegue a final de partida de una pieza. Aunque Biofrost, otro apoyo principiante, suele hacerle sombra, Smoothie lo hace increíblemente bien para tener tan poca experiencia profesional. Su escasa experiencia será puesta a prueba en el Mundial, donde podrá derrumbarse y perder, o mantenerse como un témpano de hielo y ganar bajo los ardientes focos del escenario internacional.</p>","pt_BR":"<p>Andy “Smoothie” Ta oferece à Cloud9 a mistura de atributos perfeita para um suporte: controle de mapa e proteção de carregadores. Após passar grande parte da temporada regular de 2016 dividindo a função de suporte com Bunny FuFuu, Smoothie passou a exercer a função em tempo integral próximo do final da temporada e nunca mais olhou para trás. Apesar de seu pouco tempo de jogo em grande parte da Etapa, Smoothie alcançou o terceiro melhor AMA entre os suportes da liga, marcando 5,6. Ele se sobressaiu de Bardo durante a temporada regular e seu Tahm Kench ajudou a fechar o último jogo contra a Immortals nas Semifinais.</p>\n\n<p>Smoothie trilhou um longo caminho desde a época em que se aventurava no cenário Desafiante na NA até esses últimos dois anos. No início do jogo, sua poderosa fase de rotas consegue proteger Sneaky e ajudar que o principal carregador da C9 chegue inteiro no fim de jogo. Apesar de Smoothie muitas vezes ser ofuscado por Biofrost, outro suporte novato incrível, ele ainda tem um desempenho excelente para alguém com tão pouca experiência no cenário profissional. Mas essa falta de experiência será posta à prova no Mundial, onde ele só terá duas opções: ser massacrado e perder ou manter a calma e vencer sob os enormes holofotes do palco internacional.</p>"},"foreignIds":{"drupalId":"3799","TRLH2":"200000080","TRLH1":"200000176","TRLH3":"200000340"},"socialNetworks":{"twitter":"https://twitter.com/LiquidSmoothiee"},"champions":[],"liveGameTeam":18},{"id":508,"slug":"ray","name":"Ray","firstName":"Ji Won","lastName":"Jeon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ray-9yvvpql2.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-07-04T19:24:50.000Z","bios":{"en_US":"<p>Ji Won “Ray” Jeon is the definition of a playmaker. As a member of Apex Gaming in 2016, teams and fans alike heard him roar on top lane champions like Jarvan, Irelia and Fizz. David “Phreak” Turley’s voice may never fully recover after Ray blew him away by deleting Team Envy’s LOD in the 2016 NA LCS Summer Split.</p>\n\n<p>But Ray’s highlight reel plays were matched by an equal number of disappointing performances. After splitting time with Impact during the 2017 NA LCS Spring Split, he's shown signs of growth as a player. If he continues to develop and Impact can teach him the ways of \"top die,\" the sky's the limit for Ray.</p>","de_DE":"Ji Won „Ray“ Jeon ist die Definition eines Spielmachers. Als Mitglied von Apex Gaming hat er 2016 Teams und Fans gleichermaßen gezeigt, wozu er mit Champions wie Jarvan, Irelia und Fizz auf der oberen Lane in der Lage ist. David „Phreak“ Turleys Stimme wird sich wohl nie mehr erholen, nachdem Ray nicht nur ihn, sondern auch Team Envys LOD komplett umgehauen hatte.\n<p>\nAber Rays Glanzleistungen wurden von ebenso vielen enttäuschenden Leistungen überschattetet. Als Teil von Cloud9 muss er im Frühjahrs-Split 2017 verstehen lernen, dass er nicht jedes Spiel selbst entscheiden kann und das auch nicht muss. Falls es der ehemalige Weltmeister Impact schaffen sollte, ihm das Geheimnis von „top die“ beizubringen, gibt es für ihn nach oben hin keine Grenzen mehr.\n"},"foreignIds":{"drupalId":"4208","TRLH1":"200000178","TRLH2":"200000082","TRLH3":"200000341"},"socialNetworks":{},"champions":[],"liveGameTeam":18},{"id":597,"slug":"flame","name":"Flame","firstName":"Ho-jong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flame-4grkykjb.png","hometown":"South Korea","region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-05-25T01:24:52.000Z","bios":{"en_US":"<p>Ho-jong \"Flame\" Lee wants to set the NA LCS on fire. The Korean top lane veteran has been around seemingly forever, with a career that began with Azubu Blaze all the way back in 2012. Alongside Insec and Xpeke, he's one of the few players to have a technique named after him in competitive play. Flame regularly builds CS advantages of 100 or more over his opponent, which has come to be known as a \"Flame Horizon.\"</p>\n\n<p>He brought those impressive mechanics to Immortals in 2017, replacing former top laner Huni. Flame is just as capable of the flashy plays Huni was known for, but he'll need to learn to work with IMT's new jungler in Xmithie. One thing's for sure: IMT's opposing top laners will have their work cut out for them if they don't want to get Flame Horizoned by the man himself.</p>","fr_FR":"<p>\nHo-jonh « Flame » Lee était considéré comme l'un des meilleurs carrys sur la voie du haut à l'époque où il travaillait avec CJ Entus. Il a le trophée du meilleur top laner coréen 2013 pour le prouver. Cependant, Flame ne s'est pas adapté à la meta 2015 centrée sur les top laners tanky et n'a pas su développer ses compétences avec Maokai et Gnar. Cela lui a coûté sa position comme titulaire au sein de LGD Gaming en 2015. Reste à savoir si Flame pourra retrouver... la flamme pour devenir le meilleur du monde sur la voie du haut.\n</p>","es_ES":"<p>\nA Ho-jonh ''Flame'' Lee se le tenía por uno de los mejores carries de la calle superior del mundo durante su etapa en CJ Entus. Y tiene el trofeo como mejor jugador de la calle superior de los Korean e-Sports Awards 2013 para demostrarlo. Sin embargo, no se ha adaptado bien al auge de los tanques en el metajuego de 2015 y no ha conseguido dominar a Maokai y Gnar. Estos problemas le han costado la titularidad en LGD Gaming en 2015. Habrá que ver si puede reavivar la llama para volver a ser uno de los grandes en la calle superior.\n</p>","pl_PL":"<p>\nW czasach, gdy grał wspólnie z CJ Entusem, Ho-jonh „Flame” Lee uważany był za jednego z najlepszych prowadzących w górnej alei, o czym świadczy zdobyty przez niego w 2013 r. puchar dla najlepszego zawodnika z górnej alei w koreańskiej lidze e-sportowej. Jednakże Flame nie zdołał zaadaptować się do rozgrywki w sezonie 2015, opartej głównie na obrońcach w górnych alejach. Nie udało mu się nauczyć gry Maokaiem ani Gnarem. Kosztowało go to pozycję startową podczas LGD Gaming w 2015 r. Zobaczymy, czy Flame zdoła ponownie rozniecić swój zapał, który czynił go jednym z najlepszych zawodników w górnych alejach.\n</p>","de_DE":"Ho-Jong „Flame“ Lee ist heiß auf die NA LCS. Der koreanische Top-Lane-Veteran ist schon eine gefühlte Ewigkeit in der Szene. Seine Karriere startete er bereits 2012 bei Azubu Blaze. Gemeinsam mit Insec und xPeke ist er einer der wenigen Spieler, nach dem ein Spielzug im wettkampforientierten Spiel benannt ist. Flame schafft es regelmäßig, einen VT-Vorteil (CS) von 100 oder mehr gegenüber seinen Gegnern herauszuspielen, was mittlerweile als „Flame Horizon“ bekannt geworden ist.\n</p>\nEr verstärkt die Immortals 2017 mit seinen beeindruckenden Spielmechaniken und ersetzt damit den ehemaligen Top-Laner Huni. Flame versteht es genauso wie Huni, ausgefallene Spielzüge zu machen, aber er muss lernen, mit IMTs neuem Jungler Dardoch zusammenzuarbeiten. Aber eins steht fest: IMTs Gegner auf der oberen Lane werden alle Hände voll zu tun haben, wenn sie verhindern wollen, vom legendären „Flame Horizon“ überrollt zu werden.\n","pt_BR":"<p>\nHo-jong “Flame” Lee foi considerado um dos melhores topos carregadores durante seu tempo na CJ Entus. E ele tem o troféu de Melhor Topo de eSports da Coreia em 2013 para provar isso. No entanto, Flame não se adaptou ao meta de tanques no topo durante 2015, e ainda tem que treinar muito seu Maokai e Gnar. Ainda resta saber se ele consegue reviver a chama de sua habilidade e dedicação para voltar a ser titular da LGD e um dos melhores topos do mundo.\n</p>"},"foreignIds":{"drupalId":"928","TRLH1":"200000215","TRLH2":"200000119"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":598,"slug":"olleh","name":"Olleh","firstName":"Joo-sung","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/olleh-980ek3b2.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-25T01:24:08.000Z","bios":{"en_US":"<p>Joo-sung “Olleh” Kim is a bit of a globetrotter. He began his career in the LCK in 2013 for KT Rolster Arrows before joining Brazilian squad PaiN Gaming in 2014. Almost immediately, PaiN Gaming rocketed to the top of the standings. But Olleh moved on once again, joining LMS team Hong Kong Esports, but with less success than before.</p>\n\n<p>Olleh joined a fresh Immortals lineup along with three other new players to start 2017. This summer, he’ll be paired once again in the bot lane with Cody Sun as they work toward earning Immortals their first playoff victory. If we’re lucky, Olleh might even treat us to some <a href=\"https://youtu.be/v-n53OhKDx8?t=21m18s\">beatboxing.</a></p>","fr_FR":"<p>\nJoo-sung « Olleh » Kim a certainement fait beaucoup plus de kilomètres durant sa carrière de joueur professionnel de LoL qu'un basketteur de l'équipe des Harlem Globetrotters. Il a commencé sa carrière en Corée en 2013 avec KT Rolster Arrows. Mais peu après, il est passé dans une autre équipe coréenne, Midas FIO. Son vrai voyage a commencé en 2014 quand il a fait le pari audacieux de s'installer au Brésil pour rejoindre paiN Gaming. Après avoir passé six mois en Amérique du Sud, Olleh a encore une fois eu envie de changer d'air. D'un hémisphère à l'autre, il a rejoint Hong Kong Esports pour les LMS. Quant à savoir où ira se nicher ce jeune support énigmatique ensuite, nous donnons notre langue au chat.\n</p>","es_ES":"<p>\nProbablemente no exista profesional de League of Legends más trotamundos que Joo-sung ''Olleh''. Su carrera comenzó en 2013, en el equipo coreano KT Rolster Arrows. Poco después de su debut, fichó por otro equipo del mismo país, Midas FIO. Pero el verdadero periplo comenzó en 2014, cuando, en una verdadera pirueta, decidió hacer las maletas y marcharse a Brasil para incorporarse a paiN Gaming. Tras seis meses en Sudamérica, Olleh volvió a sentir el gusanillo del cambio de aires, así que decidió cambiarse de hemisferio y de liga para fichar por Hong Kong Esports. ¿Quién puede saber dónde recalará a continuación este enigmático y joven apoyo? Literalmente, nadie.\n</p>","pl_PL":"<p>\nJoo-sung „Olleh” Kim prawdopodobnie wylatał więcej podczas swojej profesjonalnej kariery w League niż niektórzy piloci. Jego kariera rozpoczęła się w Korei w 2013 r. u KT Rolster Arrows. Niedługo po debiucie przeniósł się do Midas FIO, innej koreańskiej drużyny. Jego prawdziwe podróże zaczęły się w 2014 r., gdy postanowił zaryzykować i wyprowadzić się do Brazylii, aby dołączyć do paiN Gaming. Po spędzeniu sześciu miesięcy w Ameryce Południowej Olleh ponownie zapałał żądzą podróży. Ponownie zmienił półkule, aby dołączyć do Hong Kong Esports w LMS. Nie mamy zielonego pojęcia, gdzie ten enigmatyczny młody wspierający trafi następnym razem.\n</p>","de_DE":"Joo-Sung „Olleh“ Kim ist ein kleiner Weltenbummler. Seine Karriere hat er 2013 bei KT Rolster Arrows begonnen, bis er 2014 dem brasilianischen Team PaiN Gaming beigetreten ist. Unmittelbar danach ist PaiN Gaming an die Tabellenspitze geschossen. Aber Olleh entschloss sich, erneut umzuziehen und sich dem LMS-Team Hong Kong Esports anzuschließen. Allerdings hatte er dort weniger Erfolge zu verzeichnen als zuvor.</p>\n\nJetzt schließt sich Olleh zusammen mit drei anderen Spielern einem neuen Immortals-Team an. Er wird auf der unteren Lane mit Cody Sun zusammenspielen und mit ihm gemeinsam versuchen, den ersten Sieg in den Entscheidungsspielen einzufahren. Wenn wir Glück haben, gibt uns Olleh vielleicht sogar eine Kostprobe seiner Beatboxing-Künste.\n\n","ko_KR":"<p style=”font-family:”나눔고딕”;\">\"Olleh\" 김주성은 리그 오브 레전드 프로 선수로 활동하면서 항공사 마일리지를 엄청나게 쌓았을 겁니다. Olleh는 2013년 KT Rolster Arrows에서 프로 생활을 시작했습니다. 데뷔하고 얼마 지나지 않아 또 다른 한국 팀 Midas FIO로 자리를 옮겼죠. 그의 진짜 여정은 2014년 브라질의 paiN Gaming에 입단하는 모험을 감행하면서 시작됐습니다. 남미에서 6개월을 보낸 Olleh는 다시 한 번 세계를 돌아봐야겠다는 생각이 들었나 봅니다. 그는 다시 지구를 반바퀴 돌아 LMS의 Hong Kong Esports에 입단했습니다. 이 수수께끼 같은 젊은 서포터가 다음에는 어디로 갈지 종잡을 수가 없네요. </p>"},"foreignIds":{"drupalId":"3699","TRLH1":"200000219","TRLH2":"200000123"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":779,"slug":"themassacre8","name":"Cody Sun","firstName":"Li Yu","lastName":"Sun","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/themassacre8-zd7ul3j.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2015-06-03T20:36:46.000Z","updatedAt":"2017-07-04T19:04:51.000Z","bios":{"en_US":"<p>Li Yu \"Cody Sun\" Sun has a bright future. After spending almost two years in the challenger scene playing for Team Frostbite and Dream Team, the 19-year-old is making the leap straight to one of the most successful teams in the NA LCS. Formerly known as Massacre, Cody Sun excels on utility ADCs like Ashe and Sivir, but he's been known to bring out a hard carry like Jinx or Kog'Maw on occasion. He joins support Olleh in a bot lane for Immortals that will look to trade blows early and often with the best the NA LCS has to offer.</p>","de_DE":"Li Yu „Cody Sun“ Sun steht eine vielversprechende Zukunft bevor. Nachdem er beinahe zwei Jahre in der Challenger-Szene bei Team Frostbite und Dream Team verbrachte, hat der 19-Jährige den direkten Sprung in eines der erfolgreichsten Teams der NA LCS geschafft. Cody Sun, früher als Massacre bekannt, glänzt mit unterstützenden Schützen wie Ashe und Sivir, aber er ist auch dafür bekannt, hin und wieder Spiele mit Jynx oder Kog’Maw zu tragen. Er wird an der Seite von Olleh auf der unteren Lane der Immortals spielen und sich frühe Schlagabtausche mit den besten Spielern der NA LCS liefern."},"foreignIds":{"drupalId":"4562","TRLH1":"200000218","TRLH2":"200000122"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1103,"slug":"chorong","name":"AnDa","firstName":"Andy","lastName":"Hoang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chorong-f6gm2ows.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2016-01-21T22:11:01.000Z","updatedAt":"2017-06-14T20:19:15.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375273","TRLH1":"200000525","TRLH2":"200000426"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1105,"slug":"stunt","name":"Stunt","firstName":"William","lastName":"Chen","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/stunt-gaa9ryye.png","hometown":null,"region":"N/A","birthdate":null,"createdAt":"2016-01-21T22:14:10.000Z","updatedAt":"2017-06-14T20:10:32.000Z","bios":{},"foreignIds":{"TRLH1":"200000525","TRLH2":"200000427"},"socialNetworks":{},"champions":[],"liveGameTeam":166},{"id":1120,"slug":"contractz","name":"Contractz","firstName":"Juan","lastName":"Garcia","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/contractz-ae5zs14e.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2016-01-22T18:58:13.000Z","updatedAt":"2017-07-04T19:27:11.000Z","bios":{"en_US":"<p>Juan “Contractz” Garcia has graduated to the NA LCS. The promising young jungler spent the 2016 Summer Split in the NA Challenger Series, where he played a key role in earning Cloud9 Challenger a spot in the big league. After losing out on a chance to join the LCS in the Spring due to his age, he was finally old enough to make his debut.</p>\n\n<p>He had big shoes to fill in his rookie season taking over the starting jungle role from Cloud9 icon Meteos. But with the team’s other returning veterans, Contractz made the most of his opportunity, keeping pace with all of the best junglers in North America. He's proved he belongs in the NA LCS; now,\n it's time to take the next step: Worlds.</p>","de_DE":"Juan „Contractz“ Garcia ist in die NA LCS aufgestiegen. Der junge, vielversprechende Jungler hat den Sommer-Split 2016 in der nordamerikanischen Challenger Series verbracht, wo er eine Schlüsselrolle beim Aufstieg von Cloud9 Challenger in die höchste Klasse gespielt hat. Nachdem er im Frühjahr aufgrund seines Alters nicht in der LCS spielen durfte, ist er jetzt endlich alt genug, um sein Debüt zu geben.</p>\n\nEs wird für ihn keine leichte erste Saison, da er in die Fußstapfen von Cloud9-Legende Meteos treten muss. Aber da einige Veteranen ins Team zurückkehren, ist das der beste Zeitpunkt für Contractz. Er hat sich seine Chance verdient, in der LCS zu spielen; jetzt muss er zeigen, dass er auch dorthin gehört.\n"},"foreignIds":{"FRA1TMNT1":"375192","TRLH2":"200000077","TRLH1":"200000173","TRLH3":"200000337"},"socialNetworks":{},"champions":[],"liveGameTeam":18}],"scheduleItems":[{"id":"AVbJUzZqoUG4HPFjOKCd","content":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:match:e4954fff-1159-4496-9cbb-0d34f753fe0b","scheduledTime":"2016-09-05T19:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:2","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b","blockLabel":"Regional Qualifiers - Round 3","subBlockLabel":"1","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:bracket:f2d87c2c-b8b4-4c27-b925-ccbb3740ec2c"},"match":"e4954fff-1159-4496-9cbb-0d34f753fe0b","tournament":"472c44a9-49d3-4de4-912c-aa4151fd1b3b","bracket":"f2d87c2c-b8b4-4c27-b925-ccbb3740ec2c","league":"2"}],"gameIdMappings":[{"id":"c3e4e55d-fa8c-4dd8-a29b-d4f51c23efb7","gameHash":"3781e123166abc39"},{"id":"9007d2d3-52ba-45dc-9323-0e4381a0299a","gameHash":"0b4828b263b93d18"},{"id":"c5379eb2-e983-486b-ba5c-d7583701af63","gameHash":"4840300c023904dd"},{"id":"86abc116-e0b1-4b8f-8a89-38eedee6f66c","gameHash":"01368b5ce8fcef87"}],"videos":[{"id":4462,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:c3e4e55d-fa8c-4dd8-a29b-d4f51c23efb7","source":"https://www.youtube.com/embed/pCAKGLPRimY?wmode=transparent","createdAt":"2016-09-06T00:02:24.000Z","updatedAt":"2016-09-06T00:02:24.000Z","game":"c3e4e55d-fa8c-4dd8-a29b-d4f51c23efb7"},{"id":4463,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:c5379eb2-e983-486b-ba5c-d7583701af63","source":"https://www.youtube.com/embed/xbjnWx7YCyg?wmode=transparent","createdAt":"2016-09-06T00:02:37.000Z","updatedAt":"2016-09-06T00:02:37.000Z","game":"c5379eb2-e983-486b-ba5c-d7583701af63"},{"id":4466,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:86abc116-e0b1-4b8f-8a89-38eedee6f66c","source":"https://www.youtube.com/embed/LQRB6v9D9-4?wmode=transparent","createdAt":"2016-09-06T00:54:39.000Z","updatedAt":"2016-09-06T00:54:39.000Z","game":"86abc116-e0b1-4b8f-8a89-38eedee6f66c"},{"id":4467,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:472c44a9-49d3-4de4-912c-aa4151fd1b3b:game:9007d2d3-52ba-45dc-9323-0e4381a0299a","source":"https://www.youtube.com/embed/M9kfaAtj0Tg?wmode=transparent","createdAt":"2016-09-06T01:45:22.000Z","updatedAt":"2016-09-06T01:45:22.000Z","game":"9007d2d3-52ba-45dc-9323-0e4381a0299a"}],"htmlBlocks":[],"match":{"id":"e4954fff-1159-4496-9cbb-0d34f753fe0b","name":"match-c","position":0,"state":"resolved","groupPosition":2,"matchType":{"identifier":"best_of","options":{"best_of":"5"}},"input":[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0},{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],"games":{"c3e4e55d-fa8c-4dd8-a29b-d4f51c23efb7":{"id":"c3e4e55d-fa8c-4dd8-a29b-d4f51c23efb7","name":"G1","generatedName":"C9|IMT|G1|e4954fff115944969cbb","input":[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0},{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],"standings":{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473120066088,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473120062350,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473110970878,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001850046","gameRealm":"TRLH1","platformId":"TRLH1:1001850046","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"9007d2d3-52ba-45dc-9323-0e4381a0299a":{"id":"9007d2d3-52ba-45dc-9323-0e4381a0299a","name":"G4","generatedName":"C9|IMT|G4|e4954fff115944969cbb","input":[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0},{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}],"standings":{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473126240970,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473119893844,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001850054","gameRealm":"TRLH1","platformId":"TRLH1:1001850054","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"e8fccf8c-c753-4406-98cf-68092fc039c9":{"id":"e8fccf8c-c753-4406-98cf-68092fc039c9","name":"G5","generatedName":"C9|IMT|G5|e4954fff115944969cbb","input":[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0},{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"c5379eb2-e983-486b-ba5c-d7583701af63":{"id":"c5379eb2-e983-486b-ba5c-d7583701af63","name":"G2","generatedName":"C9|IMT|G2|e4954fff115944969cbb","input":[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0},{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}],"standings":{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473120078239,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473120075416,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}]],"timestamp":1473114043784,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001850052","gameRealm":"TRLH1","platformId":"TRLH1:1001850052","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"86abc116-e0b1-4b8f-8a89-38eedee6f66c":{"id":"86abc116-e0b1-4b8f-8a89-38eedee6f66c","name":"G3","generatedName":"C9|IMT|G3|e4954fff115944969cbb","input":[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0},{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}],"standings":{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}],[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}]],"timestamp":1473123319055,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"6e67fcdb-1153-4940-9714-37914386f367","breakpoint":"c4080ccb-029f-483e-8796-408d575442b8","standing":0}],[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0","match":"0f64f57b-c8f5-4d66-97f2-f4fb4589f76c","standing":0}]],"timestamp":1473117259071,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"gameId":"1001850053","gameRealm":"TRLH1","platformId":"TRLH1:1001850053","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473126240971,"source":"bestOf","history":[{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473123319057,"source":"bestOf","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473120078277,"source":"bestOf","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473120075416,"source":"bestOf","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473120066088,"source":"bestOf","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473120062351,"source":"bestOf","closed":true},{"result":[[{"roster":"02f53eca-387d-4a27-ad86-87d5d195bbf0"}],[{"roster":"6e67fcdb-1153-4940-9714-37914386f367"}]],"timestamp":1473119893846,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}