{"teams":[{"id":97,"slug":"splyce","name":"Splyce","guid":"be6e1a6a-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/splyce-gyo3tr9y.png","acronym":"SPY","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-08-08T09:39:46.000Z","bios":{"en_US":"<p>Splyce started from the bottom. Now they’re here, one of the best teams in Europe. Formerly Team Dignitas EU, Splyce made their debut in the 2016 EU LCS Spring Split and immediately struggled. The young team banded together in the Summer Promotion Tournament, and the very next split took second place in the regular season and earned a spot a Worlds though the Regional Qualifiers.</p>\n\n<p>Like their rivals G2, Splyce played poorly at Worlds. But with the same five members returning for 2017, they’re poised to once again dominate the EU LCS. If there’s any team in the league that knows how to deal with failure and come out on top, it’s Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","pl_PL":"<p>Splyce było na wiosnę 2016 drugą, obok G2 Esports, drużyną, dla której udział w tamtym Splicie był debiutem w LCS-owej stawce. W pełni duński skład awans do elitarnych rozgrywek wywalczył, zwyciężając w letnim splicie europejskiego Challenger Series (EU CS) 2015.</p>\n<p>Historia ekipy jest dość skromna i jej początki sięgają wiosennej edycji rywalizacji w EU CS w 2015 roku. Wtedy to drużynę SK Gaming Prime przejął Team Dignitas EU. W składzie doszło do trzech zmian, które w efekcie sprawiły, że DIG EU od tej pory stało się zespołem jednonarodowościowym – złożonym wyłącznie z Duńczyków. Obiecujący skład miał trudne początki i na wiosnę ledwo co zakwalifikował się do play-offów Challenger Series, w których, co ciekawe, ostatecznie nie wystąpił. Wszystkiemu winne były ograniczenia wiekowe w LCS, których nie spełniała wtedy dwójka zawodników formacji – Martin „Wunderwear” Hansen oraz Chres „Sencux”Laursen. Wobec tego ówczesne DIG EU zmuszone było do gry o uzyskanie ponownej kwalifikacji do EU CS na split letni.</p>\n<p>Od tej pory wszystko szło już jednak znacznie sprawniej i zespół bez problemu znów dostał się do Challenger Series, by następnie bez problemu zakwalifikować się do play-offów i tam pokonać wszystkich rywali, zapewniając sobie awans do LCS na wiosenną edycję w 2016 roku. Warto jednak zauważyć, że triumf ex-Dignitas EU nie należał do przekonujących. Niemniej ekipa ta jest ciekawą mieszanką talentu i młodości (Sencux, Wunderwear) z rutyną i doświadczeniem (Nicolai „Nisbeth” Nisbeth, Jonas „Trashy” Andersen). Ponadto atutem formacji jest oczywiście możliwość komunikacji w rodzimym języku.</p>\n<p>Ostatecznie beniaminek zmagań przystępuje do rywalizacji w zmienionych barwach. Zawodnicy zamienili trykoty Team Dignitas EU na koszulki nowej organizacji - Follow eSports, które ostatecznie przekształciło się w Splyce. W międzyczasie, przed startem wiosennego splitu EU LCS 2016, ekipa nie uniknęła również zmian w składzie, a konkretnie jednej. Dotychczasowego dżunglera, Dennisa \"Obviousa\" Sørensena, który opuścił formację 29 października 2015 roku, dwa tygodnie później zastąpił wracający z Ameryki Jonas \"Trashy\" Andersen. Warto dodać, że Splyce było wtedy dopiero siódmym zespołem w historii LCS złożonym wyłącznie z graczy jednej narodowości i drugim w pełni duńskim.</p>\n<p>Wiosenny split nie spełnił jednak oczekiwań kibiców Splyce ani samej formacji. Drużyna od samego początku zmagań utknęła na dole tabeli i ostatecznie zajęła niskie, ósme miejsce, które sprawiło, że Splyce zmuszone zostało do walki w turnieju barażowym o utrzymanie w stawce. Tam, chociaż nie bez problemów, zespół na szczęście pokonał jednak GIANTS Gaming wynikiem 3-2 i zagwarantował sobie miejsce w EU LCS na letnim split. W składzie drużyny doszło tylko do jednej zmiany – zawodzącego wspierającego Nicolaia „Nisbetha” Nisbetha zastąpił młody i utalentowany słoweński support Mihael „Mikyx” Mehle. Splyce przystąpiło do rywalizacji z nadziejami na awans do play-offów, chociaż eksperci po raz kolejni nie dawali bardzo młodej drużynie dużych szans na osiągnięcie takiego wyniku.</p>\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>\n","es_ES":"<p>Splyce (anteriormente llamado Team Dignitas EU) hicieron su debut en la LCS EU durante el split  de primavera de 2016, y tuvieron un duro comienzo para adaptarse al nivel de la LCS. Como resultado, el equipo tuvo que luchar en el Summer Promotion Tournament, en el que superaron a Giants Gaming en un apasionante enfrentamiento al mejor de cinco y se aseguraron llegar a la LCS EU. Splyce tuvo un exitoso split de verano que le posicionaría en segundo lugar, nada que ver con el de primavera, en el que casi quedaron eliminados. Ahora que han superado los baches de la competición europea, el joven equipo rebosa confianza de camino al Campeonato Mundial 2016. Es hora de demostrarle al mundo que el split de verano no fue suerte sino que Splyce ha llegado para quedarse.</p>\n<p>Entrenador: Hans Christian \"Liq\" Duerr</p>","de_DE":"<p>Splyce fing ganz unten an. Doch heute gehören sie zu den besten Mannschaften Europas. Splyce, ehemals Team Dignitas EU, gab sein Debüt beim Frühjahrs-Split der EU LCS 2016 und hatte sofort Probleme. Doch die junge Mannschaft fand im Sommer-Aufstiegsturnier zueinander, woraufhin sie bereits den nächsten Split auf Platz Zwei beendeten und sich in der regionalen Qualifikationsrunde für die Weltmeisterschaft qualifizieren konnten.</p>\n\n<p>Genau wie ihre Rivalen G2 spielte auch Splyce bei der Weltmeisterschaft schwach. Aber da sich ihre Aufstellung für die Saison 2017 nicht geändert hat, sind sie bereit, die EU LCS erneut zu dominieren. Wenn es in der Liga eine Mannschaft gibt, die weiß, wie man mit Fehlschlägen umgeht und sich wieder an die Spitze kämpft, dann ist das Splyce.</p>\n\n<p>Coach: Hans Christian \"Liq\" Duerr</p>\n","fr_FR":"<p>Nouveaux arrivants en LCS EU, Splyce a racheté cette année la place et l'effectif de Dignitas EU après la qualification de ces derniers en LCS.</p>\n\n<p>L'équipe a d'abord été connue sous le nom de Follow Esports, un site qui se présente comme le « programme télé de l'esport », mais tant le site que l'équipe LCS ont rapidement changé de nom au profit de l'actuel. Peu après l'achat le cofondateur du site a déclaré être très satisfait de son investissement dans League of Legends puisque cela les plaçait dans une « ligue aussi excitante que professionnelle, que ce soit au niveau de l'organisation, des joueurs ou des fans ». Reste à voir quelle place Splyce va occuper dans ces LCS auxquels l'organisation est aussi heureuse d'être associée. Pour la jeune entreprise basée aux Etats-Unis, elle n'a été créée qu'en avril 2015, les LCS sont à coup sur la garantie d'une exposition médiatique plus importante mais qu'en est-il de leurs ambitions sportives ? </p>\n\n<p>L'équipe a un avantage certain, l'absence de la barrière de la langue. En effet l'équipe est entièrement composée de joueurs danois, ce qui facilitera forcément la communication en jeu. Malgré tout, avec un effectif jeune et prometteur mais qui manque cruellement d'expérience, Splyce a un besoin criant d'un encadrement de bonne qualité pour concurrencer des adversaires qui ne leur feront pas de cadeau. L'entreprise semble néanmoins avoir bien cerné ce besoin puisqu'ils ont recruté Jakob « YamatoCannon » Mebdi, ancien entraîneur de Roccat, comme entraîneur et Chris Ehrenreich, ancien entraîneur de CLG en LCS NA, pour l'assister dans la mise en place d'un environnement de travail performant. </p>\n\n<p>Pas sur que cela suffise pour tutoyer les sommets des LCS dès le printemps 2016, mais les joueurs, confrontés au plus haut niveau européen, devraient à tout le moins progresser rapidement tant au niveau individuel qu'en tant qu'équipe. C'est tout le mal qu'on leur souhaite !</p>\n\n<p>Head Coach: Hans Christian \"Liq\" Duerr</p>","es_AR":"<p>Splyce (antiguamente llamado Team Dignitas EU) hizo su debut en la LCS EU durante el torneo de clausura del 2016 y pudo experimentar la agresividad del alto nivel de juego que allí se presenta. De esta forma, el equipo tuvo que luchar para salir del torneo de promoción de verano, en el que vencieron a Giants Gaming en un emocionante combate al mejor de cinco para conseguir un pase a la LCS EU. Splyce tuvo un exitoso torneo de clausura en el que consiguieron un segundo lugar, algo totalmente inesperado luego del descenso que sufrieron en primavera. Luego de haber arrasado en la competencia del Guantelete europeo, el joven equipo rebosa de confianza para encarar el Campeonato Mundial 2016. Es hora de mostrarle al mundo que el torneo de clausura no fue una casualidad, y que Splyce ha llegado para quedarse.</p>\n\n<p><strong>Entrenador: Jakob \"YamatoCannon\" Mebdi</strong></p>","pt_BR":"A equipe da Splyce (antiga Team Dignitas EU) fez sua estreia na EU LCS durante a Etapa de Primavera 2016 e teve um choque de realidade com o calibre de jogo da LCS. Como resultado, a equipe teve que passar pelo Torneio de Promoção de Verão, onde conseguiram derrotar a Giants Gaming em uma emocionante melhor de 5, ganhando seus ingressos de volta para a EU LCS. A Splyce então teve uma explosão de sucesso na Etapa de Verão, conseguindo o segundo lugar - um sucesso e tanto depois de sua quase relegação na Etapa de Primavera. Agora que a equipe despachou a competição no cenário europeu, todos estão transbordando de confiança para o Campeonato Mundial 2016. Está na hora de mostrar para o mundo que a Etapa de Verão não foi mera sorte e que a Splyce chegou para ficar.","en_GB":""},"foreignIds":{"drupalId":"4032"},"players":[232,336,387,588,663,954,1771],"starters":[232,336,387,588,954],"subs":[663,1771]},{"id":335,"slug":"ninjas-in-pyjamas","name":"Ninjas in Pyjamas","guid":"c11ee870-91e2-475c-8c4d-8331bbcc0fef","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-588ue1or.png","acronym":"NIP","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-fmnft9me.png","createdAt":"2017-05-23T21:16:51.000Z","updatedAt":"2017-07-27T08:06:19.000Z","bios":{"en_US":"<p>After nearly four years away, Ninjas in Pyjamas have sneaked back into the EU LCS. After acquiring the spot of Fnatic Academy, the organization that gave players like Bjergsen and Svenskeren their start is looking to take the league by storm with a brand new roster. The players will have to be nimble if they want to build synergy and challenge the giants of Europe. Don't turn your back on the Ninjas. </p>\n\n<p>Coach: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Team Manager: Robin \"Jed\" Jedhammar</p>","pl_PL":"<p>Po niemal czterech latach nieobecności Ninja zakradli się z powrotem do EU LCS. Po zajęciu miejsca Fnatic Academy — organizacji, która wydała z siebie takich zawodników jak Bjergsen i Svenskeren — drużyna od samego początku zamierza podbić ligę szturmem w całkiem nowym składzie. Zawodnicy będą musieli być niezwykle skuteczni, jeśli chcą zgrać się ze sobą i rzucić wyzwanie gigantom Europy. Nie odwracajcie się plecami do Ninja. </p>\n\n<p>Główny trener: Nicholas „NicoThePico” Korsgaard</p>\n<p>Menedżer drużyny: Robin „Jed” Jedhammar</p>\n","fr_FR":"<p>Après presque quatre ans d'absence, les Ninjas in Pyjamas sont de retour dans les LCS EU. Suite à sa victoire contre Fnatic Academy, l'organisation dans laquelle Bjergsen et Svenskeren ont fait leurs débuts espère prendre la ligue d'assaut grâce à une toute nouvelle formation. Les joueurs devront faire preuve d'une grande agilité pour créer une synergie et mettre les géants européens au défi. Ne tournez pas le dos aux Ninjas. </p>\n\n<p>Entraîneur principal : Nicholas « NicoThePico » Korsgaard</p>\n<p>Responsable d'équipe : Robin « Jed » Jedhammar</p>\n","es_ES":"<p>Después de casi cuatro años, Ninjas in Pyjamas ha vuelto a la LCS EU. La organización que fue testigo de los primeros pasos de Bjergsen y Svenskeren llega para arrasar con una nueva plantilla después de quedarse con el puesto de Fnatic Academy. Los jugadores tendrán que ser astutos si quieren compenetrarse y suponer un desafío para los colosos de Europa. No perdáis de vista a los Ninjas. </p>\n\n<p>Entrenador principal: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Jefe de equipo: Robin \"Jed\" Jedhammar</p>\n","de_DE":"<p>Nach beinahe vier Jahren Abwesenheit haben sich die Ninjas in Pyjamas wieder in die EU LCS geschlichen. Die Organisation, bei der Spieler wie Bjergsen und Svenskeren ihre Profikarrieren gestartet haben, hat sich den Startplatz von Fnatic Academy gesichert und versucht jetzt, die Liga mit einer neuen Aufstellung im Sturm zu erobern. Doch die Spieler müssen sich geschickt anstellen, wenn sie die perfekte Harmonie finden und Europas Schwergewichte herausfordern wollen. Wende den Ninjas ja nicht den Rücken zu. </p>\n\n<p>Cheftrainer: Nicholas „NicoThePico“ Korsgaard</p>\n<p>Mannschaftsleiter: Robin „Jed“ Jedhammar</p>\n"},"foreignIds":{},"players":[197,484,713,750,1115,1684,1721,1913],"starters":[197,484,713,750,1684],"subs":[1115,1721,1913]}],"players":[{"id":197,"slug":"shook","name":"Shook","firstName":"Ilyas","lastName":"Hartsema","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shook-43143fnj.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-06-09T11:04:02.000Z","bios":{"en_US":"<p>Ilyas “Shook” Hartsema  made his first LCS appearance in the 2014 EU LCS Spring Split, jumping onto his opponents with every jungle assassin he could find. From Lee Sin to Kha’Zix, and even Evelynn, Shook found true happiness by exploding enemy carries from 100 to 0. His skill and technique in the jungle were proven time and again with impressive displays to both save his allies and slay his foes.</p>\n\n<p>However, with the meta quickly shifting towards tanky champs in the jungle, Shook found himself out of sorts. Claiming 1st place in Europe and participating in the group stages at the 2014 World Championship with Alliance started to look like Shook's peak, and he slowly slid down the mountain in 2015 with Elements and then the Copenhagen Wolves. Now he finds himself back in the LCS with Ninjas in Pyjamas. Here's hoping we see the old Shook, the champion slayer.</p>","de_DE":"<p>Der niederländische Spieler Ilyas Hartsema hört auf den Namen Shook und hat in der Vergangenheit bereits in vielen Teams mitspielen dürfen. Die bekanntesten Besuche hatte er in diesem Fall bei Copenhagen Wolves, Elements oder mousesports. Nachdem er aber alle Teams bereits nach kurzer Zeit wieder verlassen hatte, hofft er jetzt bei Vitality auf eine lange und große Karriere. </p>\n\n<p>Ilyas Hartsema ist ein exzellenter Jungler, der vor allem für seine Spielweise mit Lee Sin bekannt ist. Shook hat 2014 für das Team Alliance gespielt und durfte hier im EU LCS Summer Split und beim EU LCS Spring Split mitwirken. Damals waren gerade Lee Sin und Nidalee auf ihm oft zu sehen. </p>\n\n<p><h2>Die Rolle von Shook </h2></p>\n\n<p>Shook begann seine Karriere in League of Legends als Top-Laner. Nachdem er es aber Leid war, immer wieder von gegnerischen Spielern aus dem Dschungel aufgemischt zu werden, entschloss er sich dazu ein Jungler zu werden. Er selbst beschreibt sich selbst als aggressiver Spieler, der gerne den Kampf beginnt und dafür ein hohes Risiko eingeht. </p>\n\n<p><i>„Ich muss mich manchmal zurückhalten, um nicht zu aggressiv ins Geschehen zu gehen. Manchmal endet es schlimm für mich.“  - Ilyas „Shook“ Hartsema </i></p>\n\n<p>Die aggressive Spielweise spiegelte sich lange Zeit aber nicht nur auf dem Spielfeld wider. Während der dritten Saison bekam er für all seine Accounts einen permanenten Bann, nachdem er lange Zeit eine sehr toxische Einstellung besaß. Erst mit dem Start der Saison im Jahr 2014 durfte Ilyas Hartsema wieder als Shook spielen und war hier als Jungler beim Team Alliance vertreten. Seitdem gibt er alles dafür, zu den besten Dschungel-Spielern aus Europa zu gehören. </p>\n\n<p><i>„Ich glaube ich kann der beste Jungler in Europa werden, sofern ich viel übe. Das Ziel ist die Weltmeisterschaft. Ich werde erst zufrieden sein, wenn ich das erreicht habe.“ - Ilyas „Shook“ Hartsema</i></p>\n\n\n<p><h2>Interessante Fakten </h2></p>\n<p>•\tBeliebte Champions: Lee Sin, Nidalee, Rek´Sai</p>\n<p>•\tNiederländischer Spieler </p>\n<p>•\tBekannt für seine aggressive Spielweise </p>\n","fr_FR":"<p>Ilyas « Shook » Hartsema a fait sa première apparition aux LCS lors du segment printanier des LCS EU 2014, bondissant inlassablement sur ses adversaires pour les assassiner. Que ce soit avec Lee Sin ou Kha'Zix, voire Evelynn, Shook s'est épanoui en supprimant les carrys ennemis. Ses compétences et sa technique dans la jungle ont prouvé à maintes reprises qu'il était aussi bien capable de sauver ses alliés que de tuer ses ennemis.</p>\n<p>Cependant, la meta ayant rapidement évolué en faveur des champions tanky dans la jungle, Shook s'est retrouvé diminué. En 2014, la première place obtenue aux LCS EU et la participation à la phase de groupe du mondial avec Alliance ont été le sommet de la carrière de Shook ; après cela, il a été sur une pente descendante en 2015, avec Elements puis avec Copenhagen Wolves. Team Vitality a toutefois décidé de compter sur lui et a recruté Shook durant l'intersaison 2015. Nouvelle formation, nouvelle organisation et nouveau départ ! Espérons que nous retrouverons l'ancien Shook, celui qui faisait des massacres.</p>","es_ES":"<p>Pocos recuerdan la época en la que Ilyas ‘Shook’ Hartsema decidió prescindir del apodo por el que ahora es conocido para llamarse ‘enVision’. En efecto, después de pasar por organizaciones con las que aspiraba a acceder a la primera edición de la LCS EU, como DragonBorns o mousesports, el holandés decidió modificar su alias con el deseo de iniciar una nueva etapa en su carrera.</p>\n\n<p>Pero, como algunos genios aconsejan, hay que tener cuidado con lo que se desea. El 21 de enero de 2013, cuatro días antes de disputar el clasificatorio para la máxima competición continental, el jungla recibió una sanción que le alejaba de la LCS durante un año. Con su sueño hecho añicos por culpa de su mal comportamiento en las partidas clasificatorias, Shook recuperó su sobrenombre original, quizá para recordarse a sí mismo que tenía que volver al punto de partida para alcanzar su meta.</p>\n\n<p>Lejos de venirse abajo, Shook no tardó en unirse a Pride FC para dominar el circuito amateur europeo junto a Martin ‘Rekkles’ Larsson, cedido por Fnatic debido a la restricción de edad que le impedía codearse con los mejores. La exitosa alineación captó con celeridad la atención de Copenhagen Wolves, que buscaba un hueco en la LCS. La organización danesa, conocida por pulir diamantes en bruto que se unen a proyectos más ambiciosos tras su periodo de formación, fue incapaz de retener a su principal activo cuando Riot Games levantó a Shook su castigo.</p>\n\n<p>Casi diez meses después de ver truncadas sus esperanzas, Alliance le ofreció al prometedor jungla un hueco en el proyecto forjado con la intención de derrocar a Fnatic. El equipo no dio con la tecla adecuada en el split de primavera de 2014, pero encontró la fórmula perfecta en la edición estival. La escuadra no abandonó el liderato durante toda la fase regular gracias en buena parte a las actuaciones de Shook con Lee Sin y Elise, sus dos personajes emblemáticos, que le llevaron a recibir el premio al jugador más valorado de la segunda jornada.</p>","pl_PL":"<p>Shook to dżungler o ogromnych możliwościach, który jednak w ciągu dwóch lat występów na najwyższym poziomie nie do końca potrafił zaprezentować skalę swojego talentu i wydaje się, że nadal ma coś do udowodnienia.</p>\n<p>\nHolenderski gracz zaczynał swoją przygodę z profesjonalną sceną we wrześniu 2012 roku od występów w IWantCookie, które później przekształciło się w Dragonborns, lecz Shook grał w tej drużynie jeszcze zanim zespół wywalczył awans do EU LCS. Później holenderski dżungler dołączył do formacji Pride FC, której potencjał szybko dostrzegły większe organizacje. Ostatecznie formacja została zakontraktowana przez Copenhagen Wolves i całkowicie zdominowała amatorską scenę, a ukoronowaniem dobrych występów był awans do wiosennego splitu EU LCS 2014. Shook jednak miał inne plany i zdecydował się zmienić zespół. Dołączył do Henrika „Froggena” Hansena budującego europejski super-team w Alliance.  Shook był w tym czasie uważany za czołowego leśnika na Starym Kontynencie, wobec czego nie może dziwić, że duński mid-laner do swojego wymarzonego składu wybrał właśnie jego. </p>\n<p>\nOczekiwania co do występów nowej potęgi były jednak ogromne, a zawodnicy mieli problemy by je udźwignąć. Ogromna fala krytyki spadła właśnie na Shooka, który nie prezentował się tak jak tego od niego oczekiwano i miał dość duży wpływ na beznadziejną passę drużyny, która z pierwszych 12 spotkań wygrała tylko cztery pojedynki. Już wieszczono rychły koniec nadziei na dominację w Europie, kiedy Shook i cały zespół przebudzili się i finiszowali na trzeciej pozycji, play-offy kończąc na czwartym miejscu. Już wtedy profesjonalni zawodnicy zachodzili w głowę, dlaczego holenderski dżungler tak znakomicie prezentuje się w grach treningowych, nierzadko niemal samodzielnie ciągnąć drużynę, a tak bardzo zawodzi w meczach o stawkę. Ten problem miał się ciągnąć za Shookiem jeszcze bardzo długo.</p>\n<p>\nPomimo to w letnim splicie 2014 Alliance spisało się już znacznie lepiej – zwyciężyło, przerywając dominację Fnatic, a Shook zrobił duży postęp, jeśli chodzi o występy na scenie. Zachwycał przede wszystkim swoim osławionym Lee Sinem, który do dziś jest jego najmocniejszą postacią. </p>\n<p>\n„Jeśli ktokolwiek miałby równać się z Inseciem, jeśli chodzi o opanowanie Lee Sina, to byłby to Shook” – powiedział nawet polski dżungler Marcin „Jankos” Jankowski.</p>\n<p>\nDrużynie Holendra udało się przerwać dominację Fnatic i wygrać letnią edycję zmagań, a w związku z tym także pojechać na Mistrzostwa Świata. Tam formacja przeżywała kryzys, a Shook ponownie zmagał się ze starymi problemami i do końca swojej kariery w Alliance, które później zmieniło nazwę na Elements, nie potrafił już pokazać pełni swoich możliwości. Wskutek tego zespół w końcu stracił cierpliwość i w letnim splicie zastąpił Holendra Marcelem „Dexterem” Feldkampem. Shook na krótko wylądował jeszcze w Copenhagen Wolves, gdzie zagrał dziesięć ostatnich spotkań splitu i, pozbawiony tak dużej presji, znów błyszczał, ale nie dał rady uratować znajdującej się w fatalnej sytuacji starej/nowej ekipy.\nPo zakończeniu letniej edycji rozgrywek 2015 słuch o holenderskim leśniku zaginął i pierwsze doniesienia wypłynęły dopiero w grudniu 2015 roku, kiedy okazało się, że Shook został dżunglerem w aspirującym do walki o czołowe lokaty Teamie Vitality.\n</p>"},"foreignIds":{"drupalId":"1119","TRLH3":"200000305","TRLH4":"200000405","TRLH2":"1001250065","FRA1TMNT2":"25479"},"socialNetworks":{"twitch":"www.twitch.tv/shooklol","facebook":"www.facebook.com/Shook.LoL","twitter":"https://twitter.com/ShookLoL"},"champions":[],"liveGameTeam":335},{"id":232,"slug":"trashy","name":"Trashy","firstName":"Jonas ","lastName":"Andersen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/trashy-epw5lsut.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:40:20.000Z","bios":{"en_US":"<p>Jonas “Trashy” Anderson spent years jumping between teams until everything finally clicked with Splyce. A jungler with a wealth of experience, Trashy even spent time in the NA LCS for Enemy eSports. When he found a home on Splyce, it wasn’t long before he became a top jungler in the EU LCS.</p>\n\n<p>It will take more than a disappointing performance at the 2016 World Championship to stop this jungler from improving. At the helm of what is still a young team, Trashy is poised to take big leaps forward with Splyce in 2017. And if he’s allowed to have his way in the jungler, he’ll be taking the rest of the EU LCS out with the rest of the garbage.</p>","de_DE":"<p>Jonas „Trashy“ Anderson hat immer wieder die Mannschaft gewechselt, bis er endlich bei Splyce landete. Trashy ist ein Jungler mit viel Erfahrung, der eine Zeit lang sogar bei Enemy eSports in der NA LCS spielte. Nachdem er bei Splyce ein neues Zuhause gefunden hatte, dauerte es nicht lange, bis er zu einem der besten Jungler der EU LCS wurde.\n\nEs braucht mehr als eine enttäuschende Vorstellung bei der Weltmeisterschaft 2016, um diesen Jungler daran zu hindern, immer besser zu werden. Trashy ist am Ruder dieser jungen Mannschaft und bereit, mit Splyce 2017 große Sprünge zu machen. Und wenn er im Dschungel ungestört tun und lassen kann, was er will, wird er die anderen Mannschaften in der EU LCS zusammen mit dem Müll entsorgen.</p>","fr_FR":"<p>Jonas « Trashy » Andersen est à la fois le petit nouveau de chez Splyce et l'un des deux seuls de son équipe à avoir déjà fait l'expérience des LCS avant cette année. </p>\n\n<p>Le jungler danois a en effet pris part au segment de printemps des LCS NA en 2015 au sein de l'équipe Enemy eSports. Comme son compatriote Lucas « Santorin » Tao Kilmer Larsen avant lui, Trashy a en effet pris le risque de traverser l'atlantique pour y rejoindre une équipe semi-professionnelle et tenter de devenir joueur professionnel en Amérique du Nord. Après une qualification relativement aisée pour les Challenger Series, son équipe et lui ont entrepris une domination sans partage sur l'antichambre des LCS. Ils n'ont perdu en tout et pour tout qu'un seul match de la saison régulière, face à Team Fusion, eux-même favoris pour la qualification en LCS ! C'est logiquement que Enemy a ensuite dominé les play-off pour empocher la qualification automatique pour le segment d'été des LCS NA. </p>\n\n<p>Malheureusement pour Trashy et les siens, la suite de l'histoire n'a pas été aussi rose, loin de là. Pas suffisamment préparée au niveau d'exigence et de jeu nécessaire au plus haut niveau nord-américain, l'équipe a enchaîné défaite sur défaite. Incapables de hausser leur niveau de jeu, les Enemy ont terminé leur saison à une piteuse 9ème place. Pire, ils ont bu le calice jusqu'à la lie en se faisant éliminer 3 victoires à rien par Team Coast lors du tounoi de relégation. </p>\n\n<p>Une expérience difficile à vivre pour un joueur qui a bien cru que sa carrière allait se terminer là, alors même qu'il était sans doute le meilleur joueur de son ancienne équipe. Il avoue lui même avoir été « surpris » quand Splyce a pris contact avec lui malgré sa récente élimination des LCS NA. Un contact bienheureux pour le joueur donc, un contact remotivant aussi. Trashy a repris espoir et pense aujourd'hui que « jouer avec quatre autres danois est la bonne décision » pour sa carrière et que Splyce « va surprendre beaucoup de monde » en 2016, comme il l'a affirmé au DailyDot. </p>\n\n<p>Quoiqu'il en soit, avec des joueurs prometteurs à ses côtés, Trashy a à présent toutes les armes en main pour réussir. </p>","es_ES":"<p>Jonas ''Trashy'' Andersen llega desde Dinamarca cargado de experiencia. Jugó en equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, además de participar en la LCS NA con Enemy eSports. Pero Trashy no tardaría en echar de menos su casa, así que volvió a la LCS EU al final de 2015 y se unió a Splyce.</p>\n\n<p>Tras probar por primera vez la alta esfera competitiva europea en el split de primavera de la LCS EU 2016, Trashy subió el listón del split y se convirtió en uno de los mejores junglas de Europa. Sus mejoras ayudaron a que Splyce obtuviese el segundo puesto en la temporada regular, y una gran clasificación en el Clasificatorio Regional de la LCS EU. Trashy lidera un equipo que está dispuesto a llegar al cielo. ¿Conseguirán los equipos de alto nivel del Campeonato Mundial 2016 traer a Trashy y a Splyce de vuelta a la tierra, o el joven equipo nos sorprenderá a todos? Pronto lo descubriremos.</p>","pl_PL":"<p>Trashy jest najnowszym nabytkiem formacji (dołączył do drużyny 16 listopada 2015 roku) I jednocześnie najbardziej doświadczonym graczem w zespole. Duński dżungler na profesjonalnej scenie znajduje się już od 2012 roku i w tym trakcie swojej kariery miał okazję występować w składach takich drużyn jak Tricked eSports, Reason Gaming, Cloud 9 Eclipse czy SK Gaming Prime. W tym czasie Trashy występował głównie w Challenger Series, ale próby dostania do EU LCS kończyły się porażką zarówno w przypadku Reason Gaming, jak i SK Gaming Prime. Duńczykowi udało się awansować do najwyższej klasy rozgrywkowej (letni split NA LCS 2015) dopiero z amerykańskim Enemy eSports, choć formacja długa wahała się czy zatrudnić duńskiego leśnika. Co ciekawe, ostatecznie zarząd przekonała deklaracja Trashy’ego, że.. zapłaci za lot z własnej kieszeni, tylko po to, by móc wziąć udział w testach, które organizował zespół. </p>\n<p>\nNiestety amerykańska przygoda Duńczyka zakończyła się na dwóch splitach występów, w tym zaledwie jednym spędzonym w NA LCS i jednym w NA Challenger Series. Jednak w tym czasie duński zawodnik dał się poznać jako jeden z najmocniejszych punktów NME – w większości klasyfikacji indywidualnych znalazł się w pierwszej piątce wśród dżunglerów tamtejszych rozgrywek, a jeśli chodzi o procentowy udział w zabójstwach oraz najmniejszą ilość śmierci udało mu się nawet wskoczyć na podium. Teraz powrócił do Europy skuszony ofertą Splyce i w sumie ciężko się dziwić, że wybór FE padł właśnie na niego. Zespół szukający duńskiego dżunglera nie mógł bowiem trafić lepiej (no może z wyjątkiem Dennisa \"Svenskerena\" Johnsena, który miał jednak inne plany, bowiem dołączył do Teamu SoloMid). </p>\n<p>\nTrashy w trakcie swojej kariery dał się poznać jako znakomity gracz Elise oraz Rengara, choć w letniej edycji NA LCS 2015 najczęściej wybierał Rek’sai oraz Gragasa ze względu na siłę tych postaci. Ciekawostką może być fakt, że Thrashy bardzo dobrze zna się z innym duńskim dżunglerem, który występował w Ameryce – Lucasem \"Santorinem\" Tao Kilmer Larsenem.</p>\n<p>\n„Jestem bardzo zadowolony z dołączenia do byłego DIG EU, teraz Follow eSports… Byłem nieco zaskoczony, kiedy drużyna ta skontaktowała się ze mną po fiasku meczów barażowych w barwach mojego byłego zespołu, NME. Jednak nie mam wątpliwości, że dołączenie do tych czterech duńskich facetów jest właściwą decyzją.” – powiedział Trashy w wywiadzie dla portalu Daily.dot.</p>\n<p>\nZadowolenie Trashy’ego nie może dziwić. Wszak przyznał wcześniej w żartach, że uważa Duńczyków za… Koreańczyków Europy. A tutaj ma ich pod dostatkiem!\n</p>","es_AR":"<p>Oriundo de Dinamarca, Jonas \"Trashy\" Anderson tiene una vasta experiencia. Ha jugado para equipos como Cloud9 Eclipse, SK Gaming Prime y Reason Gaming, sin mencionar su paso por la LCS NA con Enemy eSports. Sin embargo, no pasó mucho para que Trashy comience a echar de menos su hogar. Regresó a la LCS EU a finales del 2015 para unirse a la nueva formación de Splyce.</p>\n\n<p>Después de tener su primera experiencia en la competencia europea de primer nivel en el torneo de apertura de la LCS EU 2016, Trashy se esforzó aún más en el torneo de clausura, hasta llegar a ser uno de los mejores jungleros de Europa. Su mejora sirvió para que Splyce llegara al segundo lugar en la temporada regular y tuviera una excelente actuación en la clasificatoria regional de la LCS EU. Trashy dirige el timón de un equipo que va derecho a las nubes. ¿Lograrán los equipos de primer nivel del Campeonato Mundial 2016 enviar a Trashy y Splyce de regreso a la tierra? ¿O acaso el joven equipo conseguirá sorprendernos a todos? Estamos a punto de descubrirlo.</p>"},"foreignIds":{"drupalId":"1409","TRLH4":"200000207","TRLH3":"200000104"},"socialNetworks":{"twitch":"twitch.tv/trashylol","facebook":"facebook.com/Trashylol","twitter":"twitter.com/SPY_Trashy"},"champions":[],"liveGameTeam":97},{"id":336,"slug":"sencux","name":"Sencux","firstName":"Chres","lastName":"Laursen","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sencux-efit8ngk.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:50.000Z","updatedAt":"2017-06-09T10:40:39.000Z","bios":{"en_US":"<p>Chres “Sencux” Larsen has the makings of Europe’s next mid lane star. He made his way to Splyce after honing his skills in the Challenger scene. Sencux showed flashes of brilliance early in the 2016 EU LCS Spring Split, and in the Summer took the next step to rival the best mid laners in the league.</p>\n\n<p>At the 2016 World Championship, Sencux couldn’t quite keep up with the best mid laners in the world. But as he returns to the EU LCS with the rest of Splyce for 2017, his time on the international stage should prove to be an invaluable experience. If he can keep up his blazing pace of improvement, it won’t be long at all before he gets another shot at the world’s finest.</p>","de_DE":"<p>Chres „Sencux“ Larsen hat das Zeug zu Europas nächstem großen Star auf der mittleren Lane. Er kam zu Splyce, nachdem er sein Können in der Herausforderer-Szene perfektioniert hatte. Sencux ließ sein Können bereits zu Beginn des Frühjahrs-Splits der EU LCS 2016 aufblitzen und machte im Sommer den nächsten Schritt, um es mit den besten Mid-Lanern der Liga aufzunehmen.\n\nBei der Weltmeisterschaft 2016 konnte Sencux jedoch nicht ganz mit den besten Mid-Lanern der Welt mithalten. Aber wenn er mit dem Rest von Splyce 2017 in die EU LCS zurückkehrt, sollten sich seine Erfahrungen auf der internationalen Bühne bezahlt machen. Wenn er sich weiterhin steigern kann, wir es nicht lange dauern, bis er es wieder mit den Besten der Welt zu tun bekommt.</p>","fr_FR":"<p>Chres « Sencux » Laursen a tout juste 17 ans, joue à League of Legends depuis 4 ans et gravite dans le milieu compétitif depuis 2014. Après une première expérience chez Reason Gaming, il s'apprête à présent à découvrir les LCS accompagné d’une réputation flatteuse. </p>\n\n<p>La plupart des observateurs considèrent que le danois est, avec Luka « PerkZ » Perković de chez G2 Esports, le porte-drapeau d'une nouvelle génération de midlaners européens. Un héritage pas forcément facile à porter ! Sous les couleurs de Splyce, le joueur va en tout cas devoir le défendre face à ceux qui ont porté ce titre avant lui, à l'instar de Fabian « Febiven » Diepstraten. Y est-il prêt ? Pour être honnête et au vu de ce qu'il a montré en Challenger Series, Sencux est sans doute encore un peu tendre. Contrairement à Febiven l'an dernier, il est peu probable que le midlaner de Splyce gagne systématiquement la voie du milieu en 1v1 face à ses adversaires plus expérimentés. Sa prise de décision, particulièrement, est parfois douteuse. Malgré tout le jeune midlaner n'est pas en dessous du niveau attendu en LCS, bien au contraire. Son niveau individuel est même certainement déjà supérieur à celui de certains joueurs LCS. Il lui manque juste quelques ajustements à faire pour atteindre les sommets, mais il a à coup sur le talent nécessaire pour y parvenir. </p>\n\n<p>Il va pouvoir s'appuyer pour cela sur son style de jeu, tout en contrôle. Sur sa confiance en son jeu aussi, lui qui déclarait avant même le segment d'été des Challenger Series : « si Febiven peut passer de challenger à l'un des meilleurs midlaners, pourquoi est-ce que moi je ne pourrais pas faire de même ? » Comme dirait l'autre, y a plus qu'à !</p>","es_ES":"<p>Chres ''Sencux'' Laursen es uno de los jugadores titulares más jóvenes de la LCS EU. AspiranteTras jugar en varios equipos aspirantes diferentes, Sencux llegó a Splyce (anteriormente llamado Team Dignitas EU) y logró hacerse con un puesto en la LCS EU. Su rol en la calle central consiste fundamentalmente en debilitar constantemente a sus oponentes para controlar las batallas de equipo y los objetivos del mapa.</p>\n\n<p>Tras demostrar unas jugadas brillantes en el split de primavera de la LCS EU 2016 (como el asesinato cuádruple con LeBlanc), los espectadores y analistas se preguntaban si tiene lo que hace falta para convertirse la próxima estrella europea de la calle central. Sencux calló las voces de los escépticos y consiguió obtener con Splyce el segundo puesto en el split de verano de la LCS EU 2016 y, por consiguiente, superar la escena europea y asegurarse un puesto en el Mundial. Aunque Sencux sea capaz de lanzar hechizos a los mejores mid de Europa, la escena internacional es completamente diferente. La mayor prueba de Sencux está aún por llegar, y será una batalla a vida o muerte en la Grieta contra los mejores jugadores de League of Legends.</p>","pl_PL":"<p>Sencux to niekwestionowana gwiazda zespołu I jego najważniejszy zawodnik. To właśnie Chres dzięki swoim niesamowitym umiejętnościom i fantastycznym zagraniom najczęściej prowadzi zespół do zwycięstw. Warto jednak zauważyć, że w momencie startu wiosennego splitu EU LCS 2016 Sencux to będzie nadal bardzo młody, 17-letni zawodnik (jest ledwie pół miesiąca starszy od Wunderweara). Ogromnym problemem Duńczyka, niejako związanym z wiekiem, jest gra pod presją, której zawodnik nie zawsze potrafi sprostać. W tym aspekcie od razu nasuwa się porównanie z holenderskim mid-lanerem, Fabianem \"Febivenem\" Diepstratenem sprzed awansu do LCS z drużyną H2k. </p>\n<p>\nJednocześnie Duńczyk ma już całkiem spore doświadczenie, bowiem występuje na scenie od stycznia 2014 roku, co sprawia, że zaczynał jako zaledwie… piętnastolatek. Jego pierwszym przystankiem na drodze do wielkiej kariery był zespół Reason Gaming, gdzie spotkał Jonasa „Trashy’ego” Andersena. Później, wraz z Kasperem \"Kobbe’m\" Kobberupem oraz Martinem „Wunderwearem” Hansenem występował w 4everzenzyg oraz SK Gaming Prime-Dignitas EU, które w końcu przekształciło się w Follow eSports, a następnie w Splyce. Co ciekawe, Nicolai „Nisbeth” Nisbeth jest jedynym zawodnikiem, z którym Chres, grając w SK-DIG-FE, spotkał się po raz pierwszy. </p>\n<p>\nDuńczyk posiada bardzo szeroki champion pool, ale z pewnością największą uwagę należy zwrócić na jego Azira, Viktora oraz Twisted Fate’a, grę którymi opanował do perfekcji. Swego czasu znany był nawet jako tzw. one-trick-pony Viktora, ale gra w Challenger Series 2015 sprawiła, że obecnie większość rywali najbardziej obawia się jego Azira. Sencux powszechnie uważany jest za wielki talent i wielu znawców sceny zastanawia się nad tym jak młody zawodnik poradzi sobie w walce przeciwko najlepszym mid-lanerom na Starym Kontynencie. Jest to bardzo interesujący problem, bo niestety nawet w ostatnim, udanym dla ex-Dignitas EU splicie dało się zauważyć, że Sencuxowi obok znakomitych gier zdarzają się spotkania bardzo przeciętne i takie wahania formy mają ogromny wpływ na postawę całej drużyny, której duński mid-laner jest ważnym punktem.</p>\n<p>\n„Myślę, że Sencux jest bardzo utalentowany mechanicznie. Gra bardzo dobrze, ale ma tendencję do tiltowania dość szybko, jeśli coś nie idzie po jego myśli.” – powiedział o Sencuxie przed finałem letniego splitu EU CS 2015 jego przeciwnik, Julian \"Xioh\" Dumler (mid-laner drużyny mousesports).</p>\n<p>\nCiekawy jest fakt, że nick gracza początkowo miał brzmieć „Sencu”, ale ten pseudonim był już zajęty w momencie, w którym Duńczyk zakładał swoje konto. Wobec tego najprostszym rozwiązaniem było dodanie „x” do ksywki i właśnie tak powstał obecny nick Sencuxa.\n</p>","es_AR":"<p>Chres \"Sencux\" Laursen es uno de los jugadores más jóvenes de la LCS EU. Después de jugar en varios equipos retadores, Sencux logró llegar a Splyce (anteriormente llamado Team Dignitas EU) y se ganó un lugar en la LCS EU. Su papel en el carril central se basa mucho en realizar ataques rápidos contra los enemigos para controlar los combates en equipo y lograr los objetivos de mapa.</p>\n\n<p>Después de demostrar momentos de gran inspiración en el torneo de apertura de la LCS EU 2016 (como un asesinato cuádruple con LeBlanc), tanto espectadores como analistas se preguntaron si tendría lo que hace falta para convertirse en la próxima estrella europea del carril central. Sencux cerró la boca de todos los que dudaron de él cuando, junto a Splyce, logró el segundo lugar en el torneo de clausura de la LCS EU 2016, seguido de una victoria en el Guantelete europeo, que le garantizó un lugar en el Mundial. Aunque Sencux es capaz de lanzar hechizos con los mejores centrales de Europa, la historia es completamente diferente a nivel internacional. La prueba más difícil de Sencux está por venir, y necesitará de gran determinación al llegar a la Grieta para estar a la altura de lo mejor de lo mejor que League of Legends tiene para ofrecer.</p>"},"foreignIds":{"drupalId":"1425","TRLH3":"200000105","TRLH4":"200000208"},"socialNetworks":{"twitch":"http://www.twitch.tv/sencux","facebook":"facebook.com/Sencux","twitter":"twitter.com/\tSPY_Sencux"},"champions":[],"liveGameTeam":97},{"id":387,"slug":"wunderwear","name":"Wunder","firstName":"Martin","lastName":"Hansen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wunderwear-fgro7nyg.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-01-23T01:17:13.000Z","updatedAt":"2017-06-09T10:41:34.000Z","bios":{"en_US":"<p>Martin “Wunder” Hansen  is a consistent top laner -- consistently aggressive. Even when playing tanks like Nautilus and Maokai, Wunder is more than happy to overextend for a kill. That aggressive playstyle got in him trouble in his rookie split, but he adjusted and became one of the best top laners in the EU LCS.</p>\n\n<p>Wunder struggled against the best top laners in the world at the 2016 World Championship. Back on Splyce in 2017, he’ll have the chance to put what he learned into practice during the regular season. It’s not the first time people have doubted Wunder or Splyce, and Wunder would love nothing more than to silence the haters.</p>","de_DE":"<p>Martin „Wunder“ Hansen ist ein verlässlicher Top-Laner – verlässlich aggressiv. Selbst mit Tanks wie Nautilus und Maokai geht Wunder für eine Tötung gerne mal etwas mehr Risiko ein. Dieser aggressive Spielstil bereitete ihm in seinem ersten Split große Probleme, doch er passte sich an und wurde einer der besten Top-Laner in der EU LCS.\n\nBei der Weltmeisterschaft 2016 hatte Wunder Probleme, mit den besten Top-Lanern der Welt mitzuhalten. 2017 hat er mit Splyce die Gelegenheit, sein neu erlangtes Wissen während der regulären Saison in die Praxis umzusetzen. Es ist nicht das erste Mal, dass die Leute an Wunder oder Splyce gezweifelt haben, und Wunder würde nichts lieber tun, als den Kritikern den Wind aus den Segeln zu nehmen.</p>","fr_FR":"<p>Martin « Wunderwear » Hansen a tout juste 17 ans et s'apprête à découvrir les LCS EU en tant que toplaner de Splyce. Il peut en être d'autant plus fier que, comme la majeure partie de son équipe, il y est parvenu à la seule force de son talent, par le biais de la qualification en Challenger Series, puis en LCS.</p>\n\n<p>Après une première expérience en Challenger Series à l'été 2014 au sein de l'équipe danoise 4everzenzyg, déjà en compagnie de Chres « Sencux » Laursen et Kasper « Kobbe » Kobberup, qui s'est soldée par une défaite en demi-finales des Challenger Series, Wunderwear s'est lancé début 2015 dans la conquête d'une place en LCS. Cela est passé par une qualification en Challenger Series avec sa nouvelle équipe, SK Prime, au détriment de l'équipe française Thunderbot Sparta. La qualification en poche l'équipe, rachetée et renommée Dignitas EU entre temps, a terminé à la 4ème place du segment de printemps et... n'a pas pris part aux play-off ! En effet ni Sencux ni Wunderwear n'avaient atteint leurs 17 ans à ce moment. Sure de la force de ses jeunes joueurs, l'équipe a alors préféré faire l'impasse sur les play-off et sur une possible participation au tournoi de promotion et attendre le segment d'été tranquillement. </p>\n\n<p>Wunderwear a bien rendu la confiance qui lui a été ainsi accordée et a été une part importante de la réussite de son équipe lors du segment d'été, terminé avec 8 victoires et seulement 2 défaites. Terminé surtout avec une qualification en LCS après deux victoires étriquées en play-off contre Denial Esports et Mousesports. </p>\n\n<p>A présent le jeune toplaner danois s'apprête à vivre sa première saison au plus haut niveau européen et à réaliser que son parcours de l'an dernier n'a été, in fine, qu'une longue introduction. De ce qu'il a montré l'an dernier, il est encore un peu tendre pour faire face à quelqu'un comme Paul « SoaZ » Boyer mais a largement le potentiel pour combler ses lacunes d'ici à la fin du segment de printemps. A condition, bien sur, de ne pas se relâcher !</p>\n","es_ES":"<p>Martin ''Wunder'' Hansen es constante en la calle superior. Constantemente agresivo. Incluso cuando juega con tanques como Nautilus o Maokai, Wunder está encantado de arriesgarse por un asesinato. Sus jugadas le hicieron conseguir una A/M/A de 5,2 puntos en el split de verano de la Challenger Series europea. Aun así, su estilo de juego agresivo tuvo resultados variados en el primer split de la LCS EU. Con demasiada frecuencia, traspasó el límite entre una agresividad calculada y una jugada demasiado arriesgada.</p>\n\n<p>Aprendió la lección, y en el split de verano de la LCS EU 2016, Wunder y Splyce eran de lo mejor que Europa tenía que ofrecer. El crecimiento era innegable, y Wunder se convirtió en una amenaza que había que aniquilar para evitar que llevase a su equipo directo a la victoria. Puede que Wunder destaque en Europa, pero enfrentarse a jugadores de la calle superior colosales como Smeb, Duke o Looper será un reto a superar. Nadie creía antes en Wunder ni en Splyce, y nada le gustaría más que volver a silenciar a los escépticos.</p>","pl_PL":"<p>Duński, zaledwie 17-letni top-laner jest najmłodszym zawodnikiem w LCS. Dość powiedzieć, że wymagane do udziału w tych rozgrywkach siedemnaście wiosen skończył dopiero w listopadzie 2015 roku. Na profesjonalnej scenie po raz pierwszy usłyszano o nim w czerwcu 2014 roku, kiedy dołączył do 4everzenzyg wraz z… Chresem „Sencuxem” Larsenem i Kasperem „Kobbe’m” Kobberuppem, obecnymi kolegami z drużyny. Jednak dopiero przeniesienie się do SK Gaming Prime (później Team Dignitas EU), gdzie dalej występował razem z Sencuxem, sprawiło, że kariera młodego Duńczyka nabrała rozpędu. Pierwszych występów w Challenger Series, już pod banderą organizacji Dignitas, Wunderwear nie może zaliczyć do udanych. Wielu ekspertów uważało, że był w tym czasie jednym z najsłabszych ogniw zespołu i nie do końca radził sobie z presją, która towarzyszyła zmaganiom na tym poziomie. Niemniej w ciągu dwóch splitów zmagań w EU CS zrobił duży postęp i wielki talent, który od dawna jest mu przypisywany wreszcie zaczął się w pełni ujawniać. A występy przeciwko najlepszym europejskim graczom górnej alei to coś, co z pewnością pomaga jeszcze podnieść już i tak niemałe umiejętności.</p>\n<p>\nJednocześnie Wunderwear był w letnim splicie EU Challenger Series 2015 jednym z najlepszych, o ile nie najlepszym graczem górnej alei w tych rozgrywkach, co udowadniają statystyki – najwięcej asyst, prawie najwięcej zabójstw, najwyższe KDA i prawie najwyższy udział w zabójstwach wśród top-lanerów. Duński gracz górnej alei zyskał pewność w grze i regularność.</p>\n<p>\nCo ciekawe, Wunderwear ma tendencję do grania niekiedy dość nietypowymi postaciami. To właśnie duński top-laner był pierwszym zawodnikiem, który na profesjonalnej, czy też pół-profesjonalnej, scenie zdecydował się na wybór Gankplanka po reworku tego bohatera. Dał się też poznać jako doskonały gracz Tahm Kencha na górnej alei - po rzecznego potwora sięgał kilkukrotnie, nie bojąc się wybrać tego bohatera nawet w najważniejszych spotkaniach. Widzieliśmy w rękach Duńczyka także chociażby Nautilusa czy Karmę. Można więc wnioskować, że Wunderwear jest w stanie porwać za sobą tłumy europejskich kibiców, którzy przecież uwielbiają zawodników grających niestandardowymi postaciami, o czym przekonaliśmy się poprzez ogromny wzrost popularności zespołu Unicorns of Love po barażach o grę w LCS 2015 i IEM-ie w San Jose w tym samym roku.\n</p>","es_AR":"<p>Martin \"Wunderwear\" Hansen es sólido en el carril superior... sólido y agresivo. Incluso jugando con Nautilus y Maokai, a Wunderwear le encanta lograr una cantidad exagerada de asesinatos. Sus locuras le merecieron un KDA de 5.2 puntos en el torneo de clausura de la Challenger Series EU 2015. Aún así, su estilo de juego agresivo tuvo resultados muy variados en su primer torneo de la LCS EU. Casi siempre ha combinado una agresión calculada con un accionar totalmente temerario.</p>\n\n<p>Aprendió su lección, y en el torneo de clausura de la LCS EU 2016, Wunder y Splyce se convirtieron en lo mejor que Europa tenía para ofrecer. Su crecimiento era indiscutible, y Wunder pasó a ser una amenaza que sus rivales debían neutralizar si querían evitar que llevara a su equipo directo hacia la victoria. Puede que Wunder se destaque en Europa, pero jugar contra colosales carriles centrales superiores como Smeb, Duke y Looper será un reto totalmente diferente. Nadie creyó en Wunder y Splyce antes, y este jugador muere por silenciar una vez más la boca de aquellos que dudaron de él.</p>"},"foreignIds":{"drupalId":"2895","TRLH3":"200000103","TRLH4":"200000206"},"socialNetworks":{"twitter":"twitter.com/SPY_WUNDERLOLXD","twitch":"twitch.tv/Wunderwearisfame","facebook":"http://facebook.com/Wunderwearlol"},"champions":[],"liveGameTeam":97},{"id":484,"slug":"promisq","name":"sprattel","firstName":"Hampus","lastName":"Abrahamsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/promisq-2wryxfa8.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-05-15T18:29:25.000Z","updatedAt":"2017-06-09T11:01:09.000Z","bios":{"en_US":"<p>\nHampus “sprattel” Abrahamsson (formerly PromisQ) is a relatively new player in the EU esports scene. He joined Elements in 2015 as their starting support, taking the place of Nyph. However, Sprattel's launch into the spotlight of professional esports didn't come without its missteps. He struggled in the 2015 EU LCS Summer Split and was swapped with substitute support Nyph after the fourth week of competition.\n</p>\n<p>\nThe 2016 EU LCS Spring Split didn’t go much better as he struggled to find rhythm with his bot lane partner, MrRallez. In May, Elements’ seed was acquired by FC Schalke 04, and sprattel was kept on as the team’s starting support. Sprattel will try to right the ship on Ninjas in Pyjamas' new roster this summer.\n</p>","fr_FR":"<p>Hampus « PromisQ » Abrahamsson est relativement nouveau sur la scène e-sport européenne. Il a rejoint Elements en 2015 pour y assumer le rôle de support titulaire à la place de Nyph. Les premiers pas de PromisQ sur la scène professionnelle ne se sont cependant pas très bien passés. Il a rencontré des difficultés lors du segment d'été des LCS EU 2015 et a dû se faire remplacer par Nyph dès la quatrième semaine de la compétition.</p>\n<p>PromisQ a de nouveau retrouvé son poste de support titulaire pour le segment printanier des LCS EU 2016, mais il lui reste encore à prouver qu'il a le talent nécessaire pour être un vrai titulaire aux LCS.</p>","es_ES":"<p>Hampus 'PromisQ' Abrahamsson es un jugador relativamente conocido en la escena europea de League of Legends. Se unió a Elements en 2015 como su apoyo titular, tomando el relevo de Nyph en lo que era su debut como profesional. Pero la cosa no resultó como esperaba y fue sustituido después de cuatro semanas de competición por el mismo Nyph, debido a su pobre rendimiento.</p>\n<p>Sin embargo PromisQ ha vuelto para ser el apoyo titular de Elements en el Spring de Primavera de la LCS EU 2016, ya no es un novato, pero tiene que demostrar que tiene lo que hay que tener para ser un jugador a tener en cuenta en la máxima competición europea.</p>","de_DE":"<p>Zuvor war Hampus \"sprattel\" Abrahamsson unter den Namen promisQ bekannt. Er entdeckte League of Legends erst in der dritten Saison für sich und erfuhr von dort an rasante Verbesserungen. Jeher als Support-Spieler kletterte er in die Top 100 und wurde nach einem kurzen Aufenthalt in einem Amateurteam von Elements unter Vertrag genommen. </p>\n<h2><p>Eine schwere Aufgabe</p></h2>\n<p>Als sprattel im Sommer 2015 in das Kader von Elements aufgenommen wurde, war die Überraschung groß. Genauso groß waren damals die Fußstapfen, in die der LCS-Neuling stapfen musste. Sowohl Patrick \"Nyph\" Funke, als auch Mitch \"Krepo\" Voorspoels sind nicht nur in der Community beliebt, sondern haben vielerorts ihr Können unter Beweis gestellt. Wo Krepo resignierte, sollte das neue Gesicht einen Aufschwung bringen, der kaum noch zu schaffen war. Nach gerade einmal acht Spielen war das Erlebnis LCS schon wieder beendet. In den wenigen Spielen war es vor allem Alistar, mit dem er spielerisch überzeugte und dem Team zu seinen zwei einzigen Siegen während seines Aufenthalts verhalf. </p>\n<p>Die negative Statistik soll aber in keinem Fall damit gleichzusetzen sein, dass der Schwede es nicht verdient hätte, in der LCS zu spielen. Die Organisation glaubt fest an den noch unerfahrenen Spieler. Warum denn auch nicht, viele Teams haben in der Vergangenheit bereits unter Beweis gestellt, was aus anfangs so unbekannten Namen werden kann. Mit Nyph, einem der erfahrensten Supportern Europas, als Coach an seiner Seite kann sich der noch ungeschliffene Diamant nun mit neuem Kader unter Beweis stellen. Dieses Mal nicht inmitten eines Splits, sondern vorbereitet und mit hoch motivierten Kollegen.</p>\n","pl_PL":"<p>Hampus jest wielkim odkryciem Elements. Przed dołączeniem do tej organizacji był członkiem tylko jednej drużyny, inFerno eSports, od marca do maja 2015 roku. Wtedy zmienił barwy na tęczowe i został głównym supportem „żywiołów”. O dołączenie do tego zespołu został poproszony przez głównego trenera - Patricka \"Nyph\" Funke’a. W wywiadzie dla Aftonbladet Esport przypomniał sobie, że kiedy dostał od niego zaproszenie do znajomych w grze, aż poczuł motyle w brzuchu. Powiedział, że uznał to za swoją życiową szansę i zgodził się na tą propozycję. </p>\n<p>Niestety projekt okazał się zdecydowanie mniejszym sukcesem niż się spodziewano. W efekcie czego największe zespołowe osiągnięcia \"Sprattel’a\" nie robią wrażenia. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 uplasował się dopiero na 7 miejscu z wynikiem 7:11. Biorąc pod uwagę ekskluzywność tych rozgrywek, trzeba to uznać za niemały wyczyn. Jednak bardziej imponujący jest efekt jego gry w solo que. W League of Legends gra od 2013 roku, ciągle supportem. Zajmując tą rolę w 3 sezonie udało mu się zdobyć diamentową rangę, a w kolejnych był już w Kręgu Pretendenta, gdzie zdobył aż 800 punktów LP.</p>\n<p>Z całej drużyny, po niezbyt udanym sezonie piątym, pozostał tylko \"Sprattel\". Podczas wywiadów cechowała go rozmowność, pewnie dlatego, że chciał przekazać swoim fanom jak najwięcej o sobie. Tuż przed pokazaniem się w rozgrywkach EU LCS wyraził swoją radość, z tego że będzie mógł się zmierzyć z najlepszymi graczami w Europie. Wielokrotnie wspominał, że konkurowanie z innymi jest dla niego najważniejsze w League of Legends. To właśnie chęć starcia się ze sławami doprowadziła Hampusa tak wysoko. O dziwo jako support jest dużo bardziej skoncentrowany na wspieraniu swojego AD Carry’ego - dlatego chętnie gra Janną, Nami i Morganą.</p>\n"},"foreignIds":{"drupalId":"4329","TRLH3":"200000259","TRLH4":"200000311","TRLH2":"1001250005","FRA1TMNT2":"25420","ESPORTSTMNT02":"200001029"},"socialNetworks":{"twitter":"https://twitter.com/SPRATTEL_lol"},"champions":[],"liveGameTeam":335},{"id":588,"slug":"kobbe","name":"Kobbe","firstName":"Kasper","lastName":"Kobberup","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kobbe-adbtha0l.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-09T10:31:56.000Z","bios":{"en_US":"<p>Kasper “Kobbe” Kobberup didn’t always want to be a professional gamer. He was dedicated to football before an injury sent him to the sideline and he had to rethink his options. Luckily for Splyce, Kobbe took up League of Legends. Before long, he became one of the best up-and-coming ADCs in Europe.</p>\n\n<p>Like the rest of Splyce, Kobbe was disappointed by his performance at the 2016 World Championship. But the international experience should make Kobbe and Splyce even better if they can learn from it. The next time elite opponents stare him down, Kobbe will be ready to blow right past them.</p>","de_DE":"<p>Kasper „Kobbe“ Kobberup wollte nicht immer ein professioneller Spieler werden. Er war ein leidenschaftlicher Fußballspieler, bevor ihn eine Verletzung auf die Ersatzbank zwang und er seine Optionen überdenken musste. Zum Glück für Splyce begann Koppe, League of Legends zu spielen. Es dauerte nicht lange, bis er zu einem der besten Nachwuchs-ADCs Europas wurde.\n\nWie der Rest von Splyce war auch Kobbe mit seiner Vorstellung bei der Weltmeisterschaft 2016 nicht zufrieden. Aber wenn Kobbe und Splyce aus der internationalen Erfahrung lernen konnten, sollten sie jetzt sogar noch besser sein. Wenn er das nächste Mal von Elite-Gegnern finster angestarrt wird, kann Kobbe einfach vorbeistürmen.</p>","fr_FR":"<p>Kasper « Kobbe » Kobberup sera-t-il le nouveau Jesper « Niels » Svenningsen ? C’est probablement la question qui sera posée dorénavant à chaque nouveau carry ad qui arrive en LCS EU. Sans lui imposer une trop forte pression sur les épaules, on peut déjà estimer que Kobbe a les moyens de se faire un nom pour lui-même. Le joueur danois, passé par Gamers 2 mais aussi brièvement par la structure française Millenium en 2015 a véritablement explosé sur la scène challenger au printemps de l’année écoulée quand il a rejoint son équipe actuelle. Ce qui était à l’époque Dignitas EU a eu le nez creux en recrutant deux semaines après le début des Challenger Series son nouveau carry AD. Celui-ci, alors en duo avec Erih « Voidle » Sommermann sur la voie du bas, n’a pourtant pas révélé tout de suite l’étendue de son talent. Il a fallu pour cela attendre le segment d’été des Challenger Series et l’arrivée à ses côtés d’un nouveau support, Nicolai « Nisbeth » Nisbeth. Les deux danois ont trouvé une synergie très efficace, qui leur a permis de surclasser la concurrence et d’être de l’avis général le meilleur binôme carry AD/Support de la scène challenger.   Une synergie qui va néanmoins être mise à rude épreuve face à celle de duos LCS plus expérimentés. Malgré tout, s’il est peu probable de retrouver dès cette année Splyce et Kobbe en demi –finale des championnats du monde, le joueur a largement les moyens d’imposer son style de jeu et son nom en bonne place aux côtés de ses glorieux ainés. </p>","es_ES":"<p>Antes de jugar a League of Legends, Kasper ''Kobbe'' Kobberup se dedicaba al fútbol. Cuando una lesión lo obligó a retirarse, reconsideró sus opciones, y por suerte para nosotros, el fin de un sueño es el momento perfecto para el inicio de otro. Kobbe dedicó su tiempo en el banquillo de fútbol a convertirse en jugador profesional de videojuegos.</p>\n\n<p>Tras una actuación dominante en la Challenger Series europea de 2015, Kobbe llegó a la LCS EU. Aunque estuvieron a punto de ser eliminados, Kobbe y Splyce sorprendieron a todo el mundo y obtuvieron un segundo puesto en el split de verano de la LCS EU 2016. Además de eso, ayudó a asegurarle un puesto a Splyce en el Mundial en su segundo split en acción en la LCS EU. Señalado como uno de los AD carries más prometedores de Europa, Kobbe tiene ahora la oportunidad de medir su entereza con la élite internacional. Es una lucha a vida o muerte para Kobbe, y si tomamos el pasado como referencia, llegado el momento de la partida, elegirá vivir.</p>","pl_PL":"<p>Gra urodzonego w 1996 roku Duńczyka nie jest może tak widowiskowa jak chociażby jego kolegi z drużyny Chresa „Sencuxa” Larsena, ale Kobbe jest niesamowicie regularnym graczem, a także bardzo istotnym elementem zespołu. Jego opanowanie i zdolność do utrzymania przez długi czas wysokiego poziomu doskonale równoważy wahania formy duńskiego i mid-lanera i sprawia, że ekipa Splyce ma na kim oprzeć swoją grę, podczas gdy Sencuxowi przydarzy się gorsza gra. Kobbe to na pierwszy rzut oka bardzo niepozorny strzelec, ale w letnim splicie Challenger Series 2015 nie było żadnego gracza na jego pozycji, który mógłby równać się z Duńczykiem. Najwięcej zabójstw i asyst, najmniej śmierci i niesamowite KDA na poziomie 10,5 sprawiają, że Kobbe wydaje się być najbardziej niedocenianym zawodnikiem w składzie beniaminka EU LCS. </p>\n<p>\nJednocześnie warto zauważyć, że Kobbe zwrócił uwagę czołowych drużyn w Europie już nieco wcześniej, gdy udało mu się dostać do pierwszej dziesiątki SoloQ zachodnio-europejskiego serwera. Miało to miejsce w trakcie letniego splitu 2015 i wtedy też pojawiały się pogłoski o tym, że miałby dołączyć do Teamu ROCCAT, który szukał strzelca w miejsce Pawła „Woolite’a” Pruskiego. Ostatecznie jednak Kobbe pozostał w Dignitas EU, a ROC sięgnął po Rasmusa „MrRalleza” Skinneholma. </p>\n<p>\nAle gdy my sięgniemy jeszcze dalej w przeszłość, zobaczymy, że Kobbe już od dłuższego czasu kręcił się najpierw w okolicach Challenger Series z Denial eSports i 4everzenzyg (od maja do listopada 2014), a później poczynał sobie coraz śmielej i występował w kilku ciekawych zespołach o LCS-owych aspiracjach. Wymienić tu można chociażby Gamers2, gdzie Kobbe przez krótki czas grał u boku m.in. obecnego wspierającego Teamu SoloMid – Raymonda „KaSinga” Tsanga czy późniejszego dżunglera Dignitas EU – Dennisa „Obviousa” Sørensena. Kolejnym przystankiem na drodze duńskiego strzelca było Millenium, ale także tutaj nie zabawił zbyt długo i wkrótce dołączył do Teamu Dignitas EU, z którym to po dwóch splitach zmagań w Challenger Series, w końcu udało mu się dostać do LCS-u na wiosenną edycję 2016. Konsekwencja, której nie brakuje Kobbe’mu także na Polach Sprawiedliwości w końcu zaowocowała.</p>\n<p>\n„Jest naprawdę dobrym strzelcem z solidną fazą linii i umiejętnością gry w zespole. Doskonale wie jak pozycjonować się w walkach drużynowych” – powiedział o swoim byłym koledze z drużyny francuski top-laner Julian „GoB” Treguer dla portalu Millenium.org.</p>\n<p>\nCiekawostką jest fakt, że Kobbe na wysokim poziomie gra nie tylko w League of Legends. Duński ADC, którego graniem w gry zaraził brat, był w przeszłości miłośnikiem Warcrafta 3, World of Warcraft oraz Diablo 2, a do tej pory zdarza mu się zagrać w CS:GO, gdzie udało mu się zdobyć najwyższą możliwą rangę – Global Elite.\n</p>","es_AR":"<p>Antes de jugar League of Legends, Kasper \"Kobbe\" Kobberup se dedicaba al fútbol. Luego de una lesión que lo dejó fuera del campo de juego, tuvo que reconsiderar sus opciones para el futuro. Por suerte para nosotros, el final de un sueño puede ser el comienzo de otro. Kobbe aprovechó el tiempo que pasó en el banco de suplentes para convertirse en video jugador profesional.</p>\n\n<p>Luego de una actuación dominante en la Challenger Series EU 2015, Kobbe pasó a formar parte de la LCS EU. Después de casi descender, Kobbe y Splyce sorprendieron a todos con un segundo lugar en el torneo de clausura de la LCS EU 2016. Además de esto, ayudó a Splyce a guardarse un lugar en el Mundial en su segundo torneo dentro de la escena de la LCS EU. Aclamado como uno de los mejores y prometedores ADC de Europa, Kobbe tiene la oportunidad de probar su valía contra enemigos internacionales de élite. Para Kobbe, las opciones son matar o morir, y su historia indica que escogerá la primera llegado el momento de jugar.</p>"},"foreignIds":{"drupalId":"2699","TRLH3":"200000106","TRLH4":"200000209"},"socialNetworks":{"twitch":"twitch.tv/kobbelol","facebook":"facebook.com/Kobbelol","twitter":"twitter.com/SPY_Kobbe"},"champions":[],"liveGameTeam":97},{"id":663,"slug":"gripex","name":"Gripex","firstName":"Jesper","lastName":"Terkildsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/gripex-6b756abo.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-01-18T21:24:08.000Z","bios":{"en_US":"","es_AR":"<p>Jesper \"Gripex\" Terkildsen es el junglero suplente de Splyce.</p>"},"foreignIds":{"drupalId":"4545","TRLH4":"200000211","TRLH3":"200000108"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":713,"slug":"heaq","name":"HeaQ","firstName":"Martin","lastName":"Kordmaa","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/heaq-5xfyf5io.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T13:56:18.000Z","bios":{"en_US":"<p>Martin \"HeaQ\" Kordmaa  bounced around Challenger-level teams for most of his career before landing the starting AD Carry position with Giants Gaming. The team had recruited their presumed starter, Upset, but he left the team shortly after. Giants’ search for a new carry intensified and they eventually decided that HeaQ was their number one option. After Giants was relegated, HeaQ now finds himself on the new roster for Ninjas in Pyjamas. He is beyond excited to prove that he has what it takes hang tough with the best in the business.</p>","de_DE":"<p>Martin „HeaQ“ Kormaa hat einen Großteil seiner Karriere damit verbracht, zwischen Mannschaften innerhalb der Challenger Series hin- und herzuwechseln, bis er schlussendlich als AD-Carry bei Giants Gaming landete. Das Team hatte ursprünglich Upset für diese Position rekrutiert, der das Team aber nach kurzer Zeit bereits verlassen hat. Sein Spielname schien damals Programm gewesen zu sein. Die Suche nach einem neuen Carry wurde immer intensiver und schließlich haben sie sich für HeaQ entschieden. Der Position des AD-Carrys auf LCS-Niveau gerecht zu werden, ist nie einfach, aber HeaQ möchte unbedingt beweisen, dass er das Zeug dazu hat, mit den Besten der Besten mitzuhalten.</p>","es_ES":"Martin \"HeaQ\" Kordmaa pululó por equipos de nivel Aspirante durante la mayor parte de su carrera hasta llegar a la posición de ADC en Giants Gaming. El equipo había fichado al que parecía que iba a ser su titular, Upset, pero este abandonó el equipo poco después. La búsqueda de un nuevo carry se intensificó y, al final, decidieron que HeaQ era su mejor opción. Tras el descenso de Giants, HeaQ ahora forma parte de la nueva alineación de Ninjas In Pyjamas. El estonio está más que ilusionado por demostrar que tiene lo que hace falta para enfrentarse a los mejores de la escena.","fr_FR":"Après être passé d'une équipe de niveau Challenger à une autre presque toute sa carrière, Martin « HeaQ » Kordmaa a fini par devenir carry AD titulaire chez Giants Gaming. L'équipe avait recruté son titulaire présumé, Upset, mais il les a quittés peu après. Les Giants ont intensifié leur recherche d'un nouveau carry et ils ont fini par décider que HeaQ était leur meilleure option. Suite à la relégation des Giants, HeaQ se retrouve à présent membre de la nouvelle formation des Ninjas In Pyjamas. Et il est surexcité à l'idée de prouver qu'il est à la hauteur de l'élite de la profession.","pl_PL":"Martin „HeaQ” Kordmaa przez większość swojej kariery przeskakiwał między drużynami na poziomie Pretendenta, po czym objął pozycję głównego prowadzącego w Giants Gaming. Drużyna zwerbowała do pierwszego składu Upseta, ale ten wkrótce ją opuścił. Giants zintensyfikowali swoje poszukiwania nowego prowadzącego i w końcu stwierdzili, że najlepszą opcją jest HeaQ. Gdy Giants zostali relegowani, HeaQ znalazł dla siebie miejsce w nowym składzie Ninjas In Pyjamas. Nie posiada się z radości, mogąc udowodnić, że stać go na dotrzymywanie kroku najlepszym w tej dyscyplinie."},"foreignIds":{"drupalId":"4472","TRLH3":"200000098","TRLH4":"200000201"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":750,"slug":"nagne","name":"Nagne","firstName":"Sang-moon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nagne-bnle5yoc.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T10:59:07.000Z","bios":{"en_US":"<p>Sang-moon \"Nagne\" Kim made his mark when he fought SK telecom's superstar mid laner Sang-hyeok \"Faker\" Lee to a standstill during an intense Best of 5 series at the Season 3 World Championship. Since then, Nagne has oscillated between being a force to be reckoned with and being a non-factor. Ninjas in Pyjamas is hoping he can return to form on their new roster. Because when he is on, Nagne is <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">a terror in the mid lane</a>.</p>","fr_FR":"<p>Sang-moon « Nagne » Kim a laissé sa marque en combattant le célèbre mid laner de SK Telecom, Sang-hyeok « Faker » Lee et en le paralysant au cours d'une intense partie en trois manches gagnantes lors du Mondial de la Saison 3. Depuis, Nagne oscille entre le redoutable et l'insipide. Mais récemment, Nagne s'est montré à son meilleur niveau de façon plus constante. Et quand il est en forme, Nagne est <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">une terreur sur la voie du milieu</a>.</p>","pl_PL":"<p>Sangmoon „Nagne” Kim dał się poznać, kiedy walczył z gwiazdą SK Telecom, środkowym Sang-hyeokiem „Fakerem” Lee w trakcie meczu do trzech zwycięstw w Sezonie 3 Mistrzostw Świata. Od tego czasu Nagne potrafił być zarówno kluczowym zawodnikiem, jak i tym prawie nieliczącym się w meczach. Ostatnio jednak dawał z siebie wszystko. A kiedy tak jest, <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">staje się prawdziwym postrachem środkowej alei</a>.</p>","de_DE":"<p>Jedes Team braucht seine Spielmacher und seine konsistenten Spieler. Ein System aus ausschließlich einem von beiden funktioniert nicht. Sangmoon \"Nagne\" Kim ist letzteres davon, er macht alle möglichen Metawandel zu einem gewissen Grad mit und ist einer der Stützen bei KT Rolster. Selten sieht man ihn seine Lane komplett verlieren, genauso hart gewinnen tut er sie allerdings genauso oft. Durch und durch ist der Mid-Lane-Veteran ein verlässlicher Spieler.</p>","es_ES":"<p>Sang-moon “Nagne” Kim dejó huella en la intensa batalla que libró contra SK Telecom y su estrella Faker en las semifinales del Campeonato Mundial de la Temporada 3. Aunque desde entonces, Nagne no ha conseguido encontrar la regularidad, depende del día puede ser o bien uno de los mejores mids de Corea del Sur o bien puede pasar desapercibido en la partida. Últimamente, no obstante, Nagne ha estado jugando a su mejor nivel al 100% del tiempo. Y cuando está a su mejor nivel, es un<a href=\" https://www.youtube.com/watch?v=Zrgae333efs&feature=youtu.be&t=3h34m10s\">  terror en la calle central.</a></p>","pt_BR":"<p>Sang-moon \"Nagne\" Kim deixou sua marca quando enfrentou a grande estrela da SK Telecom, Sang-hyeok \"Faker\" Lee, em uma melhor de cinco durante o Mundial da Terceira Temporada. Desde então, Nagne oscilou entre um dos melhores meios da Coreia e... nada. No entanto, recentemente Nagne tem (re)demonstrado seu potencial. E quando ele está assim, ele é um <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">terror na rota do meio</a>.</p>"},"foreignIds":{"drupalId":"686","TRLH3":"200000306","TRLH4":"200000406"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":954,"slug":"mikyx","name":"Mikyx","firstName":"Mihael","lastName":"Mehle","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mikyx-dbj14d9y.png","hometown":"","region":"EU LCS","birthdate":"","createdAt":"2016-01-05T19:47:13.000Z","updatedAt":"2017-06-09T11:10:17.000Z","bios":{"en_US":"<p>Mihael \"Mikyx\" Mehle is a support prodigy for Splyce. He's the only member of Splyce who wasn't on the team when they clawed their way out of the 2016 EU LCS Summer Promotion Tournament. As a rookie in the Summer Split, he brought a new level of playmaking to Splyce from the support position. Despite his inexperience, he helped Splyce go from rags to riches and earn a spot at the 2016 World Championship.</p>\n\n<p>At Worlds, Mikyx finally showed weakness. As he returns with the rest of Splyce for 2017, he'll get his first full season in the EU LCS to improve his talents. With his career still in its infancy, Mikyx has plans to attend Worlds for many years to come.</p>","de_DE":"<p>Mihael „Mikyx“ Mehle ist das Supporter-Wunderkind von Splyce. Er ist das einzige Mitglied, das beim erbitterten Kampf der Mannschaft im Sommer-Aufstiegsturnier der EU LCS 2016 nicht dabei war. Er ging als Nachwuchsspieler in den Sommer-Split und schaffte es dennoch, die Rolle des Spielmachers neu zu definieren. Trotz seiner geringen Erfahrung half er Splyce dabei, einen fulminanten Aufstieg hinzulegen und sich einen Platz bei der Weltmeisterschaft 2016 zu sichern.\n\nBei der Weltmeisterschaft zeigte Mikyx dann erstmals Schwäche. Wenn er 2017 mit dem Rest von Splyce zurückkehrt, kann er sein Können in seiner ersten kompletten Saison in der EU LCS verbessern. Da seine Karriere immer noch in den Kinderschuhen steckt, hat Mikyx vor, noch an vielen Weltmeisterschaften teilzunehmen.</p>","fr_FR":"<p>Mihael « Mikyx » Mehle a rejoint les rangs de Splyce en tant que support titulaire au début du segment d’été 2016. D’origine slovène il a été le support remplaçant de Fnatic durant le segment de printemps. Néanmoins, il n’a jamais été titularisé et ce sera donc avec Splyce qu’il fera ses premiers pas sur la scène compétitive des LCS durant ce segment d’été. </p>","pl_PL":"<p>Mihael „Mikyx” Mehle to zawodnik ze Słowenii, który swoje pierwsze kroki w profesjonalnym graniu stawiał w rodzimym zespole Bottled Water. Interesującym momentem w jego karierze okazało się dołączenie do legendarnego Fnatic w roli rezerwowego wspierającego. Wtedy 18-latek dał się poznać jako doskonały zawodnik soloQ, a jego talent chwalili tak znakomici zawodnicy jak Lee „Spirit” Da-yoon czy Jesper „Zven” Svenningsen, jednocześnie zwracając jednak uwagę na wąski champion pool młodego gracza. We Fnatic jednak Mikyx nie miał szans na grę, a dodatkowo jego sytuację skomplikował powrót do zespołu Bory „YellOwStaR’a” Kima.</p>\n<p>W tym czasie Mikyx otrzymał jednak ofertę ze Splyce, które dawało mu szansę sprawdzenia się na najwyższym europejskim poziomie rozgrywkowym – w EU LCS, z której to propozycji Słoweniec oczywiście skorzystał. W nowym zespole zastąpił Nicolaia „Nisbetha” Nisbetha i sprawił, że dotychczas jednonarodowościowy skład przestał być w pełni duński. Zarówno zawodnicy, jak i kibicie wierzą jednak, że Słoweniec będzie wzmocnieniem dla drużyny i że z w nim w składzie Splyce powalczy o coś więcej niż utrzymanie. Co ciekawe, Mikyx już wcześniej często grał w dynamicznej kolejce razem z Chresem „Sencuxem” Laursenem i Kasperem „Kobbe’em” Kobberupem, dzięki czemu zawodnicy ci zdążyli już zbudować podstawy synergii. Dotychczas Słoweniec dał się poznać przede wszystkim jako znakomity gracz Thresha i Morgany.</p>\n<p>„Mikyx ma wszelkie cechy, które w mojej opinii tworzą najlepszych zawodników w LCS. Posiada pasję i jest zmotywowany, by ciągle stawać się lepszym. Okazuje też wielki szacunek dla gry i samych graczy. Żeby nie wspomnieć o ogromnym talencie, który posiada.” – powiedział o swoim nowym zawodniku trener Splyce Jakob  „YamatoCannon” Mebdi.</p>\n","es_AR":"<p>Mihael \"Mikyx\" Mehle es la nueva edición del plantel inicial de Splyce. Al llegar a lo más alto del juego en solitario en nivel Aspirante, fue descubierto por Fnatic y escogido como soporte suplente para el torneo de apertura de la LCS EU 2016.</p>\n\n<p>En abril, Mikyx dejó Fnatic para convertirse en el nuevo soporte inicial de Splyce luego de que Nicolai \"Nisbeth\" Nisbeth se hiciera a un lado, y hay que decir que su presencia se hizo notar. La suerte se puso aún más del lado de Splyce durante el torneo de clausura, en el que la dupla de carriles inferiores formada por Kobbe y Mikyx estuvo asombrosamente afilada. Mikyx demostró una gran habilidad para crear jugadas con campeones como el Bardo, y lanzó habilidades definitivas determinantes por toda la Grieta con gran facilidad. Es muy poco común ver a un jugador principiante tan talentoso como Mikyx en los Mundiales. Su actuación le ha dado una oportunidad de jugar con las leyendas que el siempre ha querido ser.</p>","es_ES":"<p>Mihael ''Mikyx'' Mehle es el miembro más nuevo de la alineación principal de Splyce. Destacaba en el juego en solitario en el nivel Aspirante, así que Fnatic lo tuvo en cuenta y lo fichó como apoyo suplente durante el split de primavera de la LCS EU.</p>\n\n<p>En abril, Mikyx dejó Fnatic y pasó a ser el apoyo titular de Splyce, en sustitución de Nicolai ''Nisbeth'' Nisbeth, y lo dio todo en sus jugadas. La suerte de Splyce mejoró en el split de verano, ya que el dúo de la calle inferior, Kobbe y Mikyx, estuvo increíblemente avispado. Mikyx demostró una gran habilidad para facilitar jugadas con campeones como Bardo, con quien es capaz de lanzar fácilmente su definitiva desde la otra punta de la Grieta y propiciar así un giro en la partida. Es raro ver talentos como Mikyx en el escenario del Mundial tan pronto en su trayectoria profesional, pero se ha ganado esta oportunidad de jugar con las leyendas en las que se quiere convertir.</p>"},"foreignIds":{"TRLH3":"200000107","TRLH4":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1115,"slug":"zhergoth","name":"Zhergoth","firstName":"Benjamin","lastName":"Sánchez","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/zhergoth-e48i3ns.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:40:03.000Z","updatedAt":"2017-05-31T21:39:43.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375397","TRLH2":"1001250089","FRA1TMNT2":"25362","TRLH3":"200000269","TRLH4":"200000321"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1684,"slug":"profit","name":"Profit","firstName":"Junhyung","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/profit-2siu86dd.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-12T18:21:45.000Z","updatedAt":"2017-07-06T13:44:20.000Z","bios":{"en_US":"<p>Junhyung \"Profit\" Kim joins the EU LCS after spending a year playing for the best team in the world: SK telecom T1. After splitting time with Huni in the top lane, Profit heads to Europe looking to use what he's learned to dominate the competition.</p>","de_DE":"Junhyung „Profit“ Kim nimmt an der EU LCS teil, nachdem er ein Jahr lang für die beste Mannschaft der Welt gespielt hat: SK Telecom T1. Nachdem er sich mit Huni die Position als Top-Laner geteilt, zieht es ihn jetzt nach Europa, wo er sich mit seinen Erfahrungen an die Spitze kämpfen will.","es_ES":"Junhyung \"Profit\" Kim se une a la LCS EU tras pasar un año jugando en el mejor equipo del mundo: SK telecom T1. Después de un tiempo compartiendo rol con Huni en la calle superior, Profit ha decidido trasladarse a Europa con intención de usar lo que ha aprendido para arrasar en la competición","fr_FR":"Junhyung « Profit » Kim a rejoint les LCS EU suite à une année passée avec la meilleure équipe du monde : SK Telecom T1. Après avoir partagé la voie du haut avec Huni, Profit arrive en Europe déterminé à utiliser ce qu'il a appris pour dominer la compétition","pl_PL":"Junhyung „Profit” Kim dołącza do EU LCS po roku gry dla najlepszej drużyny na świecie: SK Telecom T1. Po rozstaniu z Hunim na górnej alei Profit wybiera się do Europy, chcąc wykorzystać to, czego się nauczył, by zdominować konkurencję."},"foreignIds":{"ESPORTSTMNT06":"200000353","TRLH3":"200000304","TRLH4":"200000404"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1721,"slug":"whiteknight","name":"Whiteknight","firstName":"Matti","lastName":"Sormunen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whiteknight-584o692r.png","hometown":null,"region":"EU Challenger Series","birthdate":"1996-02-16","createdAt":"2017-01-19T13:21:22.000Z","updatedAt":"2017-06-18T19:15:07.000Z","bios":{},"foreignIds":{"esportstmnt05":"200000891","TRLH3":"200000285","TRLH4":"200000337","ESPORTSTMNT02":"200002380"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1771,"slug":"annes","name":"Annes","firstName":"Annes","lastName":"Ravkic","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/annes-47wl5dqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-02-10T15:25:24.000Z","updatedAt":"2017-05-31T21:46:49.000Z","bios":{},"foreignIds":{"TRLH3":"200000226","TRLH4":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":97},{"id":1913,"slug":"m1rage","name":"M1RAGE","firstName":"Noh Hoon","lastName":"Kwon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/m1rage-ij32gh00.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:48:55.000Z","updatedAt":"2017-05-31T21:33:31.000Z","bios":{},"foreignIds":{"TRLH3":"200000307","TRLH4":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":335}],"scheduleItems":[{"id":"AVxHGOutoUG4HPFjOKSo","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:e4ced9a9-a319-4b84-b639-354f3205bab9","scheduledTime":"2017-07-21T18:00:00.059+0000","tags":{"blockLabel":"7","blockPrefix":"week","subBlockLabel":"2","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:3d923d9a-105e-4f3d-97bb-dbc08daff394","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"e4ced9a9-a319-4b84-b639-354f3205bab9","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"3d923d9a-105e-4f3d-97bb-dbc08daff394","league":"3"}],"gameIdMappings":[{"id":"076c3f66-1ff5-43e0-83b7-a1fe3a824fc2","gameHash":"18fe86c591094b41"},{"id":"60531f87-b4b1-466e-92d7-22ec6daef461","gameHash":"85a8299ebbf34710"}],"videos":[{"id":8060,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:60531f87-b4b1-466e-92d7-22ec6daef461","source":"https://www.youtube.com/embed/0N17d_500F4?wmode=transparent&rel=0","createdAt":"2017-07-22T10:28:28.000Z","updatedAt":"2017-07-22T10:28:28.000Z","game":"60531f87-b4b1-466e-92d7-22ec6daef461"},{"id":8061,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:076c3f66-1ff5-43e0-83b7-a1fe3a824fc2","source":"https://www.youtube.com/embed/6Jw2u9FTZiQ?wmode=transparent&rel=0","createdAt":"2017-07-22T10:28:49.000Z","updatedAt":"2017-07-22T10:28:49.000Z","game":"076c3f66-1ff5-43e0-83b7-a1fe3a824fc2"}],"htmlBlocks":[],"match":{"id":"e4ced9a9-a319-4b84-b639-354f3205bab9","name":"NIP-vs-SPY","position":3,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],"games":{"076c3f66-1ff5-43e0-83b7-a1fe3a824fc2":{"id":"076c3f66-1ff5-43e0-83b7-a1fe3a824fc2","name":"G2","generatedName":"NIP|SPY|G2|e4ced9a9a3194b84b63","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}],"standings":{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500719157578,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500662113536,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002180063","gameRealm":"TRLH3","platformId":"TRLH3:1002180063","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5516dd5b-9690-4ddd-a054-bf5b4dff6e74":{"id":"5516dd5b-9690-4ddd-a054-bf5b4dff6e74","name":"G3","generatedName":"NIP|SPY|G3|e4ced9a9a3194b84b63","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"60531f87-b4b1-466e-92d7-22ec6daef461":{"id":"60531f87-b4b1-466e-92d7-22ec6daef461","name":"G1","generatedName":"NIP|SPY|G1|e4ced9a9a3194b84b63","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],"standings":{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500719136890,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500659578967,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002180058","gameRealm":"TRLH3","platformId":"TRLH3:1002180058","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500719157578,"source":"bestOf","history":[{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500719136890,"source":"bestOf","closed":true},{"result":[[{"roster":"b005f806-2fb5-4308-b20c-7c5ad07726c5"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1500662113536,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"f55a8ea5-4393-4796-9cda-7e1de955c547":0,"b005f806-2fb5-4308-b20c-7c5ad07726c5":1}}}