{"teams":[{"id":79,"slug":"invictus-gaming","name":"Invictus Gaming","guid":"be6dfd0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/invictus-gaming-cnnnfwdo.png","acronym":"IG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:30:22.000Z","bios":{"en_US":"","fr_FR":"Invictus Gaming piaffe devant la porte de la gloire depuis si longtemps que l'équipe paraît presque frappée d'une malédiction. Au cours des deux dernières années, ils sont arrivés quatre fois 3e aux finales régionales ou aux play-offs de printemps de la LPL. Cependant, avec l'aide de joueurs dynamiques comme KaKAO et RooKie, Invictus va peut-être enfin briser la malédiction et parvenir au sommet.","pl_PL":"Invictus Gaming przez tak długo znajdowało się na krawędzi osiągnięcia sukcesu, że można pomyśleć, że drużyna jest przeklęta. Zajęli 3. miejsce podczas wiosennych playoffów LPL / finałów regionalnych 4 razy w ciągu ostatnich dwóch lat. Jednakże dzięki dołączeniu tak utalentowanych graczy, jak KaKAO i Rookie być może Invictus wreszcie przełamie klątwę i wywalczy sobie drogę na szczyt tabeli.","de_DE":"Invictus Gaming schwebte lange Zeit an der Grenze zum Erfolg, sodass es schien, sie seien verflucht. In zwei Jahren brachten sie viermal den dritten Platz in den LPL Spring Playoffs/Regional Finals nach Hause. Aber vielleicht schafft es diesmal Invictus, mit den dynamischen Talenten wie KaKAO und RooKie, den Fluch zu durchbrechen und sich den ganz Großen anzuschließen.","es_ES":"Invictus Gaming se ha quedado tantas veces a la puertas de la gloria que casi parece que están gafados. Han quedado en tercera posición en los Playoffs de primavera de la LPL y en las finales regionales de China cuatro veces en los dos últimos años. Aunque con los fichajes de los coreanos KaKAO y RooKie, quizás Invictus va a romper la maldición definitivamente y a hacerse un hueco entre los mejores equipos del mundo.","pt_BR":"A Invictus Gaming se aproximou da consagração tantas vezes, que até parece um time amaldiçoado. Eles ficaram em terceiro lugar nas Regionais e Eliminatórias da LPL quatro vezes nos últimos dois anos. Talvez agora, com a chegada de pequenos monstros como KaKAO e RooKie, eles consigam quebrar a maldição e chegar entre os grandes do Mundial. \n"},"foreignIds":{"drupalId":"632"},"players":[122,519,522,1664,1871,1980,1981,1982],"starters":[122,519,522,1664,1871],"subs":[1980,1981,1982]},{"id":82,"slug":"team-we","name":"Team WE","guid":"be6e0936-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-we-ei826ceg.png","acronym":"WE","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-07-07T22:21:53.000Z","bios":{"en_US":"","pl_PL":"Team WE są znani w chińskim e-sporcie od pradziejów. Jako pionierska organizacja e-sportowa zasłynęli w świecie ze swoich drużyn Warcrafta i StarCrafta, zanim w 2011 roku przestawili się na League of Legends. Po latach przeplatających się serii sukcesów i porażek Team WE w 2017 roku naprawdę się odnaleźli. Łącząc stare talenty z nowicjuszami, Team WE zdominowali wiosenny split LPL 2017, osiągając wynik 12–4 w fazie grupowej. Nie spoczęli na laurach i wkrótce przebili się przez konkurencję w play-offach, przegrywając tylko jedną grę w drodze po tytuł wiosennego splitu. Ich zwycięstwo 3–0 z Royal Never Give Up w finale stanowiło ukoronowanie znakomitego sezonu drużyny. Teraz szykują się do Rio, gdzie zamierzają wielokrotnie wykradać Barona oraz eliminować najlepsze drużyny świata na Mid-Season Invitational 2017. \n\nTrener: Namhoon „HooN” Kim\n","es_ES":"Team WE es una vieja leyenda china de los esports. Como organización de esports pionera, ya era famosa mundialmente por sus equipos de Warcraft y Starcraft antes de que se uniera a League of Legends en 2011. Tras años alternando éxitos y fracasos, Team WE ha conseguido establecerse en 2017. Con una mezcla de viejos talentos y jugadores recién llegados, Team WE ha arrasado en el split de primavera de la LPL 2017, en la que batió un récord de 12 victorias frente a 4 derrotas en la fase de grupos. Pero la cosa no se quedó en eso. El equipo no tardaría en abrirse paso en los playoffs y en reclamar la corona del split de primavera con tan solo una derrota en su haber. Su resultado 3-0 en la final contra Royal Never Give Up es el colofón de una temporada estelar. Los jugadores de Team WE ahora se dirigen a Río y están preparados para robar el Barón y machacar a sus adversarios cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017. \n\nEntrenador: Namhoon ''HooN'' Kim\n","de_DE":"Team WE ist eine chinesische E-Sport-Legende, die so alt ist wie die Zeit selbst. Die E-Sport-Organisation gilt als Pionier auf diesem Gebiet und war für ihre Warcraft- und StarCraft-Mannschaften bekannt, bevor sie 2011 auf League of Legends umstieg. Nach Jahren voller Höhen und Tiefen scheint Team WE 2017 endlich einen guten Rhythmus gefunden zu haben. Dank einer Mischung aus alten Talenten und Neulingen konnte Team WE den Frühjahrs-Split der LPL dominieren und beendete die Gruppenphase mit 12 Siegen bei nur 4 Niederlagen. Doch das war ihnen noch nicht genug. Sie marschierten durch die Entscheidungsspiele und verloren auf dem Weg zum Titel nur ein einziges Spiel. Die Krönung ihrer sensationellen Saison war der 3–0 Sieg über Royal Never Give Up im Finale des Frühjahrs-Splits. Jetzt konzentrieren sie sich ganz auf Rio, wo sie den ein oder anderen Baron stehlen und ihre Gegner aufmischen wollen, wenn sie sich beim Mid-Season Invitational 2017 mit den besten Mannschaften der Welt messen. \n\nTrainer: Namhoon „HooN“ Kim\n","pt_BR":"<p>A história da Team WE nos e-Sports chineses é tão antiga quanto o tempo. Como uma organização pioneira na área de e-Sports, eles já haviam alcançado renome internacional com suas equipes de Warcraft e Starcraft quando fizeram o salto para League of Legends em 2011. Após passar anos intercalando sucessos e fracassos, a Team WE encontrou de vez o seu caminho em 2017. Misturando talentos experientes com novatos promissores, a Team WE dominou a Etapa de Primavera da LPL 2017 com um recorde de 12-4 na fase de grupos. Sem parar por aí, eles logo abriram caminho entre a competição das eliminatórias, perdendo apenas um jogo na sua jornada até a coroa da Etapa de Primavera. A surra de 3-0 que deram na Royal Never Give Up na final colocou um ponto de exclamação na sua já extraordinária temporada. Agora, seu foco está no Rio e eles pretendem roubar Barões e mostrar a que vieram em seus confrontos contra as melhores equipes do mundo no Mid-Season Invitational 2017. </p>\n\n<p>Técnico: Namhoon “HooN” Kim</p>","es_AR":"<p>El Team WE es un cuento de Esports tan viejo como el tiempo. Como una organización pionera de Esports, se volvieron conocidos internacionalmente por sus equipos de Warcraft y Starcraft antes de entrar a LoL en el 2011. Después de años de éxitos y fracasos, el Team WE encontró su ritmo en 2017. Al mezclar talento viejo con nuevo, el Team WE dominó el Torneo de Apertura LPL de 2017 y alcanzó un récord de 12-4 en la fase de grupos. No se detuvieron ahí. En cuanto llegaron a las eliminatorias solo perdieron una partida en su camino a la victoria del Torneo de Apertura. Su aplastante 3-0 en el Royal Never Give Up en las finales fue la cereza del pastel en su temporada. Ahora tienen los ojos puestos en Río y están listos para robar barones y aplastar a sus oponentes cuando se enfrenten a los mejores equipos del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"1849"},"players":[132,511,516,517,603,692,1038,1428,1991,1992],"starters":[132,516,517,692,1038],"subs":[511,603,1428,1991,1992]}],"players":[{"id":122,"slug":"duke","name":"Duke","firstName":"Hoseong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/duke-e8izehd9.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-06T23:30:15.000Z","bios":{"en_US":"","es_AR":"<p>Ho-seong \"Duke\" Lee ha sido parte de la escena coreana desde el 2013. Al comienzo, jugaba bajo el nombre de \"Leopard\", pero lo cambió a Duke luego de unirse a NaJin Black Sword. Después de la fusión con NaJin, Duke se convirtió en el carrilero superior inicial de NaJin e-mFire, grupo formado poco tiempo antes. Aunque los resultados del equipo fueron muy variados, Duke fue considerado uno de los mejores carrileros superiores de Corea. Luego de más resultados regulares, Duke dejó la organización NaJin a finales del 2015.</p>\n\n<p>Poco después de su partida de NaJin, SKTelecom sumó a Duke para que ocupe el lugar de uno de los mejores carrileros superiores en el 2015, MaRin, luego de que este se fuera a jugar a China. A pesar de que Duke y compañía tuvieron un mal arranque del 2016, encontraron el equilibrio y terminaron adjudicándose el trofeo del torneo de apertura de la LCK 2016. Incluso con la descalificación temprana de SKTelecom en las eliminatorias del torneo de clausura de la LCK 2016, sus esperanzas están puestas en lo más alto de todo: el Mundial. Con su reservada forma de ser, Duke jamás lo aceptaría, pero es uno de los carrileros superiores más emocionantes de Corea, ¡y no se llama Smeb! Valdrá mucho la pena seguirlo en el Mundial.</p>","fr_FR":"<p>Ho-seong « Duke » Lee est présent sur la scène coréenne depuis 2013. Il jouait alors sous le nom de « Leopard », mais il a changé son surnom pour devenir « Duke » après avoir rejoint NaJin Black Sword. Après la fusion de NaJin, Duke a pris la position de toplaner titulaire au sein de l'équipe nouvellement créée des NaJin e-mFire. Même si les résultats de cette nouvelle escouade ont été mitigés, Duke a été perçu comme l'un des meilleurs toplaners de Corée. Voyant que les résultats restaient peu convaincants, Duke a décidé de quitter l'organisation NaJin fin 2015.</p>\n\n<p>Peu après son départ de NaJin, SKTelecom s'est tournée vers Duke pour qu'il reprenne le flambeau de l'un des plus grands toplaners de 2015, MaRin, après son départ vers la Chine. Bien que Duke et ses nouveaux coéquipiers aient quelque peu lutté au début de l'année 2016, ils ont trouvé leurs marques au fil des semaines. C'est à l'approche de la fin du segment de printemps que Duke a finalement développé tout son talent : le timing parfait pour révéler tout son potentiel. Après avoir éliminé les ROX Tigers pour décrocher la couronne du tournoi Champions Spring 2016, Duke va enfin avoir la chance de remporter un deuxième trophée international depuis qu'il a rejoint SKTelecom. Avec sa nature réservée, Duke ne vous le dirait probablement jamais lui-même, mais il est l'un des toplaners les plus en vue de Corée. À votre place, on garderait un œil sur lui.</p>\n","de_DE":"<p>Ho-seong „Duke“ Lee ist bereits seit 2013 Teil der koreanischen Szene. Ursprünglich unter dem Namen „Leopard“ bekannt, wechselte er seinen Namen zu „Duke“, als er den NaJin Black Swords beitrat. Nachdem sich NaJin zusammenschloß, wurde Duke zu einem festen Mitglied als Top-Laner in der Startformation des neu geformten NaJin e-mFire-Teams. Obowohl die Ergebnisse des Teams eher gemischter Natur waren, wurde Duke stets als einer der besten Top-Laner Koreas bezeichnet und als sich die bescheidenden Resultate von NaJin fortsetzten, verließ er NaJin Ende 2015.</p>\n\n<p>Kurz nach seinem Abgang von NaJin wendete sich SKTelecom an Duke und bat ihn, in die Fußstapfen von MaRin, dem besten Top-Laner 2015, zu treten, der nach China gewechselt war. Obwohl Duke und seine Kameraden zu Beginn des Jahres Probleme hatten, fanden sie wieder in die Spur und gewannen den Frühjahrs-Split der LCK 2016. Trotz des frühen Ausscheidens von SKTelecom beim Sommer-Split der LCK 2016 sind die Erwartungen für die Weltmeisterschaft hoch. Duke ist zurückhaltend und würde so etwas nie selbst sagen, aber er ist neben Smeb einer der interessantesten Top-Laner in Korea. An deiner Stelle würde ich ihn bei der WM im Auge behalten.</p>","pl_PL":"<p>Ho-seong „Duke” Lee występuje na koreańskiej scenie od 2013 roku. Zaczynał grać pod ksywką „Leopard”, ale zmienił ją na „Duke” po dołączeniu do NaJin Black Sword. Po połączeniu NaJin, Duke został początkowym górnym w nowoutworzonym NaJin e-mFire. Mimo że wyniki drużyny były przeciętne, Duke był uznawany za jednego z najlepszych górnych w Korei, a po kolejnych podobnych rezultatach Duke opuścił organizację NaJin pod koniec 2015 roku.</p>\n\n<p>Wkrótce po tym SKTelecom odezwało się do Duke'a, aby zastąpił jednego z najlepszych górnych 2015 roku, MaRina, gdy ten odszedł, aby grać w Chinach. Mimo że Duke i reszta mieli problemy na początku 2016 roku, wraz z upływem czasu zaczęli radzić sobie coraz lepiej. Pod koniec wiosennego splitu Duke wreszcie się rozkręcił i to akurat w idealnym czasie. Po pokonaniu ROX Tigers podczas Champions Spring 2016, Duke ma teraz szansę na zdobycie drugiego międzynarodowego trofeum od kiedy dołączył do SKTelecom. Ze względu na swoją skromność, Duke nigdy by tego nie powiedział, ale jest jednym z najbardziej ekscytujących graczy z Korei. Na waszym miejscu obserwowalibyśmy go uważnie.</p>\n","es_ES":"<p>Ho-seong ''Duke'' Lee lleva siendo parte del panorama coreano desde 2013. Antes jugaba bajo el nombre de \"Leopard\", pero cuando llegó a NaJin Black Sword decidió cambiarse el nombre a Duke. Tras la fusión de equipos, Duke se convirtió en el top inicial de NaJin e-mFire. A pesar de que los resultados del equipo eran bastante mixtos, Duke fue considerado uno de los mejores top de Corea, y terminó dejando NaJin a finales de 2015.</p>\n\n<p>Tras dejar NaJin, SKTelecom le pidió a Duke que llenara el vacío que había dejado MaRin, uno de los mejores jugadores de la calle superior de 2015, que había abandonado el equipo para jugar en China. Aunque Duke y compañía lo pasaron mal a principios de 2016, recuperaron fuerzas y se llevaron el trofeo del split de primavera de la LCK 2016 a casa. Puede que SKTelecom tuviese que abandonar antes de lo previsto tras perder en los playoffs del split de verano de la LCK 2016, pero las esperanzas de ganar el Mundial siguen siendo altas. Al ser tan reservado, él nunca os lo diría, pero Duke es uno de los top más prometedores de Corea, aparte de Smeb. Os aconsejamos que sigáis su progreso en el Campeonato Mundial de cerca.</p>","pt_BR":"<p>Ho-seong “Duke” Lee tem participado do cenário coreano desde 2013. Jogando a princípio sob o nome de “Leopard”, ele mudou seu nome para “Duke” quando entrou para a NaJin Black Sword. Depois da união da NaJin, Duke se tornou o topo titular da recém-formada NaJin e-mFire. Apesar dos resultados da equipe terem sido inconsistentes, Duke era visto como um dos melhores topos da Coreia, mas depois de constantes resultados medianos, Duke decidiu sair da formação da NaJin no final de 2015.</p>\n\n<p>Logo depois de sua saída da NaJin, Duke foi chamado pela SK Telecom para substituir um dos melhores topos de 2015, MaRin, após sua saída para jogar na China. Apesar de Duke e seus companheiros terem sofrido um pouco no início de 2016, eles conseguiram encontrar sua sintonia e terminaram levando para casa o troféu da Etapa de Primavera da LCK 2016. Mesmo com a saída precoce da SKT nas eliminatórias da Etapa de Verão da LCK 2016, as esperanças ainda são altas para o Mundial. Tendo uma natureza reservada, Duke provavelmente nunca falaria isso, mas ele é um dos topos mais promissores da Coreia que não tem o nome de Smeb. Eu ficaria de olho nele no Mundial se fosse você.</p>"},"foreignIds":{"drupalId":"2811","TRKR1":"225039","TRLT3":"35084","TRLH1":"1001380052","TRLH2":"1001280022"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":132,"slug":"zero","name":"Zero","firstName":"Kyungsub","lastName":"Yun","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/zero-bpm8z97p.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:59.000Z","updatedAt":"2017-07-07T22:22:17.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2165","TRLH1":"200000404","TRLH3":"1000205039","TRLT3":"200000232"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":511,"slug":"conan","name":"conan","firstName":"Yi","lastName":"Ke","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/conan-hcob1n8b.png","hometown":"Tianmen, China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-05-09T23:21:19.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"2079","TRLH1":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":516,"slug":"xiye","name":"xiye","firstName":"Hanwei","lastName":"Su","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xiye-4520r7ee.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:43.000Z","bios":{"en_US":"<p>Hanwei “xiye” Su is the model student for consistency in the mid lane. He joined up with the WE organization in 2013 as part of their developmental squad but was promoted in early 2015 to their main roster as the starting mid laner. His consistency across a variety of play styles has become his calling card in the LPL. Need a mage that can lock down and annihilate squishy targets? Check, xiye has got you covered. What about an assassin that can dice the enemy team down to size? No problem.</p>\n\n<p>Xiye’s steady performances combined with an ocean deep champion pool means that the enemy never quite knows what composition Team WE could build -- this makes prepping to play against xiye a nightmare. Without an easy way to ban him out, xiye can easily meld his play to whatever mid laner is required. He’ll be the rock that Team WE rely on as they step up their game at the 2017 Mid-Season Invitational in Rio. </p>","de_DE":"Hanwei „xiye“ Su ist das perfekte Beispiel für Beständigkeit auf der mittleren Lane. Er wechselte im Jahr 2013 zu WE und spielte in deren Entwicklungsmannschaft, wurde Anfang 2015 aber zum Mid-Laner der Hauptmannschaft gemacht. Durch seine Beständigkeit und seine unterschiedlichen Spielstile machte er sich schnell einen Namen in der LPL. Brauchst du einen Magier, der verletzliche Ziele jagen und vernichten kann? Kein Problem, xiye ist genau der Richtige dafür. Wie wäre es mit einem Assassinen, der die gegnerische Mannschaft in Stück reißt? Auch kein Problem. Dank xiyes konstanten Leistungen und seines umfangreichen Championpools wissen seine Gegner nie genau, was sie erwartet, und dadurch wird es unglaublich schwer, sich auf xiye vorzubereiten. Es ist schwierig, xiye mit Bannen zu schwächen, denn er kann auf der mittleren Lane so gut wie jeden Champion spielen. In Rio wird er Team WEs Fels in der Brandung sein, wenn sich die Mannschaft für das Mid-Season Invitational 2017 bereit macht. ","es_ES":"Hanwei ''xiye'' Su es el alumno modelo en términos de estabilidad en la calle central. Se unió a la organización de WE en 2013 como parte de su grupo en desarrollo, pero ascendió al principio de 2015 a la plantilla principal como mid titular. Sus resultados positivos con diversos estilos de juego se han convertido en su tarjeta de presentación en la LPL. ¿Su equipo necesita un mago que pueda inmovilizar y aniquilar a los objetivos más débiles? Sin problema, para eso está xiye. ¿Y si conviene más jugar con un asesino que pueda trocear al equipo enemigo? Todo controlado. El desempeño estable de xiye combinado con su gran repertorio de campeones hacen que el equipo enemigo casi nunca pueda prever cuál será la composición de Team WE (eso provoca que prepararse para jugar contra xiye sea toda una pesadilla). Como bloquear su selecciones no es tarea fácil, xiye puede adaptar sin problema su estilo de juego según el mid que mejor encaje. Team WE confiará en sus habilidades cuando se suban al escenario del Mid-Season Invitational 2017 en Río. ","pl_PL":"Hanwei „xiye” Su daje wzór konsekwentnej gry na środkowej alei. Dołączył do organizacji WE w 2013 roku jako część składu rozwojowego, a na początku 2015 roku został awansowany do głównego składu jako pierwszy środkowy. Umiejętna gra różnymi stylami stała się jego wyróżnikiem w LPL. Potrzebny jest mag, który umie blokować i anihilować delikatne cel? Jasne, xiye załatwi sprawę. A co z zabójcą, który potrafi ukrócić zapędy wrogiej drużyny? Żaden problem. Spójne występy xiye w połączeniu z rozległą jak ocean pulą bohaterów oznaczają, że wróg nigdy nie wie, jaką kompozycję wybierze Team WE — a to sprawia, że przygotowanie do gry przeciwko xiye jest koszmarem. Ponieważ nie ma łatwego sposobu, by go zbanować, xiye może szybko dostosować swoją grę do stylu wymaganego w danej sytuacji od środkowego. Jest opoką, na której wesprą się Team WE, by pokazać, na co ich stać na Mid-Season Invitational 2017 w Rio. ","pt_BR":"<p>Hanwei “xiye” Su é o modelo de consistência na rota do meio. Ele entrou para a organização WE em 2013 como parte da sua equipe em formação, mas foi promovido no início de 2015 à sua seleção principal para jogar na rota do meio. Sua consistência em vários estilos de jogo se tornou seu principal trunfo na LPL. Precisam de um mago que imobilize e acabe com alvos frágeis? Pode deixar, o xiye dá conta. E que tal um assassino que possa dar uma podada na equipe inimiga? Sem problema.</p> \n\n<p>Os desempenhos estáveis de xiye e o seu impressionante leque de Campeões fazem com que seus oponentes jamais saibam que composição a Team WE vai montar, o que é um verdadeiro pesadelo para quem precisa se preparar para enfrentá-lo. Sem uma maneira fácil de banir suas principais escolhas, xiye pode facilmente adequar seu estilo de jogo ao de qualquer Campeão da rota do meio que seja necessário. Ele será o alicerce em que a Team WE se apoiará para avançar no Mid-Season Invitational 2017 no Rio. </p>","es_AR":"<p><strong>Hanwei \"xiye\" Su</strong> es la imagen de la coherencia en el carril central. Se unió a la organización WE en 2013 como parte de su escuadrón de desarrollo, pero fue ascendido a inicios de 2015 a su arsenal principal como su carrilero central principal. Su coherencia a lo largo de una variedad de estilos de juego se convirtió en su marco en el LPL. ¿Necesitas a un mago que atrape y aniquile a los objetivos aplastables? Bueno, <strong>xiye</strong> se encarga. ¿Qué hay de un asesino que reduzca a la mitad al equipo enemigo? No hay problema. El desempeño estable de <strong>xiye</strong>, combinado con una profunda agrupación de campeones significa que el enemigo nunca sabe cuál será la composición del Team WE. Esto hace que prepararse para pelear contra <strong>xiye</strong> sea una pesadilla. Sin una forma sencilla de eliminarlo, <strong>xiye</strong> puede adaptarse con facilidad a lo que el carrilero central necesite. Será la roca sobre la cual se base el Team WE cuando se preparen para el Mid-Season Invitational 2017 en Río.</p>"},"foreignIds":{"drupalId":"3186","TRLH1":"200000402","TRLH2":"200000302","TRLT3":"200000230"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":517,"slug":"mystic","name":"Mystic","firstName":"Seongjun","lastName":"Jin","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mystic-cktg9mzr.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:04.000Z","updatedAt":"2017-07-07T18:02:57.000Z","bios":{"en_US":"<p>Seongjun “Mystic” Jin started his professional career in his native South Korea with the Jin Air Stealths in 2013. Near the tail-end of 2014 he decided to make the move to China and Team WE Academy. It was here that he made the perilous switch from jungle to AD carry. He acclimated quickly to the new role and Team WE took notice. They promoted Mystic to their roster as a sub and not long after he was promoted yet again to their starting AD carry position where he’s been since the spring of 2015.</p>\n\n<p>He’s comfortable on a variety of champions, from the initiation of Ashe’s Crystal Arrow to the raw carry potential of Piltover’s finest, Caitlyn -- Mystic can play it all. Team WE will rely on his versatility when they come face-to-face with some of the Rift’s most feared bot lane duos at the 2017 Mid-Season Invitational.</p>","pl_PL":"Seongjun „Mystic” Jin zaczął profesjonalną karierę w ojczystej Korei Południowej z Jin Air Stealths w 2013 roku. Pod sam koniec 2014 roku zdecydował się przeprowadzić do Chin i drużyny Team WE Academy. Tam dokonał ryzykownego przejścia z dżungli do roli prowadzącego. Szybko zaaklimatyzował się na nowej pozycji, a Team WE to zauważyli. Dołączyli Mystica do swojego składu jako rezerwowego, a niedługo później ponownie awansowali na pozycję prowadzącego w pierwszym składzie, którą zajmuje od wiosny 2015 roku. Dobrze sobie radzi z różnorakimi bohaterami od inicjującej Kryształowej Strzały Ashe po potencjalnie prowadzącą sławę z Piltover, Caitlyn — Mystic potrafi grać wszystkimi. Team WE będą polegali na jego wszechstronności, gdy staną twarzą w twarz z kilkoma z najgroźniejszych duetów dolnej alei Summoner’s Rift podczas Mid-Season Invitational 2017.","es_ES":"Seongjun ''Mystic'' Jin comenzó su trayectoria profesional en su Corea del Sur natal con Jin Air Stealths en 2013. Al final de 2014, decidió trasladarse a China para formar parte de Team WE Academy. Fue en ese momento cuando hizo un arriesgado cambio de rol: de jungla a AD carry. No tardaría en adaptarse a su nueva posición, y Team WE lo tuvo en cuenta. Lo ascendieron a su plantilla principal como suplente y, poco después, pasaría a ser AD carry titular, posición que ha ocupado desde la primavera de 2015. Se siente cómodo con una gran variedad de campeones: desde la capacidad de iniciación de la Flecha de cristal de Ashe, al potencial para dominar la partida de la sheriff más sofisticada de Piltover, Caitlyn. Mystic es capaz de jugar con cualquier campeón. Team WE confiará en su versatilidad cuando se enfrenten cara a cara contra algunos de los dúos de bot más temidos de la Grieta en el Mid-Season Invitational 2017.","de_DE":"Seongjun „Mystic“ Jin begann seine professionelle Karriere 2013 in seiner Heimat, Südkorea, bei Jin Air Stealths. Gegen Ende des Jahres 2014 entschied er sich aber, nach China zu Team WE Academy zu wechseln. Dort wechselte er auch aus dem Dschungel auf die untere Lane, um dort als AD-Carry zu spielen. Er fand sich schnell in seine neue Rolle ein und machte so Team WE auf sich aufmerksam. Sie nahmen Mystic als Ersatzspieler in ihre Aufstellung auf und machten ihn im Frühjahr 2015 zum Haupt-AD-Carry. Er kommt mit vielen Champions zurecht: Von Ashes Kristallpfeil bis zur brutalen Schadensmaschine aus Piltover, Caitlyn – Mystic kann alles spielen. Team WE wird seine Vielseitigkeit brauchen, wenn sie es beim Mid-Season Invitational 2017 mit den gefürchtetsten Duos auf der unteren Lane zu tun bekommen.v","pt_BR":"<p>Seongjun “Mystic” Jin começou sua carreira profissional na Coreia do Sul, sua terra natal, com a Jin Air Stealths em 2013. Perto do fim de 2014, ele decidiu se mudar para a China e entrou para a Team WE Academy. Foi lá que ele fez a arriscada mudança de caçador para atirador. Ele se acostumou rapidamente à nova função, chamando a atenção da Team WE. Eles então promoveram Mystic à sua seleção como reserva e, pouco tempo depois, ele foi novamente promovido para a posição de atirador principal, que ocupa desde a metade inicial de 2015.</p>\n\n<p>Ele joga com diversos Campeões, sentindo-se confortável tanto com a iniciação da Flecha de Cristal da Ashe quanto com o potencial de carregar partidas da defensora de Piltover, Caitlyn. Mystic é a versatilidade em pessoa. A Team WE vai depender do grande repertório dele quando ficar cara a cara com algumas das duplas da rota inferior mais temidas do Rift no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Seongjun \"Mystic\" Jin</strong> comenzó su carrera profesional en su Corea del Sur nativa con los Jin Air Stealths en 2013. Cerca de finales de 2014 decidió mudarse a China y entrar a la academia del Team WE. Aquí hizo el peligroso cambio de junglero a tirador. Se acostumbró rápidamente al nuevo rol y el Team WE lo notó. Ascendieron a <strong>Mystic</strong> a su arsenal como suplente y no mucho después fue ascendido nuevamente a tirador principal, puesto en el cual ha permanecido desde la primavera de 2015. Se siente cómodo con una variedad de campeones, desde la iniciación de la Flecha de Cristal de Ashe, hasta el potencial de acarreador de la mejor de Piltóver: Caitlyn. <strong>Mystic</strong> puede jugar con todos. El Team WE confía en su versatilidad cuando se enfrenten a los dúos de carril inferior más temidos de la Grieta en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"994","TRLH1":"200000403","TRLH2":"200000303","TRLT3":"200000231"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":519,"slug":"kid","name":"Kidkid","firstName":"Yan","lastName":"Ge","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kid-d4hufczg.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:24:40.000Z","bios":{"en_US":"","fr_FR":"<p>Ge « Kid » Yan est un incroyable carry AD. Il s'entraîne constamment pour s'améliorer et développer de meilleures synergies avec son partenaire de la voie du bas, Kitties. Et tout cet entraînement a fini par payer : ses performances régulières aux LPL lui a valu le surnom « d'ancre de stabilité ».</p>\n\n<p>À la différence de bon nombre de joueurs pro, Kid n'a pas perdu sa nonchalance en devenant une star, du moins pas en dehors de son rigoureux programme d'entraînement ! Mais quand l'entraînement prend fin, c'est un Kid très relax qu'on retrouve. Quand il est l'heure de s'amuser, il est prêt à se donner à fond.</p>","pl_PL":"<p>Ge „Kid” Yan to rzetelny prowadzący. Ciągle trenuje, starając się poprawić swoją formę i współpracę z partnerem z dołu, Kitties. Ćwiczenia opłaciły się – jego stabilna gra w LPL sprawiła, że zaczęto go nazywać „Ostoją stabilności”.</p>\n\n<p>W przeciwieństwie do innych zawodowców Kid nie przestał być wyluzowany, gdy stal się gwiazdą. Oczywiście nie dotyczy to jego rygorystycznych treningów. Jednak po treningu pojawia się na powrót zrelaksowany Kid. Kiedy przychodzi pora na zabawę, oddaje jej się bez reszty.</p>","de_DE":"<p>Ge “Kid” Yan ist ein Arbeitstier als AD Carry. Er trainiert konstant, um besser zu werden und arbeitet an seiner Synergie mit seinem Supporter, Kitties. Und die ganze Arbeit hat sich ausgezahlt, seine konstanten Leistungen in der LPL brachten ihm den Namen “The Anchor of Stability”.</p>\n\n<p>Im Gegensatz zu anderen Profis opferte er nicht sein entspanntes Wesen, um ein Star zu werden – zumindest nicht abseits seines harten Trainingsplanes! Aber wenn das Training vorbei ist, kommt das entspannte Kind zu Tage. Wenn die Zeit zum Spaß haben gekommen ist, ist er mittendrin dabei. </p>\n","es_ES":"<p>Ge “Kid” Yan es un trabajador por naturaleza. Este tirador se somete a duras sesiones de entrenamiento para que mejoren tanto él como jugador como la sinergia de la calle inferior con su compañero y support, Kitties. Y tanto entrenamiento ha dado sus frutos -- gracias a sus actuaciones consistentes en la LPL se ha ganado el apodo de “El Ancla de la Estabilidad”. </p>\n\n<p>A diferencia de muchos jugadores profesionales, Kid no ha sacrificado su actitud relajada y alegre para convertirse en una estrella -- ¡Al menos fuera de las sesiones de entrenamiento con su equipo! Cuando la práctica termina, descubrimos Kid relajado y bromista. Porque si es la hora de divertirse, ahí está él. </p>\n","pt_BR":"<p>Kid é um atirador incansável. Ele está sempre treinando para evoluir e ter uma sinergia melhor com seu parceiro de rota, Kitties. E tanta dedicação deu resultado -- com atuações consistentes na LPL, ele ganhou o apelido de \"Âncora da Estabilidade\".</p>\n<p>Ao contrário de vários jogadores, ele não sacrificou seu temperamento tranquilo para virar uma estrela -- pelo menos não fora do horário de treino. Quando o jogo acaba, surge o Kid tranquilão, pronto para se divertir.</p>"},"foreignIds":{"drupalId":"2064","TRLH4":"1001160033","TRLH3":"1001160033"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":522,"slug":"rookie","name":"Rookie","firstName":"Ui-jin","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rookie-3ohvy99s.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:27:32.000Z","bios":{"en_US":"","fr_FR":"<p>Eui-jin « RooKie » Song n'est qu'un nouveau venu aux LPL, mais ne vous laissez pas tromper par son pseudo (« le bleu » en anglais) : il a affronté bon nombre des meilleurs joueurs du monde. RooKie a été en première ligne du nouveau départ de KT Rolster en 2014, et le lien qu'il a développé avec son coéquipier jungler de KT, KaKAO, les a aidés à remporter plusieurs matchs des LCK.</p>\n\n<p>Lorsque KaKAO a décidé de participer aux LPL, RooKie a suivi le mouvement. Il a emporté avec lui son affinité pour les mages de contrôle, comme Azir et Orianna, ainsi qu'une tendance à utiliser des coups flamboyants pour remporter les parties. Si cette tendance a quelque peu reflué lors de sa première année aux LPL, RooKie a encore bon nombre de tours dans sa manche, notamment une excellente Cassiopeia.</p>","pl_PL":"<p>Eui-jin „RooKie” Song może i od niedawna gra w LPL, ale walczył już z najtrudniejszymi przeciwnikami na świecie. RooKie był główną siłą napędową KT Rolster w 2014 roku, a przyjaźń nawiązana z dżunglerem KaKAO pozwoliła wygrać wiele meczów w LCK.</p>\n\n<p>Kiedy KaKAO przeniósł się do LPL, RooKie zabrał się z nim. Zawsze lubił kontrolujących magów takich jak Azir czy Orianna i dalej ma tendencje do wygrywania popisowymi akcjami. Chociaż jego popisy nieco osłabły podczas pierwszego roku w LPL, RooKie wciąż ma kilka asów w rękawie, np. grę Cassiopeią.</p>","de_DE":"<p>Eui-jin “RooKie” Song mag zwar neu in der LPL sein, aber lass dich nicht von seinem Namen täuschen – er spielte schon gegen einige der besten Teams auf der Welt. RooKie war bei der Verjüngung von KT Rolster 2014 vorne mit dabei, und die Verbindung mit seinem Teamkameraden und Jungler von KT KaKAO trug dazu bei, viele Spiele in der LCK zu gewinnen. </p>\n\n<p>Als KaKAO in die LPL wechselte, zog RooKie nach. Er brachte eine Vorliebe für Kontrollmagier wie Azir und Orianna zu seinem neuen Arbeitsplatz mit und eine Tendenz zu riskanten Zügen, um Spiele zu gewinnen. Während sein Vertrauen auf riskante Spielzüge während seinem ersten Jahr in der LPL verblasste, packt er immer wieder ein Ass aus dem Ärmel – inklusive einer tödlichen Cassiopeia. </p>\n","es_ES":"<p>Puede que Eui-jin “RooKie” Song sea relativamente nuevo en la LPL, pero no dejes que su nombre te engañe -- ha jugado contra algunos de los rivales más fuertes del mundo. RooKie estuvo al frente en el proceso de renovación que sufrió KT Rolster durante 2014, y el lazo que desarrolló con su compañero en la jungla KaKAO ayudó a su equipo a ganar bastantes partidos en la LCK. </p>\n\n<p>Cuando KaKAO se fue a la LPL, RooKie hizo las maletas y se fue con él. En China, ha desarrollado una afinidad por magos que controlan a sus enemigos como Azir y Orianna, y una tendencia a depender de jugadas brillantes para ganar las partidas. Aunque durante su primer año en la LPL se ha vuelto más sobrio, RooKie sigue teniendo algún as en la manga -- incluída una Cassiopeia demoledora. </p>\n","pt_BR":"<p>RooKie pode ser novo na LPL, mas não se engane. Ele já jogou contra alguns dos melhores jogadores do mundo. Ele foi parte fundamental do rejuvenescimento da KT Rolster em 2014, e sua sinergia com o caçador KAKAO ajudou o time a vencer muitas particas na LCK.</p>\n<p>Quando KAKAO mudou-se da Coreia para a China, RooKie foi junto. Levou consigo o controle de magos como Azir e Orianna, criando uma tendência de jogadas exuberantes para vencer partidas. Apesar de essa exuberância ter perdido o encanto com o passar do tempo, ele ainda tem vários truques na manga -- incluindo uma Cassiopeia venenosa.</p>\n","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “RooKie” 송의진 선수가 LPL에 진출한 진 그리 오래되지 않았지만 아이디대로 신인인 건 아닙니다. 세계에서 가장 치열한 리그에서 뛴 적 있는 선수죠. RooKie 선수는 kt 롤스터가 2014년 팀을 재정비할 때 최전선에 섰고 같은 팀의 정글러 KaKAO 선수와 멋진 호흡으로 LCK에서 팀의 선전을 이끌었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">KaKAO 선수가 LPL로 이적할 때, RooKie 선수도 따라가면서 아지르나 오리아나 같은 장악형 마법사 플레이와 현란한 플레이로 승리하는 전략을 새 팀에 선사했죠. 비록 현란한 플레이에 의존하는 플레이는 LPL 진출 첫해를 보내며 사라졌지만 그 외에도 적을 떨게 하는 카시오페아 플레이처럼 여러 전술을 갖춘 선수입니다. </p>\n"},"foreignIds":{"drupalId":"2149","TRLH3":"1001160032","TRLH4":"1001160032","TRLH1":"1001180003","TRLH2":"1001140003"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":603,"slug":"raison","name":"Raison","firstName":"Soobeen","lastName":"Jeong","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/raison-9vqm9g4s.png","hometown":"","region":"LMS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-05-09T23:20:19.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4366","TRLH1":"200000405"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":692,"slug":"condi","name":"Condi","firstName":"Renjie","lastName":"Xiang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/condi-9gseaajf.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:08.000Z","updatedAt":"2017-07-07T18:00:19.000Z","bios":{"en_US":"<p>Renjie “Condi” Xiang is China’s resident Baron steal specialist, stealing more of the purple monster’s powers than any other jungler in the LPL since 2015. Since joining Team WE, Condi has been instrumental to their success. His in-your-face style, counter-jungling prowess, and potent dueling make him one of the most fearsome players on the Rift. With his aggressive style, he tends to favor dueling champions like Graves, Lee Sin, and Rek’Sai.</p>\n\n<p>Condi was instrumental in Team WE’s dismantling of Royals Never Give Up in the 2017 LPL Spring Split Finals. He consistently sliced through the enemy frontline and deleted the enemy damage dealers, turning even fights into blowouts. After the match, a tearful Condi couldn’t find any words except “I am so grateful to my teammates!” Let’s hope we see the same type of emotion and dominance as Condi travels to Rio to take on the world’s best at the 2017 Mid-Season Invitational.</p>","pl_PL":"Renjie „Condi” Xiang to chiński specjalista od wykradania Baronów. Skradł więcej mocy purpurowego potwora niż jakikolwiek inny dżungler w LPL od 2015 roku. Odkąd dołączył do Team WE, Condi stał się motorem sukcesu drużyny. Jego bezpośredni styl gry, sprawność w kontrowaniu dżunglowania i świetne umiejętności pojedynkowe sprawiają, że jest jednym z najgroźniejszych graczy na Summoner’s Rift. Ze względu na swój agresywny styl najchętniej wybiera pojedynkujących się bohaterów, takich jak Graves, Lee Sin i Rek’Sai. Condi odegrał główną rolę w rozbiciu przez Team WE drużyny Royal Never Give Up w finale wiosennego splitu LPL 2017. Regularnie przebijał się przez wrogą linię frontu i kasował zadających obrażenia przeciwników, zmieniając wyrównane walki w prawdziwą rzeź. Po meczu Condi ze łzami w oczach nie potrafił znaleźć innych słów niż: „Jestem tak bardzo wdzięczny moim kolegom z drużyny!”. Mamy nadzieję zobaczyć podobne emocje i dominację, gdy Condi wyruszy do Rio, by walczyć z najlepszymi na świecie podczas Mid-Season Invitational 2017.","es_ES":"Renjie ''Condi'' Xiang es el ladrón de Barones chino por excelencia, pues ha conseguido robar los efectos del monstruo morado más que ningún otro jungla de la LPL desde 2015. Desde que se unió a Team WE, Condi ha sido fundamental para el éxito del equipo. Su estilo enérgico, su habilidad para robar la jungla enemiga y su potente capacidad para batirse en duelo lo convierten en uno de los jugadores más temidos de la Grieta. Como su estilo es agresivo, suele optar por campeones capaces de batirse en duelo como Graves, Lee Sin o Rek'Sai. Condi fue una pieza clave para la victoria de Team WE contra Royal Never Give Up en la final del split de primavera de la LPL 2017. Consiguió de forma sistemática ignorar al frente enemigo y aplastar a sus campeones de daño, cambiando las tornas del combate a su favor. Tras la partida, con lágrimas en los ojos, Condi solo pudo articular las siguientes palabras: ''¡Les doy gracias infinitas a mis compañeros de equipo!''. Esperamos que se muestre igual de emocionado y dominante cuando viaje a Río para derrotar a los mejores del mundo en el Mid-Season Invitational 2017.","de_DE":"Renjie „Condi“ Xiang ist Chinas Experte, wenn es um das Stehlen von Barons geht (seit 2015 hat er sich die Kräfte des violetten Monsters häufiger zunutze gemacht, als alle anderen Jungler in der LPL)  Seit seinem Wechsel zu Team WE ist Condi für den Erfolg der Mannschaft unerlässlich. Sein aggressiver Stil, seine Stärke im gegnerischen Dschungel und seine Entscheidungen in Duellen machen ihn zu einem der gefährlichsten Spieler in der Kluft. Durch seine Aggressivität bevorzugt er Champions wie Graves, Lee Sin und Rek’Sai. Condi war maßgeblich daran beteiligt, dass Team WE Royal Never Give Up im Finale des Frühjahrs-Splits der LPL 2017 vernichten konnte. Er kämpfte sich immer wieder durch die Frontlinie seiner Gegner, vernichtete die feindlichen Carrys und machte aus ausgeglichenen Kämpfen Gemetzel. Das Einzige, was der überwältigte Condi nach dem Spiel sagen konnte war: „Ich bin meinen Mannschaftskameraden so dankbar!“ Hoffentlich sehen wir auch beim Mid-Season Invitational 2017 so viel Emotion und Dominanz, wo es Condi mit den Besten der Welt zu tun bekommt.","pt_BR":"<p>Renjie “Condi” Xiang é o especialista em roubos de Barão na China, tendo roubado o poder do monstro roxo mais vezes do que qualquer outro caçador da selva na LPL desde 2015. Desde que entrou para a Team WE, Condi tem sido crucial para o seu sucesso. Seu estilo de partir para cima, sua proeza em invasões da selva e seu forte desempenho em duelos fazem dele um dos jogadores mais temíveis no Rift. Com seu estilo agressivo, ele costuma preferir Campeões como Graves, Lee Sin e Rek’Sai. </p>\n\n<p>Condi foi fundamental para o desmantelamento da Royal Never Give Up por parte da Team WE na final da Etapa de Primavera da LPL 2017. Ele consistentemente rasgava a linha de frente inimiga e destruía os causadores de dano, transformando lutas equilibradas em vitórias unilaterais. Depois da partida, com lágrimas nos olhos, Condi conseguiu dizer apenas: “Sou muito grato aos meus companheiros de equipe!” Vamos torcer para ver o mesmo tipo de emoção e dominação agora que Condi viaja ao Rio para enfrentar os melhores do mundo no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Renjie “Condi” Xiang</strong> es el experto en robos de Barón de China, logra robar más de los poderes del monstruo morado que ningún otro junglero en el LPL desde 2015. Desde que se unió al Team WE, <strong>Condi</strong> ha sido clave para su éxito. Tiene un estilo de juego provocativo, destreza para el contrajungleo y es un duelista muy fuerte, lo que lo hace uno de los jugadores más atemorizantes de la Grieta. Con su estilo agresivo tiende a favorecer a los campeones duelistas como Graves, Lee Sin y Rek’Sai. Condi fue clave para el desmantelamiento de los Royal Never Give Up en manos del Team WE en las finales del 2017 del Torneo de Apertura LPL. Abrió la línea frontal del enemigo constantemente y eliminó a todos los enemigos que infligían daño para convertir las peleas justas en palizas. Después de la partida, <strong>Condi</strong> estaba lleno de lágrimas y no podía decir otra cosa más que: <i>\"¡Estoy tan agradecido con mis compañeros!\"</i> Esperamos ver el mismo tipo de emoción y dominio mientras <strong>Condi</strong> viaja a Río para participar en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"drupalId":"4218","TRLH1":"200000401","TRLH2":"200000301","TRLT3":"200000229"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1038,"slug":"957","name":"957","firstName":"Changyu","lastName":"Ke","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/957-fcqbzhtx.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2016-01-06T22:06:09.000Z","updatedAt":"2017-07-07T17:52:32.000Z","bios":{"en_US":"<p>Changyu “957” Ke kicked off his career in 2015 as the starting top laner for Team WE’s developmental squad, Team WE Future. It was there that he established himself as a reliable option and as his repertoire grew, his sister team began to take notice. In early 2016, 957 made the jump to Team WE’s LPL squad where he made an immediate difference. His steady, low maintenance play on stalwarts like Maokai, Poppy, and Nautilus provided Team WE with a dependable presence in the top lane.</p>\n\n<p>He requires notoriously low resources in game, freeing up his teammates to farm gold and kills to their heart’s content. He doesn’t mind though, because once opponents come up against him late game, chances are that he’s already an unkillable mega tank. 957’s consistency will truly be tested as he heads to Rio to clash with the best top laners the world has to offer at the 2017 Mid-Season Invitational.</p>","de_DE":"Changyu „957“ Ke begann seine Karriere 2015 als Top-Laner für die Entwicklungsmannschaft von Team WE, Team WE Future. Dort konnte er sich als verlässliche Option etablieren und als er sich weiter steigerte, wurde seine Schwestermannschaft auf ihn aufmerksam. Anfang des Jahres 2016 wechselte 957 schließlich zu Team WE in die LPL, wo er sofort einen Unterschied ausmachte. Seine stabilen Leistungen mit Champions wie Maokai, Poppy und Nautilus verliehen Team WE eine verlässliche Präsenz auf der oberen Lane. Er benötigt nur sehr wenige Ressourcen und überlässt das Gold und die Tötungen seinen Mannschaftskameraden. Aber das stört ihn nicht, denn wenn die Gegner ihm im späten Spiel zu Leibe rücken, ist er in der Regel bereits ein unsterblicher Mega-Tank. Beim Mid-Season Invitational 2017 in Rio wird 957s Beständigkeit auf die Probe gestellt, wenn er es mit den besten Top-Lanern der Welt zu tun bekommt.","es_ES":"Changyu ''957'' Ke comenzó su trayectoria en 2015 como top titular del grupo en desarrollo de Team WE, Team WE Future. A partir de entonces, demostró ser una opción fiable y, a medida que él fue aumentando su repertorio de campeones, el equipo hermano de Team WE comenzó a hacerse notar. A comienzos de 2016, 957 se unió al grupo de la LPL de Team WE y no tardaría en marcar la diferencia. Su estilo de juego estable y de bajo mantenimiento, con campeones resistentes como Maokai, Poppy y Nautilus, aportó a Team WE una presencia de fiar en la calle superior. Necesita muy pocos recursos durante la partida, lo que permite que sus compañeros de equipo puedan farmear y llevarse asesinatos libremente. Y eso no es algo que le afecte, pues cuando los oponentes intenten enfrentarse a él al final de la partida, es probable que ya sea un megatanque inmortal. La estabilidad de 957 será puesta a prueba en Río cuando se enfrente a los mejores jugadores de la calle superior del mundo en el Mid-Season Invitational 2017.","fr_FR":"Changyu „957” Ke rozpoczął karierę w 2015 roku jako główny górny rozwojowego składu Team WE, Team WE Future. Tam pokazał, że jest solidnym zawodnikiem i gdy rozszerzył swój repertuar, siostrzana drużyna zaczęła na niego zwracać uwagę. Na początku 2016 roku 957 przeszedł do występującego w LPL składu Team WE i osiągnięcia drużyny natychmiast się poprawiły. Jego równa, zużywająca niewiele zasobów gra podporami drużyny, takimi jak Maokai, Poppy i Nautilus, zapewniła Team WE stałą obecność na górnej alei. 957 w dalszym ciągu zużywa niewiele zasobów w grze, umożliwiając kolegom farmienie złota i zabójstw, ile dusza zapragnie. Nie przeszkadza mu to wcale, ponieważ gdy przeciwnicy ruszą przeciwko niemu w późnej fazie gry, są duże szanse na to, że będzie już wtedy niemożliwym do zabicia megaobrońcą. Konsekwentny styl gry 957 zostanie poddany prawdziwej próbie, gdy zawodnik pojedzie do Rio, by zetrzeć się z najlepszymi górnymi, jakich ma do zaoferowania świat, na Mid-Season Invitational 2017.","pt_BR":"<p>Changyu “957” Ke começou sua carreira em 2015 como o jogador da rota superior da equipe de formação da Team WE, a Team WE Future. Foi lá que ele se estabeleceu como uma opção confiável, e à medida que seu repertório cresceu, sua equipe irmã começou a prestar atenção nele. No início de 2016, 957 foi transferido para a equipe da LPL da Team WE, onde logo de cara fez a diferença. Seu desempenho estável e econômico com Campeões como Maokai, Poppy e Nautilus fez dele uma presença sustentadora para a Team WE na rota superior. </p><p>Ele consome pouquíssimos recursos no jogo, permitindo que seus companheiros de equipe coletem ouro e abates à vontade. E ele não se importa, porque quando seus oponentes o enfrentam nos estágios mais avançados do jogo, ele geralmente já virou um mega tanque simplesmente invencível. A consistência de 957 será colocada à prova em seu rumo ao Rio, onde ele enfrentará os melhores jogadores da rota superior que o mundo tem a oferecer no Mid-Season Invitational 2017.</p>","es_AR":"<p><strong>Changyu \"957\" Ke</strong> comenzó su carrera en 2015 como el carrilero superior del escuadrón en desarrollo del Team WE, el Team WE Future. Ahí se estableció como una opción confiable y mientras su repertorio crecía su equipo hermano comenzó a notarlo. A principios del 2016, <strong>957</strong> pasó al escuadrón LPL del Team WE, en donde hizo una diferencia inmediatamente. Su juego firme, pero de bajo mantenimiento con opciones fuertes como Maokai, Poppy y Nautilus brindan al Team WE una presencia confiable en el carril superior. Él necesita recursos increíblemente bajos en una partida, lo que permite que sus compañeros coleccionen oro y asesinatos como les apetezca. No le molesta porque cuando los oponentes lo enfrentan en el juego tardío, es probable que ya sea un megatanque inmortal. La coherencia de <strong>957</strong> será puesta a prueba mientras se dirige hacia Río para enfrentarse con los mejores carrileros superiores del mundo en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000400","TRLH2":"200000300","TRLT3":"200000228"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1428,"slug":"ben","name":"Ben","firstName":"Donghyun","lastName":"Nam","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben-1yppxrjt.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2016-08-24T21:25:24.000Z","updatedAt":"2017-07-07T22:23:11.000Z","bios":{"en_US":"<p>Donghyun “Ben” Nam started his professional career in the summer of 2016 when he was signed by Invictus Gaming. He unfortunately didn’t have many chances to showcase his talent when he was with Invictus, but since joining Team WE in late 2016, he’s been able to show glimpses of his mechanical prowess on the Rift. He was largely unknown before joining up with Team WE, but the LPL has been abuzz with his name ever since.</p>\n\n<p>It took him awhile to sync up with lane mate Mystic, but with his mechanical ceiling many fans are clamoring for more from him. After helping his team sweep Royal Never Give Up in the finals, Ben has the chance to show the world how supports can carry games. He’s looking to shine as he squares off against international competition for the first time at the 2017 Mid-Season Invitational.</p>","de_DE":"Donghyun „Ben“ Nam begann seine professionelle Karriere im Sommer 2016, als er bei Invictus Gaming unterschrieb. Leider konnte er bei Invictus sein Talent nur selten unter Beweis stellen, aber seit seinem Wechsel zu Team WE Ende 2016 stellte er immer wieder sein mechanisches Können unter Beweis. Vor seinem Wechsel zu Team WE war er noch Großteils unbekannt, aber seither kennt die ganze LPL seinen Namen. Es hat eine Weile gedauert, bis er sich auf seinen Lane-Partner Mystic eingestellt hatte, aber aufgrund seines mechanischen Könnens erwarten viele Fans noch mehr von ihm. Nachdem er seiner Mannschaft im Finale des Frühjahrs-Splits der LPL geholfen hat, mit Royal Never Give Up den Boden aufzuwischen, bekommt Ben jetzt die Chance, der Welt zu zeigen, wie man als Supporter Spiele entscheidet. Er wird sein Bestes geben, wenn er beim Mid-Season Invitational 2017 auf die internationale Konkurrenz trifft.","es_ES":"Donghyun ''Ben'' Nam comenzó su carrera profesional en el verano de 2016, cuando fue fichado por Invictus Gaming. Por desgracia, no tuvo muchas oportunidades para mostrar su talento cuando jugó con Invictus, pero desde que se unió a Team WE al final de 2016, ha podido hacer gala de sus destrezas en la Grieta. No era apenas conocido cuando se unió a Team WE, pero su nombre no ha dejado de repetirse en la LPL desde entonces. Tardó un tiempo en congeniar con su compañero de calle, Mystic, pero sus capacidades mecánicas son tan buenas que sus fans aún quieren más. Tras ayudar a su equipo a vencer a Royal Never Give Up en la final, Ben ahora tiene la oportunidad de demostrarle al mundo que los apoyos también pueden liderar a su equipo hasta la victoria. Intentará darlo todo cuando pise el escenario internacional por primera vez en el Mid-Season Invitational 2017.","pl_PL":"Donghyun „Ben” Nam zaczął profesjonalną karierę latem 2016 roku, gdy został zwerbowany przez Invictus Gaming. Niestety nie miał wielu okazji, by zademonstrować swój talent, grając z Invictus, dopiero odkąd dołączył do Team WE pod koniec 2016 roku może się popisywać umiejętnościami mechanicznymi na Summoner’s Rift. Przed dołączeniem do Team WE nie był szerzej znany, ale od tamtej pory LPL nie przestaje o nim mówić. Zgranie się z kolegą z alei, Mysticem, zajęło mu trochę czasu, jednak teraz fani domagają się od niego jeszcze więcej, znając górny pułap jego umiejętności mechanicznych. Po tym, jak pomógł swojej drużynie zmieść Royal Never Give Up w finale, Ben ma szansę pokazać światu, że wspierający także potrafią prowadzić do zwycięstwa w grach. Podczas swojego pierwszego starcia z rywalami z całego świata na Mid-Season Invitational 2017 na pewno spróbuje zabłysnąć.","pt_BR":"<p>Donghyun “Ben” Nam começou sua carreira profissional na metade de 2016, quando foi contratado pela Invictus Gaming. Ele infelizmente não teve muitas oportunidades de demonstrar seu talento enquanto esteve na Invictus, mas desde que entrou para a Team WE no final de 2016, temos tido vislumbres da sua proeza mecânica no Rift. Ele era bastante desconhecido antes de se juntar à Team WE, mas desde então seu nome é um dos mais citados na LPL. </p>\n\n<p>Sua sincronia com seu companheiro de rota, Mystic, não foi imediata, mas com seu alto nível de mecânica, muitos fãs estão ansiosos para vê-lo jogar mais. Após ter ajudado sua equipe a massacrar a Royal Never Give Up na final, Ben agora tem a chance de mostrar ao mundo como suportes podem carregar partidas. Ele pretende brilhar no Mid-Season Invitational 2017, onde enfrentará competidores internacionais pela primeira vez.</p>","es_AR":"<p><strong>Donghyun \"Ben\" Nam</strong> comenzó su carrera profesional en el verano de 2016 cuando entró a Invictus Gaming. Por desgracia, no tuvo muchas oportunidades de demostrar su talento cuando estuvo en Invictus, pero desde que se unió al Team WE a fines de 2016, ha podido mostrar destellos de su poderío mecánico en la Grieta. No era famoso antes de unirse al Team WE, pero LPL no deja de oír su nombre desde entonces. Le tomó un tiempo sincronizarse con su compañero de carril, <strong>Mystic</strong>, pero debido a sus habilidades mecánicas muchos seguidores lo aclaman. Después de ayudar a su equipo a ganar el Royal Never Give Up en las finales, <strong>Ben</strong> tuvo la oportunidad de mostrarle al mundo cómo los soportes pueden ser acarreadores en las partidas. Busca destacar en la competencia internacional por primera vez en el Mid-Season Invitational 2017.</p>"},"foreignIds":{"TRLH1":"200000406","TRLH2":"200000306"},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1664,"slug":"megan","name":"Megan","firstName":"Liu-Yi","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/megan-900drhog.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:38:18.000Z","updatedAt":"2017-06-06T23:28:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1871,"slug":"ning","name":"Ning","firstName":"Zhen-Ning","lastName":"Gao","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T18:39:15.000Z","updatedAt":"2017-04-16T18:39:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1980,"slug":"west","name":"West","firstName":"Long","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:18:02.000Z","updatedAt":"2017-06-06T23:18:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1981,"slug":"theshy","name":"TheShy","firstName":"Seung-Lok","lastName":"Kang","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:24:15.000Z","updatedAt":"2017-06-06T23:24:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1982,"slug":"rio","name":"Rio","firstName":"Fu-Hua","lastName":"Wen","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:28:00.000Z","updatedAt":"2017-06-06T23:28:00.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1991,"slug":"zbb","name":"Zbb","firstName":"Zhi","lastName":"Ke","roleSlug":"midlane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:24:21.000Z","updatedAt":"2017-06-07T00:24:21.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":82},{"id":1992,"slug":"laozhou","name":"Laozhou","firstName":"Chao","lastName":"Zhou","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-07T00:17:21.000Z","updatedAt":"2017-07-07T17:53:44.000Z","bios":{},"foreignIds":{"TRLT3":"200000233"},"socialNetworks":{},"champions":[],"liveGameTeam":82}],"scheduleItems":[{"id":"AVx_nnPbQMQFcjhwbQ7n","content":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:match:e5ff8736-96ee-47e7-a4e8-7216c177003d","scheduledTime":"2017-08-05T12:00:00.953+0000","tags":{"blockLabel":"8","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:bracket:fc6c3d1a-8bb5-46e8-b633-3adcfe627827","leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06"},"match":"e5ff8736-96ee-47e7-a4e8-7216c177003d","tournament":"465a2d10-2a73-43cb-a627-f0c87b564f06","bracket":"fc6c3d1a-8bb5-46e8-b633-3adcfe627827","league":"7"}],"gameIdMappings":[],"videos":[{"id":8386,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:ac074e01-b647-4e60-9518-60873ff9b327","source":"https://www.youtube.com/embed/_z3DAaG2FEQ?wmode=transparent&start=18425&rel=0","createdAt":"2017-08-05T18:18:39.000Z","updatedAt":"2017-08-05T18:18:39.000Z","game":"ac074e01-b647-4e60-9518-60873ff9b327"},{"id":8387,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:796e47b2-dc20-421b-a31c-fbcd5818ed01","source":"https://www.youtube.com/embed/_z3DAaG2FEQ?wmode=transparent&start=21286&rel=0","createdAt":"2017-08-05T18:28:51.000Z","updatedAt":"2017-08-05T18:28:51.000Z","game":"796e47b2-dc20-421b-a31c-fbcd5818ed01"}],"htmlBlocks":[],"match":{"id":"e5ff8736-96ee-47e7-a4e8-7216c177003d","name":"IG-vs-WE","position":4,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}],"games":{"ac074e01-b647-4e60-9518-60873ff9b327":{"id":"ac074e01-b647-4e60-9518-60873ff9b327","name":"G1","generatedName":"IG|WE|G1|e5ff873696ee47e7a4e87","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}],"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501957479872,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501956764821,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"796e47b2-dc20-421b-a31c-fbcd5818ed01":{"id":"796e47b2-dc20-421b-a31c-fbcd5818ed01","name":"G2","generatedName":"IG|WE|G2|e5ff873696ee47e7a4e87","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}],"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501957490547,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501956787797,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"e512d96e-5ab5-4e48-95fd-cba9da2447b1":{"id":"e512d96e-5ab5-4e48-95fd-cba9da2447b1","name":"G3","generatedName":"IG|WE|G3|e5ff873696ee47e7a4e87","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"},{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501957490547,"source":"bestOf","history":[{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501957479872,"source":"bestOf","closed":true},{"result":[[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],[{"roster":"2522c332-a45d-4358-95f6-64a2b9cf7823"}]],"timestamp":1501956787797,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b4bc775a-2241-4829-81da-9c1a5e28126f":1,"2522c332-a45d-4358-95f6-64a2b9cf7823":0}}}