{"teams":[{"id":77,"slug":"qiao-gu","name":"NewBee","guid":"be6df6f7-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/qiao-gu-4kmc55n8.png","acronym":"NB","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-07T00:03:29.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"4380"},"players":[131,139,573,577,582,707,1283,1648,1651,1986],"starters":[131,573,577,582,1283],"subs":[139,707,1648,1651,1986]},{"id":218,"slug":"i-may","name":"I May","guid":"be7140e4-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/i-may-g9vriddl.png","acronym":"IM","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2016-05-18T20:51:23.000Z","updatedAt":"2017-06-06T23:41:14.000Z","bios":{"en_US":"","de_DE":"<p>I MAY ist ein Name, der Hoffnung ausstrahlt. Und das passt zum Ursprung dieser Mannschaft. IM war ursprünglich die zweite Mannschaft von Edward Gaming in der LSPL – ein bescheidener Anfang für eine Mannschaft, die jetzt zur WM fährt. Die Mannschaft, die damals noch als EDE bekannt war, gewann die LSPL und trat als I MAY beim Sommer-Split der LPL an. Ihr Erfolgslauf setzte sich im Sommer-Split fort und gipfelte in einem 3–2 Sieg über Team WE, mit dem sie sich für die Weltmeisterschaft qualifizierten. IM hat es allen Zweiflern und Kritikern gezeigt, die sich sichern waren, dass sie wegen ihres knappen Aufstiegs in die LPL niemals das höchste spielerische Niveau erreichen würden. Doch IM ließ sich von dieser Einschätzung nicht abschrecken und konnte in den Schlüsselmomenten Siege einfahren. Jetzt fährt die Mannschaft zur größten Bühne von League, um herauszufinden, ob sie mit ihrer verwegenen Art weitere überraschende Siege einfahren können.</p>","es_AR":"<p>I MAY es un nombre que denota esperanza, más que nada si se tiene en cuenta el origen de este equipo. IM comenzó en la LSPL como el segundo equipo de Edward Gaming, y sus comienzos fueron bastante humildes para ser un equipo que esté camino al Mundial. El equipo, conocido como EDE, logró salir del LSPL con un boleto al torneo de clausura de la LPL y bajo el nombre de I MAY. Su maravillosa actuación continuó a lo largo del torneo de clausura y terminó con una victoria por 3-2 contra Team WE y un pase al Campeonato Mundial. IM despejó las dudas de los escépticos y los críticos que sugerían que su casual ascenso a la LPL demostraba que nunca lograrían llegar a los más altos niveles de competición. Sin dejarse llevar por estos comentarios, IM continuó con su perfil bajo y obteniendo victorias en momentos clave. Ahora deberán saborear el escenario más grande de League of Legends y ver si pueden continuar con su audaz empresa de obtener más victorias de estas inesperadas.</p>\n\n<p><strong>Entrenador: Son \"Kezman\" Dae-young</strong></p>","pt_BR":"I MAY, \"eu posso\" em inglês, é um nome que irradia esperança e reflete as origens do time. A IM começou na LSPL com o segundo time da Edward Gaming -- começo humilde para uma equipe que agora vai para o Mundial. A equipe, antes conhecida como EDE, conseguiu sair da LSPL e chegou à Etapa de Verão da LPL como I MAY. Sua jornada de sucesso continuou até a Etapa de Verão, culminando com a classificação para o Mundial com uma vitória por 3 a 2 contra a WE. A IM calou a boca dos críticos e céticos que sugeriam que sua disputada ascensão à LPL era a prova de que eles não conseguiriam chegar aos níveis mais altos da competição. Sem temer essa percepção, a IM manteve a cabeça erguida e continuou vencendo em momentos cruciais. Agora chegou a hora da equipe vivenciar o nível máximo de League e ver se consegue dar continuidade a ousada tendência de abocanhar vitórias surpreendentes."},"foreignIds":{},"players":[293,505,507,974,1051,1278,1643,1983],"starters":[505,507,974,1051,1278],"subs":[293,1643,1983]}],"players":[{"id":131,"slug":"corn","name":"Corn","firstName":"Wen","lastName":"Lei","roleSlug":"midlane","photoUrl":"http://assets.lolesports.com/player/corn-a770ewam.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:16:58.000Z","updatedAt":"2017-06-06T23:59:26.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"3171","TRLH1":"1000185034","TRLH3":"1000205037"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":139,"slug":"vasilii","name":"Vasilii","firstName":"Wei-jun","lastName":"Li","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/vasilii-33axmst.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2014-08-22T19:17:02.000Z","updatedAt":"2017-06-07T00:04:12.000Z","bios":{"en_US":""},"foreignIds":{"drupalId":"1304","TRLH1":"1000045032","TRLH2":"2000045027"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":293,"slug":"ff","name":"FF","firstName":"Kui","lastName":"Xie","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ff-db69okzf.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-02-23T00:50:59.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3173"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":505,"slug":"amazingj","name":"AmazingJ","firstName":"Waiho","lastName":"Shek","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/amazingj-9y5n6mpk.png","hometown":"Hong Kong","region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:16.000Z","updatedAt":"2017-06-06T23:41:30.000Z","bios":{"en_US":"","fr_FR":"<p>\nWaiho « AmazingJ » Shek est un féroce invocateur de requins (ou de lamantins). AmazingJ a obtenu un record de 11/1/2 (et de multiples doublés) en jouant Fizz dans son tout premier match, contre Edward Gaming. D'abord engagé comme top laner remplaçant, AmazingJ a réussi une telle performance qu'il a gagné le droit de démontrer son talent dans d'autres parties tout au long de la saison de la LPL 2015. Il est arrivé au bout du segment d'été avec un score de 8 victoires contre 4 défaites. \n</p>","es_ES":"<p>\nWaiho ''AmazingJ'' Shek es un feroz invocador de tiburones (o manatíes). En su debut con Edward Gaming se marcó un 11/1/2 (con varios asesinatos dobles) con Fizz, el Gamberro de las Mareas. Aunque llegó al equipo como suplente, su magnífico rendimiento en las procelosas aguas de la LPL le ha llevado a ser titular varias veces durante la temporada 2015. Terminó el Split de verano con un registro de 8V-4D.\n</p>","pl_PL":"<p>\nWaiho „AmazingJ” Shek jest zaciekłym przywoływaczem rekinów (oraz manatów). AmazingJ osiągnął zachwycający wynik 11/1/2 (a także wiele podwójnych zabójstw), grając Fizzem, Szachrajem Sztormów, podczas swojego debiutanckiego meczu z Edward Gaming. AmazingJ pierwotnie odgrywał rolę zawodnika z górnej alei. Jego pierwszy występ sprawił, że wystąpił jeszcze wielokrotnie podczas LPL 2015. Zakończył letni split z wynikiem ośmiu zwycięstw do czterech porażek. \n</p>","de_DE":"<p>Shek „AmazingJ“ Wai Ho marschiert in seinem eigenen Takt. AmazingJ, der wegen seiner Liebe für einen gewissen patriotischen Demacianer auch „Garen-Bro“ genannt wird, schwor zu Beginn seiner Karriere in der LPL, dass er seine Mannschaft zur Weltmeisterschaft führen würde. Nach dem knappen Einzug in die LPL war das eine ziemlich gewagte Aussage, aber AmazingJ hielt sein Versprechen. Er lieferte bei der regionalen Qualifikationsrunde eine gigantische Leistung gegen World Elite ab, beendete das Spiel mit einer unglaublichen Teleportation und sicherte seiner Mannschaft so einen Platz bei der Weltmeisterschaft. AmazingJ hat allen gezeigt, wie gerne er mit dem Zeitbrecher spielt, und Ekko im Verlauf des Sommer-Splits 10-mal ausgewählt. Aber er kann seine Mannschaft auch mit Irelia tragen oder mit Shen die Karte kontrollieren. Jetzt, wo AmazingJ seine Mannschaft zur Weltmeisterschaft geführt hat, muss er noch besser spielen, um allen zu beweisen, dass I MAY auch gegen die Besten bestehen kann.</p>","pt_BR":"<p>Shek \"AmazingJ\" Wai Ho tem o seu próprio ritmo e tende a se manter nele. Além de ser chamado de \"Mano Garen\" por amar um certo patriota demaciano, AmazingJ iniciou sua carreira na LPL jurando que levaria sua equipe ao Mundial. Foi uma declaração bem ousada para alguém que teve dificuldades em chegar à LPL, mas ele cumpriu sua promessa. Ele jogou as Classificatórias Regionais na raça contra a World Elite, e conseguiu executar um teleporte incrível para encerrar o jogo e se classificar para o Mundial. AmazingJ se mostrou muito confiante com o Rapaz que Estilhaçou o Tempo, usando e abusando de Ekko em dez jogos da Etapa de Verão. Mas ele também consegue jogar com Irelia ou exercer pressão no mapa com Shen. Agora que AmazingJ levou seu time ao Mundial, ele precisa jogar mais do que nunca para provar que a I MAY pode brilhar no ambiente mais competitivo que pode existir.</p>","es_AR":"<p>Shek \"AmazingJ\" Wai Ho marcha al ritmo de su propio tambor. No solo es conocido como el \"hermano de Garen\" por su amor típico de buen patriota demaciano, sino por haber comenzado su carrera en la LPL jurando que llevaría al equipo al Campeonato Mundial. Fue una declaración jugada luego de haber llegado con lo justo a la LPL, pero AmazingJ cumplió con su promesa. Transpiró mucho la camiseta en las clasificatorias regionales contra World Elite, y logró una asombrosa jugada de teleportación para acabar la partida y calificar para el Campeonato Mundial. AmazingJ se ha sentido muy cómodo con el Joven que Fragmentó el Tiempo, y arrasó con Ekko en diez partidas durante el torneo de clausura. De todas formas, también acarrea muy bien con Irelia y aplica presión en el mapa con Shen. Ahora que AmazingJ ha llevado a su equipo al Campeonato Mundial, deberá jugar más duro que nunca para probar que I MAY puede prosperar en el evento más competitivo de todos.</p>"},"foreignIds":{"drupalId":"2083","TRLH3":"1001160042","TRLH4":"1001160042","TRLH1":"1001380045","TRLH2":"1001280015"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":507,"slug":"jinjiao","name":"Jinjiao","firstName":"Jinshan","lastName":"Xie","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/jinjiao-djee7q8y.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-28T22:12:17.000Z","updatedAt":"2017-06-06T23:40:37.000Z","bios":{"en_US":"","de_DE":"<p>Xie „Jinjiao“ Jin-Shan spielte sowohl in der LSPL als auch in der LPL, bevor er bei I MAY ein neues Zuhause fand. Dieser AD-Carry spielt bevorzugt Jhin und Sivir, die er im Verlauf des Sommer-Splits der LPL 2016 jeweils 12- und 11-mal auswählte. Aber falls der Virtuose und die Kampfmeisterin einmal gebannt werden, kann sich Jinjiao wie jeder andere professionelle AD-Carry anpassen. Er hat in seiner Karriere auch schon mit Ashe, Lucian und einmal sogar mit Kog’Maw gespielt.\nJinjiao ist ein ADC, der von seinem Supporter abhängig ist – er ist dafür bekannt, unglaubliche Schadensmengen auszuteilen, wenn er mit einem defensiven Supporter auf der Lane ist, der ihn unterstützt und ihm riskante Spielzüge ermöglicht. Jetzt, wo Jinjiao in I MAY ein neues Zuhause gefunden hat und mit Road an seiner Seite zur Weltmeisterschaft fährt, sind alle Siegesbedingungen erfüllt.</p>","es_AR":"<p>Xie \"Jinjiao\" Jin-Shan jugó tanto en la LSPL como en la LPL antes de encontrar su hogar en el plantel de I MAY. Este ADC se inclina por Jhin y Sivir, con los que jugó en 12 y 11 partidas respectivamente durante el torneo de clausura de la LPL 2016. Pero al igual que otros ADC profesionales, si le sacas a el Virtuoso y la Señora de la Batalla, Jinjiao se adapta igual. Ha jugado con Ashe y Lucian, y hasta usó a Kog’Maw en algunas partidas durante su carrera.</p>\n\n<p>Jinjiao es un ADC que vive exclusivamente de su soporte. Es conocido por infligir una enorme cantidad de daño cuando se lo pone a la par de un soporte defensivo que pueda cubrirlo y permitirle hacer sus jugadas riesgosas. Ahora que Jinjiao ha encontrado su hogar en I MAY y se dirige al Campeonato Mundial con su soporte Road, puede decirse que ha logrado la condición de ganador.</p>","pt_BR":"<p>Xie \"Jinjiao\" Jin-Shan já jogou na LSPL e na LPL, e encontrou um lar no elenco da I MAY. Esse Atirador prefere Jhin e Sivir e jogou com eles em 12 e 11 jogos respectivamente na Etapa de Verão de 2016 da LPL. Mas como vários outros Atiradores profissionais, se o Virtuoso e a Mestra da Batalha não estiverem disponíveis, Jinjiao se adapta. Ele já jogou com Ashe e Lucian, e até já se aventurou com Kog’Maw em alguns jogos da sua carreira.</p>\n\n<p>Jinjiao é um Atirador que vive e morre ao lado do seu suporte - ele é conhecido por causar uma quantidade de dano impressionante quando joga em parceria com um suporte defensivo que o proteja e possibilite suas jogadas arriscadas. Agora que Jinjiao encontrou seu lar na I MAY e está a caminho do Mundial com Road como suporte, ele finalmente está em condições de vencer.</p>"},"foreignIds":{"drupalId":"4215","TRLH1":"1001380048","TRLH2":"1001280018"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":573,"slug":"swift","name":"Swift","firstName":"Da-hun","lastName":"Baek","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/swift-8ph5i88w.png","hometown":"South Korea","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:02:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nDa-hoon « Swift » Baek est l'un des jeunes talents les plus dynamiques de la LPL. Depuis qu'il a rejoint QiaoGu, Swift a démontré qu'il était effectivement plus vif que ses adversaires. Swift est un véritable maître quand il s'agit de deviner les coups de l'adversaire, et parfois on a même l'impression qu'il a deux coups d'avance sur eux.\n</p>\n<p>\nPour ses débuts lors du Segment d'été des LPL 2015, Swift a démontré qu'il pouvait non seulement profiter pleinement d'un avantage pour ses coéquipiers, mais aussi qu'il pouvait farmer et déjouer la plupart des autres junglers. Son parcours dans la jungle est toujours un peu plus efficace et il arrive toujours le premier sur les ganks. Son farming est également toujours quelques PO en avance, ce qui lui permet d'acheter les gros objets en premier. Son armure est aussi un peu plus brillante et lui permet d'absorber un peu plus des rayons gamma du soleil, et donc de balancer son super uppercut de l'aigle majestueux qui projette ses ennemis dans la stratosphère. \n</p>","pl_PL":"<p>\nDa-hoon „Swift” Baek jest jednym z najprężniej rozwijających się młodych talentów w LPL. Dołączywszy do Qiao Gu, Swift udowodnił, że – jak wskazuje jego ksywka – jest zdecydowanie szybszy od konkurentów (niezbyt wysoko ustawiona poprzeczka). Swift jest absolutnym mistrzem, jeśli chodzi o przewidywanie posunięć swoich przeciwników. Chwilami można by odnieść wrażenie, że wyprzedza ich o dwa kroki.\n</p>\n<p>\nDebiutując w letnim splicie 2015 LPL, Swift udowodnił, że nie tylko potrafi wykorzystać przewagę swojej drużyny, ale też zdobyć więcej złota i pokonać większość dżunglerów. W dżungli radzi sobie lepiej niż pozostali, w związku z tym zazwyczaj jako pierwszy zastawia zasadzki. Zawsze ma na koncie o kilka zabitych stworów więcej, dzięki czemu ma okazję kupować potężne przedmioty jako pierwszy. Jego pancerz jest nieco jaśniejszy od innych, dzięki czemu pochłania więcej promieniowania gamma, co sprawia, iż staje się supersilny i jest w stanie wybijać przeciwników na orbitę za pomocą potężnego ciosu wzlatującego orła. \n</p>"},"foreignIds":{"drupalId":"1014"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":577,"slug":"tct","name":"Mor","firstName":"Hong-Wei","lastName":"Zhang","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/tct-9wpmbdee.png","hometown":"China","region":"LPL","birthdate":"","createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-06T23:51:17.000Z","bios":{"en_US":"","fr_FR":"<p>\nLes fans des LCS NA reconnaîtront peut-être en Zhang « TcT » Hong Wei l'ancien support des LMQ, dont le pseudo était Mor. Lors de sa première année en ligue nord-américaine, il est passé avec le reste des LMQ des séries Challenger NA aux LCS NA, pour aller jusqu'au Championnat du monde de la Saison 4. À l'époque, on avait remarqué TcT pour son style de jeu désintéressé, toujours prêt à se sacrifier pour permettre à un de ses coéquipiers de survivre.\n</p>\n<p>\nMais quand LMQ a échoué à franchir les phases de groupe pour le Championnat du monde, TcT a décidé de retourner en Chine et de recommencer à jouer avec son ancien partenaire de duo, TcT, chez QiaoGu. Leur combo sur la voie du bas s'est épanouie, notamment grâce à leurs intenses sessions d'entraînement. Il n'est pas rare qu'ils se lèvent à 5 heures du matin pour jouer ensemble en file duo. Avec l'aide de TnT, TcT a perdu cette mentalité de chair à canon qu'il avait développée dans les ligues NA. Il choisit maintenant des champions qui offrent de vraies options de désengagement, comme Janna, qui lui permettent de protéger ses coéquipiers sans devoir mourir en boucle. Oh, et de parvenir au passage à un joli KDA.\n</p>","pl_PL":"<p>\nFani PA LCS znają zapewne Zhanga „TcT” Hong Weia, byłego zawodnika wsparcia LMQ, wówczas posługującego się ksywką Mor. W trakcie pierwszego roku rozgrywek północnoamerykańskich razem z resztą LMQ zdołał awansować z serii pretendentów do PA LCS, a potem do Mistrzostw Świata Sezonu Czwartego. TcT znany był wówczas z ofiarnego stylu gry – zawsze gotów był poświęcić swoje życie, by ratować kolegów z drużyny.\n</p>\n<p>\nGdy LMQ nie zdołało przejść przez grupowy etap mistrzostw świata, TcT postanowił wrócić do Chin i ponownie dołączyć do swojego dawnego partnera z drużyny Qiao Gu. Wspólnymi siłami zaczęli dominować w dolnej alei, co było zasługą przede wszystkim regularnych treningów. Zdarzało im się wstawać o piątej rano, by rozegrać mecz w duecie. Z pomocą TnT, TcT oduczył się odgrywania roli kozła ofiarnego, której nauczył się Ameryce Północnej. Obecnie wybiera bohaterów skutecznie wycofujących się z walki, takich jak Janna, co pozwala mu chronić kolegów z drużyny, unikając jednocześnie śmierci. Aha, jego stosunek zabić do zgonów znacznie na tym zyskał.\n</p>"},"foreignIds":{"drupalId":"4524"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":582,"slug":"v","name":"V","firstName":"Bo","lastName":"Bao","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/v-d6ylt7bf.png","hometown":"China","region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:06.000Z","updatedAt":"2017-06-07T00:01:54.000Z","bios":{"en_US":"","fr_FR":"<p>\nBao « V » Bo est un top discret mais particulièrement doué. Le top de QiaoGu a commencé le Segment d'été des LPL 2015 avec des champions de type carry, comme Irelia, mais il a depuis fait machine arrière. Il joue maintenant ce dont son équipe a besoin. Si les tanks sont dans la meta, il va jouer tank. Si les mages sont dans la meta, il va jouer mage. Ses choix ont fini par se rapprocher de sa tendance discrète à rentrer dans le rang.\n</p>\n<p>\nPour ce qui est de la cohésion de son équipe, QiaoGu a fait le choix, heu... classieux de leur faire tous se teindre les cheveux en même temps. V a suivi sa nature profonde et a choisi de se teindre les cheveux dans une teinte châtain, alors que ses coéquipiers ont choisi des violets vifs et des verts flashy. Il est sans doute le moins bruyant de son équipe, mais ça ne l'empêche pas de dominer sur sa voie. Même si lui, il n'a pas l'élément « GOD » dans son pseudo.\n</p>","pl_PL":"<p>\nBao „V” Bo jest cichym, ale utalentowanym zawodnikiem górnej alei. Zaczynał podczas letniego splitu 2015 LPL, korzystając z bohaterów prowadzących, takich jak Irelia, od tamtej pory zarzucił jednak podejście, jakiego nabrał w czasach kolejki solowej. Teraz gra tak, jak chce jego drużyna. Jeśli potrzebni są obrońcy, będzie grać obrońcami, jeśli magowie – wybierze magów. Swoje wybory zaczął dostosowywać do oczekiwań drużyny, co z uwagi na jego charakter nie było dla niego problemem.\n</p>\n<p>\nW kwestii budowania poczucia więzi w drużynie Qiao Gu zdecydowali się postawić na, ekhm, styl i solidarnie ufarbować włosy. V postąpił zgodnie ze swoją naturą, wybierając zachowawczy odcień brązu, gdy koledzy z zespołu zdecydowali się na krzykliwą purpurę i neonową zieleń. Choć w drużynie nieczęsto zabiera głos, nie przeszkadza mu to być jednym z najbardziej dominujących zawodników w alejach. Kto by pomyślał?\n</p>"},"foreignIds":{"drupalId":"4526"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":707,"slug":"skye","name":"Skye","firstName":"Qi-Fang","lastName":"Fan","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/skye-8gfzbr83.png","hometown":null,"region":"LPL","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-06-06T23:57:13.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"3771"},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":974,"slug":"athena","name":"Athena","firstName":"Ha-woon","lastName":"Kang","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/athena-2yuxd9y6.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T20:39:28.000Z","updatedAt":"2017-06-06T23:34:39.000Z","bios":{"en_US":"","de_DE":"<p>Athena ist dank seiner Zeit bei der koreanischen Mannschaft Ever einer der bekanntesten Spieler bei I MAY. Nach der Weltmeisterschaft in Saison 5 setzte Ever mit einem 2–0 Sieg beim LoL KeSPA Cup 2015 über SKTelecom T1 ein Ausrufezeichen und konnte am Ende mit einem 3–0 Sieg über CJ Entus sogar den Titel gewinnen. Doch nach diesem Erfolg verschwand Athena aus dem Rampenlicht. Für manche Fans war er eher Pawns Ersatz als ein eigenständiger Spieler. Aber dann heuerte er bei I MAY an.</p>\n\n<p>Athena war eine Schlüsselfigur beim kometenhaften Aufstieg der Mannschaft, die es in einem Split von der LSPL zur Weltmeisterschaft geschafft hatte. Er agiert lieber aus den hinteren Reihen, anstatt mit Assassinen oder robusten Champions in die Schlacht zu ziehen. Athena wird versuchen, allen zu beweisen, dass er ein eigenständiger Mid-Laner ist, der sich nicht in Pawns Schatten verstecken muss. Er ist einer der Veteranen in der Mannschaft und er weiß genau, wie hart es wird – aber er ist gerüstet und bereit, seinen Wert auf der größten Bühne der Welt unter Beweis zu stellen.</p>","es_AR":"<p>Athena es uno de los jugadores más conocidos del equipo de novatos de I MAY, gracias a su paso por el equipo coreano Ever. Después del Campeonato Mundial de la temporada 5, Ever pasó a la historia al derrotar a SKTelecom T1 por 2-0 en la Copa KeSPA de LoL en el 2015, para luego llevarse el campeonato entero con una victoria por 3-0 ante CJ Entus. Desde ese éxito inicial, Athena pasó a tener una presencia débil. Algunos simpatizantes lo veían más como un sustituto de Pawn que como un jugador hecho y derecho. Hasta que se unió a I MAY.</p>\n\n<p>Athena fue fundamental en el ascenso astronómico del equipo de la LSPL al Campeonato Mundial en un solo torneo. Se lo conoce mucho por su contribución desde la retaguardia, lanzando hechizos con campeones de golpes en lugar de dirigirse a la escaramuza con personajes asesinos o tanques. Athena intentará probar que es un carrilero central digno de ver, y no solo un rostro opacado por la figura de Pawn. Como uno de los veteranos del equipo, sabe lo dura que será lucha, pero, aún así, está preparado y listo para probar su valía en el escenario mundial.</p>","pt_BR":"<p>Athena é um dos jogadores mais conhecidos do elenco de calouros da I May, graças à sua equipe coreana, Ever. Depois do Campeonato Mundial de 2015, a Ever deixou sua marca ao derrotar a SKTelecom T1 por 2 a 0 na KeSPA Cup 2015, para no final levar o campeonato com uma vitória de 3 a 0 sobre a CJ Entus. Depois daquele sucesso inicial, Athena caiu no esquecimento. Alguns torcedores o viam mais como o substituto de Pawn do que como um jogador com méritos próprios. Foi aí que ele entrou na I MAY.</p>\n\n<p>Athena foi essencial para a ascensão meteórica da equipe, que saiu da LSPL para o Mundial em apenas uma Etapa. Ele é conhecido por suas contribuições na retaguarda, lançando feitiços em campeões de assalto em vez de entrar na briga com assassinos ou tanques. Athena tentará provar que ele é um jogador de meio que vale a pena ser observado, e não só um rostinho colado à sombra de Pawn. Como um dos veteranos da equipe, ele sabe que vai ser muito difícil - mas ele também está preparado e ponto para provar seu valor no palco mundial.</p>"},"foreignIds":{"TRLH1":"1001380047","TRLH2":"1001280017"},"socialNetworks":{},"champions":[{"id":213,"playerId":974,"championId":268,"championKey":"Azir","championName":"Azir","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":214,"playerId":974,"championId":81,"championKey":"Ezreal","championName":"Ezreal","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"},{"id":215,"playerId":974,"championId":112,"championKey":"Viktor","championName":"Viktor","createdAt":"2016-01-06T20:41:49.000Z","updatedAt":"2017-06-06T23:34:39.000Z"}],"liveGameTeam":218},{"id":1051,"slug":"flawless","name":"Flawless","firstName":"Yeon-joon","lastName":"Seong","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/flawless-5i9ua7sb.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:20:35.000Z","updatedAt":"2017-02-23T00:52:00.000Z","bios":{},"foreignIds":{"TRKR1":"225085"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1278,"slug":"road","name":"Road","firstName":"Hankil","lastName":"Yoon","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/road-hcih3cbd.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:27:35.000Z","updatedAt":"2017-06-06T23:42:38.000Z","bios":{"en_US":"","de_DE":"<p>Ein paar der legendärsten Supporter in League fahren zur Weltmeisterschaft 2016 und Yun „Road“ Han-gi ist gleich in seinem ersten Jahr mit dabei. Und er hofft immer noch, dass er sich einen Namen machen kann. Road hat sich an Jinjiao, den erfahreneren Spieler auf seiner Lane, angepasst und sich zu einem defensiven Supporter entwickelt, der seinem ADC immer den Rücken freihält. Road, der bei den Fans nach der überraschenden Auswahl von Leona während des Mid-Season Invitational noch beliebter geworden sein dürfte, spielt am liebsten den strahlenden Sonnenaufgang sowie Thresh und Braum. \nAber egal, welchen Champion Road auswählt, er hat eine schwierige Aufgabe vor sich. Er ist immer noch ein Anfänger und fährt mit einer Mannschaft, die sich gerade erst für die LPL qualifizieren konnte, zur Weltmeisterschaft. Sein Name war niemals passender, dann er ist kurz davor, den wichtigsten Weg seines Lebens anzutreten.</p>","es_AR":"<p>Algunos de los soportes más legendarios de League of Legends se dirigen al Campeonato Mundial 2016, y Yun \"Road\" Han-gi se les unirá en su torneo de novatos. En esta ocasión, espera hacer historia. Road ha sabido complementarse con el jugador más experimentado del carril, Jinjiao, y se ha convertido en un soporte defensivo que siempre cuenta con un ADC que lo cubre. Los simpatizantes que lo vitorearon ante su sorpresiva elección de Leona en el Torneo por Invitación de Mitad de Temporada comienzan a identificarse con él. Se lo conoce más por inclinarse por el Radiante Amanecer, como también Thresh y Braum.</p>\n\n<p>Sin importar el campeón que elija, Road tiene un duro camino por delante. Sigue siendo un novato que va al Campeonato Mundial con un equipo que simplemente clasificó para la LPL. Su nombre no podría ser más adecuado, ya que este será el recorrido más importante en toda su carrera.</p>","pt_BR":"<p>Alguns dos suportes mais lendários de League estarão no Mundial 2016 e Yun \"Road\" Han-gi estará junto a eles em sua Etapa de estreia. E ele espera conseguir deixar sua marca. Road aprendeu a se entrosar com o jogador mais experiente da sua rota, Jinjiao, e se tornou um suporte defensivo que está sempre preparado para proteger seu Atirador. Os torcedores que gostaram a escolha surpresa de Leona no MSI vão gostar de Road; ele é conhecido por preferir a Alvorada Radiante, bem como Thresh e Braum.</p>\n \n<p>Não importa que campeão ele escolha, Road tem um caminho difícil pela frente. Ele ainda é um calouro indo para o Mundial com uma equipe que acabou de se classificar para a LPL. Seu nome nunca foi tão oportuno, pois esse é o caminho mais importante que ele já trilhou.</p>"},"foreignIds":{"TRLH1":"1001380049","TRLH2":"1001280019"},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1283,"slug":"happyy","name":"Happy","firstName":"Rui","lastName":"Yu","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2016-05-18T23:34:16.000Z","updatedAt":"2017-01-09T23:01:46.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1643,"slug":"ben4","name":"Ben4","firstName":"Xincheng","lastName":"Tu","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ben4-6j90qcxn.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:24:59.000Z","updatedAt":"2017-06-06T23:34:22.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1648,"slug":"lwx","name":"Lwx","firstName":"Weixiang","lastName":"Lin","roleSlug":"adcarry","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T22:53:31.000Z","updatedAt":"2017-01-09T22:53:31.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1651,"slug":"pinus","name":"Pinus","firstName":"Qingsong","lastName":"Liu","roleSlug":"support","photoUrl":null,"hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:02:32.000Z","updatedAt":"2017-01-09T23:02:32.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77},{"id":1983,"slug":"starlight","name":"Starlight","firstName":"Shun-Jie","lastName":"Li","roleSlug":"support","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:39:34.000Z","updatedAt":"2017-06-06T23:39:34.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":218},{"id":1986,"slug":"hanxuan","name":"HanXuan","firstName":"Hao","lastName":"Hong","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:53:06.000Z","updatedAt":"2017-06-06T23:53:06.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":77}],"scheduleItems":[{"id":"AVTGvJf1oUG4HPFjOJ_X","content":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:match:e7a351ee-b953-4d89-92c9-cd0e3620e971","scheduledTime":"2016-06-24T09:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","blockLabel":"5","subBlockLabel":"2","blockPrefix":"week","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:bracket:af2a82ed-c2c7-40d1-bfb3-a1d541899994"},"match":"e7a351ee-b953-4d89-92c9-cd0e3620e971","tournament":"ba033b9a-1fb9-49fb-ae33-0e24979ce1c0","bracket":"af2a82ed-c2c7-40d1-bfb3-a1d541899994","league":"7"}],"gameIdMappings":[],"videos":[{"id":3391,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:5d182462-e584-42ad-8b8b-a1a2e60c5150","source":"https://www.youtube.com/embed/qDZ5Jjbn0r0?wmode=transparent&start=2553","createdAt":"2016-06-25T00:45:41.000Z","updatedAt":"2016-06-25T00:45:41.000Z","game":"5d182462-e584-42ad-8b8b-a1a2e60c5150"},{"id":3392,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:ba033b9a-1fb9-49fb-ae33-0e24979ce1c0:game:ff397576-6219-4a25-ba71-0b13c3b96b90","source":"https://www.youtube.com/embed/qDZ5Jjbn0r0?wmode=transparent&start=6082","createdAt":"2016-06-25T00:45:55.000Z","updatedAt":"2016-06-25T00:45:55.000Z","game":"ff397576-6219-4a25-ba71-0b13c3b96b90"}],"htmlBlocks":[],"match":{"id":"e7a351ee-b953-4d89-92c9-cd0e3620e971","name":"IM-vs-NB","position":53,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"},{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}],"games":{"4addc6d6-67e2-497d-8fcd-a87708346edc":{"id":"4addc6d6-67e2-497d-8fcd-a87708346edc","name":"G3","generatedName":"IM|NB|G3|e7a351eeb9534d8992c9c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"},{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"5d182462-e584-42ad-8b8b-a1a2e60c5150":{"id":"5d182462-e584-42ad-8b8b-a1a2e60c5150","name":"G1","generatedName":"IM|NB|G1|e7a351eeb9534d8992c9c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"},{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],"standings":{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466815378655,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466804050001,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466802836356,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466778386301,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"ff397576-6219-4a25-ba71-0b13c3b96b90":{"id":"ff397576-6219-4a25-ba71-0b13c3b96b90","name":"G2","generatedName":"IM|NB|G2|e7a351eeb9534d8992c9c","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"},{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}],"standings":{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466815392481,"source":"manual","note":"Updated from HQ 2","history":[{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466804052884,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466802872858,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466778092701,"source":"manual","note":"Updated from HQ 2","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466778390463,"source":"manual","note":"Updated from HQ 2","closed":true}],"closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466815392481,"source":"bestOf","history":[{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466815378656,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466804052885,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466804050001,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466802872858,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466802836357,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466778092701,"source":"bestOf","closed":true},{"result":[[{"roster":"39554053-1d29-4e8b-9021-20a7c651e646"}],[{"roster":"46433fdd-d0e4-4bc2-a1c9-535c229e43ae"}]],"timestamp":1466778390463,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"46433fdd-d0e4-4bc2-a1c9-535c229e43ae":0,"39554053-1d29-4e8b-9021-20a7c651e646":1}}}