{"teams":[{"id":41,"slug":"edward-gaming","name":"Edward Gaming","guid":"be6c9fdc-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/edward-gaming-52bsed1a.png","acronym":"EDG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2014-09-16T22:34:46.000Z","updatedAt":"2017-06-06T23:12:52.000Z","bios":{"en_US":"Coach: Nocheor \"Nofe\" Jeong","fr_FR":"Edward Gaming a été fondée en en 2013 dans le but de devenir la première organisation e-sport de Chine. EDG a bâti une équipe en partant de zéro dans l'espoir de s'opposer aux meilleures équipes mondiales de League of Legends. EDG a balayé la concurrence dès ses débuts en LPL pour finir en tête du championnat régional chinois en 2014. EDG entend maintenant atteindre son objectif initial, obtenir le trophée du Championnat du monde de League of Legends.","pl_PL":"Edward Gaming zostało założone w 2013 roku w celu utworzenia potężnej organizacji E-sportowej w Chinach. EDG utworzyło drużynę, która miała na celu rywalizację z najlepszymi drużynami League of Legends z całego świata. Nazywane „superdrużyną” EDG przebiło się przez LPL w swoim debiutanckim splicie i zostało regionalnymi mistrzami Chin w 2014 roku. Teraz EDG pragnie osiągnąć cel, do którego zostało powołane – zdobycie trofeum mistrzostw świata League of Legends.","de_DE":"<p>Edward Gaming ist eine der berühmtesten chinesischen Mannschaften, die seit September 2013 in der professionellen „League of Legends“-Szene vertreten ist. Die Mannschaft feierte immer wieder Erfolge wie den Titel beim Sommer-Split der LPL 2014. Außerdem konnten sie sich mit einem 3–2 Sieg über SKT T1 im Finale des Mid-Season Invitational 2015 auch einen internationalen Titel sichern. Die Mannschaft beendete die Sommer-Saison der LPL 2015 mit 14 Siegen, 2 Niederlagen und 6 Unentschieden. Doch trotz der Erfolgreichen Geschichte der Mannschaft, konnten sie bei der Weltmeisterschaft noch kein Ausrufezeichen setzen. Dieses Mal haben sie sich jedoch gut vorbereitet und fahren mit ein paar der berühmtesten Spieler der Welt zum Turnier. Seit dem MSI wissen sie, wie sich ein Sieg auf einer internationalen Bühne anfühlt und jetzt wollen sie diesen Erfolg bei der Weltmeisterschaft wiederholen.</p>","es_ES":"<p>Edward Gaming es uno de los equipos chinos más famosos, ya que comenzó su periplo profesional en League of Legends en septiembre de 2013. Gozan de un buen historial de éxitos, entre ellos el acabar en lo más alto del split de verano de la LPL en 2014. También tienen en sus vitrinas un importante título internacional, el MSI 2015, el cual consiguieron tras ganar la final a SKT T1 por 3 a 2. El equipo obtuvo un registro de 14-2-6 en la temporada de verano de la LPL en 2015. Pero, a pesar de los éxitos que han conseguido durante su larga carrera como equipo, aún no han dejado su huella en el Mundial. Esta vez llegan a la competición preparados, con algunos de los mejores y más famosos jugadores del mundo. Ya saborearon las mieles del éxito en un escenario internacional en el MSI y ahora quieren repetir esa hazaña en el Mundial.</p>","pt_BR":"A Edward Gaming é uma das mais reconhecidas equipes da China, tendo estreado no cenário profissional de League of Legends em setembro de 2013. A equipe já contabiliza vários sucessos, incluindo um primeiro lugar na Etapa de Verão da LPL em 2014. Eles também alcançaram uma grande conquista internacional com o título do Midseason Invitational 2015, batendo a SKT T1 por 3 a 2. A equipe estabeleceu um recorde de partidas de 14-2-6 na Temporada de Verão 2015 da LPL.  Apesar das conquistas ao longo da trajetória, a equipe ainda precisa deixar sua marca registrada no Mundial. Dessa vez eles entram na competição preparados e contando com alguns dos melhores e mais celebrados jogadores do mundo. Eles já sentiram o gostinho do primeiro lugar no palco internacional antes do MSI e agora estão ansiosos para repetir a dose no Mundial.","es_AR":"<p>Edward Gaming es uno de los equipos chinos más fácilmente reconocibles que por primera vez se sumó al profesionalismo de League of Legends en septiembre del 2013. El equipo tuvo su cuota de éxitos, incluido el primer lugar en el torneo de clausura 2014 de la LPL. También alcanzó un importante éxito internacional imponiéndose en el MSI 2015, con una serie 3-2 contra SKT T1. Además disfrutó de un récord de 14-2-6 en la temporada de verano 2015 de la LPL. A pesar de los éxitos alcanzados durante todo este tiempo como equipo, aún le queda lograr una importante marca en el Mundial. Esta vez entrará en la competencia más preparado que nunca, con algunos de los jugadores más celebrados y destacados del mundo. Ya tuvo oportunidad de disfrutar del primer lugar en la escena internacional en el MSI; ahora están ansiosos por repetir ese éxito en el Mundial.</p>\n\n<p><strong>Entrenador: Jung \"RapidStar\" Min-sung</strong></p>"},"foreignIds":{"drupalId":"1847"},"players":[291,330,334,509,1032,1170,1972],"starters":[291,330,334,1032,1170],"subs":[509,1972]},{"id":79,"slug":"invictus-gaming","name":"Invictus Gaming","guid":"be6dfd0e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/invictus-gaming-cnnnfwdo.png","acronym":"IG","homeLeague":"urn:rg:lolesports:global:league:league:7","altLogoUrl":null,"createdAt":"2015-06-02T23:16:06.000Z","updatedAt":"2017-06-06T23:30:22.000Z","bios":{"en_US":"","fr_FR":"Invictus Gaming piaffe devant la porte de la gloire depuis si longtemps que l'équipe paraît presque frappée d'une malédiction. Au cours des deux dernières années, ils sont arrivés quatre fois 3e aux finales régionales ou aux play-offs de printemps de la LPL. Cependant, avec l'aide de joueurs dynamiques comme KaKAO et RooKie, Invictus va peut-être enfin briser la malédiction et parvenir au sommet.","pl_PL":"Invictus Gaming przez tak długo znajdowało się na krawędzi osiągnięcia sukcesu, że można pomyśleć, że drużyna jest przeklęta. Zajęli 3. miejsce podczas wiosennych playoffów LPL / finałów regionalnych 4 razy w ciągu ostatnich dwóch lat. Jednakże dzięki dołączeniu tak utalentowanych graczy, jak KaKAO i Rookie być może Invictus wreszcie przełamie klątwę i wywalczy sobie drogę na szczyt tabeli.","de_DE":"Invictus Gaming schwebte lange Zeit an der Grenze zum Erfolg, sodass es schien, sie seien verflucht. In zwei Jahren brachten sie viermal den dritten Platz in den LPL Spring Playoffs/Regional Finals nach Hause. Aber vielleicht schafft es diesmal Invictus, mit den dynamischen Talenten wie KaKAO und RooKie, den Fluch zu durchbrechen und sich den ganz Großen anzuschließen.","es_ES":"Invictus Gaming se ha quedado tantas veces a la puertas de la gloria que casi parece que están gafados. Han quedado en tercera posición en los Playoffs de primavera de la LPL y en las finales regionales de China cuatro veces en los dos últimos años. Aunque con los fichajes de los coreanos KaKAO y RooKie, quizás Invictus va a romper la maldición definitivamente y a hacerse un hueco entre los mejores equipos del mundo.","pt_BR":"A Invictus Gaming se aproximou da consagração tantas vezes, que até parece um time amaldiçoado. Eles ficaram em terceiro lugar nas Regionais e Eliminatórias da LPL quatro vezes nos últimos dois anos. Talvez agora, com a chegada de pequenos monstros como KaKAO e RooKie, eles consigam quebrar a maldição e chegar entre os grandes do Mundial. \n"},"foreignIds":{"drupalId":"632"},"players":[122,519,522,1664,1871,1980,1981,1982],"starters":[122,519,522,1664,1871],"subs":[1980,1981,1982]}],"players":[{"id":122,"slug":"duke","name":"Duke","firstName":"Hoseong","lastName":"Lee","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/duke-e8izehd9.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:53.000Z","updatedAt":"2017-06-06T23:30:15.000Z","bios":{"en_US":"","es_AR":"<p>Ho-seong \"Duke\" Lee ha sido parte de la escena coreana desde el 2013. Al comienzo, jugaba bajo el nombre de \"Leopard\", pero lo cambió a Duke luego de unirse a NaJin Black Sword. Después de la fusión con NaJin, Duke se convirtió en el carrilero superior inicial de NaJin e-mFire, grupo formado poco tiempo antes. Aunque los resultados del equipo fueron muy variados, Duke fue considerado uno de los mejores carrileros superiores de Corea. Luego de más resultados regulares, Duke dejó la organización NaJin a finales del 2015.</p>\n\n<p>Poco después de su partida de NaJin, SKTelecom sumó a Duke para que ocupe el lugar de uno de los mejores carrileros superiores en el 2015, MaRin, luego de que este se fuera a jugar a China. A pesar de que Duke y compañía tuvieron un mal arranque del 2016, encontraron el equilibrio y terminaron adjudicándose el trofeo del torneo de apertura de la LCK 2016. Incluso con la descalificación temprana de SKTelecom en las eliminatorias del torneo de clausura de la LCK 2016, sus esperanzas están puestas en lo más alto de todo: el Mundial. Con su reservada forma de ser, Duke jamás lo aceptaría, pero es uno de los carrileros superiores más emocionantes de Corea, ¡y no se llama Smeb! Valdrá mucho la pena seguirlo en el Mundial.</p>","fr_FR":"<p>Ho-seong « Duke » Lee est présent sur la scène coréenne depuis 2013. Il jouait alors sous le nom de « Leopard », mais il a changé son surnom pour devenir « Duke » après avoir rejoint NaJin Black Sword. Après la fusion de NaJin, Duke a pris la position de toplaner titulaire au sein de l'équipe nouvellement créée des NaJin e-mFire. Même si les résultats de cette nouvelle escouade ont été mitigés, Duke a été perçu comme l'un des meilleurs toplaners de Corée. Voyant que les résultats restaient peu convaincants, Duke a décidé de quitter l'organisation NaJin fin 2015.</p>\n\n<p>Peu après son départ de NaJin, SKTelecom s'est tournée vers Duke pour qu'il reprenne le flambeau de l'un des plus grands toplaners de 2015, MaRin, après son départ vers la Chine. Bien que Duke et ses nouveaux coéquipiers aient quelque peu lutté au début de l'année 2016, ils ont trouvé leurs marques au fil des semaines. C'est à l'approche de la fin du segment de printemps que Duke a finalement développé tout son talent : le timing parfait pour révéler tout son potentiel. Après avoir éliminé les ROX Tigers pour décrocher la couronne du tournoi Champions Spring 2016, Duke va enfin avoir la chance de remporter un deuxième trophée international depuis qu'il a rejoint SKTelecom. Avec sa nature réservée, Duke ne vous le dirait probablement jamais lui-même, mais il est l'un des toplaners les plus en vue de Corée. À votre place, on garderait un œil sur lui.</p>\n","de_DE":"<p>Ho-seong „Duke“ Lee ist bereits seit 2013 Teil der koreanischen Szene. Ursprünglich unter dem Namen „Leopard“ bekannt, wechselte er seinen Namen zu „Duke“, als er den NaJin Black Swords beitrat. Nachdem sich NaJin zusammenschloß, wurde Duke zu einem festen Mitglied als Top-Laner in der Startformation des neu geformten NaJin e-mFire-Teams. Obowohl die Ergebnisse des Teams eher gemischter Natur waren, wurde Duke stets als einer der besten Top-Laner Koreas bezeichnet und als sich die bescheidenden Resultate von NaJin fortsetzten, verließ er NaJin Ende 2015.</p>\n\n<p>Kurz nach seinem Abgang von NaJin wendete sich SKTelecom an Duke und bat ihn, in die Fußstapfen von MaRin, dem besten Top-Laner 2015, zu treten, der nach China gewechselt war. Obwohl Duke und seine Kameraden zu Beginn des Jahres Probleme hatten, fanden sie wieder in die Spur und gewannen den Frühjahrs-Split der LCK 2016. Trotz des frühen Ausscheidens von SKTelecom beim Sommer-Split der LCK 2016 sind die Erwartungen für die Weltmeisterschaft hoch. Duke ist zurückhaltend und würde so etwas nie selbst sagen, aber er ist neben Smeb einer der interessantesten Top-Laner in Korea. An deiner Stelle würde ich ihn bei der WM im Auge behalten.</p>","pl_PL":"<p>Ho-seong „Duke” Lee występuje na koreańskiej scenie od 2013 roku. Zaczynał grać pod ksywką „Leopard”, ale zmienił ją na „Duke” po dołączeniu do NaJin Black Sword. Po połączeniu NaJin, Duke został początkowym górnym w nowoutworzonym NaJin e-mFire. Mimo że wyniki drużyny były przeciętne, Duke był uznawany za jednego z najlepszych górnych w Korei, a po kolejnych podobnych rezultatach Duke opuścił organizację NaJin pod koniec 2015 roku.</p>\n\n<p>Wkrótce po tym SKTelecom odezwało się do Duke'a, aby zastąpił jednego z najlepszych górnych 2015 roku, MaRina, gdy ten odszedł, aby grać w Chinach. Mimo że Duke i reszta mieli problemy na początku 2016 roku, wraz z upływem czasu zaczęli radzić sobie coraz lepiej. Pod koniec wiosennego splitu Duke wreszcie się rozkręcił i to akurat w idealnym czasie. Po pokonaniu ROX Tigers podczas Champions Spring 2016, Duke ma teraz szansę na zdobycie drugiego międzynarodowego trofeum od kiedy dołączył do SKTelecom. Ze względu na swoją skromność, Duke nigdy by tego nie powiedział, ale jest jednym z najbardziej ekscytujących graczy z Korei. Na waszym miejscu obserwowalibyśmy go uważnie.</p>\n","es_ES":"<p>Ho-seong ''Duke'' Lee lleva siendo parte del panorama coreano desde 2013. Antes jugaba bajo el nombre de \"Leopard\", pero cuando llegó a NaJin Black Sword decidió cambiarse el nombre a Duke. Tras la fusión de equipos, Duke se convirtió en el top inicial de NaJin e-mFire. A pesar de que los resultados del equipo eran bastante mixtos, Duke fue considerado uno de los mejores top de Corea, y terminó dejando NaJin a finales de 2015.</p>\n\n<p>Tras dejar NaJin, SKTelecom le pidió a Duke que llenara el vacío que había dejado MaRin, uno de los mejores jugadores de la calle superior de 2015, que había abandonado el equipo para jugar en China. Aunque Duke y compañía lo pasaron mal a principios de 2016, recuperaron fuerzas y se llevaron el trofeo del split de primavera de la LCK 2016 a casa. Puede que SKTelecom tuviese que abandonar antes de lo previsto tras perder en los playoffs del split de verano de la LCK 2016, pero las esperanzas de ganar el Mundial siguen siendo altas. Al ser tan reservado, él nunca os lo diría, pero Duke es uno de los top más prometedores de Corea, aparte de Smeb. Os aconsejamos que sigáis su progreso en el Campeonato Mundial de cerca.</p>","pt_BR":"<p>Ho-seong “Duke” Lee tem participado do cenário coreano desde 2013. Jogando a princípio sob o nome de “Leopard”, ele mudou seu nome para “Duke” quando entrou para a NaJin Black Sword. Depois da união da NaJin, Duke se tornou o topo titular da recém-formada NaJin e-mFire. Apesar dos resultados da equipe terem sido inconsistentes, Duke era visto como um dos melhores topos da Coreia, mas depois de constantes resultados medianos, Duke decidiu sair da formação da NaJin no final de 2015.</p>\n\n<p>Logo depois de sua saída da NaJin, Duke foi chamado pela SK Telecom para substituir um dos melhores topos de 2015, MaRin, após sua saída para jogar na China. Apesar de Duke e seus companheiros terem sofrido um pouco no início de 2016, eles conseguiram encontrar sua sintonia e terminaram levando para casa o troféu da Etapa de Primavera da LCK 2016. Mesmo com a saída precoce da SKT nas eliminatórias da Etapa de Verão da LCK 2016, as esperanças ainda são altas para o Mundial. Tendo uma natureza reservada, Duke provavelmente nunca falaria isso, mas ele é um dos topos mais promissores da Coreia que não tem o nome de Smeb. Eu ficaria de olho nele no Mundial se fosse você.</p>"},"foreignIds":{"drupalId":"2811","TRKR1":"225039","TRLT3":"35084","TRLH1":"1001380052","TRLH2":"1001280022"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":291,"slug":"clearlove","name":"Clearlove","firstName":"Kai","lastName":"Ming","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/clearlove-g5liezib.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2014-09-16T21:51:57.000Z","updatedAt":"2017-07-06T14:41:56.000Z","bios":{"en_US":"","fr_FR":"<p>le jungler d'EDG est un vétéran, avec des racines remontant à Warcraft 3. À l'origine, Kai « Clearlove » Ming s'est fait un nom au sein de l'équipe World Elite. À l'époque de la saison 2, cette dernière était considérée comme la meilleure équipe du monde, et leur domination a perduré tout au long de la saison 3. Clearlove était connu comme un jungler herbivore, préférant rester dans la jungle pour consolider sa puissance pendant que le reste de son équipe faisait durer la partie, mais avec le temps, son jeu s'est complètement transformé.</p>\n\n<p>Reconnu comme l'un des meilleurs junglers de la planète, la capacité de Clearlove à s'adapter rapidement aux changements de la méta a fait de lui un atout précieux pour EDG. Clearlove se targue d'un énorme pool de champions et c'est presque toujours lui qui prend les décisions dans les communications. Grâce à ce type de menace double, Clearlove est un ennemi redoutable et il ne manquera pas de faire valoir sa réputation à Barcelone pour l'événement All-Stars 2016. On ne sait jamais vraiment ce qu'il va jouer et, sachant que ses Cocons avec Elise sont tout aussi dangereux que ses Haches massacrantes avec Olaf, une chose est sûre : c'est lui qui décidera qui mourra et qui aura la vie sauve.</p>","pl_PL":"Dżungler EDG jest weteranem, który pamięta epokę Warcrafta 3. Kai „ClearLove” Ming po raz pierwszy zdobył rozgłos w Team WE (World Elite). Skład uznawany był za najlepszą drużynę na świecie podczas sezonu 2 i kontynuował dominację w sezonie 3. ClearLove dał się poznać jako „roślinożerny” dżungler, który siedzi w zaroślach, by nabierać mocy, podczas gdy reszta jego drużyny przeciąga grę. Jednak z biegiem czasu jego gra zaczęła przyjmować całkowicie inną formę.</p>\n\nZnany jako jeden z najlepszych dżunglerów na świecie, ClearLove potrafi dosłownie w locie przystosować się do zmian stanu gry, dzięki czemu stał się bezcennym nabytkiem dla EDG. Poza tym, że może pochwalić się szeroką pulą bohaterów, ClearLove prawie zawsze decyduje o celach całej drużyny. Tego rodzaju podwójne wywieranie presji sprawia, że ClearLove jest groźnym przeciwnikiem. Z tą reputacją pojedzie też do Barcelony na wydarzenie All-Star 2016. Nigdy nie wiadomo, kim zagra, ale biorąc pod uwagę, że jego kokony Elise są równie niebezpieczne, jak ucinające łby topory Olafa, jedno jest pewne — jeśli chodzi o to, kto będzie żyć, a kto zginie, decyzja będzie należała do niego.\n","de_DE":"<p>EDGs Jungler ist ein Veteran, dessen Karriere mit Warcraft 3 begann. Kai „Clearlove“ Ming machte sich mit Team WE, der World Elite, einen Namen. In der zweiten Saison galt die Mannschaft als die beste der Welt und ihre Dominanz setzte sich auch in der dritten Saison fort. Clearlove war als pflanzenfressender Jungler bekannt, der im Dschungel blieb und immer stärker wurde, während der Rest seiner Mannschaft das Spiel in die Länge zog. Aber mit der Zeit veränderte sich sein Spielstil komplett.</p>\n\n<p>Clearlove gilt als einer der besten Jungler des Planeten, und seine Fähigkeit, sich blitzschnell an Änderungen am Metaspiel anzupassen, hat ihn zu einem unverzichtbaren Mitglied von EDG gemacht. Dabei hat Clearlove nicht nur einen riesigen Championpool zur Verfügung, er übernimmt auch meistens die Ansagen. Das alles macht Clearlove zu einem gefährlichen Gegner, und mit diesem Ruf fährt er jetzt zum All-Stars-Event 2016 nach Barcelona. Man weiß nie genau, welchen Champion er spielen wird, und wenn man bedenkt, dass seine Kokons mit Elise genauso gefährlich sind wie seine Axt mit Olaf, dann ist eines ganz klar: Er entscheidet, wer lebt und wer stirbt.</p>","es_ES":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un jungla herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida, pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores junglas del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","pt_BR":"<p>O caçador da EDG é um veterano, com raízes que remontam ao Warcraft 3. Kai “Clearlove\" Ming fez seu nome inicialmente na Team WE, também conhecida como World Elite. A equipe já foi considerada a melhor do mundo durante a 2ª Temporada e sua supremacia continuou até a 3ª Temporada. ClearLove era conhecido por ser um caçador herbívoro, ficando na selva para acumular poder enquanto o resto da equipe carregava o jogo nas costas, mas com o passar do tempo, seu jogo mudou completamente.</p>\n\n<p>Conhecido como um dos melhores caçadores do planeta, a habilidade de Clearlove de se adaptar à medida que as coisas acontecem no meta fez dele um recurso super valioso para a EDG. Além do grande rol de Campeões, Clearlove pode ser visto quase sempre orientando os colegas em suas comunicações. Este tipo de jogador duplo fez de Clearlove um adversário formidável, e ele trará toda essa reputação consigo para Barcelona no Evento All-Star 2016. Você nunca sabe com o que ele vai jogar e, considerando que seus casulos de Elise são tão perigosos quanto seus machados do Olaf, uma coisa é certa: quando forem escolher quem vive ou morre, é ele quem decide.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Ming “Clearlove” Kai 선수는 LoL e스포츠 역사상 최고의 정글러로 손꼽힙니다. 한국 서버 솔로 랭크에서 이 선수의 아이디는 free win(무조건 이김)으로, 팀이 꾸준히 승자 자리를 차지한다는 점을 잘 나타내죠. 엄청난 라인 압박과 소름 돋는 맵 이해도로 EDG를 중국 리그 정상에 올린 선수입니다. </p>\n<p style=”font-family:”나눔고딕”;\">Clearlove 선수는 피지컬 면에서도 다른 정글러 다수의 추종을 불허합니다. 과감한 트래쉬 토크도 하죠. 한번은 “내가 bengi 선수보다 뛰어난 정글러라고 생각한다”고 말하기도 했습니다. 하지만 EDG가 2015 월드 챔피언십에서 보여준 부진을 보면 실력보다 자신감이 넘쳤던 건지도 모릅니다. 하지만 신의 반열에 오르려면 피를 흘려야 할 때도 있죠. 2016년에는 다시 예전의 실력을 보여주리라 믿습니다. </p>\n","es_AR":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>","cs_CZ":"<p>Džungler z EDG je ostříleným veteránem esportů, jehož kořeny sahají až do doby Warcraftu 3. Kai „Clearlove“ Ming vstoupil do povědomí fanoušků jako člen Team WE, World Elite. Tento celek byl ve 2. sezóně považován za nejlepší na světě a jeho nadvláda pokračovala i během 3. sezóny. Clearlove byl známý jako „býložravý“ džungler, který shromažďoval sílu vymetáním táborů, zatímco jeho spolubojovníci se starali o zbytek, postupem času se však jeho herní styl výrazně změnil.</p>\n\n<p>V současné době platí Clearlove za jednoho z nejlepších džunglerů světa a je pro EDG ohromnou posilou, za což vděčí především své schopnosti okamžitě se přizpůsobovat měnícím se požadavkům mety. A kromě toho, že se může pochlubit nesmírně bohatým výběrem šampionů, to také bývá on, kdo do mikrofonu diktuje pokyny. Tato dvojitá hrozba činí z Clearlovea nebezpečného protivníka a s touto reputací odjíždí do Barcelony na turnaj All-Star 2016. Nikdy nemůžete vědět, za koho zrovna bude hrát, a jelikož jsou kokony jeho Elise stejně vražedné jako Olafovy nabroušené sekery, máte jen jednu jistotu – až se bude rozhodovat o tom, kdo bude žít a kdo zemře, bude o tom rozhodovat právě on.</p>","el_GR":"<p>Ο παίκτης ζούγκλας των EDG είναι ένας βετεράνος που ξεκίνησε να ασχολείται σοβαρά με τα παιχνίδια από το Warcraft 3. Ο Kai \"Clearlove\" Ming έγινε γνωστός αρχικά όταν έπαιζε στους Team WE ή World Elite. Τη Σεζόν 2, η ομάδα του είχε τη φήμη της καλύτερης ομάδας του κόσμου και η κυριαρχία της συνεχίστηκε και τη Σεζόν 3. Ο Clearlove ήταν γνωστός για το στυλ του «χορτοφάγου» παίκτη ζούγκλας που ακολουθούσε: έμενε στη ζούγκλα για να αυξήσει τη δύναμή του, ενώ η ομάδα του καθυστερούσε τον αντίπαλο μέχρι να είναι έτοιμος. Με την πάροδο του χρόνου, όμως, το στυλ παιχνιδιού του άλλαξε εντελώς.</p>\n\n<p>Ο Clearlove θεωρείται ένας από τους καλύτερους παίκτες ζούγκλας στον πλανήτη και η ικανότητά του να προσαρμόζεται ταχύτατα στις αλλαγές του περιβάλλοντος του παιχνιδιού είναι ένα πολύτιμο εφόδιο για τους EDG. Πέρα από το γεγονός ότι μπορεί να παίξει καλά μια τεράστια γκάμα ηρώων, ο Clearlove αναλαμβάνει συνήθως και την οργάνωση των συμπαικτών του και πάντα φαίνεται να τους μιλάει στο ακουστικό του. Αυτή η πολυδιάστατη παρουσία του στο παιχνίδι κάνει τον Clearlove έναν εξαιρετικά επικίνδυνο αντίπαλο και είναι βέβαιο ότι θα είναι ένας από τους πιο σεβαστούς παίκτες στο Τουρνουά All-Star 2016 της Βαρκελώνης. Δεν ξέρεις ποτέ πώς θα παίξει, αφού τα κουκούλια του με την Ελίζ είναι εξίσου θανατηφόρα με τα αιματοβαμμένα τσεκούρια του Όλαφ. Ένα πράγμα είναι σίγουρο, όμως: όπως και αν πηγαίνει το παιχνίδι, θα είναι πάντα παρών για να βοηθήσει την ομάδα του.</p>","hu_HU":"Az EDG dzsungelharcosa igazi veterán, aki még a Warcraft 3-ban kezdte a karrierjét. Kai „Clearlove” Ming eredetileg a Team WE, a World Elite tagja volt. A 2. szezon idején a világ legjobb csapatának számítottak, és a 3. szezonban is jól szerepeltek. Clearlove inkább növényevő dzsungelharcosként kezdett, alig mozdult ki a dzsungelből, és gyűjtötte az erőt, amíg a csapata vitte el a hátán a meccset. A játéka azóta teljesen megváltozott.</p>\n\nClearlove a világ egyik legjobb dzsungelharcosává vált, és könnyedén alkalmazkodott a változó metajátékhoz, ami különösen értékessé tette az EDG számára. A hatalmas hősrepertoár mellett többnyire Clearlove a csapat irányítója. Ez a kettős fenyegetés teszi őt igazán egyedivé, és mindkét képességét bemutathatja Barcelonában, a 2016-os All-Star gálán. Sosem lehet megjósolni, hogyan fog játszani, és akár Elise-zel gubózza be az ellenfeleket, akár Olaf fejszéivel hadonászik, egy dolog biztos: ő dönti el, hogy ki élhet és ki hal meg.\n\n","it_IT":"l'esperto di giungla degli EDG è un vero veterano, la cui carriera affonda le radici fino a Warcraft 3. Kai \"Clearlove\" Ming si è fatto un nome con il Team WE, World Elite. Durante la stagione 2 era considerata la miglior squadra del mondo, e il suo dominio è proseguito per tutta la stagione 3. Clearlove era famoso per essere un \"erbivoro\" da giungla, dove rimaneva ad aumentare il suo potere mentre il resto della squadra portava avanti la partita, ma con il passare del tempo il suo stile cambiò radicalmente.</p>\n\nFamoso per essere uno degli esperti di giungla più forti del mondo, la sua abilità di adattarsi istantaneamente alla situazione nel meta lo ha reso una risorsa insostituibile per gli EDG. Oltre a vantare una grande efficienza con numerosi campioni, Clearlove è spesso intento a chiamare le giocate per i suoi compagni. Questi due aspetti hanno reso Clearlove un avversario formidabile, che di sicuro porterà le sue straordinarie capacità anche nell'arena di Barcellona per l'All-Star 2016. Prevedere il suo gioco è quasi impossibile, ma visto che tra le sue mani i bozzoli di Elise sono tanto letali quanto le asce di Olaf una cosa è certa: quando si tratta di decidere chi vive e chi muore, l'ultima decisione spetterà a lui.\n","ro_RO":"Junglerul de la EDG este un veteran care a intrat în circuitul profesionist pe când juca Warcraft 3. Kai ''Clearlove'' Ming și-a clădit un renume alături de Team WE, World Elite. Team WE era considerată cea mai bună echipă din lume în sezonul 2, iar dominația lor a continuat și în sezonul 3. La început, Clearlove era un jungler pasiv, care stătea în junglă și își consolida puterea în timp ce restul echipei trăgea de timp. Odată cu trecerea timpului, stilul său de joc s-a transformat complet.</p>\n\nCunoscut ca unul dintre cei mai buni jungleri din lume, abilitatea lui Clearlove de a se adapta pe loc schimbărilor din meta l-au făcut un jucător neprețuit pentru EDG. Pe lângă faptul că stăpânește o gamă largă de campioni, Clearlove este aproape întotdeauna cel care ia deciziile în echipă. Acest tip de amenințare dublă l-a transformat într-un adversar formidabil, iar el va aduce această reputație în Barcelona la All-Star 2016. Nu știi niciodată ce va juca Clearlove și, luând în considerare faptul că ''Coconii'' lui Elise sunt la fel de periculoși ca securile lui Olaf, un lucru e cert – el e cel care decide cine moare și cine trăiește.\n","es_MX":"<p>El jungla de EDG es todo un veterano: sus comienzos se remontan hasta Warcraft 3. Kai \"ClearLove\" Ming se ganó la fama en Team WE (World Elite, la élite mundial, por sus siglas en inglés). Ese equipo fue considerado el mejor del mundo durante la temporada 2 y su dominio perduró durante la temporada 3. ClearLove era conocido por ser un junglero herbívoro, ya que se quedaba en la jungla para acumular poder mientras el resto de su equipo alargaba la partida; pero, con el tiempo, su estilo de juego ha tomado un rumbo completamente diferente.</p>\n\n<p>Conocido como uno de los mejores jungleros del planeta, la capacidad de adaptación instantánea de ClearLove según el metajuego lo ha convertido en una joya de valor incalculable para EDG. Además de manejar un repertorio enorme de campeones, ClearLove suele liderar a su equipo. Este tipo de doble amenaza ha convertido a ClearLove en un oponente increíble y llevará esa reputación a Barcelona para el All-Star Event 2016. Nunca se sabe qué jugará y, si tenemos en cuenta que sus marañas con Elise son igual de peligrosas que sus demoledoras hachas con Olaf, lo que sí es seguro es que será él quien decida quién vive y quién muere.</p>"},"foreignIds":{"drupalId":"2089","TRLH3":"1001360057","TRLH1":"1001380032","TRLH2":"1001280002","TRLH4":"1001310057","TRLT3":"200000241"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":330,"slug":"mouse","name":"Mouse","firstName":"Yuhao","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mouse-7ptawp7p.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-07-06T14:39:33.000Z","bios":{"en_US":"","de_DE":"<p>Wenn man Yu-Hao „Mouse“ Chen nach seiner Meinung fragt, sagt er wahrscheinlich, dass nicht alle Stars geboren, sondern geformt werden. Seine Karriere begann bei EDG, wo er als Supporter auf der untern Lane spielte. Es dauerte jedoch nicht lange, bis er durch Meiko ersetzt wurde. Danach musste er über ein Jahr lang die Bank drücken. Doch selbst in dieser Zeit verlor er nie seinen Kampfgeist, und als der Sommer-Split 2016 begann, übernahm er bei EDG die Rolle des Top-Laners.</p>\n\n<p>Jeder professionelle Spieler wird dir sagen, dass es nichts Schwierigeres gibt, als in League of Legends die Position zu wechseln, und das stimmt auch. Doch Mouse ließ sich davon nicht abhalten und wurde zu einem stabilen Top-Laner für EDG. Dank seiner Arbeitsmoral erreichte seine Mannschaft das Viertelfinale der Weltmeisterschaft 2016, an dem er aufgrund eines tragischen Todesfalls in seiner Familie nicht teilnehmen konnte. Die Fans haben gesprochen und sie wollen Mouse 2016 noch ein letztes Mal zujubeln. Der neue Top-Laner bekommt noch eine Chance, der Welt zu zeigen, wie man mit einer guten Arbeitsmoral gegen reines Talent bestehen kann.</p>","es_AR":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","pt_BR":"<p>Se você perguntar para Yu-Hao “Mouse” Chen, ele provavelmente dirá que nem todas estrelas são nascidas, mas sim forjadas. Sua campanha pela EDG começou na rota inferior, como um jogador de suporte. Isso durou até ele ser substituído por Meiko. Ele foi para o banco e ficou lá por um ano, mas seu desempenho competitivo jamais o deixou, e quando a Etapa de Verão 2016 começou, ele era o jogador de topo da EDG.</p>\n\n<p>Qualquer jogador poderia dizer que mudar de posições é uma das coisas mais difíceis de se fazer no competitivo de League of Legends, e estariam certos. Mouse não deixou a natureza desta tarefa o deter e se tornou um ótimo jogador de topo para a EDG. Sua ética de trabalho furiosa levou sua equipe às Quartas de final do Campeonato Mundial 2016. Trágica e infelizmente, ele precisou deixar a competição devido a uma morte em sua família. Os fãs se pronunciaram e decidiram trazer Mouse de volta para uma disputa internacional em 2016. O recém-topo agora tem outra oportunidade de mostrar ao mundo o que acontece quando se confronta talento puro com ética de trabalho.</p>","fr_FR":"<p>si vous posiez la question à Yu-Hao « Mouse » Chen, il vous dirait probablement qu'on ne naît pas star, mais qu'on le devient. Sa carrière chez EDG a commencé sur la voie du bas en tant que support titulaire. Mais ça n'a pas duré longtemps et il a vite été remplacé par Meiko. Il est ensuite resté sur la touche pendant plus d'un an, mais il n'a jamais perdu son esprit compétitif et il est devenu le top laner titulaire d'EDG dès le début du segment d'été 2016.</p>\n\n<p>N'importe quel joueur pourrait vous dire que changer de position est l'une des choses les plus difficiles sur la scène professionnelle de League of Legends et ce, à juste titre. Mais Mouse ne s'est pas laissé intimider, et il est devenu une option fiable pour la voie du haut d'EDG. Son éthique professionnelle acharnée a aidé son équipe à atteindre les quarts de finale pendant le Championnat du monde 2016, qu'il a dû abandonner tragiquement suite au décès d'un parent. Les fans ont parlé et ils ont décidé de ramener Mouse pour un dernier tour de piste en 2016. Le top laner fraîchement promu a désormais une nouvelle chance de montrer au monde que l'éthique professionnelle peut parfois écraser le talent pur.</p>","es_ES":"<p>Si le preguntáis a Yu-Hao \"Mouse\" Chen, probablemente os dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en la calle inferior como apoyo titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del split de verano de 2016, paso a ser el top titular de EDG.</p>\n\n<p>Cualquier jugador os diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo sobrecogiese, sino que se convirtió en una opción sólida para la calle superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador de la calle superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>","cs_CZ":"<p>Když se zeptáte Yu-Haoa „Mouse“ Chena, nejspíš vám řekne, že ne všechny hvězdy se rodí, některé je zapotřebí ukout. V EDG začínal ve spodní lajně jako hlavní podpora. Na této pozici však dlouho nevydržel a nahradil jej Meiko. Poté strávil rok na střídačce, ovšem soutěžní zápal jej neopustil a na začátku letního splitu 2016 se přesunul do základní sestavy EDG jako horní lajnař.</p>\n\n<p>Každý hráč vám řekne, že změna pozice patří na profesionální úrovni League of Legends mezi ty nejtěžší okamžiky – a je to pravda. Mouse se ovšem náročností tohoto úkolu nenechal odradit a stal se v EDG solidní variantou pro horní lajnu. Jeho nesmírná pracovitost pomohla jeho týmu do čtvrtfinále mistrovství světa 2016, které musel naneštěstí opustit kvůli úmrtí v rodině. Fanoušci ovšem promluvili a rozhodli se, že si Mouse v sezóně 2016 zaslouží ještě jednou zažít pocit vítězství. Tento čerstvě ukutý horní lajnař tak má opět šanci světu ukázat, že pracovitost a cílevědomost mohou být cennější než čistý talent.</p>","el_GR":"<p>Ο Yu-Hao “Mouse” Chen είναι της άποψης ότι τα αστέρια δεν γεννιούνται, αλλά σφυρηλατούνται στην πορεία. Η πορεία του με τους EDG ξεκίνησε στην κάτω λωρίδα, ως βασικός υποστηρικτής της ομάδας. Πολύ γρήγορα όμως, έχασε τη θέση του από τον Meiko. Στη συνέχεια γυάλισε τον πάγκο για περισσότερο από έναν χρόνο, αλλά δεν το έβαλε ποτέ κάτω. Όταν ξεκίνησε το Summer Split 2016, ήταν ο βασικός παίκτης επάνω λωρίδας των EDG.</p>\n\n<p>Όλοι οι παίκτες υψηλού επιπέδου γνωρίζουν καλά ότι η αλλαγή θέσης είναι από τα πιο δύσκολα πράγματα που μπορεί να καταφέρει κανείς στο επαγγελματικό League of Legends. Όμως ο Mouse δεν δίστασε καθόλου και με αρκετό κόπο κατάφερε να γίνει μια αξιόπιστη επιλογή στην επάνω λωρίδα για τους EDG. Ο ασυμβίβαστος επαγγελματισμός του βοήθησε την ομάδα του να φτάσει στους προημιτελικούς του Παγκοσμίου Πρωταθλήματος 2016, αλλά δυστυχώς έπρεπε να αποχωρήσει λόγω ενός θανάτου στην οικογένεια. Όμως οι φίλοι του παιχνιδιού μίλησαν και θέλουν να δουν τον Mouse να αποχαιρετά δυναμικά το 2016. Ο νεοφώτιστος παίκτης επάνω λωρίδας έχει άλλη μια ευκαιρία για να αποδείξει σε όλους ότι η σκληρή δουλειά υπερτερεί του καθαρού ταλέντου.</p>","hu_HU":"Ha Yu-Hao „Mouse” Chent kérdezzük, valószínűleg azt mondja, hogy senki sem születik sztárnak, a siker mögött kemény munka áll. Az EDG-ben az alsó ösvényen kezdett a kezdőcsapat támogatójaként. Nem sokáig maradt ott, hamarosan Meiko lépett a helyére. Ezután egy évet kellett lehúznia a cserepadon, de a versenyszellem nem hagyta el, és a 2016-os nyári szakasz már az EDG felső ösvényén találta kezdőjátékosként.</p>\n\nBárki elmondhatja, hogy az egyik legnagyobb kihívás a professzionális League of Legends-játékos számára az, ha szerepet kell váltania. Mouse nem ijedt meg a feladattól, és megbízhatóan teljesít az EDG felső ösvényén. Rendíthetetlen munkamorálja egészen a 2016-os világbajnokság negyeddöntőjéig juttatta a csapatot, de otthagyta a versenyt egy családtag halála miatt. A rajongók döntöttek: szeretnének még egyszer szurkolni Mouse-nak 2016-ban. Az újdonsült felső ösvényes megmutathatja a világnak, hogy a kitartó gyakorlás többet ér a puszta tehetségnél.\n","it_IT":"Yu-Hao \"Mouse\" Chen è la dimostrazione che alcune stelle non nascono, ma vengono forgiate dal tempo. La sua carriera negli EDG è partita dalla corsia inferiore, dove giocava come supporto titolare. Quell'esperienza però non durò molto, visto che presto fu sostituito da Meiko. Rimase in panchina per più di un anno, ma la sua indole competitiva non lo abbandonò mai, e all'inizio del Summer Split 2016 tornò in gioco come superiore titolare degli EDG.</p>\n\nQualsiasi giocatore può confermare che cambiare posizione è una delle cose più difficili da fare nel mondo professionistico di League of Legends... e a ragione. Tuttavia, Mouse non si lasciò impressionare dalla difficoltà del compito e divenne un validissimo superiore per gli EDG. Con il suo stile furioso ha aiutato i suoi compagni a raggiungere i quarti di finale dei Mondiali 2016, prima di essere costretto ad abbandonare il torneo per un grave lutto familiare. Ora i fan hanno parlato, e vogliono riportare Mouse nella Landa per un'ultima ovazione nel 2016. Il novello superiore avrà un'altra occasione per mostrare al mondo come l'impegno costante possa superare anche il puro talento.\n","ro_RO":"Dacă îl întrebi pe Yu-Hao ''Mouse'' Chen, probabil îți va spune că nu toate vedetele se nasc extraordinare, ci că devin astfel muncind pe brânci. Drumul său alături de EDG a început pe culoarul de jos, unde a fost jucătorul principal de suport. Dar nu pentru multă vreme, întrucât a fost înlocuit de Meiko. Deși a stat pe bancă mai bine de un an nu și-a pierdut spiritul competitiv, iar la începutul etapei de vară din 2016 a devenit jucătorul principal de pe culoarul de sus.</p>\n\nOrice jucător îți va spune că schimbarea poziției este unul dintre cele mai dificile strategii din circuitul profesionist de League of Legends și, cel mai probabil, are dreptate. Însă Mouse nu s-a lăsat descurajat de dificultatea sarcinii și a devenit o opțiune viabilă pentru culoarul de sus al celor de la EDG. Etica sa de muncă a ajutat echipa să se califice în sferturile de finală ale Campionatul Mondial 2016, la care Mouse nu a putut participa din cauza unui deces în familie. Fanii au spus ce aveau de spus și vor să-l vadă iar pe Mouse arătând tot ce poate în 2016. Noul jucător de pe culoarul de sus are din nou ocazia de a arăta lumii că munca susținută poate întrece talentul înnăscut.\n","pl_PL":"Gdyby zapytać o to Yu-Hao „Mouse” Chena, zapewne powiedziałby, że nie wszyscy są urodzonymi gwiazdami, ale mogą się nimi stać dzięki ciężkiej pracy. Jego występy z EDG zaczęły się na dolnej alei, na której grał jako podstawowy zawodnik wsparcia. Nie trwało to jednak zbyt długo, ponieważ został zastąpiony przez Meiko. Potem grzał ławkę rezerwowych przez ponad rok, ale nigdy nie opuścił go zapał do rywalizacji i z rozpoczęciem letniego splitu 2016 był już podstawowym górnym EDG.</p>\n\nKażdy zawodnik przyzna, że zmiana pozycji to jedna z najtrudniejszych rzeczy w profesjonalnym League of Legends i jest to prawda. Mouse nie przejął się jednak trudnością tego zadania i stał się solidnie grającym zawodnikiem górnej alei EDG. Jego niesamowita etyka pracy pomogła drużynie dostać się do ćwierćfinałów Mistrzostw Świata 2016, które niestety musiał opuścić z powodu śmierci członka rodziny. Fani przemówili i chcą sprowadzić Mouse z powrotem na jeszcze jeden, ostatni zryw w 2016 roku. Świeżo mianowany górny dostał kolejną szansę, by pokazać światu, jak ciężka praca może przeważyć nad wrodzonym talentem.\n","es_MX":"<p>Si le preguntan a Yu-Hao \"Mouse\" Chen, probablemente dirá que no todas las estrellas nacen, sino que se forjan. Su recorrido con EDG comenzó en el carril inferior como soporte titular. Sin embargo, esta situación no duraría mucho, ya que fue reemplazado por Meiko. Entonces pasó al banquillo durante más de un año, pero nunca perdió su espíritu competitivo y, al comienzo del torneo de verano de 2016, paso a ser el superior titular de EDG.</p>\n\n<p>Cualquier jugador diría que cambiar de posición es una de las cosas más difíciles de hacer para un profesional de League of Legends, y tienen razón. Pero Mouse no dejó que la abrumadora tarea lo abrumara, sino que se convirtió en una opción sólida para el carril superior de EDG. Su increíble ética de trabajo lo ayudó a llevar a su equipo hasta los cuartos de final del Campeonato Mundial 2016, el cual tuvo que abandonar debido al fallecimiento de un familiar. Los fans se han pronunciado y quieren que Mouse vuelva para recibir una última ovación en 2016. El nuevo jugador del carril superior tiene ahora otra oportunidad para demostrarle al mundo cómo la ética de trabajo puede acabar con el talento puro.</p>"},"foreignIds":{"drupalId":"3770","TRLH1":"1001380031","TRLH2":"1001280001","TRLH3":"1001360056","TRLH4":"1001310056","TRLT3":"200000240"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":334,"slug":"meiko","name":"Meiko","firstName":"Ye","lastName":"Tian","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/meiko-1s9xil6v.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2015-01-19T23:39:49.000Z","updatedAt":"2017-07-06T14:33:00.000Z","bios":{"en_US":"","fr_FR":"<p>Tian « Meiko » Ye a commencé sa carrière en e-sport chez Rayunion, mais il est devenu une star quand il a rejoint Edward Gaming. Lors de sa première saison chez EDG, Meiko a aidé son équipe à terminer en 1re place de la 2015 Demacia Cup Spring Season et des play-offs du printemps des LPL 2015.</p>\n\n<p>Le style de jeu de Meiko se concentre essentiellement sur le contrôle des combats d'EDG, tout particulièrement ceux de son partenaire sur la voie du bas, Deft. Quand Meiko donne les ordres, le discret (voire passif) Deft se transforme en monstre agressif. Et de son côté, Meiko utilise ses terrifiantes compétences avec Annie ou Thresh pour protéger Deft et permettre des éliminations aisées. Pas si mal pour un support relativement inconnu sur qui on vient de braquer les projecteurs.</p>","pl_PL":"<p>Tian „Meiko” Ye rozpoczął karierę e-sportową w drużynie Rayunion, status gwiazdy zyskał jednak, dołączając do chińskich gigantów – Edward Gaming. W trakcie swojego pierwszego sezonu z EDG Meiko pomógł drużynie wspiąć się na pierwsze miejsce w trakcie wiosennych rozgrywek 2015 Demacia Cup, a także rozgrywek playoff 2015 LPL.</p>\n\n<p>Jego styl gry skupia się na kontrolowaniu starć, zwłaszcza w przypadku jego partnera z dolnej alejki, Defta. Gdy Meiko przejmie inicjatywę, nawet spokojny i bierny Deft zmienia się w agresywną bestię. Ten pierwszy zaś wykorzystuje swoje umiejętności w grze Annie i Threshem, by osłaniać Defta i stwarzać mu dogodne sytuacje. Nieźle, jak na niezbyt znanego gracza wsparcia, który nagle zyskał szansę, by się wybić.</p>","de_DE":"<p>Tian „Meiko“ Ye ist Edward Gamings Supporter. Ursprünglich war er nur ein Ersatzspieler in der Mannschaft, der sich durch eine Kombination aus harter Arbeit und dem Pech von Mouse in die Startaufstellung kämpfte. Und als er endlich dort angekommen war, machte er sofort einen gewaltigen Unterschied aus. Sein Stil, bei dem er viel umherstreift, passte perfekt zur Aggressivität seiner Teamkameraden.</p>\n\n<p>Meiko, der vor allem für seine Spiele mit Annie und Thresh bekannt ist, fühlt sich am wohlsten, wenn er Gegner abfangen und sie dem Rest seiner Mannschaft überlassen kann. Durch diesen Gameplay-Stil konnte sich EDG als eine der besten Mannschaften Chinas etablieren und das Mid-Season Invitational 2015 gewinnen. Wenn Meiko dich alleine erwischt, baumelst du am Haken oder wirst bis in alle Ewigkeit betäubt und EDG macht sich diesen Vorteil dann zunutze. Diese berechnende Aggressivität könnte dazu führen, dass EDG der diesjährigen Weltmeisterschaft seinen Stempel aufdrücken kann.</p>","es_ES":"<p>Tian \"Meiko\" Ye es el apoyo de Edward Gaming. Empezó como un suplente modesto en el equipo, para luego abrirse camino hasta una posición titular con una combinación de trabajo duro y la mala suerte de Mouse, el titular anterior. Independientemente del motivo, en cuanto llegó, se notó ampliamente la diferencia. Su estilo agresivo de deambular encajó de manera instantánea con la agresividad ambiciosa del resto del equipo.</p>\n\n<p>Famoso por su destreza con Annie y Thresh, Meiko se desenvuelve muy bien cuando puede realizar iniciaciones y aislar a los enemigos para que su equipo comience el ataque. Fue este estilo de juego lo que le permitió a EDG colocarse como uno de los mejores equipos de China y llevarse el trofeo de campeón a casa en el MSI 2015. Si Meiko te pilla solo, te verás enganchado o aturdido hasta el olvido y EDG se encargará de aprovechar esa ventaja. Esa agresividad calculada puede ser lo que haga que EDG deje su huella en el Mundial de este año.</p>","pt_BR":"<p>Meiko iniciou sua carreira na Rayunion, mas começou a brilhar quando assinou com a Edward Gaming. Em sua primeira temporada, ajudou o time a vencer a Demacia Cup e as eliminatórias de primavera da LPL 2015.</p>\n<p>Seu estilo de jogo é baseado em controlar os confrontos do time, e salvar seu atirador Deft. Quando ele está chamando as jogadas, seu estilo passivo dá lugar a um monstro. Com sua Annie e seu Thresh afiados, ele consegue não só proteger seu atirador mas também criar oportunidades de alguns abates. Nada mal para um suporte relativamente desconhecido que alcançou o estrelato.</p>","es_AR":"<p>Tian “Meiko” Ye es soporte de Edward Gaming. Empezó formando parte del equipo como suplente y consiguió ocupar un lugar titular gracias a una combinación de trabajo duro y mala fortuna de Mouse, el titular anterior. Sea como sea llegó allí y marcó la diferencia; se pasó del día a la noche. Su pesado estilo de desplazamiento enseguida se sincronizó con la ambiciosa agresión del resto del equipo.</p>\n\n<p>Destacado por su juego con Annie y Thresh, Meiko logra hacer enganches y derribar enemigos para que el resto del equipo pueda avanzar. Fue su estilo de juego lo que le permitió a EDG consagrarse como uno de los mejores equipos de China y llevarse a casa el trofeo del Torneo por Invitación de Mitad de Temporada 2015. Si Meiko te encuentra solo, terminarás aturdido en el olvido, y EDG se aprovechará de dicha ventaja. Esta agresión calculada podría ser lo que le permita a EDG crear una marca en el Mundial de este año.</p>"},"foreignIds":{"drupalId":"3754","TRLH1":"1001380035","TRLH2":"1001280005","TRLH3":"1001160041","TRLH4":"1001160041","TRLT3":"200000244"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":509,"slug":"fireloli","name":"Iceloli","firstName":"Zhiming","lastName":"Zhao","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/fireloli-z1knndy.png","hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2015-05-29T17:56:46.000Z","updatedAt":"2017-06-06T23:04:30.000Z","bios":{"en_US":null},"foreignIds":{"drupalId":"4539"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":519,"slug":"kid","name":"Kidkid","firstName":"Yan","lastName":"Ge","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/kid-d4hufczg.png","hometown":"China","region":"LPL China","birthdate":"","createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:24:40.000Z","bios":{"en_US":"","fr_FR":"<p>Ge « Kid » Yan est un incroyable carry AD. Il s'entraîne constamment pour s'améliorer et développer de meilleures synergies avec son partenaire de la voie du bas, Kitties. Et tout cet entraînement a fini par payer : ses performances régulières aux LPL lui a valu le surnom « d'ancre de stabilité ».</p>\n\n<p>À la différence de bon nombre de joueurs pro, Kid n'a pas perdu sa nonchalance en devenant une star, du moins pas en dehors de son rigoureux programme d'entraînement ! Mais quand l'entraînement prend fin, c'est un Kid très relax qu'on retrouve. Quand il est l'heure de s'amuser, il est prêt à se donner à fond.</p>","pl_PL":"<p>Ge „Kid” Yan to rzetelny prowadzący. Ciągle trenuje, starając się poprawić swoją formę i współpracę z partnerem z dołu, Kitties. Ćwiczenia opłaciły się – jego stabilna gra w LPL sprawiła, że zaczęto go nazywać „Ostoją stabilności”.</p>\n\n<p>W przeciwieństwie do innych zawodowców Kid nie przestał być wyluzowany, gdy stal się gwiazdą. Oczywiście nie dotyczy to jego rygorystycznych treningów. Jednak po treningu pojawia się na powrót zrelaksowany Kid. Kiedy przychodzi pora na zabawę, oddaje jej się bez reszty.</p>","de_DE":"<p>Ge “Kid” Yan ist ein Arbeitstier als AD Carry. Er trainiert konstant, um besser zu werden und arbeitet an seiner Synergie mit seinem Supporter, Kitties. Und die ganze Arbeit hat sich ausgezahlt, seine konstanten Leistungen in der LPL brachten ihm den Namen “The Anchor of Stability”.</p>\n\n<p>Im Gegensatz zu anderen Profis opferte er nicht sein entspanntes Wesen, um ein Star zu werden – zumindest nicht abseits seines harten Trainingsplanes! Aber wenn das Training vorbei ist, kommt das entspannte Kind zu Tage. Wenn die Zeit zum Spaß haben gekommen ist, ist er mittendrin dabei. </p>\n","es_ES":"<p>Ge “Kid” Yan es un trabajador por naturaleza. Este tirador se somete a duras sesiones de entrenamiento para que mejoren tanto él como jugador como la sinergia de la calle inferior con su compañero y support, Kitties. Y tanto entrenamiento ha dado sus frutos -- gracias a sus actuaciones consistentes en la LPL se ha ganado el apodo de “El Ancla de la Estabilidad”. </p>\n\n<p>A diferencia de muchos jugadores profesionales, Kid no ha sacrificado su actitud relajada y alegre para convertirse en una estrella -- ¡Al menos fuera de las sesiones de entrenamiento con su equipo! Cuando la práctica termina, descubrimos Kid relajado y bromista. Porque si es la hora de divertirse, ahí está él. </p>\n","pt_BR":"<p>Kid é um atirador incansável. Ele está sempre treinando para evoluir e ter uma sinergia melhor com seu parceiro de rota, Kitties. E tanta dedicação deu resultado -- com atuações consistentes na LPL, ele ganhou o apelido de \"Âncora da Estabilidade\".</p>\n<p>Ao contrário de vários jogadores, ele não sacrificou seu temperamento tranquilo para virar uma estrela -- pelo menos não fora do horário de treino. Quando o jogo acaba, surge o Kid tranquilão, pronto para se divertir.</p>"},"foreignIds":{"drupalId":"2064","TRLH4":"1001160033","TRLH3":"1001160033"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":522,"slug":"rookie","name":"Rookie","firstName":"Ui-jin","lastName":"Song","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/rookie-3ohvy99s.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2015-06-02T19:55:05.000Z","updatedAt":"2017-06-06T23:27:32.000Z","bios":{"en_US":"","fr_FR":"<p>Eui-jin « RooKie » Song n'est qu'un nouveau venu aux LPL, mais ne vous laissez pas tromper par son pseudo (« le bleu » en anglais) : il a affronté bon nombre des meilleurs joueurs du monde. RooKie a été en première ligne du nouveau départ de KT Rolster en 2014, et le lien qu'il a développé avec son coéquipier jungler de KT, KaKAO, les a aidés à remporter plusieurs matchs des LCK.</p>\n\n<p>Lorsque KaKAO a décidé de participer aux LPL, RooKie a suivi le mouvement. Il a emporté avec lui son affinité pour les mages de contrôle, comme Azir et Orianna, ainsi qu'une tendance à utiliser des coups flamboyants pour remporter les parties. Si cette tendance a quelque peu reflué lors de sa première année aux LPL, RooKie a encore bon nombre de tours dans sa manche, notamment une excellente Cassiopeia.</p>","pl_PL":"<p>Eui-jin „RooKie” Song może i od niedawna gra w LPL, ale walczył już z najtrudniejszymi przeciwnikami na świecie. RooKie był główną siłą napędową KT Rolster w 2014 roku, a przyjaźń nawiązana z dżunglerem KaKAO pozwoliła wygrać wiele meczów w LCK.</p>\n\n<p>Kiedy KaKAO przeniósł się do LPL, RooKie zabrał się z nim. Zawsze lubił kontrolujących magów takich jak Azir czy Orianna i dalej ma tendencje do wygrywania popisowymi akcjami. Chociaż jego popisy nieco osłabły podczas pierwszego roku w LPL, RooKie wciąż ma kilka asów w rękawie, np. grę Cassiopeią.</p>","de_DE":"<p>Eui-jin “RooKie” Song mag zwar neu in der LPL sein, aber lass dich nicht von seinem Namen täuschen – er spielte schon gegen einige der besten Teams auf der Welt. RooKie war bei der Verjüngung von KT Rolster 2014 vorne mit dabei, und die Verbindung mit seinem Teamkameraden und Jungler von KT KaKAO trug dazu bei, viele Spiele in der LCK zu gewinnen. </p>\n\n<p>Als KaKAO in die LPL wechselte, zog RooKie nach. Er brachte eine Vorliebe für Kontrollmagier wie Azir und Orianna zu seinem neuen Arbeitsplatz mit und eine Tendenz zu riskanten Zügen, um Spiele zu gewinnen. Während sein Vertrauen auf riskante Spielzüge während seinem ersten Jahr in der LPL verblasste, packt er immer wieder ein Ass aus dem Ärmel – inklusive einer tödlichen Cassiopeia. </p>\n","es_ES":"<p>Puede que Eui-jin “RooKie” Song sea relativamente nuevo en la LPL, pero no dejes que su nombre te engañe -- ha jugado contra algunos de los rivales más fuertes del mundo. RooKie estuvo al frente en el proceso de renovación que sufrió KT Rolster durante 2014, y el lazo que desarrolló con su compañero en la jungla KaKAO ayudó a su equipo a ganar bastantes partidos en la LCK. </p>\n\n<p>Cuando KaKAO se fue a la LPL, RooKie hizo las maletas y se fue con él. En China, ha desarrollado una afinidad por magos que controlan a sus enemigos como Azir y Orianna, y una tendencia a depender de jugadas brillantes para ganar las partidas. Aunque durante su primer año en la LPL se ha vuelto más sobrio, RooKie sigue teniendo algún as en la manga -- incluída una Cassiopeia demoledora. </p>\n","pt_BR":"<p>RooKie pode ser novo na LPL, mas não se engane. Ele já jogou contra alguns dos melhores jogadores do mundo. Ele foi parte fundamental do rejuvenescimento da KT Rolster em 2014, e sua sinergia com o caçador KAKAO ajudou o time a vencer muitas particas na LCK.</p>\n<p>Quando KAKAO mudou-se da Coreia para a China, RooKie foi junto. Levou consigo o controle de magos como Azir e Orianna, criando uma tendência de jogadas exuberantes para vencer partidas. Apesar de essa exuberância ter perdido o encanto com o passar do tempo, ele ainda tem vários truques na manga -- incluindo uma Cassiopeia venenosa.</p>\n","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “RooKie” 송의진 선수가 LPL에 진출한 진 그리 오래되지 않았지만 아이디대로 신인인 건 아닙니다. 세계에서 가장 치열한 리그에서 뛴 적 있는 선수죠. RooKie 선수는 kt 롤스터가 2014년 팀을 재정비할 때 최전선에 섰고 같은 팀의 정글러 KaKAO 선수와 멋진 호흡으로 LCK에서 팀의 선전을 이끌었습니다. </p>\n<p style=”font-family:”나눔고딕”;\">KaKAO 선수가 LPL로 이적할 때, RooKie 선수도 따라가면서 아지르나 오리아나 같은 장악형 마법사 플레이와 현란한 플레이로 승리하는 전략을 새 팀에 선사했죠. 비록 현란한 플레이에 의존하는 플레이는 LPL 진출 첫해를 보내며 사라졌지만 그 외에도 적을 떨게 하는 카시오페아 플레이처럼 여러 전술을 갖춘 선수입니다. </p>\n"},"foreignIds":{"drupalId":"2149","TRLH3":"1001160032","TRLH4":"1001160032","TRLH1":"1001180003","TRLH2":"1001140003"},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1032,"slug":"scout","name":"Scout","firstName":"Yechan","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/scout-ensij2cg.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-01-06T22:03:50.000Z","updatedAt":"2017-07-06T14:32:35.000Z","bios":{"en_US":"","de_DE":"<p>Ye-chan „Scout“ Lee ist ein Mid-Laner, der schon mit den besten Spielern der Welt zusammengearbeitet hat. Er ist das neueste Mitglied von Edward Gaming, aber lass dich davon nicht täuschen: Er ist alles andere als ein schwacher Anfänger. Scout begann seine Karriere als Ersatzspieler bei SK Telecom T1. Während die Mannschaft Faker und Easyhoon einsetzte, trainierte Scout fleißig und lernte von den besten Mid-Lanern der Welt. Danach wechselte er als Ersatzspieler für PawN zu Edward Gaming.\nScout fühlt sich mit den Champions im momentanen Metaspiel mehr als wohl und spielte im Sommer hauptsächlich mit Viktor und Azir. Doch er ist auch für seine Spielzüge mit Assassinen wie LeBlanc, Zed und Kassadin bekannt, die sich gerne weit vorwagen. Diese Weltmeisterschaft ist Scouts Gelegenheit, allen zu beweisen, dass er einer der besten Mid-Laner der Welt ist.</p>","es_AR":"<p>Ye-chan \"Scout\" Lee es un carrilero central que ha trabajado con algunos de los mejores en este negocio. Es uno de los miembros más recientes de Edward Gaming, pero no permitas que esto te engañe: no es un novato tonto. Scout inició su carrera cuando se unió a SK Telecom T1 como un sustituto para el carril medio. Mientras que el equipo usaba a Faker y a Easyhoon como sus iniciadores, Scout era un novato en entrenamiento que aprendía de los mejores carrileros centrales en el negocio. A partir de ahí, se movió a Edward Gaming para ser el sustituto de PawN.</p>\n\n<p>Scout se encuentra más que cómodo con los campeones que la meta demanda, jugando con Viktor y Azir durante el verano en la LPL. Pero es mejor conocido por el uso de asesinos que se adentran en lo profundo como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de Scout para probarse a sí mismo que es un carrilero central capaz por derecho propio.</p>","es_ES":"<p>Ye-chan \"Scout\" Lee es un jugador de la calle central que ha trabajado con los mejores. Es uno de los miembros más nuevos de Edward Gaming, pero que eso no os engañe: no es ningún novato cualquiera. Scout comenzó su carrera cuando se unió a SK Telecom T1 como suplente de la calle central. Mientras el equipo usaba a Faker y a Easyhoon como titulares, Scout entrenaba como novato y aprendía de los mejores jugadores de la calle central del mundo. Después se trasladó a Edward Gaming, donde se convirtió en el suplente de PawN.</p>\n\n<p>Scout está más que cómodo con los campeones que el metajuego requiere; ha jugado Viktor y Azir durante todo el verano en la LPL. Pero es más conocido por sus jugadas con asesinos como LeBlanc, Zed y Kassadin. Este Campeonato Mundial podría ser la oportunidad de demostrar su valía como un jugador de la calle central exitoso.</p>","pt_BR":"<p>Ye-chan “Scout” Lee é um jogador do meio que já trabalhou com os melhores do ramo. Ele é uma das adições mais recentes da Edward Gaming, mas não deixe que isso lhe engane: ele não é um simples calouro. Scout começou sua carreira quando entrou para a SK Telecom T1 como reserva da rota do meio. Enquanto a equipe tinha Faker e Easyhoon como titulares, Scout era um calouro em treinamento, aprendendo com os melhores meios da liga. Depois disso, ele se transferiu para a Edward Gaming e passou a ser o substituto de PawN.</p>\n<p>Scout se sente mais do que confortável com os campeões que o meta exige e jogou com Viktor e Azir por todo o verão na LPL. Mas ele é mais conhecido por jogar com assassinos que entram com força no confronto, como LeBlanc, Zed e Kassadin. Este Campeonato Mundial pode ser a chance de Scout mostrar que é um competente jogador do meio.</p>"},"foreignIds":{"TRKR1":"225044","TRLH1":"1001380033","TRLH2":"1001280003","TRLT3":"200000242"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1170,"slug":"cry","name":"Zet","firstName":"Seong-min","lastName":"Hae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/cry-62d7jepa.png","hometown":"South Korea","region":"LPL China","birthdate":null,"createdAt":"2016-03-03T00:59:25.000Z","updatedAt":"2017-07-06T14:42:23.000Z","bios":{"en_US":"","es_AR":"<p>Sung-min \"Cry\" Hae es el carrilero central suplente de ROX Tigers.</p>"},"foreignIds":{"TRKR1":"265084","TRLH1":"1001380064","TRLH2":"1001280034","TRLT3":"200000243"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1664,"slug":"megan","name":"Megan","firstName":"Liu-Yi","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/megan-900drhog.png","hometown":"China","region":"LPL China","birthdate":null,"createdAt":"2017-01-09T23:38:18.000Z","updatedAt":"2017-06-06T23:28:59.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1871,"slug":"ning","name":"Ning","firstName":"Zhen-Ning","lastName":"Gao","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-04-16T18:39:15.000Z","updatedAt":"2017-04-16T18:39:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1972,"slug":"audi","name":"Audi","firstName":"Aodi","lastName":"Zhao","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":"LPL China","birthdate":null,"createdAt":"2017-06-06T23:03:10.000Z","updatedAt":"2017-07-06T14:42:49.000Z","bios":{},"foreignIds":{"TRLT3":"200000245"},"socialNetworks":{},"champions":[],"liveGameTeam":41},{"id":1980,"slug":"west","name":"West","firstName":"Long","lastName":"Chen","roleSlug":"adcarry","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:18:02.000Z","updatedAt":"2017-06-06T23:18:02.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1981,"slug":"theshy","name":"TheShy","firstName":"Seung-Lok","lastName":"Kang","roleSlug":"toplane","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:24:15.000Z","updatedAt":"2017-06-06T23:24:15.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79},{"id":1982,"slug":"rio","name":"Rio","firstName":"Fu-Hua","lastName":"Wen","roleSlug":"jungle","photoUrl":null,"hometown":null,"region":null,"birthdate":null,"createdAt":"2017-06-06T23:28:00.000Z","updatedAt":"2017-06-06T23:28:00.000Z","bios":{},"foreignIds":{},"socialNetworks":{},"champions":[],"liveGameTeam":79}],"scheduleItems":[{"id":"AVx_gTNoQMQFcjhwbQ7H","content":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:match:e82c08f9-6a67-4c2c-944f-5fbbcac02c0f","scheduledTime":"2017-06-17T09:00:00.784+0000","tags":{"blockLabel":"2","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:bracket:71ee90de-dec4-4336-ac2f-3abde3774ffa","leagueLabel":"urn:rg:lolesports:global:league:league:7","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06"},"match":"e82c08f9-6a67-4c2c-944f-5fbbcac02c0f","tournament":"465a2d10-2a73-43cb-a627-f0c87b564f06","bracket":"71ee90de-dec4-4336-ac2f-3abde3774ffa","league":"7"}],"gameIdMappings":[],"videos":[{"id":7363,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:99d92452-f88f-46cf-93f8-d5fb7efdc20c","source":"https://www.youtube.com/embed/RRl3hdHd7nI?wmode=transparent&start=9076&rel=0","createdAt":"2017-06-17T18:11:36.000Z","updatedAt":"2017-06-17T18:11:36.000Z","game":"99d92452-f88f-46cf-93f8-d5fb7efdc20c"},{"id":7364,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:465a2d10-2a73-43cb-a627-f0c87b564f06:game:a17eef3b-a71f-434f-a485-24dfab595467","source":"https://www.youtube.com/embed/RRl3hdHd7nI?wmode=transparent&start=12202&rel=0","createdAt":"2017-06-17T18:12:00.000Z","updatedAt":"2017-06-17T18:12:00.000Z","game":"a17eef3b-a71f-434f-a485-24dfab595467"}],"htmlBlocks":[],"match":{"id":"e82c08f9-6a67-4c2c-944f-5fbbcac02c0f","name":"EDG-vs-IG","position":10,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"},{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],"games":{"a17eef3b-a71f-434f-a485-24dfab595467":{"id":"a17eef3b-a71f-434f-a485-24dfab595467","name":"G2","generatedName":"EDG|IG|G2|e82c08f96a674c2c944f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"},{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],"standings":{"result":[[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"}],[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}]],"timestamp":1497723303673,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"99d92452-f88f-46cf-93f8-d5fb7efdc20c":{"id":"99d92452-f88f-46cf-93f8-d5fb7efdc20c","name":"G1","generatedName":"EDG|IG|G1|e82c08f96a674c2c944f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"},{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],"standings":{"result":[[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"}],[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}]],"timestamp":1497723495347,"source":"manual","note":"Updated from HQ2","closed":true},"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"4b315ca3-9bd0-4df9-9e5e-bc75a93ab025":{"id":"4b315ca3-9bd0-4df9-9e5e-bc75a93ab025","name":"G3","generatedName":"EDG|IG|G3|e82c08f96a674c2c944f","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"},{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}],"scores":{},"revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"e4e23e39-c402-4d3d-baa7-1aa2e2c08209"}],[{"roster":"b4bc775a-2241-4829-81da-9c1a5e28126f"}]],"timestamp":1497723303673,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"b4bc775a-2241-4829-81da-9c1a5e28126f":0,"e4e23e39-c402-4d3d-baa7-1aa2e2c08209":1}}}