{"teams":[{"id":6,"slug":"ahq-e-sports-club","name":"ahq e-Sports Club","guid":"be6c7c1d-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ahq-e-sports-club-iozw902p.png","acronym":"AHQ","homeLeague":"urn:rg:lolesports:global:league:league:8","altLogoUrl":null,"createdAt":"2014-07-17T18:34:47.000Z","updatedAt":"2017-05-30T21:10:24.000Z","bios":{"en_US":"<p>ahq e-Sports Club is one of the top League of Legends teams in Taiwan, and they have consistently battled for the regional title. However, with multiple GPL Championship victories, ahq is now dead set on being the best in the world. Can they rise to new heights in 2017 and earn another spot at the World Championship?</p>\n<p>Coach: Shang-Ching \"Greentea\" Tsai</p>","fr_FR":"Ahq e-Sports Club est l'une des meilleures équipes de League of Legends à Taiwan. Elle a constamment été en lutte avec les champions du monde de la Saison 2, Taipei Assassins, pour le titre régional à Taiwan. Cependant, avec de nombreuses victoires en GPL, AHQ est sur les rails pour devenir la meilleure équipe du monde. Pourront-ils atteindre les sommets de leurs compatriotes de TPA et remporter le championnat du monde ?","pl_PL":"Ahq e-Sports Club jest jedną z najlepszych tajwańskich drużyn League of Legends. Regularnie mierzyli się w walce z mistrzami świata Sezonu Drugiego, Taipei Assassins, o tytuł mistrza regionalnego Tajwanu. Jednakże po kilku zwycięstwach w mistrzostwach GPL, AHQ pragnie zostać najlepszą drużyną na świecie. Czy uda im się osiągnąć taki sam sukces, jaki osiągnęli ich tajwańscy rywale TPA, i wygrać mistrzostwa świata?","de_DE":"<p>ahq e-Sports Club ist eine der besten „League of Legends“-Mannschaften in Taiwan. Sie haben immer wieder mit den Weltmeistern von Saison 2, den Taipei Assassins, um die Titel in Taiwan gekämpft. Mit mehreren Siegen bei der GPL Championship hat ahq jetzt jedoch nur noch ein Ziel: Sie wollen die besten der Welt werden. Können sie in die Fußstapfen ihrer taiwanesischen Landsleute treten und die Weltmeisterschaft gewinnen?</p>","es_ES":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends de Taiwán. No han dejado de luchar por el título regional de Taiwán contra los campeones mundiales de la segunda temporada, los Taipei Assassins. Sin embargo, con múltiples victorias en el campeonato GPL, ahq va camino de convertirse en el mejor equipo del mundo. ¿Podrán elevarse a las alturas de sus compañeros taiwaneses TPA y ganar el Campeonato Mundial?</p>","pt_BR":"A ahq e-Sports Club é uma das melhores equipes de League of Legends de Taiwan. Eles têm competido consistentemente com a Taipei Assassins, os Campeões Mundiais da 2º Temporada, pelo título regional taiwanês. Mas agora com diversas vitórias na GPL, a ahq está determinada a ser a melhor do mundo. Será que eles conseguirão alcançar as mesmas alturas que seus companheiros taiwaneses da TPA e vencer o Campeonato Mundial?","es_AR":"<p>ahq e-Sports Club es uno de los mejores equipos de League of Legends en Taiwán. Ha luchado constantemente con los Campeones Mundiales de la 2da Temporada, los Taipei Assasins, por el título Regional de Taiwán. Sin embargo, con varias victorias de Campeonato GPL, ahq ahora está concentrado completamente en ser el mejor equipo del mundo. ¿Podrán escalar hasta la cima conseguida por su compatriota equipo taiwanés TPA y ganar el Campeonato Mundial?</p>\n\n<p><strong>Entrenador: Chen \"Backstairs\" Yan-Fu</strong></p>"},"foreignIds":{"drupalId":"949"},"players":[20,34,35,302,407,408,1019],"starters":[20,35,302,407,408],"subs":[34,1019]},{"id":9,"slug":"sktelecom-t1","name":"SK telecom T1","guid":"be6c808b-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/sktelecom-t1-3mpugoym.png","acronym":"SKT","homeLeague":"urn:rg:lolesports:global:league:league:6","altLogoUrl":null,"createdAt":"2014-08-01T18:16:40.000Z","updatedAt":"2017-05-26T23:47:44.000Z","bios":{"en_US":"<p>SK telecom T1 is the best team in the history of League of Legends. With three World Championships under their belt from 2013, 2015 and 2016, no team comes close to their level of dominance. After a stellar run in 2015 that ended in their second title, SKT struggled to start 2016. They righted the ship by IEM Katowice, finishing first in Champions Spring 2016 and winning the 2016 Mid-Season Invitational.</p> \n\n<p>They hit another snag when they failed to reach the finals in Champions Summer 2016, falling to kt Rolster. But the SKT of old showed up right away at the 2016 World Championship, and Faker led the team to its second straight Worlds win. Entering 2017 with a roster somehow even more packed with talent, anything short of another World Championship would be a disappointment for SKT.</p>\n\n<p>Coach: Jeonggyun “KkOma” Kim</p>","fr_FR":"SK Telecom T1 est la meilleure équipe de l'histoire de League of Legends. Avec trois Championnats du monde à son palmarès en 2013, 2015 et 2016, aucune équipe n'approche de son niveau de domination. Suite à une performance sans faute en 2015 qui s'est soldée par un deuxième titre, SKT a commencé l'année 2016 plus difficilement. L'équipe est finalement parvenue à redresser la barre lors des IEM de Katowice, décrochant la première place du Champions Spring 2016 et remportant le Mid-Season Invitational 2016.\n\nElle s'est ensuite à nouveau retrouvée dans l'impasse en manquant de se qualifier pour la finale du Champions Summer 2016 contre KT Rolster. Mais SKT s'est vite remise sur pied au Championnat du monde et Faker lui a valu sa deuxième victoire consécutive au Mondial. Après avoir dominé la LCK ce printemps, SKT s'apprête à présent à participer au Mid-Season Invitational 2017, au Brésil, en tant que favorite incontestable. Les champions en titre aspirent à la première place et ils ne se contenteront de rien de moins.\n\nEntraîneur : Jeonggyun « KkOma » Kim\n","pl_PL":"SK Telecom T1 to najlepsza drużyna w historii League of Legends. Trzy razy wygrała Mistrzostwa Świata ― w 2013, 2015 i 2016 roku. Żadna inna drużyna nie zbliżyła się nawet do tego poziomu dominacji. Po rewelacyjnych występach w 2015 roku, które zakończyli zdobyciem drugiego tytułu, SKT z trudem zaczynali 2016 rok. Podwyższyli poziom lotów na IEM w Katowicach, kończąc na pierwszym miejscu Champions Spring 2016 i wygrywając Mid-Season Invitational 2016.\n\nKolejne spowolnienie nastąpiło, gdy nie zdołali dotrzeć do finałów Champions Summer 2016, przegrywając z KT Rolster. Ale dawne SKT wkrótce powróciło na Mistrzostwa Świata 2016, a Faker doprowadził drużynę do drugiej z rzędu wygranej na Mistrzostwach. Po zdominowaniu LCK tej wiosny SKT jadą na Mid-Season Invitational 2017 w Brazylii jako zdecydowani faworyci. Cokolwiek poniżej pierwszego miejsca będzie rozczarowaniem dla obecnych czempionów.\n\nTrener: Jeonggyun „KkOma” Kim\n","de_DE":"SK Telecom T1 ist die beste Mannschaft in der Geschichte von League of Legends. Keine andere Mannschaft ist so dominant wie der dreimalige Weltmeister, der sich diesen Titel in den Jahren 2013, 2015 und 2016 sichern konnte. Nach einer überragenden Vorstellung im Jahr 2015, die die Mannschaft mit ihrem zweiten Weltmeistertitel krönte, hatte SKT 2016 Startschwierigkeiten. Beim IEM Katowice konnten sie jedoch das Ruder wieder herumreißen, woraufhin sie den Frühjahrs-Split der LCK 2016 und das Mid-Season Invitational 2016 gewannen.\n\nIm Sommer-Split der LCK 2016 folgte jedoch der nächste Dämpfer, als sie von KT Rolster besiegt wurden und das Finale nicht erreichten. Doch SKT fand vor der Weltmeisterschaft 2016 wieder zu alter Stärke zurück und Faker führte die Mannschaft zu ihrem zweiten WM-Titel hintereinander. Nach einer dominanten Vorstellung im diesjährigen Frühjahrs-Split der LCK kommt SKT als Favorit zum Mid-Season Invitational 2017 in Brasilien. Alles andere als der erste Platz wäre für die regierenden Champions eine Enttäuschung.\n\nTrainer: Jeonggyun „KkOma“ Kim\n","es_ES":"SK telecom T1 es el mejor equipo de la historia de League of Legends. Ganadores de tres Campeonatos Mundiales (en 2013, 2015 y 2016), ningún equipo se acerca a su nivel de superioridad. Tras un año estelar en 2015 que les hizo ganarse su segundo título, el comienzo de 2016 no fue tan sencillo para SKT. Recobraron la fuerza a partir del IEM Katowice, acabaron primeros en el Champions Spring de 2016 y ganaron el Mid-Season Invitational 2016.\n\nSe encontraron con un nuevo obstáculo cuando no lograron llegar a la final del Champions Summer 2016, tras perder contra KT Rolster. No obstante, el SKT al que estábamos acostumbrados volvió a dar la cara en el Campeonato Mundial de 2016, y Faker lideró al equipo hasta su tercer título de campeón mundial. Tras dominar en la LCK esta primavera, SKT llega al Mid-Season Invitational 2017 en Brasil como el máximo favorito. Solo el primer puesto estaría a la altura de las expectativas de los actuales campeones.\n\nEntrenador: Jeonggyun ''KkOma'' Kim\n","pt_BR":"<p>SK Telecom T1 é a melhor equipe da história de League of Legends. Com três Campeonatos Mundiais conquistados em 2013, 2015 e 2016, nenhuma equipe se aproxima da sua soberania. Depois de um jogo excelente em 2015 que resultou no seu segundo título, a SKT começou 2016 com dificuldades. Mas eles conseguiram virar o jogo na IEM Katowice, terminando em primeiro no Champions Spring 2016 e vencendo o Mid-Season Invitational 2016.</p>\n\n<p>Eles encontraram outro problema quando não conseguiram chegar à final no Champions Summer 2016, perdendo para KT Rolster. Mas a velha SKT se mostrou imediatamente no Campeonato Mundial 2016, e Faker liderou a equipe à sua segunda vitória mundial consecutiva. Depois de dominar a LCK desta primavera, a SKT avança para o Mid-Season Invitational 2017, no Brasil, como uma das grandes favoritas. Qualquer coisa menos que o primeiro lutar seria uma decepção para os campeões reinantes.</p>\n\n<p>Técnico: Jeonggyun \"KkOma\" Kim</p>\n","es_AR":"<p>Muchos consideran que SKT T1 es uno de los mejores equipos de League of Legends del mundo, con un primer lugar en los Campeonatos Mundiales 2013 y 2015, y varias finales en la OGN Champions. Su dominio en el 2015 era motivo de gran admiración. SKT se llevó a casa el primer lugar en la Champions de primavera y verano, y luego cerró el año con una actuación casi invicta que le mereció el primer lugar en el Campeonato Mundial 2016.</p>\n\n<p>Luego de su participación estelar en el 2015 y de pasar por varios cambios en el plantel, SKTelecom no tuvo un buen inicio del 2016. Sin embargo, brillarían luego en la competencia con una actuación invicta en el IEM Katowice. Después de eso, todo fue un trámite para SKTelecom. Obtuvieron un primer lugar en la Champions Spring 2016 y nuevamente en el torneo por invitación de mitad de temporada. Sin embargo, el equipo se vio en dificultades y no llegó a la final del torneo de clausura de la LCK 2016. Incluso después de terminar tan mal, SKTelecom siguió siendo uno de los mejores equipos del mundo, y está determinado a limpiar su imagen con otro trofeo mundial.</p>\n\n<p><strong>Entrenador: Kim \"KkOma\" Jeong-gyun</strong></p>","ko_KR":"<p>SKT T1은 전 세계에서 리그 오브 레전드 최강 팀 중 하나로 명성이 자자합니다. 시즌 3 월드 챔피언십 및 2015 월드 챔피언십뿐만 아니라 OGN 챔피언스에서 여러 차례 수위에 올랐죠. SKT T1이 2015년에 보여준 포스는 그야말로 어마어마했습니다. 2015 챔피언스 스프링과 서머에서 연달아 우승한 SKT T1은 2015 월드 챔피언십에서는 통틀어 단 한 경기만을 내주고 월드 챔피언으로 등극하며 한 해를 마무리했죠.</p>\n\n<p>영광의 2015년이 끝난 후 로스터 변경으로 인해 SKT T1는 2016년 시즌 초반 힘겨운 시기를 보냈습니다. 하지만 그것도 잠시, IEM Katowice에서 무패의 기록으로 적을 박살내며 포스가 다시 살아났죠. 그 이후 SKT T1은 여느 때처럼 다시 2016 챔피언스 스프링에서 정상에 섰습니다. 결승에서 ROX Tigers를 꺾은 것은 시작일 뿐입니다. MSI에서 SKT T1은 또 다른 국제 대회 트로피를 쟁취하기 위해 다시 전장에 나설 것입니다.</p>"},"foreignIds":{"drupalId":"684"},"players":[46,327,403,404,715,1025,1026,1033],"starters":[46,327,403,404,715],"subs":[1025,1026,1033]}],"players":[{"id":20,"slug":"an","name":"AN","firstName":"Chun-An","lastName":"Chou","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/an-1zhs9hs7.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:17.000Z","updatedAt":"2017-07-06T14:32:41.000Z","bios":{"en_US":"<p>Chun-An \"AN\" Chou is a fan favorite in the LMS. His quirky personality and aggressive AD carry play style come together in an endearing package. But those same traits sometimes surprise his own teammates. Much like his teammate Mountain, AN maintains a stoic disregard for win/loss records in scrims, and will play at his own pace -- and in his own way.\n</p>\n<p>\nBut when AN finds he isn't playing well, he does what every pro player would do to get out of a slump -- blame it on a lack of exercise. The solution? Easy! Go for a run in the middle of the night. And then wake up at 9 AM and go swimming, just to be safe. Of course, all that exercise takes a toll, so he will likely end up faltering in the next day’s practice...because of too much exercise. It’s a vicious cycle.\n</p>","fr_FR":"<p>Chun-An « AN » Chou est l'un des joueurs préférés des fans des LMS. Sa personnalité excentrique et son style de jeu agressif de carry AD constituent une association attachante. Mais ces mêmes caractéristiques peuvent parfois surprendre ses propres coéquipiers. À l'instar de Mountain, AN semble ne pas du tout s'intéresser au ratio victoires/défaites lors des matchs d'entraînement et joue à son rythme... et à sa façon.\n</p>\n<p>\nMais quand AN trouve qu'il ne joue pas bien, il fait ce que tout joueur pro fait pour sortir de l'ornière : il dit qu'il manque d'exercice. La solution ? Facile ! Partir courir au milieu de la nuit. Et au réveil, à 9 heures du matin, aller nager, juste au cas où. Bien sûr, faire autant de sport, ça peut fatiguer, et il risque de ne pas briller lors des entraînements du lendemain... à cause de trop d'exercice. Un véritable cercle vicieux.\n</p>","pl_PL":"<p>Chun-An „AN” Chou to ulubieniec fanów w LMS. Jego ciekawa osobowość i agresywna gra tworzą razem wyjątkowy pakiet. Jednak potrafi on też zaskoczyć swoich towarzyszy. Tak jak Mountain, AN nie przejmuje się zwycięstwami i porażkami w meczach treningowych i gra na swój własny sposób.\n</p>\n<p>\nKiedy jednak przestaje mu iść, robi to, co każdy zawodowiec – zwala winę na brak ćwiczeń. Rozwiązanie? To proste! Wystarczy trochę się przebiec w środku nocy. A potem pobudka o 9 rano i jeszcze trochę pływania dla pewności. Oczywiście ćwiczenia fizyczne są męczące, przez co zdarza mu się słabsza dyspozycja następnego dnia... z powodu przećwiczenia. Zaklęty krąg.\n</p>","de_DE":"<p>Chun-An „AN“ Chou ist der Fan-Liebling der LMS. Seine schrullige Persönlichkeit und sein aggressiver Spielstil mit AD-Carrys ergeben ein liebenswertes Gesamtpaket. Aber mit genau diesen Eigenschaften überrascht er manchmal seine Teamkameraden. Ähnlich wie seinem Teamkameraden Mountain sind AN die Siege und Niederlagen in Übungsspielen egal, und er spielt immer in seinem eigenen Tempo – und auf seine eigene Art.</p>\n\n<p>Aber wenn AN das Gefühlt hat, nicht gut zu spielen, tut er, was jeder Profi-Spieler tun würde – er schiebt es auf mangelnde Bewegung. Und was tut er dann? Ganz einfach! Er geht mitten in der Nacht joggen. Und dann steht er um 09:00 Uhr morgens auf und geht schwimmen, nur zur Sicherheit. Natürlich muss er dann der ganzen Bewegung Tribut zollen und kommt in den Übungsspielen nicht richtig in die Gänge … weil er zu viel Bewegung gemacht hat. Ein wahrer Teufelskreis.</p>","es_ES":"<p>Chun-An ''AN'' Chou es el favorito de los fans en la LMS. Su extravagante personalidad y su estilo de juego agresivo como AD carry conforman un preciado pack, pero esas mismas virtudes sorprenden a su equipo en más de una ocasión. Como su compañero Mountain, AN no tiene en cuenta las victorias y derrotas de las partidas de práctica, así que juega a su ritmo y por su cuenta,</p>\n\n<p>pero cuando AN considera que no está jugando bien, hace lo que haría cualquier profesional para superar un bache: achacarlo a la falta de ejercicio. ¿La solución? ¡Muy fácil! Salir a correr a medianoche. Luego se despierta a las nueve de la mañana para ir a nadar y sentirse bien. Por supuesto, todo ejercicio tiene su precio, así que puede que acabe flaqueando en el entrenamiento del día siguiente por haber hecho demasiado ejercicio. Es un círculo vicioso.</p>","pt_BR":"<p>Chun-An \"AN\" Chou é o favorito dos fãs na LMS. Sua personalidade peculiar e estilo de jogo agressivo com atiradores formam um pacote perigoso. Mas essas mesmas qualidades às vezes surpreendem até mesmo seus próprios aliados. Assim como seu companheiro Mountain, AN também mostra uma negligência estoica de vitórias e derrotas durante os treinamentos e gosta de jogar a seu próprio passo e de seu próprio jeito.</p>\n\n<p>No entanto, quando AN vê que não está jogando bem, ele faz o que todo jogador profissional faria para sair de uma crise: ele reclama que não tem se exercitado. A solução? Fácil! Ir para uma caminhada no meio da noite. E quem sabe acordar às 9 da manhã para uma nataçãozinha, só para ter certeza. É claro que todo esse exercício tem um preço, então ele provavelmente vai acabar super cansado na prática do dia seguinte... por ter se exercitado demais. É um ciclo vicioso.</p>","es_AR":"<p>Chun-An \"AN\" Chou es uno de los favoritos de los simpatizantes en LMS. Su extravagante personalidad y estilo de juego de acarreo con daño de ataque agresivo se reúnen en un paquete adorable. Pero esas mismas características a veces sorprenden a sus propios compañeros de equipo. De manera muy similar a su compañero Mountain, AN mantiene una estoica despreocupación por los registros de victorias y derrotas en las actuaciones, por lo que juega a su propio ritmo y a su propia manera.</p>\n\n<p>Pero cuando AN encuentra que no está jugando bien, hace lo que cualquier jugador profesional haría: culpa a una falta de ejercicio. ¿La solución? ¡Sencillo! Salir a correr en la mitad de la noche! Y luego levantarse a las 9 AM para ir a nada, solo para estar seguro. Desde luego que todo el ejercicio se pasa de la cuenta, por lo que probablemente falte al siguiente día de práctica... por culpa de mucho ejercicio. Es un círculo vicioso.</p>"},"foreignIds":{"drupalId":"1002","TRLH1":"1001380125","TRLH2":"1001280095","TRLH3":"1001160046","TRLH4":"1001160046","TRTW":"200000149","TRLT3":"200000260"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":34,"slug":"westdoor","name":"Westdoor","firstName":"Shu-Wei","lastName":"Liu","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/westdoor-e3yh8alc.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:30:57.000Z","bios":{"en_US":"<p>Shu-Wei \"Westdoor\" Liu is one of the most storied players in Taiwan, reaching Challenger on the Taiwan, North American, and Korean servers. Seeing Westdoor lock in Twisted Fate was considered guaranteed victory back in 2012. Even now it strikes fear into his opponents, though he has become better known for his godlike Fizz mechanics.\n</p>\n<p>\nIn contrast to his dynamic playstyle in-game, Westdoor is one of the quietest players on ahq e-Sports club in real life, often eating alone. But he is also the undisputed team captain. When his teammates are unsure of what to do, they look to him for guidance -- and he is always there to help push them further. As he explains, “If you have a dream, go chase it. Don’t give up until you grab it.” Westdoor is also the least likely to complain about practice -- in part because he lives and breathes Solo Queue. To top off the man and the legend, Westdoor spends his downtime between queues reading historical and science fiction novels, sharing favorites with his teammate Mountain. A gentleman, a scholar, a captain, and a friend. Is there anything Westdoor can’t do better than us?\n</p>","pl_PL":"<p>Shu-Wei „Westdoor” Liu to jeden z najlepszych graczy w Tajwanie – udało mu się trafić do kręgu Pretendenta w Tajwanie, Ameryce Północnej i Korei. Wybranie przez Westdoora Twisted Fate'a było gwarancją zwycięstwa w 2012 roku. Nawet dziś przeraża to przeciwników, chociaż gracz stał się znany z niesamowitej gry Fizzem.\n</p>\n<p>\nDla kontrastu z jego popisową grą Westdoor jest jednym z najcichszych graczy w klubie ahq i często jada sam. Jest jednak niezaprzeczalnie kapitanem drużyny. Kiedy towarzysze z drużyny nie wiedzą, co robić, traktują go jak przewodnika, a on zawsze staje na wysokości zadania. Sam wyjaśnia to tak: „Jeśli masz marzenie, musisz za nim gonić. Nie poddawaj się, póki się nie spełni”. Westdoor najrzadziej też narzeka na treningi, głównie dlatego, że niemal żyje w kolejce solo. Obrazu tej legendarnej postaci dopełnia fakt, że wolne chwile spędza na czytaniu książek historycznych i science fiction wraz ze swoim towarzyszem, Mountainem. Gentleman, uczony, kapitan i przyjaciel. Czy jest coś, czego Westdoor nie robi lepiej niż my?\n</p>","fr_FR":"<p>Shu-Wei « Westdoor » Liu est l'un des joueurs qui a le plus fait parler de lui à Taïwan, ayant atteint le palier Challenger sur les serveurs taïwanais, nord-américains et coréens. Quand Westdoor parvenait à jouer Twisted Fate en 2012, on pouvait considérer que la partie était jouée d'avance. Et encore aujourd'hui, cette combinaison peut effrayer ses adversaires à juste titre, bien qu'il soit depuis devenu particulièrement réputé pour sa maîtrise impressionnante de Fizz.\n</p>\n<p>\nAlors qu'il se montre incroyablement dynamique lors d'une partie, Westdoor est l'un des joueurs les plus discrets d'ahq e-Sports club dans la vie réelle, mangeant souvent seul. Ce qui ne l'empêche pas d'être le capitaine indiscuté de l'équipe. Quand ses coéquipiers ne savent trop quoi faire, ils se tournent vers lui... et il est toujours prêt à les aider à aller plus loin. Comme il le dit : « Si vous avez un rêve, pourchassez-le. N'abandonnez pas avant de l'avoir atteint. » Westdoor est également le moins enclin à se plaindre de l'entraînement, certainement parce qu'il adore jouer en file solo. Pour terminer de définir l'homme et la légende, il faut savoir que Westdoor passe tout son temps libre à lire des romans historiques ou de science-fiction, partageant ses livres préférés avec son coéquipier Mountain. Gentleman, érudit, capitaine et ami. Existe-t-il une chose que Westdoor ne sait pas faire mieux que nous ?\n</p>","de_DE":"<p>Shu-Wei „Westdoor“ Liu hat die Challenger Series in Taiwan, Nordamerika und Korea erreicht und gilt somit als einer der vielseitigsten Spieler in Taiwan. 2012 sprach man von einem sicheren Sieg, wenn Westdoor Twisted Fate auswählte. Und auch heute fürchten sich seine Gegner noch davor, auch wenn er jetzt eher für seine unglaublichen Spielzüge mit Fizz bekannt ist.</p>\n\n<p>Im Gegensatz zu seinem dynamischen Spielstil ist Westdoor im wahren Leben der ruhigste Spieler bei ahq e-Sports Club, der meistens sogar alleine isst. Aber gleichzeitig ist er der unangefochtene Teamleiter. Wenn seine Teamkameraden nicht genau wissen, was sie tun sollen, warten sie auf seine Führung – und er ist immer zur Stelle, um sie weiter voranzutreiben. Er erklärt das so: „Wenn du einen Traum hast, musst du ihn verfolgen. Und du darfst nicht aufhören, bevor er wahr geworden ist.“ Westdoor würde sich auch niemals über Training beschweren – was zum Teil auch daran liegt, dass die Solo-Warteschlange sein Zuhause ist. Und um der Legende noch einen draufzusetzen, liest Westdoor in seiner Freizeit Geschichts- und Science-Fiction-Romane, die er auch gerne mit seinem Teamkameraden Mountain teilt. Ein Gentleman, ein Gelehrter, ein Leiter und ein Freund. Gibt es eigentlich nichts, was Westdoor nicht besser kann als wir?</p>","es_ES":"<p>Shu-Wei ''Westdoor'' Liu es uno de los jugadores más históricos de Taiwán, y ha conseguido llegar al nivel Aspirante en los servidores de Taiwán, Norteamérica y Corea. En 2012, si Westdoor elegía a Twisted Fate, la victoria estaba garantizada. Incluso hoy en día levanta el pánico entre los rivales, aunque ahora es más famoso por su increíble manejo de Fizz.</p>\n\n<p>En contraste con su estilo de juego dinámico en partida, Westdoor es uno de los jugadores más callados de ahq e-Sports Club en la vida real, y suele comer solo, pero no cabe duda de que es el capitán del equipo. Cuando sus compañeros no tienen claro qué hacer, lo miran para que les guíe, y siempre les ayuda a llegar más lejos. Como él mismo afirma: ''Si tienes un sueño, ve a por él. No te rindas hasta que lo consigas''. Westdoor es también el que menos se queja a la hora de practicar, en parte porque le encanta la cola en solitario. Para rematar al hombre y la leyenda, Westdoor pasa su tiempo libre entre colas leyendo novelas históricas y de ciencia ficción, y comparte sus favoritas con su compañero de equipo Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Habrá algo en lo que Westdoor no logre ser mejor que nosotros?</p>","pt_BR":"<p>Shu-Wei \"Westdoor\" Liu é um dos jogadores mais lendários em Taiwan, conseguindo alcançar o nível Desafiante em Taiwan, América do Norte e Coreia ao mesmo tempo. Ver Westdoor escolher Twisted Fate era considerado uma vitória garantida em 2012. Até mesmo hoje ele ainda põe medo em seus oponentes, apesar de ter ficado mais conhecido por suas façanhas surreais com Fizz.</p>\n\n<p>Em contraste de seu estilo de jogo completamente dinâmico dentro do jogo, Westdoor é um dos jogadores mais quietos da ahq e-Sports Club na vida real, sempre almoçando sozinho em seu canto. Mas ele também é um capitão de equipe indiscutível. Quando seus companheiros não se sentem confiantes sobre o que fazer, eles o procuram para guiá-los e ele sempre está do lado deles para ajudar a melhorá-los. E é como ele diz, “Se você tem um sonho, vá atrás dele. Não desista até alcançá-lo”. Westdoor também é o menos provável de reclamar dos treinos, em parte porque a vida dele é a Fila Solo, mas além disso, a lenda também usa seu tempo livre entre as filas para ler livros de contos históricos e Sci-Fi, sempre compartilhando seus favoritos com seu companheiro Mountain. Um cavalheiro, estudioso, capitão e amigo. Existe alguma coisa em que o Westdoor não é bom?</p>","es_AR":"<p>Shu-Wei \"Westdoor\" Liu es uno de los jugadores más conocidos de Taiwán, y llegó a Aspirante en los servidores de Taiwán, Norteamérica y Corea. Ver a Westdoor en Twisted Fate se consideraba una victoria segura en el 2012. Aún ahora inspira temor en sus oponentes, aunque se ha vuelto más famoso por su mecánica divina con Fizz.</p>\n\n<p>En contraste con su dinámico estilo de juego, Westdoor es uno de los jugadores más tranquilos en ahq e-Sports club en la vida real, llegando incluso a comer varias veces en solitario. Sin embargo, es también el capitán indiscutido del equipo. Cuando sus compañeros no están seguros sobre qué hacer, acuden a su guía. Él siempre está disponible para ayudar a hacer que las cosas avancen más. Como bien dice, \"Si tienes un sueño, ve por él. No te rindas hasta que lo hayas cumplido\". Westdoor es también quien posee la menor posibilidad de quejarse sobre las prácticas, en parte porque vive y respira en cola individual. Por sobre el hombre y la leyenda, Westdoor pasa su tiempo inactivo entre colas leyendo material histórico y novelas de ciencia ficción, compartiendo sus favoritos con su compañero Mountain. Un caballero, un erudito, un capitán y un amigo. ¿Hay algo que Westdoor no haga mejor que nosotros?</p>"},"foreignIds":{"drupalId":"948","TRLH1":"1001380124","TRLH2":"1001280094","TRLH3":"1001160045","TRLH4":"1001160045","TRTW":"200000008","TRLT3":"200000262"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":35,"slug":"albis","name":"Albis","firstName":"Jia-Wei","lastName":"Kang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/albis-7h5uw9xi.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2014-07-16T22:59:22.000Z","updatedAt":"2017-07-06T14:23:18.000Z","bios":{"en_US":"<p>Jia-Wei “Albis” Kang is the silent protector of ahq e-Sports Club. While he’s normally modest and reserved, he’s not afraid to spring into action to help his teammates both in and out of game. The LMS veteran has built a large fanbase over the years, earning him 43.4 percent of the support vote.</p>\n\n<p>Albis’s playmaking skills on the Rift were on full display at Worlds, when he played Bard to great effect in the Group Stage. However, he struggled on other champions, and AHQ failed to make it out of their group.</p>","fr_FR":"<p>Chia Wei \"Albis\" Kang est le protecteur silencieux d'ahq e-Sports Club. Même s'il est d'ordinaire modeste et réservé, il n'a pas peur de passer à l'action quand il s'agit d'aider ses coéquipiers, dans et hors jeu. Le vétéran LMS s'est créé une large base de fans au fil des ans, lui permettant d'obtenir 43,4 pour cent des votes support.</p>\n\n<p>Albis a montré tout ce dont il était capable sur la Faille lors du Mondial en jouant Bard de manière impressionnante dans la phase de groupe. Toutefois, il a du mal avec d'autres champions et AHQ n'a pas réussi à sortir gagnant de son groupe. Alors que l'événement All-Stars 2016 ne sera que pur chaos, l'équipe d'Albis peut compter sur lui pour les mener à la victoire.</p>","pl_PL":"Chia Wei „Albis” Kang to milczący obrońca ahq e-Sports Club. Chociaż zazwyczaj jest skromny i zamknięty w sobie, nie boi się rzucić do akcji, gdy trzeba pomóc kolegom, zarówno w grze, jak i poza nią. Ten weteran LMS zebrał w ciągu lat wielką bazę fanów, którzy zapewnili mu 43,4 procenta głosów dla zawodnika wsparcia.</p>\n\nAlbis w pełni zaprezentował swoje umiejętności kreowania rozgrywki na Summoner’s Rift podczas Mistrzostw, gdy niezwykle skutecznie grał Bardem w fazie grupowej. Jednak kiepsko sobie radził z innymi bohaterami i AHQ nie zdołali wydostać się z grupy. Chociaż wydarzenie All-Star 2016 będzie pełne zamieszania, drużyna Albisa może mieć nadzieję, że on zdoła poprowadzić ją do zwycięstwa.\n","de_DE":"<p>Chia Wei „Albis“ Kang ist der stille Beschützer des ahq e-Sports Club. Obwohl er normalerweise eher bescheiden und reserviert ist, hat er weder im Spiel noch im echten Leben Angst, seinen Teamkameraden zur Hilfe zu kommen. Der Veteran der LMS hat sich über die Jahre eine große Fangemeinde aufgebaut und wurde mit 43,4 % der Stimmen zum Supporter gewählt.</p>\n\n<p>Albis Fähigkeiten als Spielmacher in der Kluft waren bei der Weltmeisterschaft gut zu erkennen, als er in der Gruppenphase mit Bard das Kommando übernahm. Dafür hatte er jedoch mit anderen Champions Probleme und AHQ konnte sich nicht für die K.-o.-Phase qualifizieren. Doch Albis Team kann sich darauf verlassen, dass er sie beim All-Stars-Event 2016 durch das Chaos zum Sieg führen wird.</p>","es_ES":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de apoyo.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó a Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","pt_BR":"<p>Chia Wei “Albis” Kang é o protetor silencioso da ahq e-Sports Club. Apesar de normalmente ser modesto e reservado, ele não tem medo de entrar em ação para ajudar seus companheiros de equipe, tanto dentro como fora do jogo. O veterano da LMS construiu uma grande base de fãs ao longo dos anos, rendendo-lhe 43,4% dos votos de suporte.</p>\n\n<p>A habilidade em fazer jogadas em Summoner’s Rift de Albis foi exibida no Mundial, onde ele brilhou de Bardo na Fase de Grupos. Contudo, ele teve dificuldades em outros Campeões e a AHQ não conseguiu sair de seu grupo. Quando o bicho estiver pegando no Evento All-Star 2016, a equipe de Albis pode ter a certeza de que ele os ajudará a procurar a vitória.</p>","es_AR":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<p>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>","cs_CZ":"<p>Chia Wei „Albis“ Kang je tichý ochránce týmu ahq e-Sports Club. Ačkoliv bývá tichý a nenápadný, nebojí se vrhnout po hlavě do akce, aby pomohl svým kolegům – a to jak ve hře, tak i mimo ni. Tento veterán LMS si za svou dlouholetou kariéru vybudoval bohatou fanouškovskou základnu, která mu při hlasování vynesla podporu ve výši 43,4 %.</p>\n\n<p>Albisovy kreativní herní dovednosti jasně zazářily na MS, kde ve skupině nesmírně efektivně řádil s Bardem. S ostatními šampiony se mu však až tak nedařilo a AHQ ze své skupiny nakonec nepostoupili. Turnaj All-Star 2016 sice bude hrozný masakr, v Albisovi však jeho tým najde pevnou oporu, jež jej může dovést za vítězstvím.</p>","el_GR":"<p>Ο Chia Wei “Albis” Kang είναι ο σιωπηλός προστάτης των ahq e-Sports Club. Συνήθως είναι συγκρατημένος και ντροπαλός, αλλά δεν φοβάται να δράσει αποφασιστικά για να βοηθήσει τους συμπαίκτες του εντός και εκτός παιχνιδιού. Είναι ένας βετεράνος του LMS που έχει αποκτήσει ένα πολύ μεγάλο κοινό όλα αυτά τα χρόνια. Δεν είναι παράξενο, λοιπόν, που πήρε το 43,4% των ψήφων για τη θέση του υποστηρικτή.</p>\n\n<p>Ο Albis έδειξε σε όλους πόσο καλός οργανωτής είναι στο Παγκόσμιο Πρωτάθλημα, όπου έπαιξε φοβερά με τον Βάρδο στη Φάση Ομίλων. Ωστόσο, δεν τα πήγε εξίσου καλά με άλλους ήρωες και οι AHQ δεν κατάφεραν να προκριθούν. Παρόλο που το Τουρνουά All-Star 2016 προβλέπεται αρκετά χαοτικό, οι συμπαίκτες του Albis μπορούν να τον εμπιστευτούν για να τους οδηγήσει στη νίκη.</p>","hu_HU":"Chia Wei „Albis” Kang az ahq e-Sports Club csendes védelmezője. Általában szerény és visszafogott, de a játékban (és azon kívül is) a csapattársai segítségére siet, ha szükség van rá. Az LMS-veteránnak továbbra is jelentős rajongótábora van, akik a támogatói szavazatok 43,4%-át adták le rá.</p>\n\nAlbis a vébén megmutatta, hogy milyen jó irányító, amikor Barddal játszott remekül a csoportkörben. Más hősökkel viszont nem volt sok szerencsére, így az AHQ nem jutott tovább a csoportjából. Bár a 2016-os All-Star gálán őrült meccsekre lehet számítani, Albisra bizalommal hagyatkozhat a csapata.\n","it_IT":"Chia Wei \"Albis\" Kang è il silenzioso protettore degli ahq e-Sports Club. È modesto e riservato, ma anche sempre pronto a scattare in aiuto dei suoi compagni, sia in partita che fuori. Questo veterano della LMS ha attirato a sé nel corso degli anni intere legioni di fan, che l'hanno premiato con il 43,4% dei voti nella categoria Supporto.\n</p>\nLe capacità di regista di Albis nella Landa sono state sotto gli occhi di tutti ai Mondiali, quando si è esibito con il suo Bard nella fase a gironi. Non è riuscito, tuttavia, a replicare il successo con gli altri campioni, e gli ahq non sono riusciti a proseguire la loro avventura nel torneo. Anche se l'All-Star 2016 sarà caratterizzato da un immenso caos, la squadra di Albis potrà contare sulle sue abilità di organizzatore per puntare alla vittoria.\n","ro_RO":"Chia Wei ''Albis'' Kang este protectorul tăcut al celor din ahq e-Sports Club. Cu toate că în mod normal e modest și tăcut, nu-i e teamă să intre în acțiune pentru a-și ajuta coechipierii atât în joc, cât și în afara lui. Veteranul din LMS a strâns un număr mare de fani de-a lungul anilor, obținând 43,4 la sută din voturile pentru suport.</p>\n\nPuterea lui Albis de a întoarce sorții în Rift a uimit spectatorii la Mondiale, când a jucat cu Bard cu mult succes în faza grupelor. Totuși, a avut probleme cu alți campioni, iar AHQ nu a reușit să treacă de grupe. Cu toate că All-Star Event va fi un turneu nebun și haotic, echipa lui Albis se poate baza pe un lucru: că-i poate conduce către victorie.\n","es_MX":"<p>Chia Wei \"Albis\" Kang es el protector silencioso de ahq e-Sports Club. Aunque normalmente es modesto y reservado, no tiene miedo de pasar a la acción para ayudar a sus compañeros de equipo tanto dentro como fuera de la partida. El veterano de la LMS se ha ganado a sus fans a lo largo de los años y gracias a ello ha conseguido un 43,4 % de los votos para el rol de soporte.</p>\n\n<P>Las habilidades estratégicas de Albis en la Grieta se pusieron de manifiesto en el Mundial, cuando jugó al Bardo con grandes resultados en la fase de grupos. Sin embargo, no destacó tanto con otros campeones y AHQ no logró clasificarse. Aunque el All-Star Event 2016 estará lleno de caos, el equipo de Albis puede confiar en que este será capaz de guiarlos hasta la victoria.</p>"},"foreignIds":{"drupalId":"945","TRLH1":"1001380126","TRLH2":"1001280096","TRLH3":"1001360065","TRLH4":"1001310065","TRTW":"200000104","TRLT3":"200000261"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":46,"slug":"faker","name":"Faker","firstName":"Sanghyeok","lastName":"Lee","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/faker-euaqlz0c.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2014-07-28T19:09:11.000Z","updatedAt":"2017-07-06T14:24:48.000Z","bios":{"en_US":"<p>Sanghyeok \"Faker\" Lee is an icon of modern esports. Known as “The Demon King” in his homeland of South Korea, Faker’s quiet and respectful demeanor in person does little to alert bystanders to his dominance on the Rift. But then he steps onto the stage and shatters the limits of what we thought was possible with just a mouse and a keyboard. Faker was so untouchable in Korea for so long that his opponents started saying he had a 3rd Summoner Spell -- how else could he be so strong?</p>\n\n<p>Faker has already raised the bar for what a mid laner is expected to deliver, lifting the Summoner's Cup at three World Championships, once in 2013, again in 2015, and the third time in 2016. He has also netted his team trophies at Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016, and the 2016 Mid-Season Invitational (whew). After winning every international event that League of Legends offered in 2016, Faker and SKT are looking to sweep the international stage once again in 2017.</p>","fr_FR":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pl_PL":"Sanghyeok „Faker” Lee jest ikoną nowoczesnego e-sportu. Znany w swojej ojczystej Korei Południowej jako „Demoniczny Król”, Faker sprawia wrażenie osoby spokojnej i uprzejmej. Nic nie zdradza tego, że potrafi absolutnie dominować na Rifcie. A potem wchodzi na scenę i przekracza granice wszystkiego, co wydawało się możliwe do osiągnięcia za pomocą zwykłej myszy i klawiatury. Faker był w Korei niepokonany od tak dawna, że przeciwnicy zaczęli posądzać go o stosowanie trzeciego czaru przywoływacza — jak inaczej mógłby być tak silny?\n\nFaker znacznie podniósł poprzeczkę oczekiwań wobec zawodnika środkowej alei, trzykrotnie zdobywając Puchar Przywoływacza na Mistrzostwach Świata — po raz pierwszy w 2013 roku, potem w 2015 roku, a po raz trzeci w 2016 roku. Zdobył także trofea dla swojej drużyny podczas Champions Summer 2013, Champions Winter 2013−2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 i Mid-Season Invitational 2016 (uff!). Po wygraniu każdego międzynarodowego turnieju, jaki League of Legends oferowało w 2016 roku, Faker i SKT zamierzają zabrać do domu kolejny międzynarodowy tytuł zdobyty na Mid-Season Invitational 2017.\n","de_DE":"Sanghyeok „Faker“ Lee ist eine Ikone des modernen E-Sports. In seinem Heimatland Südkorea als der „Dämonenkönig“ bekannt, alarmiert sein ruhiges und stets höfliches Verhalten Zuschauende nur sehr selten über seine absolute Dominanz in der Kluft. Aber dann betritt er die Bühne und beweist uns, dass seine Fähigkeiten mit Maus und Tastatur keine Grenzen kennen. Faker war in Korea so lange unantastbar, dass seine Gegner schon glaubten, er hätte einen dritten Beschwörerzauber – wie hätte er sonst so stark sein können?\n\nFaker konnte den Beschwörerpokal bereits in den Jahren 2013, 2015 und jetzt auch 2016 in die Höhe stemmen und hat die Messlatte für Mid-Laner hoch gelegt. Außerdem sicherte er seiner Mannschaft Titel beim Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 und beim Mid-Season Invitational 2016 (uff!). Nachdem Faker 2016 jedes internationale Event, das League of Legends zu bieten hat, gewinnen konnte, wird er zusammen mit SKT versuchen, sich beim Mid-Season Invitational 2017 den nächsten internationalen Titel zu sichern.\n","es_ES":"Sanghyeok ''Faker'' Lee es un icono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario hace añicos los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo si no iba a ser tan fuerte?\n\nFaker ha superado con creces lo que se espera de un mid y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (se dice pronto). Tras ganar todos los eventos internacionales que League of Legends ofreció en 2016, Faker y SKT pretenden llevarse a casa un título internacional más, el del Mid-Season Invitational 2017.\n","pt_BR":"<p>Sanghyeok \"Faker\" Lee é um ícone do dos e-sports moderno. Conhecido como \"O Rei Demônio\" em sua terra natal na Coreia do Sul, sua personalidade calma e respeitosa pode acabar enganando os espectadores de plantão sobre as sua soberania no Rift. Quando ele entra no palco, ultrapassa todo os limites do que achávamos possível com apenas mouse e teclado. Faker ficou invicto na Coreia por tanto tempo que seus oponentes diziam que ele tinha um terceiro Feitiço de Invocador. Afinal como ele poderia ser tão forte?</p>\n\n<p>Faker já elevou as expectativas para jogadores do meio e já pôs as mãos em três Copas do Invocador nos Campeonatos Mundiais, uma em 2013, outra em 2015 e agora uma terceira em 2016. Ele também conseguiu outros troféus para sua equipe na Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e no Mid-Season Invitational 2016 (ufa!). Depois de vencerem todos os eventos internacionais oferecidos por League of Legends em 2016, Faker e a SKT procuram levar para casa outro título internacional no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">한국에서 '마왕'이라 불리는 \"Faker\" 이상혁은 현대 e스포츠의 아이콘입니다. Faker의 조용하고 공손한 행동거지와 그가 소환사의 협곡에서 누리는 지배력을 연관짓기는 힘듭니다. 하지만 그가 전장에 들어서면 지금까지 사람들이 마우스와 키보드로 가능하다 생각했던 그 모든 한계들을 깨뜨려버리죠. 한국에서는 Faker가 너무 오랫동안 최강자의 지위를 누린 탓에 그가 세 번째 소환사 주문을 쓸 수 있는 게 아니냐는 말까지 나왔습니다. Faker는 어떻게 그렇게 강할 수 있을까요? </p>\n<p style=”font-family:”나눔고딕”;\">Faker는 미드 라이너에게 기대되는 수준을 이미 끌어올렸고, 2013년과 2015년 월드 챔피언십에서 두 번이나 소환사 컵을 거머쥐었습니다. 2013 챔피언스 서머 시즌, 2013-2014 챔피언스 윈터 시즌, 2015 챔피언스 스프링 시즌, 2015 챔피언스 서머 시즌에도 팀에게 우승컵을 안겨줬죠. 하지만 그의 경쟁력은 전혀 시들지 않은 것처럼 보입니다. Faker는 계속해서 SK Telecom T1의 다른 팀원들과 자기자신을 밀어붙여 새로운 전략을 개발하고 챔피언 풀을 넓힙니다. Faker가 리그 오브 레전드 사상 최고의 선수일까요? 아마도요. 하지만 한 가지만은 분명합니다. 그건 바로 Faker가 최초의 세계 e스포츠 슈퍼스타 중 하나로 역사에 남을 거라는 사실이죠. </p>\n","es_AR":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>","cs_CZ":"<p>Sanghyeok „Faker“ Lee je živoucí legendou moderních esportů. Při osobním setkání s ním by jen málokdo tušil, že tento tichý a uctivý mladík je vládcem Žlebu, kterému v jeho rodné Jižní Koreji přezdívají „Král démonů“. Pak ovšem vkročí na pódium a s pouhou klávesnicí a myší zboří všechny naše představy o tom, co všechno je v lidských silách. Faker byl v Koreji tak dlouho nedotknutelný, až o něm začali jeho soupeři říkat, že má k dispozici 3. vyvolávačovo kouzlo – jak jinak by mohl být tak silný?</p>\n\n<p>Faker zcela změnil standard toho, co se od středového lajnaře ve hře očekává, a třikrát pozvedl nad hlavu Vyvolávačův pohár z mistrovství světa: poprvé roku 2013, poté roku 2015 a potřetí roku 2016. Také se svým týmem získal trofeje z Champions Summer 2013, Champions Winter 2013–2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 a Mid-Season Invitational 2016 (uf). Poté, co roku 2016 vyhrál všechny mezinárodní turnaje League of Legends, se Faker zúčastní i All-Star 2016 v Barceloně jako absolutní král Žlebu. Jeho bohatá kariéra skvěle odolává zkoušce času a letošní All-Star bude dalším z mnoha úspěchů na jeho kontě. Opět je na čase, abychom byli svědky toho, jak se píše historie.</p>","el_GR":"<p>Ο Sanghyeok \"Faker\" Lee είναι ένας από τους πιο εμβληματικούς παίκτες στα σύγχρονα esports. Στην πατρίδα του, τη Νότια Κορέα, είναι γνωστός ως «Ο Βασιλιάς των Δαιμόνων», αλλά η συγκρατημένη και ευγενική συμπεριφορά δεν προδίδει καθόλου την ηγετική του παρουσία στο Φαράγγι των Επικαλεστών. Όταν όμως ανεβαίνει στη σκηνή, δεν είναι λίγες οι φορές που μας έχει αφήσει με το στόμα ανοιχτό. Απλά δεν πιστεύεις ότι γίνονται αυτά με ποντίκι και πληκτρολόγιο. Ο Faker ήταν τόσο εκτός συναγωνισμού στην Κορέα, για τόσο μεγάλο χρονικό διάστημα που οι αντίπαλοί του άρχισαν να λένε ότι είχε και 3ο Ξόρκι Επικαλεστή. Πώς αλλιώς θα μπορούσε να είναι τόσο ανίκητος;</p>\n\n<p>Ο Faker έχει ήδη θέσει ψηλά τον πήχη όσον αφορά τις προσδοκίες που μπορεί να έχει μια ομάδα από έναν παίκτη μεσαίας λωρίδας. Έχει ήδη σηκώσει το Κύπελλο του Επικαλεστή σε τρία Παγκόσμια Πρωταθλήματα, πρώτη φορά το 2013, μετά πάλι το 2015 και για τρίτη φορά το 2016. Επίσης, έχει οδηγήσει την ομάδα του στην κατάκτηση τροπαίων στα τουρνουά Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 και στο Mid-Season Invitational 2016 (ουφ!). Αφού κέρδισε όλα τα διεθνή τουρνουά του League of Legends για το 2016, ο Faker έρχεται στη σκηνή του Τουρνουά All-Star 2016 στη Βαρκελώνη με τον αέρα του αδιαμφισβήτητου κυρίαρχου του παιχνιδιού. Η λαμπρή καριέρα του δεν δείχνει σημάδια κόπωσης και αυτό το Τουρνουά All-Star θα είναι άλλη μια επιτυχία που μπορεί να προσθέσει στο ήδη απίστευτο ενεργητικό του. Είναι έτοιμος να γράψει ιστορία, για ακόμη μια φορά.</p>\n","hu_HU":"Sanghyeok „Faker” Lee a modern e-sport egyik ikonja. A szülőhazájában, Dél-Koreában „Démonkirályként” emlegetett Faker élőben csendes és tisztelettudó ember, de a Szurdokban egészen más arcát mutatja. Teljesen újraírta az elvárásokat azzal kapcsolatban, hogy mit lehet megtenni egy egérrel és egy billentyűzettel. Fakerrel nem bírtak el Koreában, olyannyira, hogy egyesek szerint van egy harmadik idézői varázslata. Máskülönben hogy lehetne ennyire erős?</p>\n\nFaker eleve magasabbra tette a lécet minden középső ösvényes számára, három világbajnokságon emelhette magasba az Idézők Kupáját, 2013-ban, majd 2015-ben és 2016-ban. Ezenkívül a következő trófeákat zsebelte be: Champions 2013-os nyári szakasz, Champions 2013-2014-es téli szakasz, Champions 2015-ös tavaszi szakasz, Champions 2015-ös nyári szakasz, Champions 2016-os tavaszi szakasz, és a 2016-os szezonközi meghívásos verseny (végig se lehet mondani egy levegővel). Faker 2016-ban megnyert minden League of Legends-versenyt, és Barcelonában a Szurdok egyértelmű királyaként lép a 2016-os All-Star gála színpadára. Játéktudásán nem fog az idő vasfoga, és az All-Star gálán tovább gyarapíthatja győzelmeinek hosszú sorát. Bajnoki címből sosem lehet túl sok.\n\n","it_IT":"Sanghyeok \"Faker\" Lee è uno dei simboli degli eSport moderni. Faker, soprannominato \"Re demone\" nella sua natia Corea del Sud, ha un carattere taciturno e rispettoso che non fa minimamente trasparire la sua immensa abilità. Tuttavia, non appena sale sul palcoscenico è in grado di fare letteralmente l'impossibile con un mouse e una tastiera. Faker è rimasto imbattuto per così tanto tempo in Corea che i suoi avversari hanno iniziato a sospettare che avesse accesso a un terzo incantesimo dell'evocatore: come spiegare altrimenti la sua abilità?</p>\n\nFaker ha già scritto una nuova pagina nella storia dei centrali alzando la Coppa degli evocatori per ben tre volte, nel 2013, nel 2015 e poi nel 2016. Si è anche portato a casa parecchi trofei di squadra: Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 e il Mid-Season Invitational 2016 (wow!). Dopo aver vinto tutti gli eventi internazionali organizzati da League of Legends nel 2016, Faker sale sul palco dell'All-Star 2016 a Barcellona come re indiscusso della Landa. La sua incredibile carriera resiste a ogni assalto del tempo e questo All-Star rappresenterà un'ulteriore voce da aggiungere alla sua impressionante lista di successi. Stiamo per assistere a un evento storico... di nuovo.\n","ru_RU":"","ro_RO":"Sanghyeok ''Faker'' Lee a devenit reprezentantul competiției de top în lumea eSports. În Coreea de Sud, acolo unde locuiește, este cunoscut ca ''Regele Demon'', iar atitudinea lui tăcută și respectuoasă când e întâlnit pe viu nu-i trădează deloc dominanța în Rift. Dar apoi, urcă pe scenă și distruge orice așteptare pe care am putea s-o avem de la cineva cu un mouse și o tastatură. Faker e atât de intangibil în Coreea de atât de multă vreme încât adversarii lui au început să spună că ar avea o a treia vrajă de invocator – cum altcumva ar putea fi atât de puternic?\n</p>\nFaker a ridicat deja standardele pentru jucătorii de pe culoarul de mijloc, ridicând Cupa Invocatorului la trei Campionate Mondiale, unul în 2013, altul în 2015, iar cel mai recent, în 2016. A reușit să obțină trofee pentru echipa lui și la Champions Summer 2013, Champions Winter 2013-2014, Champions Spring 2015, Champions Summer 2015, Champions Spring 2016 și Mid-Season Invitational 2016. După ce a câștigat toate evenimentele internaționale posibile de League of Legends din 2016, Faker vine pe scena All-Star Event 2016 din Barcelona ca rege necontestat al Riftului. Cariera sa impresionantă nu e deloc afectată de trecerea timpului, iar acest All-Star Event va putea fi o altă reușită pe care s-o adauge în palmaresul său deja terifiant. E momentul să asistăm din nou la scrierea istoriei.\n","es_MX":"<p>Sanghyeok \"Faker\" Lee es un ícono de los esports actuales. Conocido como \"el rey demonio\" en su hogar al sur de corea, la conducta tranquila y educada del chico no deja entrever la amenaza mortal que supone en la Grieta. Cuando llega al escenario, despedaza los límites de lo que todos creíamos posible de conseguir simplemente con un ratón y un teclado. Faker resultó ser tan intocable en Corea durante tanto tiempo que sus oponentes comenzaron a decir que tenía un tercer hechizo de invocador. ¿Cómo detenerlo?</p>\n\n<p>Faker ha superado con creces lo que se espera de un central y ya ha alzado en tres ocasiones la Copa del Invocador, una en 2013, otra en 2015 y una tercera en 2016. También cabe destacar los trofeos del Champions Summer 2013, el Champions Winter 2013-2014, el Champions Spring 2015, el Champions Summer 2015, el Champions Spring 2016 y el MSI 2016 (y se dice pronto). Tras ganar todos los eventos internacionales de League of Legends en 2016, Faker se dirige al escenario barcelonés del All-Star Event 2016 como el rey indiscutible de la Grieta. Su ilustre trayectoria profesional desafía el paso del tiempo en cada momento y este All-Star Event será un logro más que añadir a su desbordada lista de méritos. Es hora de presenciar, una vez más, otro momento histórico.</p>"},"foreignIds":{"drupalId":"692","ESPORTSTMNT06":"200000357","TRLH1":"200000410","TRLH2":"200000310","TRLT3":"200000208"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":302,"slug":"chawy","name":"Chawy","firstName":"Xing-Lei","lastName":"Wong","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/chawy-13of7sx8.png","hometown":null,"region":"LMS Taiwan","birthdate":null,"createdAt":"2014-09-16T21:52:24.000Z","updatedAt":"2017-07-06T14:32:25.000Z","bios":{"en_US":"","es_AR":"<p>Xing-lei \"Chawy\" Wong es el carrilero central suplente de ahq e-Sports Club.</p>"},"foreignIds":{"drupalId":"377","TRTW":"200000007","TRLH2":"1001280097","TRLH1":"1001380127","TRLT3":"200000259"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":327,"slug":"huni","name":"Huni","firstName":"Seung-hoon","lastName":"Heo","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/huni-3vra4c68.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-01-19T23:41:44.000Z","updatedAt":"2017-07-06T14:21:58.000Z","bios":{"en_US":"<p>\nSeung-hoon “Huni” Heo proved himself a dominant force in the NA LCS. He's heading to the LCK with some hard earned wisdom under his belt and a drive to prove he can compete with the best. He may look happy and harmless, but don’t underestimate him. Give him an inch, and he’ll take a quadrakill on Riven.\n</p>\n<p>\nHuni is one of the most confident players you'll find, but it’s hidden underneath a jolly layer. While his previous goal was to defeat the three-time World Champs, he's decided that if you can't beat them, join them.\n</p>","fr_FR":"Seung-hoon « Huni » Heo a prouvé être une force dominante des LCS NA. Cette saison, il est arrivé dans la LCK avec des connaissances durement acquises et la volonté de démontrer qu'il est à la hauteur des meilleurs. Il a l'air heureux et inoffensif, mais ne le sous-estimez pas. Cédez ne serait-ce que d'un pouce et il signera un quadruplé sur Riven.\n\nHuni est l'un des joueurs les plus confiants qui soient, mais il le cache bien sous son air jovial. Son objectif précédent était de vaincre les triples champions du monde, mais il s'est finalement dit, qu'à défaut de les battre, autant les rejoindre. Le Mid-Season Invitational 2017 est sa première opportunité de remporter un événement international avec sa nouvelle équipe et, s'il y parvient, ça risque d'être le début d'une longue série.\n","pl_PL":"<p>\"Huni\" jest nowością, która zaskoczyła całą społeczność League of Legends w sezonie piątym. Zaistniał na scenie dopiero po dołączeniu do dobrze wszystkim znanego zespołu Fnatic w styczniu 2015 roku. Jego wybór był szczęśliwym trafem dla europejskiej drużyny, gdyż wcześniej był tylko partnerem sparingowym dla profesjonalnych zawodników w koreańskiej organizacji Samsung. Czarno-żółci wiele zaryzykowali przyjmując debiutanta do podstawowego składu, lecz wkrótce okazało się to strzałem w dziesiątkę. Heo Seung-hoon, swoim agresywnym stylem gry, podniósł poprzeczkę pozostałym top-lanerom w Europie. W wiosennym sezonie członkowie Fnatic wciąż się poznawali, ale i tak konkurowali o czołową pozycję w EU LCS. Ostatecznie uplasowali się na drugim miejscu, tracąc tylko dwa zwycięstwa do przodującego SK Gaming. Jednak w rozgrywkach barażowych pokazali, że to właśnie oni zasługują na szczyt podium – pokonując wszystkich przeciwników na swojej drodze. \"Huni\" wśród innych graczy wyróżnił się w tak dużym stopniu, że został nagrodzony laurem najbardziej wartościowego zawodnika. Osiągnięcia poprawił w kolejnym sezonie, ponieważ w lecie pobił światowy rekord w regularnych rozgrywkach. Przez cały ten okres nie przegrał ani jednego meczu - takiego wyczynu nawet nie da się porównywać, ponieważ jest absolutnie unikalny.</p>\n<p> \nKiedy \"Huni\" dostał się do Mistrzostw Świata 2015 był już powszechnie znany i niesłychanie popularny. Jego występ na tej imprezie tylko przysporzył mu sławy, gdyż nie zawiódł swoich fanów i wyszedł z grupy na pierwszym miejscu. Zwycięstwem z potężnym zespołem EDG w ćwierćfinale przełamał wraz z Fnatic długą passę azjatyckich drużyn. Uległ dopiero w półfinale walcząc z KOO Tigers, koreańską potęgą, jednak te osiągnięcia dla europejskich kibiców były w pełni satysfakcjonujące. Po tym wydarzeniu w wywiadzie dla Redbulla powiedział: „Po Mistrzostwach byłem trochę skołowany, bo nie wiedziałem co dalej robić. Jednocześnie chciałem zdobyć nowe doświadczenie w Ameryce.” Tak \"Huni\" tłumaczył odejście z szeregów Fnatic w listopadzie 2015 roku i dołączenie miesiąc później do nowopowstałej wtedy organizacji Immortals. Później jeszcze wspomniał, że chciałby do kolekcji swoich osiągnięć dodać pierwsze miejsce w NA LCS.</p>\n<p>\n\"Huni\" to zdecydowanie najbardziej przebojowy gracz sezonu 5. Z zupełnie nieznanego nabytku Fnatic w ciągu mniej niż roku stał się jednym z najpopularniejszych zawodników. To zasługa jego rozśmieszającego stylu bycia i braku oporu przed wygłupianiem się na oczach tysięcy widzów. W przeciwieństwie do czasu wolnego, w trakcie meczy Heo Seung-hoon to śmiertelnie poważny przeciwnik. Zasłynął z wyborów agresywnych bohaterów na top-lanie i przez to bycia trzecim carry w zespole. Postaciami, takimi jak Ekko, Riven czy Rumble, wielokrotnie dominował przeciwników i zapierał dech w piersiach wszystkich widzów.\n</p>","de_DE":"Seung-hoon „Huni“ Heo mauserte sich zu einer dominanten Macht in der NA LCS. In dieser Saison wechselte er mit jeder Menge Erfahrung in die LCK, um allen zu beweisen, dass er mit den Besten der Welt mithalten kann. Er mag glücklich und harmlos aussehen, aber man darf ihn nie unterschätzen. Wenn man ihm mit Riven zu viel Platz lässt, ist er immer für eine Vierfachtötung gut.\n\nUnter seiner fröhlichen Fassade ist Huni einer der selbstbewusstesten Spieler, die es gibt. Früher wollte er den dreimaligen Weltmeister unbedingt besiegen, doch dann dachte er sich: „Wenn ich sie nicht besiegen kann, dann schließe ich mich ihnen eben an.“ Das Mid-Season Invitational 2017 ist seine erste Chance, mit seiner neuen Mannschaft einen internationalen Titel zu gewinnen, und wenn es nach ihm geht, wird das der erste von vielen.\n","es_ES":"Seung-hoon \"Huni\" Heo ha demostrado ser una fuerza dominante en la LCS NA. Esta temporada se ha trasladado a la LCK con toda la sabiduría que ha cosechado hasta ahora y viene decidido a demostrar que es capaz de competir contra los mejores. Que no os engañe su cara alegre de no haber matado ni a una mosca. Le basta un pequeño descuido para conseguir un asesinato cuádruple con Riven.\n\nHuni es uno de los jugadores más seguros de sí mismos, pero lo esconde bajo una capa de jovialidad. Aunque su meta anterior era vencer a los tres veces campeones del mundo, ha aplicado la lógica: si no puedes vencerlos, únete a ellos. El Mid-Season Invitational 2017 es su primera oportunidad para ganar un evento internacional con su nuevo equipo. Si se sale con la suya, este será el primer título de muchos.\n","pt_BR":"<p>Seung-hoon \"Huni\" Heo se provou ser uma força dominante na LCS NA. Ele vai para a LCK nesta temporada com uma nova lição arduamente aprendida e a vontade de provar que pode competir com os melhores. Ele pode parecer feliz e inofensivo, mas não o subestimem. Deem uma chance e ele conseguirá um quadrakill em Riven.</p>\n\n<p>Huni é um dos jogadores mais confiantes que você encontrará, mas esconde isso sob uma camada de alegria. Seu objetivo anterior era derrotar os tricampeões mundiais, mas ele decidiu que se você não pode vencê-los, é melhor juntar-se a eles. O Mid-Season Invitational 2017 é sua primeira chance de ganhar um evento internacional com sua nova equipe. E, se a sua vontade se concretizar, será o primeiro de muitos.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\"> “Huni” 허승훈은 탑 라인에서 지배적인 존재입니다. 유럽 LCS에 비교적 최근에 합류한 Huni는 2015년 Fnatic 리빌딩 프로젝트의 일환으로 팀에 입단했습니다. 그의 영향은 즉시 나타났습니다. 2015 유럽 LCS 서머 스플릿에서 Fnatic을 18승 무패 기록으로 이끌었기 때문이죠. Huni는 2015 유럽 LCS 서머 스플릿에서 Outstanding Rookie 상을 수상하기도 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">소환사의 협곡 바깥에서도 Huni의 영향력이 나타났죠. 그가 만든 감탄사 “HoloHoloHolo\"는 누구라도 빠져들 수밖에 없고, 그의 장난스러운 마이크 체킹은 전설적입니다. Huni는 겉으로는 귀여워 보일지 모르지만 게임에서는 적을 깨부수는 데 거리낌이 없죠. Huni는 그의 자신감을 한줄로 이렇게 요약했습니다. \"저희에게 대적할 라이벌은 없습니다.\" 궁금해 하실까봐 말씀드리지만 저 말은 국제 경기까지 포함시킨 겁니다. 그리고 그는 이렇게 말했죠. \"SKT와 다시 한번 싸워서 박살내고 싶어요.\" </p>\n<p style=”font-family:”나눔고딕”;\">정말 대담한 친구죠. 2015 올스타전에서 과연 그가 라이벌들을 박살낼 수 있을지 지켜봅시다. </p>\n"},"foreignIds":{"drupalId":"3675","ESPORTSTMNT06":"200000354","TRLH1":"200000408","TRLH2":"200000308","TRLT3":"200000206"},"socialNetworks":{"twitch":"","facebook":"","twitter":""},"champions":[],"liveGameTeam":9},{"id":403,"slug":"bang","name":"Bang","firstName":"Junsik","lastName":"Bae","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bang-5ln60860.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:04.000Z","bios":{"en_US":"<p>\nJunsik \"Bang\" Bae is an incredibly dedicated AD carry. Bang committed himself to a rigorous play schedule, and has the results to prove it -- he was the first Korean player to reach 1400 Challenger points in Solo Queue. But he isn’t just getting good at Solo Queue. When SKT T1 S secured 3rd place in the 2014 Summer OGN Champions League, Bang had officially arrived on the Korean esports scene. He went on to take 1st place at the 2015 World Championship with SKT, etching his name in LoL history.\n</p>\n<p>\nHe didn’t stop there, though, and like the rest of SK telecom, he struggled through the initial growing pains of roster changes in 2016 before winning the 2016 World Championship. The team adjusted quickly to its new roster this year, dominating the LCK Spring Split and taking victory at the 2017 Mid-Season Invitational in Brazil.\n</p>","fr_FR":"Junsik « Bang » Bae est un carry AD extrêmement impliqué. Bang s'est astreint de lui-même à un programme de jeu très strict, et ses résultats sont là pour lui donner raison : il a été le premier joueur coréen à atteindre les 1400 points en Challenger en file solo. Mais il ne se contente pas de briller en file solo. Quand SKT T1 S à décroché la troisième place dans la Ligue OGN Champions Summer 2014, Bang venait d'arriver officiellement sur la scène de l'e-sport coréen. Il a enchaîné avec une première place lors du Championnat du monde 2015 avec SKT, gravant pour toujours son nom dans l'histoire de LoL.\n\nIl ne s'est pourtant pas arrêté là, et comme le reste de SK Telecom, il a souffert des changements de formation en 2016 avant de remporter le Championnat du monde 2016. Cette année, l'équipe s'est rapidement adaptée à sa nouvelle formation, dominant sans mal le segment de printemps de la LCK. Ils vont maintenant tenter d'enregistrer leur premier victoire internationale de 2017 lors du Mid-Season Invitational au Brésil.\n","pl_PL":"Junsik „Bang” Bae jest niesamowicie zaciętym prowadzącym. Bang narzucił sobie bardzo rygorystyczny harmonogram rozgrywek, czego rezultaty są widoczne — był pierwszym koreańskim zawodnikiem, który osiągnął 1400 punktów Pretendenta w kolejce solo. Ale staje się coraz lepszy nie tylko w kolejce solo. Gdy SKT T1 S zdobyli trzecie miejsce w Summer OGN Champions League 2014, Bang oficjalnie pojawił się na koreańskiej scenie e-sportowej. Zdobył wraz z SKT pierwsze miejsce na Mistrzostwach Świata 2015, zapisując swoje imię w historii LoL.\n\nJednak nie zamierzał na tym poprzestać, dlatego podobnie jak reszta SK Telecom musiał przebrnąć przez trudne zmiany w składzie w 2016 roku, zanim drużyna zwyciężyła na Mistrzostwach Świata 2016. Drużyna szybko dostosowała się do tegorocznego, nowego składu, dominując podczas wiosennego splitu LCK. Teraz będzie chciała zdobyć swoje pierwsze międzynarodowe zwycięstwo w 2017 roku na Mid-Season Invitational w Brazylii.\n","de_DE":"Junsik „Bang“ Bae ist ein unglaublich engagierter AD-Carry. Bang unterwarf sich einem sehr strikten Spielplan und hat als Folge dessen auch Resultate vorzuweisen – er war der erste koreanische Spieler, der jemals 1400 Challenger-Punkte in der Einzelwarteschlange erreicht hat. Aber natürlich ist er nicht nur als Einzelspieler überragend. Als SKT T1 sich den dritten Platz beim OGN Champions im Sommer 2014 sicherten, war Bangs Debut in der Esports-Szene offiziell. Kurz danach gewann er zusammen mit seinem Team SKT die Weltmeisterschaft 2015 und verewigte seinen Namen in der Geschichte von LoL.\n\nAber damit war noch lange nicht Schluss, und genau wie der Rest von SK Telecom hatte er zu Beginn des Jahres 2016 Probleme mit den Änderungen der Aufstellung, bevor er schließlich die Weltmeisterschaft 2016 gewann. In diesem Jahr konnte sich die Mannschaft schnell auf die neue Aufstellung einstellen und den Frühjahrs-Split der LCK dominieren. Jetzt werden sie beim Mid-Season Invitational in Brasilien versuchen, sich den ersten internationalen Titel im Jahr 2017 zu sichern.\n","es_ES":"Junsik ''Bang'' Bae es un AD carry con una dedicación admirable. Su riguroso programa de entrenamiento ha demostrado su eficacia: es el primer jugador coreano en alcanzar los 1400 puntos en la cola en solitario. Y eso no es lo único que se le da bien. Cuando SKT T1 consiguió el tercer puesto en la OGN Champions League de verano de 2014, Bang ya había llegado al panorama coreano de los esports. Junto al resto de miembros de su equipo, contribuyó al triunfo de SKT en el Campeonato Mundial 2015 y su nombre pasó a la historia de League.\n\nLejos de quedarse ahí, luchó junto a SK telecom para superar el mal trago inicial de 2016 causado por el ajuste de plantilla, justo antes de ganar el Campeonato Mundial de 2016. El equipo se ha adaptado rápidamente a su plantilla este año y ha dominado el split de primavera de la LCK. Ahora intentará conseguir su primera victoria internacional de 2017 en el Mid-Season Invitational en Brasil.\n","pt_BR":"<p>Junsik \"Bang\" Bae é um carregadorregador incrivelmente dedicado. Bang se comprometeu a um treinamento rigoroso e tem os resultados para provar: foi o primeiro jogador coreano a alcançar 1400 pontos no nível Desafiante na fila solo. Mas ele não é bom só na fila solo. Quando a SKT T1 conseguiu o 3º lugar na Summer OGN Champions League 2014, Bang fez sua entrada oficial para o cenário coreano de e-Sports. Ele então continuou sua jornada e alcançou o 1º lugar no Campeonato Mundial 2015 com a SKT, gravando seu nome na história do League of Legends.</p>\n\n<p>Mas ele não parou por aí e, assim como o resto da SK Telecom, ele teve dificuldades em se adaptar às mudanças constantes de escalação antes de vencer o Campeonato Mundial 2016. A equipe se ajustou rapidamente à sua nova composição neste ano, dominando a Etapa de Primavera da LCK. Agora eles querem que sua primeira vitória internacional de 2017 seja no Mid-Season Invitational no Brasil.\n</p>","es_AR":"<p>Jun-sik \"Bang\" Bae es un ADC totalmente aplicado. Bang se comprometió a cumplir un riguroso programa de juego, y los resultados lo demuestran. Fue el primer jugador coreano en alcanzar 1400 puntos de Challenger en la cola individual. Pero no es solo en la cola individual donde está mejorando. Cuando SKT T1 S se aseguró el tercer lugar en la OGN Champions League de verano del 2014, Bang quedó oficialmente instalado en la escena de esports coreana. Llegó al primer lugar en el Campeonato Mundial 2015 con SKT, y grabó su nombre en la historia de LoL.</p>\n\n<p>Pero no se detuvo allí y, como el resto de los miembros de SKTelecom, pasó por los insoportables cambios de plantel en el 2016. Después de recibir otro título de LCK en el torneo de apertura del 2016, Bang y SKTelecom fueron derrotados durante el comienzo del torneo de clausura, lo que dejó boquiabiertos a los simpatizantes de todo el mundo. Bang tomará la pérdida como combustible para su fuego competitivo y sabe que solo hace falta una pequeña chispa para hacer que SKTelecom vuelva a tener el dominio del Campeonato Mundial 2016.</p>"},"foreignIds":{"drupalId":"881","ESPORTSTMNT06":"200000358","TRLH1":"200000411","TRLH2":"200000311","TRLT3":"200000209"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":404,"slug":"wolf","name":"Wolf","firstName":"Jaewan","lastName":"Lee","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wolf-82h5ft4p.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-05-07T06:35:48.000Z","updatedAt":"2017-07-06T14:23:22.000Z","bios":{"en_US":"<p>Jaewan \"Wolf\" Lee is a dedicated communicator and practices constantly with his duo partner Bang. Their bond in the bot lane has proven itself, as Wolf achieved one of the highest KDAs in the 2015 LCK Summer Split. His chemistry with Bang led SK Telecom to become world champions in 2015 after they rampaged through the entire tournament nearly unbeaten.</p>\n\n<p>In 2016, the chemistry seemed to have waned as Bang and Wolf struggled along with the entirety of SKT, but after MSI their trademark chemistry was back with a vengeance. Even though SKT came up short in the Summer Split playoffs, Wolf and Bang showed up huge at the 2016 World Championship and again at the 2017 Mid-Season Invitational. Next up? Worlds.</p>","fr_FR":"Jaewan « Wolf » Lee est un excellent communiquant qui s'entraîne constamment avec son partenaire Bang. Leur lien sur la voie du bas a fait ses preuves : Wolf a enregistré l'un des plus hauts KDA du segment d'été des LCK 2015. L'alchimie entre Bang et lui a permis à SK Telecom de devenir championne du monde en 2015 après avoir fait des ravages durant tout le tournoi, presque sans subir la moindre défaite.\n\nEn 2016, cette synergie semble s'être dégradée : Bang et Wolf ont eu un peu de mal, comme l'ensemble de leur équipe, mais après le tournoi MSI, leur alchimie légendaire était de retour en beauté. Bien que SKT ait manqué de peu les play-offs du segment d'été, Wolf et Bang ont fait des étincelles au Championnat du monde 2016. À présent, ils se préparent à participer au Mid-Season Invitational 2017 et convoitent leur deuxième titre du MSI.\n","pl_PL":"Jaewan „Wolf” Lee ma świetne umiejętności komunikacyjne i nieustannie ćwiczy ze swoim partnerem z duetu, Bangiem. Ich zgrania na dolnej alei dowodzi fakt, że Wolf zdobył jeden z najwyższych wyników Z/Z/A podczas letniego splitu LCK 2015. Świetna chemia między nim a Bangiem doprowadziła SK Telecom do zdobycia mistrzostwa świata w 2015 roku, po przebiciu się przez cały turniej niemal bez porażki.\n\nW 2016 roku ta chemia jakby uleciała, gdy Bang i Wolf borykali się z problemami, które dotknęły całego SKT, ale po MSI ich charakterystyczne zgranie się powróciło jeszcze bardziej wzmocnione. Chociaż SKT odpadli w fazie pucharowej letniego splitu, Wolf i Bang pokazali się ze świetnej strony na Mistrzostwach Świata 2016. Teraz zmierzają na Mid-Season Invitational 2017, mając oko na drugi tytuł na MSI.\n","de_DE":"Jaewan „Wolf“ Lee ist ein engagierter Kommunikator und ständig damit beschäftigt, sich mit seinem Duo-Partner Bang zu verbessern. Ihre Verbindung ist stark und ihr Erfolg auf der unteren Lane spiegelt sich deutlich in Wolfs TTUs im Sommer-Split der LCK 2015 wider. Seine gute Harmonie mit Bang führte SK Telecom zum Sieg bei der Weltmeisterschaft 2015, nachdem sie im ganzen Turnier nahezu ungeschlagen geblieben waren.\n\n2016 war es mit der Harmonie plötzlich vorbei, als Bang und Wolf, genau wie der Rest der Mannschaft, große Probleme hatten. Aber nach dem MSI war ihre Harmonie wieder zurück. Obwohl SKT in den Entscheidungsspielen des Sommer-Splits scheiterte, konnten Wolf und Bang der Weltmeisterschaft 2016 ihren Stempel aufdrücken. Jetzt sind sie zum Mid-Season Invitational 2017 unterwegs, wo sie ihren zweiten MSI-Titel gewinnen wollen.\n","es_ES":"Jaewan ''Wolf'' destaca por lo bien que se comunica, y practica constantemente con su compañero de la calle inferior, Bang. Este dúo ya ha demostrado su valía, ya que Wolf consiguió uno de los marcadores A/M/A más altos del split de verano de la LCK 2015. Su química con Bang contribuyó en gran medida a que SK telecom se proclamase campeón del mundo en 2015, pues en su paso por el campeonato casi terminan invictos.\n\nEn 2016, su química comenzó a decaer cuando Bang y Wolf experimentaron los mismos problemas que el resto del equipo, pero con la victoria en el MSI todo volvió a la normalidad. Aunque SKT no dio la talla en los playoffs del split de verano, Wolf y Bang se mostraron como un potente dúo en el Campeonato Mundial de 2016. Ahora se dirigen al Mid-Season Invitational 2017 con esperanzas de obtener su segundo título del MSI.\n","pt_BR":"<p>Jaewan \"Wolf” Lee é um comunicador dedicado e pratica constantemente com seu parceiro de rota, Bang. Sua sintonia na rota inferior já provou o que tinha que provar quando Wolf alcançou um dos AMAs mais altos da Etapa de Verão da LCK 2015. Sua química com Bang levou a SK Telecom a se tornar a campeã mundial em 2015 depois de destruírem no torneio, saindo praticamente invictos.</p>\n\n<p>Em 2016, essa química parecia ter sumido quando Bang e Wolf passaram por muitas dificuldades, juntamente com toda a SKT. Mas, depois do MSI, sua tão famosa sintonia voltou com tudo. Mesmo a SKT tendo decepcionado nas eliminatórias da Etapa de Verão, Wolf e Bang impressionaram no Campeonato Mundial 2016. Agora, eles vão para o Mid-Season Invitational 2017 de olho no seu segundo título MSI.\n</p>","es_AR":"<p>Jae-wan \"Wolf\" se destaca por su dedicación a las comunicaciones y practica constantemente con su dupla Bang. Su vínculo en el carril inferior se ha mostrado fuerte, y Wolf logró uno de los más altos KDA en el torneo de clausura de la LCK 2015. Su química con Bang hizo que SKTelecom se convirtiera en campeón mundial en el 2015 luego de arrasar durante todo el torneo sin derrotas.</p>\n\n<p>En el 2016, la química pareció menguar un poco, ya que Bang y Wolf pasaron una mala racha junto a SKTelecom, pero luego de la MSI, su complementación volvió a ser la misma y estuvo cargada de venganza. Aunque SKTelecom quedó afuera rápido de las eliminatorias del torneo de clausura, Wolf y Bang siguen siendo una impresionante dupla de carrileros inferiores. Está por llegar al Mundial como uno de los soportes más temibles del planeta. Si alguien quiere meterse con Bang, tendrá que pasar por una pesadilla al cruzarse con Wolf.</p>"},"foreignIds":{"drupalId":"882","ESPORTSTMNT06":"200000435","TRLH1":"200000412","TRLH2":"200000312","TRLT3":"200000210"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":407,"slug":"mountain","name":"Mountain","firstName":"Zhao-Hong","lastName":"Xue","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mountain-a7eo73t.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:32:08.000Z","bios":{"en_US":"<p>Zhao-Hong \"Mountain\" Xue is the meaty, front-line-patrolling, carry-peeling jungler that every squishy champion dreams of having around in a team fight. Mountain integrated with ahq almost instantly after joining in 2014, despite initial worries about synergy with his teammates. His one potential flaw? He likes to experiment with in-game strategy -- sometimes without telling his team first, leading to questionable scrim results. But when ahq needs him to deliver his finest, he is always ready to step up to the plate.\n</p>\n<p>\nWhile Mountain enjoys experimenting with new strategies on the Rift, when he leaves the game behind he becomes more consistent. Whenever ahq goes abroad, the first thing he does is buy a doll from the airport or a local toy store for his girlfriend. And if he has time to kill between queues, he enjoys reading a good historical or science fiction novel with his teammate Westdoor.\n</p>","fr_FR":"<p>Zhao-Hong « Mountain » Xue est un jungler puissant et dominant que tout champion un peu fragile rêve d'avoir à ses côtés pendant un combat d'équipe. Mountain a rejoint ahq presque immédiatement après son arrivée en 2014, malgré des craintes initiales sur la synergie avec ses coéquipiers. Son potentiel point faible ? Il aime tenter de nouvelles stratégies en cours de partie, parfois sans même prévenir son équipe, ce qui peut mener à des résultats ambivalents lors des matchs d'entraînement. Mais quand ahq a besoin qu'il donne le meilleur de lui-même, il répond toujours présent.\n</p>\n<p>\nSi Mountain aime tester de nouvelles stratégies dans la Faille, quand il ne joue pas, il est beaucoup moins créatif. Dès qu'ahq part à l'étranger, il achète toujours une poupée pour sa petite amie à l'aéroport ou dans un magasin de jouets. Et s'il a du temps à perdre entre deux parties, il va lire un roman historique ou de science-fiction avec son coéquipier Westdoor.\n</p>","pl_PL":"<p>Zhao-Hong „Mountain” Xue to walczący na froncie i usuwający prowadzących dżungler, którego każdy wrażliwy bohater lubi mieć przy sobie. Mountain zintegrował się z ahq tuż po przyłączeniu się w 2014 roku mimo tego, że obawiano się o to, jak ułoży mu się współpraca z towarzyszami. Jego potencjalną wadą jest fakt, że lubi eksperymentować ze strategią, czasem nie mówiąc nawet towarzyszom, co daje bardzo różne wyniki. Jednak kiedy ahq naprawdę go potrzebuje, zawsze spełnia oczekiwania drużyny.\n</p>\n<p>\nChociaż Mountain lubi eksperymentować w grze, poza nią jest zrównoważony. Kiedy ahq wybiera się w podróż, zawsze kupuje swojej dziewczynie lalkę na lotnisku lub w sklepie z zabawkami. A jeśli ma czas między meczami, lubi czytać powieści historyczne i science fiction, tak jak jego kolega, Westdoor.\n</p>","de_DE":"<p>Zhao-Hong „Mountain“ Xue ist der robuste, Carry fressende Jungler an der Front, den jeder Champion, der nicht besonders viel aushält, in einem Teamkampf gerne an seiner Seite hätte. Mountain konnte sich trotz anfänglicher Sorgen über die Harmonie mit seinen Teamkameraden gleich nach seinem Beitritt im Jahr 2014 bei ahq integrieren. Seine einzige potenzielle Schwachstelle? Er experimentiert gerne mit der Strategie im Spiel – und manchmal vergisst er, seine Mannschaft darüber in Kenntnis zu setzen, was immer wieder zu fragwürdigen Ergebnissen in Übungsspielen führt. Aber wenn es ernst wird und ahq ihn braucht, stellt er sich der Herausforderung.</p>\n\n<p>Obwohl Mountain in der Kluft gerne mit neuen Strategien experimentiert, ist er abseits des Spiels lange nicht so experimentierfreudig. Immer wenn ahq das Land verlässt, kauft er am Flughafen oder in einem Spielzeugladen eine Puppe für seine Freundin. Und wenn er zwischen den Spielen einmal Zeit totschlagen muss, liest er mit seinem Teamkameraden Westdoor Geschichts- oder Science-Fiction-Romane.</p>","es_ES":"<p>Zhao-Hong ''Mountain'' Xue es ese valioso jungla que todo campeón fácil de asesinar desea tener cerca durante los combates de equipo porque protege en primera línea y defiende al carry. Mountain se integró en ahq al instante cuando se unió a ellos en 2014, a pesar de las preocupaciones iniciales sobre su sinergia con los compañeros de equipo. ¿Su posible punto débil? Le gusta experimentar con la estrategia en partida, a veces sin decírselo primero a sus compañeros, lo que provoca resultados cuestionables durante las prácticas. Pero cuando ahq necesita que lo dé todo, siempre está preparado para saltar a la palestra.</p>\n\n<p>Aunque le gusta probar nuevas estrategias en la Grieta, cuando deja el juego a un lado, se vuelve más coherente. Cuando ahq viaja al extranjero, lo primero que hace es comprarle una muñeca en el aeropuerto o en una tienda de la zona a su novia. Para matar el tiempo durante las colas, le gusta leer novelas históricas o de ciencia ficción con su compañero Westdoor.</p>","pt_BR":"<p>Zhao-Hong \"Mountain\" Xue é o caçador-tanque carregador e protetor que todo campeão frágil sonha em ter por perto em um confronto de equipe. Mountain se integrou quase que instantaneamente com a ahq logo em sua entrada em 2014, apesar de preocupações iniciais sobre a sinergia com seus compaheiros. Seu possível maior defeito? Ele gosta de experimentar com estratégias dentro do jogo, muitas vezes sem dizer aos seus companheiros primeiro, levando a resultados questionáveis durante o treinamento. Mas quando a ahq precisa que ele dê o seu melhor, ele sempre está pronto para atender às expectativas.</p>\n\n<p>Apesar de Mountain gostar de experimentar com novas estratégias no Rift, quando ele deixa essa parte de lado, ele se torna mais consistente. Sempre que a ahq viaja pelo mundo, a primeira coisa que ele faz é comprar uma boneca no aeroporto ou em uma loja de brinquedos local para sua namorada. E durante seu tempo livre da filas do League of Legends, ele gosta de ler uma boa novela histórica ou Sci-Fi com seu companheiro de equipe, Westdoor.</p>","es_AR":"<p>Zhao-Hong \"Mountain\" Xue es el sustancioso junglero que patrulla la primera línea y evita los movimientos del contrario, alguien a quien cada campeón frágil desearía tener cerca en un combate en equipo. Mountain se unió a ahq en el 2014 y se integró sólidamente casi al instante, a pesar de las preocupaciones iniciales sobre la forma de trabajar con sus compañeros. ¿Su posible falla? Le gusta experimentar con la estrategia dentro del juego, a veces sin avisar primero a sus compañeros, lo cual se traduce en cuestionables resultados. Sin embargo, cuando ahq necesita que se desempeñe impecablemente, está siempre listo para cumplir con lo suyo.</p>\n\n<p>Si bien a Mountain le gusta crear nuevas estrategias en la Grieta, cuando deja al juego atrás, se vuelve mucho más consistente. Cada vez que ahq sale del país, lo primero que hace es comprar una muñeca para su novia en el aeropuerto o en una juguetería local. Y, si tiene que matar el tiempo mientras hace fila, disfruta leyendo literatura histórica o novelas de ciencia ficción con su compañero Westdoor.</p>"},"foreignIds":{"drupalId":"1698","TRLH1":"1001380123","TRLH2":"1001280093","TRLH3":"1001160093","TRLH4":"1001160093","TRTW":"200000006","TRLT3":"200000258"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":408,"slug":"ziv","name":"Ziv","firstName":"Yi","lastName":"Chen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/ziv-r8szyen.png","hometown":"Taiwan","region":"LMS Taiwan","birthdate":null,"createdAt":"2015-05-07T06:35:49.000Z","updatedAt":"2017-07-06T14:22:21.000Z","bios":{"en_US":"<p>There’s a reason Yi “Ziv” Chen earned a staggering 66.1 percent of the top lane vote for the LMS region. He’s the cream of the crop of LMS top laners, and he’s proven he can compete with the best in the world. He turned heads with his debut at the 2015 Mid-Season Invitational, and he led AHQ to two of their victories with stellar Jayce play at the 2016 World Championship. Unfortunately, AHQ fell just short of making it out of the group stage.</p>\n\n<p>Ziv made a name for himself in the LMS with his unrelenting approach in the top lane. He isn’t afraid to chase his opponents all the way to their fountain if necessary. He’s shown his dedication to improving his craft, and he’s always looking to improve his mechanics in scrims and solo queue.</p>","fr_FR":"<p>Ce n'est pas sans raison que Yi \"Ziv\" Chen a remporté un pourcentage écrasant de 66,1 dans le vote top laner de la région LMS. Il est la crème de la crème des top laners LMS et il a démontré qu'il pouvait affronter les meilleurs du monde. Il a fait tourner les têtes lors de ses débuts dans le Mid-Season Invitational 2015, et AHQ lui doit deux de ses victoires grâce à son jeu exceptionnel de Jayce lors du Championnat du monde 2016. Malheureusement, AHQ n'a pas réussi à sortir gagnant de la phase de groupe.</p>\n\n<p>Ziv s'est fait un nom dans les LMS avec son style implacable dans la voie du haut. Il n'a pas peur de poursuivre ses adversaires jusqu'à leur fontaine, s'il le faut. Il s'est montré déterminé dans l'apprentissage de son art et il cherche toujours à améliorer ses mécaniques dans les matchs amicaux et la file solo. L'événement All-Stars 2016 lui donnera une chance de se libérer et de plonger dans le chaos de l'intersaison.</p>","pl_PL":"Yi „Ziv” Chen nie bez powodu zdobył oszałamiające 66,1 procenta głosów na górnego regionu LMS. Należy do śmietanki górnych LMS i pokazał, że potrafi rywalizować z najlepszymi na świecie. Zwrócił na siebie uwagę podczas debiutu na Mid-Season Invitational 2015, a swoją genialną grą Jaycem doprowadził AHQ do dwóch zwycięstw na Mistrzostwach Świata 2016. Niestety AHQ nie zdołali wyjść z fazy grupowej, choć tak niewiele im do tego brakowało.\n</p>\nZiv zdobył sobie uznanie w LMS swoją nieustępliwością na górnej alei. Gdy trzeba, nie boi się ścigać przeciwników aż do ich fontanny. Wykazał się skrupulatnością w doskonaleniu swojego warsztatu i zawsze jest gotowy poprawiać mechanikę gry podczas sesji treningowych i w kolejce solo. Wydarzenie All-Star 2016 będzie dla niego okazją, by pójść na całość i poszaleć trochę poza sezonem.\n","de_DE":"<p>Es gibt einen Grund, aus dem Yi „Ziv“ Chen von unglaublichen 66,1 % aller Wähler zum Top-Laner für die LMS-Region gewählt wurde. Er ist der beste Top-Laner der LMS und er hat bewiesen, dass er mit den besten Spielern der Welt mithalten kann. Er erregte bereits bei seinem Debüt im Mid-Season Invitational 2015 Aufsehen und führte AHQ mit seinem überragenden Jayce zu zwei Siegen bei der Weltmeisterschaft 2016. Leider schaffte es AHQ knapp nicht, in die K.-o.-Runde der WM einzuziehen.</p>\n\n<p>Ziv machte sich mit seinen erbarmungslosen Spielzügen auf der oberen Lane einen Namen in der LMS. Er schreckt auch nicht davor zurück, seine Gegner bis in die Basis zu verfolgen, wenn es die Situation erfordert. Er hat gezeigt, dass er sich stets steigern will, und versucht, seine Mechaniken in Übungsspielen und der Solo-Warteschlange zu verbessern. Beim All-Stars-Event 2016 bekommt er die Möglichkeit, richtig aufzudrehen und in der Nebensaison ordentlich Chaos zu stiften.</p>","es_ES":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para la calle superior de la región de LMS. Es de lo mejorcito de los top de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograse dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en la calle superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola en solitario. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","pt_BR":"<p>Existe um motivo para Yi “Ziv” Chen ter conseguido 66,1% dos votos da rota do topo da região LMS. Ele faz parte da nata dos jogadores de posição na LMS e provou que pode competir com os melhores do mundo. Ele atraiu olhares com sua estreia no Mid-Season Invitational 2015 e levou a AHQ a duas de suas vitórias, com desempenhos espetaculares de Jayce no Campeonato Mundial 2016. Infelizmente, a AHQ não conseguiu sair da Fase de Grupos.</p>\n\n<p>Ziv fez seu nome na LMS com sua abordagem implacável da rota do topo. Ele não tem medo de perseguir seus oponentes até a fonte, se necessário. Mostrou sua dedicação em melhorar seu ofício e sempre está buscando aprimorar suas mecânicas em duelos na fila solo. O Evento All-Star 2016 lhe dará uma chance de relaxar e mergulhar no caos do pós-temporada.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yi \"Ziv\" Chen은 ahq E-sports Club에 가장 최근 합류한 선수 두 명 중 하나로 2014 월드 챔피언십 이후 팀에 들어갔습니다. 그는 데뷔 무대였던 2015 미드 시즌 인비테이셔널에서 마오카이와 나르를 이용한 압도적 경기력으로 세계를 뒤흔들었습니다. 특히 서구의 탑 라이너들 몇몇이 여기에 희생됐죠. Ziv는 2015 월드 챔피언십에서 ahq가 8강까지 올라가는 데 중요한 역할을 했습니다. </p>\n<p style=”font-family:”나눔고딕”;\">전장에서 그가 킬을 올리기 위해 적팀 탑 라이너를 쫓고 있지 않을 때에는 LMS에서 가장 진지한 선수들 중 하나가 됩니다. ahq의 스크림 경기에서 Ziv는 피지컬을 향상시키기 위해 최선을 다하죠. 하지만 연습이 끝나면 긴장을 푼 Ziv로 돌아옵니다. 평소에는 숙소에서 잠을 자거나 친구들과 애니메이션을 보며 하루를 보낼 때가 많습니다. </p>\n","es_AR":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>","cs_CZ":"<p>Není žádná náhoda, že Yi „Ziv“ Chen získal za LMS ohromujících 66,1 % hlasů pro horní lajnu. Je absolutní špičkou mezi horními lajnaři z LMS a dokázal, že obstojí i v boji s těmi nejlepšími z celého světa. Vzbudil zaslouženou pozornost již při svém debutu na turnaji Mid-Season Invitational 2015 a svou hvězdnou hrou za Jayce dovedl AHQ ke dvěma z jejich vítězství na mistrovství světa 2016. Přesto AHQ bohužel nepostoupili ze skupiny.</p>\n\n<p>Ziv se v LMS proslavil tím, že v horní lajně nenechá svého soupeře ani na okamžik vydechnout. Je-li to zapotřebí, neváhá jej pronásledovat až na fontánu. Neusíná na vavřínech a neustále se snaží své herní dovednosti zlepšovat v cvičných utkáních a sólové frontě. Na turnaji All-Star 2016 bude mít příležitost utrhnout se ze řetězu a trochu si vychutnat všeobecný masakr v odpočinkové době mezi sezónami.</p>","el_GR":"<p>Δεν είναι τυχαίο που ο Yi “Ziv” Chen πήρε το απίστευτο ποσοστό 66,1% των ψήφων του LMS για τη θέση επάνω λωρίδας. Είναι ό,τι καλύτερο έχει να επιδείξει το LMS στην επάνω λωρίδα και μπορεί να ανταγωνιστεί τους καλύτερους παίκτες του κόσμου σε αυτήν τη θέση. Το ντεμπούτο του στο Mid-Season Invitational 2015 προκάλεσε τεράστια αίσθηση, ενώ αργότερα οδήγησε τους AHQ σε δύο πολύ σημαντικές νίκες στο Παγκόσμιο Πρωτάθλημα 2016 με εκπληκτικό χειρισμό του Τζέις. Δυστυχώς, οι AHQ δεν κατάφεραν να περάσουν από τη φάση ομίλων.</p>\n\n<p>Ο Ziv έγινε διάσημος στο LMS για τον αδυσώπητο τρόπο που έπαιζε στην επάνω λωρίδα. Δεν φοβάται να κυνηγήσει τους αντιπάλους του ακόμη και μέχρι το σιντριβάνι τους, αν χρειαστεί. Έχει αποδείξει την αφοσίωσή του στη βελτίωση του παιχνιδιού του και προσπαθεί πάντα να βελτιώσει τη γνώση των μηχανισμών σε φιλικούς αγώνες και παιχνίδια στην ουρά αναμονής για έναν παίκτη. Στο Τουρνουά All-Star 2016 θα έχει την ευκαιρία να τα δώσει όλα και να σπείρει λίγο χάος προτού ξεκινήσει η σεζόν.</p>","hu_HU":"Nem véletlen, hogy Yi „Ziv” Chen elsöprő, 66,1%-os szavazati aránnyal lehet az LMS régiót képviselő felső ösvényes. Az LMS felső ösvényesei közül is kiemelkedik, és bizonyította, hogy a világ legjobbjaival is elbánik. Először a 2015-ös szezonközi meghívásos versenyen hívta fel magára a figyelmet, és két győzelemre vezette az AHQ-t Jayce-t irányítva a 2016-os világbajnokságon. Balszerencséjükre ez nem volt elég ahhoz, hogy az AHQ továbbjusson a csoportkörből.</p>\n\nZiv azzal szerzett hírnevet magának az LMS-ben, hogy kíméletlenül játszik a felső ösvényen. Akár a forrásig is üldözi az ellenfeleit. Elkötelezetten fejleszti a játéktudását: gyakorlómeccseken és az egyéni várólistán csiszolja a képességeit. A 2016-os All-Star gálán végre ellazulhat, és örömét lelheti a játékban.\n","it_IT":"C'è un motivo alla base dell'incredibile 66,1% di voti guadagnato da Yi \"Ziv\" Chen nella categoria Superiore per la regione LMS. Non solo rappresenta l'élite dei superiori della LMS, ma ha anche dimostrato di saper tenere testa ai migliori giocatori del mondo. Ha attirato l'attenzione sin dal suo debutto al Mid-Season Invitational 2015 e ha condotto gli AHQ a due importanti vittorie ai Mondiali 2016 grazie alle sue giocate stellari con Jayce. Tuttavia, la sua squadra non è riuscita a qualificarsi nella fase a gironi.</p>\n\nZiv si è fatto conoscere nella LMS per il suo approccio aggressivo in corsia superiore. Non ha paura di dare la caccia ai suoi avversari e neppure di seguirli fino alla loro base, se necessario. Ha dimostrato molto impegno nel migliorare il suo gioco ed è sempre intento a studiare nuove meccaniche in allenamento e nelle code in singolo. L'All-Star 2016 gli darà la possibilità di scatenarsi e portare un po' di caos fuori dalla stagione regolare.\n","ro_RO":"Există un motiv pentru care Yi ''Ziv'' Chen a obținut un procent uimitor de 66,1 la sută din voturile pentru culoarul de sus din LMS. Este cel mai bun jucător de pe această poziție din regiune și a dovedit că poate concura liniștit la nivel mondial. A atras privirile spectatorilor prin debutul său la Mid-Season Invitational 2015 și a condus AHQ către două dintre victoriile echipei, jucând surprinzător cu Jayce la Campionatul Mondial 2016. Din păcate, AHQ nu a reușit să treacă de faza grupelor.</p>\n\nZiv și-a creat o reputație în LMS cu strategia sa nemiloasă de pe culoarul de sus. Nu-i e teamă să-și urmărească adversarii până la fântână dacă e cazul. E gata să muncească enorm ca să devină mai bun și încearcă mereu să-și îmbunătățească mecanicile în antrenamente și pe lista de așteptare solo. All-Star Event 2016 este o nouă șansă să se dezlănțuie și să provoace puțin haos în perioada dintre sezoane.\n","es_MX":"<p>Existe un motivo para que Yi \"Ziv\" Chen haya conseguido un increíble 66,1 % de los votos para el carril superior de la LMS. Es de lo mejorcito de los superiores de su región y ha demostrado que puede competir contra los mejores del mundo. Sorprendió a más de uno con su debut en el Mid-Season Invitational 2015 y fue capaz de hacer que AHQ lograra dos de sus victorias gracias a su espectacular rendimiento con Jayce en el Campeonato Mundial 2016. Por desgracia, AHQ no logró superar la fase de grupos.</p>\n\n<p>Ziv ha alcanzado el reconocimiento en la LMS gracias a su actitud implacable en el carril superior. No tiene miedo de perseguir a sus oponentes hasta la fuente de sus bases si hace falta. Ha demostrado su compromiso con mejorar su destreza y, por eso, siempre busca cómo pulir sus mecánicas en los entrenamientos y en la cola individual. El All-Star Event 2016 le dará la oportunidad de desinhibirse y de sembrar un poco de caos en la pretemporada.</p>"},"foreignIds":{"drupalId":"4288","TRLH1":"1001380122","TRLH2":"1001280092","TRLH3":"1001360061","TRLH4":"1001310061","TRTW":"200000148","TRLT3":"200000257"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":715,"slug":"peanut","name":"Peanut","firstName":"Wangho","lastName":"Han","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/peanut-izmrqd1y.png","hometown":null,"region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T14:15:00.000Z","bios":{"en_US":"<p>\nWangho “Peanut” Han is the most aggressive jungler in Korea - bar none. He is a master of controlled mayhem who routinely takes over games single-handedly. After getting his professional start with the thoroughly underwhelming NaJin e-mFire, Peanut made his way to the ROX Tigers in 2016.\n</p>\n<p>\nPeanut melds chaos and calm in a way seldom seen on the Rift. One moment he’s systematically stealing the enemy’s jungle and the next he’s diving headfirst into a tower to clean up a double kill. It’s this unpredictability that sets Peanut apart from other elite level junglers. After losing a close battle to SK telecom T1 at the 2016 World Championship, Peanut joined the team that sent him packing. He earned his first international title with his new team at the 2017 Mid-Season Invitational; now, his sights are set on Worlds.\n</p>","de_DE":"Wangho „Peanut“ Han ist zweifellos der aggressivste Jungler in Korea. Er ist ein Meister des kontrollierten Chaos und kann Spiele alleine entscheiden. Nachdem seine Karriere bei den sehr enttäuschenden NaJin e-mFire begonnen hatte, wechselte Peanut im Jahr 2016 zu den ROX Tigers.\n\nPeanut vereint Chaos und Ruhe, wie man es in der Kluft nur selten sieht. In einem Moment grast er systematisch den gegnerischen Dschungel ab und im nächsten stürmt er kopfüber zu einem Turm, um eine Doppeltötung einzufahren. Es ist diese Unberechenbarkeit, die Peanut von den anderen Junglern auf diesem Niveau unterscheidet. Nachdem er sich bei der Weltmeisterschaft 2016 SK Telecom T1 knapp geschlagen geben musste, wechselte Peanut zu der Mannschaft, die ihn nach Hause geschickt hatte. Jetzt wird er beim Mid-Season Invitational 2017 versuchen, mit seiner neuen Mannschaft seinen ersten internationalen Titel zu gewinnen.\n","es_AR":"<p>Wang-ho \"Peanut\" Yun es, sin la menor duda, el junglero más agresivo de Corea. Es experto en generar un caos controlado que casi siempre le permite tener el dominio de las partidas en sus propias manos. Después de hacer su debut profesional con el absolutamente abrumador equipo NaJin e-mFire, Peanut pasó a formar parte de ROX Tigers a comienzos de año y no ha vuelto la vista atrás desde entonces.</p>\n\n<p>Peanut combina caos y calma de una forma pocas veces vista en la Grieta. En un momento se encuentra robando de forma sistemática la jungla del enemigo, y al siguiente se lanza de cabeza a una torre pera ejecutar un asesinato doble. Es el componente sorpresa lo que hace que Peanut se destaque de otros jungleros de élite. Era la última pieza que faltaba en ROX Tigers, y su juego ayudó a catapultar el equipo al estrellato internacional. Peanut y compañía son grandes favoritos para el Campeonato Mundial 2016, y hay solo una cosa para decir a los equipos que se crucen en su camino: buena suerte.</p>","es_ES":"Wangho ''Peanut'' Han es el jungla más agresivo de Corea. Es un maestro del caos controlado y suele dominar en solitario las partidas. Tras comenzar profesionalmente con el decepcionante NaJin e-mFire, se unió a ROX Tigers en 2016.\n\nPeanut combina el caos y la calma de una forma que rara vez se ha visto en la Grieta. Un segundo está robando de forma sistemática la jungla enemiga, y al siguiente se está lanzando de cabeza bajo la torre para conseguir un asesinato doble. Que sea tan impredecible es lo que lo hace destacar frente a otros junglas de élite. Tras perder una disputada batalla contra SK telecom T1 en el Campeonato Mundial de 2016, Peanut se unió al equipo que lo mandó a casa. Ahora, intentará ganar su primer título internacional con su nuevo equipo en el Mid-Season Invitational 2017.\n","pt_BR":"<p>Wangho \"Peanut\" Han é o caçador mais agressivo da Coreia, ponto. Ele é um mestre em controlar o caos que frequentemente causa nos seus jogos. Depois de ter sua estreia no cenário profissional com a decepcionante NaJin e-mFire, Peanut encontrou seu caminho na ROX Tigers em 2016.</p>\n\n<p>Peanut consegue juntar caos e tranquilidade de uma forma raramente vista no Rift. Em um momento ele pode estar roubando sistematicamente a selva do inimigo e no outro, mergulhando de cabeça em uma torre para pegar um abate duplo. É essa imprevisibilidade que diferencia Peanut dos outros caçadores de elite. Depois de perder uma batalha acirrada para a SK Telecom T1 no Campeonato Mundial 2016, Peanut entrou para a equipe que o fez fazer as malas. Agora, ele tentará ganhar seu primeiro título internacional com sua nova equipe no Mid-Season Invitational 2017.\n</p>","pl_PL":"Wangho „Peanut” Han jest najagresywniejszym dżunglerem w Korei — bezdyskusyjnie. To mistrz kontrolowanego chaosu, który regularnie zdobywa zwycięstwa w meczach praktycznie na własną rękę. Po swoim profesjonalnym starcie w bardzo przeciętnym NaJin e-mFire Peanut przeniósł się na początku 2016 roku do ROX Tigers.\n\nPeanut łączy chaos i opanowanie w sposób rzadko widywany na Summoner’s Rift. W jednej chwili systematycznie wykrada dżunglę przeciwnikowi, a w następnej szturmuje wieżę, by zgarnąć podwójne zabójstwo. To ta nieprzewidywalność odróżnia Peanuta od pozostałych elitarnych dżunglerów. Po przegraniu zaciekłej bitwy z SK Telecom T1 na Mistrzostwach Świata 2016 Peanut dołączył do drużyny, która była przyczyną jego porażki. Teraz ze swoją nową drużyną zamierza zdobyć swój pierwszy międzynarodowy tytuł na Mid-Season Invitational 2017.\n","fr_FR":"Wangho « Peanut » Han est le jungler le plus agressif de Corée, sans exception. Il est passé maître dans l'art du chaos contrôlé, et a pour habitude de dominer les matchs seul. Suite à des débuts professionnels avec les très décevants NaJin e-mFire, Peanut a rejoint les ROX Tigers en 2016.\n\nPeanut mélange chaos et calme d'une façon rarement vue sur la Faille. Un moment, il vole systématiquement la jungle ennemie et l'instant d'après, il fonce tête la première sous une tour pour réaliser un doublé. C'est son caractère imprévisible qui distingue Peanut des autres junglers d'élite. Après avoir perdu un combat serré contre SK Telecom T1 lors du Championnat du monde 2016, Peanut a finalement rejoint l'équipe qui l'avait disqualifié. Il va maintenant tenter de remporter son premier titre international avec sa nouvelle équipe au Mid-Season Invitational 2017.\n"},"foreignIds":{"drupalId":"4062","TRLH1":"200000409","TRLH2":"200000309","ESPORTSTMNT06":"200000355","TRLT3":"200000207"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1019,"slug":"lbb","name":"LBB","firstName":"Bing-Xin","lastName":"Liu","roleSlug":"adcarry","photoUrl":"http://assets.lolesports.com/player/lbb-brctu3lx.png","hometown":"","region":"LMS Taiwan","birthdate":null,"createdAt":"2016-01-06T21:51:14.000Z","updatedAt":"2017-03-24T20:16:37.000Z","bios":{},"foreignIds":{"TRTW":"200000058"},"socialNetworks":{},"champions":[],"liveGameTeam":6},{"id":1025,"slug":"untara","name":"Untara","firstName":"Ui-jin","lastName":"Park","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/untara-72qfuy9u.png","hometown":"Korea","region":"LCK","birthdate":null,"createdAt":"2016-01-06T22:02:38.000Z","updatedAt":"2017-05-31T00:54:38.000Z","bios":{},"foreignIds":{"TRKR1":"225031","ESPORTSTMNT06":"200000353"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1026,"slug":"sky","name":"Sky","firstName":"Haneul","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/sky-2m0pzkna.png","hometown":"Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:03:37.000Z","updatedAt":"2017-05-31T00:49:05.000Z","bios":{},"foreignIds":{"TRKR1":"225033","ESPORTSTMNT06":"200000356"},"socialNetworks":{},"champions":[],"liveGameTeam":9},{"id":1033,"slug":"blank","name":"Blank","firstName":"Sungu","lastName":"Kang","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/blank-7ie205tv.png","hometown":"South Korea","region":"LCK - Champions Korea ","birthdate":null,"createdAt":"2016-01-06T22:04:19.000Z","updatedAt":"2017-07-06T14:24:22.000Z","bios":{"en_US":"<p>Sungu “Blank” Kang started his career in China in late 2014. After being relegated from the LPL as a member of Star Horn Royal Club, Blank left the team to join SK telecom T1 in late 2015. He didn’t exactly impress with his first few games in the LCK, but when the team took him to IEM he excelled, and the team finished the tournament unbeaten. Just like that, Blank added his first trophy to his resume.</p>\n\n<p>His performances seem to be consistently improving, and SKT opted to keep playing him over the struggling veteran, Bengi. In his first split as an LCK jungler, he took first in Champions Spring, yet in the Summer Split it was clear that he was still learning how to control vision across the map. He took a back seat to Bengi during SKT's third World Championship run. While Bengi has departed, now Blank has to compete with superstar jungler Peanut for playing time.</p>","es_AR":"<p>Sun-gu \"Blank\" Kang inició su carrera en China a finales del 2014. Después de sufrir un descenso de la LPL como miembro de Star Horn Royal Club, Blank se fue del equipo para unirse a SKTelecom a finales del 2015. No tuvo una actuación muy impresionante en sus primeras partidas en la LCK, pero cuando el equipo lo llevó a la EIM, se destacó y su grupo acabó el torneo invicto. De esta forma, Blank agregó el primer trofeo a su historial.</p>\n\n<p>Sus actuaciones parecen mejorar constantemente, y SKTelecom optó por seguir jugando con él en lugar del veterano Bengi, quien no está teniendo una buena racha. En su primer torneo como junglero de la LCK, salió primero en la Champions Spring, pero en el torneo de clausura quedó claro que aún debía aprender a controlar la visión del mapa. Como resultado, SKTelecom no tuvo unas buenas eliminatorias, y cayó en la semifinal. Blank deberá refinar su control del mapa si quiere que SKTelecom tenga una buena actuación que le permita ganar el trofeo del Campeonato Mundial.</p>","fr_FR":"Sungu « Blank » Kang a débuté sa carrière en Chine fin 2014. Après avoir été relégué des LPL en tant que membre de Star Horn Royal Club, Blank a quitté l'équipe pour rejoindre SK Telecom T1 à la fin de l'année 2015. Il ne s'est pas exactement montré impressionnant lors de ses premiers matchs des LCK, mais quand l'équipe l'a emmené avec elle à l'IEM, il a révélé tout son talent et SKT a terminé le tournoi invaincue. Aussi simplement que ça, Blank a ajouté son premier trophée à son C.V.\n\nSes performances semblent s'améliorer régulièrement, aussi SKT a préféré le conserver en lieu et place de leur vétéran quelque peu affaibli, Bengi. Lors de son premier segment en tant que jungler au sein des LCK, il a remporté sa première victoire au tournoi Champions Spring. Mais lors du segment d'été il était clair qu'il apprenait encore à contrôler sa vision de l'ensemble de la carte. Il s'est ensuite effacé au profit de Bengi au cours du troisième Championnat du monde de SKT. Mais suite au départ de Bengi, c'est maintenant à Blank de se disputer du temps de jeu avec le jungler vedette qu'est Peanut\n","es_ES":"Sungu ''Blank'' Kang comenzó su carrera en China a finales de 2014. Tras ser relegado de la LPL como miembro de Star Horn Royal Club, Blank dejó el equipo y se unió a SK telecom T1 a finales de 2015. Sus primeras partidas en la LCK no fueron impresionantes, pero su actuación en el IEM fue excelente y el equipo terminó el torneo invicto. Y así fue como Blank añadió el primer trofeo a su currículum.\n\nSu rendimiento no dejaba de mejorar, así que SKT optó por darle prioridad frente al veterano Bengi. En su primer split como jungla de la LCK obtuvo el primer puesto en el Champions Spring, pero en el split de verano fue evidente que todavía estaba aprendiendo a controlar la visión del mapa. En el tercer Campeonato Mundial de SKT, Blank tuvo que ser suplente de Bengi. Ahora que Bengi se ha marchado del equipo, Blank tendrá que competir contra Peanut, el jungla superestrella, para ganarse tiempo de juego.\n","de_DE":"Sungu „Blank“ Kang begann seine Karriere Ende 2014 in China. Nachdem er mit dem Star Horn Royal Club aus der LPL abgestiegen war, verließ er die Mannschaft und wechselte Ende 2015 zu SK Telecom T1. In den ersten paar Spielen in der LCK konnte er nicht wirklich überzeugen, aber beim IEM lieferte er eine überragende Vorstellung ab und half seiner Mannschaft, das Turnier ungeschlagen zu beenden. Und mir nichts, dir nichts konnte Blank seine erste Trophäe in die Höhe stemmen.\n\nSeine Leistung scheint immer besser zu werden und SKT entschied sich, ihn dem erfahrenen Bengi vorzuziehen. In seinem ersten Split als LCK-Jungler holte er sich den ersten Platz beim Champions Spring, doch beim Sommer-Split wurde klar, dass er immer noch lernen musste, wie man die Sicht auf der Karte sicherstellt. Bei der Weltmeisterschaft musste er jedoch Bengi den Vortritt lassen. Seit dem Abgang von Bengi muss Blank mit dem Superstar im Dschungel, Peanut, um Spielzeit kämpfen.\n","pl_PL":"Kariera Sungu „Blank” Kanga zaczęła się w Chinach pod koniec 2014 roku. Po relegowaniu z LPL wraz ze wszystkimi pozostałymi członkami Star Horn Royal Club Bank opuścił drużynę, aby pod koniec 2015 roku dołączyć do SK Telecom T1. Nie zaimponował specjalnie podczas swoich pierwszych meczów w LCK, ale gdy drużyna zabrała go na IEM, pokazał, na co go stać i zespół wygrał turniej bez porażki. W ten sposób Blank dodał do swojego resume pierwsze trofeum.\n\nJego występy wydają się coraz lepsze i SKT postanowili zatrzymać go w składzie w miejsce zmagającego się z problemami weterana, Bengiego. Podczas swojego pierwszego splitu w roli dżunglera w LCK Blank zajął pierwsze miejsce w Champions Spring, jednak w toku letniego splitu stało się jasne, że wciąż uczy się kontroli wizji na całej mapie. Ustąpił miejsca Bengiemu podczas trzeciego podejścia SKT do Mistrzostw Świata. Odkąd Bengi odszedł, Blank musi rywalizować o udział w grze z supergwiazdą, dżunglerem Peanutem.\n","pt_BR":"<p>Sungu \"Blank\" Kang iniciou sua carreira na China no fim de 2014. Depois de ser rebaixado na LPL quando ainda era um membro da Star Horn Royal Club, Blank saiu da equipe e entrou para a SK Telecom T1 no final de 2015. Ele não impressionou muito com seus primeiros jogos na LCK, mas quando sua equipe o levou para a IEM, ele se destacou e a equipe terminou o torneio invicta. E simples assim, Blank acrescentou seu primeiro troféu em seu currículo.</p>\n\n<p>Seu desempenho parecia estar melhorando consistentemente, então a SKT optou por continuar jogando com ele em vez do veterano, Bengi, que parecia estar com dificuldades. Em sua primeira Etapa como caçador na LCK, ele ficou em primeiro lugar na Champions de Primavera, mas ficou claro na Etapa de Verão de que ele ainda precisava melhorar seu controle de visão do mapa. Ele ficou na reserva do Bengi durante o terceiro Campeonato Mundial da SKT. Agora que Bengi saiu da equipe, Blank precisa competir com o caçador estrela Peanut para jogar.\n</p>"},"foreignIds":{"ESPORTSTMNT06":"200000434","TRLH1":"200000413","TRLH2":"200000313","TRLT3":"200000211"},"socialNetworks":{},"champions":[],"liveGameTeam":9}],"scheduleItems":[{"id":"AVcMQev4oUG4HPFjOKCj","content":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:match:eb04d900-367d-42e4-98ab-121a254e66ae","scheduledTime":"2015-10-16T16:00:00.000+0000","tags":{"leagueLabel":"urn:rg:lolesports:global:league:league:9","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6","blockLabel":"Quarterfinals","subBlockLabel":"2","subBlockPrefix":"day","stageLabel":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:bracket:7b37dd34-b90e-4d6a-bf7c-e8565a435b93"},"match":"eb04d900-367d-42e4-98ab-121a254e66ae","tournament":"91be3d78-874a-44e0-943f-073d4c9d7bf6","bracket":"7b37dd34-b90e-4d6a-bf7c-e8565a435b93","league":"9"}],"gameIdMappings":[{"id":"fcc320d9-3720-483c-80fe-73b817699531","gameHash":"7f2c732d646434da"},{"id":"8e7f6a53-bd23-4648-80b0-2585b48c5ff9","gameHash":"a2c619fe40d57047"},{"id":"f8f3a265-46e8-42dd-a1c4-169f4e441d3c","gameHash":"707bd1a4931fab7a"}],"videos":[{"id":200,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:fcc320d9-3720-483c-80fe-73b817699531","source":"https://www.youtube.com/embed/m4fMfaTTqgE?wmode=transparent","createdAt":"2015-10-16T18:19:14.000Z","updatedAt":"2015-10-16T18:19:14.000Z","game":"fcc320d9-3720-483c-80fe-73b817699531"},{"id":201,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:fcc320d9-3720-483c-80fe-73b817699531","source":"https://www.youtube.com/embed/L_COSFuJFZE?wmode=transparent","createdAt":"2015-10-16T19:04:01.000Z","updatedAt":"2015-10-16T19:04:01.000Z","game":"fcc320d9-3720-483c-80fe-73b817699531"},{"id":202,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:8e7f6a53-bd23-4648-80b0-2585b48c5ff9","source":"https://www.youtube.com/embed/l8FwQUQxrEE?wmode=transparent","createdAt":"2015-10-16T19:03:45.000Z","updatedAt":"2015-10-16T19:03:45.000Z","game":"8e7f6a53-bd23-4648-80b0-2585b48c5ff9"},{"id":203,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:fcc320d9-3720-483c-80fe-73b817699531","source":null,"createdAt":"2015-10-16T19:04:02.000Z","updatedAt":"2015-10-16T19:04:02.000Z","game":"fcc320d9-3720-483c-80fe-73b817699531"},{"id":204,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:8e7f6a53-bd23-4648-80b0-2585b48c5ff9","source":"https://www.youtube.com/embed/RLVQQNyclnM?wmode=transparent","createdAt":"2015-10-16T19:05:09.000Z","updatedAt":"2015-10-16T19:05:09.000Z","game":"8e7f6a53-bd23-4648-80b0-2585b48c5ff9"},{"id":205,"slug":null,"label":null,"locale":"pt","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:f8f3a265-46e8-42dd-a1c4-169f4e441d3c","source":"https://www.youtube.com/embed/DxP4ABhe8Fw?wmode=transparent","createdAt":"2015-10-16T20:08:57.000Z","updatedAt":"2015-10-16T20:08:57.000Z","game":"f8f3a265-46e8-42dd-a1c4-169f4e441d3c"},{"id":206,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:91be3d78-874a-44e0-943f-073d4c9d7bf6:game:f8f3a265-46e8-42dd-a1c4-169f4e441d3c","source":"https://www.youtube.com/embed/XGze1cFojKw?wmode=transparent","createdAt":"2015-10-16T20:52:45.000Z","updatedAt":"2015-10-16T20:52:45.000Z","game":"f8f3a265-46e8-42dd-a1c4-169f4e441d3c"}],"htmlBlocks":[],"match":{"id":"eb04d900-367d-42e4-98ab-121a254e66ae","name":"R1M2","position":1,"state":"resolved","groupName":"Round 1","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5}],"games":{"f8f3a265-46e8-42dd-a1c4-169f4e441d3c":{"id":"f8f3a265-46e8-42dd-a1c4-169f4e441d3c","name":"G3","generatedName":"AHQ|SKT|G3|eb04d900367d42e498a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5}],"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1445022345252,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001400074","gameRealm":"TRLH3","platformId":"TRLH3:1001400074","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"752af83c-2aaf-47b5-b184-0771d43e7e5d":{"id":"752af83c-2aaf-47b5-b184-0771d43e7e5d","name":"G4","generatedName":"AHQ|SKT|G4|eb04d900367d42e498a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5},{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"e0f2b2d4-089c-42a7-b496-056afc8d6cff":{"id":"e0f2b2d4-089c-42a7-b496-056afc8d6cff","name":"G5","generatedName":"AHQ|SKT|G5|eb04d900367d42e498a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"fcc320d9-3720-483c-80fe-73b817699531":{"id":"fcc320d9-3720-483c-80fe-73b817699531","name":"G1","generatedName":"AHQ|SKT|G1|eb04d900367d42e498a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4},{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5}],"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1445015337364,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001400066","gameRealm":"TRLH3","platformId":"TRLH3:1001400066","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}},"8e7f6a53-bd23-4648-80b0-2585b48c5ff9":{"id":"8e7f6a53-bd23-4648-80b0-2585b48c5ff9","name":"G2","generatedName":"AHQ|SKT|G2|eb04d900367d42e498a","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":5},{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612","breakpoint":"58da3f40-cea6-4a65-8245-9fe6559d5530","standing":4}],"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1445018389631,"source":"manual","note":"Set in esports HQ","closed":true},"scores":{},"gameId":"1001400073","gameRealm":"TRLH3","platformId":"TRLH3:1001400073","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]}}},"standings":{"result":[[{"roster":"d0090f63-9819-43f0-9314-9997cd3c1612"}],[{"roster":"930dbeee-1412-4198-a6ac-dcdb1170617b"}]],"timestamp":1445022345257,"source":"bestOf","closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":false}]},"scores":{}}}