{"teams":[{"id":11,"slug":"team-solomid","name":"TSM","guid":"be6c830e-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-cg2byxoe.png","acronym":"TSM","homeLeague":"urn:rg:lolesports:global:league:league:2","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/team-solomid-bjjwknt9.png","createdAt":"2014-08-01T18:45:34.000Z","updatedAt":"2017-07-26T23:20:02.000Z","bios":{"en_US":"<p>TSM is a perennial North American powerhouse. In that respect, 2016 was a successful year, as TSM finished second in the Spring Split, and rode a wave of momentum to first place in the Summer Split. When TSM punched their tickets to the 2016 World Championship, they were seen as North America’s greatest hope for a victor. Unfortunately, the team stumbled and bowed out of the tournament in the group stage, ending their hopes of becoming a North American champion.</p>\n\n<p>Despite losing Doublelift for the spring split, TSM still took home the NA LCS crown. After a rocky start, the team rallied around their star mid laner and a breakout performance from Hauntzer in the top lane. Once again,\n their regional dominance didn't translate to the world stage, and the team placed fifth at the 2017 Mid-Season Invitational. With Doublelift back on board for summer, hopes are high that TSM will finally shake off their international struggles.</p>\n\n<p>Coach: Parth \"Parth\" Naidu</p>","fr_FR":"TSM est une véritable machine de guerre en Amérique du Nord. Pour elle, 2016 a été une année fructueuse : TSM a fini seconde au segment de printemps et, galvanisée par cet élan, l'équipe est arrivée en première place au segment d'été. Lorsque TSM a obtenu son ticket pour le Championnat du monde 2016, ils étaient considérés comme le plus grand espoir de victoire d'Amérique du Nord. Malheureusement, ses joueurs ont trébuché et ont tiré leur révérence lors de la phase de groupe, mettant fin à leurs espoirs de devenir champions d'Amérique du Nord.\n\nMalgré le départ de Doublelift pour le segment, TSM reste dans la course en 2017. Après un début compliqué, l'équipe a fait corps avec son midlaner star et a bénéficié d'une superbe performance de la part d'Hauntzer sur la voie du haut. Grâce à sa victoire face à Cloud9 durant une finale des LCS NA plus que disputée, TSM prend la route du Mid-Season Invitational 2017 avec la ferme intention de se racheter sur la scène internationale.\n\nEntraîneur : Parth « Parth » Naidu\n","pl_PL":"G2 Esports lubią odgrywać rolę „tego złego” w EU LCS. Po przebrnięciu przez europejskie Challenger Series i zapewnieniu sobie miejsca w EU LCS, wykorzystali swój agresywny styl gry przeciwko najlepszym drużynom ligi. Przedarli się przez rywali niczym Kog’Maw w później fazie gry i świetnie się przy tym bawili. Ukończyli rok 2016 jako dwukrotni mistrzowie EU LCS. Ale dostali po uszach na Mistrzostwach Świata 2016, podczas których zdołali zdobyć tylko jedno zwycięstwo w fazie grupowej.\n\n2017 postanowili zacząć od rewanżu. Z charakterystyczną dla siebie butą zdominowali swoją grupę w EU LCS i pokonali Unicorns of Love w finale. Ponieważ są najlepszą drużyną Europy, to na nich spadnie odpowiedzialność za przywrócenie reputacji regionu na Mid-Season Invitational 2017 — nawet gdyby miało to oznaczać rezygnację z wakacji.\n\nTrener: Joey „Youngbuck” Steltenpool\n","de_DE":"TSM ist ein absolutes Schwergewicht in der NA LCS. 2016 war für TSM ein erfolgreiches Jahr, denn die Mannschaft konnte das Momentum des zweiten Platzes im Frühjahrs-Split nutzen und den Sommer-Split gewinnen. Als TSM sein Ticket für die Weltmeisterschaft 2016 löste, galten sie als Nordamerikas größte Hoffnung auf den Sieg. Leider konnte die Mannschaft nicht an ihre Leistungen in den Splits anknüpfen und schied bereits in der Gruppenphase der WM aus.\n\nObwohl TSM im ersten Split des Jahres auf Doublelift verzichten musste, hat die Mannschaft auch 2017 einen sehr hohen Anspruch an sich selbst. Nach leichten Startschwierigkeiten konnte sich die Mannschaft dank ihres Mid-Laners und einer herausragenden Leistung von Hauntzer auf der oberen Lane wieder fangen. TSM konnte sich mit einem knappen Sieg gegen Cloud9 im Finale der NA LCS für das Mid-Season Invitational 2017 qualifizieren, wo sie auf der internationalen Bühne versuchen werden, ihre schlechte Vorstellung bei der WM ungeschehen zu machen.\n\nTrainer: Parth „Parth“ Naidu\n","es_ES":"TSM es la mayor potencia norteamericana. En ese sentido, el año 2016 vino cargado de éxitos, ya que TSM acabó segundo en el split de primavera y tomó impulso para ocupar el primer puesto en el split de verano. Cuando TSM selló su billete para el Campeonato Mundial 2016, era considerado el principal candidato norteamericano para hacerse con la victoria. Por desgracia, el equipo tropezó y tuvo que abandonar el torneo en la fase de grupos, lo que acabó con todas sus esperanzas de convertirse en los campeones norteamericanos.\n\nA pesar de perder a Doublelift este split, TSM está preparado para darlo todo en 2017. Tras un comienzo difícil, el equipo se centró en apoyar a su mid, y Hauntzer consiguió unos grandes resultados en la calle superior. Tras superar a Cloud9 en la disputada final de la LCS NA, el equipo se dirige al Mid-Season Invitational 2017 para intentar recuperar su prestigio internacional.\n\nEntrenador: Parth ''Parth'' Naidu\n","pt_BR":"<p>TSM é uma equipe forte norte-americana. Falando nisso, 2016 foi um ano de sucesso, pois a TSM terminou em segundo na Etapa de Primavera e ganhou força avançando para o primeiro lugar na Etapa de Verão. Quando a TSM recebeu seus bilhetes para o Campeonato Mundial 2016, foi vista como a grande esperança de vitória da América do Norte. Infelizmente, a equipe tropeçou e encerrou seu ato no torneio na Fase de Grupos, acabando com suas esperanças de se tornar a campeã norte-americana.</p>\n\n<p>Apesar de perder Doublelift na Etapa, a TSM está pronta para competir em 2017. Depois de um começo instável, a equipe se reuniu em apoio do seu jogador de destaque da rota do meio e desempenho incríel de Hauntzer na rota superior. Depois de vencer a Cloud9 em uma final tensa da LCS NA, a equipe segue para o Mid-Season Invitational 2017 buscando se redimir internacionalmente.</p>\n\n<p>Técnico: Parth \"Parth\" Naidu</p>","es_AR":"<p>Después de sufrir una derrota aplastante ante Counter Logic Gaming en la final del torneo de apertura de la LCS NA, TSM disfrutó de una buena racha. Sumaron al soporte novato Vincent \"Biofrost\" Wang al plantel para el inicio del torneo de clausura y no volvieron a mirar atrás. Fue así que consiguieron un récord de 17-1 en la temporada regular. Ganaron casi todos los combates de forma contundente, pero lo cierto es que aún no se han enfrentado a una amenaza internacional. Este será el primer viaje que haga esta escuadra al Mundial, y no ven la hora de revertir el triste desempeño de TSM en el Campeonato Mundial 2015 para reivindicarse y dejar bien parada a Norteamérica. Son cabeza de serie de la región en el torneo y buscarán hacer sentir orgullosos a sus simpatizantes.</p>\n\n<p><strong>Entrenador: Parth \"Parth\" Naidu</strong></p>"},"foreignIds":{"drupalId":"1"},"players":[60,62,153,171,204,345,1158,1672,1838],"starters":[60,153,171,345,1158],"subs":[62,204,1672,1838]},{"id":34,"slug":"unicorns-of-love","name":"Unicorns of Love","guid":"be6c9926-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://na.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/unicorns-of-love-ih8ytfi8.png","acronym":"UOL","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-09-09T05:30:01.000Z","updatedAt":"2017-05-31T15:12:41.000Z","bios":{"en_US":"<p>Unicorns of Love exploded into the League of Legends scene in 2015 utilizing off meta and unique champion picks such as Poppy (at the time) and Hecarim. They would go on to secure 2nd place again in their debut EU LCS Spring Playoffs, losing to Fnatic in a nail-biting Best of 5 series.</p>\n\n<p>Since then, UOL has undergone a slew of roster changes as the team continues to search for the right mix of talent and chemistry. They stayed largely the same this offseason though, only changing junglers and making a last minute change at the AD Carry position. The Unicorns will take their ever-improving chemistry into 2017 as they aim to take home their first EU LCS trophy.</p>\n\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p> Team Manager: Romain \"Khagneur\" Bigeard</p>\n","de_DE":"<p>Die Unicorns of Love stürmten die „League of Legends“-Szene 2015 mit einem ungewöhnlichen Metaspiel und einzigartigen Champions wie Poppy (damals) und Hecarim. Sie konnten sich erneut bei ihrem Debüt in den Entscheidungsspielen im Frühjahr der EU LCS den 2. Platz erkämpfen, wo sie in einem aufreibenden Finale gegen Fnatic verloren.\n\nSeither hat sich die Aufstellung der UOL einige Male verändert, während die Mannschaft immer noch nach einer Mischung aus Talent und Harmonie sucht. In der Nebensaison blieben sie großteils unverändert, Wechsel gab es nur im Dschungel und in letzter Sekunde auf der AD-Carry-Position. Sie werden ihre verbesserte Harmonie mit ins Jahr 2017 nehmen und versuchen, ihre erste „EU LCS“-Trophäe einzuheimsen.</p>\n\n<p>Coach: Fabian „Sheepy“ Mallant</p>\n<p>Mannschaftsleiter: Romain \"Khagneur\" Bigeard</p>","pl_PL":"<p>Patrząc z perspektywy innych stowarzyszeń, Unicorns of Love to bardzo młoda organizacja. Pierwszy raz na scenie esportowej pojawiła się dopiero w serii wydarzeń Go4LoL na początku 2014 roku. Na początku byli tylko grupą znajomych nastawioną na wygrywanie cotygodniowych turniejów. Dopiero po paru zwycięstwach zorientowali się, że są w stanie osiągnąć w League of Legends dużo więcej. Już w maju tego roku zdobyli trzecie miejsce na 2014 Black Monster Cup. Następnie gracze UOL próbowali dostać się do EU LCS, czyli wzięli aktywny udział w Challenger Series. Z podejścia do wiosennego sezonu 2014 zostali wyeliminowani na początku wydarzenia przez EYES ON U. W kolejnym turnieju promocyjnym, letniego sezonu EU LCS 2014, trafili na zespół Ninjas in Pyjamas, który przekreślił ich szansę na zawalczenie o więcej. Jednorożcom udało się wziąć na nim odwet pół roku później – podczas kwalifikacji do EU LCS wiosną 2015 roku. W formacie „best of five” rozgromili NiP z wynikiem 3 do 0, tym samym zyskując szansę na starcie z drużyną z LCS. Ich przeciwnikiem okazał się francuski zespół Millenium, w którym występowały takie sławy jak Kevin „kev1n” Rubiszewski i Jakub „Creaton” Grzegorzewski. Po zaciętej walce drużyna Unicorns of Love zwyciężyła 3 do 2, realizując 11 września 2014 roku swój najważniejszy cel – wejście do EU LCS.</p>\n<p>Jedno z największych osiągnięć Unicorns of Love dokonało zaledwie 3 miesiące po kwalifikacji do europejskich wiosennych rozgrywek. Dzięki głosom swoich fanów jednorożce zostały zaproszone na trzecią odsłonę 9 sezonu IEM w San Jose. Nikt nie spodziewał się tak dobrego występu zespołu, który dopiero co naprawdę zaistniał na scenie esportowej. Sami gracze skomentowali swój udział w wydarzeniu krótko: „Naprawdę chcemy dać widzom dobre przedstawienie”. Tymczasem UOL pokonał Lyon Gaming, a następnie zaszokował wszystkich widzów dominując amerykańską drużynę Team SoloMid. Wynik 2 do 0 przeciwko tak doświadczonej ekipie pozytywnie zaskoczył nie tylko ich fanów, ale także profesjonalnych analityków League of Legends. Zawodnicy UOL ulegli dopiero w finale zespołowi Cloud9, jednak po tym wydarzeniu przestali być traktowani jako nowicjusze. Kolejnym wielkim sukcesem jednorożców są ich wyniki podczas rozgrywek EU LCS. W wiosennych rozgrywkach barażowych w 2015 roku pokazali klasę, pokonując m.in. SK Gaming, które skończyło regularny, wiosenny sezon na czołowej pozycji. Ulegli dopiero Fnatic 2 do 3, po długiej i zażartej potyczce, plasując się na drugim miejscu. Jak na debiutantów to wydarzenie było niesamowitym osiągnięciem. W letnim okresie tego roku nie poszło im tak dobrze, aczkolwiek utrzymali się wśród elity tabeli. Niestety przez gorszą formę w połowie roku 2015 zaprzepaścili swoje szanse na występ na Mistrzostwach Świata 2015. Jednak przed wiosennym sezonem EU LCS 2016 drużyna przeszła poważne reformy w składzie osobowym, w ramach przygotowań do ponownego zdobycia szczytu drabiny.</p>\n<p>Wiosenny sezon EU LCS 2016 nie należał dla Unicorns Of Love do nieudanych, lecz organizacja na pewno liczyła na lepsze wyniki. Drużyna w regularnym sezonie zajęła piąte miejsce po wygraniu 10 meczów na 18. W czwartym tygodniu strzelec UOL, Pierre „Steeelback” Medjaldi został ogłoszony najbardziej wartościowym graczem, ze względu na osiągnięcie zawrotnego współczynnika KDA równego 26. Jednak pomimo wcześniejszych wzlotów i upadków, pierwsze spotkanie podczas baraży nie pozostawiło żadnych wątpliwości. Jednorożce przegrały starcie z Origen 3 do 0 i skończyły na piątym miejscu, czego bezpośrednim efektem było odejście ponad połowy drużyny. Unicorns Of Love znalazła się w podobnej sytuacji jak w listopadzie poprzedniego roku, została z dwójką sprawdzony graczy. Aczkolwiek organizacja nie straciła rezonu i w ciągu paru dni znalazła godne zastępstwo. Poszła w ślady G2 Esports i Fnatic kontraktując dwóch Koreańczyków, Kima „Veritas” Kyoung-mina i Kanga „Move” Min-su’a. Znaczącym plusem była znajomość języka u nowych zawodników, którą nabyli podczas swojego pobytu w Stanach Zjednoczonych. Do zespołu dołączył też Fabian „Exileh” Schubert, młody Niemiec, weteran Kręgu Pretendenta. Po ogłoszeniu składu drużyny przed rozpoczęciem letniego sezonu EU LCS 2016 organizacja Unicorns Of Love podsumowała zmiany krótko: „Prawdopodobnie ta drużyna nigdy nie była tak silna, nie możemy się doczekać, żeby pokazać, na co nas stać!”</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Menedżer drużyny: Romain \"Khagneur\" Bigeard</p>","es_ES":"<p>Se acabó lo de ser novato. Después de un año con muchos altibajos emocionales, Unicorns of Love ha tenido que reinventarse para conseguir sobrevivir por motivo de las salidas de jugadores importantes como Tristan ‘PowerOfEvil’ Schrage a Origen. El año pasado entraron a la League Championship Series con mucha expectación gracias a encajar con su comunidad pero sin ninguna exigencia. Este año los nuevos fichajes no ilusionan tanto pero sí otorgarán la estabilidad necesaria para poder seguir confiando en ellos. Se quedaron muy cerca del éxito en dos ocasiones, es hora de confirmarlo.</p>\n\n<p>Los unicornios no fueron un equipo salido de la nada. Vencer en numerosas ocasiones en Go4LoL les otorgó la experiencia necesaria para ser capaces de sacar buenos resultados en Challenger Series. Aunque perdieron contra Ninjas in Pyjamas una vez, la segunda fue la revancha que les permitió conseguir el tercer puesto para entrar en el torneo de promoción de primavera. En dicho torneo dieron la gran sorpresa al derrotar contundentemente a Millenium para poder entrar en la LCS.</p>\n\n<p>Muchos aficionados se entusiasmaron con el equipo hasta conseguir que fueran el segundo más querido de Europa. Este apoyo también les permitió acceder a la IEM San José, donde sorprendieron de nuevo al vencer a Team SoloMid en semifinales y plantar clara a Cloud 9, potencias norteamericanas. El hype se convirtió en la principal arma de un equipo que todavía era novato.</p>\n\n<p>En su primera participación en la máxima competición europea, Unicorns of Love se convirtió en el equipo temido por todas las organizaciones. Los mejores equipos perdieron contra ellos mientras que los de baja tabla les sacaron varias victorias. Este temor se consolidó en los playoffs, al ser el primer equipo en la historia de la competición capaz de eliminar en semifinales al líder de la fase regular. Madrid vivió en una final la alocada estrategia que provocó desconcierto en sus rivales.</p>\n\n<p>En verano, todo parecía continuar de la misma manera. Volvieron a quedar cuartos en la fase regular después de una temporada de experimentación y de pruebas. Como equipo iniciaron innovaciones seguidas en todo el mundo como Varus en la línea central, pero algo no acabó de cuadrar. En los playoffs el invencible Fnatic aplastó con ellos a pesar de derrotar previamente a Roccat, lo que demostró que poco a poco los rivales les habían cogido el truco. Y para más inri, se quedaron a un paso del Campeonato Mundial 2015 tras la victoria de Origen contra ellos en los regionales.</p>\n\n<p>Las sensaciones en la IEM de San José no fueron buenas pero todavía es muy pronto para ver a un equipo que no tuvo a su última pieza, Danil ‘Diamondprox’ Reshetnikov. La salida de Mateusz ‘Kikis’ Szkudlarek provocó un período de inestabilidad en la jungla en la que ni Cho ‘H0R0’ Jae-hwan ni Berk ‘Gillius’ Demir fueron capaces de dominar la posición. Ahora llega savia nueva y experimentada que intentará dejar el nombre en alto.</p>\n\n<p>Un Unicorns of Love que decidieron cuando jugaban clasificatoria 5v5. Les permitía que los rivales se relajasen y a la vez era lo suficientemente divertido como para que más tarde sin pensarlo les otorgara una comunidad amplia y proactiva. En el estudio de Berlín fue común encontrarse caretas de unicornios, y esta temporada se espera que siga así.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Jefe de equipo: Romain \"Khagneur\" Bigeard</p>","fr_FR":"<p>Unicorns of Love a commencé à répandre l’amour sur la scène Challenger en 2014. Les résultats sont discutables mais UoL parvient à se qualifier sur le fil aux play-offs des Challenger series. La structure peaufine sa composition à l’aube de la compétition. L’Allemand Berk « Gilius » Demir prend la place de jungler tandis que son compatriote Tristan « PowerOfEvil » Schrage revient dans l’équipe. Le reste de la formation est constitué du Hongrois Tamás « Vizicsacsi » Kiss en voie du haut, du Suédois Pontus « Vardags » Dahlblom au poste de carry AD et du Bulgare Zdravets « Hylissang » Galabov en tant que support.</p>\n\n<p>Les UoL s’inclinent en demi-finale face aux H2K de Fabian « Febiven » Diepstraten mais réussissent à gravir la 3e marche du podium après une victoire cinglante face à une équipe Ninja in Pyjamas pourtant composée de Lucas « Cabochard » Simon-Meslet, Alexey « Alex Ich » Ichetovkin et de Aleš « Freeze » Kněžínek. Unicorns of Love a par conséquent gagné sa chance de participer au tournoi de promotion qui permet d’accéder aux League of Legends Championship Series.</p>\n\n<p>UoL affronte les Millenium de Kevin « kev1n » Rubiszewski et Jakub « Creaton » Grzegorzewski, qui remportent les deux premières parties et s’offrent donc trois balles de match. C’est à ce moment-là, au pied du mur, que les licornes sortent leur botte secrète, Poppy top, et réussissent à remonter la pente, se qualifiant de justesse au segment de printemps 2015.\nAlors qu’ils n’ont pas encore disputé un seul match en LCS, les Unicorns of Love sont envoyés aux Intel Extreme Masters San Jose par les votes des fans convaincus par un style de jeu osé, des champions atypiques et un nom d’équipe attachant. Gilius est alors contraint de céder sa place à Mateusz « Kikis » Szkudlarek. Le collectif fait honneur aux fans européens en éliminant l’équipe mexicaine Lyon Gaming avant d’écraser Team SoloMid. Malgré une défaite en finale face à des Cloud9 très en forme, le bilan est très positif pour une équipe tout juste issue des Challengers series.</p>\n\n<p>La tendance se confirme aux LCS, UoL est dans le sillage des meilleures équipes et se hisse à la très correcte 5e place de la saison régulière. UoL arrive aux play-offs en tant qu’outsider, mais élimine Gambit Gaming en jouant Shaco jungle. L’équipe s’impose en demi-finale face au numéro 1 de la saison régulière, SK Gaming, avant de s’incliner de justesse en finale face à Fnatic en tentant de dépoussiérer Udyr jungle.</p>\n\n<p>En saison estivale, UoL continue à briller tout en jouant des champions atypiques comme la Orianna Châtiment et Glaive Runique de PowerOfEvil. Malheureusement, UoL échoue à obtenir la troisième place des play-offs, se fait ensuite balayer par Origen pendant le tournoi de qualification régional et perd ainsi toute chance d’accéder au mondial 2015.</p>\n\n<p>En 2016, l’équipe se reconstruit autour de Vizicsacsi et de Hylissang en recrutant la légende vivante Danil « Diamondprox » Reshetnikov ainsi que Hampus « Fox » Myhre et Pierre « Steeelback » Medjaldi, deux espoirs qui ont déjà montré un très bon niveau chez SK Gaming et Fnatic.</p>\n<p>Coach: Fabian \"Sheepy\" Mallant</p>\n<p>Responsable d’équipe: Romain \"Khagneur\" Bigeard</p>"},"foreignIds":{"drupalId":"1281"},"players":[238,242,381,1265,1267,1268,1545],"starters":[238,242,381,1265,1545],"subs":[1267,1268]}],"players":[{"id":60,"slug":"bjergsen","name":"Bjergsen","firstName":"Søren","lastName":"Bjerg ","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/bjergsen-11lutqog.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:16.000Z","updatedAt":"2017-07-04T19:23:34.000Z","bios":{"en_US":"<p>Søren “Bjergsen” Bjerg has earned the respect of his fans and peers. Called the “North American Faker” by many, including the SK telecom T1 mid laner himself, Bjergsen has demonstrated he has no true equal among NA LCS mids. While Bjergsen and the rest of TSM dominated in North America, their group stage exit at Worlds left an entire region crestfallen.</p>\n\n<p>After his team’s international stumble, Bjergsen turned his sights to the 2017 NA LCS Spring Split. The former MVP’s dominance was on display all season, but especially in the tense finals match against Cloud9, where he deleted carries with brutal precision on his signature Syndra. Bjergsen has etched another split of experience into his belt, and he should be as formidable as ever when he hits the stage this summer.</p>","fr_FR":"Søren « Bjergsen » a gagné le respect de ses fans et de ses pairs. Surnommé le « Faker nord-américain » par beaucoup, y compris par le midlaner de SK Telecom T1 lui-même, il a prouvé qu'aucun midlaner dans les LCS NA n'arrivait à sa hauteur. Alors que Bjergsen et le reste de TSM ont dominé en Amérique du Nord, leur sortie dès la phase de groupe au Mondial a laissé toute une région sous le choc.\n\nAprès l'échec de l'équipe au niveau international, Bjergsen s'est concentré sur le segment de printemps des LCS NA 2017. La domination de l'ancien MVP a été éclatante toute la saison, mais plus particulièrement lors de la finale très tendue qui a opposé TSM à Cloud9. Lors de cette rencontre, il a anéanti les carrys avec la précision implacable de son champion de prédilection, Syndra. Fort de l'expérience d'un nouveau segment, Bjergsen devrait de nouveau montrer toute l'ampleur de son talent à l'occasion du Mid-Season Invitational 2017.\n","pl_PL":"Søren „Bjergsen” Bjerg ciężko pracował na szacunek swoich fanów i kolegów. Zwany przez wielu „Północnoamerykańskim Fakerem” (włącznie z samym środkowym SK Telecom T1), Bjergsen pokazał, że nie ma sobie równych wśród środkowych NA LCS. Ponieważ Bjergsen i reszta TSM dominowali w Ameryce Północnej, ich odpadnięcie z fazy grupowej na Mistrzostwach załamało cały region.\n\nPo kłopotach drużyny na arenie międzynarodowej Bjergsen skupił uwagę na wiosennym splicie NA LCS 2017. Dominacja byłego najlepszego zawodnika była doskonale widoczna w toku całego sezonu, a szczególnie w zaciętym meczu finałowym przeciwko Cloud9, w którym z brutalną precyzją eliminował prowadzących swoją sztandarową Syndrą. Bjergsen dołączył do bagażu swoich doświadczeń kolejny split i powinien okazać się groźniejszy niż kiedykolwiek wcześniej, gdy wejdzie na arenę Mid-Season Invitational 2017.\n","de_DE":"Søren „Bjergsen“ Bjerg hat sich den Respekt der Fans und seiner Kollegen erarbeitet. Bjergsen, der von vielen auch „nordamerikanischer Faker“ genannt wird – sogar der Mid-Laner von SK Telecom T1 selbst nennt ihn so – hat bewiesen, dass ihm in Nordamerika niemand das Wasser reichen kann. Während Bjergsen und der Rest von TSM Nordamerika dominierten, hat ihr frühes Ausscheiden in der Gruppenphase der Weltmeisterschaft eine ganze Region enttäuscht.\n\nNach den Schwierigkeiten seiner Mannschaft auf der internationalen Bühne hat sich Bjergsen ganz auf den Frühjahrs-Split der NA LCS 2017 konzentriert. Der ehemalige MVP lieferte in der ganzen Saison eine dominante Vorstellung ab, was vor allem im Finale gegen Cloud9 deutlich wurde, wo er den gegnerischen Carrys mit seinem Lieblingschampion Syndra das Leben schwer machte. Bjergsen ist wieder einen Split an Erfahrungen reicher und seine Rückkehr auf die internationale Bühne beim Mid-Season Invitational 2017 sollte so eindrucksvoll werden wie eh und je.\n","es_ES":"Søren ''Bjergsen'' Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el ''Faker cnorteamericano'' por muchos, incluyendo el propio mid de SK telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores de la calle central de la LCS NA. Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada.\n\nTras el tropiezo internacional de su equipo, Bjergsen puso la mirada en el split de primavera de la LCS NA 2017. La superioridad del que fuera MVP ha quedado patente toda la temporada, pero especialmente en la tensa final contra Cloud9, donde machacó a los carries con una precisión brutal con la Syndra que le caracteriza. Bjergsen suma un año más de experiencia a sus espaldas, así que debería jugar de forma tan increíble como siempre cuando llegue al escenario del Mid-Season Invitational 2017.\n","pt_BR":"<p>Søren \"Bjergsen\" Bjerg conquistou o respeito de seus fãs e colegas. Chamado de \"Faker da América do Norte\" por muitos, incluindo o próprio jogador de meio da SK Telecom T1, Bjergsen demonstrou que não tem pra mais ninguém entre os jogadores de meio da LCS NA. Apesar de Bjergsen e do resto da TSM terem dominado na América do Norte, sua saída na Fase de Grupos do Mundial deixou toda uma região decepcionada.</p>\n\n<p>Após o tropeção da sua equipe internacional, Bjergsen virou sua atenção para a Etapa de Primavera da LCS NA 2017. O antigo domínio do jogador mais valioso foi exibido durante toda temporada, mas especialmente na tensa partida final contra a Cloud9, onde ele deletou carregadores com  precisão brutal da sua Syndra. Bjergsen gravou outra etapa de experiência no seu cinturão e deverá estar tão formidável como sempre quando subir ao palco no Mid-Season Invitational 2017.\n</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Søren \"Bjergsen\" Bjerg은 미드 라인의 카리스마 넘치는 신성입니다. 예전에 유럽의 Copenhagen Wolves 소속으로 명성을 누렸던 이 선수는 2013년 TSM으로 이적한 후 넓은 챔피언 폭과 날카로운 피지컬로 북미 최고의 미드 라이너들을 하나씩 쓰러뜨렸습니다. 뿐만 아니라 Bjergsen은 끊임없이 자신의 플레이를 반성하며 약점을 보완해가는 선수이기도 합니다. 지난 몇 년간 계속해서 실력이 향상되어, 이제는 북미 최강 미드 라이너라는 입지를 탄탄히 굳혔죠. </p>\n<p style=”font-family:”나눔고딕”;\">Bjergsen은 적을 쓰러뜨릴 때마다 자신감이 더 강해졌습니다. 수줍고 조용한 소년이던 그는 TSM에 합류한 후 북미 e스포츠계 최고의 인기인물 중 한 명으로 떠올랐습니다. TSM 팬들이 이를 증명하고 있죠. 숙소에 불을 내지 않고 요리를 하는, TSM 역사에서 누구도 성공하지 못했던 위업을 달성했다는 소문까지 있습니다. </p>\n<p style=”font-family:”나눔고딕”;\">또한 짧은 기간에 TSM의 오더를 담당하는 주장 역할로 성장하기도 했습니다. 예전의 TSM이 Bjergsen 선수의 미드 라인에 집중적으로 투자하는 전략을 펼치는 팀이었다면, 현재의 그는 팀 플레이로 승리하겠다는 생각이 더 강해 보입니다. “팀을 위해 조합을 선택하고, 팀을 위해 플레이합니다. (미드 라인) 1:1보다 정글에, 팀 전체에 힘을 더 많이 싣고 있어요.” TSM의 성공은 Bjergsen 선수와 다른 팀원들 간의 완벽한 균형을 찾아내는 데 달려 있으며, 이를 달성하겠다는 Bjergsen 선수의 의지도 무엇보다 강합니다. </p>\n","es_AR":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>","cs_CZ":"<p>Søren „Bjergsen“ Bjerg si vysloužil respekt jak u fanoušků, tak mezi ostatními hráči. Mnozí o něm mluví jako o „severoamerickém Fakerovi“, a to včetně samotného středového lajnaře z SK Telecom T1. Bjergsen jasně prokázal, že ve středové lajně nemá v severoamerickém LCS sobě rovného. Tento držitel ceny pro nejužitečnějšího hráče letního splitu severoamerického LCS 2016 dostal ohromných 66 % hlasů pro středovou lajnu, což je nejvíc z celého severoamerického týmu.</p>\n\n<p>Bjergsen a zbytek TSM sice Severní Ameriku naprosto ovládli, na MS však vypadli již ve skupině a sny regionu o dosažení historického úspěchu se rozplynuly. Bjergsen podával působivé výkony se Syndrou a Cassiopeiou, ale stačila jedna netradiční hra za Zileana proti středovému lajnaři Crownovi ze Samsung Galaxy, aby mu v ústech zůstala jen trpká pachuť. Tu se nyní pokusí spláchnout jako reprezentant Severní Ameriky na turnaji All-Star 2016 a všem ukázat, že si skutečně zaslouží titul nejlepšího středového lajnaře západní polokoule.</p>","el_GR":"<p>Ο Søren “Bjergsen” Bjerg έχει καταφέρει να κερδίσει τον σεβασμό των θαυμαστών και των αντιπάλων του. Πολλοί τον αποκαλούν «Faker της Βόρειας Αμερικής», συμπεριλαμβανομένου και του ίδιου του διάσημου παίκτη μεσαίας λωρίδας των SK Telecom T1, και όχι τυχαία: ο Bjergsen έχει αποδείξει ότι δεν έχει αντίπαλο στους παίκτες μεσαίας λωρίδας του LCS Βόρειας Αμερικής. Ο MVP του Summer Split 2016 του LCS Βόρειας Αμερικής πήρε το 66% των ψήφων για τη θέση της μεσαίας λωρίδας, με διαφορά το υψηλότερο ποσοστό ψήφων από όλους τους παίκτες από τη Βόρεια Αμερική.</p>\n\n<p>Παρόλο που ο Bjergsen με τους TSM κυριάρχησαν άνετα στη Βόρεια Αμερική, στο Παγκόσμιο Πρωτάθλημα αποκλείστηκαν από τη φάση ομίλων απογοητεύοντας ένα ολόκληρο έθνος. Ο Bjergsen ήταν πραγματικά εντυπωσιακός με ήρωες όπως η Σίντρα και η Κασσιόπη, αλλά σε ένα παιχνίδι όπου έπαιξε απρόσμενα με τον Ζίλεαν νικήθηκε κατά κράτος από τον Crown των Samsung Galaxy. Ως εκπρόσωπος της Βόρειας Αμερικής στο Τουρνουά All-Star 2016 στη μεσαία λωρίδα, θα προσπαθήσει να ξεπλύνει τη ντροπή από εκείνο το παιχνίδι και να αποδείξει ότι αξίζει τον τίτλο του καλύτερου παίκτη μεσαίας λωρίδας στη Δύση.</p>","hu_HU":"Søren „Bjergsen” Bjerg a rajongók és a játékostársak körében is közkedvelt figura. Sokan az „észak-amerikai Faker” néven emlegetik, többek között maga az SK Telecom T1 középső ösvényese is. Bjergsen bizonyította, hogy az NA LCS-ben nincs párja a középső ösvényen. Az NA LCS 2016-os nyári szakaszának legértékesebb játékosa a középső ösvényesek szavazatainak nem kevesebb mint 66%-át szerezte meg, ez az NA-csapat legnagyobb szavazati aránya.\n</p>\nMíg Bjergsen és a TSM egyeduralkodónak számított Észak-Amerikában, az egész régió döbbenetére már a csoportkörben kiestek a vb-ről. Bjergsen Syndrát és Cassiopeiát irányítva jól szerepelt, de a tőle szokatlan Zilean-választás a Samsung Galaxy középső ösvényese, Crown ellen fájdalmas kudarcot hozott. Az NA-csapat középső ösvényeseként vesz részt a 2016-os All-Star gálán, és próbálja majd feledtetni a dicstelen szereplés emlékét, hogy bizonyítsa, ő a legjobb nyugati középső ösvényes.\n","it_IT":"Søren \"Bjergsen\" Bjerg ha conquistato il rispetto dei fan e anche dei suoi avversari. Chiamato da molti \"il Faker nordamericano\" (persino dallo stesso centrale degli SK Telecom T1), Bjergsen ha dimostrato di non avere rivali fra i centrali della LCS NA. La conquista del titolo di MVP durante il Summer Split LCS NA 2016 gli è valso uno straordinario 66% di voti per la categoria Centrale, il risultato più alto nella squadra nordamericana.\n</p>\nPur avendo dominato la stagione regolare in Nord America, Bjergsen e i suoi compagni dei TSM hanno dovuto abbandonare i Mondiali durante la fase a gironi, lasciando l'intera regione attonita. Bjergsen eccelle al comando di campioni come Syndra e Cassiopeia, ma una particolare partita con Zilean contro il centrale dei Samsung Galaxy, Crown, gli ha decisamente lasciato l'amaro in bocca. Come centrale della squadra nordamericana all'All-Star 2016, non vede l'ora di lavare quell'onta e dimostrare di essere degno del titolo di miglior centrale di tutto l'occidente.\n","ro_RO":"Søren ''Bjergsen'' Bjerg a câștigat pe bună dreptate respectul fanilor și colegilor săi. Mulți l-au numit ''Fakerul Americii de Nord'', inclusiv însuși jucătorul de pe culoarul din mijloc al SK Telecom T1, tocmai pentru că Bjergsen a demonstrat că e de departe cel mai bun jucător de pe acea poziție din LCS NA. Cel mai valoros jucător din etapa de vară LCS NA 2016 a obținut 66 la sută din voturile pentru culoarul din mijloc, cel mai mare procent din echipa care reprezintă NA.\n</p>\nCu toate că Bjergsen și restul jucătorilor din TSM au dominat în America de Nord, eliminarea lor de la Mondiale încă din faza grupelor a demoralizat întreaga regiune. Bjergsen a fost de-a dreptul impresionant cu campioni precum Syndra și Cassiopeia, dar un joc atipic cu Zilean împotriva lui Crown, jucătorul de pe culoarul din mijloc al celor de la Samsung Galaxy, i-a lăsat cu siguranță un gust amar. Ca reprezentant al NA pe culoarul din mijloc la All-Star 2016, își va dori să șteargă acea amintire și să arate de ce își merită titlul de cel mai bun jucător de pe culoarul din mijloc din Occident.\n","es_MX":"<p>Søren \"Bjergsen\" Bjerg se ha ganado el respeto de sus fans y compañeros. Considerado el \"Faker norteamericano\" por muchos, incluyendo el propio central de SK Telecom T1, Bjergsen ha demostrado que no tiene igual entre los jugadores del carril central de la LCS NA. El galardonado como mejor jugador del torneo de verano de la LCS NA 2016 ha obtenido un aplastante 66 % de los votos para la posición central, el porcentaje más alto de todo el equipo de NA.</p>\n\n<p>Aunque Bjergsen y el resto de jugadores de TSM dominaron en Norteamérica, la eliminación del equipo en la fase de grupos del Mundial dejó a toda una región devastada. Bjergsen impresionó a la audiencia con campeones como Syndra y Cassiopeia, pero una deslucida partida con Zilean contra el central de Samsung Galaxy, Crown, le dejaría un mal sabor de boca. Como representante de NA en el All-Star Event 2016, procurará borrar la huella del pasado y demostrar que se merece el título de mejor central occidental.</p>"},"foreignIds":{"drupalId":"157","TRLH1":"200000250","TRLH2":"200000154","TRLT3":"200000234","TRLH3":"200000332"},"socialNetworks":{"twitch":"http://www.twitch.tv/tsm_bjergsen","youtube":"https://www.youtube.com/user/BjergsenLoL","facebook":"https://www.facebook.com/BjergsenLoL","twitter":"https://twitter.com/Bjergsen"},"champions":[],"liveGameTeam":11},{"id":62,"slug":"reginald","name":"Reginald","firstName":"Andy","lastName":"Dinh","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/reginald-fyiq9ysa.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2014-07-28T19:09:17.000Z","updatedAt":"2017-05-02T17:52:04.000Z","bios":{"en_US":"<p>The iconic founder and leader of Team SoloMid, Andy \"Reginald\" Dinh is the owner and manager of the TSM organization. Much of TSM’s success is owed to his strategic planning. As the face of TSM, Reginald built up his BAY LIFE Empire and TSM’s position as one of the most popular League of Legends teams worldwide. Originally best known for his aggressive playstyle during Season 1, he was forced to adapt a more passive approach during Season 2 as. While Season 3 brought more opportunities for Reginald and TSM than ever before, the weight of leading an organization both on and off The Rift was becoming too much for one person to bear. Reginald brought in Bjergsen in 2013 to fill his previous position in mid lane, a move which reinvigorated the TSM squad and led to multiple NA LCS titles.</p>","fr_FR":"<p>\nLe chef et fondateur légendaire de Team SoloMid, Andy « Reginald » Dinh, est le propriétaire et gérant de l'organisation TSM. Le plus gros du succès de TSM est dû à ses planifications stratégiques. Connu pour son style agressif au cours de la saison 1, il a été obligé de s'adapter à une approche plus passive au cours de la saison 2. La saison 3 a apporté plus d'occasions que jamais à Reginald et TSM, mais le poids de l'organisation dans et hors de la Faille est devenu trop lourd pour une seule personne. Reginald a demandé en 2013 à Søren « Bjergsen » Bjerg de prendre sa place sur la voie du milieu, ce qui a donné un coup de fouet à TSM et lui a permis d'empocher plusieurs titres aux LCS NA.\n</p>","es_ES":"<p>\nAndy ''Reginald'' Dinh no es solo el fundador y líder de Team SoloMid, sino también su propietario y director deportivo. De hecho, TSM debe gran parte de su éxito a sus dotes de planificación estratégica. Aunque se hizo famoso por un estilo de juego agresivo en la Primera Temporada, durante la Segunda se vio obligado a adoptar un enfoque más pasivo. La Tercera trajo más oportunidades que nunca a Reginald y TSM, pero el peso de dirigir una organización tanto fuera como dentro de la Grieta empezó a pasarle factura. En 2013 fichó a Søren ''Bjergsen'' Bjerg para ocupar su puesto en la calle central, lo que dio nuevos bríos al equipo y les ha permitido desde entonces ganar varios títulos de la LCS de NA.\n</p>","pl_PL":"<p>\nLegendarny założyciel i przywódca Team SoloMid, Andy „Reginald” Dinh jest właścicielem i kierownikiem TSM. Członkowie tego zespołu zawdzięczają swój sukces jego zdolności myślenia strategicznego. Choć podczas pierwszego sezonu zasłynął z agresywnego stylu gry, zmuszony był przyjąć nieco bardziej bierną postawę podczas drugiego sezonu. Choć trzeci sezon stworzył dla Reginalda i TSM okazje, o jakich w życiu nie śnili, presja związana z dowodzeniem zarówno na The Rift, jak i poza nim, była zbyt duża. W 2013 r. Reginald sprowadził Søren „Bjergsena” Bjerga, by zastąpił go w środkowej alei. Posunięcie to tchnęło w TSM nowe życie i sprawiło, że drużyna zdobyła wiele zwycięstw w NA LCS.\n</p>","de_DE":"<p>\nDer kultige Gründer und Anführer von Team SoloMid, Andy „Reginald“ Dinh, ist der Besitzer und Manager der Organisation TSM. TSM verdanken einen Großteil ihres Erfolgs seiner strategischen Planung. In der ersten Saison war er bekannt für seinen aggressiven Spielstil, in der zweiten Saison war er dann gezwungen, sich einen passiveren Stil anzueignen. In der dritten Saison ergaben sich für Reginald und TSM mehr Möglichkeiten als je zuvor, allerdings wurde die Aufgabe, eine Organisation sowohl in der Kluft als auch außerhalb zu leiten, zu viel für eine Person. 2013 engagierte Reginald Søren „Bjergsen“ Bjerg, der seine Position in der mittleren Lane übernahm. Dies brachte neuen Schwung ins TSM und führte zu mehreren NA LCS-Titeln.\n</p>","es_AR":"<p>El icónico fundador y líder de Team SoloMid, Andy \"Reginald\" Dinh es el dueño y manager de la organización TSM. Gran parte del éxito de TSM se debe a su planificación estratégica. Originalmente conocido por su juego agresivo en la temporada 1, fue forzado a adaptarse a un estilo pasivo en la temporada 2. Mientras que en la temporada 3 las oportunidades para él y TSM fueron más grandes que nunca, y el peso de liderar al equipo dentro y fuera de la Grieta fueron demasiado para una sola persona. Reginald decidió traer a Søren \"Bjergsen\" Bjerg en 2013 para tomar su lugar en el carril central, una movida que revitalizó a TSM y le trajo varios títulos en la NA LCS..</p>"},"foreignIds":{"drupalId":"10","TRLH1":"200000254","TRLH2":"200000158","TRLT3":"200000238"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":153,"slug":"doublelift","name":"Doublelift","firstName":"Yiliang","lastName":"Peng","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/doublelift-67gepk4x.png","hometown":"USA","region":"NA LCS","birthdate":"1993-06-19","createdAt":"2014-08-22T19:17:04.000Z","updatedAt":"2017-07-04T19:23:48.000Z","bios":{"en_US":"<p>Yiliang “Doublelift” Peng has seemingly been around forever. As one of the few remaining veterans of the pre-LCS era, you might think he’d be slowing down by now. But he just had perhaps the best single-split performance of all time this summer, which also earned him his 1,000th kill in his LCS career. Even with Doublelift’s lengthy career, he says he only recently felt he matured as a player.</p> \n\n<p>Unfortunately, his growth as a player didn’t translate well to the international stage. Following such a dominant regular season, TSM’s failure to make it out of the group stage at the World Championship came as a massive disappointment.</p> \n\n<p>After sitting out most of the 2017 NA LCS Spring Split, Doublelift returns to TSM refreshed and ready for summer.\n Now, he'll pursue his ultimate goal: making his mark on the international stage.</p>","fr_FR":"<p>Yiliang \"Doublelift\" Peng semble être là depuis toujours. En tant que l'un des rares vétérans restant de l'ère pré-LCS, on pourrait s'attendre à ce qu'il montre quelques signes de fatigue. Et pourtant, il a peut-être fait sa meilleure performance de tous les temps sur un seul segment cet été, atteignant par la même occasion le 1000e kill de sa carrière LCS. Même avec un curriculum aussi long, Doublelift avoue n'avoir mûri que récemment en tant que joueur.</p>\n\n<p>Malheureusement, cette maturité ne lui a pas été d'une grande aide sur la scène internationale. Après avoir dominé ainsi la saison régulière, l'échec de TSM à dépasser la phase de groupe dans le Championnat du monde a été une énorme déception. Suite à une saison exténuante, Doublelift a annoncé qu'il ne participerait pas au segment de printemps des LCS NA 2017, mais avait l'intention de revenir en été. En reconnaissance de son jeu cette année, les fans ont accordé à Doublelift 35 pour cent des votes ADC. Il peut profiter de l'événement All-Stars 2016 pour faire patienter ses fans en attendant son retour chez TSM et sa participation à un nouveau Mondial.</p>","pl_PL":"Wydaje się, że Yiliang „Doublelift” Peng gra od zawsze. Jest jednym z nielicznych aktywnych weteranów epoki sprzed LCS i nic nie wskazuje na to, by zwalniał. Tego lata zaprezentował prawdopodobnie najlepszy występ na splicie, przy okazji zaliczając tysięczne zabójstwo w swojej karierze w LCS. Mimo długiej kariery, Doublelift mówi, że dopiero niedawno poczuł się dojrzałym zawodnikiem.\n</p>\nNiestety jego rozwój jako zawodnika nie przekłada się w pełni na sukcesy na arenie międzynarodowej. Po znakomitym sezonie zasadniczym porażka TSM, którym nie udało się wyjść z fazy grupowej na Mistrzostwach Świata, była wielkim rozczarowaniem. Kończąc ten ciężki sezon, Doublelift ogłosił, że przeczeka wiosenny split NA LCS 2017, ale zamierza powrócić latem. W ramach uznania dla jego gry w tym roku fani nagrodzili Doublelifta 35 procentami głosów na prowadzącego. Dzięki temu może wykorzystać tegoroczne wydarzenie All-Star, by podsycić emocje fanów przed swoim powrotem do TSM i kolejnym podejściem do Mistrzostw.\n","de_DE":"<p>Yiliang „Doublelift“ Peng gehört schon seit einer gefühlten Ewigkeit zur E-Sport-Szene von LoL. Er ist einer der letzten verbleibenden Veteranen aus der Zeit vor der LCS und man könnte meinen, dass er langsam zur Ruhe kommen würde. Dennoch zeigte er in diesem Sommer seine wahrscheinlich beste Leistung, mit der er auch die 1000. Tötung seiner LCS-Karriere einfahren konnte. Trotz seiner langen Karriere sagt Doublelift, dass er das Gefühl hat, erst jetzt als Spieler zu reifen.</p>\n\n<p>Leider konnte sich seine Reife als Spieler nicht auf der internationalen Bühne niederschlagen. Nach der dominanten Leistung in der regulären Saison war TSMs Versagen in der Gruppenphase der Weltmeisterschaft eine gewaltige Enttäuschung. Nach einer anstrengenden Saison hat Doublelift angekündigt, den Frühjahrs-Split der NA LCS 2017 auszulassen, er hat jedoch vor, im Sommer zurückzukehren. Die Fans haben Doublelift für seine Leistungen in diesem Jahr belohnt und ihm 35 % aller Stimmen gegeben. Beim diesjährigen All-Stars-Event kann er den Fans einen Vorgeschmack auf das geben, was passiert, wenn er zu TSM zurückkehrt und einen erneuten Anlauf auf den Weltmeistertitel startet.</p>","es_ES":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, puede que penséis que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este split de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que ha madurado como jugador hace poco.</p>\n\n<p>Por desgracia, su crecimiento como jugador no se reflejó en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift ha anunciado que se retirará de la escena durante el split de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de ADC. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","pt_BR":"<p>Yiliang “Doublelift” Peng já está por aí faz bastante tempo. Como um dos poucos veteranos que ainda restam da era pré-LCS, muitos esperam que ele esteja começando a ficar para trás. Mas ele talvez tenha tido o melhor desempenho de Etapa de todos os tempos, o que lhe rendeu o milésimo abate em sua carreira na LCS. Mesmo com a longa carreira do atirador, ele afirma que só passou a se considerar um jogador amadurecido recentemente.</p> <p>Infelizmente, seu crescimento como jogador não vingou no palco internacional. Após uma forte temporada regular, o fracasso da TSM em sair da Fase de Grupos do Campeonato Mundial desapontou muito os fãs. Após uma temporada incrível, Doublelift anunciou que não participará da Etapa de Primavera 2017 da LCS NA, apesar de ter planos de voltar para a Etapa de Verão. Como reconhecimento pelo desempenho deste ano, os fãs recompensaram Doublelift com 35% dos votos de Atirador. Ele pode usar o Evento All-Star deste ano para deixar os jogadores com um gostinho do que está por vir quando ele voltar para a TSM e lutar pelo Mundial novamente.</p>","ko_KR":"<p style=”font-family:”나눔고딕”;\">Yiliang “Doublelift” Peng은 북미에서 피지컬이 가장 좋은 원거리 딜러 중 하나로 알려져 있습니다. 이는 그가 자랑스러워하는 동시에 계속 유지하려고 하는 타이틀이죠. Doublelift의 자부심과 연습 스케줄은 북미에서는 전설적입니다. Doublelift가 프로 농구선수였다면 코비 브라이언트가 됐을 겁니다. 공을 놓지 않으려는 선수죠. 아, 아니죠. 마이클 조던이겠네요. 덩크를 하려고 태어난 남자거든요. </p>\n<p style=”font-family:”나눔고딕”;\">과거 플레이오프에서 CLG가 고전했음에도 불구하고 Doublelift는 여전히 낙관적이었습니다. 상황이 좋지 않아 보였을 때조차도요. 그는 \"우리 팀은 불리한 입장에서 플레이하는 법을 압니다. 실제로 많이 뒤쳐져 있기 때문이죠.\"라고 말합니다. \"전에는 그러면 세상이 끝난 것 같았죠. 이제는 그렇지 않아요.\" 그는 나쁜 성적에 연연하지 않는 능력을 넘어서서 사명감과 목적 의식을 가지게 됐습니다. </p>\n","es_AR":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>","cs_CZ":"<p>Yiliang „Doublelift“ Peng je na profesionální scéně snad odjakživa. Patří mezi těch pár zbývajících veteránů z doby před spuštěním LCS, leckdo by tedy mohl čekat, že mu už bude docházet dech. Přesto pro něj bylo toto léto možná nejlepším splitem všech dob, navíc si během něj připsal jubilejní 1000. zářez z LCS. A navzdory své dlouholeté kariéře Doublelift podle svých vlastních slov teprve nedávno získal pocit, že jako hráč dospěl.</p>\n\n<p>Jeho osobní růst se bohužel nepřenesl do úspěchů na mezinárodní scéně. Skutečnost, že po tak úžasné základní sezóně se TSM na mistrovství světa neprobojovali ze skupiny, byla ohromným zklamáním. V souvislosti s tím Doublelift oznámil, že si během jarního splitu severoamerického LCS 2017 dá pohov, na letní část sezóny se však hodlá vrátit. Jako projev uznání za letošní výkony fanoušci udělili Doubleliftovi 35 % hlasů pro ADC. Může tak využít letošní turnaj All-Star jako ukázku, co mohou diváci očekávat, až se do TSM vrátí před dalším mistrovství světa.</p>","el_GR":"<p>Δεν μπορούμε να θυμηθούμε μια περίοδο που ο Yiliang “Doublelift” Peng δεν πρωταγωνιστούσε στη σκηνή. Ως ένας από τους ελάχιστους βετεράνους που έχουν απομείνει από την προ LCS εποχή, το λογικό θα ήταν να κόψει λίγο ταχύτητα. Κι όμως, μόλις το προηγούμενο καλοκαίρι σημείωσε ίσως την καλύτερή του απόδοση όλων των εποχών, ξεπερνώντας τις 1.000 εκτελέσεις στην καριέρα του στο LCS. Παρά τη μακρόχρονη καριέρα του, Doublelift δηλώνει ότι μόλις πρόσφατα ωρίμασε ως παίκτης.</p>\n\n<p>Δυστυχώς, η προσωπική του βελτίωση ως παίκτης δεν τον βοήθησε ιδιαίτερα στη διεθνή του πορεία. Μετά από μια εκπληκτική κανονική σεζόν, οι TSM δεν κατάφεραν να προκριθούν στη φάση ομίλων του Παγκόσμιου Πρωταθλήματος, παρά τις τεράστιες προσδοκίες που είχαν οι υποστηρικτές τους. Μετά από μια εξαντλητική σεζόν, ο Doublelift ανακοίνωσε ότι δεν θα λάβει μέρος στο Spring Split 2017 του LCS Βόρειας Αμερικής, παρόλο που σκοπεύει να επιστρέψει το καλοκαίρι. Σε αναγνώριση των πολύ καλών φετινών εμφανίσεών του, οι φίλοι του παιχνιδιού του έδωσαν το 35% των ψήφων για τη θέση του ADC. Αν έχει την αναμενόμενη πορεία στο φετινό Τουρνουά All-Star, θα δώσει στους οπαδούς του κάτι να περιμένουν, όταν επιστρέψει επιτέλους στους TSM και προσπαθήσει πάλι να προκριθεί στο Παγκόσμιο Πρωτάθλημα.</p>","hu_HU":"Yiliang „Doublelift” Peng igazi veterán játékos. Az LCS előtti korszak egyik utolsó még aktív játékosa, ezért azt is gondolhatnánk, hogy kezd lelassítani. Ehhez képest a karrierje legerősebb nyári szakaszát zárta, és megszerezte az 1000. gyilkosságát az LCS-ben. Habár Doublelift hosszú ideje van a pályán, saját bevallása szerint is csak nemrég vált érett játékossá.\n</p>\nSajnos a játékosként elért fejlődését nem tudta sikeres nemzetközi szereplésre váltani. A kiváló alapszakasz után a TSM a csoportkörből sem jutott tovább a világbajnokságon, amivel óriási csalódást okoztak. Az embert próbáló szezon után Doublelift bejelentette, hogy nem vesz részt az NA LCS 2017-es tavaszi szakaszán, de nyáron vissza szeretne térni. Az egész éves teljesítménye elismeréseképpen a rajongók a lövészekre adott szavazatok 35%-át tették Doubleliftre. Az idei All-Star gálán újabb lehetőséget kaphat arra, hogy letegyen valamit az asztalra, mielőtt visszatér a TSM-be, és ismét megméretteti magát a vb felé vezető úton.\n","it_IT":"La presenza di Yiliang \"Doublelift\" Peng è ormai una consuetudine. Considerando la sua carriera da veterano dell'era pre-LCS, qualcuno potrebbe pensare che stia diventando troppo vecchio. Contrariamente a queste aspettative, ha appena chiuso quella che potrebbe essere stata la sua miglior stagione, nella quale ha anche conquistato la millesima uccisione nella sua carriera in LCS. Nonostante la sua lunga carriera, Doublelift ha dichiarato di essere maturato come giocatore solo di recente.\n</p>\nPurtroppo, la sua crescita non si è accompagnata al successo internazionale. Dopo una stagione regolare da campioni, i TSM non sono riusciti a superare la fase a gironi durante i Mondiali, deludendo molti dei loro fan. Al termine di questa estenuante stagione, Doublelift ha annunciato che non parteciperà allo Spring Split LCS NA 2017, anche se pianifica già un suo ritorno in estate. Come riconoscimento per le sue eccellenti prestazioni di quest'anno, i fan hanno premiato Doublelift con il 35% dei voti nella categoria ADC. Potrà quindi usare l'All-Star di quest'anno per dare ai suoi ammiratori un assaggio di cosa li aspetta al suo ritorno nei TSM, quando punterà nuovamente ai Mondiali.\n","ro_RO":"Yiliang ''Doublelift'' Peng e prezent pe scena profesionistă de o veșnicie. Fiind unul dintre puținii veterani rămași din epoca pre-LCS, poate vă gândiți că ar trebui să o lase mai ușor. Dar s-ar putea spune că în această vară a avut cea mai reușită etapă din toate timpurile – și a obținut și asasinatul cu numărul 1.000 din cariera sa în LCS. Cu toate că participă la meciuri profesioniste de foarte mult timp, Doublelift spune că abia recent simte că s-a maturizat ca jucător.\n</p>\nDin păcate, această creștere personală nu s-a văzut prea bine pe scena internațională. După un sezon în care a dominat, TSM nu a reușit să treacă de faza grupelor la Campionatul Mondial, ceea ce i-a dezamăgit pe mulți. După un an epuizant, Doublelift a anunțat că nu va participa în etapa de primăvară a LCS NA 2017, cu toate că are de gând să se reîntoarcă din vară. Ca o recunoaștere a performanței sale din acest an, fanii l-au recompensat pe Doublelift cu 35 la sută din voturile pentru ADC. Se poate folosi de prezența la All-Star pentru a le arăta fanilor la ce să se aștepte din partea sa când se va întoarce la TSM și va încerca din nou să ajungă la Mondiale.\n","es_MX":"<p>Yiliang \"Doublelift\" Peng parece que ha estado siempre ahí. Como es uno de los pocos veteranos que quedan anteriores a la era de la LCS, tal vez se piense que a estas alturas estará perdiendo fuelle, pero ha sido el protagonista de la que quizás haya sido la mejor actuación de la historia durante este torneo de verano, en el que además consiguió apuntarse el asesinato número 1000 de su trayectoria en la LCS. A pesar de su larga carrera profesional, Doublelift asegura que últimamente ha madurado como jugador.</p>\n\n<p>Por desgracia, su crecimiento como no vio reflejado en el escenario internacional. Tras esa temporada regular dominante, TSM no logró salir de la fase de grupos en el Campeonato Mundial, lo que fue una enorme decepción para todos. Después de una temporada agotadora, Doublelift anunció que se retirará de la escena durante el torneo de primavera de la LCS NA 2017, aunque planea regresar en verano. Como reconocimiento por su desempeño de este año, los fans le han regalado un 35 % de los votos para el rol de tirador. Doublelift podrá aprovechar el All-Star Event de este año para darles un adelanto a los fans de lo que será su regreso a TSM y su nuevo intento por llegar al Mundial.</p>"},"foreignIds":{"drupalId":"32","TRLH1":"200000611","TRLH3":"200000333","TRLH4":"1001310049","TRLH2":"200000530"},"socialNetworks":{"twitch":"twitch.tv/clgdoublelift","facebook":"facebook.com/CLGDoublelift","twitter":"https://twitter.com/CLGDoublelift"},"champions":[],"liveGameTeam":11},{"id":171,"slug":"svenskeren","name":"Svenskeren","firstName":"Dennis","lastName":"Johnsen","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/svenskeren-7a0i4twe.png","hometown":"Denmark","region":"NA LCS","birthdate":null,"createdAt":"2014-08-22T19:17:09.000Z","updatedAt":"2017-07-04T19:16:01.000Z","bios":{"en_US":"<p>Dennis “Svenskeren” Johnsen holds the key to TSM’s early game success. He struggled to find his footing initially after joining the team in the spring of 2015, but since then he has almost singlehandedly ramped up TSM’s early-game aggression. He makes sure opposing teams feel his jungle pressure by playing strong ganking champions like Lee Sin and Rengar.</p>\n\n<p>Svenskeren captured the world’s attention when he styled on opponents as Lee Sin at the 2016 World Championship. While these performances couldn’t carry TSM to much success, the expectations have nevertheless been raised as a result. Sporting his signature pedal-to-the-metal style, he’ll be looking to keep his momentum in full swing as he kicks, punches, and ganks his way through the jungle. He’s always been a playmaker, so expect Svenskeren to strike early and often during the 2017 NA LCS Summer Split.</p>","fr_FR":"Dennis « Svenskeren » Johnsen détient la clé du succès en début de partie de TSM. Au début, il a eu du mal à prendre ses marques après avoir rejoint l'équipe au printemps 2015 mais, depuis, il a fait monter le niveau d'agression de TSM en début de partie presque à lui tout seul. Il fait en sorte que les équipes adverses ressentent sa pression de jungler en jouant des champions très orientés gank comme Lee Sin et Rengar.\n\nLes regards du monde entier se sont fixés sur Svenskeren lorsqu'il a ridiculisé ses adversaires avec son Lee Sin lors du Championnat du monde 2016. Si ces performances n'ont pas réussi à porter TSM jusqu'au succès, les attentes ont malgré tout pris de l'ampleur. En adoptant son style caractéristique « pied au plancher », il gardera la même dynamique avec ses coups de pied et poing, et ses ganks pour se frayer un chemin dans la jungle. Svenskeren a toujours été un meneur de jeu, alors attendez-vous à ce qu'il frappe vite et souvent lors du Mid-Season Invitational 2017 au Brésil.\n","pl_PL":"Dennis „Svenskeren” Johnsen jest kluczem do sukcesu TSM we wczesnej fazie gry. Zaraz po dołączeniu do drużyny wiosną 2015 roku zmagał się z pewnym trudnościami, ale od tamtego czasu niemal w pojedynkę rozwinął agresywny styl gry TSM we wczesnej fazie. Dba o to, by przeciwne drużyny czuły jego presję w dżungli, grając silnymi, gankującymi bohaterami, takimi jak Lee Sin i Rengar.\n\nSvenskeren przykuł uwagę globalnej publiczności, stylowo ogrywając przeciwników jako Lee Sin na Mistrzostwach Świata 2016. Chociaż tymi występami nie zdołał zapewnić TSM wielkich sukcesów, sprawiły one, że oczekiwania wobec drużyny  wzrosły. Grając w swoim charakterystycznym stylu „na maksa”, zamierza utrzymać impet, kopiąc, uderzając i gankując, by wyrąbać sobie drogę w dżungli. Zawsze był rozgrywającym, więc należy się spodziewać, że Svenskeren będzie atakował wcześnie i często podczas meczów TSM na Mid-Season Invitational 2017 w Brazylii.\n","de_DE":"Dennis „Svenskeren“ Johnsen ist der Schlüssel zu TSMs Erfolg im frühen Spiel. Als er der Mannschaft im Frühjahr 2015 beigetreten war, hatte er anfangs Probleme, Fuß zu fassen, aber im Laufe der Zeit hat er TSMs Aggressivität im frühen Spiel nahezu im Alleingang auf Vordermann gebracht. Er spielt aggressive Champions wie Lee Sin und Rengar, mit denen er die gegnerischen Mannschaften aus dem Dschungel heraus unter Druck setzt.\n\nSvenskeren sorgte bei der Weltmeisterschaft 2016 für Aufsehen, als er seinen Gegnern mit Lee Sin den Garaus machte. Obwohl seine Vorstellungen TSM nicht weiterhelfen konnten, haben sie dazu beigetragen, dass die Erwartungen an ihn noch größer wurden. Er wird auch weiterhin seinem Stil treu bleiben und Vollgas geben, um auf seinem Momentum aufzubauen und sich durch den Dschungel zu treten und zu boxen. Er war immer schon ein Spielmacher, daher können wir davon ausgehen, dass er beim Mid-Season Invitational 2017 in Brasilien früh und oft zuschlagen wird.\n\n","es_AR":"<p>Dennis “Svenskeren” Johnsen es la clave del éxito de TSM en el juego temprano. Johnsen se unió al equipo durante la primavera del 2015, y debió luchar mucho para afianzarse en él. Sin embargo, desde ese momento ha potenciado la agresividad de TSM en el juego temprano prácticamente por su propia cuenta. Siempre logra hacer que los rivales sientan la presión de su juego en la jungla eligiendo a campeones letales y fuertes como Rek’Sai, Gragas y Nidalee.</p>\n\n<p>A pesar de que sus estadísticas de temporada regular son sólidas, con un KDA de 4.9 y un 66% de participación en asesinatos, las cifras no reflejan toda su contribución. Se complementa perfectamente con cada uno de los carrileros de TMS y, aunque todos son capaces de ser acarreadores, la presencia de Svenskeren inclina la balanza a favor de cualquier carril en el que desarrolle su juego. Su desempeño decayó una sola vez durante la temporada regular, en la única derrota de TSM contra Phoenix1. Acumuló 12 muertes durante las dos derrotas de TSM en esa serie. En el Campeonato Mundial se enfrentará a otros jungleros agresivos, así que deberá entregar lo mejor de sí para acercar a TSM cada vez más hacia la gloria.</p>","es_ES":"Dennis ''Svenskeren'' Johnsen es clave para el éxito a principio de partida de TSM. Le costó encontrar su lugar cuando se unió al equipo en la primavera de 2015, pero desde entonces ha conseguido mejorar la agresividad de TSM a principio de partida prácticamente por sí solo. Se asegura de que el equipo contrario sienta su presión en la jungla con campeones fuertes para hacer emboscadas, como Lee Sin o Rengar.\n\nSvenskeren llamó la atención de todo el mundo cuando sorprendió a sus oponentes con Lee Sin en el Campeonato Mundial 2016. Aunque sus grandes jugadas no sirvieron para colmar de éxitos a TSM, las expectativas han aumentado desde entonces. Valiéndose de su característico estilo a todo gas, procurará no perder fuelle cuando reparta patadas, puñetazos y emboscadas por toda la jungla. Siempre ha sido un estratega, así que preparaos para ver a Svenskeren atacar temprano y con frecuencia durante las partidas de TSM en el Mid-Season Invitational 2017 de Brasil.\n","pt_BR":"<p>Dennis \"Svenskeren\" Johnsen carrega a chave do sucesso de início de jogo da TSM. A princípio, ele teve muitas dificuldades para se encontrar quando entrou para a equipe na primavera de 2015, mas desde então ele tem praticamente liderado a agressão de início de jogo da TSM. Ele garante que as equipes adversárias sintam sua pressão como caçador da selva jogando com campeões de emboscadas fortes como Lee Sin e Rengar.</p>\n\n<p>Svenskeren chamou a atenção do mundo jogando com estilo contra seus adversários como Lee Sin no Campeonato Mundial 2016. Esses desempenhos não levaram a TSM a ter muito sucesso, mas houve um aumento nas expectativas como resultado. Exibindo sua marca registrada de alta velocidade, ele procurará manter seu ritmo no máximo enquanto chuta, soca e embosca na selva. Ele sempre foi um estrategista, então espere ver Svenskeren atacar cedo e frequentemente nas partidas da TSM no Mid-Season Invitational 2017 no Brasil.\n</p>"},"foreignIds":{"drupalId":"1125","TRLH1":"200000249","TRLH2":"200000153","TRLT3":"200000233","TRLH3":"200000331"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":204,"slug":"mrrallez","name":"MrRalleZ","firstName":"Rasmus","lastName":"Skinneholm","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/mrrallez-658nj2j4.png","hometown":"Denmark","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-05-31T21:12:29.000Z","bios":{"en_US":"<p>\nRasmus \"MrRallez\" Skinneholm bounced around teams before being swept into the ROCCAT lineup in 2015. His deadly Kalista play resulted in a 100% win rate in the 2015 EU LCS Summer Split on the Spear of Vengeance. His bot lane skills played a key role in ROC's resurgence in the EU LCS. \n</p>\n<p>\nThe Danish marksman was picked up by Elements for the 2016 EU LCS Spring Split, sporting another split with a 100% win rate on Kalista. After the Spring Split concluded, Elements’ seed was bought out by FC Schalke 04 and he was kept on board for the 2016 Summer Split. MrRallez now has another chance to prove himself on the Rift once more. \n</p>","fr_FR":"<p>Rasmus « MrRallez » Skinneholm est arrivé chez ROCCAT en 2015, tel une bouée de sauvetage qu'on lance à un marin sur le point de se noyer. Sa Kalista ravageuse a obtenu 100% de victoire au cours du segment d'été des LCS EU 2015. Sans vouloir dénigrer ses équipiers, son talent sur la voie du bas semble avoir joué un rôle essentiel dans la remontée de ROC aux LCS EU. Le tireur danois a été recruté par Elements pour le segment printanier des LCS EU 2016. Il n'est sans doute plus considéré comme une bouée de sauvetage, mais il peut toujours prouver qu'il est capable de sauver une équipe.</p>","es_ES":"<p>Rasmus 'MrRallez' Skinneholm llegó a la alineación de ROCCAT en 2015 como un salvavidas a un marinero que se hunde. Un maestro con Kalista, terminó el Split de verano de la LCS EU 2015 con un 100% de victorias con el Espíritu de la Venganza. El juego de MrRallez en la calle inferior de ROCCAT fue vital en el resurgir del equipo en la LCS EU. Para el Split de primavera de la LCS EU 2016 Elements ha decidido contar con los servicios del danés. Ahora no se trata de reconducir un equipo a la deriva, sino de construir un proyecto que pueda enfrentarse de tú a tú a cualquier rival. ¿Lo conseguirá?</p>","pl_PL":"<p>Rasmus to jeden z najbardziej zauważalnych, profesjonalnych AD Carry. Oprócz wyjątkowych umiejętności, wyróżnia się wzrostem – jest najwyższym zawodnikiem rozgrywek LCS. Fanom również imponuje doświadczenie młodego Duńczyka na scenie esportowej, ponieważ stawał w szranki z najlepszymi już od maja 2012 roku. Jego przypadek to dowód na to, że ciężka praca popłaca. W każdej kolejnej drużynie odnosił coraz większe sukcesy. Zaczął od zwycięstw w mniejszych wydarzeniach, głównie regionalnych, w drugim sezonie. Jednak w kolejnym, w szeregach drużyny Sinners Never Sleep, udało mu się dostać kwalifikacji do europejskich rozgrywek LCS. Niestety właśnie wtedy został wymieniony na innego gracza. Niespodziewana zamiana nie złamała go, tylko skłoniła do podjęcia kolejnej próby dostania się wyżej w innym zespole.  \"MrRalleZ\" osiągnął swój cel dopiero po dołączeniu do SUPA HOT CREW – pokonał MeetYourMakers i zdobył miejsce  w wiosennych rozgrywkach EU LCS 2014. Można śmiało powiedzieć, że to właśnie Rasmus był głównym czynnikiem ciągnącym całą drużynę na wyższe pozycje. Jednak jego godna pozazdroszczenia mechanika nie była w stanie pomóc w walce z zaciętą konkurencją, w efekcie czego SHC kończyło na siódmym miejscu. Największym wyczynem wysokiego Duńczyka był kolejny sezon. W lecie 2014 roku dał z siebie wszystko, co skończyło się trzecią pozycją w kolejce. Miejscem na podium w EU LCS może się pochwalić tylko ścisła elita profesjonalnych zawodników. </p>\n<p>\nNiestety w piątym sezonie cały skład SHC trafił pod skrzydła organizacji MYM i wkrótce potem został zdyskwalifikowany przez zespół Giants. Jednak AD Carry’ego takiej klasy jak \"MrRalleZ\" nie mogło zabraknąć w EU LCS. W połowie letniego sezonu 2015 dostał ofertę od drużyny Roccat, na którą przystał, gdyż najbardziej zależy mu na grze w europejskiej lidze. Zamienił Pawła \"Woolite\" Pruskiego , po czym kolejny raz dał dowód, że jest nieprzeciętnym AD Carrym. Udało mu się nadrobić straty nowej drużyny, dzięki czemu skończył ten okres na piątym miejscu. Po grze Rasmusa widać doświadczenie z 12 drużyn, ponieważ doskonale dał sobie radę każdym z bohaterów na dolnej alei. W 2014 roku zasłynął ze swoich zagrań Lucianem i Kog’Mawem, a roku później siał postrach również Kalistą. W wiosennym sezonie 2016 wziął udział jako jeden z żywiołów w zespole Elements.\n</p>","de_DE":"<p>Schon sehr früh war klar, dieser Junge hat ordentlich was auf dem Kasten. Wenngleich noch recht jung mit seinen 19 Jahren, ist die Liste der Topteams in denen er war, sehr lang. Nur einen dauerhaften Platz fand der zwei Meter Riese bisher noch nicht. Bekannt wurde er vor allem durch sein starkes Erscheinen mit Lucian, den er 2014 in fast jedem zweiten Spiel auswählte. Zudem spielt er sehr gerne aggressiv auf der Lane, sobald man ihm die Möglichkeit dazu gibt. </p>\n<h2><p>Vom Pech verfolgt</p></h2>\n<p>Im Alter von 16 gründete er zusammen mit Erlend \"Nukeduck\" Våtevik Holm, Morten \"Zorozero\" Rosenquist und Bram \"wewillfailer\" de Winter Sinners Never Sleep. Obwohl nie geplant, schlug sich das Team derart gut, dass ein Platz in der LCS gesichert wurde. Glück für das Team, Pech für den Dänen, der für die Teilnahme weiterhin zu jung war und als Ersatzspieler zurücktreten musste. Der Plan, zurück in die erste Mannschaft zu wechseln, sobald er das entsprechende Alter erreichte, stand aber schon von Anfang an. </p>\n<p>MrRalleZ scheint ein echter Pechmagnet zu sein. Noch vor seinen ersten Spielen in Lemondogs, nachdem diese den Kader von Sinner Never Sleep aufkauften, kam es zu Komplikationen bei der Bekanntgabe der Spieler und damit zu Sperrung des LCS Spots. Im darauffolgenden Team Ninjas in Pyjamas sollte er die Erstwahl als Schütze sein. Spontane Änderungen im Kader führten dann aber wiederum dazu, dass er auf der Ersatzbank landete. </p>\n<h2><p>Eine Gefahr für jeden Gegner</p></h2>\n<p>Der Stress und sein Durchhaltevermögen haben sich bezahlt gemacht, trotz weiterer Wechsel durch viele große Teams, blieb er immer als starker Spieler angesehen und verwandelte oftmals seine Mannschaft zu kleinen Favoriten in der LCS. Der Däne teilte seinen Weg mit einer Vielzahl großer Persönlichkeiten, die ihn schon jetzt zu einem äußerst erfahrenen Spieler machen. Egal in welchem Team dieser Name auftaucht, sollte der Gegner die Bot-Lane im Auge behalten. </p>\n"},"foreignIds":{"drupalId":"1367","TRLH3":"200000266","TRLH4":"200000318","TRLH2":"1001250004","FRA1TMNT2":"25419","ESPORTSTMNT02":"200001035"},"socialNetworks":{"twitch":"http://www.twitch.tv/mrrallez","facebook":"https://www.facebook.com/MrRalleZ?_rdr=p","twitter":"https://twitter.com/MrRallez"},"champions":[],"liveGameTeam":11},{"id":238,"slug":"vizicsacsi","name":"Vizicsacsi","firstName":"Tamás","lastName":"Kiss","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/vizicsacsi-bd3w03mh.png","hometown":"Hungary","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:07.000Z","updatedAt":"2017-06-09T11:16:40.000Z","bios":{"en_US":"<p>Tamás “Vizicsacsi” Kiss played a key role in raising the Unicorns of Love out of the EU Challenger scene and into the EU LCS. Utilizing a combination of strong meta picks and completely unexpected outliers (like Yorick), Vizicsacsi pushed UOL to a 2nd place finish in the 2015 EU LCS Spring Split. Vizicsacsi's form dipped in the tail end of 2015 Summer Split, but a mid-season resurgence assured that UOL made it into the LCS Playoffs for the second split in a row.</p>\n\n<p>In 2016, Vizicsacsi was one of the more consistent members on the UOL squad, proving to be a malleable top laner who can play a variety of styles in order to suit his team’s needs. With a team that’s returning three players, Vizicsacsi and company have a chance to build on what was a surprisingly good Summer Split. Look for Vizicsacsi to be increasingly consistent as the Unicorns look to carry their momentum and perhaps make some magic this year.</p>","de_DE":"<p>Tamás „Vizicsacsi“ Kiss spielte eine Schlüsselrolle beim Aufstieg der Unicorns of Love aus der Challenger Series in die EU LCS. Mit einer Mischung aus Champions, die im Metaspiel stark sind, und komplett unerwarteten Außenseitern (wie Yorick), hat Vizicsacsi die UOL beim Frühjahrs-Split der EU LCS 2015 zum 2. Platz geführt. Vizicsacsi hatte gegen Ende des Sommer-Splits 2015 eine schwache Phase, aber als er in der Mitte der Saison wieder zu seiner Form fand, konnte er die UOL zum zweiten Mal hintereinander in die Entscheidungsspiele der LCS führen.</p>\n\n<p>2016 gehörte Vizicsacsi zu den beständigsten Mitgliedern von UOL und bewies, dass er ein anpassungsfähiger Top-Laner ist, der verschiedene Stile spielen kann, um auf die Bedürfnisse seiner Mannschaft zu reagieren. Mit einer Mannschaft, die aus drei Stammspielern besteht, haben Vizicsacsi und seine Kollegen die Chance, auf die überraschend guten Leistungen vom Sommer-Split aufzubauen. Vizicsacsi wird nach und nach konsistenter werden, wenn die Unicorns ihr Momentum beibehalten und damit vielleicht für ein magisches Jahr sorgen.<</p>","fr_FR":"<p>Le toplaner Tamás « Vizicsacsi » Kiss a fait ses premiers pas sur la scène compétitive en 2013. Après quelques petites équipes, il rejoint rapidement Unicorns of Love et participe fortement à son ascension. Alors qu’il joue dans les Challenger series, les spectateurs peuvent déjà constater le goût prononcé du Hongrois pour les champions quelque peu atypiques. Après être parvenu à se qualifier sur le fil aux play-offs, Vizicsacsi dévoile un Yorick convainquant face à H2K. Malheureusement, cette stratégie n’est pas suffisante pour venir à bout de son adverse direct Andrei « Odoamne » Pascu et de sa bande. </p>\n\n<p>Les Unicorns of Love affrontent alors l’autre équipe qui a perdu sa demi-finale : Ninjas in Pyjamas, une escouade de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Le toplaner oppose alors Swain au Maokai de Lucas « Cabochard » Simon-Meslet et parvient à surpasser son adversaire, menant son équipe à la victoire. De retour sur Maokai et Irelia, Vizicsacsi démontre qu’il est tout aussi à l’aise avec des champions plus conventionnels et qualifie son équipe au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, et après avoir déjà subi deux défaites, UoL tente un coup de poker pour se relever : Vizicsacsi sélectionne Poppy, l’un des champions alors quasiment jamais joués en compétition. Le Hongrois surprend tout le monde et mène son équipe à la victoire avec un ratio KDA de 15 ! Suite à cette performance, son équipe est galvanisée et réussit à se qualifier aux LCS.</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Vizicsacsi montre une performance solide face à des équipes internationales et se permet de ressortir une très bonne Poppy en finale face à Cloud9, qui n’est hélas pas suffisante pour l’emporter. Lors des LCS, le joueur continue à montrer qu’il est de ceux avec qui il faut compter malgré la concurrence de joueurs expérimentés à son poste. Toujours capable de surprendre avec des champions comme Nocturne, il maîtrise également des options plus traditionnelles comme Gnar et participe amplement aux bons résultats de son équipe. Après seulement une année de LCS, le toplaner a obtenu une deuxième place en saison printanière et une 4e place en saison estivale. Les yeux sont toujours rivés sur le Hongrois pendant chaque phase de sélection des champions et le public sera ravi si Vizicsacsi invoque de nouveaux champions atypiques.</p>\n","pl_PL":"<p>\"Vizicsacsi\" jako jeden z niewielu graczy, przed zaangażowaniem się w League of Legends, studiował kierunek humanistyczny na uniwersytecie. Oprócz wykształcenia w dziedzinie psychologii jest też jedynym Węgrem na profesjonalnej scenie. W związku z tym fani z ojczyzny Kissa pokładają w nim bardzo duże nadzieje. Drogę do sławy rozpoczął w kwietniu 2013 roku w drużynie Animate eSports, z którą wziął udział w paru pomniejszych turniejach, jak na przykład Gfinity London 2013. Niestety po czterech miesiącach cały skład graczy został wymieniony przez organizację. Przez długi okres Kiss szukał swojego miejsca wśród profesjonalnych zespołów. Dopiero w styczniu 2014 roku dostał się do nowo założonego Unicorns of Love. Z różowymi jednorożcami miłości walczył na scenie Challenger Series przez cały rok 2014, co ostatecznie zostało zwieńczone sukcesem. Ekipa UoL dostała się do EU LCS Spring 2015 Promotion, gdzie pokonali drużynę Milennium wynikiem 3 do 2. Jak na tak niedoświadczonego gracza, wejście do wiosennych rozgrywek EU LCS 2015 było niesamowitym osiągnięciem. </p>\n<p>\nTop-laner Unicorns of Love wiele osiągnął w sezonie piątym. To między innymi drugie miejsce w wiosennych rozgrywkach barażowych i czwarte w letnich, co jak na nowy zespół na scenie jest wielkim sukcesem. W tym okresie głównie grał obrońcami na swojej linii, ponieważ według niego top-laner powinien uzupełniać swoją rolą resztę drużyny. Najlepsze wyniki osiągnął Shenem i Ryzem, jednak spytany jakim bohaterem chciałby grać lub się stać, odpowiedział: „Irelią, ze względu wszechstronność”. </p>\nTeraz Kissa, jak sam powiedział, charakteryzuje dojrzałość i wieczny uśmiech na twarzy. Twierdzi, że innym zawodnikom przyjdzie to z czasem, jednak warto zauważyć jaką przeszedł metamorfozę wraz z wiekiem. W dzieciństwie był nazywany przez rodzinę i znajomych „dziką gruszką”, co nawiązywało do jego ruchliwości i wiecznym rozkojarzeniu. W wywiadzie dla HyperX pochwalił się, że dalej potrafi dotknąć nos językiem. Wspominając czasy swojej młodości, przyznał, że zawsze oddawał swoje sałatki innym, ponieważ tak bardzo nienawidził warzyw. Jeśli \"Vizicsacsi\" miałby mieć jakąś super moc, zdecydowanie byłaby to umiejętność teleportacji. Aczkolwiek sam przyznał, że głównie używałby jej do chodzenia po kanapki. Poza aktywnością przy komputerze uwielbia grać w szachy, lecz przyznaje, że w towarzystwie graczy mało kiedy znajduje partnerów do tej rozrywki.</p>\n","es_ES":"<p>Para mantener el espíritu con el que Unicorns of Love ascendió al Split de primavera de la LCS 2015, el equipo ha confiado en Kiss ‘Vizicsacsi’ Tamás como el estandarte principal que llevará el liderazgo, innovación y experimentación tras la reciente salida de Tristan ‘PowerOfEvil’ Schrage y la más lejana de Mateusz ‘Kikis’ Szkudlarek.</p>\n\n<p>Con el honor de ser el único jugador húngaro que ha llegado al máximo nivel europeo, el top podrá volver a sorprender con campeones inesperados. Su Poppy sorprendió a todo el mundo en el torneo de promoci de primavera con los unicornios, pero para llegar hasta ese punto el jugador ha participado en varios torneos menores con diferentes equipos en un ámbito todavía amateur.</p>\n\n<p>Vizicsacsi fue uno de los grandes beneficiados de la IEM San José en la que adquirió mayor reconocimiento internacional y en aquel torneo también se pudo apreciar su maestría con Gnar, campeón que a día de hoy se ha convertido en un buque insignia del jugador. A lo largo de los playoffs del Split de primavera de la LCS 2015 mostró una gran actuación con Sion, campeón que encaja muy bien con su control de la agresividad.</p>\n\n<p>Pero no se puede mencionar a Vizicsacsi sin acordarse de su campeón más abusado en la escena competitiva y contra el que muchos enemigos han desesperado: Maokai. El húngaro ha conseguido sacar el mayor potencial posible al árbol más querido de la Grieta del Invocador tanto en sus momentos de mayor esplendor como en sus horas bajas como lo demuestra su participación en primavera y verano.</p>\n\n<p>A día de hoy es una incógnita saber cómo el jugador rendirá con los nuevos fichajes, pero su capacidad de adaptación en el estilo de juego del equipo y un amplio número de personajes con los que puede dar un alto nivel no permitirán que los problemas lleguen desde la línea superior. Acostumbrado a múltiples apariciones en la línea inferior con el uso de Teleportar, la clave residirá en la sinergia que Pierre ‘Steelback’ Medjaldi y Zdravets ‘Hylissang’ Galabov adquieran en las primeras semanas.</p>\n\n<p>En el aspecto personal, Vizicsacsi es uno de esos jugadores que van siempre a apoyar al grupo y permitir que haya buenas sensaciones internas debido a su carácter afable, algo muy importante debido a la adquisición de tres nuevos jugadores. Además, se llevará muy bien con su nuevo compañero en la jungla Danil ‘Diamondprox’ Reshetnikov al ser ambos amantes exacerbados del ajedrez. Su carácter abierto y bromista también se muestra en su propio nombre, puesto que su traducción desde el húngaro sería algo así como burro de mar aunque se acerca mucho a hipopótamo.</p>"},"foreignIds":{"drupalId":"1519","TRLH3":"200000111","TRLH4":"200000214"},"socialNetworks":{"twitch":"http://www.twitch.tv/vizicsacsi","azubu":"www.azubu.tv/Vizicsacsi","facebook":"www.facebook.com/vizicsacsi","twitter":"http://twitter.com/UOLVizicsacsi"},"champions":[],"liveGameTeam":34},{"id":242,"slug":"hylissang","name":"Hylissang","firstName":"Zdravets","lastName":"Galabov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hylissang-96q5d05k.png","hometown":"Bulgaria","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:08.000Z","updatedAt":"2017-06-09T11:16:48.000Z","bios":{"en_US":"<p>Zdravets “Hylissang” Galabov originally made a name for himself on the EU Challenger ladder, and he was recruited by the Unicorns of Love in 2014. Hylissang is one of the most aggressive supports in the EU LCS, preferring champions that can initiate fights and lock the enemy team down.</p>\n\n<p>In 2016 Hylissang proved that he can handle just about any problem that’s thrown at him. New laning partner? No problem. Shifting metagame? Bring it on. Much like his longtime teammate, Vizicsacsi, he is willing to do whatever it takes to make sure that his team is successful. Whether it be reaping souls with Thresh, or concussing the opposition on Braum, Hylissang has been there and done that. He’ll be training up another laning partner this split, but that shouldn’t stop him from having another solid year donning the pink and white.</p>","de_DE":"<p>Zdravets „Hylissang“ Galabov machte sich in der Challenger Series der EU einen Namen und wurde 2014 von den Unicorns of Love rekrutiert. Hylissang ist einer der aggressivsten Supporter in der EU LCS und bevorzugt Champions, mit denen er Kämpfe initiieren und die gegnerische Mannschaft an die Wand pinnen kann.\n\n2016 hat Hylissang bereits bewiesen, dass er jedem Problem gewachsen ist. Neuer Partner in der Lane? Kein Problem. Wechselndes Metaspiel? Nur zu. Ähnlich wie sein Langzeit-Teamkollege, Vizicsacsi, ist er bereit, alles für den Erfolg seiner Mannschaft zu geben. Egal, ob er Seelen mit Thresh erntet oder die Erde mit Braum zum Beben bringt, Hylissang beherrscht alles. Diesen Split bildet er zwar einen neuen Partner in der Lane aus, aber das sollte ihn nicht davon abhalten, erneut ein solides Jahr im Trikot der Unicorns abzuliefern.</p>","fr_FR":"<p>Le Bulgare Zdravets « Hylissang » Galabov est une licorne née. C’est en 2014 qu’il est repéré dans le classement Challenger EU par celui qui deviendra son coach, Fabian « Sheepy » Mallant et qu’il rejoint la structure Unicorns of Love. </p>\n\n<p>Très vite, le carry AD Pontus « Vardags » Dahlblom est désigné comme partenaire de Hylissang. Ensemble, ils disputent les Challenger series et parviennent à se qualifier sur le fil aux play-offs. Le support est déjà très agressif et adore engager les hostilités à l’aide de champions comme Leona ou Thresh. Malheureusement, l’adresse du Bulgare n’est pas suffisante face à H2K ; son équipe s’incline en demi-finale.</p>\n\n<p>Unicorns of Love affronte alors l’autre équipe déchue des demi-finales : Ninjas in Pyjamas, une équipe de vétérans très talentueux. La rencontre en trois manches gagnantes est décisive car elle désigne la dernière équipe à pouvoir encore prétendre aux LCS. Hylissang se montre alors très précis, notamment avec la compétence Sombre dessein (A) de Morgana. Il mène son équipe à la victoire, ce qui la qualifie au tournoi de promotion.</p>\n\n<p>Face à Millenium, l’équipe sortante des LCS, il a le luxe de pouvoir sélectionner son Thresh à chaque partie. Alors qu’ils ont le dos au mur après s’être incliné lors des deux premières parties, les joueurs d’UoL regagnent en motivation. Les lanternes du Thresh d’Hylissang permettent à la Poppy lancée comme une furie de se replacer facilement après avoir semé la zizanie dans les rangs adverses. L’équipe emporte sa première manche ! Mais le joueur n’a pas fini de montrer son génie. Lors de la 4e partie, il réussit à attraper le Talon de Adrian « Kerp » Wetekam, alors invisible, grâce à la combinaison de Saut éclair et de la Peine capitale (A) de Thresh ; une véritable « MadLife ». Les Unicorns of Love parviennent finalement à se qualifier aux LCS !</p>\n\n<p>Envoyé aux IEM San Jose par les fans, Hylissang montre un jeu solide face à des supports très expérimentés comme Jang-sik « Lustboy » Ham, ce qui permet à son équipe d’accéder à la finale. Aux LCS, Hylissang est de ceux qui ne jouent que peu de champions mais qui les maîtrisent parfaitement. Il sème la terreur avec Annie et Leona alors que son Thresh ne rencontre pas un grand succès. Au segment estival, le joueur ajoute Alistar à son panel de champions et se montre convaincant. Bien qu’il n’ait pas réussi à se qualifier au mondial, son parcours est déjà remarquable étant donné sa courte carrière.</p>\n","pl_PL":"<p>Geniusz wspierania na bot-lanie odkryty przez Unicorns of Love. \"Hylissang\" pochodzi z Bułgarii, która dała społeczeństwu League of Legends samych świetnych supportów, takich jak Petar \"Unlimited\" Georgiev i Lyubomir \"BloodWater\" Spasov. Przed dołączeniem do jednorożców w styczniu 2014 roku nie grał w żadnej profesjonalnej drużynie, tylko amatorsko w solo que. Zasilił szeregi za namowami Fabiana „Sheepy” Mallanta, założyciela i głównego trenera organizacji. Przed wejściem do składu UOL grał na mid-lanie, przeważnie ulubioną Orianną. Jednak w drużynie brakowało supporta, więc \"Hylissang\" zmienił profil na potrzebny. Zdobywał wprawę wraz z rozwojem zespołu. Najpierw podczas cotygodniowych turniejów, następnie w większych wydarzeniach, gdzie konkurowały inne rozwijające się ekipy. Ostatecznie wraz z resztą jednorożców podjął wyzwanie dostania się do rozgrywek EU LCS. Przez trzy sezony, począwszy od wiosennego w 2014 roku, walczył w Challenger Series. Po turnieju promocyjnym, gdzie starł się z zespołem Millenium, w końcu udało mu się dostać do upragnionych rozgrywek. Wejście do EU LCS to jedno z największych osiągnięć bułgarskiego supporta. Kolejnym, jest niesamowity występ na trzeciej odsłonie 9 sezonu IEM w San Jose, gdzie będąc debiutantem pokonał doświadczony amerykański zespół Team SoloMid.</p>\n<p>\nDla Zdravetsa gry komputerowe nie były nowością, gdy zaczynał się interesować League of Legends. Grał w różne tytuły od 2004 roku wraz ze swoim bratem bliźniakiem. W rodzinnym mieście, Sofii, mieszkał całe życie – dopiero karierze profesjonalnego gracza zawdzięcza podróże po całym świecie. Nietypowy pseudonim w wirtualnym świecie wymyślił opierając się na szacunku do chińskich graczy - według niego ich sprawność w grach jest godna podziwu. Doszedł do wniosku, że kiedy jego nick będzie przypominać azjatyckie przydomki to będzie bardziej poważany. \"Hylissang\" dopiero w 2011 roku skusił się na spróbowanie dzieła Riot Games. Okazał się być bardzo utalentowanym zawodnikiem. Rzadko się zdarza, żeby ktoś bez przeszłości i doświadczenia tak dobrze sobie poradził na scenie esportowej. Na bot-lanie najbardziej wyróżnia się Threshem, Morganą i Annie, chociaż bardzo lubi grać też Leoną.\n</p>","es_ES":"<p>A pesar del éxodo de jugadores en Unicorns of Love, la pieza que otorgaba la cordura necesaria a la locura de juego del equipo se mantiene. Un apoyo de garantías en la línea inferior que lleva con la organización desde su fundación, cuando el actual entrenador y por aquel entonces jungla Fabian ‘Sheepy’ Mallant le motivó a unirse al equipo a pesar de que él tradicionalmente jugaba en la línea central. Zdravets ‘Hylissang’ Galabov tendrá a su Morgana como emblema un año más en vez de Orianna.</p>\n\n<p>Además de vencer en numerosas Go4LoL en el servidor de europa oeste, Hylissang tuvo un papel fundamental en los dos intentos del equipo por ascender a la League Championship Series desde la Challenguer Series. Su Morgana ya empezó a ser considerada como un bloqueo importante por los equipos rivales, y esto se confirmó posteriormente al más alto nivel a causa de su alto ratio de acierto con “ Hechizo Oscuro “ (Q).</p>\n\n<p>El jugador considera a Alistar, Annie y Leona dentro del grupo de sus campeones favoritos, pero su rendimiento con Thresh y Braum también fue excepcional. En muchas ocasiones se ha otorgado el buen hacer de Unicorns of Love a principios de 2015 a una estrategia alocada que confundía a su rival, pero era el propio Hylissang quien desde la línea inferior podía sacar ventaja del principio de la partida de una forma concisa, o incluso con emboscadas en otras partes del mapa.</p>\n\n<p>Pierre ‘Steeelback’ Medjaldi encontrará en su nuevo apoyo a un acompañante de línea diferente al que se tendrá que amoldar. La experiencia internacional que el primero le pueda aportar podrá ser útil para abrir una vía más de investigación en el búlgaro que hasta el momento es demasiado predecible en fase de selección de campeones.</p>\n\n<p>Una curiosidad del jugador es la selección de su nombre. A pesar de que la gran mayoría coge un nombre simbólico con significado, en el caso de Hylissang no tiene ninguna connotación. La razón se esconde en su época en World of Warcraft, en la que necesitó de un nombre que sonara a chino para que así la gente le respetase dentro del juego.</p>"},"foreignIds":{"drupalId":"1527","TRLH3":"200000115","TRLH4":"200000218"},"socialNetworks":{"twitch":"http://www.twitch.tv/Hylissang","azubu":"www.azubu.tv/Hylissang","facebook":"www.facebook.com/Hylissang","twitter":"http://twitter.com/UOLHylissang"},"champions":[],"liveGameTeam":34},{"id":345,"slug":"hauntzer","name":"Hauntzer","firstName":"Kevin","lastName":"Yarnell","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hauntzer-a2s3apbo.png","hometown":"USA","region":"NA LCS","birthdate":null,"createdAt":"2015-01-19T23:39:51.000Z","updatedAt":"2017-07-04T19:15:49.000Z","bios":{"en_US":"<p>Kevin \"Hauntzer\" Yarnell is flexing his muscles in the top lane for TSM. It's safe to say he's emerged from the shadow of Marcus \"Dyrus\" Hill, who he replaced at the end of 2015. While he mostly played it safe in his rookie year, Hauntzer has bloomed into a huge threat to carry from the top lane. In a league filled with star Korean top laners, Hauntzer bested them all on his way to a spot on the NA LCS All-Pro Team.</p>\n\n<p>His skills were on full display in the 2017 NA LCS Spring Finals against Cloud9, where he took on both Impact and Ray and earned Player of the Series honors. After a disappointing showing at the 2017 Mid-Season Invitational, Hauntzer will be out for blood this summer as he prepares for a second trip to Worlds.</p>\n\n","fr_FR":"Kevin « Hauntzer » Yarnell joue des muscles sur la voie du haut pour TSM. On peut dire qu'il est sorti de l'ombre de Marcus « Dyrus » Hill quand il l'a remplacé fin 2015. S'il a surtout joué la sécurité durant son année d'apprentissage, Hauntzer est par la suite devenu une terrible menace sur la voie du haut. Dans un championnat qui compte de nombreux toplaners coréens de talent, Hauntzer a su se hisser au-dessus de la mêlée pour accéder aux LCS NA en équipe pro.\n\nIl s'est montré à son meilleur niveau face à Cloud9 lors de la finale du segment de printemps des LCS NA 2017, au cours de laquelle il a affronté à la fois Impact et Ray et décroché la distinction de meilleur joueur de la ligue. Hauntzer va pouvoir tester son nouveau style de jeu sur la scène internationale lors du Mid-Season Invitational 2017. Sera-t-il à la hauteur du challenge ?\n","pl_PL":"Kevin „Hauntzer” Yarnell napina mięśnie na górnej alei TSM. Śmiało można powiedzieć, że wyszedł z cienia Marcusa „Dyrus” Hilla, którego zastąpił pod koniec 2015 roku. Chociaż w swoim debiutanckim roku grał zachowawczo, Hauntzer przerodził się w groźnego prowadzącego z górnej alei. Grając w lidze wypełnionej gwiazdorskimi górnymi z Korei, Hauntzer pokonał ich wszystkich, by zdobyć miejsce w drużynie All-Pro NA LCS.\n\nSwoje umiejętności zademonstrował w pełni w finale wiosny NA LCS 2017 w meczu przeciwko Cloud9, w którym pokonał Impacta i Raya, zdobywając tytuł najlepszego zawodnika ligi. Teraz podda próbie swój nowy styl gry na międzynarodowej arenie Mid-Season Invitational 2017. Czy sprosta temu wyzwaniu?\n","de_DE":"Kevin „Hauntzer“ Yarnell lässt für TSM auf der oberen Lane seine Muskeln spielen. Man kann mit Fug und Recht behaupten, dass er sich aus dem Schatten von Marcus „Dyrus“ Hill spielen konnte, den er Ende 2015 ersetzte. Während er in seinem ersten Jahr noch nicht viel riskierte, hat sich Hauntzer inzwischen zu einer ernsthaften Bedrohung auf der oberen Lane gemausert. Hauntzer konnte sich gegen die berühmten koreanischen Top-Laner der Liga durchsetzen und wurde sogar in die nordamerikanisch Auswahl des Frühjahrs-Splits gewählt.\n\nBeim Frühjahrs-Finale der NA LCS 2017 gegen Cloud9 stellte er sein Können unter Beweis, als er es sowohl mit Impact als auch mit Ray aufnahm und zum besten Spieler der Begegnung ernannt wurde. Beim Mid-Season Invitational 2017 kann er seinen neuen Spielstil auf der internationalen Bühne testen. Wird er der Herausforderung gewachsen sein?\n","es_AR":"<p>Kevin \"Hauntzer\" Yarnell vino a llenar un enorme vacío al reemplazar a Marcus \"Dyrus\" Hill como carrilero superior de TSM este año. Aún así, Hauntzer demostró ser el heredero perfecto del legado de Dyrus. Su estilo de juego como carril superior es totalmente eficaz, ya que aporta significativamente en las partidas sin que el resto del equipo deba dedicar mucho (o apenas un poco) de tiempo para ayudarlo. Su estilo abnegado de juego le permite a sus compañeros utilizar todos los recursos que necesitan para llevar juntos a TSM a la victoria.</p>\n\n<p>Pero esto no significa que Hauntzer no haya puesto de su parte como acarreador solitario, por el contrario. Lo impresionante es la poca cantidad de recursos que necesita para hacerlo. Su éxito en el carril superior le mereció el puesto nº 1 en el All-Pro Team del torneo de clausura de la LCS NA, y su KDA de 4.2 en la temporada regular fue el mejor de los carrileros superiores de NA. Sin embargo, el Mundial pondrá su estilo de juego aún más a prueba. ¿Podrán los demás equipos impedir que acceda a los pocos recursos que necesita para tener éxito? ¿O continuará absorbiendo la incesante presión de los jungleros mientras colabora en los combates en equipo? Si bien su juego no siempre es llamativo, su papel en el desempeño de TSM será clave en la escena internacional.</p>","es_ES":"Kevin ''Hauntzer'' Yarnell ya está calentando motores para TSM en la calle superior. Se puede afirmar que ha surgido de la sombra de Marcus ''Dyrus'' Hill, a quien sustituyó en 2015. Aunque jugó con cuidado en su primer año, Hauntzer se ha convertido en una gran amenaza capaz de carrilear desde la calle superior. En una liga repleta de estrellas coreanas en la calle superior, Hauntzer superó a todos ellos y consiguió un puesto en el All-Pro Team de la LCS NA.\n\nSus grandes destrezas se pusieron de manifiesto en la final de primavera de la LCS NA 2017 contra Cloud9, en la que machacó a Impact y a Ray, y se ganó el título de jugador de la serie. Ahora podrá poner a prueba su nuevo estilo de juego en el escenario internacional del Mid-Season Invitational 2017. ¿Estará preparado para este nuevo desafío?\n","pt_BR":"<p>Kevin \"Hauntzer\" Yarnell está flexionando seus músculos na rota superior pela TSM. Pode-se dizer que ele emergiu da sombra do Marcus \"Dyrus\" Hill, a quem substituiu no final de 2015. Embora praticamente não tenha se arriscado no seu ano de novato, Hauntzer foi de grande ameaça a carregar na rota superior. Em uma liga cheia de excelentes jogadores de rota superior coreanos, Hauntzer superou a todos caminho a uma vaga na All-Pro Team da LCS NA.</p>\n\n<p>Suas habilidades foram exibidas completamente na Final da Primavera da LCS NA contra a Cloud9, quando ele enfrentou Impact e Ray, e ganhou a honra de Jogador da Série. Agora ele poderá testar seu novo estilo de jogo na fase internacional do Mid-Season Invitational 2017. Será que ele consegue vencer este desafio?\n</p>"},"foreignIds":{"drupalId":"1319","TRLH1":"200000248","TRLH2":"200000152","TRLT3":"200000232","TRLH3":"200000330"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":381,"slug":"samux","name":"Samux","firstName":"Samuel","lastName":"Fernández Fort","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/samux-gdoitzgb.png","hometown":"Spain","region":"EU LCS","birthdate":null,"createdAt":"2015-01-20T00:43:31.000Z","updatedAt":"2017-06-09T11:17:34.000Z","bios":{"en_US":"<p>Samuel \"Samux\" Fernández Fort has been playing professionally since 2012. He has since spent time on numerous teams before finding himself on the Unicorns of Love roster. He started his career as a top laner and eventually made his way to the AD Carry role.</p>\n\n<p>Days before Unicorns of Love were set to lock their roster, starting AD Carry Veritas informed the team that he wished to stay home in Korea due to being homesick (although he quickly joined CJ Entus afterwards) and this set off a search for someone to fill his shoes. The Unicorns turned to Samux as the solution. Samux’s AD Carry abilities are untested at the LCS level and he poses more questions than answers for the Unicorns. He will try to leverage his heaps of experience as he steps on to the LCS stage for the first time since 2013.</p>","de_DE":"<p>Samuel „Samux“ Fernández Fort spielt seit 2012 auf Profi-Niveau. Er war seitdem bei zahlreichen Teams unter Vertrag, bevor er bei den Unicorns of Love gelandet ist. Er hat seine Karriere als Top-Laner begonnen, mittlerweile spielt er die Rolle des AD-Carrys.\n\nNur wenige Tage bevor die Unicorns of Love ihre Aufstellung festmachen wollten, informierte sie ihr AD-Carry Veritas darüber, dass er wegen Heimweh in Korea bleiben wollte (obwohl er kurz darauf CJ Entus beitrat). Deshalb mussten sie jemanden finden, der seine Rolle übernimmt. Die Unicorns haben sich für Samux entschieden. Samux musste seine AD-Carry-Künste noch nie auf LCS-Niveau unter Beweis stellen, weshalb er für die Unicorns mehr Fragen aufwirft als er beantwortet. Er wird versuchen, sich seine große Erfahrung zu Nutze zu machen, wenn er zum ersten Mal seit 2013 wieder auf die LCS-Bühne steigt.\n</p>"},"foreignIds":{"drupalId":"110","TRLH3":"200000114","TRLH4":"200000217"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1158,"slug":"biofrost","name":"Biofrost","firstName":"Vincent","lastName":"Wang","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/biofrost-118nx890.png","hometown":"","region":"NA LCS","birthdate":null,"createdAt":"2016-02-05T23:28:04.000Z","updatedAt":"2017-07-04T19:16:42.000Z","bios":{"en_US":"<p>Vincent “Biofrost” Wang is one of the most impressive young supports the NA LCS has ever seen. After bouncing around the NA Challenger scene, Biofrost jumped all the way up to the starting support for NA LCS powerhouse TSM following the departure of Bora “YellOwStaR” Kim. Biofrost wasted no time making a name for himself on champions such as Karma, Braum and Bard.</p>\n\n<p>His poise and calm demeanor hide a truly fiery passion for excellence on the Rift. As North America’s biggest breakout rookie, Biofrost quickly forged a bond with one of the most demanding AD Carry players in the world -- his lane partner Doublelift. After spending a split apart that saw TSM falter at MSI, the duo is reunited -- and it feels so good.</p>","de_DE":"Vincent „Biofrost“ Wang ist einer der eindrucksvollsten jungen Supporter, die die NA LCS je gesehen hat. Nachdem Biofrost die nordamerikanische Challenger Series unsicher gemacht hatte, schaffte er es als Supporter-Ersatz für Bora „YellOwStaR“ Kim direkt in die Startaufstellung des nordamerikanischen Schwergewichts TSM. Biofrost verschwendete keine Zeit und machte sich mit Champions wie Karma, Braum und Bard einen Namen.\n\nSeine Ruhe und Gelassenheit verbergen sein leidenschaftliches Streben nach Perfektion in der Kluft. Biofrost ist Nordamerikas bester Nachwuchsspieler und konnte schnell eine gute Beziehung zu einem der anspruchsvollsten AD-Carrys der Welt aufbauen – seinem Partner auf der unteren Lane, Doublelift. Nach Doublelifts Abgang Ende 2016 bekam Biofrost mit WildTurtle einen neuen und wesentlich angenehmeren Partner. Nach seinem zweiten Titel in der NA LCS in ebenso vielen Splits nimmt Biofrost zum ersten Mal am Mid-Season Invitational teil.\n","es_AR":"<p>Vincent “Biofrost” Wang es uno de los novatos más sorprendentes que se ha visto en la LCS NA. Después de un tiempo actuando en la escena de retadores de NA, Biofrost se convirtió en el soporte titular de una de las potencias de la LCS NA, TSM, luego de la partida de Bora \"YellOwStaR\" Kim. Biofrost no tardó en hacerse conocido con campeones como Karma, Braum y el Bardo.</p>\n\n<p>La excelente química de Biofrost con Doublelift fue sorprendente desde el primer día y ha mejorado hasta hoy. Su desempeño en el torneo de apertura, en el que encabezó la LCS NA con 8.1 puntos de KDA, le hizo ganar el premio de novato revelación del verano de la LCS NA 2016 y el primer lugar como soporte en el All-Pro Team. Su determinación como novato se pondrá a prueba en el escenario internacional más importante: el Campeonato Mundial. TSM necesitará que efectúe sus jugadas bajo una presión que nunca antes había experimentado. Aunque es el primer viaje de Biofrost al Mundial, conociendo el prometedor arranque que tuvo su carrera, seguramente no será el último.</p>","es_ES":"Vincent ''Biofrost'' Wang es uno de los apoyos jóvenes más impresionantes que jamás haya visto la LCS NA. Tras pasar un tiempo en la escena Aspirante norteamericana, Biofrost pasó a ser nada menos que apoyo titular de TSM, una de las mayores potencias de la LCS NA, cuando Bora \"YellOwStaR\" Kim abandonó el equipo. Biofrost no perdió tiempo y comenzó a hacerse un nombre con campeones como Karma, Braum o Bardo.\n\nSu aplomo y actitud calmada esconden una auténtica e intensa pasión por la excelencia en la Grieta. Como el novato norteamericano más exitoso, Biofrost forjó de inmediato un vínculo con uno de los ADC más exigentes del mundo, su compañero de calle, Doublelift. Tras la retirada de Doublelift al final de 2016, Biofrost tiene ahora un nuevo compañero más sonriente, WildTurtle. Tras ganar dos títulos de la LCS NA en sendos splits, Biofrost ahora viajará por primera vez al Mid-Season Invitational.\n","pt_BR":"<p>Vincent \"Biofrost\" Wang é um dos jovens suportes mais impressionantes que a LCS NA já viu. Após subir e descer no cenário Desafiante da NA, Biofrost saltou direto para ser o suporte titular da poderosa TSM após a saída de Bora \"YellOwStaR\" Kim. Biofrost não perdeu tempo fazendo seu nome com campeões como Karma, Braum e Bardo.</p>\n\n<p>Seu porte e sua atitude calma escondem uma paixão ardente pela excelência no Rift. Como o maior novato da América do Norte, Biofrost rapidamente criou laços com um dos carregadores mais exigentes do mundo: seu parceiro de rota, Doublelift. Depois da saída do Doublelift, no final de 2016, Biofrost ganhou um novo parceiro mais radiante ao ficar ao lado de WildTurtle. Depois de ganhar seu segundo título na LCS NA em duas etapas, Biofrost agora irá pela primeira vez a um Mid-Season Invitational.\n</p>","fr_FR":"Vincent « Biofrost » Wang est l'un des jeunes supports les plus impressionnants à avoir jamais participé aux LCS NA. Après avoir gravité autour de la scène Challenger d'Amérique du Nord, Biofrost est passé directement au poste de support titulaire pour la machine de guerre des LCS NA, TSM, après le départ de Bora « YellOwStarR » Kim. Biofrost n'a pas tardé à se faire un nom avec des champions tels que Karma, Braum et Bard.\n\nSon comportement calme dissimule une véritable passion enflammée pour l'excellence sur la Faille. En tant que plus grand débutant d'Amérique du Nord, Biofrost a rapidement tissé des liens avec l'un des carrys AD les plus exigeants du monde, son partenaire de voie, Doublelift. Après le départ de Doublelift fin 2016, Biofrost s'est vu attribuer un nouveau partenaire plus expansif, WildTurtle. Après avoir gagné son deuxième titre LCS NA, Biofrost s'apprête à participer pour la première fois au Mid-Season Invitational.\n","pl_PL":"Vincent „Biofrost” Wang jest jednym z najbardziej imponujących młodych wspierających, jakich kiedykolwiek widziało NA LCS. Po występach na scenie NA Challenger Biofrost awansował od razu na pozycję głównego wspierającego w potędze NA LCS — TSM — po odejściu Bory „YellOwStaR” Kima. Biofrost nie tracił czasu i zdobywał uznanie, grając takimi bohaterami jak Karma, Braum i Bard.\n\nJego postawa i spokojne usposobienie ukrywają naprawdę gorącą pasję do doskonalenia się na Summoner’s Rift. Jako najbardziej przełomowy debiutant Ameryki Północnej Biofrost szybko stworzył więź z jednym z najbardziej wymagających prowadzących na świecie — jego partnerem z alei, Doubleliftem. Po odejściu Doublelifta pod sam koniec 2016 roku Biofrost znalazł nowego i weselszego partnera w postaci WildTurtle’a. Teraz dzięki zdobyciu drugiego tytułu splitów NA LCS Biofrost wyrusza w pierwszą podróż na Mid-Season Invitational.\n"},"foreignIds":{"TRLH1":"200000252","TRLH2":"200000156","TRLT3":"200000236","TRLH3":"200000334"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1265,"slug":"exileh","name":"Exileh","firstName":"Fabian","lastName":"Schubert","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/exileh-18eo6urt.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:21:16.000Z","updatedAt":"2017-06-09T11:14:22.000Z","bios":{"en_US":"<p>Fabian “Exileh” Schubert is little known around the League of Legends esports scene, but if you look deep enough, you’ll find that he’s been playing at a very high level for a very long time. He started his career in 2013 and bounced between teams for years -- but that never deterred his fighting spirit.</p>\n\n<p>He’s an incredibly driven player and that’s what landed him on the Unicorns of Love in 2016. Exileh proved that he belongs in the LCS and as his first split wore on his performances only improved. He capped his rookie year by taking first place at IEM Oakland, while handing UOL some of his best performances to date (against the Flash Wolves, no less!). Maybe it’s hard work or maybe it’s a little Unicorn magic -- all we know is Exileh is getting better and it’s going to show in 2017.</p>","de_DE":"<p>Fabian „Exileh“ Schubert ist eher unbekannt in der E-Sport-Szene von League of Legends, aber wenn man sich seine Vergangenheit etwas genauer ansieht, findet man heraus, dass er schon sehr lange auf einem sehr hohen Niveau spielt. Er begann seine Karriere 2013 und wechselte immer wieder die Mannschaft – das hat seinem Kampfgeist jedoch nie geschadet.\n\nEr ist ein unglaublich engagierter Spieler und dadurch landete er 2016 auch bei den Unicorns of Love. Exileh hat bewiesen, dass er in die LCS gehört und nach seinem ersten Split haben sich seine Leistungen kontinuierlich verbessert. Sein erstes Jahr hat er mit dem ersten Platz bei der IEM Oakland gekrönt, wo er UOL zu einer ihrer besten Vorstellungen aller Zeiten verhalf (und das gegen niemand Geringeren als die Flash Wolves). Vielleicht ist es harte Arbeit, vielleicht aber auch ein wenig Einhornmagie – was wir sicher wissen ist, dass Exileh immer besser wird, was er 2017 bestimmt zeigen wird.\n</p>","fr_FR":"<p>Fabian « Exileh » Schubert a rejoint les rangs de Unicorns of Love en tant que midlaner. Originaire d’Allemagne, il a commencé sa carrière chez ESC Gaming en 2013. Après un passage chez SK Gaming Prime et NiP, il quitte Mysterious Monkeys en Novembre 2015, passant 7 mois sans équipe. Il est finalement recruté par UOL afin de remplacer Hampus « Fox » Myhre. Peu connu du public européen, il aura donc tout à prouver lors de ce segment d’été sous la bannière de la licorne.</p>","pl_PL":"<p>Ten utalentowany środkowy pierwsze kroki na scenie esportowej stawiał podczas trzeciego sezonu. Na swoją renomę ciężko pracował, będąc członkiem paru półzawodowych, a następnie profesjonalnych organizacji graczy. Każda kolejna oferowała mu coraz większe możliwości i rozpoznawalność. Pierwszą z nich była ESC Gaming, w której gościł tylko w lipcu 2013 roku. Zaledwie 2 miesiące później dołączył do drużyny EYES ON YOU, gdzie osiągnął swoje pierwsze godne odnotowania sukcesy. Wielokrotnie zajmował pierwsze miejsca w mniejszych turniejach, lecz udało mu się również pokazać na większym wydarzeniu esportowym - ESL Pro Series Germany 2013, na którym zajął piąte miejsce. Jednak najważniejsze dla Fabiana okazało się poznanie i współpraca z innymi obiecującymi zawodnikami jak na przykład: \"PowerOfEvil\" i \"Adryh\". W grudniu 2013 roku został członkiem Team Kappa Prime, jednak po miesiącu cały zespół został wykupiony przez organizację SK Gaming i przemianowany na SK Gaming Prime. Wtedy „Exileh” miał pierwszy raz okazję zawalczyć w Challenger Series o wejście do prestiżowej ligi EU LCS. Ta próba nie powiodła się, więc Fabian parę miesięcy później zdecydował się dołączyć do zespołu, który go pokonał w ostatnich meczach kwalifikacyjnych – Ninjas in Pyjamas. To kolejna drużyna, w której ramach spróbował zawalczyć o wejście wyżej. W jej szeregach zajął drugie miejsce w regularnym letnim sezonie EU Challenger Series 2014, lecz niestety został znokautowany w rozgrywkach barażowych 3 do 0 przez Unicorns Of Love. To doprowadziło do rozejścia się dróg NIP i Fabiana w sierpniu 2014 roku. </p>\n<p>„Exileh” zdecydował się zrobić sobie roczną przerwę od konkurowania League of Legends i pojawił się na niej z powrotem dopiero we wrześniu 2015 roku. Ponowne wejście do świata esportu dokonał przez stanie się członkiem niemieckiej drużyny Mysterious Monkeys, z która pozostał przez zaledwie 2 miesiące. Wtedy kolejny raz zniknął ze sceny na pół roku. Dał o sobie znać, dopiero kiedy został ogłoszony jako podstawowy środkowy Unicorns Of Love na letni sezon EU LCS 2016. Organizacja pochwaliła się swoim nowym i utalentowanym nabytkiem, zaznaczając, że zdecydowała się na wybór Fabiana, pomimo możliwości zatrudnienia innego dużo bardziej doświadczonego gracza. Nowy środkowy UOL akurat skończył swoją edukację w szkole i przekonał do siebie drużynę swoją silną wolą i niesamowitymi umiejętnościami.</p>\n<p>Ten młody Niemiec to niebagatelna postać w środowisku zawodników, ponieważ jest nie tylko bardzo dobrze znany w Kręgu Pretendenta, ale również utrzymuje się w pierwszej piątce najlepszych graczy w Europie. Zasłynął ze swojej gry zabójcami, takimi jak Kha’zix, Zed i LeBlanc. Od początku swojej przygody z League of Legends, czyli pierwszego sezonu, czuł pociąg do środkowej linii. Pierwszym bohaterem za 6300 PZ Fabiana była Anivia, a wraz z czasem zdążył też znienawidzić przeciwników używających czaru przywoływacza: Bariery. Później zyskał sławę grając Yasuo, bezpośrednio po jego wypuszczeniu, grając tak agresywnie, że oponenci zaczęli go nazywać „Wasabi”. </p>\n"},"foreignIds":{"TRLH3":"200000113","TRLH4":"200000216"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1267,"slug":"uby","name":"Uby","firstName":"Aleksandar Iliev","lastName":"Galabov","roleSlug":"support","photoUrl":"http://assets.lolesports.com/player/uby-1ykkkcml.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:22:34.000Z","updatedAt":"2017-01-18T21:06:17.000Z","bios":{},"foreignIds":{"TRLH3":"200000128","TRLH4":"200000220"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1268,"slug":"audreylasapa","name":"AudreyLaSapa","firstName":"Audrey","lastName":"Coent","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/audrylasapa-dg9f6c2.png","hometown":"Europe","region":"EU LCS","birthdate":null,"createdAt":"2016-05-18T16:29:15.000Z","updatedAt":"2017-03-20T09:26:59.000Z","bios":{},"foreignIds":{"TRLH3":"200000116","TRLH4":"200000219"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1545,"slug":"xerxe","name":"Xerxe","firstName":"Andrei","lastName":"Dragomir","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xerxe-h2lpnbyj.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:49:02.000Z","updatedAt":"2017-06-09T11:13:54.000Z","bios":{"en_US":"<p>Andrei \"Xerxe\" Dragomir started his professional career just last year, but that didn’t stop him from finding instant success. Playing as Dark Passage’s starting jungler in the Turkish Champions League, he helped the team take home first place in the Summer Split.</p>\n\n<p>The Unicorns of Love took notice of the youngster’s promise and signed him as their new starting jungler at the tail end of 2016. The EU LCS was a big step up in competition for Xerxe, who had only played 36 games professionally. Luckily for the Unicorns, he exceeded all expectations, earning the Rookie of the Split award for the 2017 EU LCS Spring Split.</p>","de_DE":"<p>Andrei „Xerxe“ Dragomir hat seine Profikarriere erst letztes Jahr begonnen, aber das hat ihn nicht davon abgehalten, direkt erfolgreich zu sein. Als Jungler von Dark Passage in der türkischen Champions League hat er sich mit seinem Team den ersten Platz im Sommer-Split gesichert.\n\nDie Unicorns of Love haben das Talent des Youngsters erkannt und ihn Ende 2016 als neuen Jungler unter Vertrag genommen. In der EU LCS wird Xerxe, der bisher nur 36 Profispiele bestritten hat, einer deutlich stärkeren Konkurrenz gegenüberstehen. Er wird schnell lernen müssen, wenn er auf Augenhöhe mit den Spitzenspielern sein will. Mit dem hohen Druck, der auf Xerxe lastet, hoffen die Unicorns auf einen Diamanten.\n</p>"},"foreignIds":{"TRLH3":"200000112","TRLH4":"200000215"},"socialNetworks":{},"champions":[],"liveGameTeam":34},{"id":1672,"slug":"shynon","name":"Shynon","firstName":"Vincente","lastName":"Vu","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shynon-5fazc4n.png","hometown":null,"region":"NA Challenger Series","birthdate":null,"createdAt":"2017-01-11T01:31:22.000Z","updatedAt":"2017-02-09T01:56:32.000Z","bios":{},"foreignIds":{"ESPORTSTMNT02":"200000672"},"socialNetworks":{},"champions":[],"liveGameTeam":11},{"id":1838,"slug":"swifte","name":"Swifte","firstName":"Johnny","lastName":"Ngo","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/swifte-eyi51mpc.png","hometown":null,"region":"NA LCS","birthdate":null,"createdAt":"2017-03-08T19:14:18.000Z","updatedAt":"2017-06-02T19:46:42.000Z","bios":{},"foreignIds":{"TRLH!":"200000317","TRLH2":"200000512"},"socialNetworks":{},"champions":[],"liveGameTeam":11}],"scheduleItems":[{"id":"AVz22jDxQMQFcjhwbQ8k","content":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:match:eb501ab1-3937-4b30-8594-2223be64a617","scheduledTime":"2017-07-05T20:00:00.048+0000","tags":{"blockLabel":"1","blockPrefix":"day","subBlockLabel":"block","stageLabel":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:bracket:e363f3d1-4d30-4197-9214-3f097c3f0ddc","leagueLabel":"urn:rg:lolesports:global:league:league:43","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96"},"match":"eb501ab1-3937-4b30-8594-2223be64a617","tournament":"71014a98-2551-42ae-b958-e8caafa63f96","bracket":"e363f3d1-4d30-4197-9214-3f097c3f0ddc","league":"43"}],"gameIdMappings":[{"id":"8374d414-d679-4e29-aba2-17cc55ab6026","gameHash":"5d5676a5b56fd788"}],"videos":[{"id":7732,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:71014a98-2551-42ae-b958-e8caafa63f96:game:8374d414-d679-4e29-aba2-17cc55ab6026","source":"https://www.youtube.com/embed/XycakvGN78w?wmode=transparent&rel=0","createdAt":"2017-07-06T00:41:26.000Z","updatedAt":"2017-07-06T00:41:26.000Z","game":"8374d414-d679-4e29-aba2-17cc55ab6026"}],"htmlBlocks":[],"match":{"id":"eb501ab1-3937-4b30-8594-2223be64a617","name":"TSM-vs-UOL","position":2,"state":"resolved","groupPosition":0,"matchType":{"identifier":"best_of","options":{"best_of":"1"}},"input":[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"},{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}],"games":{"8374d414-d679-4e29-aba2-17cc55ab6026":{"id":"8374d414-d679-4e29-aba2-17cc55ab6026","name":"G1","generatedName":"TSM|UOL|G1|eb501ab139374b30859","input":[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"},{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}],"standings":{"result":[[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499301538834,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499288621496,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002150086","gameRealm":"TRLH3","platformId":"TRLH3:1002150086","revision":1,"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499301538835,"source":"bestOf","history":[{"result":[[{"roster":"fa2e7148-bc23-4139-b2ad-89b647c6cb08"}],[{"roster":"5f76d56e-eedb-42af-a733-0ef43a9ce6fa"}]],"timestamp":1499288621496,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scores":{}}}