{"teams":[{"id":28,"slug":"roccat","name":"ROCCAT","guid":"be6c93a6-d7aa-11e6-946a-02161d41e503","teamPhotoUrl":"http://euw.lolesports.com/","logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/roccat-bi4f8bs0.png","acronym":"ROC","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":null,"createdAt":"2014-08-22T20:30:50.000Z","updatedAt":"2017-07-27T08:10:56.000Z","bios":{"en_US":"<p>2016 was a rough year for ROCCAT, but they banded together when it counted. After battling their way back to the LCS in the 2016 EU LCS Summer Promotion Tournament, ROCCAT once again found themselves facing relegation after a last place finish in the Summer Split. Yet again, they narrowly escaped moving to the Challenger Series and find themselves back in the EU LCS.</p>\n\n<p>ROCCAT is a different team in 2017, with only mid laner Betsy returning from the 2016 squad. With four new starters, ROCCAT will have to work to find its new identity this season.</p>\n\n<p>Coach: Fabian “Grabzz” Lohmann</p>\n<p>Team Manager: Tomislav \"flyy\" Mihailov</p>","pl_PL":"<p>Niemiecka organizacja jest jedną z mniej doświadczonych formacji na najwyższym poziomie e-sportowej sceny League of Legends. Dywizja powstała w styczniu 2014 roku i przyjęła w swoje szeregi skład drużyny Kiedyś Miałem Team, któremu niespodziewanie udało się awansować do EU LCS po wygranych barażach z faworyzowanym zespołem Ninjas in Pyjamas. </p>\n<p>W podstawowy skład drużyny wchodziło pięciu Polaków. W debiutanckim sezonie, wiośnie 2014 roku, zespół radził sobie zaskakująco dobrze, w dwóch pierwszych kolejkach wygrywając aż pięć z sześciu spotkań i stając się fenomenem rozgrywek. Ostatecznie sezon zasadniczy Team ROCCAT zakończył na wysokiej, czwartej pozycji, a w barażach zameldował się nawet na ostatnim stopniu podium, zgłaszając akces do uczestnictwa w Mistrzostwach Świata. Charakterystycznymi elementami polskiej drużyny były w tym czasie zgranie oraz umiejętność skutecznego zastosowania zaskakujących rozwiązań takich jak wybór niestandardowych bohaterów czy taktyk. </p>\n<p>W lecie 2014 roku formacja miała nieco problemów w sezonie zasadniczym, ale w rozgrywkach barażowych powróciła do wysokiego poziomu i do końca walczyła o wyjazd na Mistrzostwa Świata, ostatecznie kończąc rywalizację na czwartej pozycji – pierwszej, która nie zapewniała awansu. Po tym dość udanym sezonie zdecydowano się na kilka zmian w składzie, które miały pomóc formacji w walce o najwyższe cele. Z drużyny odeszli „Xaxus” i „Celaver”, a ich miejsce zajęli Erlend „Nukeduck” Holm oraz Paweł „Woolite” Pruski, natomiast Overpow przeniósł się z środowej na górną aleję. Formacja w odświeżonym składzie zaprezentowała się katastrofalnie w wiosennym sezonie 2015, bardzo długo walcząc o pozostanie w EU LCS i ostatecznie zapewniając sobie miejsce w elicie dopiero po wygranych barażach. Zmieniona ekipa w żadnym stopniu nie spełniła oczekiwań i nie była w stanie nawiązać walki o czołowe lokaty w europejskich rozgrywkach, wobec czego kolejne roszady w składzie nie były niczym zaskakującym. Z drużyną pożegnał się krytykowany „Overpow”, który nie sprawdził się w nowej roli, a jego miejsce zajął Etienne „Steve” Michels, który początkowo spisywał się niewiele lepiej od swojego poprzednika. Miejsce w zespole zachował ostatecznie bardzo zawodzący na wiosnę „Woolite”. </p>\n<p>Jednakże drużyna nadal nie przekonywała i rywalizowała raczej o uniknięcie relegacji, aniżeli o miejsce w górnej części tabeli. W związku z tym w połowie letniego sezonu 2015 także „Woolite” opuścił zespół. Na jego miejsce przybył występujący w tym czasie w Challenger Series Rasmus „MrRallez” Skinneholm. Nie poprawiło to gry drużyny z dnia na dzień, ale ostatecznie Team ROCCAT awansował do baraży, gdzie jednak szybko odpadł z rywalizacji, przegrywając ćwierćfinałowy pojedynek z Unicorns of Love. Niemniej drużynie udało się dostać do turnieju kwalifikacyjnego na Mistrzostwa Świata, gdzie formacja zdobyła się jeszcze na ostatni zryw i pokazała się z dobrej strony. Do końca walczyła o bilety na najważniejsze zawody sezonu, ostatecznie przegrywając 2¬ 3 z późniejszymi półfinalistami światowego czempionatu – Origen. </p>\n<p>Po sezonie 2015 w zespole doszło do prawdziwego trzęsienia ziemi. Szybko pożegnano się ze „Stevem” i „MrRallezem”, którzy swoimi występami nie przekonali włodarzy ekipy i zostali wypożyczeni do Elements. Niestety organizacji nie udało się zatrzymać także „Jankosa” i „Vandera”, a w związku z tym z zespołu odszedł również „Nukeduck”. Wobec tego w wiosennym sezonie 2016 można było zobaczyć całkowicie odmieniony Team ROCCAT. Kolejny, wiosenny sezon EU LCS 2016 również poszedł nie po myśli organizacji Team ROCCAT. Drużyna skończyła na przedostatniej pozycji z wynikiem 4 do 14, więc była zaledwie o jedno zwycięstwo lepsza od zespołu na ostatnim miejscu. W związku z takim obrotem spraw Team ROCCAT trafił do rozgrywek relegacyjnych. Tam drużyna stanęła na wysokości zadania – zwyciężyła 3 do 1 z zespołem Huma, więc zachowała swoje miejsce w prestiżowej lidze. Po tym okresie Team ROCCAT zdecydowała się na kolejną gruntowną reorganizację drużyny. Dlatego zdecydowała się na zakontraktowanie dwóch Koreańczyków, na podobieństwo innych organizacji. Uzupełnieniem dla debiutantów z Korei została francuska gwiazda - strzelec Pierre \"steeelback\" Medjaldi. Zatem pomimo załamań Team ROCCAT rozpoczęła letni sezon EU LCS 2016 z podniesioną głową, gotowa na wszystkie wyzwania. </p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Menedżer drużyny: Tomislav \"flyy” Mihailov</p>","de_DE":"<p>2016 war ein schweres Jahr für ROCCAT, aber die Mannschaft rückte in den entscheidenden Momenten zusammen. Nachdem sich ROCCAT im Sommer-Aufstiegsturnier 2016 wieder in die LCS gekämpft hatte, mussten sie nach dem letzten Platz im Sommer-Split gleich wieder zurück in die Relegation. Doch sie schafften es erneut, der Challenger Series knapp zu entgehen und in der EU LCS zu bleiben.\n\n2017 ist ROCCAT bis auf den Mid-Laner Betsy eine neue Mannschaft. Mit vier neuen Spielern, zu denen auch ein unerfahrener Supporter und Top-Laner gehören, wird ROCCAT hart arbeiten müssen, um während des Frühjahrs-Splits eine neue Identität zu finden.</p>\n\n<p>Coach: Fabian „Grabzz“ Lohmann</p>\n<p>Mannschaftsleiter: Tomislav \"flyy” Mihailov</p>","es_ES":"<p>ROCCAT accedió a la LCS EU en 2014, cuando compraron el equipo Kiedyś Miałem Team, una escuadra polaca formada en 2012 para competir en el torneo de promoción europeo. ROCCAT tuvo un ascenso meteórico en su primera temporada, llegando a los playoffs de ambos Splits de la LCS, tanto primavera como verano, y era considerado como uno de los mejores equipos de la región. No obstante, una decepcionante actuación en el Split de primavera de 2015 dejó grandes sombras acerca del futuro del equipo. 2016 es un nuevo comienzo para ROCCAT, con una alineación completamente nueva intentará demostrar que puede volver a luchar por todo.</p>\n<p>Coach: Fabian \"Grabzz\" Lohmann</p>\n<p>Jefe de equipo: Tomislav \"flyy” Mihailov</p>","fr_FR":"<p>ROCCAT est arrivée aux LCS EU en 2014 en acquérant la formation de Kiedyś Miałem Team, une équipe polonaise créée en 2012 pour participer au tournoi de promotion EU. Après s'être qualifiée pour les play-offs des LCS EU lors des segments du printemps et d'été dès sa première saison, ROCCAT était considérée comme l'une des meilleures nouvelles équipes d'Europe. Des performances décevantes durant le segment printanier 2015 ont cependant mis son avenir en péril. ROC espère que sa toute nouvelle formation sera le changement qu'il lui fallait pour retrouver sa gloire d'antan.</p>\n<p>Coach : Fabian \"Grabzz\" Lohmann</p>\n<p>Responsable d’équipe: Tomislav \"flyy” Mihailov</p>"},"foreignIds":{"drupalId":"1242"},"players":[223,230,321,1543,1544,1636,1773,1912],"starters":[230,321,1543,1544,1773],"subs":[223,1636,1912]},{"id":335,"slug":"ninjas-in-pyjamas","name":"Ninjas in Pyjamas","guid":"c11ee870-91e2-475c-8c4d-8331bbcc0fef","teamPhotoUrl":null,"logoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-588ue1or.png","acronym":"NIP","homeLeague":"urn:rg:lolesports:global:league:league:3","altLogoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/team/ninjas-in-pyjamas-fmnft9me.png","createdAt":"2017-05-23T21:16:51.000Z","updatedAt":"2017-07-27T08:06:19.000Z","bios":{"en_US":"<p>After nearly four years away, Ninjas in Pyjamas have sneaked back into the EU LCS. After acquiring the spot of Fnatic Academy, the organization that gave players like Bjergsen and Svenskeren their start is looking to take the league by storm with a brand new roster. The players will have to be nimble if they want to build synergy and challenge the giants of Europe. Don't turn your back on the Ninjas. </p>\n\n<p>Coach: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Team Manager: Robin \"Jed\" Jedhammar</p>","pl_PL":"<p>Po niemal czterech latach nieobecności Ninja zakradli się z powrotem do EU LCS. Po zajęciu miejsca Fnatic Academy — organizacji, która wydała z siebie takich zawodników jak Bjergsen i Svenskeren — drużyna od samego początku zamierza podbić ligę szturmem w całkiem nowym składzie. Zawodnicy będą musieli być niezwykle skuteczni, jeśli chcą zgrać się ze sobą i rzucić wyzwanie gigantom Europy. Nie odwracajcie się plecami do Ninja. </p>\n\n<p>Główny trener: Nicholas „NicoThePico” Korsgaard</p>\n<p>Menedżer drużyny: Robin „Jed” Jedhammar</p>\n","fr_FR":"<p>Après presque quatre ans d'absence, les Ninjas in Pyjamas sont de retour dans les LCS EU. Suite à sa victoire contre Fnatic Academy, l'organisation dans laquelle Bjergsen et Svenskeren ont fait leurs débuts espère prendre la ligue d'assaut grâce à une toute nouvelle formation. Les joueurs devront faire preuve d'une grande agilité pour créer une synergie et mettre les géants européens au défi. Ne tournez pas le dos aux Ninjas. </p>\n\n<p>Entraîneur principal : Nicholas « NicoThePico » Korsgaard</p>\n<p>Responsable d'équipe : Robin « Jed » Jedhammar</p>\n","es_ES":"<p>Después de casi cuatro años, Ninjas in Pyjamas ha vuelto a la LCS EU. La organización que fue testigo de los primeros pasos de Bjergsen y Svenskeren llega para arrasar con una nueva plantilla después de quedarse con el puesto de Fnatic Academy. Los jugadores tendrán que ser astutos si quieren compenetrarse y suponer un desafío para los colosos de Europa. No perdáis de vista a los Ninjas. </p>\n\n<p>Entrenador principal: Nicholas \"NicoThePico\" Korsgaard</p>\n<p>Jefe de equipo: Robin \"Jed\" Jedhammar</p>\n","de_DE":"<p>Nach beinahe vier Jahren Abwesenheit haben sich die Ninjas in Pyjamas wieder in die EU LCS geschlichen. Die Organisation, bei der Spieler wie Bjergsen und Svenskeren ihre Profikarrieren gestartet haben, hat sich den Startplatz von Fnatic Academy gesichert und versucht jetzt, die Liga mit einer neuen Aufstellung im Sturm zu erobern. Doch die Spieler müssen sich geschickt anstellen, wenn sie die perfekte Harmonie finden und Europas Schwergewichte herausfordern wollen. Wende den Ninjas ja nicht den Rücken zu. </p>\n\n<p>Cheftrainer: Nicholas „NicoThePico“ Korsgaard</p>\n<p>Mannschaftsleiter: Robin „Jed“ Jedhammar</p>\n"},"foreignIds":{},"players":[197,484,713,750,1115,1684,1721,1913],"starters":[197,484,713,750,1684],"subs":[1115,1721,1913]}],"players":[{"id":197,"slug":"shook","name":"Shook","firstName":"Ilyas","lastName":"Hartsema","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/shook-43143fnj.png","hometown":"Netherlands","region":"EU LCS","birthdate":null,"createdAt":"2014-08-22T19:17:14.000Z","updatedAt":"2017-06-09T11:04:02.000Z","bios":{"en_US":"<p>Ilyas “Shook” Hartsema  made his first LCS appearance in the 2014 EU LCS Spring Split, jumping onto his opponents with every jungle assassin he could find. From Lee Sin to Kha’Zix, and even Evelynn, Shook found true happiness by exploding enemy carries from 100 to 0. His skill and technique in the jungle were proven time and again with impressive displays to both save his allies and slay his foes.</p>\n\n<p>However, with the meta quickly shifting towards tanky champs in the jungle, Shook found himself out of sorts. Claiming 1st place in Europe and participating in the group stages at the 2014 World Championship with Alliance started to look like Shook's peak, and he slowly slid down the mountain in 2015 with Elements and then the Copenhagen Wolves. Now he finds himself back in the LCS with Ninjas in Pyjamas. Here's hoping we see the old Shook, the champion slayer.</p>","de_DE":"<p>Der niederländische Spieler Ilyas Hartsema hört auf den Namen Shook und hat in der Vergangenheit bereits in vielen Teams mitspielen dürfen. Die bekanntesten Besuche hatte er in diesem Fall bei Copenhagen Wolves, Elements oder mousesports. Nachdem er aber alle Teams bereits nach kurzer Zeit wieder verlassen hatte, hofft er jetzt bei Vitality auf eine lange und große Karriere. </p>\n\n<p>Ilyas Hartsema ist ein exzellenter Jungler, der vor allem für seine Spielweise mit Lee Sin bekannt ist. Shook hat 2014 für das Team Alliance gespielt und durfte hier im EU LCS Summer Split und beim EU LCS Spring Split mitwirken. Damals waren gerade Lee Sin und Nidalee auf ihm oft zu sehen. </p>\n\n<p><h2>Die Rolle von Shook </h2></p>\n\n<p>Shook begann seine Karriere in League of Legends als Top-Laner. Nachdem er es aber Leid war, immer wieder von gegnerischen Spielern aus dem Dschungel aufgemischt zu werden, entschloss er sich dazu ein Jungler zu werden. Er selbst beschreibt sich selbst als aggressiver Spieler, der gerne den Kampf beginnt und dafür ein hohes Risiko eingeht. </p>\n\n<p><i>„Ich muss mich manchmal zurückhalten, um nicht zu aggressiv ins Geschehen zu gehen. Manchmal endet es schlimm für mich.“  - Ilyas „Shook“ Hartsema </i></p>\n\n<p>Die aggressive Spielweise spiegelte sich lange Zeit aber nicht nur auf dem Spielfeld wider. Während der dritten Saison bekam er für all seine Accounts einen permanenten Bann, nachdem er lange Zeit eine sehr toxische Einstellung besaß. Erst mit dem Start der Saison im Jahr 2014 durfte Ilyas Hartsema wieder als Shook spielen und war hier als Jungler beim Team Alliance vertreten. Seitdem gibt er alles dafür, zu den besten Dschungel-Spielern aus Europa zu gehören. </p>\n\n<p><i>„Ich glaube ich kann der beste Jungler in Europa werden, sofern ich viel übe. Das Ziel ist die Weltmeisterschaft. Ich werde erst zufrieden sein, wenn ich das erreicht habe.“ - Ilyas „Shook“ Hartsema</i></p>\n\n\n<p><h2>Interessante Fakten </h2></p>\n<p>•\tBeliebte Champions: Lee Sin, Nidalee, Rek´Sai</p>\n<p>•\tNiederländischer Spieler </p>\n<p>•\tBekannt für seine aggressive Spielweise </p>\n","fr_FR":"<p>Ilyas « Shook » Hartsema a fait sa première apparition aux LCS lors du segment printanier des LCS EU 2014, bondissant inlassablement sur ses adversaires pour les assassiner. Que ce soit avec Lee Sin ou Kha'Zix, voire Evelynn, Shook s'est épanoui en supprimant les carrys ennemis. Ses compétences et sa technique dans la jungle ont prouvé à maintes reprises qu'il était aussi bien capable de sauver ses alliés que de tuer ses ennemis.</p>\n<p>Cependant, la meta ayant rapidement évolué en faveur des champions tanky dans la jungle, Shook s'est retrouvé diminué. En 2014, la première place obtenue aux LCS EU et la participation à la phase de groupe du mondial avec Alliance ont été le sommet de la carrière de Shook ; après cela, il a été sur une pente descendante en 2015, avec Elements puis avec Copenhagen Wolves. Team Vitality a toutefois décidé de compter sur lui et a recruté Shook durant l'intersaison 2015. Nouvelle formation, nouvelle organisation et nouveau départ ! Espérons que nous retrouverons l'ancien Shook, celui qui faisait des massacres.</p>","es_ES":"<p>Pocos recuerdan la época en la que Ilyas ‘Shook’ Hartsema decidió prescindir del apodo por el que ahora es conocido para llamarse ‘enVision’. En efecto, después de pasar por organizaciones con las que aspiraba a acceder a la primera edición de la LCS EU, como DragonBorns o mousesports, el holandés decidió modificar su alias con el deseo de iniciar una nueva etapa en su carrera.</p>\n\n<p>Pero, como algunos genios aconsejan, hay que tener cuidado con lo que se desea. El 21 de enero de 2013, cuatro días antes de disputar el clasificatorio para la máxima competición continental, el jungla recibió una sanción que le alejaba de la LCS durante un año. Con su sueño hecho añicos por culpa de su mal comportamiento en las partidas clasificatorias, Shook recuperó su sobrenombre original, quizá para recordarse a sí mismo que tenía que volver al punto de partida para alcanzar su meta.</p>\n\n<p>Lejos de venirse abajo, Shook no tardó en unirse a Pride FC para dominar el circuito amateur europeo junto a Martin ‘Rekkles’ Larsson, cedido por Fnatic debido a la restricción de edad que le impedía codearse con los mejores. La exitosa alineación captó con celeridad la atención de Copenhagen Wolves, que buscaba un hueco en la LCS. La organización danesa, conocida por pulir diamantes en bruto que se unen a proyectos más ambiciosos tras su periodo de formación, fue incapaz de retener a su principal activo cuando Riot Games levantó a Shook su castigo.</p>\n\n<p>Casi diez meses después de ver truncadas sus esperanzas, Alliance le ofreció al prometedor jungla un hueco en el proyecto forjado con la intención de derrocar a Fnatic. El equipo no dio con la tecla adecuada en el split de primavera de 2014, pero encontró la fórmula perfecta en la edición estival. La escuadra no abandonó el liderato durante toda la fase regular gracias en buena parte a las actuaciones de Shook con Lee Sin y Elise, sus dos personajes emblemáticos, que le llevaron a recibir el premio al jugador más valorado de la segunda jornada.</p>","pl_PL":"<p>Shook to dżungler o ogromnych możliwościach, który jednak w ciągu dwóch lat występów na najwyższym poziomie nie do końca potrafił zaprezentować skalę swojego talentu i wydaje się, że nadal ma coś do udowodnienia.</p>\n<p>\nHolenderski gracz zaczynał swoją przygodę z profesjonalną sceną we wrześniu 2012 roku od występów w IWantCookie, które później przekształciło się w Dragonborns, lecz Shook grał w tej drużynie jeszcze zanim zespół wywalczył awans do EU LCS. Później holenderski dżungler dołączył do formacji Pride FC, której potencjał szybko dostrzegły większe organizacje. Ostatecznie formacja została zakontraktowana przez Copenhagen Wolves i całkowicie zdominowała amatorską scenę, a ukoronowaniem dobrych występów był awans do wiosennego splitu EU LCS 2014. Shook jednak miał inne plany i zdecydował się zmienić zespół. Dołączył do Henrika „Froggena” Hansena budującego europejski super-team w Alliance.  Shook był w tym czasie uważany za czołowego leśnika na Starym Kontynencie, wobec czego nie może dziwić, że duński mid-laner do swojego wymarzonego składu wybrał właśnie jego. </p>\n<p>\nOczekiwania co do występów nowej potęgi były jednak ogromne, a zawodnicy mieli problemy by je udźwignąć. Ogromna fala krytyki spadła właśnie na Shooka, który nie prezentował się tak jak tego od niego oczekiwano i miał dość duży wpływ na beznadziejną passę drużyny, która z pierwszych 12 spotkań wygrała tylko cztery pojedynki. Już wieszczono rychły koniec nadziei na dominację w Europie, kiedy Shook i cały zespół przebudzili się i finiszowali na trzeciej pozycji, play-offy kończąc na czwartym miejscu. Już wtedy profesjonalni zawodnicy zachodzili w głowę, dlaczego holenderski dżungler tak znakomicie prezentuje się w grach treningowych, nierzadko niemal samodzielnie ciągnąć drużynę, a tak bardzo zawodzi w meczach o stawkę. Ten problem miał się ciągnąć za Shookiem jeszcze bardzo długo.</p>\n<p>\nPomimo to w letnim splicie 2014 Alliance spisało się już znacznie lepiej – zwyciężyło, przerywając dominację Fnatic, a Shook zrobił duży postęp, jeśli chodzi o występy na scenie. Zachwycał przede wszystkim swoim osławionym Lee Sinem, który do dziś jest jego najmocniejszą postacią. </p>\n<p>\n„Jeśli ktokolwiek miałby równać się z Inseciem, jeśli chodzi o opanowanie Lee Sina, to byłby to Shook” – powiedział nawet polski dżungler Marcin „Jankos” Jankowski.</p>\n<p>\nDrużynie Holendra udało się przerwać dominację Fnatic i wygrać letnią edycję zmagań, a w związku z tym także pojechać na Mistrzostwa Świata. Tam formacja przeżywała kryzys, a Shook ponownie zmagał się ze starymi problemami i do końca swojej kariery w Alliance, które później zmieniło nazwę na Elements, nie potrafił już pokazać pełni swoich możliwości. Wskutek tego zespół w końcu stracił cierpliwość i w letnim splicie zastąpił Holendra Marcelem „Dexterem” Feldkampem. Shook na krótko wylądował jeszcze w Copenhagen Wolves, gdzie zagrał dziesięć ostatnich spotkań splitu i, pozbawiony tak dużej presji, znów błyszczał, ale nie dał rady uratować znajdującej się w fatalnej sytuacji starej/nowej ekipy.\nPo zakończeniu letniej edycji rozgrywek 2015 słuch o holenderskim leśniku zaginął i pierwsze doniesienia wypłynęły dopiero w grudniu 2015 roku, kiedy okazało się, że Shook został dżunglerem w aspirującym do walki o czołowe lokaty Teamie Vitality.\n</p>"},"foreignIds":{"drupalId":"1119","TRLH3":"200000305","TRLH4":"200000405","TRLH2":"1001250065","FRA1TMNT2":"25479"},"socialNetworks":{"twitch":"www.twitch.tv/shooklol","facebook":"www.facebook.com/Shook.LoL","twitter":"https://twitter.com/ShookLoL"},"champions":[],"liveGameTeam":335},{"id":223,"slug":"airwaks","name":"Airwaks","firstName":"Karim","lastName":"Benghalia","roleSlug":"jungle","photoUrl":"http://assets.lolesports.com/player/airwaks-dia4ur4b.png","hometown":"Portugal","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:03.000Z","updatedAt":"2016-07-30T04:45:02.000Z","bios":{"en_US":"<p>\nKarim “Airwaks” Benghalia entered the esports scene in 2013 when he joined Eternity Gaming. After moving between organizations for the rest of the year, Airwaks was acquired by Copenhagen Wolves as their jungler. Airwaks' performances with CW were strong enough to convince ROCCAT to pick him up in the 2015 offseason.\n</p>\n<p>\nThe 2016 EU LCS Spring Split proved troublesome for Airwaks and ROCCAT as teammates came and went all split long. ROCCAT was sent down to the 2016 EU LCS Summer Promotion tournament where Airwaks helped his team secure their place back in the EU LCS. ROCCAT are charging into the 2016 EU LCS Summer Split with a revamped lineup sporting a mix of new talent. Now, Airwaks and his new teammates will soon be tested again on Europe’s biggest stage.\n</p>","pl_PL":"<p>21-letni dżungler to jedyny gracz ze Szwajcarii, który miał okazję występować w EU LCS. W żyłach urodzonego w Genewie zawodnika płynie tunezyjska I portugalska krew.</p>\n<p>\nAirwaks rozpoczął swoją karierę w czerwcu 2013 od występów w Eternity Gaming, gdzie grał m.in. z finalistą MŚ sezonu 1 Jeromem „Kujaa” Negrettim i znanym później z gry w LCS Mimerem „Mimerem” Ahlströmem. Zespół ten odniósł jednak pewne sukcesy dopiero po odejściu z organizacji i utworzeniu drużyny o nazwie Salade Tomate Oignon. Airwaksowi i jego kolegom udało się dostać do turnieju kwalifikacyjnego do wiosennego splitu EU LCS 2014, ale w rywalizacji grupowej jego ekipa finiszowała na piątej pozycji i pożegnała się z nadziejami na awans do elity.</p>\n<p>\nPo tym turnieju Szwajcar odszedł ze STO i postanowił spróbować swoich sił w zespole Heavy Botlane, gdzie występował m.in. z obecnym top-lanerem Teamu Vitality Lucasem „Cabochardem” Simon-Mesletem, ale największym sukcesem drużyny okazała się 1/16 finału rozgrywek Challenger Series.</p>\n<p>\nPo tych przygodach Airwaks przez trzy miesiące pozostawał bez zespołu, ale w końcu, w maju 2014 roku zgłosiło się do niego Copenhagen Wolves, które poszukiwało dżunglera gotowego zastąpić spisującego się poniżej oczekiwań Rama „Brokensharda” Djemala. Airwaks pomyślnie przeszedł testy, w rywalizacji o miejsce w składzie pokonując m.in. Mateusza „Kikisa” Szkudlarka. Dzięki temu zyskał szansę zaprezentowania swoich umiejętności w EU LCS.</p>\n<p>\nSzybko okazał się bardzo charakterystycznym dżunglerem - agresywnym i nastawionym na tworzenie presji w dżungli przeciwnika, przede wszystkim we wczesnej fazie. W letnim splicie 2015 rozegrał 19 spotkań i był dość mocno krytykowany za zbyt ofensywne usposobienie, które nierzadko prowadziło do niepotrzebnych zgonów. Niemniej pozostał w składzie drużyny na wiosenną edycję zmagań w 2015 roku i był jednym z autorów zaskakująco dobrego splitu w wykonaniu Copenhagen Wolves, któremu udało się dostać do play-offów. Airwaks utrzymywał w tym czasie naprawdę niezłą formę i zasłużył na pochwały, jednak niestety w lecie 2015 roku było już znacznie gorzej. Szwajcar bardzo szybko dostosował się do bardzo słabej dyspozycji całej drużyny, również prezentując się poniżej oczekiwań. W efekcie pożegnał się z duńską organizacją jeszcze przed końcem splitu. Agresywny styl gry Airwaksa doskonale oddają statystyki zarówno z wiosennej, jak i letniej edycji rozgrywek – Szwajcar wyróżniał się przede wszystkim dużą ilością zabójstw i asyst, ale także najwyższą wśród dżunglerów częstotliwością zgonów.</p>\n<p> \nJeszcze w tym samym splicie szwajcarski leśnik był testowany w zespole Unicorns of Love, ale ostatecznie angaż w tej formacji otrzymał Berk „Gillius” Demir, a Airwaks został jedynie rezerwowym. W tym samym czasie zawodnik dołączył do formacji Inspire eSports, ale po około miesiącu zespół się rozpadł, a dżungler ponownie pozostał bez drużyny. Przed startem wiosennego splitu EU LCS 2016 pojawiła się jednak oferta z Teamu ROCCAT i Airwaks zyskał kolejną szansę na pokazanie się na najwyższym poziomie.</p>\n<p> \nCo ciekawe, nick szwajcarskiego dżunglera początkowo brzmiał „RwK”, ale zawodnik zmienił go, by odpowiadał wymowie, którą przyjęli jego przyjaciele. Ponadto interesujący jest fakt, że Airwaks rzucił studia informatyczne, by rozpocząć karierę profesjonalnego gracza.</p>\n","fr_FR":"<p>Karim « Airwaks » Benghalia a fait son entrée sur la scène e-sport en rejoignant Eternity Gaming en 2013. Après être passé d'une organisation à une autre pendant le reste de l'année, il a finalement été recruté en tant que jungler par les Copenhagen Wolves. Adepte des champions tanky, il a décroché 5 victoires pour 3 défaites avec Jarvan IV lors du segment printanier des LCS EU 2015. </p>\n<p>Les performances d'Airwaks chez CW ont suffi à convaincre ROCCAT de le recruter lors de l'intersaison 2015. Il sera ainsi le jungler titulaire de ROC lors du segment printanier des LCS EU 2016. </p>","es_ES":"<p>Karim 'Airwaks' Benghalia comenzó su carrera como jugador profesional en el año 2013 cuando se unió a Eternity Gaming. Después de ir cambiando entre una organización y otra, Airwaks acabó jugando como jungla en Copenhagen Wolves. Prefiere campeones tanques, Airwaks terminó el Split de primavera de la LCS EU 2015 con 5 victorias y 3 derrotas con Jarvan IV, uno de sus campeones icónicos</p>\n<p>El papel de Airwaks con Copenhagen Wolves ha sido lo suficientemente bueno como para llamar la atención de ROCCAT y convencerlos de que debe ser su jungla titular para el comienzo del Split de primavera de la LCS EU en 2016.</p>\n","de_DE":"<p>Der Schweizer Karim „Airwaks“ Benghalia ist vor allem durch seine Auftritte im Trikot der Copenhagen Wolves bekannt. Von 2014 bis 2015 spielte der 21-Jährige Jungler bei den Wolves, ehe er das Team inmitten des Summer-Splits aufgrund des schlechten Klimas verließ. </p>\n<i><p> „Es war meine Entscheidung das Team nach 2-3 Wochen zu verlassen, bin jetzt aber selbstbewusst und motiviert jedem zu zeigen, dass ich ein sehr guter Jungler bin. - Karim „Airwaks“ Benghalia</p></i>\n<p>Zuletzt war er als Sub-Jungler für die Unicorns of Love tätig, kam gegen Hor0 und Gilius jedoch nicht zum Zug. </p>\n<h2><p>Mit Tank-Jungler zum Erfolg</p></h2>\n<p>Berüchtigt ist er vor allem für seine Tank-Jungler wie Lee Sin oder auch Jarvan IV. Mit Letzterem überzeugte er bei den Copenhagen Wolves mit einem 5W-3L Rekord im 2015 Spring Split und erreichte so mit seinem ehemaligen Team den sechsten Platz. Zudem überrascht er immer wieder mit taktischem Denken, sodass er sich in einem Spiel gegen H2K von Youngbuck, seinem damaligen Teamkollegen, counterjunglen ließ. </p>\n<p><i> „Ich wusste, er würde in meinen Jungle kommen um mir die Monster wegzunehmen, deshalb sagte ich Youngbuck er solle den kleinen Geist übrig lassen, damit der gegnerische Jungler Erfahrung verliert. Ich habe einfach reagiert.“ - Karim „Airwaks“ Benghalia</p></i>\n<p>Begonnen hatte seine eSports Karriere 2013 bei Eternity Gaming und nach einigen Teamwechseln schaffte er den Sprung in die EU LCS. Für seine eSports Karriere gab er sogar sein IT-Studium auf. </p>\n"},"foreignIds":{"drupalId":"1491","TRLH3":"1001220035","TRLH4":"1001190085","TRLH2":"1001250029","FRA1TMNT2":"25446"},"socialNetworks":{"twitter":"https://twitter.com/airwaks"},"champions":[],"liveGameTeam":28},{"id":230,"slug":"hjarnan","name":"Hjarnan","firstName":"Petter","lastName":"Freyschuss","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/hjarnan-2k93v0ms.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2014-09-09T16:42:05.000Z","updatedAt":"2017-06-09T10:25:05.000Z","bios":{"en_US":"<p>Petter “Hjarnan” Freyschuss is ready to prove he deserves to be a starting ADC in the EU LCS. After Team Vitality was knocked out of the 2016 EU LCS Spring Playoffs, Hjarnan found himself benched for the Summer Split. After Vitality barely avoided the Promotion Tournament, Hjarnan departed.</p>\n\n<p>He lands on a ROCCAT roster that’s a big unknown for 2017. He’ll be paired in the bot lane with Korean support Wadid. They’ll be at a disadvantage against bot lanes who have spent more time together in the EU LCS, but Hjarnan will be motivated to make the most of this new opportunity.</p>","fr_FR":"<p>Petter « Hjarnan » Freyschuss est la deuxième moitié de tous les mèmes sur kaSing. Blagueur impénitent, Hjarnan est mêlé à tout un tas de plaisanteries, même si cela paraît improbable en regard de son professionnalisme et son sérieux lors des interviews. À la différence de la plupart des carrys AD, Hjarnan participe activement aux prises de décision de son équipe pendant les matchs. Il décide souvent des mouvements de l'équipe sur la carte, ce qui en fait l'un des rares carrys AD à donner des ordres aussi activement.</p>\n<p>Hjarnan a souvent joué Jinx tout au long de 2015, bien que bon nombre de ses homologues aient délaissé la Gâchette folle pour des champions plus adaptés à la meta. Tout comme son champion préféré, Hjarnan est un peu survolté, ce qui mène à des actions vraiment agressives. Hjarnan a toutefois su rester humble, et il est le premier à admettre quand il fait des erreurs, afin que tout le monde chez Team Vitality puisse s'améliorer. </p>","pl_PL":"<p>Hjärnan niemal przez całą karierę związany był z apple is sour/Cloud 9 Eclipse/H2k-Gaming. Wcześniej, w drugiej połowie 2013 roku zaliczył jednak przygodę ze szwedzkim Teamem Property, znanym z przyciągania utalentowanych, rodzimych graczy. Jednak na dobre kariera strzelca rozpoczęła się właśnie od dołączenia do C9E w styczniu 2014 roku. Zespół doskonale radził sobie w Challenger Series, ale kilkukrotnie przegrywał w decydującym meczach, nie awansując do EU LCS. W tym czasie Hjärnan był ważnym punktem zespołu. Znacząco przewyższał umiejętnościami innych strzelców z Challenger Series i prezentował się dość solidnie w tych najważniejszych momentach. Ostatecznie na najwyższy szczebel rozgrywkowy udało mu się awansować dzięki zwycięstwu w Expansion Tournamencie przed wiosennym splitem 2015.</p>\n<p>\n„Dobry zawodnik z Challenger Series, zdecydowanie lepszy od wielu graczy z LCS” – powiedział o Hjärnanie w tym czasie Konstantinos „FORG1VEN” Tzortziou.</p>\n<p>\nW ciągu sezonu 2014 Hjärnan aż czterokrotnie zmieniał partnerów z dolnej alei, ale najlepiej spisywał się w duecie z Raymondem „KaSingiem” Tsangiem, który odmienił cały zespół H2k. Formacja spisywała się znakomicie, dwukrotnie notując miejsce na ostatnim stopniu podium w EU LCS. Niestety sam Hjärnan sprawiał wrażenie dość przeciętnego strzelca, któremu jednak zdarzają się przebłyski i to nie on był gwiazdą zespołu, który pojechał na Mistrzostwa Świata sezonu 2015. Pomimo to Hjärnan okazał się trzecim najczęściej zabijającym i trzecim najczęściej asystującym ADC w EU LCS. Zajął też bardzo wysokie, drugie miejsce wśród najskuteczniej farmiących strzelców. Zadał również największe obrażenia procentowe drużyny spośród graczy ze swojej pozycji. Te statystyki idealnie pokazują, że Szwed nie jest może najbardziej spektakularnym zawodnikiem, ale jest to za to niesamowicie efektywny i z pewnością należy do czołówki ADC na Starym Kontynencie. W letnim splicie EU LCS 2015 Hjärnan najczęściej wybierał Sivir (7 razy) i Tristanę (6 razy), tą drugą postacią notując fantastyczne KDA na poziomie 15,75.</p>\n<p>\nOstatecznie po sezonie 2015 Szwed opuścił H2k-Gaming, ale niedługo pozostawał bez drużyny. Bardzo szybko zwrócił się do niego Team Vitality, który, wykupiwszy slot Gambitu, budował potęgę. Nie jest przypadkiem, że budowany wokół KaSinga zespół przygarnął właśnie Szweda. Obydwaj zawodnicy znakomicie dogadywali się w barwach H2k i w wiosennym splicie 2016 będą kontynuować wspólną grę pod nową banderą.</p>\n<p>\nCo ciekawe, pseudonim Hjärnana oznacza po szwedzku „mózg”. \n</p>","de_DE":"<p>Petter „Hjarnan“ Freyschuss will allen beweisen, dass er es verdient hat, als AD-Carry in der EU LCS zu spielen. Nachdem Team Vitality in den Entscheidungsspielen im Frühjahr der EU LCS 2016 ausgeschieden war, musste Hjarnan den Sommer-Split von der Ersatzbank aus mitverfolgen. Nachdem Vitality es mit Mühe und Not geschafft hatte, dem Aufstiegsturnier zu entgehen, verließ Hjarnan die Mannschaft.\n\n2017 spielt er für ROCCAT, dessen Mannschaft eine große Unbekannte ist. Er wird auf der unteren Lane mit dem koreanischen Supporter Wadid zusammenspielen. Sie haben zwar einen Nachteil, wenn sie es auf der unteren Lane mit Duos zu tun bekommen, die schon länger zusammenspielen, aber Hjarnan ist hochmotiviert, seine neue Chance zu nutzen.</p>","es_ES":"<p>Por lo general, la posición de tirador está reservada a jugadores cuya principal virtud es su habilidad mecánica, la cual les permite danzar por el campo de batalla mientras infligen el máximo daño posible. Sin embargo, algunos profesionales suponen la excepción a la norma gracias a su involucración en otros aspectos del juego, como la toma de decisiones.</p>\n\n<p>Uno de ellos es Petter ‘Hjärnan’ Freyschuss. Su apodo, el segundo que ha usado en su carrera tras desprenderse de ‘Infinity’, no es baladí, pues significa ‘el cerebro’. Conocido por su destreza con Sivir, un personaje de utilidad dentro de su rol, el tirador contribuye en gran medida en las labores comunicativas de sus equipos.</p>\n\n<p>Si se atiende a los inicios de Hjärnan como jugador, allá por la Temporada 2012, no sorprende que el jugador se haya prodigado en este ámbito. El sueco optó por especializarse en la posición de tirador porque prefería jugar acompañado, una preferencia que le lleva a desarrollar una buena relación con sus apoyos.</p>\n\n<p>No obstante, su química con Raymond ‘kaSing’ Tsang no llegó hasta la segunda mitad de su carrera. Cloud9 Eclipse, el intento de expansión de la organización americana hacia Europa, captó a Hjärnan tras su paso por un colectivo compuesto por jugadores suecos. Junto a Andrei ‘Odoamne’ Pascu y Fabian ‘Febiven’ Diepstraten, el equipo se quedó a las puertas de la LCS al perder contra SUPA HOT CREW en el Torneo de Promoción del split de verano de 2014.</p>\n\n<p>El núcleo de la plantilla pasó a H2K, la organización en cuyo seno Hjärnan se ha consolidado como jugador. La escuadra perdió otra ocasión de acceder a la LCS, esta vez contra Copenhagen Wolves, pero la expansión de la liga le proporcionó una última oportunidad que no desaprovechó.</p>\n\n<p>A pesar de la clasificación, la salida de Febiven hacia Fnatic supuso un duro revés para H2K, que no se recuperó hasta la incorporación de kaSing. El apoyo conectó de inmediato con Hjärnan, al que ayudó a convertirse en uno de los mejores tiradores de la liga según sus compañeros de posición. No ejercía el papel de superestrella, pues H2K se movía como una máquina bien engrasada en la que todas las piezas funcionaban al unísono, pero su solvencia le hizo ganarse el respeto de la liga.</p>\n\n<p>Sus actuaciones con Sivir y Jinx contribuyeron en gran medida a que H2K se llevara la medalla de bronce en los dos splits de la LCS EU 2015, galardones que le proporcionaron suficientes puntos para acceder al Campeonato Mundial 2015. En su primer año entre los mejores Hjärnan y los suyos consiguieron codearse con la élite, pero no pudieron pasar de la fase de grupos.</p>\n\n<p>Ahora, con un año de experiencia a sus espaldas, Hjärnan se ha unido a Team Vitality junto a la carne de su uña. Consciente de que su relación con kaSing es la clave de su rendimiento, hasta el punto de concederle todo el crédito a su apoyo cuando le preguntaron por su mejora personal, el tirador pretende seguir puliendo su relación con el británico haciendo uso de la madurez que cree haber ganado.</p>","pt_BR":"<p>Hjarnan é um grande piadista, mas você não diria isso vendo seu comportamento diante das câmeras: sempre muito profissional e direto ao ponto. Ao contrário de muitros atiradores, ele tem voz ativa nas decisões da H2K. Geralmente ele dá os sinais para as movimentações do time pelo mapa, em vez de se limitar às funções básicas de atirador.\n</p>\n<p>\nEnquanto a maioria dos atiradores deixou a Jinx de lado em 2015, ele viu na garota uma escolha confortável para suas jogadas agressivas. Hjarnan mantém a humildade, porém, e é o primeiro a admitir seus erros para que não só ele, mas também o time possa melhorar. \n</p>"},"foreignIds":{"drupalId":"1390","TRLH3":"200000082","TRLH4":"200000185"},"socialNetworks":{"facebook":"www.facebook.com/Hjarnan","twitter":"https://twitter.com/HjarnanV","twitch":"www.twitch.tv/h2khjarnan"},"champions":[],"liveGameTeam":28},{"id":321,"slug":"betsy","name":"Betsy","firstName":"Felix","lastName":"Edling","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/betsy-d1mlvo0i.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-01-19T23:39:48.000Z","updatedAt":"2017-06-09T10:28:07.000Z","bios":{"en_US":"<p>Felix “Betsy” Edling finds himself as the only returning member of ROCCAT for 2017. It’s a new paradigm for Betsy, who in the past has always been the newcomer on his teams. He joined Gambit Gaming mid-2015 and moved to ROCCAT in 2016.</p>\n\n<p>After a disappointing season, Betsy finds himself in a leadership position. With new teammates, he’ll need to help the team find its identity while also elevating his own play. The good news is that he’s done it before and flourished -- now it’s time to do it again.</p>","pl_PL":"<p>Betsy urodził w Malezji, ale większość swojego życia spędził w Szwecji. Przez pewien czas studiował ekonomię, ale ostatecznie poświęcił się karierze profesjonalnego gracza. Co ciekawe, zanim został mid-lanerem grał na górnej alei.</p>\n<p>\nPierwsze kroki na profesjonalnej scenie Betsy stawiał jeszcze w 2013 roku, występując w drużynie Poussins.Gaming. Jednak na dobre wszystko zaczęło się w rok później. Felix dołączył do szwedzkiego Teamu Property, który znany jest w regionie z wyszukiwania utalentowanych zawodników. Betsy nie zabawił tam jednak zbyt długo i w maju 2014 roku przeniósł się do organizacji Vikings eSport, z którą odniósł pierwszy duży sukces – wygrał zimowy Dreamhack 2014.</p>\n<p>\nW tym czasie mid-laner dobrze radził sobie w kolejce solowej, gdzie został dostrzeżony przez drużyny występujące w EU LCS. Najpierw dołączył w roli rezerwowego do H2k, a później otrzymał propozycję od Gambitu, który poszukiwał zastępstwa dla niedysponowanego Sebastiana „niQ’a” Robaka. </p>\n<p>\n„Fakt, że Gambit zwrócił się do mnie w pierwszej kolejności był dla mnie ogromnym zaskoczeniem” – mówił później w wywiadach o tej sytuacji sam zainteresowany.</p>\n<p>\nJednak dzięki ofercie Gambitu Betsy otrzymał szansę, by zaprezentować swoje umiejętności w najważniejszych rozgrywkach na Starym Kontynencie i okazję tę wykorzystał. Z nim w składzie Gambit zwyciężył w czterech meczach z rzędu, a sam Felix zebrał pozytywne recenzje i ostatecznie zastąpił niQ’a już na stałe. Występował w Gambicie przez drugą połowę wiosennego splitu i całą letnią edycję rozgrywek w 2015 roku. Mid-laner dał się poznać jako dość agresywny zawodnik, preferujący ofensywny styl gry.</p>\n<p>\nNiemniej po dość dobrym początku Betsy popadł w przeciętność, tak jak i cała drużyna, która w letniej edycji zmagań spisywała się poniżej oczekiwań. Gambit zakończył rywalizację na zupełnie niezadowalającym ósmym miejscu i musiał grać o utrzymanie w barażach. Co prawda ekipa utrzymała się w najwyższej klasie rozgrywkowej, ale organizacja zdecydowała się pożegnać ze wszystkimi graczami i sprzedać swój spot. Wobec tego Betsy pozostał bez zespołu, ale na brak zatrudnienia nie narzekał długo. Zgłosił się do niego budujący nowy skład Team ROCCAT, a Felix dołączył do formacji, pozostając w EU LCS. </p>\n<p>\nPodczas swojej kariery Betsy zasłynął głównie dobrą grą Ahri i Zedem, ale w letnim splicie jego champion pool mocno się powiększył, a najczęściej wybieranym przez niego bohaterem był Azir. Równie często Felix decydował się na mało popularnego w tym czasie Jayce, którym jednak radził sobie nadspodziewanie dobrze.\n</p>","fr_FR":"<p>Felix « Betsy » Edling a réellement entamé sa carrière de joueur professionnel lorsqu'il a rejoint Gambit Gaming au milieu du segment printanier des LCS EU 2015 pour remplacer Sebastian « niQ » Robak sur la voie du milieu. Son impact sur l'équipe a été immédiat. Ils ont remporté sept de leurs dix dernières parties, ce qui leur a permis de participer aux play-offs printaniers des LCS EU 2015.</p> \n<p>Grâce à ses bonnes performances chez GMB, Betsy a été intégré à la nouvelle formation de ROCCAT pour le segment printanier des LCS EU 2016. Bien qu'il conserve toujours un peu de sa synergie avec son précédent partenaire, Edward « Edward » Abgaryan, Betsy devra reprendre de zéro avec ses nouveaux coéquipiers. Ses interactions avec Karim « Airwaks » Benghalia seront particulièrement importantes. Mais rien d'insurmontable pour Betsy. Après tout, il a déjà montré qu'il était capable d'être intégré dans une équipe en plein milieu de saison et d'exceller immédiatement. </p>","es_ES":"<p>Felix 'Betsy' Edling comenzó su carrera profesional a lo grande cuando se unió a Gambit Gaming a mitad del Split de primavera de la LCS EU 2015 como reemplazo en mid al polaco Sebastian 'niQ' Robak. El cambio se hizo notar de inmediato, consiguiendo siete victorias en diez partidos y asegurándose un puesto en los playoffs del Split de primavera de la LCS EU 2015</p>\n<p>Su actuación en Gambit Gaming no pasó desapercibida para el resto de equipos, e hizo que ROCCAT lo incorpore a sus filas de cara al Split de primavera de la LCS 2016. Aunque tenga un conocido en el equipo en Eduard 'Edward' Abgaryan, Betsy comenzará desde cero con el resto de sus compañeros. La conexión que tenga con el jungla Karim 'Airwaks' Benghalia será clave para el devenir del equipo. Pero llegar a un equipo y triunfar no es nada raro para Betsy, ya lo hizo con Gambit Gaming, ¿conseguirá repetirlo con ROCCAT?</p>","de_DE":"<p>Felix „Betsy“ Edling ist der Einzige, der bereits vor 2017 für ROCCAT spielte. Das ist eine ganz neue Situation für Betsy, der in der Vergangenheit immer der Neue in der Mannschaft war. Er ging Mitte 2015 zu Gambit Gaming und wechselte 2016 zu ROCCAT.\n\nNach einer enttäuschenden Saison muss Betsy jetzt eine Führungsposition einnehmen. Er hat vier neue Teammitglieder und muss der Mannschaft helfen, eine Identität zu finden, sowie sich selbst steigern. Die gute Nachricht lautet: Das ist ihm bereits einmal gelungen – und jetzt muss er dieses Kunststück wiederholen.</p>"},"foreignIds":{"drupalId":"3683","TRLH3":"200000081","TRLH4":"200000184"},"socialNetworks":{"twitter":"https://twitter.com/Betsy_LoL"},"champions":[],"liveGameTeam":28},{"id":484,"slug":"promisq","name":"sprattel","firstName":"Hampus","lastName":"Abrahamsson","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/promisq-2wryxfa8.png","hometown":"Sweden","region":"EU LCS","birthdate":null,"createdAt":"2015-05-15T18:29:25.000Z","updatedAt":"2017-06-09T11:01:09.000Z","bios":{"en_US":"<p>\nHampus “sprattel” Abrahamsson (formerly PromisQ) is a relatively new player in the EU esports scene. He joined Elements in 2015 as their starting support, taking the place of Nyph. However, Sprattel's launch into the spotlight of professional esports didn't come without its missteps. He struggled in the 2015 EU LCS Summer Split and was swapped with substitute support Nyph after the fourth week of competition.\n</p>\n<p>\nThe 2016 EU LCS Spring Split didn’t go much better as he struggled to find rhythm with his bot lane partner, MrRallez. In May, Elements’ seed was acquired by FC Schalke 04, and sprattel was kept on as the team’s starting support. Sprattel will try to right the ship on Ninjas in Pyjamas' new roster this summer.\n</p>","fr_FR":"<p>Hampus « PromisQ » Abrahamsson est relativement nouveau sur la scène e-sport européenne. Il a rejoint Elements en 2015 pour y assumer le rôle de support titulaire à la place de Nyph. Les premiers pas de PromisQ sur la scène professionnelle ne se sont cependant pas très bien passés. Il a rencontré des difficultés lors du segment d'été des LCS EU 2015 et a dû se faire remplacer par Nyph dès la quatrième semaine de la compétition.</p>\n<p>PromisQ a de nouveau retrouvé son poste de support titulaire pour le segment printanier des LCS EU 2016, mais il lui reste encore à prouver qu'il a le talent nécessaire pour être un vrai titulaire aux LCS.</p>","es_ES":"<p>Hampus 'PromisQ' Abrahamsson es un jugador relativamente conocido en la escena europea de League of Legends. Se unió a Elements en 2015 como su apoyo titular, tomando el relevo de Nyph en lo que era su debut como profesional. Pero la cosa no resultó como esperaba y fue sustituido después de cuatro semanas de competición por el mismo Nyph, debido a su pobre rendimiento.</p>\n<p>Sin embargo PromisQ ha vuelto para ser el apoyo titular de Elements en el Spring de Primavera de la LCS EU 2016, ya no es un novato, pero tiene que demostrar que tiene lo que hay que tener para ser un jugador a tener en cuenta en la máxima competición europea.</p>","de_DE":"<p>Zuvor war Hampus \"sprattel\" Abrahamsson unter den Namen promisQ bekannt. Er entdeckte League of Legends erst in der dritten Saison für sich und erfuhr von dort an rasante Verbesserungen. Jeher als Support-Spieler kletterte er in die Top 100 und wurde nach einem kurzen Aufenthalt in einem Amateurteam von Elements unter Vertrag genommen. </p>\n<h2><p>Eine schwere Aufgabe</p></h2>\n<p>Als sprattel im Sommer 2015 in das Kader von Elements aufgenommen wurde, war die Überraschung groß. Genauso groß waren damals die Fußstapfen, in die der LCS-Neuling stapfen musste. Sowohl Patrick \"Nyph\" Funke, als auch Mitch \"Krepo\" Voorspoels sind nicht nur in der Community beliebt, sondern haben vielerorts ihr Können unter Beweis gestellt. Wo Krepo resignierte, sollte das neue Gesicht einen Aufschwung bringen, der kaum noch zu schaffen war. Nach gerade einmal acht Spielen war das Erlebnis LCS schon wieder beendet. In den wenigen Spielen war es vor allem Alistar, mit dem er spielerisch überzeugte und dem Team zu seinen zwei einzigen Siegen während seines Aufenthalts verhalf. </p>\n<p>Die negative Statistik soll aber in keinem Fall damit gleichzusetzen sein, dass der Schwede es nicht verdient hätte, in der LCS zu spielen. Die Organisation glaubt fest an den noch unerfahrenen Spieler. Warum denn auch nicht, viele Teams haben in der Vergangenheit bereits unter Beweis gestellt, was aus anfangs so unbekannten Namen werden kann. Mit Nyph, einem der erfahrensten Supportern Europas, als Coach an seiner Seite kann sich der noch ungeschliffene Diamant nun mit neuem Kader unter Beweis stellen. Dieses Mal nicht inmitten eines Splits, sondern vorbereitet und mit hoch motivierten Kollegen.</p>\n","pl_PL":"<p>Hampus jest wielkim odkryciem Elements. Przed dołączeniem do tej organizacji był członkiem tylko jednej drużyny, inFerno eSports, od marca do maja 2015 roku. Wtedy zmienił barwy na tęczowe i został głównym supportem „żywiołów”. O dołączenie do tego zespołu został poproszony przez głównego trenera - Patricka \"Nyph\" Funke’a. W wywiadzie dla Aftonbladet Esport przypomniał sobie, że kiedy dostał od niego zaproszenie do znajomych w grze, aż poczuł motyle w brzuchu. Powiedział, że uznał to za swoją życiową szansę i zgodził się na tą propozycję. </p>\n<p>Niestety projekt okazał się zdecydowanie mniejszym sukcesem niż się spodziewano. W efekcie czego największe zespołowe osiągnięcia \"Sprattel’a\" nie robią wrażenia. Zarówno w wiosennym jak i w letnim sezonie EU LCS 2015 uplasował się dopiero na 7 miejscu z wynikiem 7:11. Biorąc pod uwagę ekskluzywność tych rozgrywek, trzeba to uznać za niemały wyczyn. Jednak bardziej imponujący jest efekt jego gry w solo que. W League of Legends gra od 2013 roku, ciągle supportem. Zajmując tą rolę w 3 sezonie udało mu się zdobyć diamentową rangę, a w kolejnych był już w Kręgu Pretendenta, gdzie zdobył aż 800 punktów LP.</p>\n<p>Z całej drużyny, po niezbyt udanym sezonie piątym, pozostał tylko \"Sprattel\". Podczas wywiadów cechowała go rozmowność, pewnie dlatego, że chciał przekazać swoim fanom jak najwięcej o sobie. Tuż przed pokazaniem się w rozgrywkach EU LCS wyraził swoją radość, z tego że będzie mógł się zmierzyć z najlepszymi graczami w Europie. Wielokrotnie wspominał, że konkurowanie z innymi jest dla niego najważniejsze w League of Legends. To właśnie chęć starcia się ze sławami doprowadziła Hampusa tak wysoko. O dziwo jako support jest dużo bardziej skoncentrowany na wspieraniu swojego AD Carry’ego - dlatego chętnie gra Janną, Nami i Morganą.</p>\n"},"foreignIds":{"drupalId":"4329","TRLH3":"200000259","TRLH4":"200000311","TRLH2":"1001250005","FRA1TMNT2":"25420","ESPORTSTMNT02":"200001029"},"socialNetworks":{"twitter":"https://twitter.com/SPRATTEL_lol"},"champions":[],"liveGameTeam":335},{"id":713,"slug":"heaq","name":"HeaQ","firstName":"Martin","lastName":"Kordmaa","roleSlug":"adcarry","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/heaq-5xfyf5io.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:09.000Z","updatedAt":"2017-07-06T13:56:18.000Z","bios":{"en_US":"<p>Martin \"HeaQ\" Kordmaa  bounced around Challenger-level teams for most of his career before landing the starting AD Carry position with Giants Gaming. The team had recruited their presumed starter, Upset, but he left the team shortly after. Giants’ search for a new carry intensified and they eventually decided that HeaQ was their number one option. After Giants was relegated, HeaQ now finds himself on the new roster for Ninjas in Pyjamas. He is beyond excited to prove that he has what it takes hang tough with the best in the business.</p>","de_DE":"<p>Martin „HeaQ“ Kormaa hat einen Großteil seiner Karriere damit verbracht, zwischen Mannschaften innerhalb der Challenger Series hin- und herzuwechseln, bis er schlussendlich als AD-Carry bei Giants Gaming landete. Das Team hatte ursprünglich Upset für diese Position rekrutiert, der das Team aber nach kurzer Zeit bereits verlassen hat. Sein Spielname schien damals Programm gewesen zu sein. Die Suche nach einem neuen Carry wurde immer intensiver und schließlich haben sie sich für HeaQ entschieden. Der Position des AD-Carrys auf LCS-Niveau gerecht zu werden, ist nie einfach, aber HeaQ möchte unbedingt beweisen, dass er das Zeug dazu hat, mit den Besten der Besten mitzuhalten.</p>","es_ES":"Martin \"HeaQ\" Kordmaa pululó por equipos de nivel Aspirante durante la mayor parte de su carrera hasta llegar a la posición de ADC en Giants Gaming. El equipo había fichado al que parecía que iba a ser su titular, Upset, pero este abandonó el equipo poco después. La búsqueda de un nuevo carry se intensificó y, al final, decidieron que HeaQ era su mejor opción. Tras el descenso de Giants, HeaQ ahora forma parte de la nueva alineación de Ninjas In Pyjamas. El estonio está más que ilusionado por demostrar que tiene lo que hace falta para enfrentarse a los mejores de la escena.","fr_FR":"Après être passé d'une équipe de niveau Challenger à une autre presque toute sa carrière, Martin « HeaQ » Kordmaa a fini par devenir carry AD titulaire chez Giants Gaming. L'équipe avait recruté son titulaire présumé, Upset, mais il les a quittés peu après. Les Giants ont intensifié leur recherche d'un nouveau carry et ils ont fini par décider que HeaQ était leur meilleure option. Suite à la relégation des Giants, HeaQ se retrouve à présent membre de la nouvelle formation des Ninjas In Pyjamas. Et il est surexcité à l'idée de prouver qu'il est à la hauteur de l'élite de la profession.","pl_PL":"Martin „HeaQ” Kordmaa przez większość swojej kariery przeskakiwał między drużynami na poziomie Pretendenta, po czym objął pozycję głównego prowadzącego w Giants Gaming. Drużyna zwerbowała do pierwszego składu Upseta, ale ten wkrótce ją opuścił. Giants zintensyfikowali swoje poszukiwania nowego prowadzącego i w końcu stwierdzili, że najlepszą opcją jest HeaQ. Gdy Giants zostali relegowani, HeaQ znalazł dla siebie miejsce w nowym składzie Ninjas In Pyjamas. Nie posiada się z radości, mogąc udowodnić, że stać go na dotrzymywanie kroku najlepszym w tej dyscyplinie."},"foreignIds":{"drupalId":"4472","TRLH3":"200000098","TRLH4":"200000201"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":750,"slug":"nagne","name":"Nagne","firstName":"Sang-moon","lastName":"Kim","roleSlug":"midlane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/nagne-bnle5yoc.png","hometown":"South Korea","region":"EU LCS","birthdate":null,"createdAt":"2015-06-02T19:55:11.000Z","updatedAt":"2017-06-09T10:59:07.000Z","bios":{"en_US":"<p>Sang-moon \"Nagne\" Kim made his mark when he fought SK telecom's superstar mid laner Sang-hyeok \"Faker\" Lee to a standstill during an intense Best of 5 series at the Season 3 World Championship. Since then, Nagne has oscillated between being a force to be reckoned with and being a non-factor. Ninjas in Pyjamas is hoping he can return to form on their new roster. Because when he is on, Nagne is <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">a terror in the mid lane</a>.</p>","fr_FR":"<p>Sang-moon « Nagne » Kim a laissé sa marque en combattant le célèbre mid laner de SK Telecom, Sang-hyeok « Faker » Lee et en le paralysant au cours d'une intense partie en trois manches gagnantes lors du Mondial de la Saison 3. Depuis, Nagne oscille entre le redoutable et l'insipide. Mais récemment, Nagne s'est montré à son meilleur niveau de façon plus constante. Et quand il est en forme, Nagne est <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">une terreur sur la voie du milieu</a>.</p>","pl_PL":"<p>Sangmoon „Nagne” Kim dał się poznać, kiedy walczył z gwiazdą SK Telecom, środkowym Sang-hyeokiem „Fakerem” Lee w trakcie meczu do trzech zwycięstw w Sezonie 3 Mistrzostw Świata. Od tego czasu Nagne potrafił być zarówno kluczowym zawodnikiem, jak i tym prawie nieliczącym się w meczach. Ostatnio jednak dawał z siebie wszystko. A kiedy tak jest, <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">staje się prawdziwym postrachem środkowej alei</a>.</p>","de_DE":"<p>Jedes Team braucht seine Spielmacher und seine konsistenten Spieler. Ein System aus ausschließlich einem von beiden funktioniert nicht. Sangmoon \"Nagne\" Kim ist letzteres davon, er macht alle möglichen Metawandel zu einem gewissen Grad mit und ist einer der Stützen bei KT Rolster. Selten sieht man ihn seine Lane komplett verlieren, genauso hart gewinnen tut er sie allerdings genauso oft. Durch und durch ist der Mid-Lane-Veteran ein verlässlicher Spieler.</p>","es_ES":"<p>Sang-moon “Nagne” Kim dejó huella en la intensa batalla que libró contra SK Telecom y su estrella Faker en las semifinales del Campeonato Mundial de la Temporada 3. Aunque desde entonces, Nagne no ha conseguido encontrar la regularidad, depende del día puede ser o bien uno de los mejores mids de Corea del Sur o bien puede pasar desapercibido en la partida. Últimamente, no obstante, Nagne ha estado jugando a su mejor nivel al 100% del tiempo. Y cuando está a su mejor nivel, es un<a href=\" https://www.youtube.com/watch?v=Zrgae333efs&feature=youtu.be&t=3h34m10s\">  terror en la calle central.</a></p>","pt_BR":"<p>Sang-moon \"Nagne\" Kim deixou sua marca quando enfrentou a grande estrela da SK Telecom, Sang-hyeok \"Faker\" Lee, em uma melhor de cinco durante o Mundial da Terceira Temporada. Desde então, Nagne oscilou entre um dos melhores meios da Coreia e... nada. No entanto, recentemente Nagne tem (re)demonstrado seu potencial. E quando ele está assim, ele é um <a href=\"https://youtu.be/Zrgae333efs?t=3h34m10s\">terror na rota do meio</a>.</p>"},"foreignIds":{"drupalId":"686","TRLH3":"200000306","TRLH4":"200000406"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1115,"slug":"zhergoth","name":"Zhergoth","firstName":"Benjamin","lastName":"Sánchez","roleSlug":"toplane","photoUrl":"http://assets.lolesports.com/player/zhergoth-e48i3ns.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2016-01-22T18:40:03.000Z","updatedAt":"2017-05-31T21:39:43.000Z","bios":{},"foreignIds":{"FRA1TMNT1":"375397","TRLH2":"1001250089","FRA1TMNT2":"25362","TRLH3":"200000269","TRLH4":"200000321"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1543,"slug":"wadid","name":"Wadid","firstName":"Bae-in","lastName":"Kim","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/wadid-2aggzkk5.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:16:16.000Z","updatedAt":"2017-06-09T10:32:18.000Z","bios":{"en_US":"<p>Bae-in “Wadid” Kim is the second rookie on ROCCAT’s new lineup. After tryouts with the team, Wadid impressed ROCCAT’s Hjarnan so much he insisted the Korean join him in the bot lane. Meanwhile, coaches touted his enthusiasm and communication skills. If Wadid can build synergy with his new ADC, he could help ROCCAT take the EU LCS by surprise in 2017.</p>","de_DE":"<p>Bae-in „Wadid“ Kim ist der zweite Neuling in ROCCATs Aufstellung. Er konnte ROCCATs Hjarnan in Probespielen mit der Mannschaft derart beeindrucken, dass dieser darauf bestand, mit dem Koreaner auf der unteren Lane zu spielen. Außerdem lobten die Coaches seinen Eifer und seine Kommunikationsfähigkeit. Schafft es Wadid, gut mit seinem neuen AD-Carry zu harmonieren, könnte ROCCAT in der EU LCS 2017 für eine Überraschung sorgen.</p>"},"foreignIds":{"TRLH3":"200000083","TRLH4":"200000186"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1544,"slug":"phaxi","name":"Phaxi","firstName":"Hren","lastName":"Ambroz","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/phaxi-2u02e7k9.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-06T21:19:45.000Z","updatedAt":"2017-06-09T10:53:43.000Z","bios":{"en_US":"<p>Hren “Phaxi” Ambroz is about as fresh as they come in the EU LCS. ROCCAT’s rookie top laner’s only professional experience came late in 2016 when he subbed for Turkey’s Dark Passage in the IEM Oakland Qualifier. In his rookie split, he’ll undergo a trial by fire against Europe’s top talents. If he can hold his own, he’ll have a promising future with ROCCAT’s new lineup.</p>","de_DE":"<p>Hren „Phaxi“ Ambroz ist ein absoluter Neuling in der EU LCS. ROCCATs unerfahrener Top-Laner hatte 2016 seinen ersten professionellen Auftritt, als er Dark Passage bei der Qualifikationsrunde für das IEM Oakland aushalf. In seinem ersten Split bekommt er es gleich mit den besten Top-Lanern Europas zu tun. Sollte er sich jedoch beweisen können, erwartet ihn eine vielversprechende Zukunft bei ROCCAT.</p>"},"foreignIds":{"TRLH3":"200000079","TRLH4":"200000182"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1636,"slug":"xoynuzi","name":"XoYnUzi","firstName":"En Qiang","lastName":"Zhou","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/xoynuzi-gh7u9hqm.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-09T20:19:25.000Z","updatedAt":"2017-01-19T01:46:45.000Z","bios":{},"foreignIds":{"TRLH3":"200000085","TRLH4":"200000188"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1684,"slug":"profit","name":"Profit","firstName":"Junhyung","lastName":"Kim","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/profit-2siu86dd.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-01-12T18:21:45.000Z","updatedAt":"2017-07-06T13:44:20.000Z","bios":{"en_US":"<p>Junhyung \"Profit\" Kim joins the EU LCS after spending a year playing for the best team in the world: SK telecom T1. After splitting time with Huni in the top lane, Profit heads to Europe looking to use what he's learned to dominate the competition.</p>","de_DE":"Junhyung „Profit“ Kim nimmt an der EU LCS teil, nachdem er ein Jahr lang für die beste Mannschaft der Welt gespielt hat: SK Telecom T1. Nachdem er sich mit Huni die Position als Top-Laner geteilt, zieht es ihn jetzt nach Europa, wo er sich mit seinen Erfahrungen an die Spitze kämpfen will.","es_ES":"Junhyung \"Profit\" Kim se une a la LCS EU tras pasar un año jugando en el mejor equipo del mundo: SK telecom T1. Después de un tiempo compartiendo rol con Huni en la calle superior, Profit ha decidido trasladarse a Europa con intención de usar lo que ha aprendido para arrasar en la competición","fr_FR":"Junhyung « Profit » Kim a rejoint les LCS EU suite à une année passée avec la meilleure équipe du monde : SK Telecom T1. Après avoir partagé la voie du haut avec Huni, Profit arrive en Europe déterminé à utiliser ce qu'il a appris pour dominer la compétition","pl_PL":"Junhyung „Profit” Kim dołącza do EU LCS po roku gry dla najlepszej drużyny na świecie: SK Telecom T1. Po rozstaniu z Hunim na górnej alei Profit wybiera się do Europy, chcąc wykorzystać to, czego się nauczył, by zdominować konkurencję."},"foreignIds":{"ESPORTSTMNT06":"200000353","TRLH3":"200000304","TRLH4":"200000404"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1721,"slug":"whiteknight","name":"Whiteknight","firstName":"Matti","lastName":"Sormunen","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/whiteknight-584o692r.png","hometown":null,"region":"EU Challenger Series","birthdate":"1996-02-16","createdAt":"2017-01-19T13:21:22.000Z","updatedAt":"2017-06-18T19:15:07.000Z","bios":{},"foreignIds":{"esportstmnt05":"200000891","TRLH3":"200000285","TRLH4":"200000337","ESPORTSTMNT02":"200002380"},"socialNetworks":{},"champions":[],"liveGameTeam":335},{"id":1773,"slug":"pridestalker","name":"Pridestalker","firstName":"Milo","lastName":"Wehnes","roleSlug":"jungle","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/pridestalker-8uu0bza1.png","hometown":null,"region":"EU Challenger Series","birthdate":null,"createdAt":"2017-02-12T02:10:45.000Z","updatedAt":"2017-06-09T10:58:44.000Z","bios":{"en_US":"<p>Milo \"Pridestalker\" Wehnes is the young jungler for ROCCAT. After helping Misfits Academy qualify for the EU LCS, he joins ROCCAT hoping o make a splash in his rookie split. Just like his namesake, he'll be looking to hunt down his opponents and collect plenty of trophies on his way to victory.</p>"},"foreignIds":{"ESPORTSTMNT02":"200001126","TRLH3":"200000284","TRLH4":"200000336"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1912,"slug":"edinpriqtel","name":"EdinPriqtel","firstName":"Dimitar ","lastName":"Piskov","roleSlug":"support","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/edinpriqtel-8rwxy8j8.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:31:59.000Z","updatedAt":"2017-05-31T21:28:47.000Z","bios":{},"foreignIds":{"TRLH3":"200000303","TRLH4":"200000403"},"socialNetworks":{},"champions":[],"liveGameTeam":28},{"id":1913,"slug":"m1rage","name":"M1RAGE","firstName":"Noh Hoon","lastName":"Kwon","roleSlug":"toplane","photoUrl":"https://lolstatic-a.akamaihd.net/esports-assets/production/player/m1rage-ij32gh00.png","hometown":null,"region":"EU LCS","birthdate":null,"createdAt":"2017-05-26T21:48:55.000Z","updatedAt":"2017-05-31T21:33:31.000Z","bios":{},"foreignIds":{"TRLH3":"200000307","TRLH4":"200000407"},"socialNetworks":{},"champions":[],"liveGameTeam":335}],"scheduleItems":[{"id":"AVxHBnHQQMQFcjhwbQ3s","content":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:match:eea8e5f3-d4d8-4737-b94a-1393451fde94","scheduledTime":"2017-06-17T15:00:00.528+0000","tags":{"blockLabel":"3","blockPrefix":"week","subBlockLabel":"3","stageLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:bracket:0ddf2103-0c77-4b59-bec7-7d6599c776b9","leagueLabel":"urn:rg:lolesports:global:league:league:3","tournamentLabel":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169"},"match":"eea8e5f3-d4d8-4737-b94a-1393451fde94","tournament":"0768caf5-a948-4e3c-bf9e-72e480e00169","bracket":"0ddf2103-0c77-4b59-bec7-7d6599c776b9","league":"3"}],"gameIdMappings":[{"id":"8f45f1a5-8313-4884-817c-b2539b496f5b","gameHash":"b3f218ae7317d3f7"},{"id":"715d9c52-9abe-495c-8f7e-c228fb6d2670","gameHash":"fd4256e2792936c3"}],"videos":[{"id":7377,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:8f45f1a5-8313-4884-817c-b2539b496f5b","source":"https://www.youtube.com/embed/y8iJGsCEd0Q?wmode=transparent&rel=0","createdAt":"2017-06-17T20:54:14.000Z","updatedAt":"2017-06-17T20:54:14.000Z","game":"8f45f1a5-8313-4884-817c-b2539b496f5b"},{"id":7395,"slug":null,"label":null,"locale":"en","reference":"urn:rg:lolesports:global:highlander:tournament:0768caf5-a948-4e3c-bf9e-72e480e00169:game:715d9c52-9abe-495c-8f7e-c228fb6d2670","source":"https://www.youtube.com/embed/m25CYgVPAoA?wmode=transparent&rel=0","createdAt":"2017-06-18T09:00:22.000Z","updatedAt":"2017-06-18T09:00:22.000Z","game":"715d9c52-9abe-495c-8f7e-c228fb6d2670"}],"htmlBlocks":[],"match":{"id":"eea8e5f3-d4d8-4737-b94a-1393451fde94","name":"NIP-vs-ROC","position":7,"state":"resolved","groupPosition":0,"gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"games":{"8f45f1a5-8313-4884-817c-b2539b496f5b":{"id":"8f45f1a5-8313-4884-817c-b2539b496f5b","name":"G1","generatedName":"NIP|ROC|G1|eea8e5f3d4d84737b94","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"standings":{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497733253842,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497715276594,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120120","gameRealm":"TRLH3","platformId":"TRLH3:1002120120","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"715d9c52-9abe-495c-8f7e-c228fb6d2670":{"id":"715d9c52-9abe-495c-8f7e-c228fb6d2670","name":"G2","generatedName":"NIP|ROC|G2|eea8e5f3d4d84737b94","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"},{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}],"standings":{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497776726572,"source":"manual","note":"Updated from HQ2","history":[{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497718795818,"source":"manual","note":"Updated from HQ2","closed":true}],"closed":true},"scores":{},"gameId":"1002120131","gameRealm":"TRLH3","platformId":"TRLH3:1002120131","revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}},"0e39f651-0efa-4c41-8bb2-f8ae78c1d88e":{"id":"0e39f651-0efa-4c41-8bb2-f8ae78c1d88e","name":"G3","generatedName":"NIP|ROC|G3|eea8e5f3d4d84737b94","gameMode":{"identifier":"lol:classic","requiredPlayers":5,"mapName":"summoner_rift"},"input":[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"},{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],"scores":{},"revision":1,"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]}}},"standings":{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497776726572,"source":"bestOf","history":[{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497733253843,"source":"bestOf","closed":true},{"result":[[{"roster":"f7aa5e2f-7241-45ce-be56-4f324d15a566"}],[{"roster":"f55a8ea5-4393-4796-9cda-7e1de955c547"}]],"timestamp":1497718795818,"source":"bestOf","closed":true}],"closed":true},"remadeGames":[],"roles":{"owner":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}],"creator":[{"origin":"BEARER_TOKEN","region":"global","summonerName":"test-user","summonerLevel":0,"profileIconId":0,"admin":true}]},"scoring":{"identifier":"standard","options":{"points":[1,0]}},"scores":{"f55a8ea5-4393-4796-9cda-7e1de955c547":0,"f7aa5e2f-7241-45ce-be56-4f324d15a566":1}}}